{
  "showId": "fiddler-on-the-roof-2015",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/fiddler-on-the-roof-review-revival-worth-the-wait-1.11244332",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/fiddler-on-the-roof-review-revival-worth-the-wait-1.11244332",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "Updated December 18, 2015 4:03 PM\n By Linda Winer linda.winer@newsday.com\n\nadvertisement | advertise on newsday\n\nWHERE Broadway Theatre, 1681 Broadway\n\nINFO $35-$167; 212-239-6200; fiddlermusical.com\n\nBOTTOM LINE Worthy, timely “Fiddler,” if not a stunner.\n\nThe moment comes, felt perhaps more deeply than ever, at the end of “Fiddler on the Roof. ”Although this beloved workhorse of a masterwork needs little justification for another Broadway revival, the image of those fleeing refugees — Tevye, Golde, the people immortalized in musical theater from the shtetl called Anatevka — cannot help but flash forward to the forced emigrations of today.\n\nThis is the 50th anniversary production of the unlikely 1964 smash about pogroms in 1905. And, though the opening arrives more than a year late for the birthday, in most ways that matter, director Bartlett Sher’s revival is well worth the wait.\n\nBroadway has seen more visually beautiful stagings of “Fiddler,” and there definitely have been funnier ones. But Sher and his creative team from the magnificent “South Pacific” and “The King and I” achieve a dramatic coherence that appreciates the musical’s showbiz qualities but honors the authenticity of its humanity.\n\nIn perfect sync with that balancing act is Danny Burstein’s portrayal of Tevye, the philosopher milkman first defined by the fabulously eccentric Zero Mostel and reconsidered in countless variations. Burstein, heretofore a star only to New York theater lovers, embodies a gentle, sweet yet powerful, profoundly likable man whose debates with God have the bemused inevitability of truth. Burstein also sings the role better than any Tevye in my experience.\n\nJessica Hecht goes outside the comfortable conventions with an elegant Golde who doesn’t holler, and the entire cast is impressive.\n\nWhat the production does not have, surprisingly, is the stunning originality that made Sher’s other big revivals singular. Michael Yeargan’s minimalist sets — painted flats of cottages that rise and fall and hover — lack character and seem old-fashioned.\n\nCatherine Zuber’s pretty costumes look like opera-house peasant garb, not clothes that real people would have worn. Worse, much worse, is the busy, wiggly-armed, contorted dances by Israeli choreographer Hofesh Shechter. We know “Fiddler” is about the necessity, at times, to be flexible with tradition. But you have to be better than this to get flexible with Jerome Robbins.\n\nadvertisement | advertise on newsday\n\nJoseph Stein’s book adapts Sholem Aleichem stories with a mix of the sacred and the delightfully ordinary. Jerry Bock’s music, with its stirring suggestions of ancient modalities, and Sheldon Harnick’s lyrics — “Sunrise, Sunset,” “Tradition,” the hushed “Anatevka” — linger in the cultural psyche with the inevitability of myth. Sher has Burstein frame the show as a modern tourist reading the stories while visiting the deserted town. The device doesn’t hurt, but this wonderful show is universal and relevant on its own.\n\nComing soon: Newsday's Entertainment newsletter, for the latest on celebs, TV, more.\n\nNewsday.com now uses Facebook for our comment boards. Please read our guidelines and connect your Facebook account to comment.",
  "isFullReview": true,
  "textWordCount": 493,
  "archivePath": "data/archives/reviews/fiddler-on-the-roof-2015/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:50:26.704Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20151223223209",
  "archiveOrgUrl": "http://web.archive.org/web/20151223223209/http://www.newsday.com:80/entertainment/theater/fiddler-on-the-roof-review-revival-worth-the-wait-1.11244332",
  "contentTier": "complete",
  "wordCount": 493,
  "tierReason": "Full review text",
  "bwwExcerpt": "In perfect sync with that balancing act is Danny Burstein's portrayal of Tevye, the philosopher milkman first defined by the fabulously eccentric Zero Mostel and reconsidered in countless variations. Burstein, heretofore a star only to New York theater lovers, embodies a gentle, sweet yet powerful, profoundly likable man whose debates with God have the bemused inevitability of truth. Burstein also sings the role better than any Tevye in my experience.",
  "bwwScore": 9
}
