{
  "showId": "fiddler-on-the-roof-2015",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2015/12/21/theater/review-a-fiddler-on-the-roof-revival-with-an-echo-of-modernity.html",
  "playbillVerdictUrl": "http://www.nytimes.com/2015/12/21/theater/review-a-fiddler-on-the-roof-revival-with-an-echo-of-modernity.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup",
    "bww-reviews"
  ],
  "bwwExcerpt": "Mr. Burstein unleashes his rich baritone with roof-raising force when Tevye's emotion is at its height, bringing home the character's indomitable will, often hidden beneath his self-deprecating humor and sorely tried by his rebellious daughters. Mr. Burstein's way with a classic Jewish joke is assured but unforced, his performance affecting but not overscaled, in keeping with the production's emphasis on the musical's emotional underpinnings, rather than the frosting of shticky comedy.",
  "bwwScore": 10,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-LChaim-Danny-Burstein-Leads-FIDDLER-ON-THE-ROOF-Revival--Updating-Live-20151220",
  "fullText": "https://www.nytimes.com/2015/12/21/theater/review-a-fiddler-on-the-roof-revival-with-an-echo-of-modernity.htmlShare full article86Advertisement\n\nThe sorry state of the world gives us new reason to appreciate the depth of feeling so powerfully, so ingeniously embedded in “Fiddler on the Roof,” the much-loved and much-revived 1964 musical comedy that has returned to Broadway at a time when its story of the gradual disintegration of a family, and a community, strikes home with unusual force.\n\nThe superb new production, which opened on Sunday at the Broadway Theater, certainly honors the show’s ebullience of spirit, as embodied in the central character of the Jewish milkman Tevye, living in a Russian shtetl in the early 20th century, eternally wagging his tongue, shaking his fist and cracking wise at an indifferent God.\n\nBut as directed by Bartlett Sher with his customary sensitivity (“The King and I,” “South Pacific”), this multihued staging moves to a heart-stopping conclusion. It’s impossible to watch the people of Tevye’s town, Anatevka, marching toward their unknown destinies in the shadow of a threatened pogrom without thinking of the thousands of families fleeing violence in the Middle East and elsewhere today.\n\nOy! Enough philosophizing, as Tevye might say with a shrug. It’s just a musical, no? Yes, but what a musical. The score, by Jerry Bock (music) and Sheldon Harnick (lyrics), enters your bloodstream, indelibly, upon a single hearing, so rousing are its songs of celebration, so beautiful the melodies of its songs of love and loss — two sides, for Tevye, of the same coin. And Joseph Stein’s book miraculously blends borscht belt humor (he was an alumnus of the fabled writing staff of “Your Show of Shows”) with a moving depiction of Tevye’s conflicted heart and the suffering of the Jews under Russian imperialism.\n\nThe role of Tevye, originated by the great comic actor Zero Mostel, is here undertaken by Danny Burstein, a Broadway veteran and five-time Tony nominee. Mr. Burstein unleashes his rich baritone with roof-raising force when Tevye’s emotion is at its height, bringing home the character’s indomitable will, often hidden beneath his self-deprecating humor and sorely tried by his rebellious daughters. Mr. Burstein’s way with a classic Jewish joke is assured but unforced, his performance affecting but not overscaled, in keeping with the production’s emphasis on the musical’s emotional underpinnings, rather than the frosting of shticky comedy. (In this it resembles the movie, one of the rare first-rate translations of a musical to film; the most recent Broadway revival, in 2004, starring Alfred Molina, attempted less felicitously to achieve the same ends, and was accused by some of being too genteel, and for that matter, too gentile.)\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 453,
  "archivePath": "data/archives/reviews/fiddler-on-the-roof-2015/nytimes--unknown_2026-02-06.html",
  "textFetchedAt": "2026-02-06T05:40:16.210Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "connect ECONNREFUSED 207.241.237.3:80"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 453,
  "tierReason": "Full review text"
}