{
  "showId": "of-mice-and-men-2014",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/of-mice-and-men-review-james-franco-chris-o-dowd-shine-1.7715164",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/of-mice-and-men-review-james-franco-chris-o-dowd-shine-1.7715164",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "4/18/14 Closed due to road construction on Seaford-Oyster Bay Expwy/Rt-135 SB between Hempstead Tpk/NY Rt-24/X7 and Merrick Rd/X1 in Nassau\n\nClosed due to road construction on Seaford-Oyster Bay Expwy/Rt-135 SB between Hempstead Tpk/NY Rt-24/X7 and Merrick Rd/X1 in Nassau\n\n4/18/14 In Nassau road construction. two lanes closed on The Nassau Expwy (Nassau County) SB at Atlantic Beach Brg\n\nIn Nassau road construction. two lanes closed on The Nassau Expwy (Nassau County) SB at Atlantic Beach Brg\n\n38&deg;\n Hi 59&deg; Lo 39&deg;\n Clear\n\nHumidity: 86%\n Wind: WSW 5 mph\n Barometer: 30.25 Hg\n\nFull forecast\n Hour-by-hour\n Local map\n\nis streaming some of our favorite TV shows filmed on Long Island on Netflix.\n\nOriginally published: April 15, 2014 5:21 PM\n Updated: April 16, 2014 2:16 PM\n \n By LINDA WINER\n linda.winer@newsday.com\n\nJames Franco, left, and Chris O'Dowd in John Steinbeck's classic \"Of Mice and Men.\" (Credit: Richard Phibbs)\n\nThe inevitable headline is that James Franco -- who seems determined to do everything and be everywhere without breaking a sweat -- is making his Broadway debut in John Steinbeck's 1937 \"Of Mice and Men.\"\n\nBut the real news is that Franco is just one fine element in this straightforward powerhouse of a revival, directed by Anna D. Shapiro with inspiring trust in the impact of classic storytelling.\n\nProductions of the old-fashioned Depression-era drama are rare enough to make this a risky choice for Franco and Chris O'Dowd, the Irish stage actor best known in America for such comic mass movies as \"Bridesmaids.\" What's more, Franco plays George, basically the straight man to O'Dowd's flashier role of Lennie, the slow-witted gentle giant who likes to pet soft things a bit too hard.\n\nSteinbeck wrote his own stage adaptation of his novella, better known from school curricula and at least three movies -- including the 1992 remake starring Gary Sinise and John Malkovich. Part buddy tragedy, the plot is a hard lesson about our need to make hopeful plans, and retell them in comforting stories, in the least hopeful times.\n\nGeorge and Lennie are migrant ranch hands in the Salinas Valley. There isn't much nuance in George, the drifter, except for his loyalty to a friend whose lack of impulse control keeps running them out of towns. Franco has an easygoing presence and a dark, cranky, cowboy voice and, except perhaps for overly manicured facial hair, never suggests he might be smarter or hipper than his character.\n\nO'Dowd's Lennie is a big, childlike mouth-breather whose deliberate speech contrasts touchingly with his delicate fingers, which appear to dance -- at times too heavily -- with a mind of their own.\n\nJim Norton has a pathetic majesty as the old farmhand who can't save his old dog but thinks he just might save himself. Leighton Meester (\"Gossip Girl\") brings an impressive core of loneliness alongside her eroticism as the only woman, the wife of the boss' son. Ron Cephas Jones has the repressed fury of the intelligent outsider as the shunned black man.\n\nThe sets by Todd Rosenthal begin and end in a clearing of tall, dried grass. Mountains and heavy clouds leave just a sliver of sunlight in the middle -- symbolic, perhaps, of the dreams that find temporary safety when the men get work in the troubled bunkhouse. No matter how well we know the story, it is hard not to hope that, just maybe, things will turn out better this time. This may be one good definition of a classic.\n\nWHERE Longacre Theatre, 220 W. 48th St.\n\nINFO $37-$147; 212-239-6200; ofmiceandmenonbroadway.com\n\nBOTTOM LINE Franco and O'Dowd in a straightforward powerhouse of a revival.\n\nadvertisement | advertise on newsday\n\nFranco slams critic over 'Of Mice and Men' review\n\n'Walking With the Enemy,' more WWII films hit theaters 4/18/14\n\n22 best new movies streaming on Netflix 4/18/14\n\nadvertisement | advertise on newsday",
  "isFullReview": true,
  "textWordCount": 634,
  "archivePath": "data/archives/reviews/of-mice-and-men-2014/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:35:21.993Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140419072413",
  "archiveOrgUrl": "http://web.archive.org/web/20140419072413/http://www.newsday.com:80/entertainment/theater/of-mice-and-men-review-james-franco-chris-o-dowd-shine-1.7715164",
  "contentTier": "needs-rescrape",
  "wordCount": 634,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-04T10:32:02.595Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: Text begins with traffic/weather reports and navigation content before containing what appears to be a review excerpt, making it primarily non-article content; openai: The review is about a 2014 production of 'Of Mice and Men' starring James Franco and Chris O'Dowd, not the current Broadway run.",
  "promptVersion": "5.2.0",
  "bwwExcerpt": "The inevitable headline is that James Franco...is making his Broadway debut in John Steinbeck's 1937 'Of Mice and Men.' But the real news is that Franco is just one fine element in this straightforward powerhouse of a revival, directed by Anna D. Shapiro with inspiring trust in the impact of classic storytelling...Franco has an easygoing presence and a dark, cranky, cowboy voice and, except perhaps for overly manicured facial hair, never suggests he might be smarter or hipper than his character. O'Dowd's Lennie is a big, childlike mouth-breather whose deliberate speech contrasts touchingly with his delicate fingers, which appear to dance -- at times too heavily -- with a mind of their own...No matter how well we know the story, it is hard not to hope that, just maybe, things will turn out better this time. This may be one good definition of a classic.",
  "bwwScore": 9
}
