{
  "showId": "of-mice-and-men-2014",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "https://www.nydailynews.com/2014/04/16/of-mice-and-men-theater-review/",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/music-arts/mice-men-theater-review-article-1.1757351",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "previousUrl": "http://www.nydailynews.com/entertainment/music-arts/mice-men-theater-review-article-1.1757351",
  "urlDiscoveredAt": "2026-02-04T03:36:32.002Z",
  "urlDiscoveryMethod": "google-serp",
  "fullText": "With his recent frat-boy antics and Renaissance-man boasts, James Franco earns eye rolls. But he deserves an appreciative nod for his Broadway debut in “Of Mice and Men.” The “127 Hours” Oscar nominee and Chris O’Dowd do first-rate work in this stirring revival.\n\nSet in Depression-era California, John Steinbeck’s 1937 American tragedy follows drifters and dreamers on a collision course with life’s cruel reality. Lennie (O’Dowd) has the mind of a child and the strength of an ox — a lethal combination. George (Franco) is his reluctant but dutiful caretaker.\n\nThe buddies land jobs on a ranch and want to save dough to buy their own little spread — rabbits, Lennie’s favorites, included. Cash from Candy (Jim Norton), an elderly hand, puts the dream in reach. If George and Lennie stick to the strategy and avoid hot-headed Curley (Alex Morf) and his flirty wife (Leighton Meester) they’ll be golden. But you know what they say about best-laid plans.\n\nSteinbeck’s story isn’t exactly subtle. Director Anna D. Shapiro (“August: Osage County”) packs shading and meaning into an evocative production in which danger lurks everywhere. “It’s mean here,” says Lennie. And he’s right. The bunkhouse is a tinderbox. In the barn, a steel-jawed gizmo for hefting hay bales looks like it could grab you and tear you apart.\n\nShapiro’s ace cast grips, too, but not terrifyingly. “Gossip Girl” alum and stage newcomer Meester brings out the yearning and sadness of the unnamed wife. Tony winner Norton adds dignity and gravity as sad ol’ Candy, who loses his dog and his hope. Ron Cephas Jones and Jim Parrack impress respectively as Crooks, the lonely black worker, and Slim, the level-headed foreman.\n\nO’Dowd (“Bridesmaids”) is such a likable and endearing actor that he automatically brings goodwill to a role. The Broadway rookie’s thoughtful performance as the loud, clumsy and sweet overgrown child creates a sense of imminent catastrophe.\n\nAs George, who’s torn between protectiveness and outrage, Franco’s confident, straightforward, no-frills performance works just right. He can do a lot with a look. What finally reads on his face is what George and we have known all along: Lennie isn’t George’s anchor — he is his rudder. Neither man has a chance without the other.",
  "isFullReview": true,
  "textWordCount": 370,
  "archivePath": "data/archives/reviews/of-mice-and-men-2014/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:36:32.004Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 370,
  "tierReason": "Full review text"
}