{
  "showId": "of-mice-and-men-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "http://www.nytimes.com/2014/04/17/theater/james-franco-and-chris-odowd-in-of-mice-and-men.html?partner=rss&emc=rss&_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup",
    "playbill-verdict"
  ],
  "bwwExcerpt": "Mr. Franco, Mr. O'Dowd and their director, Anna D. Shapiro ('August: Osage County'), face the daunting task of turning folk heroes as fixed as the heads on Mount Rushmore back into pulsing flesh. This shouldn't be impossible...Yet somehow Ms. Shapiro's handsome, meticulously designed production (featuring impressive Walker Evans-evoking sets by Todd Rosenthal) feels about as fluid as a diorama in a history museum. And its two undeniably talented leading men, though known as quirky and adventurous screen stars, here wear their archetypes like armor...Lennie is a role that is pretty hard to get wrong, if the performer has the right physical dimensions. Mr. O'Dowd gives the expected gentle-giant performance, though he uses his left hand in surprisingly delicate gestures that bring affecting grace notes to Lennie's lumbering presence. Though he sports a Yosemite Sam accent, Mr. Franco is often understated to the point of near invisibility. It's a tight, internal performance begging for a camera's close-up.",
  "bwwScore": 7,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-OF-MICE-AND-MEN-Opens-on-Broadway-Updating-LIVE-20140416",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/04/17/theater/james-franco-and-chris-odowd-in-of-mice-and-men.html?_r=0",
  "fullText": "https://www.nytimes.com/2014/04/17/theater/james-franco-and-chris-odowd-in-of-mice-and-men.htmlShare full articleAdvertisement\n\nSee those two guys sitting up there on the stage — the big, slow feller and his smaller, quicker pal? Don’t you somehow get the feeling they’ve been crouched at that campfire forever? And that you’ve been watching them for just about as long?\n\nSuch responses may bedevil you as you settle in for the respectable, respectful and generally inert revival of John Steinbeck’s “Of Mice and Men,” which opened on Wednesday night at the Longacre Theater, with the film stars James Franco and Chris O’Dowd making their Broadway debuts.\n\nEven if you’ve never seen a previous production of this play — or the movies it inspired, or the 1937 novella they’re based on — you’re likely aware in some corner of your mind of the odd couple at its center, George (Mr. Franco), the feisty dreamer, and Lennie, the childlike Goliath. They’re as planted in our country’s collective imagination as Mutt and Jeff, Laurel and Hardy, Beavis and Butthead.\n\nAlmost from the moment Steinbeck set these itinerant farmhands roaming through the Salinas Valley of California during the Depression, they took on the carved-in-stone stature of national symbols, of something that is us (or U.S.), and bigger than us. No wonder “Of Mice and Men” became an instant staple of high school reading lists, or that its main characters’ irascible, interdependent relationship — first translated to Broadway in 1938 — has been the stuff of parody for almost as long.\n\nThis means that Mr. Franco, Mr. O’Dowd and their director, Anna D. Shapiro (“August: Osage County”), face the daunting task of turning folk heroes as fixed as the heads on Mount Rushmore back into pulsing flesh. This shouldn’t be impossible. After all, actors regularly tackle, and often make us rethink, endlessly interpreted characters like Hamlet, Stanley Kowalski and Willy Loman.\n\nYet somehow Ms. Shapiro’s handsome, meticulously designed production (featuring impressive Walker Evans-evoking sets by Todd Rosenthal) feels about as fluid as a diorama in a history museum. And its two undeniably talented leading men, though known as quirky and adventurous screen stars, here wear their archetypes like armor.",
  "isFullReview": true,
  "textWordCount": 351,
  "archivePath": "data/archives/reviews/of-mice-and-men-2014/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:27:06.278Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 351,
  "tierReason": "Full review text"
}