{
  "showId": "back-to-the-future-2023",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://cititour.com/NYC_Broadway/Back-to-the-Future/1164",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $49\n\t Buy Tickets\n\nCititour.com Review\n    The theatrical equivalent of a BOGO (buy one, get one free) sale, “Back to the Future: The Musical,” the screen-to-stage adaptation of the popular 1985 film now at the Winter Garden Theatre, seems specifically designed to satisfy anyone who wants to visit a theme park attraction and watch a traditional Broadway musical at the same time. And if that’s your aim, the show satisfies as a value proposition – especially if it’s your way of introducing children or teens to musical theater.  \n\nConversely, audience members with more sophisticated tastes – in either arena – will likely wish for something with more craft on both sides of the equation. As a musical, it’s both a bit undercooked (with an instantly forgettable and overloaded score by Alan Silvestri and Glen Ballard) and overblown (with way too many ensemble dances with by-the-numbers choreography by Chris Bailey). As a director, the estimable John Rando is often delegated to simply being little more than a traffic cop.\n\nAdmittedly, I haven’t been to Disney World or Universal in many decades, so the LED lighting that surrounds the proscenium (designed by Tony winners Tim Lutkin and Hugh Vanstone) may, in fact, be state-of-the-art, but it often seemed more distracting than illuminating. Meanwhile, Finn Ross’ video designs, Gareth Owen’s lighting and Chris Fisher’s illusions are admittedly impressive, but don’t really justify the ticket price.\n\nAnd yeah, flying cars are inherently cool, but there’s only a few moments when that now-legendary DeLorean -- which transports hapless teen Marty McFly (Casey Likes, a true star-in-the-making) and eccentric inventor Doc Brown (an ideally cast Roger Bart) between 1985 and 1955 (and back again) -- really delivers those “oohs and aahs” one may have come for.\n\nIndeed, if the show arguably needs some more special effects, what it most needs more of is the very special relationship between Marty and Doc, who are the only “couple” in which Bob Gale’s book has any significant investment. It’s hard to really care – except for Marty’s sake – whether his hapless father George (a very funny Hugh Coles serving up a spot-on impression of his film predecessor Crispin Glover) ever connects with his mother Lorraine (a charming Liana Hunt).\n\nMoreover, Marty’s girlfriend, Jennifer (an appealing Mikaela Sekada) could have easily been excised – as could almost any minor character onstage. The one big exception is Gordie Wilson, played by the scene-stealing Jelani Remy, who tears down the house over and over, especially during the rousing “Gotta Start Somewhere.”\n\nLuckily for us, the aptly named Likes, filling the ginormous shoes of Michael J. Fox, embodies Marty with a great deal of heart, while also perfectly embodying the spirit of a frustrated teenager who’s afraid he’s trapped in a pointless present with little chance of a better future, especially one as a successful musician. \n\nAnd once Doc finally appears (after about 20 minutes!), we realize this pseudo-Einstein is Marty’s spiritual father, a genius inventor whose brain makes up for his own lack of social skills and whose selflessness makes us want to root for him at every turn. Bart gives the role 1000 percent, physically and emotionally, working his butt off trying to elicit laughs – and even a few tears -- from the audience. (He may be ad-libbing just a bit right now; I won’t be shocked if he chucks most of the script in three months). \n\nAs is often true, expectations will play a large part in how you receive this show – one of the most expensive ever put on the Broadway stage. If you’re smart, prepare for “Future” imperfect and you’ll have a good enough time.\n    \t    By Brian Scott Lipton\n\nVisit the Sitehttps://www.backtothefuturemusical.com/CastRoger Bart, Casey Likes, Hugh Coles, Liana Hunt, Jelani Remy, Nathaniel Hackmann, Merritt David Janes, Mikaela Secada, Amber Ardolino, Will Branner, Victoria Byrd, Brendon Chan, Kevin Curtis, Nick Drake, Samuel Gerber, Marc Heitzman, Kimberly Immanuel, Joshua Kenneth Allen Johnson, Hannah Kevitt, JJ Niemann, Becca Petersen, Emma Pittman, Jonalyn Saxer, Blakely Slaybaugh, Gabi Stapula, and Daryl Tofa.Open/Close DatesOpening 8/3/2024Closing Open-ended\nTheatre Info\nWinter Garden Theatre1634 BroadwayNew York, NY 10019\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 744,
  "archivePath": "data/archives/reviews/back-to-the-future-2023/cititour-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T22:34:34.012Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "sourceMethod": "scrapingbee"
}