{
  "showId": "back-to-the-future-2023",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/theater/theater-reviews/back-to-the-future-review-musical-broadway/",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nBack to the Future: The Musical review: The show doesn't quite hit 88 mph on Broadway\nThe show stalls out at times, but not when Roger Bart's Doc Brown is behind the wheel.\n\nDalton Ross is a writer and editor with over 25 years experience covering TV and the entertainment industry. Survivor is kind of his thing.\n\nThere's a moment during the opening song of Back to the Future: The Musical's second act, when Roger Bart's Doc Brown finds himself dancing alongside a flurry of hoofers dressed up in lab coats with mini-brainwave helmets affixed to their heads. With a somewhat perplexed expression on his face, Bart looks out at the audience and mouths the words that any sane person in such a situation would mouth: \"What the f---?\"\n\nIf only there were more \"What the f---?\" moments in this too-faithful musical adaptation of one of the most adored movies ever made. The fact that Back to the Future is so adored is most likely why Bob Gale — who penned the original screenplay and wrote the book for this new stage version playing at Broadway's Winter Garden Theatre — felt compelled to stick so closely to the original script. After all, if you're putting on a Back to the Future production, you're almost obligated to talk about density, and how heavy things are, and how great Scott is. It's like a classic rock band having to play same old hits every night on tour. Gotta give the people what they want… or at least what they know.\n\nThat feeling of intentional déjà vu extends to the production casting as well, where Hugh Coles does a remarkable Crispin Glover impersonation for his George McFly, and Nathaniel Hackmann completely nails Biff's bully-without-a-brain vibe. Both accomplish their mission of ably replicating the characters fans fell in love with, but don't attempt to add their own spin. As Marty's mom, Lorraine, Liana Hunt is also asked to pretty much do exactly what has already been done in the movie by Lea Thompson.\n\nA lot of this BTTF production plays like a faithful cover version of a classic tune, but the problem is that the best cover songs are the ones that actually change arrangements and take risks. Which is what makes Bart's Doc Brown stand out so much. The Broadway veteran and Tony winner somehow achieves the seemingly impossible — taking an iconic role originally brought to life by Christopher Lloyd and making it his own.\n\nBart's performance is no mere facsimile. Instead, the actor hams it up, creating laughs at unexpected moments, whether it is the aforementioned silent cursing, or breaking the fourth wall with the audience, or simply altering the cadence of Doc's well-worn lines with weird pronunciations, inflections, and sound effects. Back to the Future should always be fun, and Bart came to have exactly that.\n\nAs for Bart's partner in time-traveling crime, Casey Likes (who starred earlier this year in another screen-to-stage musical adaption, Almost Famous) has the somewhat unenviable task of filling the beloved shoes of Michael J. Fox as Marty. It's hard to imagine Back to the Future without Fox — just ask Eric Stoltz — and while Likes lacks his predecessor's impeccable comedic timing and delivery, the newbie's affability makes him easy to root for, and he pairs well as the straight man to Bart's lunatic fringe. (He can also really wail on the guitar, as evidenced during \"Johnny B. Goode.\")\n\nWhile Likes and the rest of the cast possess the pipes needed to carry a Broadway musical, the songs themselves are a mixed bag, working best when they comment slyly and poke fun at both the characters and setting. \"Cake\" — performed by the Hill Valley ensemble when Marty first arrives in 1955 —sings the praises of asbestos, DDT, super leaded gasoline, and cigarettes, while \"Teach Him a Lesson\" features Biff hilariously struggling to come up with rhymes and the correct meaning of what he is trying to say as he is constantly corrected by his flunkies.\n\nA few other songs are just plain fun, as when Jelani Remy rocks the house as a pre-mayor Goldie Wilson with his high energy soda pop shop ditty \"Gotta Start Somewhere,\" and Bart celebrates cracking the time travel code with \"It Works.\" But there are also plenty of numbers — written by Alan Silvestri and Glen Ballard — that will be forgotten as easily as Pepsi Free. The show may not need roads where it's going, however it could use some catchier tunes.\n\nBut can we talk about the car? Put simply, the car is awesome. It also serves as the show's biggest not-so-secret weapon. Brought to life through a combination of lights, smoke, video screens, and, yes, fire — the DeLorean brings all of the magic from the screen to the stage, and by the end of the show, audiences will truly believe a car can fly.\n\nUnfortunately, unlike the DeLorean, Back to the Future: The Musical itself never quite hits 88 miles an hour. But while the rest of the production is content to play it safe and steady, give Bart credit for always putting the pedal to the metal. After all, if you're going to throw a time machine onto a Broadway stage, why not do it with some style? Grade: B",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 888,
  "archivePath": "data/archives/reviews/back-to-the-future-2023/ew-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T22:24:39.754Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "sourceMethod": "scrapingbee"
}