{
  "showId": "back-to-the-future-2023",
  "outletId": "exeuntnyc-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://exeuntnyc.com/reviews/review-back-to-the-future-the-musical-at-the-winter-garden-theatre/",
  "publishDate": null,
  "fullText": "1.21 gigawatts of fun in this faithful musical adaptation of the beloved film. Lane Williamson reviews. “Back to the Future: The Musical” at the Winter Garden Theatre (Photo: Matthew Murphy & Evan Zimmerman) I, like many millennial boys, was raised on Back to the Future and its sequels. My parents were often watching them in the background of my toddlerhood and, as I got a little older, they are some of the first examples I can remember of seeing a film and recognizing how awesome the form could be. The contribution of Alan Silvestri’s score cannot be understated. It lives in my blood. Every time I hear it I get a serotonin boost, not only from recalling the movie, but from the incredible theme park ride at Universal Studios that physically and sensationally immersed us in that world. Those rides have long been closed, both in California and Florida, leaving a Back to the Future-sized hole in my heart. Luckily, there’s something new to take its place. The seats may not move, but Back to the Future: The Musical is nearly as transporting. There are lights and video throughout the orchestra level at the Winter Garden, where it has opened on Broadway after nearly two years on the West End. Designer Tim Hatley and his collaborators Finn Ross (video), Tim Lutkin, and Hugh Vanstone (lighting) use these extra metallic side arms to wrap the audience in the characters’ time warp. At its best, it feels as if the whole theatre is traveling at 88mph with Marty McFly. Mostly, though, it’s Silvestri’s score that took me to a place of nostalgic joy. Every time conductor Ted Arthur’s stellar orchestra let the film’s theme soar, I nearly levitated out of my seat. It’s overused to say it, but it’s actually true: that score is iconic. Even when the musical interpolates Chuck Berry’s “Johnny B. Goode” or Huey Lewis’ “The Power of Love” from the film, they don’t bring the same overwhelming pleasure of Silvestri’s instrumental motifs. As for the new songs–you know, the ones the characters actually sing–they, too, are composed by Silvestri, with lyrics by Glen Ballard, but are mostly forgettable. Occasionally, a fragment will jump out (one of Mary’s girlfriend, Jennifer’s, verses in “Wherever We’re Going”, a couple lines of Marty’s solos), but the germ of a jam is quickly replaced by generic Broadway-pop-rock. When these moments happened, I wanted to beg the songs to go back and live in those grooves, to expand those ideas out. Unfortunately, they don’t. When many of the songs are reprised in Act II, it’s just a reminder of how skippable they were in the first place. It doesn’t make for a good musical, but it is a good show. John Rando’s direction strikes a tone somewhere between tongue-in-cheek and tongue-out-of-mouth. The book by Bob Gale hews closely to his screenplay (co-written with the film’s director Robert Zemeckis) and Rando’s production likewise mimics the film’s visuals. Marty’s red vest and Doc Brown’s fright wig both make the jump, as does the JCPenney backdrop to Marty’s departure. Hugh Coles, as George McFly, elicited shrieks of delight from the audience in his first scene, not from anything other than aping Crispin Glover so exactly. The production seems to take its title literally–this is the film Back to the Future musicalized and it does exactly what it says. In a few examples, though, the show does reach toward something more than that. Roger Bart originated Doc Brown in the UK and brings his performance stateside with an entirely new company (Coles excepted). The result is that everyone else feels fresh in their delivery, like they’ve just worked it out. Bart, conversely, is completely relaxed, even when Doc is agitated. It’s an assured performance, one that skirts Christopher Lloyd as much as it can without rewriting the dynamic between characters. Bart’s comfortability pays off most when he sings the one quiet moment in the entire show, a plaintive toast “For the Dreamers” in Act II, explaining why he keeps inventing. He gets to stop and say something serious for a second and Bart’s entire performance coalesces there. We understand that this is an actual person, with feelings, for the first time. Bart and Casey Likes, as Marty, have excellent chemistry and have found little moments to let their different energies bounce off one another. Likes continues to demonstrate an electric presence on stage. He confidently holds the center of the show and sings and dances with great skill. Chris Bailey’s choreography is an absolute blast. It gives color and dimension to the songs, especially since they’re less than interesting on their own. Bailey and the ensemble make the Winter Garden’s width feel full and alive. With so many technological tricks up Back to the Future’s sleeve, something so simple as Bailey’s dynamic human movement often steals the show. And then there’s the car. Maybe even more than Michael J. Fox, the DMC DeLorean is the star of the film and in an eleventh hour turn (you’ll get that pun when you see it), it becomes the star of the musical, too. Rando and team, including the illusion designer Chris Fisher, create an exhilarating final sequence that had us all jumping out of our chairs. If you love Back to the Future the film, Back to the Future: The Musical will give you everything you’ve dreamed of. Lane Williamson is co-editor of Exeunt and a former contributing critic at The Stage. He is a member of the Drama Desk and Outer Critics Circle. Read more articles by Lane Williamson",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 930,
  "archivePath": "data/archives/reviews/back-to-the-future-2023/exeuntnyc-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T22:35:34.780Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}