{
  "showId": "back-to-the-future-2023",
  "outletId": "NYSR",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2023/08/03/back-to-the-future-the-musical-broadway-review-suskin/",
  "publishDate": "August 3, 2023",
  "fullText": "The page you are looking for no longer exists. Perhaps you can return back to the homepage and see if you can find what you are looking for. Or, you can try finding it by using the search form below. ★★★★☆ Playwright Simon Stephens and tech wizards concoct the world’s first mixed reality play ★★★☆☆ Ian McKellen is among the performers appearing virtually in this one-act play by Simon Stephens ★★★☆☆ Erica Schmidt’s world premiere dramedy skewers a self-absorbed filmmaker and the people who love him ★★★☆☆ Hamish Linklater, Miriam Silverman, and Dylan Baker are among the stars of Erica Schmidt's world premiere play riffing on show business and marriage ★★★★☆ A new production of the Tony-nominated musical comedy goes to the head of the class ★★★★☆ Lesley Manville and Mark Strong have disturbingly good chemistry as theater’s most famous twice-related couple ★★★★★ Laurie Metcalf and Micah Stock star in Samuel D. Hunter's acclaimed drama, previously seen at Steppenwolf Theatre Company ★★★★★ Bess Wohl takes inspiration from her mother’s life for her clever, decade-jumping memory play ★★★★★ Joshua Henry gives what’s destined to be a Tony-winning performance in this much-needed revival ★★★★☆ Jonathan Groff gives a once-in-a-lifetime performance as the Grammy-winning “Beyond the Sea” singer Copyright © 2026 • New York Stage Review • .",
  "isFullReview": false,
  "showScoreExcerpt": null,
  "bwwExcerpt": "Flying DeLorean deserves the waves of applause; score gets by",
  "originalScore": "4 stars",
  "assignedScore": 68,
  "source": "bww-roundup",
  "textStatus": "partial",
  "textWordCount": 215,
  "archivePath": "data/archives/reviews/back-to-the-future-2023/nysr--steven-suskin_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:11:18.900Z",
  "textIssues": [
    "Word count too low: 215 (min: 300)"
  ],
  "textQuality": "partial",
  "sourceMethod": "bww-roundup"
}
