{
  "showId": "back-to-the-future-2023",
  "outletId": "queerty-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.queerty.com/a-creative-flat-tire-sends-broadways-back-to-the-future-skidding-off-course-20230803",
  "publishDate": null,
  "fullText": "Search for:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFacebook\n\n\nTwitter\n\n\nInstagram\n\n\nTikTok\n\n\nThreads\n\n\nYouTube\n \n\n\n\n\n\n\n\n\n\n\nRoger Bart, left, and Casey Likes in &#8216;Back to the Future.&#8217; Photo by Matthew Zimmerman\nThe Rundown\n“Great Scott!” Another movie-to-musical adaptation skids onto Broadway, this time drawing inspiration imitation from the 1985 film Back to the Future starring Michael J. Fox as Marty McFly and Christopher Lloyd as Dr. Emmett Brown. The eccentric inventor&#8217;s DeLorean DMC-12 time machine transports the high schooler 30 years into the past to save Doc from plutonium poisoning, facilitate his parents’ marriage, and ultimately, preserve his very existence.\n\nThe original film grossed more than $383 million worldwide and spawned two sequels. It has remained a Gen X favorite over the years, creating a potentially prime audience for theatergoers looking for family-friendly entertainment.\n\nMuch like Rocky, its 2014 predecessor at the Winter Garden Theatre, Back to the Future gambles on name recognition and nostalgia but forgoes the basic mechanics of a successful musical: a coherent book and catchy score.\n\nBased on a 2010 concept album by David Byrne and Fatboy Slim, the immersive show co-stars &#8216;Fire Island&#8216; hottie Conrad Ricamora.\n\nWriter Bob Gale, who co-wrote the original film script with Robert Zemeckis, returns to adapt Back to the Future to the stage. While the premise still delivers high stakes — a ticking clock and the potentially catastrophic outcomes when history is rewritten — Alan Silverstri and Glen Ballard’s score hits so many potholes that even NASCAR racer Zach Herrin wouldn’t be able to course correct.\n\nDelivering Michael J. Fox light, 21-year-old Casey Likes lives up to his name. The affable young actor (who starred in last season’s Almost Famous, which closed after 77 performances) kicks it into high gear but can’t surmount a musical running on fumes.\n\nLikes is most successful in scenes with Doc, played with a wink and a nod by Broadway veteran Roger Bart. Less compelling are the moments with Marty’s dad George (an overzealous, loose-limbed Hugh Coles reprising his role from the London production), and girlfriend, Lorraine (Liana Hunt), who must have failed chemistry because there isn&#8217;t any here.\n\nBart, who won a Tony Award for playing Snoopy in You’re a Good Man, Charlie Brown and originated the flamboyantly fabulous role of Carmen Gia in The Producers, proves once again that he’s a master of comedic timing, but the mechanical bits occasionally feel as though he has one foot out the door. The foot left behind is often planted center stage while the hard-working ensemble scurries about in Tim Hatley’s century-spanning costume designs, performing pointless production numbers choreographed by Chris Bailey.\n\nThe Winter Garden’s 18-year tenant, Cats (soon to return Off-Broadway and set in New York City’s legendary ballroom scene), featured Grizabella the Glamour Cat perched atop an oversized tire that rises toward the Heaviside Layer. Back to the Future ups the ante by flying the retro-fitted DeLorean over the audience in a fantastic feat of theatrical engineering.\n\nBroadway audiences have seen flying carpets (Aladdin), glass elevators (Charlie and the Chocolate Factory), witches (Wicked), and even other cars (Chitty Chitty Bang Bang) hover above. Hatley, also credited for scenic design, goes next level with a finale that might deliver even more wow factor if it appeared at the end of an hour-long theme park show at Universal Studios.\n\nCombined with Finn Ross’s video design and lighting by Tim Lutkin and Hugh Vanstone, Back to the Future delivers on the rumored $23.5 million price tag, but the technological flourishes can’t jump-start a show with a dead battery.\n\nIn an interview with the New York Times, writer Gale said, “It cannot be a slavish adaptation of the movie. Because if that’s what people want to see, they should stay home and watch the movie. Let’s use the theater for what theater can do.”\n\nBack to the Future delivers on the thrill of spectacle, sure, but flies through the traffic light when it comes to the other elements that keep audiences coming back to the theater: namely relationships. “We just kept trying to find our way,” Silvestri said. “It’s calling for a song here. It’s demanding music there.”\n\nUnfortunately, the creative team got lost along the way — a reminder that Back to the Future may be best left in the past.\n\nBack to the Future plays on Broadway at the Winter Garden Theatre.\n\nWe can't rely on mainstream media to tell our stories. That's why we don't lock Queerty articles behind a paywall. Will you support our mission with a contribution today?\n\nCancel anytime &middot; Proudly LGBTQ+ owned and operated\n\nI love Roger Bart and I wish the show the best, but, do we really need to turn every movie from the &#8217;80s and &#8217;90s into a musical? Especially when it seems the entire point of this show is one special effect.\n\nSkip it and see Shucked instead.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 803,
  "archivePath": "data/archives/reviews/back-to-the-future-2023/queerty-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T22:39:09.925Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240803102529",
  "archiveOrgUrl": "http://web.archive.org/web/20240803102529/https://www.queerty.com/a-creative-flat-tire-sends-broadways-back-to-the-future-skidding-off-course-20230803"
}