{
  "showId": "back-to-the-future-2023",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.theaterscene.net/musicals/broadway/back-to-the-future-the-musical/victor-gluck/",
  "publishDate": null,
  "fullText": "Posted on August 16, 2023 by Victor Gluck, Editor-in-Chief in Broadway, Musicals Roger Bart as Doc Brown and Casey Likes as Marty McFly in a scene from “Back to the Future: The Musical” at the Winter Garden Theatre (Photo credit: Matthew Murphy and Evan Zimmerman) [avatar user=”Victor Gluck” size=”96″ align=”left”] Victor Gluck, Editor-in-Chief[/avatar] Back to the Future: The Musical, the time travel adventure, joins a long line of problematic screen to stage musicalizations which do not improve on the originals in any way. Joining the list that includes in recent memory Pretty Woman, King Kong, Tootsie, Mrs. Doubtfire and Almost Famous, Back to the Future, using one of the original movie’s co-writers (Bob Gale without Robert Zemeckis), attempts to transplant the film in toto to the stage of the Winter Garden Theatre without adding anything new to the mix other than having the characters sing and dance. If theater is meant to surprise us, then like the stage version of Almost Famous, Back to the Future slavishly follows its source material so that we feel like we have seen it all before – and better. Of course, there is the fun of seeing Doc Brown’s famous souped-up DeLorean car on stage and up close but it is not until the very last scene that it levitates and flies over the front of the audience. And Tim Hatley’s impressively technological set design becomes tiresome after a while almost literally copying the film scenes and adding futuristic elements that don’t work. John Rando’s direction turns the show into an innocuous episode of Happy Days, a fantasy version of the 1950’s that sends up the material rather than does homage to it. Daryl Tofa as Slick, Nathaniel Hackmann as Biff Tannen, Will Branner as 3D, Casey Likes as Marty McFly and Hugh Coles as George McFly in a scene from “Back to the Future: The Musical” at the Winter Garden Theatre (Photo credit: Matthew Murphy and Evan Zimmerman) The new songs by Alan Silvestri (who wrote the famous background music for the original film trilogy) and Glen Ballard, his collaborator on the scores for Zemeckis’ The Polar Express and Disney’s live action version of Pinocchio, stop the show in its tracks as they do not forward the action but tells us what we already know in rather trite and repetitive fashion. The rhymes are simplistic rather than clever and several of the titles have been used before in earlier, more effective songs. Like Andrew Lloyd Webber’s musicalization of School of Rock it uses much better classic songs from the movie (“Earth Angel,” “Johnny B. Goode,” “The Power of Love” and “Back in Time”) which only point out the superficiality of the new songs in recreating the period. As directed by Rando and choreographed by Chris Bailey, except for a few sweet ballads, the songs are staged in so presentational a manner turning them all into production numbers that the show is exhausting without much payoff. Victoria Byrd, Jonalyn Saxer and Becca Petersen as the Pretty Baby Trio (top row) and Casey Likes as Marty McFly and Liana Hunt as Lorraine Baines (bottom row) in a scene from “Back to the Future: The Musical” at the Winter Garden Theatre (Photo credit: Matthew Murphy and Evan Zimmerman) The plot is extremely faithful to the movie, except for two minor changes that would be difficult to recreate on stage: hero Marty McFly falls out of a tree in front of his grandfather’s house rather than getting hit by his car, and Doc Brown is overcome by radiation poisoning rather than being gunned down by Libyan terrorists. Marty, a 17-year-old high school senior, lives with his passive and timid father George who is bullied by his supervisor Biff Tannen, his alcoholic and depressed mother Lorraine, and unambitious siblings Linda and Dave in the town of Hill Valley, California, in 1985. After his band fails in a music audition at the high school, Marty confides to his girlfriend Jennifer that he is afraid he will end up like his father and never make anything of himself. Meeting his friend the eccentric inventor Doc Brown at 1:15 AM, Marty discovers that he has invented a time machine using a modified DeLorean and a flux capacitor of his own invention. When Doc passes out from radiation poisoning from the Plutonium he has been using to power the car, Marty attempts to get help at the local hospital but instead the time machine takes him back to Hill Valley on November 5, 1955 which is what Doc has set it for. Marty interacts with both his eventual father and mother which will, of course, affect his being born. Seeking out the 30-years-younger Doc Brown in order to get the DeLorean to take him back to 1985, the scientist reminds him that he has to stay hidden so that he doesn’t change any more events that occur but realizes that he has already interfered with his parents’ meeting and first kiss. The plot works out how Marty corrects this interference as well as Doc finding a way to return him to his own time in 1985. Casey Likes as Marty McFly (left of center), Liana Hunt as Lorraine Baines, Hugh Coles as George McFly, Jelani Remy as Marvin Berry and the cast of “Back to the Future: The Musical” at the Winter Garden Theatre (Photo credit: Matthew Murphy and Evan Zimmerman) The cast which looks a great deal like their movie counterparts is led by two members of the London cast: Roger Bart, Tony nominee for The Producers and Tony winner for You’re a Good Man, Charlie Brown, as Doc Brown, and British actor Hugh Coles as Marty’s father, George McFly. The problem is that none of the musical’s actors make us forget the people who played the roles in the film. Bart is satisfactory as Doc Brown but nowhere as crazy as Christopher Lloyd was in the film. Rising star Casey Likes who played the young journalist in the 2022 stage version of Almost Famous has charm as Marty but has none of the swagger that Michael J. Fox brought to the role. As the meek and passive George McFly, Coles is so much like Crispin Glover in the film that he gets tiresome very quickly. In the role of Lorraine, Marty’s mother, who tries to romance him in the flashbacks to 1955, Liana Hunt is rather generic as the horny teenager, never making the role her own. As the bullying Biff Tannen, Nathaniel Hackmann never seems a real threat but is convincing as a hulking presence. Mikaela Secada is rather bland as Marty’s girlfriend Jennifer, just as the role was in the movie. In the dual role of Goldie Wilson, the Black janitor who later runs for mayor, and band leader and musician Marvin Barry, Jelani Remy makes the two roles very different. Amber Ardolino in the dual role of George’s sister Linda and grandmother Stella is rather amusing as two contrasting women. Merritt David Janes proves his versatility as Principal Strickland, café owner Lou Carruthers, Mayor Red Thomas and Marty’s grandfather Sam. Roger Bart as Doc Brown in a scene from “Back to the Future: The Musical” at the Winter Garden Theatre (Photo credit: Matthew Murphy and Evan Zimmerman) The impressive design elements are the work of several people: set designer Hatley, video designer Finn Ross, illusion designer Chris Fisher and lighting designers Tim Lutkin & Hugh Vanstone though the real excitement of the show does not come about until almost the end when Doc Brown is seen climbing up to the roof of the courthouse in order to fix the plug that has come loose on his wiring of the clock. Hatley’s period costumes are fine but are overshadowed by his sets. The propulsive force of the songs which makes them so tiring may be because of the work of orchestrators Ethan Popp & Bryan Crook rather than the composers. Maurice Chan’s fight choreography is much in evidence in the scenes with Biff Tannen who causes most of the mayhem in the plot. Audiences who are satisfied with nothing more than seeing the original movie put on stage may be pleased with the results of this latest film to stage musical. However, those who want to be taken by surprise and offered something new will be vastly disappointed. Back to the Future: The Musical (through January 5, 2025) Winter Garden Theatre, 1634 Broadway at 51st Street, in Manhattan For tickets, call Telecharge at 212-239-6200 or visit http://www.backtothefuturemusical.com Running time: two hours and 35 minutes with one intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1429,
  "archivePath": "data/archives/reviews/back-to-the-future-2023/theaterscene-net--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T22:43:09.130Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}