{
  "showId": "back-to-the-future-2023",
  "outletId": "theaterpizzazz-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theaterpizzazz.com/back-to-the-future-the-musical/",
  "publishDate": null,
  "fullText": "Judging by the explosive opening night reaction at the Winter Garden to the new Broadway musical based on Back to the Future, the popular 1985 sci-fi movie about time travel from that year back to 1955, this show seems off and running for hitdom. No sooner did Casey Likes (Almost Famous), playing Marty McFly, the 17-year-old high school student immortalized by Michael J. Fox, enter the laboratory of nutty inventor Doc Brown’s (Roger Bart, The Producers), than a roar went up that must have lasted a full minute—and this before even a word was spoken.\n\nIt was followed by multiple similar outbursts over the course of the succeeding two hours and 40 minutes: a sign that, regardless of what the critics may say, there’s a prospective audience so enamored of the movie they’re ready to love this musical version regardless not only of its flaws but even of its occasional deviations from the original. Given the show’s $20 million-plus investment, the producers surely breathed a collective sigh of relief. After its 2020 premiere in Manchester, England, London embraced it, awarding it the 2022 Olivier Award for best musical. Only the future can tell if it will reap similar benefits in New York, and you’d need Doc’s DeLorean to find that out.\n\nBack to the Future—with a book by Bob Gale (coauthor, with Robert Zemeckis, of the movie), and a score by Alan Silvestri and Glen Ballard—knows where its bread is buttered and works hard at retaining as much of the film’s ambience as possible. Designer Tim Hatley’s multiple scenic units often replicate the film’s look, as do his costumes, and the leads are cast with actors who not only physically resemble the originals but—apart from Bart’s self-consciously farcical Doc Brown—base their performances on them.\n\nAnd, of course, a convincing replica of the iconic DeLorean automobile that steals much of the film does the same for the show, adding another to Broadway’s gallery of spectacular overhead effects—like the helicopter in Miss Saigon, the superpowered characters in Spider-Man: Turn Off the Dark, and the chandelier in Phantom of the Opera. The penultimate scene, featuring a torrent of video projections (by Finn Ross), lighting tricks (by Tim Lutkin and Hugh Vanstone), and illusions (by Chris Fisher), features the silver, wing-doored car—Marty and Doc inside—actually soaring out high above the lower orchestra rows and doing a side flip before rotating back to its normal position.\n\nSpecial effects feature in much of the action, but, apart from one or two simple passes on a wheeled plank from a soap box in a 1955 scene (you’d have to know the movie to know where it came from), you won’t see Likes’s Marty copying the fancy skateboarding routines Fox performs; on the other hand, when Likes plays Chuck Berry’s “Johnny B. Goode” at the high school dance while reproducing Fox’s Berry-like rock n’ roll moves, it’s actually him strumming the Gibson. For the movie, Fox learned where to place his fingers, but the sound was dubbed by a professional guitarist.\n\nYou also won’t see Doc being shot by Libyan terrorists trying to steal the plutonium he needs to power his time-traveling DeLorean, his apparent demise being caused by radiation. Such alterations don’t alter the essential plot line, set in Hill Valley, CA, about Marty, whose father, George (British actor Hugh Coles, who created the role in England), is a wet noodle of spineless nerdiness, perpetually beaten down by Biff Tannen (Nathaniel Hackmann, Les Misérables), the same Bluto-like goon who bullied him in school and is now his supervisor. Marty, his aspirations as a musician stifled, finds himself going back 30 years in time, where he’s excruciatingly embarrassed to be the object of potentially incestuous affection from the hot-to-trot Lorraine (Liana Hunt, Newsies), his eventual mother, who thinks his name is Calvin Klein (because that’s the name on his purple underwear).\n\nHe proves to the eccentric Doc, his frizzy hair an Einstein-like birds nest, that his time-travel invention works; defeats—implausibly, but who cares—the musclebound Biff; struggles to prevent doing anything to change the course of history; helps George go from feckless victim to Lorraine’s romantic hero; and, via a complex strategy involving an expected lightning bolt, manages to power the DeLorean back to the future—and his girlfriend Jennifer (Mikaela Secada)—of 1985. At each familiar plot milestone, especially when the nasty villain is overthrown, the audience goes bananas.\n\nThe show moves quickly under John Rando’s (Urinetown) often overheated, not particularly inventive, and sometimes tasteless direction (Marty gets far more aroused by Lorraine than in the film). Its incident-filled plot is tied together by 17 largely generic new songs, too few of which make any impact. Chris Bailey’s lively choreography offers little we haven’t seen before, and one discardable number, “21st Century,” with the high-kicking chorus in tuxes and high hats, seems to belong to another show. It’s a shame that only a few numbers are mid-50s pastiches with Grease-like melodies and rhythms, like the doo-wop “Pretty Baby,” sung by Lorraine and a trio of girls; these capture the era much better than most of the others. One of the few showstoppers is “Gotta Start Somewhere,” memorably performed by the golden-voiced Goldie Wilson (Jelani Remy, Ain’t Too Proud), an ambitious Black youth who works in the local luncheonette and, taking a hint from Marty, is inspired to become mayor (which, three decades later, he does).\n\nAs in the movie, we also hear a real period song, the still great “Earth Angel,” at the school dance, as well as the aforesaid “Johnny B. Goode,” even though 1955 was three years before it was born; thus the shock it produces among its listeners at the school dance. “The Power of Love,” sung on the soundtrack by Huey Lewis and the News, is introduced at the end as a song for Marty and his band, The Pinheads, to perform. Lewis himself turned up for opening night’s post-curtain call onstage celebration.\n\nIf you recall the souped-up screen performances, imagine them bursting with steroids on the stage. Likes, a talented, personable singer, lacks Michael J. Fox’s charm but is otherwise fine as Marty. Bart takes the exaggerated role of Doc Brown and exaggerates it even further with a ton of ain’t I funny shtick, exploiting every opportunity to play to the crowd with winking directness. Coles’s spindly George couldn’t be more cartoonishly shy and awkward, sometimes suggesting the rubbery presence of a young Jim Carrey. Among the other well-cast players, Hackmann’s Biff is perfection, but the character is so crudely hateful he forces you to swallow your disbelief at his behavior, including an attempted rape of Lorraine with others standing only a few feet away.\n\nI suspect Back to the Future will be around for a while. The critics may carp, but there seems to be something in this material’s gas tank that millions adore. Who knows, if it manages to pay off its nut and even turn a profit, perhaps, like its huge movie franchise, there’ll even be sequels. Again, though, we’d need a trip in a DeLorean to find out.\n\nBack to the Future. Open run at the Winter Garden Theatre (1634 Broadway, between West 48th and 49th Streets). www.backtothefuturemusical.com\n\nPhotos: Matthew Murphy and Evan Zimmerman\n\nJoanne & Bernie Furshpan\nJane H. Goldman\nJamie deRoy & friends\nJudy Stewart\nJudy Davis\nCarol Ostrow\nAmerican Popular Song Soc. (APSS)\nJanet Fein\nAlyce Finell\n\nYour donation will help us to bring you the latest in NYC theater and cabaret. DONATE TODAY!\n\nJoin our mailing list to receive the latest news and updates from Theater Pizzazz.\n\nJoin our mailing list to receive the latest Theater Pizzazz news.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1271,
  "archivePath": "data/archives/reviews/back-to-the-future-2023/theaterpizzazz-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T22:43:01.017Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250328151420",
  "archiveOrgUrl": "http://web.archive.org/web/20250328151420/https://theaterpizzazz.com/back-to-the-future-the-musical/"
}