{
  "showId": "back-to-the-future-2023",
  "outletId": "theatermania-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theatermania.com/news/review-back-to-the-future-the-musical-is-stuck-in-the-past_1710869/",
  "publishDate": null,
  "fullText": "Broadway&#8217;s latest screen-to-stage transfer gives audiences more of what they seem to want — which is what they already know.\n\nStage adaptations of popular films are like time machines. In the vessel of a new musical, writers can revisit an old script and perhaps even rectify flaws that only became apparent in hindsight. It&#8217;s a chance to make a good story even better — with music! At least, that&#8217;s the hope, and the major source of disappointment when it comes to Back to the Future: The Musical, the stage adaptation of the 1985 Robert Zemeckis movie, which just opened at Broadway&#8217;s Winter Garden Theatre following a triumphant world premiere in the UK.\n\nFaithful to a fault, book writer Bob Gale (who wrote the screenplay) sets his well-known story to forgettable new music by Alan Silvestri (who composed the original theme) and Glen Ballard. You&#8217;re unlikely to emerge humming any of the numbers, except for &#8220;The Power of Love&#8221; or &#8220;Back in Time&#8221; by Huey Lewis and the News, songs from the film now featured in the closing segment of the musical. Under the energetic direction of John Rando, the show delivers some truly astounding stagecraft, especially around the DeLorean, which is destined to fill the void left by Phantom&#8216;s chandelier as the most famous piece of scenery on Broadway. For many ticket buyers (and I predict there will be many) that will be enough — but Back to the Future had the potential to do so much more.\n\nI say this as someone who spent a sizable portion of his childhood wearing out VHS copies of the Back to the Future trilogy and devoutly tuning in to the animated series on Saturday mornings (Gale describes himself as &#8220;the gatekeeper of the franchise&#8221; in his program bio, and up until this misstep he has been as discerning as Saint Peter). The heightened style of the film easily lends itself to the broad strokes of musical theater, and the time-traveling story provides an opportunity for both 1980s and 1950s pastiche (Silvestri and Ballard seize on this with so-so results).\n\nBack to the Future: The Musical. (© Matthew Murphy and Evan Zimmerman)\" width=\"640\" height=\"427\" srcset=\"http://web.archive.org/web/20251010032128im_/https://www.theatermania.com/wp-content/uploads/sites/4/2023/08/4-BTTF-Jelani-Remy-and-the-Cast-of-BTTF-Photo-by-Matthew-Murphy-Evan-Zimmerman.jpg 1200w, http://web.archive.org/web/20251010032128im_/https://www.theatermania.com/wp-content/uploads/sites/4/2023/08/4-BTTF-Jelani-Remy-and-the-Cast-of-BTTF-Photo-by-Matthew-Murphy-Evan-Zimmerman.jpg?resize=300,200 300w, http://web.archive.org/web/20251010032128im_/https://www.theatermania.com/wp-content/uploads/sites/4/2023/08/4-BTTF-Jelani-Remy-and-the-Cast-of-BTTF-Photo-by-Matthew-Murphy-Evan-Zimmerman.jpg?resize=768,512 768w, http://web.archive.org/web/20251010032128im_/https://www.theatermania.com/wp-content/uploads/sites/4/2023/08/4-BTTF-Jelani-Remy-and-the-Cast-of-BTTF-Photo-by-Matthew-Murphy-Evan-Zimmerman.jpg?resize=1024,683 1024w, http://web.archive.org/web/20251010032128im_/https://www.theatermania.com/wp-content/uploads/sites/4/2023/08/4-BTTF-Jelani-Remy-and-the-Cast-of-BTTF-Photo-by-Matthew-Murphy-Evan-Zimmerman.jpg?resize=100,67 100w, http://web.archive.org/web/20251010032128im_/https://www.theatermania.com/wp-content/uploads/sites/4/2023/08/4-BTTF-Jelani-Remy-and-the-Cast-of-BTTF-Photo-by-Matthew-Murphy-Evan-Zimmerman.jpg?resize=500,333 500w, http://web.archive.org/web/20251010032128im_/https://www.theatermania.com/wp-content/uploads/sites/4/2023/08/4-BTTF-Jelani-Remy-and-the-Cast-of-BTTF-Photo-by-Matthew-Murphy-Evan-Zimmerman.jpg?resize=600,400 600w, http://web.archive.org/web/20251010032128im_/https://www.theatermania.com/wp-content/uploads/sites/4/2023/08/4-BTTF-Jelani-Remy-and-the-Cast-of-BTTF-Photo-by-Matthew-Murphy-Evan-Zimmerman.jpg?resize=1000,667 1000w\" sizes=\"(max-width: 640px) 100vw, 640px\"/>\n\nThe story allows writers to reexamine the &#8217;50s, that time of American greatness so mythologized by politicians (the song &#8220;Cake&#8221; does this in the most cursory ways, landing on the lyric, &#8220;It just feels right when / All of these white men / Get to have their cake / So let the women bake / We get to have our cake and eat it too&#8221;). And the theme of disrupting the past through time travel encapsulates the very American notion that we can escape fate and bend the future to our will. All that makes Back to the Future rich source material for that most American of theatrical forms, the Broadway musical.\n\nBottom feeders in the land of opportunity, the McFly family of Hill Valley are very much in thrall to fate. George (Hugh Coles) works a dead-end job under the supervision of high school bully Biff (Nathaniel Hackmann). George&#8217;s wife, Lorraine (Liana Hunt), swills vodka while advising her children to avoid the headaches that come with taking initiative and being noticed.\n\nTheir youngest son, Marty (Casey Likes), discovers just how they got to this sad state when he is accidentally transported from 1985 to 1955 in the time machine (sleekly encased in a DeLorean car) invented by his mad scientist friend, Dr. Emmett Brown (Roger Bart). Stranded in the &#8217;50s with no plutonium, Marty and Doc must find a way to generate the 1.21 gigawatts of electricity required to power the time machine and send Marty back to the future. Of course, this American Oedipus might have irrevocably wrecked that future when he inadvertently becomes the object of desire for his teenage mom.\n\nGale&#8217;s script revisions are mostly superficial and predictable in a culture highly attuned to any whiff of insensitivity: Doc is no longer pursued by Libyan terrorists (instead, he accidentally irradiates himself, somewhat lamely prompting Marty&#8217;s high-speed flight in the DeLorean). And while Marty still performs &#8220;Johnny B. Goode&#8221; at the school dance, Chuck Berry does not listen in over the phone, so there can be no accusations of cultural appropriation, however playful.\n\nBeyond these fear-soaked adjustments, the story mostly remains unmolested, with chunks of dialogue transported wholesale to the stage. Somehow, I remember it being funnier. Perhaps the visual medium of film compensates with sight gags. But onstage, it becomes apparent just how few jokes are in Gale&#8217;s script.\n\nThe actors seem to understand this is a problem in musical comedy and betray their anxiety with muggy performances — cartoonishly contorting their faces while delivering inexplicably goofy line readings in a desperate effort to squeeze humor out of an unfunny script.\n\nPossibly in supplication to brand cohesion, they seem to be deliberately referencing their film counterparts: The amiable Likes has a breathy delivery always on the verge of cracking à la Michael J. Fox, while Coles embodies Crispin Glover possessed by an extraterrestrial (his herky-jerky hips and overwhelming awkwardness prove impossible to resist and gave me the few genuine laughs I enjoyed all evening). Only Bart, with his pristine tenor, seems to significantly diverge from the trail blazed by his film antecedent — but who in their right mind would really attempt an impersonation of Christopher Lloyd?\n\nHunt is positively charming as Lorraine, winning us over with the two best new songs in the score, the girl-group throwbacks &#8220;Pretty Baby&#8221; and &#8220;Something About That Boy.&#8221; And Jelani Remy makes a strong impression in the expanded role of Goldie Wilson, stopping the show with the gospel number &#8220;Gotta Start Somewhere.&#8221;\n\nBut the production is the real star of Back to the Future, particularly Tim Hatley&#8217;s ever-shifting set, which is greatly enhanced by Finn Ross&#8217;s busy video design and flashing lighting by Tim Lutkin and Hugh Vanstone. It&#8217;s a perfectly disorienting sensory overload, and Chris Fisher takes full advantage with his eye-popping illusions. While lyrics occasionally drown in Gareth Owen&#8217;s more-is-more sound design, it&#8217;s a rush to feel the music and the acceleration of the DeLorean in our chests. And if any element can be said to steal the show, it&#8217;s the car, which gets a truly spectacular finale engineered by TwinsSFX. It&#8217;s the most innovative aspect of a musical that mostly wallows in the past.\n\nLike so many film-to-stage transfers of this century, Back to the Future arrives on Broadway as a monument to American decadence, a dominant culture only interested in revisiting old triumphs, spinning its wheels like a stylish (but highly dysfunctional) automobile trapped in a mire of nostalgia, fear, and increasingly impossible economics. This period seems destined to last for as long as the Boomer generation holds the reins of power — but eventually, we&#8217;ll actually have to move forward to the future.\n\nBack to the Future to Broadway\">\n                        \n                                    \n            \n        \n        \n            \n                \n                    PIX: Michael J. Fox, Christopher Lloyd, Lea Thompson, and More Welcome Back to the Future to Broadway                \n            \n        \n    \n\n                                                                                \n                    \n                            \n\n            \n\n\n        \n\n        \n\n        \n\n\n        \n\n            \n                        \n\n\n\n\n            \n            \n            \n                \n                    Tagged in this Story\n                \n\n                \n                                            \n                            \n                                    Alan Silvestri\n                            \n                        \n                                                \n                            \n                                    Back to the Future: The Musical\n                            \n                        \n                                                \n                            \n                                    Bob Gale\n                            \n                        \n                                                \n                            \n                                    Casey Likes\n                            \n                        \n                                                \n                            \n                                    Chris Fisher\n                            \n                        \n                                                \n                            \n                                    Finn Ross\n                            \n                        \n                                                \n                            \n                                    Gareth Owen\n                            \n                        \n                                                \n                            \n                                    Glen Ballard\n                            \n                        \n                                                \n                            \n                                    Hugh Coles\n                            \n                        \n                                                \n                            \n                                    Jelani Remy\n                            \n                        \n                                                \n                            \n                                    John Rando\n                            \n                        \n                                                \n                            \n                                    Liana Hunt\n                            \n                        \n                                                \n                            \n                                    Nathaniel Hackmann\n                            \n                        \n                                                \n                            \n                                    Robert Zemeckis\n                            \n                        \n                                                \n                            \n                                    Roger Bart\n                            \n                        \n                                                \n                            \n                                    Tim Hatley\n                            \n                        \n                                        \n            \n                        \n\n            \n\n\n\n\n\n\n\n\n\n\n\n\n            \n            \n\n\n    \n        Latest Reviews\n        \n        \n            See all\n        \n    \n    \n                            \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: In Slam Frank, Anne Frank Gets the Hamilton Treatment                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: Crooked Cross, Sally Carson’s Family Drama About the Rise of the Nazis                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: Dylan Mulvaney Is a Campy Angel in The Least Problematic Woman in the World                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: A Female Bullfighter Struggles to Fully Realize Herself in Torera                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: A Pride and Prejudice Like You’ve Never Seen Before in Are the Bennet Girls OK?                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: New Musical I & You Sings a Story Prosaic                \n            \n        \n    \n\n                    \n\n            \n        \n\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n        \n            \n            \n            \n            \n            \n            Theater News & discounts\n                \n                    Get the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nErika Henningsen and more Broadway favorites provide the voices for this animated musical series.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1338,
  "archivePath": "data/archives/reviews/back-to-the-future-2023/theatermania-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T22:42:12.575Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251010032128",
  "archiveOrgUrl": "http://web.archive.org/web/20251010032128/https://www.theatermania.com/news/review-back-to-the-future-the-musical-is-stuck-in-the-past_1710869/"
}