{
  "showId": "cabaret-2024",
  "outletId": "culturewhisper-holly-omahony",
  "outlet": "CultureWhisper (Holly O'Mahony)",
  "criticName": "Unknown",
  "url": "https://www.culturewhisper.com/r/theatre/eddie_redmayne_jessie_buckley_cabaret_kit_kat_club/16364",
  "playbillVerdictUrl": "https://www.culturewhisper.com/r/theatre/eddie_redmayne_jessie_buckley_cabaret_kit_kat_club/16364",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "You have reached the limit of free articles.\n\nPlease fix the following input errors:\n\nEach week, we send newsletters and communication featuring articles, our latest tickets invitations, and exclusive offers.\n\nOccasional information about discounts, special offers and promotions.\n\nThanks for signing up to Culture Whisper.\n\t\t\t\t\tPlease check your inbox for a confirmation email and click the link to verify your account.\n\nPlease fix the following input errors:\n\nJessie Buckley and Eddie Redmayne star in Rebecca Frecknall’s superb revival of Cabaret, staged inside an intimate reconstruction of the musical’s Kit Kat Club\n\nBy Holly O'Mahony  on 13/12/2021\n\nBook HereBased on Christopher Isherwood’s 1939 novel Goodbye to Berlin and best known packaged as the 1972 film starring Liza Minnelli, Cabaret revolves around the relationship between American writer Cliff Bradshaw (Omari Douglas, of Constellations and It’s a Sin acclaim), who’s come to Weimar-era Berlin in search of a story to cement his name, and English cabaret performer Sally Bowles (Jessie Buckley, of Wild Rose and the NT’s Romeo and Juliet), who he meets in the city’s hedonistic Kit Kat Club.\n\nIn Frecknall’s production, the world of the play extends beyond the auditorium and even its surrounding bars, where ruffles of gold lick the walls and performers strut the marble worktops or languish on them, legs spread. Designer Tom Scutt’s subtle recreation of a prohibition era speakeasy brands the exterior of the Playhouse Theatre – renamed the Kit Kat Club for the duration of Cabaret’s eight-month run – with simple black and white lettering. No bright lights or towering photos advertising a starry cast, but peer closer and a discreet A4 poster will inform you of the blockbuster operation awaiting inside.\n\nJessie Buckley 'Sally Bowles'. Photo: Marc Brenner\n\nThe auditorium, too, has undergone a full redesign in the hands of Scutt, architect-designer Patrick Berning and a sizeable renovation team. A rotating wooden stage hovers amid an assortment of tables and chairs, arranged in-the-round, which replace the front rows of the stalls. Each is fitted with trinkets which add to the atmosphere: a warm, glowing lamp and a faux telephone. It’s incredibly intimate and if you can afford the extortionate ticket price attached to these premium seats – upwards of £200 a pop – it is, admittedly, worth it. It’s a remarkably small stage to hold such heavyweight performances, and the proximity is part of what makes this Cabaret so special.\n\nThe production is traditional in appearance (Scutt’s costumes are a parade of lace trimmings, clownish callotts and velvet shorts), but fresh and innovative in its approach. Each look, gesture and utterance is exquisitely, meticulously directed.\n\nUnder Julia Cheng’s playful choreography, chorus members snake between the front rows of the audience, while Eddie Redmayne’s off-beat and deliciously absurdist Emcee swings his legs over a balcony while gleefully watching the performances below, in a directorial decision likely to have caused uproar with the theatre’s health and safety management. Later, during Redmayne's surreal performance of 'Two Ladies', chorus members thrust and grind in the background, one masturbating over a copy of Hitler's Mein Kampf.\n\nEddie Redmayne 'The Emcee'. Photo: Marc Brenner\n\nEqually triumphant is the show's trio of star talent – Redmayne, Buckley and Douglas – who, from the first note of Redmayne’s quasi-operatic ‘Willkommen’ to the last of Buckley’s gut-punching ‘Cabaret’, make this musical sparkle, soar and ultimately sear.\n\nDouglas, in an uncharacteristically demure role, is charming as the wet-behind-the-ears author. But those who saw his spicy take on showgirl Nora in Emma Rice’s Wise Children may feel a pang of regret that this nimble mover is denied a moment of cross-dressed showmanship.\n\nRedmayne appears to relish in his own grotesqueness as the Emcee, his sweeping hand gestures and unnervingly bent smile never more appropriate than when conducting the show’s macabre reprisal of Nazi number ‘Tomorrow’, dressed as a pearl-boned skeleton.\n\nBuckley flits between fierce and vulnerable. Her softer number ‘Maybe this Time’ shimmers with hope, but it’s through the titular ‘Cabaret’ that she lays down her full hand. It’s a performance that rises into a frantic, frenzied fever pitch, leaving her twitching and grasping at the invisible party of yesteryear, while we, her audience, can only look on in awe.\n\nOmari Douglas 'Cliff Bradshaw' and Jessie Buckley 'Sally Bowles'. Photo: Marc Brenner\n\nLiza Sadovy as Fraulein Schneider and Elliot Levey as Herr Schultz offer strong supporting performances. Their take on ‘It Couldn’t Please Me More’ is an affectionate, whimsical highlight.\n\nSo easy is it to be swept up like Sally Bowles in the spirited passion of the cabaret, that even those familiar with the story might be shocked anew when the conniving Ernst removes his coat to reveal a swastika.\n\nWith the rise of the Nazis, the party is over. While the Kit Kat Club remains open, we witness its soul die as its gaggle of performers swap their glamorous garments and free-flowing movements for ill-fitting suits and rigid marching.\n\nWhile on the surface a reflection of the Nazis terrible rise to power, the themes of Cabaret speak for the UK today, a Brexit-voting nation living under a government that recently approved a proposed amendment to the nationality and borders bill, allowing individuals to have their British citizenship revoked without warning.\n\nThrough stripping the club of its splendour and allowing the country’s politics to seep through the cracks, Frecknall reminds us no party can continue inside when a democracy is broken and liberties are lost.\n\nWhat\n\t\t\t\t\tCabaret, The Kit Kat Club at the Playhouse Theatre review \n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tWhere\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t                            \n                                                                    Playhouse Theatre, Northumberland Avenue, London, WC2N 5DE                                                            \n\t\t\t\t\t\t\t| MAP\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNearest tube\n\t\t\t\t\t\tEmbankment (underground)\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tWhen\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t15 Nov 21 – 29 Jun 24, 7:30 PM – 10:00 PM\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\tPrice\n\t\t\t\t\t\n\t\t\t\t\t\t£30 - £300+\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tWebsite\n\t\t\t\t\t\n\t\t\t\t\t\tClick here for more information and to book \n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t15\t\t\t\t\n\n\t\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tJessie Buckley\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tWest End\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tRebecca Frecknall\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tEddie Redmayne\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\n\n\n\n\t\n\t\t\n\n\n\t\n\t\t\n\t\t\tYou might like",
  "isFullReview": true,
  "textWordCount": 963,
  "archivePath": "data/archives/reviews/cabaret-2024/culturewhisper-holly-omahony--unknown_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:09:42.760Z",
  "designation": "Recommended",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.goto: net::ERR_ABORTED; maybe frame was detached?\nCall log:\n  - navigating to \"https://www.culturewhisper.com/r/theatre/eddie_redmayne_jessie_buckley_cabaret_kit_kat_club/16364\", waiting until \"domcontentloaded\"\n"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241221235135",
  "archiveOrgUrl": "http://web.archive.org/web/20241221235135/https://www.culturewhisper.com/r/theatre/eddie_redmayne_jessie_buckley_cabaret_kit_kat_club/16364"
}