{
  "showId": "cabaret-2024",
  "outletId": "evening-standard-nick-curtis",
  "outlet": "Evening Standard (Nick Curtis)",
  "criticName": "Nick Curtis",
  "url": "https://www.standard.co.uk/culture/theatre/cabaret-review-eddie-redmayne-jessie-buckley-the-kit-kat-club-b971184.html",
  "playbillVerdictUrl": "https://www.standard.co.uk/culture/theatre/cabaret-review-eddie-redmayne-jessie-buckley-the-kit-kat-club-b971184.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The Standard's journalism is supported by our readers. When you purchase through links on our site, we may earn an affiliate commission. Wow. Rebecca Frecknall’s new revival of Kander and Ebb’s musical set in interwar Berlin is a stunning, breathlessly exciting theatrical happening. It feels loyal to the 1966 original yet astonishingly contemporary, and properly immersive. The Playhouse Theatre has been reconfigured by the designer Tom Scutt as the Kit Kat Club circa 1929, with pre-show performances in the bars and food and drink served at tables surrounding a circular, central stage. By the looks of it, the hugely expensive, three-course menu package isn’t worth it. The show emphatically is. Jessie Buckley sings her heart out as a fretful, doomed Sally Bowles: a powerhouse of emotion, she leaves everything on stage. Eddie Redmayne’s Emcee is a brilliantly twisted creation, part tribute to Joel Grey’s original performance on Broadway and in Bob Fosse’s 1972 film adaptation, part George Grosz grotesque, part baby crocodile. The louche, gender-fluid ensemble, writhing in variations of lingerie and lederhosen to Julia Cheng’s sinewy choreography, and the female-led orchestra are impeccable. Again, just wow. Cabaret is a show about reinvention and the result of reinvention: a Christopher Isherwood story that became a play then a musical. Fosse’s film, with an altered storyline and songlist and iconic performances from Grey and Liza Minelli as Bowles, casts a long shadow, but it’s vanquished here. Our callow, Isherwood-esque American hero Cliff (Omari Douglas making his second West End appearance of the year following his stint in Constellations opposite Russell Tovey) chases the Bohemian lifestyle across Europe and finds it in Berlin where he can self-define as a writer, a bisexual, a smuggler. He’s a thin character, but there’s an interesting suggestion here that his impelled cohabitation with Sally is platonic, his belief that he “could” be the father of her baby a gay man’s enthralled fantasy. The part of Sally is a contradiction, a poor singer played by a great one, a brilliant life force who’ll be dead by 30. Buckley manages this balancing act with huge skill: her rendition of the anthemic Maybe This Time, arms folded in a dowdy dressing gown, is transporting; her reprise of the title tune looks almost like an exorcism. She epitomises interwar Berlin: broken and broke, dancing tipsily on the edge, heedless of the Nazi storm coming. Redmayne too proves to have a fine singing voice under his clotted German accent. Scutt outfits him as a jewelled salamander and a menacing Pierrot, rising into the spotlight on a three-tier wedding-cake revolve. The overall look of the scenes in the cabaret are like a fever dream, and the move into starker “real” life is signalled by the lights on the ringside tables dimming. Liza Sadovy and Elliot Levey add ballast as landlady Fraulein Schneider and her Jewish suitor, Herr Schultz. Anna-Jane Casey throws off her tarty comic façade to chill the blood as informant Fraulein Kost. Eventually, even the Emcee is stripped of his finery, to join a circle of suited figures bound for a horrific fate. In this fine balance of spectacle and grit, decadence and despair, Frecknall proves herself one of our most exciting directors, and she draws superb performances from all involved. Booking to May 2022, kitkat.club; tickets can also be booked at atgtickets.com or theplayhousetheatre.co.uk Moment hammer-wielding thugs ransack Richmond jewellers as brave staff fight back in brazen daytime raid Hammer-wielding thugs ransack jewellers as brave staff fight back Manchester United vs Fulham LIVE: Premier League latest score, match stream, goal updates and fan reaction Man Utd 0-0 Fulham: Underway in Old Trafford clash - LIVE Transfer news LIVE! Arsenal deal imminent; Chelsea launch shock late bid; new Liverpool target; Man Utd latest Transfer news LIVE! Arsenal deal imminent; Chelsea in shock late move Will Pep Guardiola take charge of Man City against Tottenham after missing press conference? Man City confirm who will take charge at Spurs amid Guardiola absence London leavers: 'We paid £390k for our fairytale dream house in Suffolk' London leaver: 'We paid £390k for our fairytale house in Suffolk'",
  "isFullReview": true,
  "textWordCount": 683,
  "archivePath": "data/archives/reviews/cabaret-2024/evening-standard-nick-curtis--nick-curtis_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:11:03.686Z",
  "designation": "Recommended",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}