{
  "showId": "cabaret-2024",
  "outletId": "hello-magazine-emmy-griffiths",
  "outlet": "Hello Magazine (Emmy Griffiths)",
  "criticName": "Emmy Griffiths",
  "url": "https://www.hellomagazine.com/film/20211213128861/cabaret-kit-kat-club-eddie-redmayne-musical-review/",
  "playbillVerdictUrl": "https://www.hellomagazine.com/film/20211213128861/cabaret-kit-kat-club-eddie-redmayne-musical-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "It seems like fans of musical theatre have been happy enough that the old hits are back in business, and that they can see their Phantom of the Opera, their Hamilton and their Frozen without needing to bring something new to the party – but Playhouse Theatre's revitalised adaptation of the 1966 classic Cabaret has proven how much theatre needed an injection of something extraordinary – and it is about to the West End's hottest ticket.\n\nMORE: 15 best Christmas markets in the UK you need to visit in 2021\n\nCabaret at the Kit Kat Club has us enter the glittery world of 1930s Berlin, a liberal party place that is about to be cruelly upheaved in the horrors set to follow; with the rise of the Nazi party bringing this dazzling, raunchy dream crashing to an end.\n\nThe story follows a young American writer, Cliff (and beautifully played by It's a Sin star Omari Douglas), who visits Berlin in the hopes of finding inspiration for a novel, only to be entranced by the chaotic underground party lifestyle, while slowly realising the threat of the Nazi party's rising popularity.\n\nThe Playhouse Theatre knows it has a masterpiece on its hands here. Everything, from the uniformed Big Brother eyes of the exterior from the red-lit tunnels taking the audience underground and up into a world where scantily clad performers hang off the balconies and stall seats have been swapped out for little tables preempts that you are about to watch something special. And special it is.\n\nSEE: 20 best things to do in festive London in December\n\nMORE: Best festive menus in London: The ultimate guide to Christmas dinner in the city\n\nWhile there is nothing neat in the Playhouse Theatre's version of the 1966 musical, that is quite the whole point. Wigs are abandoned and lipstick is smeared as characters freefall through emotions. Costumes are swapped at a dizzying pace. The cast are as bawdy and messy as Berlin itself, making the perfected choreography even more impressive.\n\nEddie Redmayne wastes no time in proving why he is one of the best actors of his generation as the entrancing enigma that is Emcee. He goes from clownish to sinister at every given turn, with his body and face contorting as he descends from humorous frivolity to seething hatred, taking the raucous chorus – an immensely talented group who appear to be having the time of their lives – along for the ride with him. We also have to give a special shout out to Liza Sadovy, who is wonderful as Fraulein Schneider.\n\nTo keep some things a secret, and indeed, the Playhouse Theatre is rather invested in their guests seeing the wonder for themselves – even giving out stickers to cover phone lenses - some of Eddie's costumes along with the clever staging simply must be seen to be believed. And we promise you won't look away.\n\nMeanwhile, Jessie Buckley is not to be underestimated as the vaguely untalented Sally Bowles, who is presented as such by Jessie's own teeming genius as a singer and actress. Her Sally varies from basking in frivolity to revealing her true, heartbreaking vulnerability, to eventually returning to painful levity as the determination to live her life as if in a dream wins out, leaving exactly no one happy.\n\nExcept the audience who are on their feet in rapturous applause, of course.\n\nLike this story? Sign up to our newsletter to get other stories like this delivered straight to your inbox.\n\nWhere is David Duchovny's on-screen daughter from Californication, Madeleine Martin now?The actress played Rebecca Moody in the popular seven-season Showtime series, and has remained a familiar face on screensHugh Bonneville teases 'compelling' true-story project with Mad Men starHugh Bonneville has joined forces with Mad Men star Maggie Siff. Following the release of Downton Abbey: The Grand Finale, the actor is switching things upInside the Antiques Road Trip cast's private love lives - meet their rarely-seen partnersFrom Natasha Raskin Sharp to Philip Serrell, get to know the partners of the Antiques Road Trip experts hereFrom Australia to India: 6 most idyllic train journeys for the trip of a lifetime in 2026Rail-based holidays offer a remarkable ways to see the world, whether retracing the steps of Indian royalty, bathing in alpine lakes or beyond...Where are the cast of ‘70s sitcoms now?From M*A*S*H and Happy Days to The Partridge Family and The Brady Bunch, what happened to the stars of the disco era’s biggest sitcoms?Where are the cast of Fawlty Towers now? From sad deaths to James Bond starFawlty Towers aired between 1975 and 1979, and following the sad death of Prunella Scales, see where the stars of the iconic show are nowMeet Craig Revel Horwood's ex-wife Jane Horwood – from spontaneous proposal to eventual splitStrictly's Craig Revel Horwood is back with his acid-tongued critiques, but before starring on the show, he was married to Jane Horwood. Here's all you need to knowMeet Amber Davies' famous actor boyfriendLove Island star Amber Davies is starring on Strictly Come Dancing. Meet her actor boyfriend, Ben Joyce, who is a star of London's West End\n   \n    \n    \n    \n        Promoted Stories\n    \n\t\t\n\t\n    \n\n                        \n    \n        \nYou Might Also Like\n                \n    \n\n\n    \n    \n            \n Read MoreDavid Tennant announces huge news about next role - and we can't wait!Strictly's Kevin Clifton responds to criticism regarding new roleEddie Redmayne wears leg brace on Graham Norton Show after being injured on film set – find out what happenedTicketholders react to Hamilton's London opening delayed\n \n ✕\n\nBy choosing this option, you will continue to see ads but they will not be personalised\n\nWe and our 312 partners use the data for: Store and/or access information on a device, personalised advertising and content, advertising and content measurement, audience research and services development, analytics and ad storage. As well as for precise geolocation data and to actively scan device characteristics for identification.",
  "isFullReview": true,
  "textWordCount": 972,
  "archivePath": "data/archives/reviews/cabaret-2024/hello-magazine-emmy-griffiths--emmy-griffiths_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:11:38.526Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee"
}