{
  "showId": "cabaret-2024",
  "outletId": "independent-alexandra-pollard",
  "outlet": "Independent (Alexandra Pollard)",
  "criticName": "Alexandra Pollard",
  "url": "https://www.independent.co.uk/arts-entertainment/theatre-dance/reviews/cabaret-review-jessie-buckley-eddie-redmayne-b1974565.html",
  "playbillVerdictUrl": "https://www.independent.co.uk/arts-entertainment/theatre-dance/reviews/cabaret-review-jessie-buckley-eddie-redmayne-b1974565.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Notifications can be managed in browser preferences.\n\nThere is an air of dramatic secrecy around Rebecca Frecknall’s remarkable new production of Cabaret. Lest you are tempted to take a picture, stickers are placed over phone cameras as you enter the “Kit Kat Club”, the temporary new name of the Playhouse Theatre. The place has been transformed into the gloriously louche cabaret club of 1930s Weimar Berlin. Signs for the toilets are in English and German; the bathrooms are bathed in red light; dancers sit writhing on the bar.\n\nEnter Eddie Redmayne as the Emcee, an impish, mercurial presence who serves as both compere of the cabaret and a sort of all-seeing narrator. In the strange and seductive opening number “Wilkommen”, he promises an escape from the real world – but his gurning presence becomes more disturbing, his songs a metaphor for the darkening soul of Germany as it descends in Nazism. Redmayne is excellent, contorting his sinewy body and singing with a closed-throated vibrato and hammed-up German accent.\n\nThe production belongs, though, to Jessie Buckley. As the club’s headline act Sally Bowles, an English woman of mediocre talent with grand delusions of stardom, she is both a free spirit and a lost soul. We first meet her dressed as a sort of clownish baby, winking, licking her lips, and flashing the audience as she sings the playfully off-colour “Don’t Tell Mama”. From the stage, Sally spots Cliff (It’s a Sin’s Omari Douglas), a poor American writer who has come to Berlin with the hopes of writing a novel. Sally takes a liking to Cliff, so when she’s fired from the club, she promptly moves into his tiny room in a boarding house run by Fraulein Schneider (Liza Sadovy, giving a quietly empathetic performance).\n\nThe middle-aged Schneider’s budding romance with a Jewish fruit-seller (Elliot Levey’s Herr Schultz) coincides with the wave of antisemitic sentiment sweeping across Germany. As soon as the first swastika appears – on the arm of Cliff’s friend Ernst Ludwig (Stewart Clarke), a reveal that prompts gasps from the audience – what began as a vibrant, camp, innuendo-laden riot twists into something genuinely frightening. At one point, as Redmayne wraps a glass in cloth and stamps on it – an allusion to the Jewish wedding tradition – a brick is thrown through Schultz’s window and we hear the ear-splitting sound of smashing glass. It is an eerie foreshadowing of Kristallnacht. The musical, first performed in 1966, was designed to shock, and though our threshold for that rises year by year, Frecknall still manages it – not least when a member of the troupe (Bethany Terry) starts masturbating to Mein Kampf.\n\nSally, meanwhile, is in her own world. She is pregnant by her former boss, and contemplating raising the child with Cliff, with whom she has fallen into a seemingly platonic relationship (it is usually implied, with different degrees of subtlety depending on the production, that Cliff is gay). Buckley nails the nuances and jarring contradictions of Sally, who wears so many impenetrable layers of bluster and bravado that in lesser hands she could be hard to get a handle on. When Buckley sings “Maybe This Time”, Sally’s only truly vulnerable moment, she keeps her arms crossed for the entire song, the decades of disappointment instead writ large on her face.\n\nSurely the most powerful moment – and perhaps the best musical-theatre performance I have ever seen live – is Buckley’s rendition of the title song. While in many productions (the 1972 film with Liza Minnelli included) it is performed with peppy razzmatazz, here Buckley is a woman on the edge of a breakdown. “Life is a cabaret old chum,” she bellows, at first dripping with sarcasm and then spitting with fury. It is astonishing.\n\nBack in the Sixties, the musical’s original director Hal Prince called Cabaret “a parable of contemporary morality”. In such capable hands, it’s a parable that still packs a punch.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies\n\nU.S. PrivacyPromoted storiesWhy Is This The Most Talked About Bottle Of 2026?Perfect Gift for Patriots & Collectors.Glosritystore | SponsoredSponsoredLearn MoreThis Gentleman’s Hat Is A 2026 Must-Have For Stylish Guys!Rockhatter | SponsoredSponsoredShop NowMoisturizer Won't Tighten Skin! Use This Household Item Instead.She stopped using her moisturizer and tried this instead — the results surprised everyone.Anti-Aging Center | SponsoredSponsoredby Taboolaby TaboolaYou might be interested- | SponsoredSponsoredHere's The Estimated Walk In Shower Price in 2026homebuddy.com | SponsoredSponsored7 Tax Law Changes That Could Impact Your 2025 TaxesLearn about the biggest tax law changes and how they may affect your refund. See what deductions and credits could work in your favor.TurboTax | SponsoredSponsoredLearn MoreCostco Shoppers Say This Antiwrinkle Item Is \"Actually Worth It\"Olavita | SponsoredSponsoredby Taboolaby TaboolaYou might be interested in the content above- | SponsoredSponsoredWhen A Cardinal Appears: The Memorial Statue Every Yard NeedsA Symbol of Love, Peace, and RemembranceClairebirds Angel | SponsoredSponsoredRead MoreCesar Millan: What Happens When Senior Dogs Eat Honey?Watch this before it gets taken downDr. Marty | SponsoredSponsoredClick HereWrap Your Car Keys in Aluminum Foil, Here's What HappensLife Savvy Hub | SponsoredSponsoredhome newsNew Epstein file photos appear to show Andrew Mountbatten-Windsor on floor with womanus politicsWhat are the main revelations from the new Epstein files release?by Taboolaby TaboolaYou might be interested- | SponsoredSponsoredThe 250th Anniversary Whisky Bottle Breaks All Sales Records in LancasterFANYIL | SponsoredSponsoredShop NowWe’re getting the ‘manosphere’ all wrong – and here’s whyYoung men have been social scapegoats for generations, writes Saul Parker, but we’re missing why they turn to misogynistic content – to escape the situation they find themselves inPromoted by Independent Premium | SponsoredSponsoredNever Borrow From The Bank If You Own a Home, Do This Instead (It's Genius)Borrow without affecting your current mortgage. Lendgo | SponsoredSponsoredClick Hereby Taboolaby TaboolaClick here for more information- | SponsoredSponsoredThe Cozy Satin Blouse Every Woman Wants!A satin blouse that looks effortlessly cool and feels unbelievably soft — no wonder it’s becoming every woman’s new favorite.Walkergrey | SponsoredSponsoredShop NownewsRichard Branson responds after release of email exchange with Jeffrey Epsteinus politicsRichard Branson responds after emails with ‘abhorrent’ Epstein appear in files dumpWatch Birds \"Shop\" In Your Backyard With This Simple GiftBring nature closer to home with this Handmade Alpaca Fiber Bird Nesting Heart, a charming blend of rustic yard décor and bird-friendly functionality.Olygee | SponsoredSponsoredLearn Moreby Taboolaby TaboolaClick here for more information- | SponsoredSponsorednewsTrump plays MAGA conductor in bizarre new painting with Charlie Kirk in the orchestraThank you for registeringPlease refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in",
  "isFullReview": true,
  "textWordCount": 1094,
  "archivePath": "data/archives/reviews/cabaret-2024/independent-alexandra-pollard--alexandra-pollard_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:12:17.231Z",
  "designation": "Recommended",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}