{
  "showId": "cabaret-2024",
  "outletId": "inews-fiona-mountford",
  "outlet": "iNews (Fiona Mountford)",
  "criticName": "Fiona Mountford",
  "url": "https://inews.co.uk/culture/arts/cabaret-playhouse-theatre-review-eddie-redmayne-jessie-buckley-omari-douglas-is-chilling-dark-stripped-back-1347474",
  "playbillVerdictUrl": "https://inews.co.uk/culture/arts/cabaret-playhouse-theatre-review-eddie-redmayne-jessie-buckley-omari-douglas-is-chilling-dark-stripped-back-1347474",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Willkommen, bienvenue, welcome to the most eagerly anticipated show of the year. Redmayne is compelling and Jessie Buckley proves a superstar in the making at this bleak party at the end of the world Share this story from The i Paper - and spark a conversation. Gift up to 10 articles a month to a friend, so they can read for free Share this story from The i Paper - and spark a conversation. Gift up to 10 articles a month to a friend, so they can read for free Willkommen, bienvenue, welcome to the most eagerly anticipated theatrical event of the year. Oscar winner Eddie Redmayne and superstar-in-the-making Jessie Buckley are the headline treats on offer inside, but getting in to see them is all part of the show. One of the West End’s less lovely venues has been definitively transformed into the Kit Kat Club, the setting for Kander and Ebb’s great musical in early 20th century Berlin. We enter via a subterranean side passage into a boisterously seedy world of nightclub performers, who regale us with slinky pre-show entertainment as we wend our way in the gloaming up to the transformed in-the-round auditorium. It’s a beguiling start, but given that the lowest price in the top two bands of tickets is £120, so it should be. Despite the immersive backdrop – all credit to designer Tom Scutt – this is a Cabaret that has been stripped back and cleansed of the reassuring layers of jollity that it often wears. Sex might be everywhere, but no one is enjoying it. Director Rebecca Frecknall, who made her name with a transformative production of Tennessee Williams’s Summer and Smoke, leaves us in no doubt that this is the no-holds-barred end of the Weimar Republic, which is hurtling towards the bleakest of finales. Redmayne’s Emcee is a chillingly compelling host for this party at the end of the world. He gives a weird, wired and wonderful performance, by turns creepy, hunched and amiable, and at one point sports a costume I can only describe as “Pierrot dresses as Richard III for Halloween”. Nonetheless, Redmayne fails to banish entirely memories of Alan Cumming’s definitive take on this part. Buckley’s Sally Bowles, first seen in a short frock paired with heavy black bovver boots, is more bitter and less bouncy that we’re used to; desperation rather than fun propels her from the start and Buckley’s glorious voice – perhaps fittingly for the decidedly average performer Sally in reality is – is never allowed to rip free. By the time she reaches the title number – Kander and Ebb’s bitingly witty songs weave their customary magic – she offers the most stark and downbeat take imaginable, alternating between jerky contortions and frantic whirring. Usually a defiant ode, the song is now downright unsettling. Omari Douglas struggles to give much definition to bisexual writer Clifford Bradshaw, which in turns means his relationship with Sally lacks conviction. Instead all our emotional investment goes into the later years romance, exquisitely delineated by Liza Sadovy and Elliot Levey, between landlady Fräulein Schneider and her Jewish lodger, Herr Schultz. A shimmering directorial touch sees the ritual of glass-smashing in the Jewish wedding ceremony twisted to represent the destruction of Kristallnacht. That one moment, the shattering of those small but universal dreams, tells us everything we need to know.",
  "isFullReview": true,
  "textWordCount": 559,
  "archivePath": "data/archives/reviews/cabaret-2024/inews-fiona-mountford--fiona-mountford_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:07:55.843Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}