{
  "showId": "cabaret-2024",
  "outletId": "londontheatrecouk-suzy-evans",
  "outlet": "LondonTheatre.co.uk (Suzy Evans)",
  "criticName": "Suzy Evans",
  "url": "https://www.londontheatre.co.uk/reviews/cabaret-at-the-kit-kat-club-review-eddie-redmayne-and-jessie-buckley",
  "playbillVerdictUrl": "https://www.londontheatre.co.uk/reviews/cabaret-at-the-kit-kat-club-review-eddie-redmayne-and-jessie-buckley",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "We have no troubles here.In here, life is beautiful. The Kit Kat Club is the ultimate escape. After a difficult or even ordinary day, the fanfare, glitz, and glamour feel like a portal to another time, where you'll be greeted with complimentary schnapps, dancing chorus members, and a lascivious pre-show smorgasbord. From the gilded lobby, disco-lit basement, and everywhere in between, the space creates an all-encompassing atmosphere, right down to the aptly named cabaret tables, a design element director Sam Mendes also used in his 1993 production at the Donmar and later on Broadway, where it was revived in 2014. However, here, director Rebecca Frecknall levels up the concept, and maybe this time, the stakes are a little higher and a little more intense. Coupled with Tom Scutt's immersive design and Isabella Byrd's atmospheric lighting, this production feels like a world away from outside. Or does it really? The headlines feel eerily similar today as when Joe Masteroff, John Kander, and Fred Ebb wrote their iconic musical about an American writer and a struggling nightclub performer in 1920s Berlin, who find themselves torn between a struggle to survive in love and life amid the rising glare of Nazism. There are, in fact, many troubles here. And Frecknall doesn't pull any punches with her high-concept approach, which takes a cue from Christopher Isherwood's Goodbye to Berlin and John van Druten's 1951 play, on which the show is based. The approaching horror and absurdism of this escape is at the forefront, and her highly choreographed tableau feels like a ballet or a marionette show, where someone calculating is pulling all the strings. At the center of this circus stands the Emcee, played here with impish wackiness by Eddie Redmayne. Redmayne slithers around the stage, contorting his being every which way to almost distracting effect. Redmayne is not a commanding showman, as is a tempting take for the Emcee, but instead he uses gesture and sensuality to make the audience lean in. As the musical gets progressively darker, Redmayne's Emcee becomes more and more absurd, almost half American Horror Story: Freakshow and half Martha Graham dancer, and his final iteration is the most horrific. In contrast to Redmayne, Jessie Buckley is all bravado and belt. Her Sally Bowles is the ultimate starlet, taking a note or three from Liza Minelli's iconic film performance in the role, and she dominates the stage with effortless charisma and appeal. She's irresistible. Even in the quieter, heartbreaking moments, she conveys an emotional depth and density, and she nails the 11 o'clock title song. (While many may argue that Sally Bowles as a character is not supposed to be a good singer, neither this production nor Buckley respect that take.) This production highlights the ensemble nature of the show, featuring a chorus of extremely talented dancers, seemingly inventing new ways to move with Julia Cheng's choreography, and the supporting cast offers a deep emotional contrast to the more showy club scenes. As Fraulein Scheider and Herr Schultz, Liza Sadovy and Elliot Levey hold the beating heart of the piece and shatter it into pieces. Anna-Jane Casey stands out as Fraulein Kost, and Omari Douglas does his best naive fish-out-of-water as American writer Clifford Bradshaw. Cabaret feels like a story we need and also don't need right now. On the one hand, it's a glorious ode to escapism and forgetting the troubles that bind us. But some of the \"troubles\" we're going through right now aren't that far off from Jazz Age Berlin, with abortion legislation under fire in the United States and government oversight of Covid-19 brewing further division. And Frecknall's searing, haunting final stage portrait seems to imply that escapism only lasts so long. Sooner or later, if we don't face our troubles, our troubles will find us. After all, life isn't really a cabaret, old chum. Cabaret is playing at the Kit Kat Club. Book tickets to Cabaret on London Theatre. What good is sitting alone in your room– get immersed in the Kit Kat Club. This award-winning production transforms the Playhouse Theatre, with strictly limited capacity for a unique, intimate experience. It’s the perfect way to experience this classic story of a cabaret singer at the dawn of Nazi Germany. Book your place with Cabaret tickets today. Cabaret is playing at Kit Kat Club at the Playhouse Theatre. The theatre is located at Playhouse Theatre, Northumberland Ave, London, WC2N 5DE. The running time of Cabaret is 2hr 45min. Incl. 1 interval. The recommended age for Cabaret is Ages 12+. At parent/guardian's discretion.. Book tickets for Cabaret on London Theatre. Cabaret features some well-known Kander and Ebb classics, including “Maybe This Time,” “Willkommen,” and “Mein Herr.” Read our complete guide to the songs in Cabaret. The book for Cabaret was written by Joe Masteroff. John Kander composed the music, and Fred Ebb provided the lyrics. The London revival of Cabaret was directed by Rebecca Frecknall (Streetcar Named Desire, Summer and Smoke), for which she won the Olivier Award for Best Director. Cabaret is not suitable for those under the age of 13. This is due to content of a suggestive sexual nature, anti-Semitism, an incidence of domestic violence, and references to abortion. This revival reimagines and brings to life the captivating world of the Kit Kat Klub on the London stage. Read our four-star review of Cabaret here. Cabaret is a highly immersive revival of a Kander and Ebb classic. The Playhouse Theatre’s transformation into the Kit Kat Club is incredible. We suggest arriving an hour before your performance time. This is due to pre-show entertainment at the Kit Kat Club before Cabaret begins on the main stage. Originally published on Jan 25, 202215:14",
  "isFullReview": true,
  "textWordCount": 948,
  "archivePath": "data/archives/reviews/cabaret-2024/londontheatrecouk-suzy-evans--suzy-evans_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:12:25.545Z",
  "designation": "Recommended",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright"
}