{
  "showId": "cabaret-2024",
  "outletId": "pagesonstages-wordpress-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.wordpress.com/2024/04/11/cabaret/",
  "publishDate": null,
  "fullText": "Cabaret at the newly renovated Kit Kat Club (nee August Wilson Theatre) was an unforgettable experience. I applaud this production for its unique takes on a familiar story. It was interesting to see a show I know well feel like a totally new show because of the strong choices to really showcase the words over the music and emphasize the acting over the singing. While on some level it was absolutely incredible to see a show I know every word to as if for the first time, there were some moments and ideas that disappointed me and took me out of it. The most dramatic change in my eyes was the portrayal of Sally Bowles (Gayle Rankin). I’ve never seen the character acted with such nuance and anger. Every line Rankin threw out had a multitude of meanings and a fire and energy that I’ve never seen in a character written to represent apathy. This revival showed another version of Sally Bowles—a self-absorbed version who doesn’t care about politics because she has too many too much of her own pain to extend a hand to others. I wanted to hear her belt, but they rarely let her. She shouted and screamed and made a big fuss and it was interested and dynamic, especially in the title song “Cabaret.” But sometimes, it didn’t feel like a musical—just a play with music underneath it. Because I am familiar with the show, it was hard not to miss the extended notes and high level of vocal performance that I was expecting and hearing in my head in some of these moments. The reexamination of who and what the Emcee is was very interesting artistically. Eddie Redmayne started out so absurd that I couldn’t get into it. This was evoking the absolute absurdity that everyone saw in Hitler’s rise to power. No one expected him to actually come to power—it’s part of why so many Jews didn’t leave Germany in time. As Cabaret went on, Redmayne’s Emcee became more and more human, less and less rigid. By the end, he was in regular clothes, just a man—the idea of hatred in Nazi Germany had been normalized, and this once absurd idea had become indistinguishable from the regular people in regular clothes going about their regular business. It was chilling conceptually, but it made for an uncomfortable, jolting start to the show that made me uneasy in all the wrong ways. The exception to this new interpretation was the story of Fraulein Schneider (Bebe Neuwirth) and Steven Skybell (Herr Schultz), who both gave extraordinary performances in their roles as the older generation still experiencing the fears and the doubts of the younger one, but also sweet and tender and romantic in a timeless way—this provide a foil to the changing world by reminding the audience that “you learn how to settle for what you get” but even as times change, people survive and experience the same struggles and questions all their lives. I cannot conclude this review without mentioning the renovated theatre experience with the preshow and the table seating and the setup of the production in the round. The renovations made the space fun, and it was a great show to see in the round. This configuration was extremely well utilized, even though it did eliminate all possibility of a real set. Food and drink prices were ridiculous, and it’s clear that the producers are blatantly taking advantage of theatre patrons to make money. The preshow was a complete waste of time. Spaces were too crowded to be enjoyable. It was very difficult to get to the bathrooms or the coat check. The air of mystery was fun for a little while but the novelty wore off quickly. The phones on the tables for those with table seating were a fun idea, but didn’t really add anything to the experience. All in all, had I not won a lottery ticket that landed me a very good orchestra seat, I would not see this show at the face value ticket prices. It really felt like the producers were doing everything they could to rip you off, which felt ironic when watching a show about people who are struggling to make ends met. That being said, it was a magical evening at the theatre. I was absolutely delighted and dazzled by hearing some of these words as if for the first time even though I knew them well. I liked the reinterpretations and the nuances of the acting (particularly Gayle Rankin’s). But the expensive, VIP experience for this show isn’t worth what they’re charging for it. Not even close—and totally unnecessary to enjoy the show. The performance I attended was a preview performance.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 787,
  "archivePath": "data/archives/reviews/cabaret-2024/pagesonstages-wordpress-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:49:49.129Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}