{
  "showId": "cabaret-2024",
  "outletId": "queerty",
  "outlet": "Queerty",
  "criticName": "Matthew Wexler",
  "url": null,
  "publishDate": "2024-04-21T21:27:37-04:00",
  "fullText": null,
  "isFullReview": false,
  "bwwExcerpt": "We don’t have to look too far to see how quickly democracy can collapse. A presidential candidate facing 91 felony charges, “Don’t Say Gay” laws, and the proliferation of drag bans could push any of us to unleash our inner Sally Bowles. Redmayne, Rankin, and a smartly conceived Cabaret reboot shoot warning flares high into the sky. We only need to wander into the Kit Kat Club to discover a world mirroring our own.     PJ Grisar, Forward: The triumph of this iteration is how it anticipates its audience, teasing them with frothy liberation before making them gasp at Nazi armbands and shattered windows. As the Emcee oversees, or even appears at times to orchestrate, these national contradictions, it’s hard not to feel queasy at the dissonance. Particularly, I’d imagine, if you paid the upcharge for a stage-side meal. When the drumroll closes the show, a new aesthetic takes hold, complete in its muted menace. Dramatic irony is the play’s engine; we know there’s no changing the outcome. But when we sit pretty at the Kit Kat Club — tipsy, titillated, terrified — it’s not too late for us.        Average Rating: 59.5% {   \"@context\":\"https://schema.org\",   \"@type\":\"LiveBlogPosting\",   \"@id\":\"/article/Review-Roundup-CABARET-AT-THE-KIT-KAT-CLUB-Opens-on-Broadway-Updating-Live-20240421\",   \"about\":{     \"@type\":\"Event\",     \"startDate\":\"2024-04-21T09:27:37-05:00\",          \"name\":\"Review Roundup: CABARET AT THE KIT KAT CLUB Opens on Broadway\",            \"eventAttendanceMode\": \"https://schema.org/OnlineEventAttendanceMode\",       \"location\": {         \"@type\": \"VirtualLocation\",         \"url\": \"/article/Review-Roundup-CABARET-AT-THE-KIT-KAT-CLUB-Opens-on-Broadway-Updating-Live-20240421\"         }     },   \"coverageStartTime\":\"2024-04-21T09:27:37-05:00\",      \"coverageEndTime\":\"2024-04-22T12:27:37-05:00\",   \"headline\":\"Review Roundup: CABARET AT THE KIT KAT CLUB Opens on Broadway\",      \"description\":\"Cabaret at the Kit Kat Club opened tonight at the August Wilson Theatre on Broadway. Check out what the critics had to say here!\",   \"liveBlogUpdate\":[     {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Times - ‘Cabaret’ Review: What Good Is Screaming Alone in Your Room?\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"Let me quickly add that Rebecca Frecknall’s production, first seen in London, has many fine and entertaining moments. Some feature its West End star Eddie Redmayne, as the macabre emcee of the Kit Kat Club (and quite likely your nightmares). Some come from its new New York cast, including Gayle Rankin (as the decadent would-be chanteuse Sally Bowles) and Bebe Neuwirth and Steven Skybell (dignified and wrenching as an older couple). Others arise from Frecknall’s staging itself, which is spectacular when in additive mode, illuminating the classic score by John Kander and Fred Ebb, and the amazingly sturdy book by Joe Masteroff. But too often a misguided attempt to resuscitate the show breaks its ribs.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"amNY - Review | Come for the preshow, stay for the ‘Cabaret’\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"One might question whether the lengthy prologue enhances or takes away from the musical itself, which together last approximately four hours (imagine sitting through “Macbeth” in its entirety after attending “Sleep No More”) and whether some of the other production choices and characterizations are too extreme. However, it all makes for an exciting, edgy, and painstakingly-detailed production.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Entertainment Weekly - Cabaret at the Kit Kat Club review: Eddie Redmayne and Gayle Rankin dazzle in jaw-dropping Broadway revival\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"While the Emcee adores all of the Kit Kat Club’s endlessly talented ensemble, it’s easy to see why he holds a special fondness for the cabaret’s headliner, Sally Bowles. Rankin is nothing short of spectacular as the ostentatious performer, knowing when turn on her character's charming nature and when to pull back the curtain to reveal a weariness that makes it feel as if life's hardships have been weighing on her shoulders for centuries. Still, when the curtain lifts and the spotlight beams down upon her, Rankin ensures that Sally transforms into an unforgettable star with her coquettish performances of Don't Tell Mama and Mein Herr. However, it's her rendition of Maybe This Time, soft and full of hopeful surrender, that truly makes Sally's eventual arc within the musical that much more affecting.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"TimeOut - Cabaret at the Kit Kat Club\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"Great expectations can be a problem when you’re seeing a Broadway show: You don’t always get what you hope for. It’s all too easy to expect great things when the show is a masterpiece like Cabaret: an exhilarating and ultimately chilling depiction of Berlin in the early 1930s that has been made into a classic movie and was revived exquisitely less than a decade ago. The risk of disappointment is even larger when the cast includes many actors you admire—led by Eddie Redmayne as the Emcee of the show’s decadent Kit Kat Club—and when the production arrives, as this one has, on a wave of raves from London. To guard against this problem, I made an active effort to lower my expectations before seeing the latest version of Cabaret. But my lowered expectations failed. They weren’t low enough.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Village Voice - Review: ‘Cabaret at the Kit Kat Club’ Works Too Hard But Finds Its Way\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"And then comes the show itself, which hasn’t upped the sexuality quotient, though it has definitely underlined what’s over the top. Everything that was extreme in previous productions is now even more so. As the Emcee of the Kit Kat Club, Oscar and Tony winner Eddie Redmayne has to separate himself from two legends (Joel Grey and Alan Cumming); he does so with exaggerated hand gestures and head bobbing and with vocal tics that sometimes resemble those of Jerry Lewis. Redmayne sings the show’s signature tune, “Willkommen,” in brown leather culottes, long black gloves, and a bright-blue party hat (costumes by Tom Scutt, who also did the sets), and seems to have veered outside the normal human range, going instead for a Cirque du Soleil meets demented puppet effect that’s often weird for weird’s sake. Each time Redmayne appears, the costumes grow more outlandish, though vocally his best moment is when his Emcee is dressed conservatively as a Master Race type, standing still and smoothly singing the Nazi anthem “Tomorrow Belongs to Me” to creepy effect. A succession of miniature wooden Redmayne dolls in the same garb (puppets of the puppet, as it were) appear on the edges of the rotating stage as he sings, foreshadowing the moment later in the show when the entire cast storms the stage, suited and looking like fascists. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Wall Street Journal - ‘Cabaret’ Review: Eddie Redmayne Takes the Kit Kat’s Stage\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"Among Ms. Frecknall’s innovations is an emphasis on dance, with Julia Cheng’s choreography making inventive use of the stage space as the club performers romp, stomp and shimmy around Mr. Redmayne, engaging in ribald movement that at one point includes such unlikely sexually tinged props as a whisk and a toilet plunger. Their thickly applied makeup, skimpy costumes—a green macramé bikini?—and multicolored hair are suggestive more of “RuPaul’s Drag Race” than a seedy European club of the period, but they undoubtedly add to the show’s arresting visual allure.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Theater - Cabaret Broadway Review\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"Luckily there are two performances that do more than their share in trying to right the imbalance.  Bebe Neuwirth is exquisite as Fraulein Schneider, the landlady of the boarding house where Clifford rents a room; she brings attention to songs that are not normally among the most memorable in the musical – “So What” and “What Would You Do,” — which drive home the real-life despair and high stakes then facing people in Germany. Her performance is matched by Steven Skybell, as Herr Schultz, one of her boarders. The two older characters gently fall in love, accompanied by some lovely melodies, “It Couldn’t Please Me More,” and  “Married.”  In the most effective scene in which the Emcee participates:, he wraps a wine glass in a napkin and steps on it – central to the traditional Jewish marriage ritual – but it’s accompanied not by hurrahs, but by a loud boom, darkness,  the sound of glass shattering, and the lights up on a fluttering of what might literally be stage confetti, but hits like a preview of Kristallnacht.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Post - ‘Cabaret’ Broadway review: Revival with Eddie Redmayne is luxe — and bleak\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"Yet the pricey bells and whistles distract from what is a so-so, overly dreary staging that is often undermined by its own overwrought machinations. Undeniably slick and handsome, this two-hour-and-forty-five-minute musical feels much longer than it should. That’s because, bizarrely for a production that is so determined to get its audience wasted, it’s hesitant to have too much fun itself.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Vulture - Dancing on the Surface in Cabaret and Orlando\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"It’s not that the performers aren’t trying. As the naïve, swept-away American narrator, Cliff Bradshaw, Ato Blankson-Wood is doing his best to bring vulnerability, sincerity, and even some dignity to the part; but it’s always a bit of a surprise to recall just how often Cliff is left on the sidelines, and just how little he sings (a real loss here, given Blankson-Wood’s gorgeous voice). And as the strung-out Kit Kat Club singer, Sally Bowles, Gayle Rankin is making every effort to leave her guts on the stage, but she’s not getting any help. Rankin has the ability to be wrenching and spectacular — I once watched her swim across a lake in the dark, climb out and play Nina’s devastating Act Four scene from The Seagull, get back in, and swim away again. But her delivery of “Maybe This Time” and of the show’s final drill to the stomach, its great title song, is hampered by extraneous gesture. She flickers between singing, talking, and half-singing in a way that feels like a misguided directorial attempt to make the songs new, but that ends up making Rankin seem nervous about her ability to deliver them. I have no doubt that she really can, and I wish Frecknall had helped her find more connection and more release.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Daily News - BROADWAY REVIEW: Interactive ‘Cabaret’ revival is a money-grabbing misfire\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"You may look at all this differently. But I have to say that selling a dinner “upgrade” to the “Pineapple Room” offends me. That fruit is what Herr Schultz offers to his love, prior to being shipped off to a concentration camp, or so the show strongly implies, given that he is already in the Nazis’ sights. In this show, fruit is a symbol of generosity and love in a world of horrors. It’s not a flavor of costly cocktail nor a high-end status symbol. How gross.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Theatrely -  A New CABARET For The Ages On Broadway — Review\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"Where I’m fascinated is that spark the production seems to have found over here in the States. I can’t necessarily pinpoint what particlualy changed but the world Frecknall has created now works for me. The team has produced a stunning feat the likes of which Broadway has not experienced in a while. If London is any indication, we are in for a long healthy run with exciting new stars every few months, and I look forward to experiencing the wonderment of the Kit Kat Club again and again. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Theatre Guide - 'Cabaret' review — 'Wilkommen' to a Kit Kat Club like no other\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"Kander and Ebb's Cabaret is a much-loved and -revived property such that its twists may not be secrets anymore. Despite the stellar Gayle Rankin’s best efforts to inject the latest revival with a sense of urgency as star performer Sally Bowles, director Rebecca Frecknall’s production, now on Broadway after winning multiple awards in London, stays stagnant. This is not due to the excellent company of dancers at the Kit Kat Club (into which the August Wilson Theatre has been remodeled), but to a disconnect between the production’s design and its book by the late Joe Masteroff.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - CABARET: COME FOR THE PRE-SHOW, AND OH, THERE’S ALSO THE MUSICAL\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"As for the show itself (I know, it almost seems like an afterthought), it has been given an undeniably powerful if somewhat imperfect staging. Among its chief strengths are its lead performances, or at least most of them, with Eddie Redmayne repeating his Olivier Award-winning performance (at least through early September) as the leering Emcee. He’s not quite as menacing as Alan Cumming in the Mendes production, at times seeming fragile and almost adorable. But the actor is certainly mesmerizing, using his angular physicality and androgynous looks to tremendous effect and employing his natural charisma to such a degree that you can’t take your eyes off him. During many dramatic scenes involving the other characters he silently lurks at the edge of the stage, doing nothing but making it seem like everything.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - CABARET: IMMERSIVE, AMBITIOUS, ALL TOO TIMELY\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"But Frecknall smartly blurs the lines. All we’re really sure of is that we’re in Weimar-era Berlin. When the Emcee sings the echoey, haunting Aryan anthem “Tomorrow Belongs to Me,” he’s wandering through some kind of dreamland populated by wooden doll-size white men. In “Maybe This Time,” while Sally imagines another life for herself—“Not a loser anymore/ Like the last time and the time before,” she sings—she’s technically in Cliff’s room, but she’s also in some other liminal space. (The self-searching songs, “Maybe This Time” and “Cabaret,” are Rankin’s most powerful numbers.) At the end of “What Would You Do?,” Fraulein Schneider is singing atop a platform in the middle of the stage. The lamps on the tables are lit—like we’re in the club watching a performance, not the devastation of a woman who’s just traded her happiness to guarantee her survival.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Daily Beast - Eddie Redmayne Excels as the Emcee in a Boozy Broadway ‘Cabaret’\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"This production wants you to have immense fun, and to never forget the well-known horrors just over its horizon—the relationship between Fraulein Schneider and Herr Schultz is imperiled by Nazism’s charge, a smashed window is stunningly conveyed by petals of falling paper. It also wants you to get, well, liquored up. Just what kind of night does Cabaret on Broadway intend you have? Glug pricey drinks and nibble on charcuterie and dwell on the effects of fascism, bigotry, and violence that Cabaret animates? The night this critic attended, an unruly person, likely inebriated, was thrown out for reaching at Redmayne.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Observer - This ‘Cabaret’ Is the Worst ‘Cabaret’\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"The unparalleled star power of Sally Bowles, the untalented and poverty-plagued good-time girl who sings and sleeps her way through the Berlin underground and charms pre-war Germany at any cost, is a dream that refuses to come alive in the woefully miscast Gayle Rankin. The greatest Sally in history is still Julie Harris in the black-and-white British film I Am a Camera (1955), from the play of the same name by John Van Druten, stunningly based on the autobiographical Berlin Stories by Christopher Isherwood. The most famous Sally will probably always be Liza Minnelli, who won an Oscar for the Technicolor movie by Bob Fosse. And the worst Sally is Gayle Rankin. With none of the glamour Julie Harris brought to the role and not a shred of Liza Minnelli’s vulnerability or poignancy, she hams it up all over the stage, massacring the songs and dedicating herself to the idea that no song is worth singing unless it can also be screamed. “Mein Herr” is now yelled with the fury of Medea killing her children, and both of the show’s enduring ballads, “Cabaret” and “Maybe This Time,” are all but incomprehensible. Clifford Bradshaw, the American character based on Isherwood, is now a boring bespectacled somebody played by someone named Ato Blankston-Wood, and if you can stand him, you can have him.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Wrap - ‘Cabaret’ Broadway Review: Eddie Redmayne Twists the Emcee Into a Rancid Pretzel\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"Equally etrange, Frecknell has cast Sally as the Emcee’s alter ego, or vice versa. Sally and the Emcee often dress alike, rip off wigs and sport their skull caps — and, most significant, Redmayne and Rankin have been directed to be abrasive to the extreme. Rankin is able to leaven some of this harshness because Sally is a real character. She convinces us that she’s simply out of control, afflicted with a severe bipolar disorder. Because Redmayne isn’t playing a character but rather a symbol of decadence, he presents nothing but a jumble of mannerisms.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Variety - ‘Cabaret’ Review: Eddie Redmayne and Gayle Rankin Lead High-Style Revival That Cuts to the Bone\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"All that stripped-down humanity onstage — from the entrails of broken lovers to the dancers’ carnal gyrations (choreography is by Julia Cheng) — make Redmayne’s Emcee a jarring exception. An otherworldly salamander of a narrator, he hunches over, Gollum-like, gnawing on every syllable as if it were his last meal. It’s a fiercely committed performance, but a mannered one, too. For the Emcee to exist as a creature apart makes narrative sense, but Redmayne’s remoteness drains some of the force from what is otherwise a grounded, gut-punching take on a disturbingly timely story. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Queerty - Eddie Redmayne leads a dazzling & dangerous ‘Cabaret at the Kit Kat Club’\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"We don’t have to look too far to see how quickly democracy can collapse. A presidential candidate facing 91 felony charges, “Don’t Say Gay” laws, and the proliferation of drag bans could push any of us to unleash our inner Sally Bowles. Redmayne, Rankin, and a smartly conceived Cabaret reboot shoot warning flares high into the sky. We only need to wander into the Kit Kat Club to discover a world mirroring our own.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Forward - ‘Cabaret’ will wine, dine and destroy you\",       \"datePublished\":\"2024-05-09T05:25:57-05:00\",         \"articleBody\": \"The triumph of this iteration is how it anticipates its audience, teasing them with frothy liberation before making them gasp at Nazi armbands and shattered windows. As the Emcee oversees, or even appears at times to orchestrate, these national contradictions, it’s hard not to feel queasy at the dissonance. Particularly, I’d imagine, if you paid the upcharge for a stage-side meal. When the drumroll closes the show, a new aesthetic takes hold, complete in its muted menace. Dramatic irony is the play’s engine; we know there’s no changing the outcome. But when we sit pretty at the Kit Kat Club — tipsy, titillated, terrified — it’s not too late for us.\"     }             ] }",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-CABARET-AT-THE-KIT-KAT-CLUB-Opens-on-Broadway-Updating-Live-20240421",
  "textStatus": "missing"
}
