{
  "showId": "cabaret-2024",
  "outletId": "the-telegraph-dominic-cavendish",
  "outlet": "The Telegraph (Dominic Cavendish)",
  "criticName": "Dominic Cavendish",
  "url": "https://www.telegraph.co.uk/theatre/what-to-see/cabaret-review-eddie-redmayne-dazzles-kill-for-a-ticket-theatrical/",
  "playbillVerdictUrl": "https://www.telegraph.co.uk/theatre/what-to-see/cabaret-review-eddie-redmayne-dazzles-kill-for-a-ticket-theatrical/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "UK Edition\n            \n        \n    \n\n\n\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\n\t\t\n\t\t\n\t\t\n\n\t\t\n\t\t\n\n\t\t\n\n\t\t\n\n\t\n\n\n\n\n            \n        \n    \n\n    \n\n\n\t\n\n\n\n\n\t\t\n\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\n\t\n\t\n\t\t\n\n\n\n\n\t\n\n\t\n\n\t\t\n\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\t\n    \n\n\t\n\t\n\n\t\n\n\n\n\n\n\n\t\t\n\t\t\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\n\n\n\n\t\n\t\n\n\t\n\n\t\t\n\n\n\n\n\n\t\n\n\t\n\t\n\n\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\t\n\t\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\n\t\t\t\t\n\n\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n\n\t\t\t\t\n\n   \n   \n\n    \n\t\t  \n        \n        \n          \n          \n\t\t  \n        \n        \n          \n          \n\t\t  \n        \n        \n          \n          \n\t\t  \n        \n        \n          \n          \n\t\t  \n        \n        \n          \n          \n\t\t  \n\t\t\n\t\n\n\t\t\t\n\n\t\t\t\n\t\t\n\n\t\t\n\t\t\n\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\t\n\t\n\t\n\n\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\tEddie Redmayne and Jessie Buckley in Cabaret, at the Playhouse Theatre\n\t\t\t\n\t\t\n\n\t\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t    Credit: Marc Brenner\n\t\t\t   \n\t\t\t\n\t\t\n\t\n\n\n\n\t\n\n\t\n\t\n\n\n\n\n\n\n\t\n\n\n\n\n\n\n\n\t\t\n\n\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\n\n\n\n\t\n\n\t\n\t\n\n\t\n\t\n\n\n\n\n\n\t\n    \n    \n\n    \n    \n    \n    \n    \n    \n\n    \n    \n\n    \n    \n    \n\n    \n        \n            \n\n            \n\n            \n                \n\n    \n    \n    \n    \n    \n    \n\n    \n    \n\n    \n    \n\n        \n        \n\n        \n        \n        \n\n        \n            \n                \n    \n        \n            Dominic Cavendish\n        \n    \n\n                \n    \n\n        \n            Chief Theatre Critic\n        \n\n        \n    \n\n            \n\n            \n                \n    \n    \n\n            \n        \n    \n    \n    \n    \n    \n    \n    \n    \n\n        \n            \n                Dominic Cavendish has been writing about theatre and comedy since the mid-1990s and became the Telegraph's lead theatre critic in 2014. \n                    See more\n                        \n\t\n\t\t\n\t\n\n                    \n                 He is the founding editor of the leading audio resource theatrevoice.com, now run by the V&A. In 2008, he adapted and produced the first UK stage adaptation of George Orwell’s Coming Up for Air.\n\nThis is it. This is the one. At the end of the year, Rebecca Frecknall’s production of Cabaret – starring Eddie Redmayne and Jessie Buckley – stands revealed as 2021’s kill-for-a-ticket theatrical triumph. It affirms the sensuous joy of performance after so much privation and brilliantly re-asserts the ability of Kander and Ebb’s 1966 classic, set in Weimar Germany amid the spectres of rising fascism, to send shivers down the spine; there are inevitable topical frissons too.\n\nFrecknall will make her name with her thrilling and thorough interpretation as surely as Sam Mendes did with his Donmar revival in 1993. Like him, she creates an immersive evocation of the Kit Kat Club, the early-1930s Berlin dive in which much of the action is set. She supercharges the ambience, though. The whole Playhouse has become a louche playground. In the modified auditorium, ranged with tables and with a raised, often revolving circular wooden stage at its heart, old-world decorum mingles with wild abandon.\n\nRedmayne, returning to theatre after a decade, offers a dazzling vision of the Emcee role, so long associated with Alan Cumming in the Mendes production, that makes it freshly glinting and sinister. As Sally Bowles, the English deb turned devil-may-care show-girl, Buckley achieves no smaller feat: she makes you laugh, breaks your heart, has you hanging on her every word – sung or otherwise. The Irish actress’s period accent and distinctive attitude, nonchalance combined with subtle forcefulness and vulnerability, sets her far from Liza Minnelli in the 1972 film.\n\nThe pre-show involves proffered schnapps and glimpses of scantily clad performers – imperviously circulating, getting in the zone musically, preening before mirrors. Then, in darkness, the long opening drum-roll ushers in the transfixing sight of a still, exaggeratedly stooped Redmayne.\n\nSporting an androgynous skort, tiny party-hat and attitude of leering mischief, he refashions the greeting song Willkommen, applying a thick, sickly Teutonic accent but ambushing you with roof-raising bellows, unpredictability the watchword.\n\nCabaret, at the Playhouse Theatre\n\t\t\t\n\t\t\n\n\t\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t    Credit: Marc Brenner\n\t\t\t   \n\t\t\t\n\t\t\n\t\n\n\n\n\t\n\n\t\n\t\n\n\n\n\n\n\n\n\n\n  \n  \n\n\t\n\n\t\n\t\n\n\t\n\t\n\n\n\n  \n  \n    Where Cumming was brazenly sexual, there’s something abstract and parodic about Redmayne’s nonetheless consummately physical characterisation, as if conjured from a nightmare. He keeps pivoting during that rabble-rousing first number, enacting a carousel of calibrated poses, like a figure from a musical-box.\n\nThen, his shrouded dancers suddenly revealed, he becomes the gleeful conductor of an orgiastic frenzy, scuttling impishly beneath artfully arranged legs and buttocks. The dancers – Julia Cheng’s choreography as meticulous as Frecknall’s direction – shift, in their sync’d twists and tilts, freezes, shakes and shimmies, between mesmeric insolence and menacing inhumanity. This reaches its zenith later with Money, Redmayne a skeletal mephisto in a cap reminiscent of an SS helmet, encircled by affectedly loping acolytes.\n\nThe intensified nature of Frecknall’s approach cleverly marries the work’s disparate worlds and, by degrees, the good times turn bad, the big-top sounds acquire a more militarised hue, and tenderness marches off. Liza Sadovy’s pragmatic landlady recoils from her Jewish suitor (kindly Elliot Levey). Bowles drifts from the increasingly disenchanted American writer Cliff – a charismatic and hypnotically alert Omari Douglas.\n\nHer journey towards the horns of a hellish dilemma – stay or go, but if the latter, where on earth to? – is delineated to perfection. The chameleonic Buckley makes her first big entrance in her flapper-age opening song Don’t Tell Mama, springing through a central stage aperture like a petticoated doll let dementedly loose.\n\nIn the second half, in a jaw-dropping re-imagining of the title number, the lyrics are delivered not with familiar Broadway-ish reassurance but numb defeat rising to thrashing, yowling anguish.\n\nIn an unforgettable exit, the actress plunges, grey-suited, down through the stage, her face a Munch scream, her arms flung madly aloft. That image alone is worth the hefty price of admission. Never mind “Willkommen, bienvenue, welcome”. I’d say, dig like your life depended on it into your pockets, and Gehen, allez, go.\n\nBooking until October. Tickets and details: 0333 009 6690; kitkat.club\n\nTo see a list of our partners and check how your data might be used, click or tap ‘Manage’ below. You can also review where our partners claim a legitimate interest to use your data and, should you wish, object to them doing so.",
  "isFullReview": true,
  "textWordCount": 779,
  "archivePath": "data/archives/reviews/cabaret-2024/the-telegraph-dominic-cavendish--dominic-cavendish_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:17:12.578Z",
  "designation": "Recommended",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee"
}