{
  "showId": "cabaret-2024",
  "outletId": "the-guardian-arifa-akbar",
  "outlet": "The Guardian (Arifa Akbar)",
  "criticName": "Arifa Akbar",
  "url": "https://www.theguardian.com/stage/2021/dec/13/cabaret-review-eddie-redmayne-playhouse-theatre",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2021/dec/13/cabaret-review-eddie-redmayne-playhouse-theatre",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The Kit Kat Club at the Playhouse theatre, LondonRedmayne and Jessie Buckley ‘Willkommen’ us into this Weimar-era Berlin nightclub for an evening of flamboyance, menace and magnetism This revival of John Kander and Fred Ebb’s 1966 musical might as well come with its own distinctive Kit Kat Club drumroll: one of the hottest – and more expensive – tickets of the year, its high concept staging extends across the venue, turning the foyers and the facade into the Weimar-era Berlin cabaret club in which its drama is set. There is also the drum-roll hype of Eddie Redmayne’s casting as the club’s impish Emcee. Appearing on a London stage for the first time in a decade, he has a long way to fall in a part whose songs, interspersed through the show, are central to its shifting tone, from the permissiveness and bonhomie of the late 1920s to the rise of the Third Reich. But from the moment we are “Willkommened” by Redmayne, it is clear he is in control of his material and electric in his part. As the soiled soul of Berlin, Redmayne’s Emcee mirrors the movement from light to dark; he is a comically twisted Rumpelstiltskin at the start, uncoiling to a figure resembling a terrible evil fairy or angel of death by the end. There are several moments at which we catch our breath, one coming in “If You Could See Her” in which he pushes the comic absurdism of singing a soppy love song to a gorilla and then chills us with the last, antiSemitic line, spat out like snake venom rather than whispered like Joel Grey’s comic aside in the 1972 film. It does not matter that Redmayne’s voice is drowned out by the orchestra at times. He gives an immense, physicalised performance, both muscular and delicate, from his curled limbs to his tautly expressive fingertips. Rebecca Frecknall’s production on the whole lives up to its hype, magnetising us with flamboyant camp and then delivering menace that feels freshly charged. Jessie Buckley, as Sally Bowles, first emerges as a glassy-eyed, underage sex-bomb – an obscene Shirley Temple in a frou-frou dress. Buckley plays her as the opposite of Liza Minnelli’s fun-loving chanteuse. Here she is a plummy-voiced Sloane who is emphatically unsexy with an edge of severity. But she sings with astonishing command, and there is an especially breath-taking version of “Cabaret” which is full of zombie-like darkness that sucks all of Minnelli’s froth out of it. Omari Douglas brings a gentle sweetness to his part as the bisexual American novelist, Clifford Bradshaw, but seems hemmed in by the role, as muted as his beige suit, though there is one flaring moment of passion when he kisses another man. Together, they do not spark romantic chemistry as the central couple. Their scenes together feel static and are side-lined by the passion of the show’s older couple: the boarding house landlady, Fraulein Schneider (Liza Sadovy), and the Jewish grocer, Herr Schultz (Elliot Levey). They become this production’s heart, first surprised to have found love so late and then broken when Nazi fervour drives them apart. “What Would You Do?” sings the Fraulein, and we feel her caught between the immovable forces of fascism, survival, and love. Together, they are magnificently tender and tragic. Tom Scutt’s stage design is expressionistic and imaginative: a train journey is represented by a model train revolving around the outer part of the three-tiered, circular stage. “Tomorrow Belongs to Me” has miniature model men standing to attention on the revolve, replaced by real men in its reprise, which is infused with ominous, stomping movements and a martial drum beat, prefiguring the terror to come. The auditorium is re-arranged with tables and chairs which creates the intimacy of a cabaret club, accompanied by Isabella Byrd’s cleanly sensational spot-lighting. Some of the early scenes seem like discrete warm-up acts, filled with romp, burlesque and transgressive naughtiness. The minor characters are beautifully realised too: Cliff’s friend, Ernst (Stewart Clarke), never loses his affability even after he reveals himself a Nazi. The Kit Kat Club’s dancers are by turns vulgar, comical and sexy with a thrilling blend of genders, and the musical comedy tickles with cartoonish charm, especially as Fraulein Kost (Anna-Jane Casey) smuggles her night trade of sailors into the boarding house. “Two Ladies” looks like a hazy theatrical wet dream, staged amid an orgy of tangled bodies – one character masturbates to Mein Kampf and another makes luridly suggestive moves on a sink plunger. Occasionally, it verges on outre overload. In the far shorter and overly sinister second half, Julia Cheng’s sinewy and soaring choreography is key to the tip from hedonism to hate: high-kicks start to resemble goose-steps and street violence is conveyed in a dance of outstretched limbs and a jacket balled in the fists of the performers. Redmayne creeps around the fringes of the stage when he is not performing, watching scenes from afar. If this show is sold on his star turn, we get more than our money’s worth with his blinding performance – in this blinder of a show. Cabaret is at the Playhouse theatre, London, until 1 October 2022. We hope you appreciated this article. Before you close this tab, we want to ask if you could support the Guardian at this crucial time for journalism in the US. In his first presidency, Donald Trump called journalists the enemy; a year on from his second victory, it’s clear that this time around, he’s treating us like one. From Hungary to Russia, authoritarian regimes have made silencing independent media one of their defining moves. Sometimes outright censorship isn’t even required to achieve this goal. In the United States, we have seen the administration apply various forms of pressure on news outlets in the year since Trump’s election. One of our great disappointments is how quickly some of the most storied US media organizations have folded when faced with the mere specter of hostility from the administration – long before their hand was forced. While private news organizations can choose how to respond to this government’s threats, insults and lawsuits, public media has been powerless to stop the defunding of federally supported television and radio. This has been devastating for local and rural communities, who stand to lose not only their primary source of local news and cultural programming, but health and public safety information, including emergency alerts. While we cannot make up for this loss, the Guardian is proud to make our fact-based work available for free to all, especially when the internet is increasingly flooded with slanted reporting, misinformation and algorithmic drivel. Being free from billionaire and corporate ownership means the Guardian will never compromise our independence – but it also means we rely on support from readers who understand how essential it is to have news sources that are immune to intimidation from the powerful. We know our requests for support are not as welcome as our reporting, but without them, it’s simple: our reporting wouldn’t exist. Of course, we understand that some readers are not in a position to support us, and if that is you, we value your readership no less. But if you are able, please support us today. All gifts are gratefully received, but a recurring contribution is most impactful, helping sustain our work throughout the year ahead (and among the great benefits, it means we’ll show you fewer fundraising requests like this). It takes just 37 seconds to give. Thank you.",
  "isFullReview": true,
  "textWordCount": 1249,
  "archivePath": "data/archives/reviews/cabaret-2024/the-guardian-arifa-akbar--arifa-akbar_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:08:06.867Z",
  "designation": "Recommended",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}