{
  "showId": "cabaret-2024",
  "outletId": "the-hollywood-reporter-demetrios-matheou",
  "outlet": "The Hollywood Reporter (Demetrios Matheou)",
  "criticName": "Demetrios Matheou",
  "url": "https://www.hollywoodreporter.com/lifestyle/arts/cabaret-eddie-redmayne-jessie-buckley-theater-review-1235060231/",
  "playbillVerdictUrl": "https://www.hollywoodreporter.com/lifestyle/arts/cabaret-eddie-redmayne-jessie-buckley-theater-review-1235060231/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "&#8220;What good is sitting alone in your room? Come hear the music play.&#8221; Whatever the bitter undertow of Cabaret&#8216;s signature song, its seductiveness has particular resonance in these blustery, Covid-ridden nights. This show just keeps on giving.\n\nThere have been numerous revivals, notably Sam Mendes' dark, sexy 1993 Donmar Warehouse production and its many Broadway iterations co-directed with Rob Marshall (most recently starring Alan Cumming with Michelle Williams, and later, Emma Stone), which may represent a daunting benchmark for bringing the John Kander-Fred Ebb-Joe Masteroff classic to life.\n\nWhile Rebecca Frecknall's offering bears a certain kinship to the Mendes/Marshall model — in its manifestation of the Kit Kat Klub offstage as well as on, its lusty, comic vitality and a larger-than-life Emcee — it confidently charts its own course. Transforming one of the West End's smaller theaters into an intoxicatingly immersive space, and with its star pairing of Eddie Redmayne and Jessie Buckley, this is spectacularly staged, fabulous fun — decadent, delightful and absorbing.\n\nRelated Stories\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\n\t\n\t\n\t\t\t\t\t\n\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\n\t\t\n\t\t\n\t\n\t\n\t\t\n\t\t\n\t\t\t\t\t\n\t\t\t\n\t\n\tBusiness\n\t\t\t\n\t\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\tBroadway Musicians Reach Tentative Agreement, Averting Strike\t\t\n\t\t\t\n\t\n\n\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\n\t\n\n\t\t\t\t\t\t\t\n\n\n\t\t\n\t\n\t\n\t\t\t\t\t\n\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\n\t\t\n\t\t\n\t\n\t\n\t\t\n\t\t\n\t\t\t\t\t\n\t\t\t\n\t\n\tBusiness\n\t\t\t\n\t\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\tBroadway Box Office: &#039;Chess&#039; Gets Strong $1.2 Million Start\n\nThe Playhouse has been reorganized to give the feel of a club as soon as visitors enter via the basement and walk through smoky corridors into a cozy bar, where schnaps is served and in whose alcoves musicians play, then up again into a gilded space for more exotically garbed music and dance.\n\nInside the auditorium, the staging is in the round, the musicians perched above and to either side. As seats are taken, there&#8217;s a sense of occupying an intimate arena with a dimly lit, faded grandeur. As with those Studio 54 outings, it&#8217;s a wholly logical and enticing way to warm up the punters. And lest anyone should still be cold, two minutes in the company of Redmayne's master of ceremonies will remedy that.\n\nJust as Cumming rebooted the persona of the Emcee created by Joel Grey, so Redmayne offers another, extravagant take of his own. From the moment he launches into &#8220;Willkommen,&#8221; dressed in vest and baggy purple pants, a party hat perched on his head, his body arched, German accent harsh and mocking as he introduces his band of dancers, Redmayne exerts a mesmerizing hold that never falters.\n\nAs we know from Les Miserables, he has a strong singing voice. He's also quite the clothes horse, which serves an Emcee who is something of a chameleon abstraction, the perfect mirror both of the permissive decadence and freedom of self-expression of Weimar Berlin, and the evil to come.\n\nFor &#8220;Money,&#8221; he rises from the floor like a demonic creature, clad in black with skeletal markings and a helmet; for his cutely choreographed dance with a gorilla and the anti-Semitic kick in the teeth of &#8220;If You Could See Her,&#8221; he&#8217;s in resplendent clown costume; when he appears in a conventional, if immaculately tailored suit, it&#8217;s quite a shock.\n\nThe actor can sometimes be overly mannered (as on screen) and misses the flesh-and-blood, wink-wink familiarity that Cumming gave the character. But Redmayne remains audaciously effective, exuding charisma and menace, along with a suggestion of melancholy in the margins, and with a degree of showmanship that matches Cumming&#8217;s.\n\nThe characterization of the Emcee is in keeping with Frecknall&#8217;s spin on the material, which accentuates the promiscuous, sexual and gender fluid world of the Kit Kat Klub. Designer Tom Scutt&#8217;s fabulous costuming — an explosion of color and detail, burlesque with knobs on — makes little distinction between male and female dancers, while choreographer Julia Cheng has them moving like fiends on the revolving stage, sometimes contorted and snarling in the orbit of their eerie ringmaster. &#8220;Two Ladies,&#8221; which usually involves the Emcee and two of his troupe, turns into a pansexual orgy.  The conception is at once dynamic and liberating.\n\nAway from the club, where we&#8217;re meant to find the heart and drama of the musical, there are mixed returns. Liza Sadovy gives a funny, spiky, ultimately heart-breaking performance as boarding house landlady Fraulein Schneider, whose romance with Jewish fruit vendor Herr Schulz (Elliot Levey) is disrupted by the Nazis; she and the also excellent Levey turn the paean to pineapples, &#8220;It Couldn&#8217;t Please Me More,&#8221; into a masterclass in innuendo and comic timing.\n\nFraulein Schneider&#8217;s running battle with the boarder-prostitute with a penchant for sailors, Fraulein Kost (Anna-Jane Casey), is also a hoot, while Kost has a key role in the reprise of &#8220;Tomorrow Belongs to Me&#8221; and the chilling moment when the lovers&#8217; world is turned upside-down.\n\nBut what of the other romance, between American ex-pat writer Cliff Bradshaw (Omari Douglas) and the indomitable Sally Bowles? It's here that the show perplexes. The phenomenally gifted Buckley is as much a sell for the production as Redmayne, yet she seems strangely absent from it.\n\nSally is a tough nut to crack: she&#8217;s meant to be a third-rate singer, but we need to be stirred by her numbers; she&#8217;s vulnerable, probably an alcoholic, but goes to enormous lengths to hide her fears. Buckley captures the delusional amateur, but offers too little sense of what&#8217;s going on beneath the nicely spoken, rather bland English demeanor, or the tools the character is using to navigate her predicament.\n\nArguably the actress is the only one on stage poorly served both by the round (&#8220;Maybe This Time&#8221; is severely undermined by her having to sing directly to Douglas and side-on to the audience) and Scutt, whose choices for Sally are somewhat dowdy, green fur coat notwithstanding.\n\nAnd then, right at the death, Buckley knocks the title song, &#8220;Cabaret,&#8221; out of the park, unleashing so much despair and anger and roaring defiance that you can only wonder where it&#8217;s been all this time. The few glimpses have not been with Douglas, who&#8217;s a bit wet as the writer, but in the brief moments that Sally shares the stage with the Emcee, revealing the kindred spirit between these two fake redheads and floundering souls.\n\nInterestingly, Redmayne could just as easily have been cast as the writer (he bears a passing resemblance to Michael York, from Bob Fosse&#8217;s film version), which might have elevated Buckley closer toward her own, very high bar. But then we wouldn&#8217;t have his Emcee, or half as much fun.\n\nVenue: Playhouse Theatre, London\nCast: Eddie Redmayne, Jessie Buckley, Omari Douglas, Liza Sadovy, Elliot Levey, Stewart Clarke, Anna-Jane Casey\nDirector: Rebecca Frecknall\nMusic: John Kander\nLyrics: Fred Ebb\nBook: Joe Masteroff, based on the play by John van Druten and stories by Christopher Isherwood\nSet and costume designer: Tom Scutt\nLighting designer: Isabella Byrd\nSound designer: Nick Lidster\nMusic supervisor and director: Jennifer Whyte\nChoreographer: Julia Cheng\nPresented by Ambassador Theatre Group Productions and Underbelly",
  "isFullReview": true,
  "textWordCount": 1117,
  "archivePath": "data/archives/reviews/cabaret-2024/the-hollywood-reporter-demetrios-matheou--demetrios-matheou_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:04:34.141Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251025201154",
  "archiveOrgUrl": "http://web.archive.org/web/20251025201154/https://www.hollywoodreporter.com/lifestyle/arts/cabaret-eddie-redmayne-jessie-buckley-theater-review-1235060231/"
}