{
  "showId": "cabaret-2024",
  "outletId": "the-daily-mail-patrick-marmion",
  "outlet": "The Daily Mail (Patrick Marmion)",
  "criticName": "Patrick Marmion",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-10302945/At-Eddies-Cabaret-sets-wunderbar-PATRICK-MARMION-reviews-Cabaret.html",
  "playbillVerdictUrl": "https://www.dailymail.co.uk/tvshowbiz/article-10302945/At-Eddies-Cabaret-sets-wunderbar-PATRICK-MARMION-reviews-Cabaret.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "By PATRICK MARMION FOR THE DAILY MAIL\n\nPublished:  21:07 EST, 12 December 2021   |  Updated:  02:13 EST, 13 December 2021\n\nCelebrities opted for an androgynous look at the gala opening night of West End musical Cabaret starring Eddie Redmayne on Saturday.\n\nHayley Atwell, 39, of the Avengers movies wore a tuxedo-style outfit complete with bow tie and carried a cane, while The Crown star Emma Corrin, 25, chose a black jacket over a black T-shirt.\n\nThey were joined by guests including actor Tom Hiddleston, model Lily Cole and American singer Courtney Love for the production at the Playhouse Theatre, which has been turned into a pre-war Berlin-style nightclub for the run of the musical.\n\nThe Kit Kat Club, Playhouse Theatre, London\n\nWillkommen, and bienvenue, welcome!’ Eddie Redmayne is now officially up and running as the sinister Emcee in what’s likely to become the West End’s hottest ticket: The latest revival of the Berlin nightclub musical Cabaret.\n\nBut what is the Oscar-winning star of The Theory Of Everything like? Answer: ‘Nicht schlecht’, or not bad, as they say on Google translate.\n\nIt’s a mistake, though, to think the show’s all about him – even if Alan Cumming did just that when he played the same role in Sam Mendes’s 1993 production. His character is after all just the master of ceremonies at a seedy Weimar Republic dive bar in 1920s Germany.\n\nJohn Kander and Fred Ebb’s musical is really about the feisty singer Sally Bowles (Jessie Buckley) and Clifford Bradshaw, the young American writer who becomes her lover – a revelation here in the form of Omari Douglas.\n\nStars: Eddie Redmayne and Jessie Buckley. Eddie Redmayne is now officially up and running as the sinister Emcee in what’s likely to become the West End’s hottest ticket: The latest revival of the Berlin nightclub musical Cabaret\n\nThe other big star here though is Tom Scutt’s astonishing makeover of the Playhouse Theatre: Transforming the West End venue into a very swanky speakeasy.\n\nScutt’s refurb goes right down into the woodwork, with seats in the stalls fitted with ledges for all important ‘refreshments’. That also means more leg room... it’s like travelling business class, danke schon!\n\nAnd above the stalls either side of the small round stage, two dress circles wreathed in tasselled fabrics, peer down on the action.\n\nWe are urged to arrive early to soak up the Club’s atmosphere, as gaudily made-up actors move through the art deco-styled bars, one carving through the strings of a violin with her bow, another vigorously throttling an accordion and a third blasting smoky atmosphere from a saxophone – while dancers twerk on a balcony or grind hips on a marble bar.\n\nTassels galore: The chorus of drag queens and can-can girls. It may be a little parsimonious in its pleasures, but this eagerly anticipated new staging of Cabaret certainly looks good, sounds good – and runs like clockwork\n\nJohn Kander and Fred Ebb’s musical is really about the feisty singer Sally Bowles (Jessie Buckley) and Clifford Bradshaw, the young American writer who becomes her lover – a revelation here in the form of Omari Douglas\n\nOnce the show gets under way, Redmayne’s ginger-wigged Emcee flounces about on stage like a cross between a Nosferatu vampire and Marcel Marceau.\n\nHe contorts himself strenuously into anguished configurations, spitting out his opening Willkommen number, while tossing in a few lewd gags.\n\nHe’s not a natural comedian, and the diction of his singing voice is sometimes lost in a strangled, Dustin Hoffman squawk.\n\nBut linking the scenes in Rebecca Frecknall’s self-consciously stylish production, he’s conventionally and suitably creepy.\n\nNo one, however, is likely to accuse the show of being sexy. Frecknall has successfully circumnavigated that particular modern minefield.\n\nBuckley’s tomboy Sally eschews the raunchy flamboyance of Liza Minnelli’s famous turn in the role on the big screen, and focuses on her anguish – pretending to be more confident of her sexuality than she really is.\n\nAnd although she spells that out in a bitter rendition of the title number, her soft, dusty voice makes her pain sympathetic.\n\nTheatregoers are more likely to get excited by Douglas. Wearing a gorgeous long grey woollen coat and impeccably tailored suit, he starts out as the most dapper ‘starving writer’ I’ve ever seen. If this be starvation, give me excess of it!\n\nBut he brings strength of character to an often sappy role – and gives Buckley a real lift in their scenes together.\n\nSome of the best, damn near show-stealing, moments, though, come from Liza Sadovy and Elliot Levey as the aging landlady and her gently saucy Jewish admirer.\n\nOtherwise, the curious paradox of this show about sexual revolution is its surly, sexless chorus of dancers. On the stage’s petite podium, they are a set of grumpy drag queens and sullen can-can girls in heels and lederhosen.\n\nIt may be a little parsimonious in its pleasures, but this eagerly anticipated new staging of Cabaret certainly looks good, sounds good – and runs like clockwork.\n\nEmbed icon\n  \n    \n    \n    \n    \n  \n Embed Most Watched Videos\n    \n      Choose a theme\n      \n        \n  Dark theme\n  \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n  \n Dark\n        \n  Light theme\n  \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n  \n Light\n      \n    \n    <iframe style=\"width:1px;min-width:100%;height:352px\" src=\"https://www.dailymail.co.uk/api/most-watched-videos/news/dark\" frameborder=\"0\" scrolling=\"no\"></iframe>\n    \n      By embedding this you agree to our terms and conditions\n    \n    \n      Cancel\n      Copy code\n  Tick icon\n  \n    \n  \n Code copied\n    \n    \n  Close icon\n  \n    \n  \n\n  \n\n\n        \n        \n            \n                    \n                        \n                                \n                            \n                                Men seen leaving park after allegedly targeting 12-year-old\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                Train plows into semi cab stuck on tracks in blizzard-hit NC\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                Andrew Mountbatten-Windsor seen for first time after files\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                Candace Owens leaks Erika Kirk call from days after Charlie's...\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                Horrific car pileup closes Highway 99 in California\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                Railway guard back to work after sexually assaulting a girl\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                Dispatch audio reveals Catherine O'Hara was having medical...\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                DOJ releases video of the inside of Jeffrey Epstein's jail cell\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                Donald Trump says 'big powerful ships' are on their way to Iran\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                Suspected bloodstains visible at home of murder-suicide\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                Explosions rock Iran after Trump threatened to attack regime\n                            \n                            \n                        \n                    \n                    \n                        \n                                \n                            \n                                Self-driving taxi films itself running red light in London\n                            \n                            \n                        \n                    \n            \n        \n    \n\n  \n\n            \n            \n            \n            \n              \n                \n              \n            \n            \n            \n            \n            \n            \n            \n            \n            \n            \n            \n\n\nComments (1)Log inCommenting on this article has ended\n\nAre you sure you want to delete this comment?\n\nJessie Buckley is massively talented as well as Eddie. Would love to see this.\n\n40The opinions and views expressed in the comments section are solely those of the individual users and do not represent or reflect the opinions, views, or positions of Daily Mail. Daily Mail does not endorse, support, or verify the accuracy of any user-generated content.\n\nTo view this video please enable JavaScript, \nand consider upgrading to a web browser that supports HTML5 video\n\nBeginning of dialog window. Escape will cancel and close the window.",
  "isFullReview": true,
  "textWordCount": 1086,
  "archivePath": "data/archives/reviews/cabaret-2024/the-daily-mail-patrick-marmion--patrick-marmion_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:17:05.228Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee"
}