{
  "showId": "cabaret-2024",
  "outletId": "TIMEOUT",
  "outlet": "TimeOut",
  "criticName": null,
  "url": "https://www.timeout.com/london/theatre/cabaret-3",
  "publishDate": null,
  "fullText": "This review is of the original 2021 cast. Reeve Carney and Eva Noblezada will play the Emcee and Sally Bowles until Jan 24 2026. Come to the cabaret, old chums, and see the stage performance of the year from Jessie Buckley! Gasp at the terrific supporting cast in Rebecca Frecknall’s luxury revival of Kander & Ebb’s musical masterpiece, foremost Omari Douglas’s passionate, tender, little boy lost Clifford! Be wowed by Tom Scutt’s literally transformative design! Wonder at the free schnapps you’re offered on the way in, and nod in polite appreciation at the pre-show entertainment! Now, I have absolutely nothing against the guy. But the presence of any hugely famous, Oscar-winning star is bound to distort the role of the Emcee of the Kit Kat Club, the Weimar-era Berlin bar in which Cabaret’s tragic heroine Sally Bowles plies her trade. The Emcee is a vital supporting role: his sardonic songs set the mood of the show, and map Germany’s descent into darkness. But it’s in no way the lead part – in fact, the character barely interacts with the actual story. Putting by far the most famous actor in the show in the role would be enormously distracting even if Redmayne didn’t do… all this. Wearing a series of beautiful, subtly sinister outfits that kind of feel like they’re trying to process every single one of David Bowie’s sartorial choices from ’73 to ’83 (more on designer Tom Scutt later), the Oscar-winner really goes for it as the Emcee. Indeed, I’d venture he goes too hard. In the past, he’s attracted flak for playing trans and disabled characters. At the heart of this, I’m sure, is his desire to throw himself into transformative, taxing roles, which is clearly what he’s gone for here. When the Emcee first appears, he’s a sort of gawky outsider, clumping about the stage with a dunce’s hat on. He’s hunched over, his limbs twisted and awkward, with a strange tremor to his voice… frankly it kind of feels like he’s ‘cripping up’ again (perhaps as a polio victim?). Because we never learn anything about the Emcee as a person it is perfectly possible to embellish him with these details. But does it help the production? Do we need to see the biggest name push himself the furthest? Redmayne’s Emcee goes on a journey that physically parallels Germany’s post-WW1, eventually emerging as a disconcertingly suave Aryan matinee idol (aka his Let’s Dance phase). It’s an intensely busy performance, that surely scratches whatever acting itch Redmayne had, as he dances and sings and twists and hisses and puts his eerily boyish good looks to great use, like a sinister doll. But shouldn’t the character be support for the main plot, not the main event? Yes, the increasingly nasty turn in his songs was always allegorical for Berlin’s fall into darkness. But this production really hits us around the head with it. Do we need the Emcee to be an elaborate physical metaphor for Germany’s slide into Nazism, in a show that is literally about Germany’s slide into Nazism? The Emcee is a great role. But I don’t think it helps anyone to approach it as if it’s Hamlet. Still, accepting Redmayne’s performance is very much a thing, even its wildest excesses don’t get in the way of Cabaret’s true lead performance. Jessie Buckley’s star has been on the rise ever since she starred in the talent show I’d Do Anything as a teen: she followed it by going to drama school and building a credible screen and stage career. But a Bafta-nominated turn in the film Wild Rose has really amped up her stature. Her Sally is some of the usual things: posh, inscrutable, maddeningly oblivious to the rise of Nazism. But she’s no ingenue or sex kitten: she’s a roaring force of nature, a proper rock star, vamping about in a green faux-fur coat, absolutely not giving a stuff what anybody thinks about her. In many of the later scenes she’s free of make-up, her severe bob the only ornate thing about her as she shuffles about in bare feet and a dowdy white shift. But she is always utterly magnetic, a force of nature. As is tradition, Sally’s singing is a little off-key. Yet the power behind Buckley’s rough vocals is astonishing, and you can feel Sally come to life in the club scenes: she lives for this, a supreme performer, and you can see why she finds it so difficult to leave. Her final appearance, performing the musical’s title song, is absolutely astonishing: she’s dull-eyed and defeated, but the tune forcibly animates her body, ripping through her deadened limbs like a torrent of electricity, her despairing snarl of ‘come to the cabaret old chums’ more Kurt Cobain than Liza Minelli. Almost in the same league is It’s a Sin star Omari Douglas as Clifford, the penniless, wandering American who falls in with Sally and, for a time, almost persuades her to leave her world. He has an intensity but also a deep vulnerability from the off – not the booming American who only reveals his secrets drop by drop, but a beautiful and different young man whose guilelessness, honesty and – frankly – need of mothering overrides Sally’s natural defences. There’s also lovely work from Elliot Levey as kindly old Jewish fruit seller Herr Schultz and Liza Sadovy as Clifford’s landlady Fraulein Schneider – the fate of their sweet, courtly romance in the face of Nazi disapproval drives events in the story. And I’ve not even mentioned the design! For the purpose of this run, the Playhouse Theatre has been heavily retooled by designer Tom Scutt, and literally renamed the Kit Kat Club. There’s maybe something a little gauche about the idea on paper, but the fact of the matter is that the Playhouse was kind of a dive, and Scutt’s revamp is extremely classy. From opening up backstage areas and drenching them in atmospheric lighting to creating a secondary, gold-draped performance space for the fun (if inessential) pre-show cabaret-with-a-small-c entertainment, it’s full of quietly spectacular little flourishes. Tickets are expensive – the priciest come in north of £300, and include a tasting menu – but there’s no denying that you can see where the money’s been spent, and the main theatre is beautifully remodelled: in the round and intimate, with no bad seats, and the stalls replaced by compact two-person tables with lamps that cleverly form part of Isabella Byrd’s lighting design. Really the whole production is a triumph for Scutt, who not only remodelled the theatre and designed the set, but created the costumes too. I’m not going to pretend I’m any sort of expert in the apparel of the clubs of the late Weimar Republic. But I’d say Scutt has channelled their spirit, added some alluringly anachronistic modernism, and moved things away from the slightly naff ‘sexiness’ of recent productions of this show: costumes are angular, vivid, somewhat grotesque; the performers’ faces are sardonic, or sinister, not submissive or lusty. There is an alien harshness and a sense of confrontation and mischief, a feeling we have left the world behind: you really can picture this place as a strange nocturnal bubble removed from the increasingly grim realities of the Germany outside. It’s a lot. There’s the Hollywood superstar off doing his own thing. There’s the radical redesign of the theatre, and the bells and whistles that come with that. There’s the costumes and overtly queer aesthetic – the desire to adopt some of the characteristics of a safe LGBTQ+ space. And then the actual, brilliant, chilling story of Cabaret, superbly realised, with a performance from Jessie Buckley that deserves to win awards. Frecknall’s show doesn’t need all of this to work, and in places less could have been more. But fundamentally, it’s a production of Cabaret that’s good enough to triumph over the myriad distractions it throws in its own path. Been there, done that? Think again, my friend. By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. Thanks for subscribing! Look out for your first newsletter in your inbox soon! Discover Time Out original video",
  "isFullReview": false,
  "bwwExcerpt": "and \"Mein Herr.\" However, it's her rendition of \"Maybe This Time,\" soft and full of hopeful surrender, that truly makes Sally's eventual arc within the musical that much more affecting. Adam Feldman, TimeOut: Great expectations can be a problem when you’re seeing a Broadway show: You don’t always get what you hope for. It’s all too easy to expect great things when the show is a masterpiece like Cabaret: an exhilarating and ultimately chilling depiction of Berlin in the early 1930s that has been made into a classic movie and was revived exquisitely less than a decade ago. The risk of disappointment is even larger when the cast includes many actors you admire—led by Eddie Redmayne as the Emcee of the show’s decadent Kit Kat Club—and when the production arrives, as this one has, on a wave of raves from London. To guard against this problem, I made an active effort to lower my expectations before seeing the latest version of Cabaret. But my lowered expectations failed. They weren’t low eno",
  "originalScore": null,
  "assignedScore": 88,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-CABARET-AT-THE-KIT-KAT-CLUB-Opens-On-Broadway-20240422",
  "textStatus": "complete",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.970Z",
  "showScoreExcerpt": "But fundamentally, itâs a great production of âCabaretâ thatâs good enough to triumph over the myriad distractions it throws in its own path.",
  "textWordCount": 1376,
  "textFetchedAt": "2026-01-25T14:24:14.604Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/cabaret-2024/TIMEOUT--unknown_2026-01-25.html",
  "textQuality": "partial",
  "sourceMethod": "bww-roundup",
  "scoreSource": "sentiment-strong-positive",
  "scoreConfidence": "medium"
}