{
  "showId": "cabaret-2024",
  "outletId": "variety-david-benedict",
  "outlet": "Variety (David Benedict)",
  "criticName": "David Benedict",
  "url": "https://variety.com/2021/legit/reviews/cabaret-review-eddie-redmayne-1235131905/",
  "playbillVerdictUrl": "https://variety.com/2021/legit/reviews/cabaret-review-eddie-redmayne-1235131905/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Ever since Bob Fosse cast a never-better Liza Minnelli in his Oscar-winning re-imagining of the musical \"Cabaret,\" revivals of the original musical have leaned toward being \"All About Sally.\" Then Sam Mendes came along with his Broadway version with lascivious Alan Cumming, turning it into \"All About The Emcee.\" The triumph – that's not too strong a word – of director Rebecca Frecknall's stunner of a production is that, despite piercing performances from Jessie Buckley and Eddie Redmayne, her supremely intelligent, emotionally draining vision of the show turns it, enthrallingly, into \"All About Berlin.\"\n\nRelated Stories\t\t\n\t\n\n\t\n\t\t\n\t\t\t\t\t\t\t\n\n\t\n\t\n\t\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\tAlauda Ruiz de Azúa’s ‘Sundays’ Gets a Trailer, Dropped by Movistar Plus+ \t\t\n\t\t\t\n\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\n\t\n\t\n\t\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\tDirector Jaume Claret Muxart Is Hooked on a Feeling After Exploring First Crush in ‘Strange River’: &#039;I’m Not Done With Love’\n\nPrior to opening, the production's talking point (in addition to the hot casting) was the ticket price, a London record at &pound;250 ($332) – or, with dinner and champagne thrown in, &pound;325 ($430). For that, audiences don't just sit in their seats; they get to experience extensive pre- and post-show drinking, dance and erotic display in newly built bars and passageways and on stage in a formerly 832-seat West End house now wholly and radically reconfigured into the 590-seat Kit Kat Club.\n\nDesigner Tom Scutt hasn't just re-routed the building; he's re-conceived the auditorium. Out goes the proscenium arch and the entire fabric and texture. It's now a dimly lit Art Nouveau palace of faded grandeur, with the audience on two sides wrapped around and focusing in on a tiny, bare circular stage from which the dancers can tease and toy with audience members. It feels like you're entering a Walter Sickert painting peopled by characters dressed – and undressed – by painters like Otto Dix and George Grosz. For once the overworked term \"immersive\" is entire justified and the mood feeds the interpretation.\n\nFrecknall's approach is simple: every moment and possibility in Joe Masteroff's book and John Kander and Fred Ebb's score has been thought through. And with no set to change and the stage bare but for the most essential of props, Frecknall welds it all together and never lets the tension flag. The focus is entirely on fascinatingly detailed performances.\n\nMarshalling the almost circus-like atmosphere, forever insinuating himself amid choreographer Julia Cheng's highly individual, deliciously tawdry yet taut, near-genderless dancers, Redmayne's highly stylized Emcee is a cross between a gleaming, lean and savage ringmaster and King Leer. It's very definitely A Performance, but it's also utterly at one with the heightened tone of the club. The staging of the initial rendition of \"Tomorrow Belongs To Me,\" with Redmayne gently crooning over a ravishing a cappella vocal arrangement beneath Isabella Byrd's alternately sepulchral and scalding lighting, is spectacularly chilling. It's highly stylized, with identical statues slowly revolving on a turntable, but that degree of stylization paves the way for the extremes of Buckley's arresting Sally.\n\nHaving quietly stolen every scene as the calm, erect concert manager in the Garland bio-pic \"Judy,\" Buckley now plays the talent with astonishing fierceness. Her Sally, based on the original conception of the character as a middle-class English girl whose wayward talent is subsidiary to her ability to bed those who book her – is a fascinating contradiction: She simultaneously embodies control and abandon. Buckley shows how brittle, blind and careless Sally is, but plays her impulsivity and vulnerability to such perfection that you completely understand how queer Clifford (Omari Douglas) convinces himself that he's in love with her.\n\nThat their relationship rings so true is a testament to Frecknall's patient, compelling direction, and nowhere is that more apparent than in the exquisitely played courtship of Fr&auml;ulein Schneider (Liza Sadovy) and Herr Schultz (Elliot Levey). Any scrap of sentimentality in the writing is banished by the wonderfully held tension between the two actors, who use expert comic timing to walk a tentative tightrope between hope and heartbreak. The utter sincerity of the detailing of their relationship is so magnetic that even the pineapple song \"It Couldn't Please Me More\" here makes rare emotional sense. The second act pay-off, Sadovy's \"What Would You Do,\" is genuinely shocking.\n\nThe same is true of the song \"Maybe This Time.\" Instead of Sally showing off her voice with a big finish, Buckley, Frecknall, musical director Jennifer Whyte and her lean and tangy seven-piece band build the number into the relationship with Clifford. Before the climax, Buckley stops cold. As spellbound as the audience, she stares tearfully at Clifford, whispering the last lines, brimming with hope that she dares herself to believe.\n\nBy contrast, her rendition of \"Cabaret\" turns from pragmatism into a full-throated howl. It's rarely been so clear that far from being a song of celebration, it is most definitely about an abortion. But Frecknall has still more to say, as shown in her final image of Redmayne's Emcee now both physically and politically ascendant.\n\nThis is no directorial flourish. It's typical of the production's immense authority that the rising Nazi power is never brandished for effect. Like everything else in this genuinely extraordinary portrait of not just individual figures but the whole of Berlin, it has been subtly built in all night. Its inexorability makes it devastating.\n\nThe initial booking period of this \"Cabaret\" is already sold out. If Frecknall can attract names of equal talent and luster to replace Buckley and Redmayne, this electrifying production – a directional rethink to rival Marianne Elliot's \"Company\" – is destined to run and run.",
  "isFullReview": true,
  "textWordCount": 916,
  "archivePath": "data/archives/reviews/cabaret-2024/variety-david-benedict--david-benedict_2026-02-01.html",
  "textFetchedAt": "2026-02-01T14:55:28.931Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250918031838",
  "archiveOrgUrl": "http://web.archive.org/web/20250918031838/https://variety.com/2021/legit/reviews/cabaret-review-eddie-redmayne-1235131905/"
}