{
  "showId": "cabaret-2024",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/article/theater-review-cabaret-orlando-eddie-redmayne-bebe-neuwirth-taylor-mac.html",
  "publishDate": "April 21, 2024",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "While Frecknall has put a lot of energy into giving Cabaret a glow-up—Sleep No More mood board, Eddie Redmayne in a party hat—she hasn’t provided the show underneath the makeover with sufficient focus or muscle.",
  "bwwExcerpt": "It’s not that the performers aren’t trying. As the naïve, swept-away American narrator, Cliff Bradshaw, Ato Blankson-Wood is doing his best to bring vulnerability, sincerity, and even some dignity to the part; but it’s always a bit of a surprise to recall just how often Cliff is left on the sidelines, and just how little he sings (a real loss here, given Blankson-Wood’s gorgeous voice). And as the strung-out Kit Kat Club singer, Sally Bowles, Gayle Rankin is making every effort to leave her guts on the stage, but she’s not getting any help. Rankin has the ability to be wrenching and spectacular — I once watched her swim across a lake in the dark, climb out and play Nina’s devastating Act Four scene from The Seagull, get back in, and swim away again. But her delivery of “Maybe This Time” and of the show’s final drill to the stomach, its great title song, is hampered by extraneous gesture. She flickers between singing, talking, and half-singing in a way that feels like a misguided directorial attempt to make the songs new, but that ends up making Rankin seem nervous about her ability to deliver them. I have no doubt that she really can, and I wish Frecknall had helped her find more connection and more release.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-CABARET-AT-THE-KIT-KAT-CLUB-Opens-on-Broadway-Updating-Live-20240421",
  "dtliThumb": "Meh",
  "textStatus": "missing",
  "textQuality": "missing",
  "sourceMethod": "dtli"
}
