{
  "showId": "waitress-2021",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "http://variety.com/2015/legit/reviews/waitress-review-musical-art-1201573745/",
  "playbillVerdictUrl": "http://variety.com/2015/legit/reviews/waitress-review-musical-art-1201573745/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The words \"sugar, butter, flour\" waft like a siren call in the opening moments of \"Waitress,\" the new Broadway-bound musical getting its out-of-town premiere in the test kitchen of the American Repertory Theater in Cambridge, Mass. From these basic ingredients, this musical’s heroine Jenna (Jessie Mueller, who won a Tony for \"Beautiful\"), an unhappily married waitress in a small-town diner, creates spectacular pies that are, as one character remarks, \"biblically good.\" And while this feminist fairy tale of a show, in which singer-songwriter Sara Bareilles makes an impressive legit bow as a composer, is quite delicious at times, it still needs more work — especially in the second act — before it's a recipe for success.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Dropout Hires New Heads of Production and Marketing, Boosts Development Team as Slate Grows (EXCLUSIVE) \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Christian Bale Spent Six Hours in Makeup Chair Each Day to Play Frankenstein's Monster in 'The Bride!' and 'Would Scream Like Crazy' to Stop Himself 'From Going Insane'\n\nBased on writer-director Adrienne Shelley's 2007 indie film, Jessie Nelson's book follows the movie's narrative, beginning just as Jenna, in the midst of planning to leave her abusive husband, Earl (Joe Tippett), discovers she is pregnant. She decides to have the baby — but clearly it’s not a child she wants.\n\nShe finds support from her fellow waitresses, not dissimilar to the characters in the diner film \"Alice Doesn't Live Here Anymore\" and its sitcom spinoff, \"Alice.\" There's mousy, nervous Dawn (Jeanna De Waal) and tough, wisecracking Becky (Keala Settle). There's also brusque Cal (Eric Anderson), the cook/manager, and the diner's folksy-crusty owner, Joe (Dakin Matthews, in a performance as easygoing and tasty as molasses).\n\nThings get more complicated when Jenna starts an affair with her newly-arrived-in-town — and married — gynecologist, Dr. Pomatter (Drew Gehling). As played by the sweetly awkward and disarmingly gentle Gehling, it's the type of romance that, in another show, you would hope would work out somehow. But this distaff-centric tuner is not simply about getting Prince Charming, but also getting its heroine to clean up her own messes, take action and discover her maternal worth.\n\nA comic-romantic subplot with Dawn and an Internet date with Ogie (Jeremy Morse, in a firecracker of a performance) brightens the mood, with Morse having a pair of highly charged numbers: \"Never Getting Rid of Me,\" which nicely contrasts with Earl's creepy possessiveness, and the silly but joyous \"I Love You Like a Table.\"\n\nDawn and Becky have their musical moments, too, especially Settle's searing \"I Didn't Plan It,\" when Becky owns up to her own marital imperfections. (\"Its not right/but it's mine/and it's finally something to feel.\") These flawed or broken characters live with their fates as best as they can, some better than others. When Jenna asks Cal if he's happy, he responds, \"Happy enough.\" Jenna wants more than enough.\n\nBut making Earl so relentlessly horrible makes Jenna’s inability to leave him not just indecisive but something more worrisome. (In the film, Jeremy Sisto’s character is more wily and seductive in his pathology.) Meanwhile, there's little evidence for the good doctor being Jenna's lost soulmate, despite his loving bedside manner, and the 11th-hour cameo of Dr. Pomatter's wife is a questionable choice, at least as it's presented now.\n\nMueller's performance transcends the show's imperfections. She's funny, frisky and likable. She sings Bareilles' songs beautifully, giving every word significance and interest even as the tunes in the second half slip increasingly into thicker sentiment.\n\nLeading the sisterhood of creatives, director Diane Paulus fills the production with clever touches — a scalloped pie-crust proscenium, a fluid and easygoing flow and a natural truthfulness in the performances. Scott Pask's set design authentically evokes the chrome, neon and Naugahyde look of a down-home joint, as do Kenneth Posner's lighting and Suttirat Larlarb's seemingly off-the rack costumes. Another nice touch: The band is positioned onstage in a side room of the diner, further populating the place — and justifying the diner's three waitresses.\n\nIn a show that celebrates motherhood, pie and extramarital affairs, \"Waitress\" could be a kind of comfort-food musical. But at this point it still needs more filling.",
  "isFullReview": true,
  "textWordCount": 689,
  "archivePath": "data/archives/reviews/waitress-2021/variety--frank-rizzo_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:19:26.013Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 689,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2015 outside valid range 2018–2023 for show opening 2021"
}