{
  "showId": "sister-act-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "http://www.variety.com/review/VE1117945047",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Whoopi Goldberg looms large over the new musical comedy 'Sister Act,' and that's part of the problem. While she co-produced, Goldberg isn't onstage, and the outsized sense of hilarity mixed with humanity she brought to the 1992 motion picture is sorely missed. Patina Miller makes an altogether impressive Broadway debut as diva-on-the-run Deloris Van Cartier, singing up a veritable storm, but the decision to plaster Goldberg's name on numerous signs outside the theater raises comparisons that flatter neither Miller nor this garish production.",
  "bwwScore": 3,
  "contentTier": "complete",
  "fullText": "Whoopi Goldberg looms large over the new musical comedy \"Sister Act,\" and that's part of the problem.\n\nWhoopi Goldberg looms large over the new musical comedy “Sister Act,” and that’s part of the problem. While she co-produced, Goldberg isn’t onstage, and the outsized sense of hilarity mixed with humanity she brought to the 1992 motion picture is sorely missed. Patina Miller makes an altogether impressive Broadway debut as diva-on-the-run Deloris Van Cartier, singing up a veritable storm, but the decision to plaster Goldberg’s name on numerous signs outside the theater raises comparisons that flatter neither Miller nor this garish production.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Whitney Leavitt Leveraged 'Mormon Wives' to Earn 'Chicago.' She's Not Sure How She'll Ever Go Back\n\nNew tuner has various assets that place it comfortably in the feel-good entertainment category, and might have launched it to the top last season or even three months ago. But timing is everything. “Sister Act” comes in on the heels of a handful of musicals, including another disco-beat film adaptation (“Priscilla Queen of the Desert”), and comparisons are not favorable.\n\nThe tale of a failed singer hiding from her mobster boyfriend in a nunnery has been moved back to 1978, presumably to allow for that disco sound. Composer Alan Menken (“Beauty and the Beast”) demonstrates his usual flair for tuneful pop, but there is little that grabs you here, and he isn’t helped by Glenn Slater lyrics like “Life is grim/filled with scandal to the brim/there may be room for Him.”\n\nJoseph Howard’s screenplay has been simplified and vulgarized. While the film had believable if humorous nuns, here the gals seem all too eager for the chance to shake their booty in hot, sequined habits, and Monsignor O’Hara (Fred Applegate) has been transformed into a Vegas lounge type. What’s more, many of the jokes — be they from librettists Cheri and Bill Steinkellner (“Cheers”) or book doctor Douglas Carter Beane (“Xanadu”) — are cheesy. One yuk, about “bachelors who deal in antiques,” is repeated three times to diminishing returns, and the nuns’ lingo is peppered with Yiddishisms in search of laughs.\n\nMiller, whose biggest local credit was the Melba Moore role in the 2008 Shakespeare in the Park production of “Hair,” is indeed a find. But she can’t quite manage to make the show seem better than it is. Victoria Clark (“The Light in the Piazza”) shares top billing as the Mother Superior, a role that showcases her comic talents but gives her little else to do.\n\nSarah Bolt and Marla Mindelle provide rays of entertainment as friendly nun and nervous postulant, respectively; Chester Gregory is likable as Eddie, the cop who arranges Deloris’ stay; and John Treacy Egan and Demond Green provide laughs as small-fry criminals (despite being saddled with a “how to seduce a nun” song).\n\nPhysical production is at its best in Klara Zieglerova’s chapel, where topnotch lighting designer Natasha Katz gets to play with the stained glass. Lez Brotherston’s outfits, if too flashy to be believed, do make for a delectable costume gag in the first act.\n\nAfter a rocky gestation that included a 17-month West End run and the recent addition of Beane and replacement director Jerry Zaks, the Broadway version of “Sister Act” is glossy, but seems like a worn set of tires repatched too often. At one point in the second act, the gals run in with newspaper reviews of their latest mass. (Opening night reviews for a Sunday mass?) The most crotchety old nun waves her copy of Daily Variety, ecstatically proclaiming the headline “Crix Pix Crucifix Shticks.” Nice try, but no sale.",
  "isFullReview": true,
  "textWordCount": 599,
  "archivePath": "data/archives/reviews/sister-act-2011/variety--steven-suskin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:53:58.658Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 599,
  "tierReason": "Full review text"
}