{
  "showId": "airline-highway-2015",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Stanford Friedman",
  "url": "https://www.newyorktheatreguide.com/reviews/airline-highway",
  "publishDate": null,
  "fullText": "Review by Stanford Friedman 23 April 2015 If you've been to New Orleans, you might know Airline Highway as the seedy road leading into the Big Easy from the west. For the uninitiated, the term might conjure images of speed, movement, action. At the Manhattan Theatre Club's production of Airline Highway, (driven in from Chicago by the Steppenwolf Theatre), scenic designer Scott Pask and costumer David Zinn bring the grit and dinginess to full throttle, but playwright Lisa D'Amour's script is a slow road to nowhere. The play is set in the parking lot of the rundown, pay-by-the-week, Hummingbird Motel, which is inhabited by a familiar group of down-and-outers. There's Tanya (Julie White), the aging, matronly hooker with a dark past. There's Krista (Caroline Neff), the lovelorn stripper with a heart of gold. There's the gruff but loveable motel manager, Wayne (Scott Jaeck), the useless poet (Ken Marks), the hapless handyman (Tim Edward Rhoze), and the Shakespearean fool. Um, I mean the streetwise tranny, Sissy Na (deftly handled by K. Todd Freeman). And then there's bed-ridden Miss Ruby (Judith Roberts). Loved by all, the gang has decided to throw her a funeral party before her final demise. Thus the plot sputters into action with much list making, glitter throwing and streamer twirling. Meanwhile, each character has his or her own inner demons to deal with. The fact that their problems are purely personal results in a dearth of meaningful conflict, and much overlapping dialog. \"Who's going to remember us,\" Tanya asks to no one in particular. Who indeed? D'Amour tries to solve this structural dilemma by introducing an outsider into the mix. Bait Boy (Joe Tippett) is a former French Quarter denizen who got away and got himself right. The play's brightest bit of dialogue involves everyone's different memory of how Bait Boy got his name, and Krista is all unnerved because they were once an item. But when he arrives, with a platter of sandwiches and demanding to be called Greg, he is so uninteresting that it's the audience who feels baited. Greg has brought along an equally unexciting step-daughter from his new life, Zoe (a stiff Carolyn Braver), who is 16. \"But that's like 45 in Google years\" she proclaims in another too brief moment of clever dialogue. Zoe is working on a school project about subcultures and thinks this clan of failures would make a great case study. So, for a while, we see things through her eyes. It's a change in focus, but not a terribly interesting or believable one. And it sets up an even stranger final shift in focus: enter Miss Ruby, carried out on her hospital bed like Cleopatra on her litter, to offer a lecture on self-worth. Veteran director Joe Mantello does his best to breathe life into the production, skillfully staging the actors across Pask's fine multi-level set, and firing up a rousing party scene at the start of act two. But in a landscape made infamous by Tennessee Williams, this tale is oddly lacking in poetry. If the Hummingbird is symbolically a fragile nest filled with small lives, its creator left out the tension and passion that could have turned it into a \"Motel Named Desire.\" \"Ms. D'Amour's dark comedy... draws a compassionate but unvarnished collective portrait of the underclass of New Orleans.\" Charles Isherwood for New York Times \"'Highway' is a road to nowhere that's potholed with contrived storytelling and characters from Central Casting.\" Joe Dziemianowicz for New York Daily News \"Overstuffed and unfocused\" Elisabeth Vincentelli for New York Post \"Like the cinder-block-mounted car on the side of Scott Pask's seedy multilevel set, the play has color and beat-up charm, but doesn't go anywhere.\" Adam Feldman for Time Out New York \"While it's a vividly populated canvas, the playwright doesn't do anything much of interest with it.\" David Rooney for The Hollywood Reporter \"A lot of misery but not much action.\" Marilyn Stasio for Variety External links to full reviews from popular press... New York Times - New York Daily News - New York Post - Time Out - Hollywood Reporter - Variety Originally published on Sep 22, 201700:00",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Lisa D'Amour's script is a slow road to nowhere...In a landscape made infamous by Tennessee Williams, this tale is oddly lacking in poetry. If the Hummingbird is symbolically a fragile nest filled with small lives, its creator left out the tension and passion that could have turned it into a \"Motel Named Desire.\"\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "previousUrl": "http://www.newyorktheatreguide.com/reviews/airlinehighway15.htm",
  "urlDiscoveredAt": "2026-02-06T14:17:57.078Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 690,
  "archivePath": "data/archives/reviews/airline-highway-2015/nytg--stanford-friedman_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:17:57.087Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "wordCount": 690,
  "tierReason": "Full review text"
}