{
  "showId": "airline-highway-2015",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "https://www.nytimes.com/2015/04/24/theater/review-airline-highway-is-a-portrait-of-the-underclass-of-new-orleans.html",
  "publishDate": "April 20, 2015",
  "fullText": "https://www.nytimes.com/2015/04/24/theater/review-airline-highway-is-a-portrait-of-the-underclass-of-new-orleans.htmlShare full article55Advertisement\n\nThe motley characters in Lisa D’Amour’s ebullient “Airline Highway” are gathering for the funeral of one of their own, Miss Ruby, a former stripper who lived alongside them in a rundown New Orleans motel. Or rather lives. Strictly speaking, Miss Ruby isn’t dead but dying. She has requested the premature funeral — which turns out to be a raucous wake — so she can attend the festivities, even if it means being lugged down from her room to the parking lot on a hospital gurney.\n\nThe piteous truth is this funeral party might really be held for almost any of the characters, whose lives have crashed and burned, sputtered and stalled, or become mired in confusion, disappointment, addiction. Although they may still have the breath of life in them, and a hunger for stray shards of joy that bleeds through their armor of resignation or defiance, their futures are little brighter than Miss Ruby’s.\n\nMs. D’Amour’s dark comedy, which opened on Thursday at the Samuel J. Friedman Theater in a bright-blazing production directed by Joe Mantello, draws a compassionate but unvarnished collective portrait of the underclass of New Orleans, a city where millions of tourists converge to party, little noticing that among the bottles and beads littering the streets are plenty of people who refuse to let the party end, and often pay a hard price for it.\n\nThe production, from the Steppenwolf Theater Company in Chicago, here presented by Manhattan Theater Club, brims with humor and pungent life. It features a flawless cast led by the Tony winner Julie White (“The Little Dog Laughed”), whose harrowing performance handily surpasses her superb prior work in lighter comedies. Ms. D’Amour’s play has a loose, baggy structure that sometimes works against it, but this aptly reflects the aimlessness of its characters, who live day to day and would rather not think about the unhappy past or the foggy future.\n\nMs. White is Tanya, a middle-aged prostitute and, with Miss Ruby’s demise impending, the unofficial den mother of the Hummingbird Motel, where the play is set on the road of the title. To Tanya falls the task of organizing the festivities. Her fellow party planners, who either live or have lived at the motel, include Sissy Na Na, a black drag queen with a (stereotypically) fierce tongue and maternal heart, played with vibrant comic panache by K. Todd Freeman; Wayne (a warm Scott Jaeck), the motel’s genial manager, who overindulges his tenants but stints on the motel’s upkeep; the lost Krista (Caroline Neff, touchingly forlorn), a stripper who no longer makes enough cash to keep a room; the grizzled Francis (a buoyant Ken Marks), who never made it as a poet, or anything else, but maintains a happy veneer of not caring much that he’s well into middle age with no means of support; and Terry (Tim Edward Rhoze, nicely laid-back), a good-natured handyman and former heroin addict.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Ms. D'Aquila has assembled a stellar ensemble to populate this motel and bring vivid life to Ms. Rapp's gallery of broken-down dreamers and survivors.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Ms. D'Amour's dark comedy...draws a compassionate but unvarnished collective portrait of the underclass of New Orleans, a city where millions of tourists converge to party, little noticing that among the bottles and beads littering the streets are plenty of people who refuse to let the party end, and often pay a hard price for it. The production...brims with humor and pungent life. It features a flawless cast led by the Tony winner Julie White ('The Little Dog Laughed'), whose harrowing performance handily surpasses her superb prior work in lighter comedies. Ms. D'Amour's play has a loose, baggy structure that sometimes works against it, but this aptly reflects the aimlessness of its characters, who live day to day and would rather not think about the unhappy past or the foggy future.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-AIRLINE-HIGHWAY-Opens-on-Broadway-Updating-LIVE-20150423",
  "showScoreExcerpt": "Ms. D'Aquila has assembled a stellar ensemble to populate this motel and bring vivid life to Ms. Rapp's gallery of broken-down dreamers and survivors.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Short text (24 words)",
  "previousUrl": "https://www.nytimes.com/2015/04/21/theater/review-airline-highway-with-a-stellar-ensemble-at-the-samuel-j-friedman-theater.html",
  "urlDiscoveredAt": "2026-02-03T11:03:58.726Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 512,
  "archivePath": "data/archives/reviews/airline-highway-2015/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:18:00.710Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203854",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203854/https://www.nytimes.com/2015/04/24/theater/review-airline-highway-is-a-portrait-of-the-underclass-of-new-orleans.html",
  "wordCount": 512,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T15:08:12.357Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is truncated mid-sentence and ends with a technical error message about retrieving article content and enabling JavaScript; openai: The text includes a broken link and a message about enabling JavaScript, indicating it is not a complete review.",
  "promptVersion": "5.2.0",
  "playbillVerdictUrl": "http://www.nytimes.com/2015/04/24/theater/review-airline-highway-is-a-portrait-of-the-underclass-of-new-orleans.html",
  "sources": [
    "web-search",
    "show-score-playwright",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 8
}
