{
  "showId": "airline-highway-2015",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Oxman",
  "url": "http://variety.com/2014/legit/reviews/airline-highway-review-steppenwolf-chicago-1201379681/",
  "publishDate": null,
  "fullText": "Early on in Lisa D'Amour's New Orleans-set play, \"Airline Highway,\" a character is asked whether he has ever been to Jazz Fest, a big-time tourist attraction for the city. After pondering for a moment, he admits that he hasn't, but he thinks he delivered port-a-potties there once. Taking place in the closed-off parking lot of the long-decaying Hummingbird Motel, brilliantly realized by designer Scott Pask in a nearly unimprovable Steppenwolf Theatre Company production directed by Joe Mantello, D'Amour's deep and decidedly soulful work takes us convincingly into the world of the \"real\" New Orleans. These are the strippers, hookers and party-animal bartenders who have made an everyday pursuit of the search for what Miss Ruby, their dying substitute mother, calls \"ecstatic experience.\"\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Timothée Chalamet's 'Marty Supreme' to Get China Theatrical Release\n\nThis non-family family gathers for Miss Ruby's \"living funeral.\" They all owe this burlesque performer, known for her lectures on sex and ducks, a lot: She may be single-handedly responsible for each of them deciding to make the Hummingbird their home, even when they can't afford a room.\n\nThere's Wayne (Scott Jaeck), who manages the Hummingbird and worries a lot about what changes that new Costco across the street will bring to the neighborhood (the title refers to a once-robust strip of forgotten businesses, a southern Route 66). He also keeps a caring eye on his lifelong friend Tanya, a prostitute beautifully played by Kate Buddeke with a combination of motherliness, neediness, and exhaustion.\n\nPoet Francis (Gordon Joseph Weiss) takes center stage with bearded chin up to wax philosophical about the authentic life: \"The real fest,\" he says, referring to the commercialized Jazz Fest, \"is on the edges.\" And handyman Terry (Tim Edward Rhoze), he of the port-a-potty deliveries, follows Wayne around pitching him odd jobs he can perform, badly.\n\n\"Super-tranny\" Sissy Na-Na, in a commanding performance by Steppenwolf regular K. Todd Freeman, plays the role of honesty police, calling people out whenever they descend into denial. Of course, denial is not the same as straight-up lying, which is what Sissy Na-Na encourages stripper Krista (Carolyn Neff) to do when she hears that her old flame Bait Boy (Stephen Louis Grush) is returning from his new home in Atlanta to pay his respects to Miss Ruby.\n\nBait Boy enters through the audience, belonging to another world since his departure several years ago thanks to a \"cougar\" with money. He arrives with his 16-year-old step-daughter Zoe (Carolyn Braver) in tow, carrying a plate of ham sandwiches with truffle oil, and insisting that the others should now refer to him as Greg.\n\nBait Boy's return, and Zoe's attempts to interview the members of this \"sub-culture\" for her sociology project, provide the outsider (read: mainstream) perspective and give the characters in this epitome of a character-driven work the opportunity to explain themselves a bit. Luckily, they're all good talkers, even if they have a habit of not answering the question posed.\n\nIn a wonderful beat, the lights pop on at the beginning of Act II to launch us into the middle of full-fledged partying. If you wonder why everyone has a good time in New Orleans, it's because these characters know how. But, alas, the dark side of such fun keeps creeping in, and it is a funeral after all, albeit one where the guest of honor isn't dead yet. As Miss Ruby, Judith Roberts emerges late to fill the stage with a worthy mix of love and meaning, describing the pleasures and dangers of a city, and a place in the human soul, that \"reveres the ecstatic moment.\"\n\nAs she did in her suburban-set Pulitzer finalist \"Detroit,\" D'Amour demonstrates a special insight into both how place defines people and how people seek to define themselves against the expectations of the American dream. Above all, she can write characters who have a degree of depth that makes you feel you can only know them so far, who always have more to reveal. D'Amour has written another quintessentially American work.\n\nThe play doesn't sugarcoat human misery, although it is also filled with wit and humanity and plenty of energy stemming nonstop from an ensemble that doesn't have a weak link. But the work could still reach for a higher climax — for a moment of more explosive ecstatic experience. As of now, it remains just a bit too safe to make the type of splash it will need to make a commercial mark as a serious work on Broadway, where it is headed in 2015 thanks to Manhattan Theater Club. That said, it's a beautiful play, taking us into a world we'd be unlikely to brave on our own, but that has much to teach us.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"A nearly unimprovable production...D’Amour’s deep and decidedly soulful work takes us convincingly into the world of strippers, hookers and party-animal bartenders in pursuit of the search for what Miss Ruby, their dying substitute mother, calls “ecstatic experience”...The play doesn’t sugarcoat human misery, although it is also filled with wit and humanity and plenty of energy stemming nonstop from an ensemble that doesn’t have a weak link...It’s a beautiful play.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 785,
  "archivePath": "data/archives/reviews/airline-highway-2015/variety--steven-oxman_2026-02-06.html",
  "textFetchedAt": "2026-02-06T04:20:12.478Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 785,
  "tierReason": "Full review text"
}