{
  "showId": "the-lehman-trilogy-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2021/10/14/the-lehman-trilogy-sam-mendes-landmark-production-makes-a-triumphant-broadway-debut/",
  "publishDate": "2021-10-14T21:19:28",
  "fullText": "It shouldn’t work, it really shouldn’t. A three-and-a-half-hour drama spanning over 160 years, featuring a mere three actors playing dozens of roles ranging from infants to coquettish young women to elderly men, depicting complicated historical and financial events with a minimum of scenery. And with much of the dialogue delivered in the form of third person narration, no less. It sounds like a recipe for disaster, but The Lehman Trilogy proves an unalloyed theatrical triumph.\n\nPreviously seen on our shores at the cavernous Park Avenue Armory, the production, first staged at London’s National Theatre, had its original Broadway transfer plans derailed last year due to the COVID pandemic. Thankfully, the stars have aligned and it’s now receiving its long-delayed Broadway run at the relatively intimate Nederlander Theatre, a far more advantageous venue for this drama which somehow manages to feel epic and intimate simultaneously. The superb British actor Adrian Lester, making his Broadway debut, has joined the cast, replacing Ben Miles, who had a previous commitment.\n\nStefano Massini’s play, adapted by Ben Power, opens in 1844 with the arrival in America of the Bavaria-born Heyum Lehmann (Simon Russell Beale), who, as with so many immigrants of his era, was promptly renamed the more Americanized Henry Lehman. He’s eventually joined by his brothers Mayer (Adam Godley) and Emanuel (Lester), who partner with him on a fabric and clothing store in Montgomery, Alabama.\n\nOver the course of multiple decades and generations of the Lehman family, their modest retail business goes through many permutations before eventually morphing into the financial industry powerhouse that came crashing down in 2008. Along the way, they navigated their way through the American Civil War and two world wars, the dawn of the nuclear and computer eras, and the economic transformation from material goods to the moving around of money. It’s a quintessential American tale, ironically related by an Italian playwright and largely British creative team.\n\nPresented in three sections, each running roughly an hour, the play never feels overly dense despite its complex subject matter and profusion of characters and situations. The evening flows beautifully from scene to scene, with the amazingly skilled actors delineating their multiple roles with elegant precision. Despite never once changing from their initial 19th-century dark garb, they compellingly transform themselves with chameleon-like agility. When Beale plays a divorcee flirtily bantering with a Lehman descendant at a racetrack, he never lurches into caricature but rather subtly shifts his voice and body language to suggest wily femininity. His performance, like those of his co-stars, is a master class in versatile acting.\n\nThe imaginative, fast-paced staging by Sam Mendes, demonstrating the art of story theater at its finest, is equally stunning. The actors perform in a large transparent cube, featuring stacks of cartons and modern office furniture, which frequently revolves to showcase different perspectives. Sometimes it moves slowly, while at other times, when historical events seem to spiral out of control, it spins so rapidly you worry for the actors’ safety. Adding to the vertiginous effect are Luke Halls’ scene-setting video projections and Jon Clark’s transformative lighting, while Nick Powell’s cinematic-style musical underscoring, performed live by pianist Candida Caldicot, provides haunting accompaniment.\n\nIt’s nearly impossible to single out a particular moment, but there’s a true show-stopper with a scene late in the play, set in the 1960s, in which the last remaining Lehman brother, Robert (Godley) dances a maniacal twist as he ages into irrelevance and ultimately death, the other two actors mirroring his movements like back-up dancers at a morbid television variety show.\n\nThere’s no denying that The Lehman Trilogy represents a significant investment in time (although thankfully not as much as the original five-hour version), but it’s never less than enthralling. It could be argued that the play would be even more effective with less of the third person narration, which too often tells us what we’re already seeing (“Emanuel stares at Henry,” Emanuel informs us as he stares at Henry, for instance), but it’s a small quibble about a production representing stagecraft at its finest.\n\nThe Lehman Trilogy opened October 14, 2021, at the Nederlander Theatre and runs through January 2, 2022. Tickets and information: thelehmantrilogy.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2021/10/14/the-lehman-trilogy-sam-mendes-landmark-production-makes-a-triumphant-broadway-debut/"
}
