{
  "showId": "the-lehman-trilogy-2021",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "https://www.nytimes.com/2021/10/14/theater/the-lehman-trilogy-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2021/10/14/theater/the-lehman-trilogy-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "https://www.nytimes.com/2021/10/14/theater/the-lehman-trilogy-review.htmlShare full article30Advertisement\n\nMuch of what happens in “The Lehman Trilogy” is invisible to the eye, which is not the way prestige drama usually works onstage.\n\nDirected by Sam Mendes, this British import, which reaches across 164 years of American history to trace the family saga behind the fallen financial powerhouse Lehman Brothers, was a scalding-hot ticket during a brief prepandemic run at the Park Avenue Armory. Yet it offers almost nothing in the way of spectacle, and only the slightest of costume changes: a top hat here, a pair of glasses there.\n\nIn the captivating production that opened on Thursday night at the Nederlander Theater, it relies largely on an unspoken agreement between actors and audience — to imagine together, and let fancy crowd out fact.\n\nSort of the way that heedless investors looked right past all warning signs in the faith-based run-up to the stock market crash of 2008. Illusion is illusion, after all, and financial markets, like the theater, require a certain suspension of disbelief — though when the fantasy bursts in theater, the fallout is less ruinous. When investors halted their collective game of make-believe 13 years ago, mammoth financial firms like Lehman Brothers met their swift demise, and the world’s markets suffered the aftershocks.\n\n“The Lehman Trilogy,” though, is not actually a number-crunching play; reports that Jeff Bezos took in a recent performance should not cause you to infer otherwise.\n\nWritten by Stefano Massini and adapted by Ben Power, it is a vividly human tale, nimbly performed by three of the finest actors around: Simon Russell Beale, Adam Godley and Adrian Lester, who, in making his Broadway debut, has replaced the original cast’s Ben Miles. (I did not catch Beale, Godley and Miles at the Armory; it was too scarce a ticket, and too pricey.)\n\nAn earlier version of this article misstated the likely point of arrival in the United States of Henry Lehman, who was then known as Heyum Lehmann. He most likely arrived at Castle Garden, not Ellis Island. (This is also where a port official would have bestowed the name Henry.)\n\nWhen we learn of a mistake, we acknowledge it with a correction. If you spot an error, please let us know at corrections@nytimes.com.Learn more",
  "isFullReview": true,
  "textWordCount": 373,
  "archivePath": "data/archives/reviews/the-lehman-trilogy-2021/nytimes--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T19:14:23.866Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "truncated",
  "wordCount": 373,
  "tierReason": "Missing proper ending or other signals"
}