{
  "showId": "the-lehman-trilogy-2021",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "https://www.nytimes.com/2021/10/14/theater/the-lehman-trilogy-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2021/10/14/theater/the-lehman-trilogy-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "https://www.nytimes.com/2021/10/14/theater/the-lehman-trilogy-review.htmlShare full article30Advertisement\n\nMuch of what happens in “The Lehman Trilogy” is invisible to the eye, which is not the way prestige drama usually works onstage.\n\nDirected by Sam Mendes, this British import, which reaches across 164 years of American history to trace the family saga behind the fallen financial powerhouse Lehman Brothers, was a scalding-hot ticket during a brief prepandemic run at the Park Avenue Armory. Yet it offers almost nothing in the way of spectacle, and only the slightest of costume changes: a top hat here, a pair of glasses there.\n\nIn the captivating production that opened on Thursday night at the Nederlander Theater, it relies largely on an unspoken agreement between actors and audience — to imagine together, and let fancy crowd out fact.\n\nSort of the way that heedless investors looked right past all warning signs in the faith-based run-up to the stock market crash of 2008. Illusion is illusion, after all, and financial markets, like the theater, require a certain suspension of disbelief — though when the fantasy bursts in theater, the fallout is less ruinous. When investors halted their collective game of make-believe 13 years ago, mammoth financial firms like Lehman Brothers met their swift demise, and the world’s markets suffered the aftershocks.\n\n“The Lehman Trilogy,” though, is not actually a number-crunching play; reports that Jeff Bezos took in a recent performance should not cause you to infer otherwise.\n\nWritten by Stefano Massini and adapted by Ben Power, it is a vividly human tale, nimbly performed by three of the finest actors around: Simon Russell Beale, Adam Godley and Adrian Lester, who, in making his Broadway debut, has replaced the original cast’s Ben Miles. (I did not catch Beale, Godley and Miles at the Armory; it was too scarce a ticket, and too pricey.)\n\nSlipping in and out of myriad roles, the actors spend the bulk of their time narrating, standing outside their characters. We, in turn, spend most of our time envisioning the fleet-footed story they conjure with words over three-plus hours (including two intermissions) that feel nowhere near that long.\n\nOur eyes track these witchy actors as they move through Es Devlin’s revolving glass-and-metal office set, while our minds persuade us that the story is unfolding in a succession of disparate spaces that resemble it not at all.\n\nA peculiarly gentle interrogation of the American dream’s descent into many-tentacled nightmare, “The Lehman Trilogy” begins as so many stories of this nation do: with an intrepid immigrant’s arrival. A young man from Bavaria stands before us, suitcase in hand, freshly landed in New York Harbor and certain he is worldly after 45 days at sea.\n\nThe year is 1844, he is Heyum Lehmann, and in a moment we will see him reborn as Henry Lehman — his moniker bestowed by a port official too obtuse to comprehend the newcomer’s real name.\n\nOn first impression, Henry (Beale) is darling, funny and utterly sympathetic. When his younger brothers, Emanuel (Lester) and Mayer (Godley), follow him across the ocean, we feel a similar warmth toward them.\n\nThis is where the mechanics of the play, with these deft and lovely actors breathing such life into the brothers, coax us into an ease at odds with moral logic as we watch their genteelly brutal acquisition and stockpiling of wealth.\n\nThe brothers settle in antebellum Alabama, where even the earliest iteration of the family firm, a shop selling fabrics and clothing, relies on a local economy built on slavery. As the Lehmans grow more ambitious, they start buying and selling cotton from the plantations, making their first fortune on it.\n\nSeldom do we hear a voice of conscience — like the local physician who tells a dispirited Mayer, in the aftermath of the Civil War, that the collapse of the South’s economy should not have come as a surprise.\n\n“Everything that was built here was built on a crime,” the doctor says. “The roots run so deep you cannot see them, but the ground beneath our feet is poisoned. It had to end this way.”\n\nThat is, of course, a warning that the pattern of reckless profit and resulting pain will repeat: in the 1929 crash, which Lehman Brothers managed to survive by morphing yet again, and in the 2008 crash, which it didn’t. It is also a signal that the founders of the firm — whose deaths, when they come, are meant to move us, and do — were not the ethical betters of their more vulgar descendants.\n\nWith a subdued, filmic score by Nick Powell, played live by Candida Caldicot on an upright piano, “The Lehman Trilogy” is structured in three parts. It follows Emanuel and Mayer to New York, and their family through successive generations, whose principals we first meet in childhood.\n\nSo here is Emanuel’s son Philip (Beale), a future shark, as a gape-mouthed tot prodded to parade his smarts for guests. Here is Philip’s son Bobby (Godley) as a buoyant 10-year-old, whose father mercilessly dismantles the boy’s love for horses as creatures rather than commodities.\n\nAnd most enchantingly, here is Mayer’s son Herbert (Lester), a future governor and senator, as a thumb-sucking 3-year-old playing with his father’s beard, and later as a fair-minded 9-year-old at Hebrew school, objecting to the divine massacre of the innocent children of Egypt.\n\nNo matter how horrid some of the Lehmans become (not Herbert, though; never Herbert), knowing them young cushions our feelings toward them later. That’s human nature. What’s unsettling is which people in this saga of capitalism we see portrayed, which people the play helps us to imagine clearly and which people we are asked to imagine vaguely or not at all. Proximity shapes our sympathies.\n\n“The Lehman Trilogy” exists because of the cascading financial disaster that extinguished Lehman Brothers in 2008, yet its perspective is very much from the top of that deluge. Any harm bucketing down below is at best an abstraction, just as it is in 1929, when the play shows us suicides of despairing stockbrokers but none of the pain radiating through lower social strata. And slavery, the founder of the family’s feast, is kept in soft focus, off to the side.\n\nThe primary reason to see “The Lehman Trilogy,” then, is to witness the superb Beale, Godley and Lester in their feats of storytelling — and to conspire with them in imagining the play’s tarnished, if not truly vanished, world.\n\nWhen intermission comes and the auditorium lights turn on, gaze up at that glass set. You’ll see an awfully comfortable-looking audience reflected there.\n\nThe Lehman TrilogyThrough Jan. 2 at the Nederlander Theater, Manhattan; thelehmantrilogy.com. Running time: 3 hours 15 minutes.\n\nAn earlier version of this article misstated the likely point of arrival in the United States of Henry Lehman, who was then known as Heyum Lehmann. He most likely arrived at Castle Garden, not Ellis Island. (This is also where a port official would have bestowed the name Henry.)\n\nWhen we learn of a mistake, we acknowledge it with a correction. If you spot an error, please let us know at nytnews@nytimes.com.Learn more",
  "isFullReview": true,
  "textWordCount": 1181,
  "archivePath": "data/archives/reviews/the-lehman-trilogy-2021/nytimes--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:05:07.123Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "contentTier": "complete",
  "wordCount": 1181,
  "tierReason": "Full review text",
  "bwwExcerpt": "Much of what happens in 'The Lehman Trilogy' is invisible to the eye, which is not the way prestige drama usually works onstage. Directed by Sam Mendes, this British import, which reaches across 164 years of American history to trace the family saga behind the fallen powerhouse Lehman Brothers, was a scalding-hot ticket during a brief prepandemic run at the Park Avenue Armory. Yet it offers almost nothing in the way of spectacle, and only the slightest of costume changes: a top hat here, a pair of glasses there. In the captivating production that opened on Thursday night at the Nederlander Theater, it relies largely on an unspoken agreement between actors and audience - to imagine together, and let fancy crowd out fact.",
  "bwwScore": 9,
  "archiveOrgTimestamp": "20251001163408",
  "archiveOrgUrl": "http://web.archive.org/web/20251001163408/https://www.nytimes.com/2021/10/14/theater/the-lehman-trilogy-review.html"
}