{
  "showId": "frozen-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/03/22/frozen-animated-blockbuster-turns-icebound/",
  "publishDate": "2018-03-22T21:00:08",
  "fullText": "A bright, funny, and slightly loopy musical comedy peers out every so often from the stage of the renovated St. James, where Disney’s latest in a line of animated-film-to-live-Broadway epics has opened with typically Disneyan fanfare. These delights are only intermittent, alas; whenever theatrical joy starts to break through, the emotion is flash-frozen as if to extend the moment. But flash-frozen joy inevitably turns to freezer burn, so they just go on and sing another power ballad.\n\nFrozen (the 2013 film, as opposed to Frozen The Broadway Musical) was a worldwide smash; the firm’s largest animated hit, it seems, since 1994’s The Lion King, and we know what happened to that one. Frozen the film was, as it happened, relatively Broadway-friendly; leading roles were voiced by Tony-nominated musical comedy favorites Idina Menzel, Jonathan Groff, Josh Gad, and Santino Fontana.\n\nMore importantly, the songs upon which the plot is built were written by Broadway’s own Robert Lopez (of Avenue Q and The Book of Mormon) in collaboration with his songwriting spouse, Kristin Anderson-Lopez. All of which added to the allure of the film; and when the couple won themselves a Best Song Oscar, weren’t we all proud of our home-grown lad? (As of this writing, he is not only one of a mere 12 Emmy-Grammy-Oscar-Tony winners; he is the only person thus far to collect two of each.)\n\nThe transformation from screen to stage, though, accentuates the ponderous. What had been a collection of eight songs is herein expanded (or bloated?) to 22. Mr. Lopez is one of our finest musical comedy writers, who seemingly provided much of the canny drollery to his two aforementioned musicals. Which might be why Frozen’s loopy musical comedy moments work so well. A second chief asset is Patti Murin, who as Princess Anna clowns her way through every moment in which she is permitted to.\n\nBut it ain’t all bounce-up-the-lights-and-bring-on-the-charm showmanship. Drab is the mood of most of the evening. We are in an olden-day kingdom in northern climes—the source material comes from Hans Christian Andersen—with dark wood and gray walls omnipresent. (One of the stage musical’s rare peaks, backing the song “In Summer,” features the equivalent of a pop-up greeting card of the beach, complete with sun and surfboard, four minutes of totally extraneous and thoroughly enchanting fun. Let it be added that more than a few theatergoers are likely to think that this beach interlude is more entertainingly sculpted than the whole of Escape to Margaritaville, down the block.)\n\nThe first of these delights comes 20 minutes in, when Murin—with Ado Annie-ish glee, if that reference is not too archaic—breaks through the gloom with “Love Is an Open Door.” The second act opener, too, builds (or almost builds) to musical comedy heights. “Hygge” (pronounced “HUE-gah”) is a term borrowed from the Danish. Frozen uses it in a manner somewhat similar to what Mr. Lopez and his Mormon cohorts did with “Hasa Diga Eebowai.” Not in a scatological vein, mind you; this is Disney. But as a rambunctious kitchen-sink showstopper featuring a blissfully ludicrous chorus line of dancers fresh from the sauna, complete with birch branches and naked bodysuits.\n\nMurin, a memorable heroine in the underappreciated musical spoof Lysistrata Jones, here bursts into Broadway stardom. She is joined in the Frozen spotlight by Caissie Levy (Les Misérables), who as the ice princess mostly stands around looking glum or menacing except for the first act finale where she gets to sing the Oscar-winning “Let It Go” in a manner which apparently convinced management to give her first-position star billing. (Methinks, perhaps, she takes the “conceal it don’t feel it” mantra too much to her frozen heart.) Greg Hildreth makes an enchanting Olaf, aided by a well-realized snowman design from puppetmaker Michael Curry; Jelani Alladin and John Riddle make attractive-enough suitors; and Kevin Del Aguila comes out of nowhere—like Brad Oscar in Something Rotten!—to enchant us with that sauna song.\n\nMichael Grandage is a fine stage director, as Frost/Nixon, the Jude Law Hamlet and Red attest to. His two Broadway musicals—the recent revival of Evita and the present opus—suggest that musicals might not be his métier. The same can be said, citing the very same stage credits, for talented scenic and costume designer Christopher Oram. (He might well be saddled here by the needs of the special effects people. All those ice storms, so effective in the animated film, are suggested by exceedingly low-tech ice-cracking projections running up and down the set walls; these projections might have restricted Oram’s choice of shape and material.) And a few happy moments aside, Rob Ashford’s uneven choreography consists mostly of happy villagers, angry villagers, and lots of twirlin’ around.\n\nThis is not to proffer that Frozen sorely needs more musical comedy; the problem is that the non-musical comedy portions are so—well—frozen. Operetta, melodrama, villagers with pitchforks: whose idea of musical comedy is this? Entering 2020, we are back in the 1920s. We have little nostalgia for Young Frankenstein around here, but on more than one occasion I distinctly felt that they might have profitably called in Mel Brooks and Susan Stroman to goose up the crowd.\n\nAnd so we have Disney’s latest, the most recent in a line of stage musicals that began with Beauty and the Beast in 1994, peaked with the still-roaring Lion King in 1997, and continues with the current Aladdin. As for Frozen—which stands in the middle of the studio’s nine Broadway musicals, entertainment-wise—it likely won’t last past 2027. 2029 at the latest.\n\nFrozen opened March 22, 2018, at the St. James Theatre. Tickets and information: frozenthemusical.com.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
