{
  "showId": "hillary-and-clinton-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2019/04/18/hillary-and-clinton-peering-inside-the-private-lives-of-a-power-couple/",
  "publishDate": "2019-04-18T19:20:21",
  "fullText": "A smart entertainment, Hillary and Clinton offers an inside look at the dynamics of a power couple—an extremely powerful couple—who can’t live with each other and yet who can’t live without each other.\n\nThink of it as Private Lives involving Public Figures.\n\nA remarkable performance by Laurie Metcalf and quite a sympathetic one by John Lithgow, two superb actors playing at the top of their exceptional games in the title roles, make this offbeat comedy a must-see for savvy viewers who cannot be bothered with the usual tourist crap on Broadway.\n\nCleverly composed by Lucas Hnath, Hillary and Clinton riffs on what Hillary Rodham Clinton and Bill Clinton could have said and might have done in a motel room in New Hampshire at the time of a presidential primary held a million years ago, back in 2008.\n\nAll this, and Barack Obama, too, who drops in to suss out what those two smarties are up to.\n\nIntrigued? If not, then probably you should skip it: These 90-minute doings at the John Golden Theatre, where the production premiered on Thursday, will register as insubstantial to viewers who won’t play along with Hnath’s game.\n\nHnath’s previous play, A Doll’s House, Part 2, required audiences to know something about Ibsen’s original in order to appreciate it. In Hillary and Clinton, Hnath provides some what-ifs and references to history, but otherwise expects the audience to complete a number of blanks regarding how the Clintons might deal with each other.\n\nHnath inserts numerous pauses into the text as the characters contemplate each other or consider their own thoughts. These stretches of silence can be eloquent (or merely empty) depending upon what viewers read into them. In this way the play ventures beyond the merely fictional into fantasy.\n\nCasually clad in sweatpants, a turtleneck, and slippers, Metcalf walks out into designer Chloe Lamford’s elegantly abstract setting and begins talking in what is seemingly her own voice.\n\nMetcalf remarks upon the infinite nature of the universe, in which an infinite number of planet earths might exist, and notes how there might be one situated many light years away from here that is only slightly different from our own. On that distant planet Earth there is a notable woman named Hillary who is striving to become president of the United States. And she also happens to be married to a man named Bill, who once was the president.\n\nBy now, Metcalf has assumed the character of this alternative Hillary, who is in anxious conversation with Mark, her campaign manager, about the impending primary election that she appears to be losing. Worse, the campaign coffers are nearly empty. Going against Mark’s urgent advice, Hillary summons Bill, her semi-estranged husband, to help her out. “My campaign is not a cure for your boredom,” she warns him.\n\nIdentified only as Hillary and Bill in the program, they struggle to get over old hurts and betrayals. He’s lonely and feels like his best years are behind him. She expresses frustration at watching lesser individuals get ahead of her. Their personalities frequently are at odds.\n\n“People don’t like people who make them feel like shit,” he tells her.\n\n“How about if ‘people’ grow the fuck up?” she snaps back.\n\nThere is even serious talk of divorce. Yet in spite of their significant differences, when an opponent named Barack arrives, Hillary and Bill smoothly mesh into perfect partnership to deal with his advances.\n\nNeither Metcalf nor Lithgow attempt to imitate the voices and manners of the actual Clintons. Yet in some magical alchemy as the play progresses, the actors eerily resemble them, especially Metcalf, whose sardonic Hillary evidently burns with a white-hot flame beneath a usually cool and guarded surface. The give-and-take ease of their performances is marvelous.\n\nPeter Francis James lends Barack a cheerful smile and a wary sense of confidence. Zak Orth depicts Mark with a dozen varying degrees of frustration.\n\nThis relatively light, often amusing, and yet challenging play is smoothly staged by director Joe Mantello. The understated perfection of his production, which supports the play so subtly, is a tribute to Mantello’s unerring taste as well as to the excellence of the designers.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
