{
  "showId": "the-hills-of-california-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2024/09/29/the-hills-of-california-le-jez-hot/",
  "publishDate": "2024-09-29T22:55:55",
  "fullText": "Though Jez Butterworth’s new play, The Hills of California—which just opened at the Broadhurst Theatre after premiering in January on the West End—takes its title from a jazzy, sun-soaked 1948 song by Johnny Mercer, this elegiac, superbly written drama feels more akin to another tune, one that you’ll hear late in the show: the wistful, Depression-era lullaby “Dream a Little Dream.”\n\n“Just hold me tight and tell me you’ll miss me/ While I’m alone and blue as can be.” A genuine plea for affection, and for a true emotional connection—that’s what a group of 30-something sisters are searching for, and trying desperately to achieve, as their mother lies dying in their childhood home in Blackpool, England.\n\n“It could be today. Could be tomorrow,” Penny (Ta’Rea Campbell), the kindly nurse who’s tending to their mum, tells the youngest, Jill (Helena Wilson). “How long is a piece of string?” Thus begins the inevitable morbid waiting game for sisters Jill, Ruby (Ophelia Lovibond), and Gloria (Leanne Best); they’re also waiting for the eldest, Joan, whose appearance is so questionable she might as well be called Godot.\n\nThe year is 1976, but you’d never know it from the looks of the parlor: With its tattered tiki bar and nonworking jukebox, the resort—it’s called the Seaview, though it doesn’t have one—appears stuck in a tacky midcentury time warp.\n\nGloria’s goofball husband, Bill (Richard Short), and Ruby’s nondescript nice-guy hubby, Dennis (Bryan Dick), are also on the scene, but Butterworth quickly dispatches them on some errand or another. Unlike his previous plays—most notably, the chest-thumping Jerusalem (2009)—Hills focuses squarely on the female characters. After all, the playwright is the father of four daughters; he’s had a good glimpse into these dynamics.\n\nBut this is no standard-issue dysfunctional family drama; it’s also a meticulously crafted, emotion-packed memory play. With one rotation of Rob Howell’s spectacular towering set—anchored by a labyrinthian Escher-like staircase that seems to stretch to the sky—we’re back in 1955, in the Seaview Luxury Guesthouse and Spa, which is not luxurious and almost certainly doesn’t have a spa. Hills toggles between decades with ease—a credit to director Sam Mendes, whose particular gift is taking sprawling stories (see: Butterworth’s The Ferryman; The Lehman Trilogy) and making them feel intimate.\n\nIn the kitchen, Young Jill (Nicola Turner), Young Ruby (Sophia Ally), Young Gloria (Nancy Allsop), and Young Joan (Lara McDonnell)—under the watchful eye of mom Veronica (The Ferryman’s Laura Donnelly)—practice their four-part harmonies in a quest to become the next Andrews Sisters. Their quest? Possibly. Veronica’s quest? Absolutely.\n\n“A song is a place to be,” she tells her brood of stars-to-be. “Somewhere you can live. And in that place, there are no walls. No boundaries. No locks. No keys. You can go anywhere.”\n\nCan you, though? After Luther St. John (David Wilson Barnes), a shady American agent, sees the Webb Sisters perform, he breaks the news to Veronica—boogie-woogie music simply isn’t popular anymore. “Have you heard of Elvis Presley?” he asks. “I’m sorry. I don’t know what that is,” she replies. Of course, Elvis wasn’t exactly an international sensation at that point. A single mother of four in a resort town in Lancashire surely wouldn’t have heard of him. (Butterworth clearly knows, and loves, his music. In the next scene, Dennis talks about seeing Little Richard “supported by a little-known band from Liverpool,” and Bill extols the virtues of “Rock Around the Clock” and “Eleanor Rigby” while tsk-tsking Elkie Brooks and David Bowie. And fans of The Ferryman might recall a Rolling Stones–Beatles–Led Zeppelin discussion over a bottle of Bushmills.)\n\nUnlike Godot, 1976 Joan eventually arrives (she’s also played by Donnelly), with a Penny Lane coat and laissez-faire attitude. She has a flask of Wild Turkey that she shares with Jillian, a perfect ’70s shag that Ruby wants to copy, and an American accent that annoys Gloria. (“Is that your speaking voice?” she snipes. “You mean the one she’s speaking with,” Jillian retorts.) She also has an amazing story involving pizza, a case of wine, and the Andrews Sisters. Incidentally, all the actors playing the Webb women—both their 1955 and 1976 incarnations—are reprising the roles they played in London, so they’re well versed in each sibling’s quirks. Gloria likes to play the tough girl, and she comes in like a wrecking ball, but Best reveals the flickers of pain behind those smoky eyes.\n\nDonnelly—Butterworth’s longtime partner and muse—gives a pitch-perfect performance as Joan, morphing so convincingly into a groovy chain-smoking hippie that many audience members don’t even realize it’s her. And she’s even better as Veronica. It’s a character we’ve seen before: the overbearing stage mother with an almost intractable belief in her daughters’ talent and an indefatigable commitment to their success—a single mom who’ll do whatever it takes. (One word: Gypsy.) Yet Donnelly makes Veronica truly sing.\n\nThe Hills of California opened Sept. 29, 2024, and runs through Dec. 22 at the Broadhurst Theatre. Tickets and information: thehillsofcalifornia.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
