{
  "showId": "the-hills-of-california-2024",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2024/09/29/theater/the-hills-of-california-review.html",
  "publishDate": "September 23, 2024",
  "fullText": "Two sounds greet you at the start of “The Hills of California,” Jez Butterworth’s relentlessly entertaining new play: the crashing of waves on the beaches of Blackpool and the tinkling of a tinny piano being tuned.\n\nBoth are plot points: The story concerns a musical family operating a rundown resort on the west coast of England. “Boogie-Woogie Bugle Boy,” “It Never Entered My Mind,” “When I Fall in Love” and “Dream a Little Dream of Me” are among the marvelous oldies you’ll hear sung during the course of the action.\n\nBut the crashing and tuning are thematic points, too. Though frequently funny and, even at nearly three hours, swift, “The Hills of California,” which opened on Sunday at the Broadhurst Theater, drops you deep into the devastations of time and lifts you gently into the consolations of song.\n\nIt does so within a familiar stage format — familiar in life, alas, as well: the dying-parent drama. In 1976, the four Webb sisters reunite at the Seaview Luxury Guesthouse (which is neither luxurious nor within sight of the sea) as their mother, Veronica, who ran the place for decades, under several desperate versions of the name, expires upstairs.\n\nJillian, the youngest, has failed to thrive; she’s a 32-year-old virgin who lives at home, chatters nervously and secretly smokes. The others have run as far from Blackpool as they could: Ruby and Gloria into unhappy marriages hours away; Joan, the oldest, toward a dream of fame in California. Whether she has achieved that dream is an open question; she has not been back home since she left at 15, and only Jillian believes she will return even now.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Jez Butterworth's new play is a memory palace of extraordinary detail and emotional power, anchored by Laura Donnelly's magnificent performance as a woman confronting her past.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "This is not the kind of play that brandishes a singular sharp point; it is the kind that swaddles you in innumerable impressions. Like Butterworth’s previous Broadway outings — the mythopoetic “Jerusalem” in 2011, the brawny Hugh Jackman vehicle “The River” in 2014 and especially the Irish fable “The Ferryman” in 2018 — “The Hills of California” is a yarn, not a lesson; a tale, not a tract. It resists interpretation, possibly as a way of resisting criticism, which, despite its flaws, it clearly does with great success.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Jez-Butterworths-THE-HILLS-OF-CALIFORNIA-Opens-on-Broadway-Updating-Live-20240929",
  "showScoreExcerpt": "Jez Butterworth's new play is a memory palace of extraordinary detail and emotional power, anchored by Laura Donnelly's magnificent performance as a woman confronting her past.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Short text (26 words)",
  "textQuality": "partial",
  "sources": [
    "web-search",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 9,
  "previousUrl": "https://www.nytimes.com/2024/09/23/theater/the-hills-of-california-review.html",
  "urlDiscoveredAt": "2026-02-05T04:54:26.040Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 300,
  "archivePath": "data/archives/reviews/the-hills-of-california-2024/nytimes--jesse-green_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:19:23.664Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250507133945",
  "archiveOrgUrl": "http://web.archive.org/web/20250507133945/https://www.nytimes.com/2024/09/29/theater/the-hills-of-california-review.html",
  "wordCount": 300,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T16:28:06.724Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text cuts off mid-article with an error message about enabling JavaScript and verifying access, indicating this is not complete review content.; openai: The text includes a message about trouble retrieving the article content, indicating it's incomplete and not a full review.; gemini: The review is cut off mid-sentence, preventing a clear understanding of the critic's overall verdict.",
  "promptVersion": "5.2.0"
}
