{
  "showId": "the-hills-of-california-2024",
  "outletId": "observer",
  "outlet": "Observer",
  "criticName": "David Cote",
  "url": "https://observer.com/2024/09/review-long-bumpy-ride-to-sisterly-reconciliation-over-the-hills-of-california/",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Butterworth writes sprawling, talky epics with ensembles in the double digits, three-hour run times, and lots of room for showy speeches. He’s fascinated by the death of dreams and the past that haunts us, the slow decay of England. Hills is not essentially different, thought it does focus on women. Men in this world—save one—are feckless husband-enablers and punching bags for Veronica and her mostly unhappy grown daughters. The one man who makes a definitive impact on the Webb household is the Yank talent scout, Luther, played by New York stage veteran David Wilson Barnes. Seeming at first a dryly reserved finder of genius (he claims to have discovered Nat King Cole), Luther reveals darker motives by requesting a private audition with 15-year-old Joan (Lara McDonnell) in “Mississippi” (Seaview’s rooms are named after American states). What makes the offstage encounter between Luther and Joan more disturbing is the suggestion that the girl initiates it—a tragic escape from her suffocating surroundings.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Jez-Butterworths-THE-HILLS-OF-CALIFORNIA-Opens-on-Broadway-Updating-Live-20240929",
  "showScoreExcerpt": "“The cathartic showdown between the angry, grieving siblings leaves you more or less glad to have ridden the whole roller coaster.”\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "bwwScore": 7,
  "sources": [
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ]
}