{
  "showId": "the-hills-of-california-2024",
  "outletId": "timeout",
  "outlet": "Time Out New York",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/the-hills-of-california-broadway-review-jez-butterworth-laura-donnelly",
  "publishDate": "September 29, 2024",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "The Hills of California is often very funny, but it has a core of deep regret that gets revealed as layers of family secrets are peeled away.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/the-hills-of-california/",
  "bwwExcerpt": "While the play is an ensemble effort, it is also an extraordinary showcase for Donnelly. The present here is haunted by the past, and the two collide powerfully in the wreckage and reckoning of the play’s third act. (Butterworth has rewritten it for the better from the version that played in London.) Donnelly returns in this final stretch, strikingly and effectively, to play a wholly different character. But the moment in her performance that will stay with me the longest comes a little earlier, at the end of the second act, when Veronica stares out at the audience, failed by her aplomb, listening in terror for a silence she dreads. In her eyes we see the cost of her ambition: As ancient in its way as any, this is a story of human sacrifice.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Jez-Butterworths-THE-HILLS-OF-CALIFORNIA-Opens-on-Broadway-Updating-Live-20240929",
  "showScoreExcerpt": null,
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "dtli",
    "web-search",
    "nyc-theatre",
    "bww-reviews",
    "bww-roundup"
  ],
  "nycTheatreExcerpt": "While the play is an ensemble effort, it is also an extraordinary showcase for Donnelly. The present here is haunted by the past, and the two collide powerfully in the wreckage and reckoning of the play's third act. (Butterworth has rewritten it for the better from the version that played in London.)",
  "bwwScore": 7
}
