{
  "showId": "the-height-of-the-storm-2019",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "Stephen Dalton",
  "url": "https://www.hollywoodreporter.com/review/height-of-the-storm-theater-1151098",
  "publishDate": null,
  "fullText": "The fruitful cross-channel partnership between Parisian literary sensation Florian Zeller and veteran translator Christopher Hampton continues with The Height of the Storm, the pair’s fifth collaboration in just four years. Newly launched in the West End to rave reviews, Jonathan Kent’s production is an artfully constructed chamber piece whose lightly experimental form slowly subverts its own surface aura of conventional dinner-party naturalism from within. As ever with Zeller, there are self-conscious echoes of Pinter here, but with nods to Ibsen and Chekhov and Michael Haneke’s mournful late-life lullaby Amour, too.\n\nThe Height of the Storm is an elegant mood piece, but a little thin at just 80 minutes, without much substance to back up its tricksy stylistic flourishes. Titled after a line of poetry by Rene Char, it feels like a poem itself, graceful but slight, drawing from Zeller’s familiar emotional palette rather than adding new colors. The marquee appeal of Eileen Atkins and Jonathan Pryce should guarantee brisk business for this limited seven-week run, and both give reliably fine performances. But many will leave feeling they have had a light snack rather than a full meal.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n TV\n \n \n \n \n\n \n \n \n \n Toheeb Jimoh on His Big 'Industry' Moment and Where It Leaves Tender: \"Whitney Is Going to Have to Pull a Rabbit Out of a Hat\" \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Movies\n \n \n \n \n\n \n \n \n \n Rotterdam Film Festival: 'Variations on a Theme' and 'Master' Win Top Awards\n\nZeller’s latest export feels purposely designed as a companion piece to his prize-winning 2014 breakthrough hit The Father, which earned Frank Langella his fourth Tony Award after it transferred to Broadway in 2016. Both are character studies of a curmudgeonly patriarch called André who becomes an increasingly unreliable narrator as he drifts into dementia. Both deal with creeping loss and fractious parent-child relations within a slippery time-frame which purposely keeps the audience guessing, drawing us into the protagonist’s unsettled mental state.\n\nPryce alternates between glum brooding and childlike bonhomie as André, a celebrated writer now sinking into the twilight zone of dementia in his provincial French home. Atkins plays his redoubtable wife, teasingly named Madeleine with a nod to Proust, a stoic life partner still standing by her man despite challenges that prove steadily more insurmountable as the play yields its secrets.\n\nTogether for half a century, André and Madeleine are hosting a tense visit from their two grownup daughters, Anne (Amanda Drew) and Elise (Anna Madeley), whose fraught conversations slowly make it clear that one of the main characters is dead but still present in ghostly memory. No spoilers here, since Zeller clearly enjoys wrong-footing audience expectations, though admittedly the play’s emotional force does not depend on this single gimmicky twist. As motifs loop and repeat, the text flirts teasingly with supernatural and thriller tropes, blurring character names and dredging up an extramarital affair from Andre’s past.\n\nZeller and Hampton mostly maintain an elegiac tone, underscored by Kent’s tastefully muted production and Anthony Ward’s handsome stage design, a high-ceilinged bourgeois interior finished in autumnal hues that suggest Ibsen-esque Scandi-gloom more than classic French farce. Hugh Vanstone’s lighting design also merits a mention, subtly shifting the emotional temperature and blanking out individual characters with spooky precision.\n\nThere are agreeable touches of spiky comedy, too, as long-buried family tensions bubble to the surface. The 84-year-old Atkins is the driving force here, throwing bitchy shade and dropping sporadic F-bombs with palpable relish. Her razor-sharp performance wipes the floor with everyone else, even Pryce’s finely calibrated, Lear-like André. There is nothing like a Dame in full screw-the-world diva mode. But even Atkins in grand form is not quite enough to erase the nagging sensation that Zeller’s theatrical brand of nouvelle cuisine has been just a little overhyped.\n\nVenue: Wyndham’s Theatre, London\n Cast: Eileen Atkins, Jonathan Pryce, Amanda Drew, Anna Madeley, James Hillier, Lucy Cohu\n Director: Jonathan Kent\n Playwright: Florian Zeller, translated by Christopher Hampton\n Set and costume designer: Anthony Ward\n Lighting designer: Hugh Vanstone\n Music: Gary Yershon\n Sound designer: Paul Groothuis\n Presented by Simon Friend, Mark Goucher, Howard Panter, Gavin Kalin, Act Productions, Scott Landis, Tulchen Bartner Productions, Laurence Myers",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Stage veterans Jonathan Pryce and Eileen Atkins play a long-married couple facing their final curtain in the latest English-language export from French literary star Florian Zeller.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 675,
  "archivePath": "data/archives/reviews/the-height-of-the-storm-2019/hollywood-reporter--stephen-dalton_2026-02-07.html",
  "textFetchedAt": "2026-02-07T15:45:27.231Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "wordCount": 675,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T11:30:33.602Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is just a plot summary and cast description with no critical evaluation or verdict about the show's quality.; openai: The provided text is a brief introduction to the play's premise and cast, with no evaluative content or opinion on the production itself.; gemini: This is a plot summary/description, not a review with an evaluation or recommendation.; kimi: This is a truncated excerpt that provides only cast identification and basic premise with no evaluative content. The phrase 'Read more' indicates the actual review content is missing. No opinion, verdict, or critical assessment is present in the available text.",
  "promptVersion": "5.2.0"
}