{
  "showId": "the-height-of-the-storm-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2019/09/24/the-height-of-the-storm-cloudy-skies-ahead/",
  "publishDate": "2019-09-24T21:45:19",
  "fullText": "“You think people are dead, but it’s not always the case.”\n\nAndré (Jonathan Pryce) is relaying a rambling story about an acquaintance who may have died after consuming some poisonous mushrooms. Or slipping off a perilous path into the river. Or he might be alive and well, living another life with a woman who is not his wife.\n\nWe’ve just spent half of the first scene of Florian Zeller’s The Height of the Storm thinking that André is alone. As Anne (Amanda Drew) explains, again and again, to her inflexible father, “You can’t live here on your own.” Then, in breeze her mother, Madeleine (Eileen Atkins), and her sister, Élise (A Gentlemen’s Guide to Love and Murder’s Lisa O’Hare), toting groceries. We thought Madeleine was dead—but it might not be the case.\n\nWith an assist from lighting designer Hugh Vanstone, Zeller and director Jonathan Kent manage to stretch the is-she-or-isn’t-she tension until the 80-minute play’s end—and even beyond, judging by post-show comments. (Overheard: “Wait, so which one was dead?” “I don’t know, I was going to ask you!”) But it almost doesn’t matter.\n\nThe production’s chief draw is the pairing of theatrical luminaries Pryce and Atkins as a 50-years-married couple, and they more than live up to the hype. As the slowly deteriorating André, Price certainly has the showier role; his rantings and ravings put me in mind of another on-the-decline dad, Lear. But Atkins’ performance—even as Madeleine is doing the most mundane things, such as sipping tea or chopping an onion—possesses a quiet intensity. Watch her methodically peel mushrooms; it’s practically hypnotic.\n\nIncidentally, if these characters sound familiar, they should. Zeller’s The Father—which also played at the Friedman Theatre, and starred a Tony-winning Frank Langella—centers on the aging André, who’s descending into dementia. He too has a daughter named Anne. There’s no need to enumerate all the crossovers, but suffice it to say that The Father is a much more unflinching, cold-eyed portrayal of a fast-crumbling man.\n\nPerhaps it’s the presence of Madeleine, but Storm feels less chilly than Zeller’s The Father and The Mother (seen earlier this year off-Broadway); similarly, the translation, by the French playwright’s longtime collaborator, Christopher Hampton, sounds less stilted. “The fact that you stayed together all that time,” Anne marvels to her mother. “It’s not very common, if you think about it. The ability to love one another to the end.”\n\nYet at other times, something about Storm looks too much an exercise. Two characters, obliquely called The Woman (Lucy Cohu) and The Man (James Hillier), pop in here and there to…well, The Woman isn’t so much a set of characters as a frustrating stuck-in-a-loop plot device. The play is at its best at its most meditative—the calm during the Storm, if you will. André, achieving an ever-so-brief moment of lucidity with Anne: “You know, as time goes by, You see things in a different light. What once seemed important to us suddenly becomes trivial.” Or Madeleine, enjoying the silence after their daughters have departed: “It’s nice of them to come and see us… But after two days, I’ve had enough of it. Don’t you think?” A few more of those moody, mushroom-peeling moments would not have been unwelcome.\n\nThe Height of the Storm opened Sept. 24, 2019, and runs through Nov. 24 at the Friedman Theatre. Tickets and information: heightofthestorm.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
