{
  "showId": "the-height-of-the-storm-2019",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "http://www.vulture.com/2019/09/theater-review-broadways-the-height-of-the-storm.html",
  "playbillVerdictUrl": "http://www.vulture.com/2019/09/theater-review-broadways-the-height-of-the-storm.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nEileen Atkins and Jonathan Pryce in The Height of the Storm.\n Photo: Joan Marcus\n \n \n \n If the presence of two British theater grandees playing a couple who’s been married for half a century, along with the title The Height of the Storm, makes you think you’re in for 90 minutes of Strindbergian Sturm und Drang, you’re in entirely the wrong ballpark. Come down from the furious fjords, with their long lineage of theatrical battles of the sexes, and you’ll find yourself in a big airy house outside Paris, long inhabited and comfortably cluttered, full of books, with a garden outside the kitchen window. Here live André and Madeleine, played in Christopher Hampton’s translation of the hip French playwright Florian Zeller’s rather wispy drama by Eileen Atkins and Jonathan Pryce. They’ve been married for ages, they like mushrooms, and they love their adult daughters, uptight Anne (Amanda Drew) and serial-dating Elise (Lisa O’Hare), but they prefer it when they’ve got the house to themselves. Mostly, they love each other, truly and entirely. Except … Madeleine is dead.\n\nOr is André dead? Or is the nearness of death — for either or both — just looming in the air? The trick of Zeller’s play, directed by a mostly unobtrusive Jonathan Kent, is that we’re never quite sure what reality we’re in. It’s as if Zeller wrote out several scenarios, cut the dialogue into pieces, spread it out on the floor, and intertwined the possibilities. Dimensions overlap. Conversations that imply the absence of (and the family’s mourning for) one parent will be diverted by the appearance of that parent. André or Madeleine will go silent for a long stretch, dropping out of a scene as a living presence and instead haunting it as a ghost, but then someone will acknowledge one of them, and he or she will speak and live again.\n\nZeller approaches his play like someone fiddling with the dial on an old radio. He hops between frequencies, creating not so much a narrative as a meditative haze. In the playwright’s 2016 Broadway debut, The Father, Frank Langella won a Tony as an 80-year-old former dancer descending into Alzheimer’s. In The Height of the Storm, though Madeleine remains tack-sharp, André shows signs of disintegration. Zeller’s territory is fragmentation, pointillism with half the dots missing. In some ways, the delicacy of The Height of the Storm is its strength — in the opportunity it offers for powerful actors to work with small brushes, and in the notable and refreshing absence of rage and resentment from its central characters. But this gauziness of tone also keeps the play from feeling intellectually or emotionally filling. It feels, to use the French, like an étude — a chance for performers to play briefly, and at times movingly, on certain themes, but without much ultimate sense of consequence.\n\nIt doesn’t help that Zeller’s bendy-twisty approach to time and reality allows him to get away with a certain number of dangling threads, enigmatic gestures that hint at meaning but seldom do more than hint. On the night before the play begins, there’s a big storm. “It woke me up,” Anne says to her father in the first scene. “It’s a long time since I’ve seen such a violent storm. It was impressive. Don’t you think?” There’s recurring reference to a news story about an elderly couple who committed happy suicide-via-poison-mushroom at the hotel where they honeymooned in their youth — the same hotel where mushroom-loving André and Madeleine honeymooned. There’s a mysterious bunch of flowers sent without a card. There are figures known only as the Man (James Hillier) and the Woman (Lucy Cohu) — but while the Woman shifts identity, portraying a couple of different figures from the past with a hefty helping of smoky-voiced je ne sais quoi, the Man only ever really represents Elise’s boring boyfriend, Paul. The flowers, the dead couple, the strangers in the house, the titular storm: They all could be something, but none of them quite is. Well-honed mystery undergirded by a foundation of authorial certainty is one thing, but Zeller’s play doesn’t seem to set rules for itself. Instead, it banks on titillation through ambiguity, which can make it feel coy.\n\nThe production’s saving grace is the absolutely wonderful Eileen Atkins. Though Pryce’s André — with his shaking hands, faraway stare, and sporadic outbursts both of cheer and aggrieved frustration — is more accurately the center of the show, he’s too consistently lost to captivate us as fully as Atkins’s brisk, no-nonsense Madeleine. If there is a One Reality to Rule Them All in the play, it’s the one in which André has lost his wife and, along with her, his grip on himself and the world around him. Pryce is vulnerable and affecting, his big forehead furrowed and his hands constantly twitching, as if searching for something small and precious he let fall. His, though, is a strong performance, while Atkins seems, simply and a little magically, to be breathing through Madeleine’s lungs. She’s so completely at ease with herself, so entirely un-acty, so agile and sharp without the slightest hint of force, that it’s hard to stop watching her whenever she’s onstage. Late in the play, she also delivers a brilliant lesson in how to turn Zeller’s sometimes writerly dialogue into sheer, fluid elegance. As Anne in the play’s first scene, Drew does her best but understandably stumbles through a long, trope-y chunk of text spoken to her father — one of those, “I’m going to keep talking even though you aren’t answering because this is a play and there are things we need to know” bits. Madeleine’s got the same kind of set piece near the show’s end, and Atkins tosses it off with total grace and self-possession, setting the stage for the finale, a quiet duet between Madeleine and André, to be truly and deeply touching. She, at any rate, is an artist at the height of her particular storm.\n\nThe Height of the Storm is at the Samuel J. Friedman Theatre.\n\nShow \n \n \n Comment\n \n\n Slight Drama and Great Actors in The Height of the Storm\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1043,
  "archivePath": "data/archives/reviews/the-height-of-the-storm-2019/vulture--sara-holdren_2026-02-04.html",
  "textFetchedAt": "2026-02-04T19:02:37.288Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250824143243",
  "archiveOrgUrl": "http://web.archive.org/web/20250824143243/https://www.vulture.com/2019/09/theater-review-broadways-the-height-of-the-storm.html",
  "contentTier": "complete",
  "wordCount": 1043,
  "tierReason": "Full review text"
}