{
  "showId": "a-beautiful-noise-the-neil-diamond-musical-2022",
  "outletId": "whats-up-newp",
  "outlet": "What's Up Newp",
  "criticName": "Ken Abrams",
  "url": "https://whatsupnewp.com/2024/09/theater-review-a-beautiful-noise-indeed-neil-diamond-musical-is-a-hit-a-ppac/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "There were no real weaknesses in the production, although some of the popular songs felt a bit forced at times, a bit perfunctory, while more introspective tunes like “You Don’t Bring Me Flowers,” a duet with Fradiani and Kohn, shined bright. The narrative structure of the story presents the songs in context – Who else could write a singalong blues song (“Song Sung Blue”) that just makes you want to smile? The show stands out as one the stronger productions in the recent flurry of jukebox musica",
  "bwwThumb": "Up",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-National-Tour-of-A-BEAUTIFUL-NOISE-THE-NEIL-DIAMOND-MUSICAL-20240926",
  "contentTier": "complete",
  "fullText": "The hype is real. The Broadway hit A BEAUTIFUL NOISE: The Neil Diamond Musical, which kicks off its national tour this week at the Providence Performing Arts Center, is an entertaining night of song and storytelling packed with the legendary singer’s hits along with a peek into the life of the character who shaped them. A BEAUTIFUL NOISE takes a look at the singer’s 60+ year career, from his working-class origins in Flatbush, NY, to superstardom in Beverly Hills, where he hung out with the “Redfords” and (former high school classmate) Barbra Streisand, among others. Over the course of that career, Diamond had ten #1 singles, sold over 140 million albums, received a Grammy Lifetime Achievement Award, and was a Kennedy Center honoree. The story is an honest portrayal of the man behind the music, his struggles with chronic depression, the “clouds” that get in the way of his ability to find happiness. The show is set in Diamond’s therapist’s office, where he examines his life through his lyrics. His ongoing melancholy, never fully diagnosed, is explored in conversation. Those clouds continue to haunt him throughout his career, except when he takes the stage, where he is happiest. In fact, the tour became his second family, but his time away from home conflicts with his domestic life, contributing to his two divorces. Overall, the cast is outstanding. Former American Idol Nick Fradiani is magnificent in the role of Neil-Then, recreating scenes from Diamond’s early struggles as a songwriter, his growth as a performing artist (he was a reluctant singer, believe it or not), and his enormous success on worldwide concert tours. The casting is perfect – Fradiani’s vocals could easily be mistaken for Diamond at the height of his career. His soulful delivery is penetrating and powerful, yet still vulnerable when required. It’s not all song and dance in this production; storytelling plays a central role, and Lisa Reneé Pitts, who plays Doctor, gently coaxes the reluctant singer to acknowledge some often painful memories, which, of course, contribute to making him the international sensation that he became. There are also standout moments from Hannah Jewel Kohn who plays Diamond’s second wife, Marcia Murphey, and Robert Westenberg, who brings depth to the character of Neil – Now. An aging Diamond is a reluctant patient, “I put everything into my songs,” he says in the show, but hard work in therapy using his lyrics helps him get in touch with his former self, bringing meaning to all he has experienced. It’s not a completely triumphant resolution; there are still clouds, but fewer, he jokes in his final scene with Doctor. There were no real weaknesses in the production, although some of the popular songs felt a bit forced at times, a bit perfunctory, while more introspective tunes like “You Don’t Bring Me Flowers,” a duet with Fradiani and Kohn, shined bright. The narrative structure of the story presents the songs in context – Who else could write a singalong blues song (“Song Sung Blue”) that just makes you want to smile? The show stands out as one the stronger productions in the recent flurry of jukebox musicals, bio-musicals of artists and bands, a genre that schools new fans and brings boomer memories back as their real-life icons slowly fade into history. Don’t miss it! Limited tickets remain for shows running through Saturday, September 28 – click here for details. Lifestyle Editor Ken Abrams writes about music, the arts and more for What'sUpNewp. He is also an Editor and Writer for Hey Rhody Media. Ken DJ's \"The Kingston Coffeehouse,\" a roots/folk/rock radio show every Tuesday, 6-9 PM on WRIU 90.3 FM. He is a former educator in the Scituate, RI school system where he taught Social Studies for over 30 years. He is on the board of the Rhode Island Folk Festival and Newport Live (formerly Common Fence Music), a non-profit that brings diverse musical acts to the Newport area. I give this 2.5/5. Yes, the lead did sound like Neil Diamond and gave a strong vocal performance. After that it was all downhill. The choreography felt forced (what was with all the outstretched arms as a central dance theme?), the costumes eh, and the plotlines muddled. Was Neil a manic depressive? Not sure what to make of that. Finally, the comic reference to Mao was insulting. You must be logged in to post a comment.",
  "isFullReview": true,
  "textWordCount": 733,
  "archivePath": "data/archives/reviews/a-beautiful-noise-the-neil-diamond-musical-2022/whats-up-newp--ken-abrams_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:27:24.073Z",
  "originalScore": "2.5/5",
  "originalScoreNormalized": 50,
  "scoreSource": "numeric-stars",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 733,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-05T14:51:52.374Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about the national tour of 'A Beautiful Noise' at the Providence Performing Arts Center, not the current Broadway run.; kimi: This review covers the national tour production kicking off at the Providence Performing Arts Center, not the current Broadway run.",
  "promptVersion": "5.2.0"
}
