{
  "showId": "a-moon-for-the-misbegotten-2007",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Unknown",
  "url": "http://variety.com/2015/legit/reviews/moon-for-the-misbegotten-review-audra-mcdonald-williamstown-1201566517/",
  "playbillVerdictUrl": "http://variety.com/2015/legit/reviews/moon-for-the-misbegotten-review-audra-mcdonald-williamstown-1201566517/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "When Audra McDonald's Josie Hogan embraces Will Swenson's James Tyrone in the last act of Eugene O'Neill's elegiac masterwork \"A Moon for the Misbegotten,\" it's an act — and a performance — of profound love, understanding and grace. This barefoot madonna may be raw, rough and randy for most of the play, but at this moment her open heart knows this broken man most needs peace before dying. The six-time Tony winner also knows what the role needs to get her to that transformative moment in the excellent Williamstown Theater Festival production. In her freshman go-round with O'Neill, McDonald goes to the head of the class in a full-bodied, sure-footed and deeply moving performance that is destined to be have further life beyond the Massachusetts Berkshires’ annual stage festival.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Jennifer Lawrence Playfully Trolls White Men: 'Oh My God! If I Could Just Be Their Champion. They Are So Misunderstood' \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Jennifer Lawrence Says 'I Turned Down' Tarantino's 'Hateful Eight' Offer and Then Lost 'Once Upon a Time in Hollywood' Role After the 'Internet Went Out of Its Way to Call Me Ugly'\n\nIn this production, the Hogans, the Connecticut farm tenants of the landlord Tyrone in 1923, are not a shanty Irish family as originally written but rather a poor black brood, now reduced to a wily father and his take-charge daughter barely surviving on rock-strewn land in a shack of a house. Though the brogues have been dispensed with, the cavernous class divide still holds true — and may be even more relatable for contemporary audiences.\n\nThe play, written in 1943 and first produced disastrously four years later (it found its place in the theatrical firmament years later), begins as a rustic comedy before it turns, in the second act, into a haunting night of the soul. Director Gordon Edelstein stages this production with assurance, making the most of both the lighthearted scenes and the dramatic anguish of the protagonists, while also discovering quieter, private moments of reflection and realization.\n\nHe is greatly assisted by Ming Cho Lee's original design from an earlier production, and adapted for the WTF stage by Lee Savage, realistically depicting an unforgiving setting against a slightly surreal and troubled sky. Jennifer Tipton's exquisite lunar (and sunrise) lighting and John Gromada's soundscape also are pluses in the production.\n\nGlynn Turman is comically ornery and later touching as Phil Hogan, Josie's scheming old goat of a father and Tyrone's drinking pal. Aaron Costa Ganis (as the jodhpur-wearing neighbor) and Howard W. Overshown (as an escaping Hogan brother) also do well in their one-off roles.\n\nThough almost too robust to be the \"dead man walking,\" Swenson delivers a solid performance as the dissipated, alcoholic and guilt-ridden Tyrone, haunted by the death of his beloved mother. The actor’s strong, melodic voice nicely taps into the character's sense of theatrical bravura. He also handles the play's lighter moments deftly, as well as tossing aside many of O'Neill's repetitive excesses, making for a less arch character. For Tyrone's big confessional soliloquy, Swenson commits himself to a credible, heart-wrenching confessional.\n\nTogether with McDonald — offstage they are husband and wife — there's real chemistry, even if both performances aren't quite transcendent yet. More time, either in rehearsal or in performance, seems needed on this long night's journey into day to elevate it from a very good and satisfying production to a higher level.",
  "isFullReview": true,
  "textWordCount": 563,
  "archivePath": "data/archives/reviews/a-moon-for-the-misbegotten-2007/variety--unknown_2026-02-03.html",
  "textFetchedAt": "2026-02-03T22:34:11.762Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 563,
  "tierReason": "Full review text",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2015 outside valid range 2004–2009 for show opening 2007"
}