{
  "showId": "war-paint-2017",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/war-paint-theater-review-995023/",
  "publishDate": "April 6, 2017",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "The musical about Helena Rubinstein and Elizabeth Arden has terrific lead performances from Patti LuPone and Christine Ebersole, but the book is disappointingly thin.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The musical about Helena Rubinstein and Elizabeth Arden has terrific lead performances from Patti LuPone and Christine Ebersole, but the book is disappointingly thin.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (24 words)",
  "textQuality": "partial",
  "textWordCount": 307,
  "archivePath": "data/archives/reviews/war-paint-2017/hollywood-reporter--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:19:41.531Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Sundance Film Festival: London, the U.K. spinoff of the famed U.S. indie fest, has unveiled the opening-night film for its 2017 edition.\n\nBeatriz at Dinner, which had its world premiere earlier this year in Park City, Utah, will raise the curtains on the summer event in London, with star Salma Hayek, alongside director Miguel Arteta and screenwriter Mike White, set to introduce the film on June 1.\n\nThe pic focuses on Hayek’s Beatriz, an immigrant from a poor town in Mexico who has drawn on her innate kindness to build a career as a health practitioner in Southern California. When she attends a dinner party and meets her polar opposite, a cutthroat and self-satisfied billionaire real estate developer, their worlds collide. John Lithgow, Connie Britton, Chloe Sevigny and Jay Duplass also star.\n\n“This was a standout at our Utah Festival in January and is a wonderful example of the continued innovation and creativity of our independent filmmakers that we’ll showcase in London again this year,” Sundance Film Festival director John Cooper said Tuesday in a statement.\n\nSundance Film Festival: London is set to run June 1-4 at London’s Picturehouse Central. The full lineup will be announced soon.\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice.",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/war-paint-theater-991870",
  "sources": [
    "web-search",
    "playbill-verdict"
  ]
}
