{
  "showId": "angels-in-america-2018",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sarah Holdren",
  "url": "http://www.vulture.com/2018/03/theater-angels-in-america-punches-through-the-roof-again.html",
  "playbillVerdictUrl": "http://www.vulture.com/2018/03/theater-angels-in-america-punches-through-the-roof-again.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nThe Angel visits Prior Walter in Part Two, Perestroika. Photo: Brinkhoff-Moegenburg In 1935 Gertrude Stein spoke about narrative and the passing of time in a series of talks at the University of Chicago. “Twenty-five years roll around very quickly,” she wrote, but “it is the human habit to think in centuries” and “a century begins and ends” — even while no individual, experienced moment of it seems to have a definite beginning or ending.\n\nTwenty-five have rolled around since Tony Kushner’s Angels in America opened in New York, crashing through the ceiling of American theater just as one of its title seraphim bursts into the bedroom of the character Prior Walter. The men and women of Angels, living in New York City in the mid-’80s at the height of the AIDS crisis, are facing both a monstrous modern plague and the looming closure of the 20th century. The play is permeated with endings — and with the Steinian perception that, somehow, nothing ends, that endings are in essence unknowable.\n\nNow, 18 years into a new millennium, Angels once again spreads its magnificent wings over Broadway. Under the piercing, balletic direction of Marianne Elliott, this brilliant rendering arrives from London’s National Theatre in a moment as detached from solidity as any in living memory — and the play couldn’t feel more vivid, more eloquently enraged, funnier or more full of life than if the ink on its script were still drying. (And it is: Though the text of Angels’ Part One, Millennium Approaches, has been relatively fixed for some time, Kushner has continued to tweak Perestroika, the stranger, more cosmologically expansive Part Two, right up to the present.)\n\nShow \n 1 Comment / 1 New\n \n Comment\n \n\n Theater: Angels in America Punches Through the Roof Again\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 333,
  "archivePath": "data/archives/reviews/angels-in-america-2018/vulture--sarah-holdren_2026-02-06.html",
  "textFetchedAt": "2026-02-06T04:19:41.278Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 333,
  "tierReason": "Full review text"
}