{
  "showId": "macbeth-2008",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Unknown",
  "url": "http://www.thewrap.com/macbeth-theater-review-ethan-hawke-anne-marie-duff-movie-friendly",
  "playbillVerdictUrl": "http://www.thewrap.com/macbeth-theater-review-ethan-hawke-anne-marie-duff-movie-friendly",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Jack O’Brien’s flashy staging of “Macbeth,” which opened Thursday at Lincoln Center Theater’s Vivian Beaumont, isn’t the Bard for Dummies. But it does help if you know less about Shakespeare and more about the movies.\n\nTake, for example, that scene early in the play when Ethan Hawke‘s Macbeth and Anne-Marie Duff’s Lady Macbeth are plotting the murder of the king (Richard Easton). They’re clearly a rattled, demented duo but also very much a loving married couple who, if their kisses are any evidence, enjoy a great sex life. Beyond that display of erotic passion, both actors share a slightly decimated look, and their voices, while capable of volume, are essentially small, scratchy instruments. They’re nuts but seem incapable of murder. Will they hire a hit man to do their dirty work?\n\nAlso read: Ethan Hawke Nabs Another Shakespeare Film: ‘Cymbeline’\n\nThat’s when it’s better not to know Shakespeare. But it’s also the moment that the movie references begin to pile up. Duff is a dead-wringer for Bette Davis’s scrawny Mildred in “Of Human Bondage,” and if you squint, Hawke could be channeling Josh Brolin‘s George W. Bush from “W.” The accents aren’t quite the same (Hawke wisely eschews a British or Mid-Atlantic accent), but no matter. It’s Bette and George. Who could resist seeing that matchup?\n\nO’Brien lets us know that this is a very human-scale drama, but later in the play you may wonder: Who’s that horrible couple everybody’s gossiping about? Bette Davis as a villain you can believe. But George W.? Then you remember: He used to be the most powerful man in the world, even as played by Brolin.\n\nAlso read: 12 Things We Learned About Ethan Hawke From Reddit\n\nThat’s when those two movie references collide with a third: the production. It’s big. “Lord of the Rings” big. Set designer Scott Pask has created these huge, moving “2001: A Space Odyssey” monoliths that induce both claustrophobia and vertigo, but more often open to create great moonscapes bathed in Japhy Weideman’s “Clash of the Titans” lighting. Those LED “Star Wars” swords would be right at home here to help set off the terrific fight scenes, choreographed by Steve Rankin.\n\nHawke and Duff don’t inhabit the stage all that much after their disastrous dinner party where he embarrasses her by imagining that the uninvited and dead Banquo (Brian d’Arcy James) has shown up by mistake. It’s then that the production’s bigness really takes over. It’s not enough that Hecate (Francesca Faridany) and her three witches (Byron Jennings, Malcolm Gets and John Glover, who pulls off an especially effective “Mommie Dearest” impersonation) pick over the banquet leftovers; they’re joined by some half-human/half-animal creatures from “The Island of Dr. Moreau.” Or is it “Avatar”? All the while those huge “2001” slabs continue to circle the action as Hecate and her witches fill all sorts of roles that are traditionally assigned to much less vivid performers.\n\nAnd I was happy just seeing Bette Davis goad George W.",
  "isFullReview": true,
  "textWordCount": 496,
  "archivePath": "data/archives/reviews/macbeth-2008/thewrap--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:23:16.153Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 383 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20200425135929",
  "archiveOrgUrl": "http://web.archive.org/web/20200425135929/https://www.thewrap.com/macbeth-theater-review-ethan-hawke-anne-marie-duff-movie-friendly/",
  "contentTier": "complete",
  "wordCount": 496,
  "tierReason": "Full review text"
}