{
  "showId": "mrs-warrens-profession-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2010/legit/reviews/mrs-warren-s-profession-1117943847/",
  "publishDate": "October 3, 2010",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Cherry Jones brings her considerable star power and formidable acting skills to bear on the title role of Shaw's 1893 play, but even she can't bring this old warhorse back to life.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Cherry Jones brings her considerable star power and formidable acting skills to bear on the title role of Shaw's 1893 play, but even she can't bring this old warhorse back to life.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 402,
  "archivePath": "data/archives/reviews/mrs-warrens-profession-2010/variety--marilyn-stasio_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:05:23.200Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Oct 14, 2010 11:49pm PT \n\n \n\n \n \n \n\n \n\n \n The Flood\n \n \n\n \n\n The narrative thoughtfully expands the 2002 prizewinning short of the same name.\n\nWhen a bar mitzvah boy’s autistic elder brother returns unexpectedly, his unwelcome presence catalyzes a deluge of problems for a dysfunctional Moshav family in poignant drama “The Flood.” Working intelligently with biblical metaphors, the narrative thoughtfully expands the 2002 prizewinning short of the same name from talented Israeli helmer Guy Nattiv and screenwriter Noa Berman-Herzberg. Well cast, intensely thesped, gorgeously rendered pic reaped three kudos at the recent Haifa fest, including Israeli feature, ensuring further fest travel and a long life on the Jewish-interest circuit.\n\nThe Rosko family lives on a ramshackle collective farm settlement along the picturesque Israeli coast, where their small but feisty 13-year-old son, Yoni (Yoav Rotman), is bullied at school. In between learning his Torah portion on Noah’s ark in anticipation of his bar mitzvah, Yoni sells completed homework assignments to his classmates to earn money for the body-building formula he hopes will bring on his delayed puberty.\n\nYoni’s fragile mother, Miri (Ronit Elkabetz, in a fine but atypically restrained performance), cares for toddlers at the community kindergarten and is surreptitiously carrying on with a neighbor. Meanwhile, his gruff, bitter father, Gidi (Tzahi Grad), a grounded pilot, whiles away time secretly growing and smoking marijuana.\n\nWhen the institution housing the Rosko’s severely autistic elder son, Tomer (Michael Moshonov, “Lebanon”), suddenly shuts down, his parents are forced to retrieve him. Tomer’s uncontrollable behavior strains the delicate balance of his family’s lives and disturbs the Moshav community, ultimately forcing his parents and Yoni to confront repressed secrets and current sorrows.\n\nAs with the short, the heart of the feature is Yoni’s coming-of-age story and the relationship of the two brothers. As the quick-witted lad forced to act more like an adult than his parents, newcomer Rotman is a rare find, delivering a performance that is completely natural and convincing; Monoshov’s thesping(which earned the supporting actor kudo at the Israeli Academy Awards ) is physical and raw.\n\nWorking in a fluid, lyrical style in which the visual provides even more information than the verbal, Nattiv (“Strangers”) confirms his directorial chops, despite a happy ending that feels forced.\n\nEasily one of the year’s most impressive-looking Israeli films, “The Flood” owes much to the superlative camerawork of France-trained, Quebec-based lenser Philippe Lavalette and the poetic editing of Tali Halter-Shenkar. Other craft contributions are first-class.",
  "_showNotMentionedDiscoveryAttempted": true
}
