{
  "showId": "a-life-in-the-theatre-2010",
  "outletId": "bloomberg-news",
  "outlet": "Bloomberg News",
  "criticName": "John Simon",
  "url": "http://www.bloomberg.com/news/2010-10-13/patrick-stewart-t-r-knight-talk-nonsense-in-mamet-s-life-john-simon.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "What is sorely lacking is a plot or character development, and certainly affection for the hapless actors which might enlist our empathy. What action there is mostly involves stagehands moving scenery around, so much so, and so visibly, that I wondered whether they shouldn’t be listed as cast.",
  "bwwScore": 4,
  "contentTier": "excerpt",
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 202,
  "archivePath": "data/archives/reviews/a-life-in-the-theatre-2010/bloomberg-news--john-simon_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:00:45.367Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Word count too low: 202 (min: 300)"
  ],
  "showNotMentioned": true,
  "wrongFullText": "It concerns the relationship of Robert, an aging actor on his way down, and John, a young one on the rise, as they rub shoulders, either massaging each other’s egos or rubbing them wrong. The action unfolds onstage (during or after a play), in the wings, backstage, and most often in a shared dressing room. It is, as I wrote at the time, “a compendium of all the timeless absurdities of the theater,” to which I add that Mamet makes the thespian pair out to be thorough meatheads.\n\nLEARN MORETop ReadsUkrainians Defy Russia’s Attempts to Freeze Them Into Submission\n\nby Volodymyr Verbianyi and Daryna Krasnolutska\n\nNYC Real Estate Binge Piles Pressure On a German Pension Plan\n\nby Natalie Wong, Arno Schuetze, Chris Dolmetsch and Karin Matussek\n\nElon Musk’s Nashville Tunneling Venture Has the Mayor Hoping No One Dies\n\nCarvana’s Red-Hot Growth Runs on a Cycle of Borrowed Money\n\nHomeBTV+Market DataOpinionAudioOriginalsMagazineEventsNewsMarketsEconomicsTechnologyPoliticsGreenCryptoAIWork & LifeWealthPursuitsBusinessweekCityLabSportsEqualityManagement & WorkMarket DataStocksCommoditiesRates & BondsCurrenciesFuturesSectorsEconomic CalendarExploreNewslettersExplainersPointed News QuizAlphadots GameThe Big TakeGraphicsSubmit a TipAbout UsTerms of ServiceDo Not Sell or Share My Personal InformationTrademarksPrivacy PolicyCareersAdvertiseAd ChoicesHelp©2026 Bloomberg L.P. All Rights Reserved.\n\nExplore live shows, documentaries, interviews and more – all in one place.\n\nThis page has been blocked by an extension",
  "_showNotMentionedDiscoveryAttempted": true
}
