{
  "showId": "a-life-in-the-theatre-2010",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Tanner Stransky",
  "url": "http://www.ew.com/ew/article/0,,20364394_20433750,00.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "It's a good thing, then, that in this well-executed revival, Patrick Stewart and T.R. Knight — playing the lead pair of theater actors at opposite ends of their careers — have the chemistry of offbeat pals who like to jabber. Stewart and Knight, both at the top of their game here, embrace the strange spirit of the show and imbue Mamet's 26 madcap vignettes with a feeling of buoyant, urgent comedy that elicits lots of laughs — and only the occasional grimace.",
  "bwwScore": 8,
  "contentTier": "truncated",
  "fullText": "David Mamet's 1977 gem of a play, A Life in the Theatre, turns on nimble repartee and precise casting. The show moves along at a rabbit's pace through scene after scene, all of which are laced with sharp, quick dialogue that ranges in subject matter from the virtues of cold cream to audition woes. It's a good thing, then, that in this well-executed revival, Patrick Stewart and T.R. Knight  playing the lead pair of theater actors at opposite ends of their careers  have the chemistry of offbeat pals who like to jabber. Stewart and Knight, both at the top of their game here, embrace the strange spirit of the show and imbue Mamet's 26 madcap vignettes with a feeling of buoyant, urgent comedy that elicits lots of laughs  and only the occasional grimace. B+\n\n(Tickets: telecharge.com or 800-432-72500)\n\nThe rules: Keep it clean, and stay on the subject or we might delete your comment. \n If you see inappropriate language, \n e-mail us. \n An asterisk * indicates a required field.\n\nSee some of the biggest, most memorable casts in TV and film reunite!",
  "isFullReview": false,
  "textWordCount": 184,
  "archivePath": "data/archives/reviews/a-life-in-the-theatre-2010/ew--tanner-stransky_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:00:48.325Z",
  "originalScore": "D",
  "originalScoreNormalized": 35,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20101017031601",
  "archiveOrgUrl": "http://web.archive.org/web/20101017031601/http://www.ew.com:80/ew/article/0,,20364394_20433750,00.html",
  "textIssues": [
    "Word count too low: 184 (min: 300)"
  ],
  "wordCount": 184,
  "tierReason": "Short text (184 words)"
}