{
  "showId": "a-life-in-the-theatre-2010",
  "outletId": "observer",
  "outlet": "New York Observer",
  "criticName": "Jesse Oxfeld",
  "url": "https://www.observer.com/2010/culture/mo-mamet-mo-problems-david-mamets-early-work-life-theater-more-exercise-play#",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "The sets and costumes, by Santo Loquasto and Laura Bauer, make the visual jokes of the show work brilliantly. We see the actors in the dressing room, in an empty theater and in mid-production, watching from behind as they play to an imagined audience along the upstage wall. The actors work their way through doughboy uniforms for a World War I scene, Elizabethan costume for a discussion of fencing technique, Napoleonic dress for when their climb upon the barricades, and on and on.",
  "bwwScore": 6,
  "contentTier": "complete",
  "fullText": "A lifetime spent in the theater is short, episodic and filled with pontificating blowhards, missed cues and bad parts in terrible plays. It is lonely, it is arbitrary, it is occasionally terrifying—you, alone on that stage, struggling to play a role as props break and cues are missed. These are the suggestions of David Mamet, who would know: When he wrote the two-hander A Life in the Theatre in 1977, he was a former actor a few years into his prolific career as a playwright.\n\nIt's Mr. Mamet at his lightest: As revived at the Gerald Schoenfeld Theatre, where a new production starring Patrick Stewart and T.R. Knight opened yesterday, A Life in the Theater is breezy, jokey and quick. It's also insubstantial and unfulfilling, more an exercise than a play.\n\nA Life in the Theatre examines the relationship between two actors, an older man named Robert and one younger one, John, in a regional repertory theater. In 26 scenes—some running to several minutes, some as quick as a line or two—over 90 minutes, the two men rehearse an increasingly ridiculous variety of plays; they perform in them; and, in between, they talk about life and work.\n\nThe intended point, of course, is torch-passing, that Robert is past his prime, watching with frustration as his abilities decrease, and that John is learning to be a better actor and a more confident member of the troupe. The piece is about their shifting relationship, as all the press descriptions will tell you.\n\nBut onstage, directed by the longtime Mamet collaborator Neil Pepe, the play never makes clear exactly what's going on or what the relationship is. Until I read reviews of previous productions, I wasn't sure whether the two actors were rep players—and I couldn't tell if we were following them through many productions or just one interminable, cliché-ridden spectacular.\n\nMr. Stewart's Robert is blustery and self-impressed, but it's impossible to tell if he was once a good actor who's now losing his edge or a journeyman who's always had delusions of grandeur. (I suspect the latter, and that the commanding Mr. Stewart is actually too good an actor for the part.) Mr. Knight makes John pleasant and amiable, and you nicely see his attitude toward Robert shift from respect to contempt, but it's never obvious that this shift is the result of his own growth or just increasing familiarity. Certainly there's no evidence of the feats of acting that apparently impress critics and depress Robert.\n\nThe sets and costumes, by Santo Loquasto and Laura Bauer, make the visual jokes of the show work brilliantly. We see the actors in the dressing room, in an empty theater and in mid-production, watching from behind as they play to an imagined audience along the upstage wall. The actors work their way through doughboy uniforms for a World War I scene, Elizabethan costume for a discussion of fencing technique, Napoleonic dress for when their climb upon the barricades, and on and on.\n\nAll this well-executed mockery of repertory tropes—the wallpaper of a life in the theater—is fun to watch. But without more holding it all together, it's an empty life.",
  "isFullReview": true,
  "textWordCount": 525,
  "archivePath": "data/archives/reviews/a-life-in-the-theatre-2010/observer--jesse-oxfeld_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:02:53.893Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20110301100055",
  "archiveOrgUrl": "http://web.archive.org/web/20110301100055/http://www.observer.com:80/2010/culture/mo-mamet-mo-problems-david-mamets-early-work-life-theater-more-exercise-play",
  "wordCount": 525,
  "tierReason": "Full review text"
}