{
  "showId": "a-life-in-the-theatre-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2010/legit/reviews/a-life-in-the-theatre-1117944107/",
  "publishDate": "October 13, 2010",
  "fullText": "Nov 23, 2010 2:26pm PT \n\n \n\n \n \n \n\n \n\n \n Don Carlo\n \n \n\n \n\n Nicholas Hytner and Bob Crowley make a spectacular leap to the opera stage.\n\nNicholas Hytner and Bob Crowley, two legit stalwarts, make a spectacular leap to the opera stage with the Met’s new production of “Don Carlo,” first seen at Covent Garden last year. With the genius of Verdi and the resources of two big opera houses at their disposal, director and designer have unleashed something here that will astound those acquainted only with their Broadway work. You’ve heard about total theater? This is it.\n\nLet some opera experts prefer his “Otello” or “Falstaff”; “Don Carlo” is Verdi’s supreme masterwork with its six — count ’em, six — full-blooded characters in the grandest human drama that finds another of the composer’s heroines choosing duty to country over personal happiness. In love with Don Carlo (Robert Alagna), Elisabeth of France (Marina Poplavskaya) chooses instead to marry his father, King Philip II of Spain (Ferruccio Furlanetto), to keep the peace, unleashing the jealous fury of a rival, Eboli (Anna Smirnova), and the wrath of the Grand Inquisitor (Eric Halfvarson), as Carlo’s friend and peacemaker Rodrigo (Simon Keenlyside) gets sacrificed in the process. That’s a lot of story, but there’s even more great music.\n\n1/1\n\nSkip Ad\n \nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nCrowley, who also designed the sumptuous costumes, creates several visually unique stage pictures — from the winter fantasy of Fontainebleau to the gloomy monastery of St. Just to the garish Valladolid Cathedral, scene of the ghastly auto-de-fe — and yet the whole production is of one simple, almost stark stylistic piece. He’s much aided here by Mark Henderson’s lighting, which turns trees, hedges and pillars into ominous monoliths.\n\nSome operagoers prefer the four-act version of “Don Carlo,” which begins after Carlo and Elisabeth have met and fallen in love at Fontainebleau. In this five-acter, Hytner takes that love-at-first-sight story and gives it convincing life. Rodgers & Hammerstein needed their conditional love duet to get the romantic juices flowing, but not Verdi and Hytner. Their two leads are young and in love the second they meet, and the rest is tragedy as Elisabeth is soon forced to choose the king, leaving Carlo alone.\n\nAgain and again in this production, Hytner and Crowley isolate Carlo at a scene’s conclusion, often creating masterful silent segues to the next act as candle-carrying monks or corpse-bearing soldiers direct our attention forward.\n\nWhen the Met first presented “Don Carlo” in 1950, Roman Catholics protested. Hytner, to his credit, reawakens that outrage with an auto-de-fe scene that stuns with a chorus of priests, cardinals and other unholy human animals who gouge out eyes and burn the innocent at the stake. Remember Hytner’s helicopter in “Miss Saigon”? He tops it with this act-three fire storm.\n\nBut “Don Carlo” is nothing without a great tenor to deliver the title role. Fortunately, the Met has Alagna, whose tangy tenor possesses just the right dash of acid to bring expressive power to the doomed prince. Furlanetto has a few miles on his bass, and every foot of that vocal journey only gives authority to his interpretation of the weariest despot on earth. The very full-throated Smirnova presents a raucous and vulgar Eboli. Much more elegant is Keenlyside, but even in this lightest of Verdi baritone roles, he is overtaxed, especially in his act-two confrontation with Philip. Poplavskaya lets go with some great high notes and her voice dominate the ensembles, but she has trouble negotiating the passaggio and by evening’s end she had noticeably tired, cutting short several phrases. If conductor Yannick Nezet-Seguin lacks some of the finesse of James Levine when it comes to this opera, he substitutes with plenty of drive and fire.\n\n“Don Carlo” clocks in at 4 1/2 hours. Thanks to Verdi, Hytner and Crowley, it’s the fastest show in town.\n\nVariety is a part of Penske Media Corporation. © 2026 Variety Media, LLC. All Rights Reserved. Variety and the Flying V logos are trademarks of Variety Media, LLC.",
  "isFullReview": true,
  "dtliExcerpt": "Patrick Stewart and T.R. Knight bring their considerable skills to David Mamet's two-character study, but the production feels more like a master class than a fully realized theatrical experience.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Patrick Stewart and T.R. Knight bring their considerable skills to David Mamet's two-character study, but the production feels more like a master class than a fully realized theatrical experience.",
  "contentTier": "complete",
  "contentTierReason": "Short text (29 words)",
  "textWordCount": 671,
  "archivePath": "data/archives/reviews/a-life-in-the-theatre-2010/variety--marilyn-stasio_2026-02-03.html",
  "textFetchedAt": "2026-02-03T07:49:33.338Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "wordCount": 671,
  "tierReason": "Full review text"
}