{
  "showId": "boop-2025",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani Samuel",
  "url": "https://www.broadwaynews.com/the-broadway-review-boop-the-musical-is-a-big-broadway-joy-bomb/",
  "publishDate": "April 8, 2025",
  "fullText": "Review — BOOP! The Musical The Broadway Review: ‘Boop! The Musical’ is a big Broadway joy bomb The new musical isn’t original, but excites nonetheless with glittering stagecraft and a knockout star. , and Brittani Samuel April 8, 2025 . 1:18 AM 10 min read Share on Twitter Share on Facebook Share on LinkedIn Share via Email Jasmine Amy Rogers (center) and company in “Boop!” on Broadway, 2025 (Credit: Matthew Murphy and Evan Zimmerman) This post is for paying subscribers only Subscribe now Already have an account? Sign in Review — BOOP! The Musical — News — Jerry Mitchell — Bob Martin — David Foster — Susan Birkenhead — Jasmine Amy Rogers — Gregg Barnes — David Rockwell — Finn Ross — Ainsley Melham — Stephen DeRosa — Faith Prince — Angelica Hale — Erich Bergen — Sabana Majeed — Michael Clifton Introductory Offer $1/month for 3 months Subscribe Already have an account? Log in Latest Closer Look What does it take to actually revise a musical? Closer Look How the original company of ‘Ragtime’ was cast Insights Loyalty Report: January 22, 2026 Closer Look How ‘Riverdance’ revolutionized the world of dance Podcast 30 years ago, Tracy Letts wrote a play tailor-made for today with ‘Bug’ Personnel Neil Mazzella steps down as CEO of Hudson entities Books The original music director of ‘Rent’ reveals scenes from the very first auditions Closer Look Christian Cowan uses detail and taste to make ‘The Queen of Versailles’ shine",
  "isFullReview": false,
  "dtliExcerpt": "In “Boop! The Musical,” the canonical cartoon recounts stints as a lion tamer, judge and hula dancer — professions lifted straight from her shorts. But evidently, Betty Boop missed a credit: magician. Because by the end of this new musical, she left us all boop-boop-a-bewitched.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Up",
  "textStatus": "partial",
  "textWordCount": 245,
  "archivePath": "data/archives/reviews/boop-2025/broadway-news--brittani-samuel_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:28:27.959Z",
  "textIssues": [
    "Word count too low: 245 (min: 300)"
  ]
}