{
  "showId": "boop-2025",
  "outletId": "new-york-theatre-guide",
  "outlet": "New York Theatre Guide",
  "criticName": "Allison",
  "url": "https://www.newyorktheatreguide.com/reviews/boop-the-musical-broadway-review",
  "publishDate": "April 7, 2025",
  "fullText": "'BOOP! The Musical' Broadway review — a technicolor spectacleRead our review of BOOP! The Musical on Broadway, a new show about cartoon character Betty Boop directed and choreographed by Tony Award winner Jerry Mitchell.\n\nIn BOOP! The Musical, the globally recognized Betty Boop, with her round eyes and tight pin curls, leaps from Fleischer Studios’ 1930s black-and-white cartoon world to New York City in 2025. The big, dazzling musical showcases the best of Broadway, with sparkling costumes, transformative sets, and tap dancing.\n\nWhen Betty Boop arrives in the Big Apple, there's no mistaking that she’s the iconic cartoon character come to life. In an astonishing performance, Jasmine Amy Rogers fully embodies Betty Boop, capturing everything from the nightclub singer’s distinct accent to her wide-eyed optimism. (This transformation is made possible in part by wig designer and hairstylist Sabana Majeed and makeup artist Michael Clifton.)\n\nCostume designer Gregg Barnes also nails the Boop look, outfitting her in flouncy mini dresses in Betty Boop’s signature red, white, and black. Costumes play a key role in the technicolor transformation of the show, with glittering outfits in every color of the rainbow. In one scene, the ensemble wears costumes that are black and white on one side and brightly colored on the other, and they sing and dance in careful choreography as both the people of the cartoon world and modern-day New York.\n\nThat’s just one of director/choreographer Jerry Mitchell’s show-stopping dance scenes. Other standout moments include a kickline and a performance on the legendary red steps in Times Square. In many ways, the show is a love letter to New York featuring the city as a backdrop.\n\nThe show’s book, written by Bob Martin, is much like the storylines of the Fleischer Studio Betty Boop cartoons: full of romance, slapstick, and science fiction. It is also a bit silly and far-fetched at times, with unengaging subplots, such as Betty’s attempt to overthrow a scheming mayoral candidate. The comedic moments, however, shine through standout performances from Stephen DeRosa (Betty’s grandpa), Erich Bergen (the mayoral candidate), and Aubie Merrylees (a Fleischer Studios producer).\n\nWhile the songs (by composer David Foster and lyricist Susan Birkhead) are toe-tapping, they're often unmemorable. But Angelica Hale as Trisha, a Betty Boop-obsessed teen from New York who becomes Betty’s friend, elicits cheers for every musical number with her powerhouse voice.\n\nBOOP! The Musical proves that bringing Betty Boop to life on stage is a worthy endeavor, even if only for the spectacle of it all.\n\nBetty Boop, the iconic Jazz Age cartoon star, is weary of her life at Fleischer Studios and longs for a vacation from the spotlight. She uses her grandfather’s time-traveling invention and lands 100 years into the future, at New York City's Javits Center during Comic Con. There, Betty quickly discovers she can’t escape her identity — she’s a beloved icon who stood the test of time.\n\nWithout Betty, the cartoon world begins to unravel, and she must choose between returning home or staying to help her new friends and pursue a budding romance in the city.\n\nThe two-dimensional sets designed by David Rockwell immerse the audience in the ink-drawn world of Betty Boop. Another key element to the cartoon setting is Pudgy, Betty’s dog, an energetic marionette operated by Phillip Huber.\n\nBOOP! The Musical is 2 hours and 30 minutes, including one intermission. It’s recommended for audiences ages 8 and up, and I spotted several young Betty Boop fans in the crowd during my performance.\n\nOn the audience review aggregator Show-Score, the musical has a rating of 87% as of publication, with audiences commenting on the performances, dance numbers, and script.\n\nRead more audience reviews of BOOP! The Musical on Show-Score.\n\nBOOP! joyfully celebrates the timeless appeal of Betty Boop while bringing her into the 21st century with high-energy Broadway flair.\n\nLearn more and get BOOP! The Musical tickets on New York Theatre Guide. BOOP! The Musical is at the Broadhurst Theatre.\n\nPhoto credit: BOOP! The Musical on Broadway. (Photos by Matthew Murphy and Evan Zimmerman)\n\nOriginally published on Apr 8, 202501:00",
  "isFullReview": true,
  "dtliExcerpt": "The big, dazzling musical showcases the best of Broadway, with sparkling costumes, transformative sets, and tap dancing.",
  "originalScore": null,
  "assignedScore": 75,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 677,
  "archivePath": "data/archives/reviews/boop-2025/new-york-theatre-guide--allison_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:28:08.426Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_read_more_prompt"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250512154533",
  "archiveOrgUrl": "http://web.archive.org/web/20250512154533/https://www.newyorktheatreguide.com/reviews/boop-the-musical-broadway-review",
  "designation": "Recommended",
  "scoreSource": "extracted-thumbs-up",
  "scoreConfidence": "low"
}