{
  "showId": "boop-2025",
  "outletId": "ny-stage-review",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2025/04/07/boop-betty-brightens-broadway-but/",
  "publishDate": "April 7, 2025",
  "fullText": "No expense has evidently been spared to enable Boop! to take Max Fleischer's iconic Jazz Age flapper – complete with plucky mien, va-va-voom figure and squeaky baby voice – out of the black-and-white silent era into a splashily colorful 2025, the aim to create joy unconfined right up to the follow-the-bouncing-ball singalong finale. Marshaled by director-choreographer Jerry Mitchell, talent is everywhere you look, and decent songs are everywhere you listen.\n\nYet all this effort is in service of one of the most maladroit storylines Broadway has encountered in years, with cardboard characters that serve plot purposes only, a book that doesn't listen to the lyrics and dialogue that doesn't listen to itself.\n\nAs for the principals, reports from the Chicago tryout that a new star was born prove accurate. Jasmine Amy Rogers is the real deal, a triple threat as actor, singer, and dancer with irresistible warmth, plus the laserlike focus of which only the best thesps can boast. It would be all too easy to kid the role with an occasional wink-wink at the audience, but Rogers respects Betty and refuses to condescend.\n\nAnd there's another superstar in the making on the premises: Ainsley Melham as Betty's significant other in the present day. Comparisons with Gene Kelly are not unapt, given the giant smile and seeming readiness to break into dance moves with every step.\n\nThe featured cast isn't as lucky in what they're given, but they give their all. The great Faith Prince is wasted in a contrived role as Grampy's love interest. There's a quick in-and-out villain turn from Erich Bergen, but he by-golly commands the stage while he's got it.\n\nRogers and Melham sashay their way through David Rockwell's gleaming vision of Manhattan like Fred and Cyd in The Band Wagon, complemented by amusing trips back to the monochromatic 1920s. Costume designer Gregg Barnes is period-specific in both eras.\n\nThe proceedings, all in all, are rather schizoid. Those seeking a smart night out, with sharply-delineated themes, are likely to react with a weary \"Boop-Boop-a-Droop.\" There's always the danger of showstopper fatigue setting in, as if you've eaten eight or nine hot fudge sundaes in a row. But as a respite from present-day realities and woes, Boop! could just be the tonic the doctor ordered.",
  "isFullReview": true,
  "bwwExcerpt": "The proceedings, all in all, are rather schizoid. Those seeking a smart night out, with sharply-delineated themes, are likely to react with a weary ‘Boop-Boop-a-Droop.’ There’s always the danger of showstopper fatigue setting in, as if you’ve eaten eight or nine hot fudge sundaes in a row. But as a respite from present-day realities and woes, and you know the ones I mean, Boop! could just be the tonic the doctor ordered.",
  "originalScore": "3/5",
  "assignedScore": 60,
  "source": "playwright-scraped",
  "scrapedAt": "2026-01-24T05:20:00.000Z",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-BOOP-THE-MUSICAL-Opens-on-Broadway-20250407",
  "textStatus": "missing"
}
