{
  "showId": "boop-2025",
  "outletId": "time-out-new-york",
  "outlet": "Time Out New York",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/boop-the-musical-broadway-review-betty-boop-jasmine-amy-rogers",
  "publishDate": null,
  "fullText": "Broadway review by Adam Feldman Try to imagine this: a family-friendly Broadway musical based on a beloved cartoon character from the Great Depression. Maybe she has distinctive hair and a signature red dress. Maybe she’s looking to find out who she is, so she runs away and gets dazzled by the bright lights and bustle of NYC. Her best friends could be, I don’t know, a dog and an orphan girl. And this may sound crazy, but: What if her sunniness and can-do optimism had the power to inspire progressive political change? It’d never work. Just kidding, just kidding! It worked like the dickens in the 1977 moppet musical Annie, and it works again—minus Annie’s more Dickensian elements—in Boop! The Musical. Directed and choreographed by Jerry Mitchell, this is an old-fashioned candy shop of a show, where tasty confections are sold in bulk. When Boop! is corny, it’s candy corn. Gorge on the multicolor gumdrops of its high-energy production numbers; chew the jelly beans of its gentle social-mindedness; let the caramel creams of its love story melt slightly oversweetly in your mouth. And above all, savor this show’s red-hot cinnamon heart: Jasmine Amy Rogers, making a sensational Broadway debut as the 1930s animated-short icon Betty Boop. Boop! The Musical | Photograph: Courtesy Evan Zimmerman In our world, Betty is the quintessential cartoon jazz baby, a Fleischer Studios flapper inspired by singer Helen Kane (famous for her \"boop-oop-a-doop\" tag in songs like “I Wanna Be Loved by You”) and most definitively voiced by Mae Questel. Her look is instantly recognizable: giant head, spit-curled hair, wide round eyes and bee-stung lips that hover atop an absented chin, all balanced on a miniskirted body drawn for sin. In her own world, as imagined in Boop!, Betty is the movie-star center of a black-and-white toon dimension that is frozen in time and revolves around her. But although she can play any role, from cowgirl to aviatrix, she suffers from what one sad dame in Follies calls “the curse of versatility”; when a reporter asks her, “Who are you really?” she doesn’t have an answer. What she does have is a heavily tricked-out easy chair invented by her zany Grampy (a splendidly, well, animated Stephen DeRosa): a “trans-dimensional tempus locus actuating electro-ambulator” that transports her to the real world of modern-day, three-dimensional New York City. Until this point, the entire production has conspired to exist in black and white, thanks to the delightful creativity and coordination of set designer David Rockwell, costumer Gregg Barnes and lighting designer Philip S. Rosenberg. Now it bursts into color of every kind, and the background players start being costumed—and I mean this in a good way—like a pack of Crayola markers dipped in a box of glitter. (You can tell which actors are principals because they’re the ones whose outfits don’t sparkle.) Boop! The Musical | Photograph: Courtesy Evan Zimmerman As luck would have it, Betty lands at Comic Con, where she fits right in and meets the most nonthreatening love interest imaginable, Dwayne (Ainsley Melham), a retro-jazz musician and manny who is there with his teenage charge, Trisha (Angelica Hale). Trisha is a huge fan of Betty's already, and Dwayne soon falls for her, too; she likes him back because she is new to color and impressed by his blue eyes. (I won’t tell Toni Morrison if you don’t.) Dwayne works for Trisha’s aunt Carol (Anastacia McCleskey), who in turn works for a sleazy mayoral candidate (Erich Bergen, in a slickly funny Will Arnett mode), and Betty gets mixed up in it all. What happens next is the plot, and it doesn’t matter much. Bob Martin’s script treats the source material with affection and a touch of knowing distance. (He co-wrote The Drowsy Chaperone, so he knows his way around this tone.) The “real” world in this show is not much less cartoonish than the Fleischer one that Betty leaves behind along with her fastidious director (Aubie Merrylees) and her darling doggie, Pudgy (a fluffy marionette worked by Phillip Huber). The whole thing is an occasion for throwback toe-tappers and ballads—with music by pop hitmaker David Foster and lyrics by Susan Birkenhead, who spread the words in Jelly’s Last Jam—and, especially, for massive dance numbers. Boop! The Musical | Photograph: Courtesy Matthew Murphy and Evan Zimmerman Mitchell was a featured dancer in Tommy Tune’s glitzy Broadway production of The Will Rogers Follies, and he carries that Tune spirit to the unabashedly showbizzy chorus numbers of Boop! And that’s hardly where this production’s influences end. It’s Annie all over, of course, but it also has elements of Barbie and Back to the Future and Who Framed Roger Rabbit and, from Broadway, City of Angels and Hairspray and other musicals. When the always-welcome Faith Prince, as Grampy’s old girlfriend, sings about about how love makes her sick, it's a cute callback to “Adelaide’s Lament,” her sniffly song in the 1992 revival of Guys and Dolls. But if Boop!, like Mitchell’s 2013’s Kinky Boots, feels like a synthesis of many other shows, it also, like Kinky Boots, accomplishes that synthesis well. This musical will not change your brain in any way, but it delivers what it promises: a big Broadway production that leaves you grinning, and a star performer with the poise, charm and chops to make you believe that what the world needs now might be, of all things, a little more Betty Boop. That may or may not be real, but what fun it is to escape for a while into the alternate dimension of The Jasmine Amy Rogers Follies. Boop! The Musical. Broadhurst Theatre (Broadway). Music by David Foster. Lyrics by Susan Birkenhead. Book by Bob Martin. Directed by Jerry Mitchell. With Jasmine Amy Rogers, Ainsley Melham, Stephen DeRosa, Faith Prince, Erich Bergen, Angelica Hale, Anastacia McCleskey, Aubie Merrylees, Ricky Schroeder, Phillip Huber. Running time: 2hrs 30mins. One intermission. Follow Adam Feldman on X: @FeldmanAdamFollow Adam Feldman on Bluesky: @FeldmanAdamFollow Adam Feldman on Threads: @adfeldmanFollow Time Out Theater on X: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page Boop! The Musical | Photograph: Courtesy Matthew Murphy and Evan Zimmerman Been there, done that? Think again, my friend. By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. Thanks for subscribing! Look out for your first newsletter in your inbox soon! All kids under 18 can watch a Broadway show for free this February 15 beautiful pictures of NYC under snow By 2030, NYC landlords may be required to provide air conditioners in all units These enormous inflatable dogs will cruise down Manhattan streets this February The best things to do in NYC this weekend Discover Time Out original video",
  "isFullReview": true,
  "bwwExcerpt": "This musical will not change your brain in any way, but it delivers what it promises: a big Broadway production that leaves you grinning, and a star performer with the poise, charm and chops to make you believe that what the world needs now might be, of all things, a little more Betty Boop.",
  "bwwRoundupUrl": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "dtliThumb": null,
  "needsScoring": true,
  "showScoreExcerpt": "âThis musical will not change your brain in any way, but it delivers what it promises: a big Broadway production that leaves you grinning, and a star performer with the poise\"",
  "showScoreUrl": "https://www.show-score.com/broadway-shows/boop-the-musical-broadway",
  "textWordCount": 1138,
  "archivePath": "data/archives/reviews/boop-2025/time-out-new-york--adam-feldman_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:30:30.930Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}