{
  "showId": "the-iceman-cometh-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2018/04/26/the-iceman-cometh-denzel-washington-swims-above-oneills-lower-depths/",
  "publishDate": "2018-04-26T19:29:56",
  "fullText": "A formidable masterpiece for actors to perform and audiences to enjoy, The Iceman Cometh, much like Long Day’s Journey Into Night, was dredged out of Eugene O’Neill’s youthful troubles.\n\nUndone by depression and drinking in his early 20s, O’Neill lodged for some months during 1911-12 with other miserable down-and-outers at Jimmy-the-Priest’s, a decayed saloon and rooming house on the Hudson River waterfront. Drunken and despairing as he was—once even attempting suicide—O’Neill still was able to observe his fellow losers sufficiently well to incarnate some of them colorfully as various characters in The Iceman Cometh, which he wrote nearly 30 years later.\n\nMore stylized than dramatically stirring in director George C. Wolfe’s arty staging, the latest Broadway production of this great and gloomy work is noteworthy for the mottled gallery of misfits and riff-raff created by actors in supporting roles rather than its leading performance by Denzel Washington.\n\nFirst-time viewers of the play, drawn by Washington’s star power, will find themselves in the ratty back room of a New York City gin mill, circa 1912, where a dozen or so derelicts blearily wake up to another aimless day of boozing, gassing about brighter yesterdays, and idly thinking they might do something with their lives tomorrow. They also are expecting some fun times from an imminent visit by Hickey (Washington), a back-slapping traveling salesman who’ll treat them all to plenty of drinks and laughs.\n\nWhen Hickey eventually arrives (some 40 or so minutes into the proceedings), he’s nearly as jaunty and generous as ever, but this time he’s on a mission. Somehow Hickey wants all of his old pals to face up to their future. Whether it’s to get that job or marry that dame or quit drinking or merely to take a long-postponed stroll around the neighborhood, Hickey is prodding them to realize their dreams tomorrow.\n\nThe aftermath sees everyone’s self-deceptive illusions shattered, while Hickey—well, the sorrowful story that Hickey finally spills out about his own recognition of personal truth is the most tragic of all.\n\nClocking in at nearly four overlong hours, The Iceman Cometh remains a complex, remarkably vivid play where low-life souls express their bitterest blues and wishful dreams in the racy lingo of a century ago. It is a challenging work to produce effectively. The rendition of the drama currently at the Bernard B. Jacobs Theatre does not achieve the requisite life and death significance of O’Neill’s somber vision. (Not incidentally, during the intermissions, some people unfamiliar with the play were complaining they had trouble understanding the actors.)\n\nWashington initially commands the stage naturally as Hickey genially joshes along his drinking buddies with broad smiles and light-footed gambols. But as the story darkens and Hickey explains his motives, the actor’s interpretation of the character becomes indistinct and deflates in force. Later in the play, during Hickey’s extended speeches, Washington resorts to sitting and addressing his words head-on to the audience rather than interacting with the others onstage. It appears that Washington has yet to plumb Hickey’s lowest emotional depths. Perhaps this monumental role does not really suit the actor’s capabilities.\n\nOne wonders what Wolfe contributed to Washington’s performance, since the director does not offer a harmonious concept for the production. Designer Santo Loquasto provides a non-realistic setting for the seedy saloon-tenement that suggests a Victorian warehouse with vast, blank, peeling walls and an ironwork upper gallery looming high above a floor littered with random chairs and tables. These surreal environs are lit in obviously-cued shades and intensities by Jules Fisher and Peggy Eisenhauer. In odd contrast to such surroundings, the actors are dressed in suitably tatty 1900s clothes by Ann Roth and their depictions of the characters are similarly natural.\n\nPerhaps to compensate for Washington’s gradual fade as Hickey, David Morse delivers an unusually vital and pugnacious interpretation of a former anarchist who yearns for death. A blubbering Austin Butler looks wretched as his stoolpigeon admirer. Neal Huff flamboyantly depicts an Ivy Leaguer gone sadly to seed. A geeky guy clutching a bowler hat, Bill Irwin demonstrates light-fingered skills as a circus shill. The disgruntled Danny Mastrogiorgio and Tammy Blanchard drolly bicker as molting lovebirds. Frank Wood’s befuddled British officer, Colm Meaney’s blustering saloon owner, and Reg Rogers’ florid wreck of a bigtime reporter are nicely-cut cameos. Nina Grollman and Carolyn Braver lend tinny-voiced vitality to the premises as giggling, good-natured sluts.\n\nIn a standout performance as a one-time high roller of a gambling man reduced to mopping the floors, Michael Potts evidences such pride of character and expresses the man’s frustrations so fiercely that he won deserved applause as he left the stage in a rage.\n\nWhile the larger vision and the major performance lack distinction, the pleasures of this revival of The Iceman Cometh are derived from seeing the members of the ensemble bring to life the people with whom O’Neill once shared his drinks and despair.\n\nThe Iceman Cometh opened April 26, 2018, at The Bernard B. Jacobs Theatre and runs through July 1. Tickets and information: icemanonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial"
}
