{
  "showId": "the-iceman-cometh-2018",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Unknown",
  "url": "https://www.nytimes.com/2018/04/26/theater/review-iceman-cometh-denzel-washington.html",
  "publishDate": null,
  "fullText": "https://www.nytimes.com/2018/04/26/theater/review-iceman-cometh-denzel-washington.htmlShare full article65Advertisement\n\nIf you have a good time at a production of “The Iceman Cometh,” does that mean the show hasn’t done its job? I was beaming like a tickled 2-year-old during much of George C. Wolfe’s revival of Eugene O’Neill’s behemoth barroom tragedy, which opened on Thursday night at the Bernard B. Jacobs Theater, with Denzel Washington more than earning his salary as its commanding star.\n\nA sustained grin may not seem an apt response to a play in which desperate, drunken denial is the given existential condition, and suicide and murder are presented as perfectly reasonable life choices for anyone who sees the world clearly. Besides, to smile through nearly four hours of doomed, rotgut-soaked souls mouthing the same hopeless blather over and over again would appear to be courting lockjaw, if not temporary insanity.\n\nSurely, the more appropriate and customary behavior for an “Iceman” audience member would echo that of the play’s cynic-in-chief, a disenchanted socialist (played here with ashen anger by David Morse), who says, “I took a seat in the grandstand of philosophical detachment to fall asleep observing the cannibals do their death dance.”\n\nBut who’s going to feel like nodding off, or slump into terminal angst, when Mr. Wolfe has filled the stage with such delectably seasoned hams, who lap up limelight the way their characters throw back booze? In addition to Mr. Washington and Mr. Morse, this “Iceman” boasts a fine rogue’s gallery of performers who gladden the heart whenever they show up on a New York stage, including Colm Meaney, Bill Irwin, Danny McCarthy, Tammy Blanchard, Neal Huff, Reg Rogers, Michael Potts and Frank Wood.\n\nThe denizens of Harry Hope’s last-chance bar in the downtown Manhattan of 1912 (that’s the wonderful Mr. Meaney as the crankily sentimental Harry) are such a scrappy, funny, madly posturing crew that you may not even share their impatience for the Big Guy to show up. That’s Theodore Hickman, known to his pals as Hickey, who is portrayed by Mr. Washington, this production’s Oscar- and Tony-winning star, and its commercial raison d’être.\n\nHickey, a traveling salesman and perennial life of the party, doesn’t make his entrance until nearly an hour into show. The other characters, who had so eagerly awaited his arrival, wind up hostile to and disappointed with their usually inebriated pal, who has dared to go on the wagon and be really, really serious. Rest assured that you will not feel similarly let down by Mr. Washington’s center-of-gravity performance, or at least not by the play’s conclusion.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Who’s going to feel like nodding off, or slump into terminal angst, when Mr. Wolfe has filled the stage with such delectably seasoned hams...Watching this latest incarnation, I laughed more often than I teared up. But this 'Iceman' acquires its own poignant lyricism...With its heightened performances and tone-poem visuals, this production also clearly elicits the musical nature of 'Iceman.'\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 447,
  "archivePath": "data/archives/reviews/the-iceman-cometh-2018/nytimes--unknown_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:35:03.183Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250818102947",
  "archiveOrgUrl": "http://web.archive.org/web/20250818102947/https://www.nytimes.com/2018/04/26/theater/review-iceman-cometh-denzel-washington.html",
  "wordCount": 447,
  "tierReason": "Full review text"
}