{
  "showId": "the-iceman-cometh-2018",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2018/legit/reviews/the-iceman-cometh-review-denzel-washington-1202747012/",
  "publishDate": "April 26, 2018",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Washington brings a volcanic intensity to the role that makes Hickey's descent into madness both terrifying and heartbreaking.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Helmer George C. Wolfe has trimmed the play to a reasonable length (it now runs just under 4 hours) without losing the nuances in the various life histories of the boys in the barroom. But this is still a long play with a lot of moving parts. The first act, in which all the characters are introduced and roughly defined, is the most attenuated. Everyone lightens up - a bit too much, actually - in the second act, which shoots for comedy. But everything comes together in the third act, which spells Drama with a capital D. The third act is where Hickey divests himself of his own pipedream, ending the play with a gasp-inducing revelation. In a daring, but quite devastating piece of stage business, Washington turns his chair around and delivers Hickey's long monologue directly facing the audience. You want to talk theater? Take that, people!",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Washington brings a volcanic intensity to the role that makes Hickey's descent into madness both terrifying and heartbreaking.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (18 words)",
  "textQuality": "partial",
  "textWordCount": 572,
  "archivePath": "data/archives/reviews/the-iceman-cometh-2018/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:42:25.265Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Apr 8, 2018 11:36am PT \n\n \n\n \n \n \n\n \n\n \n PopPolitics: John Curran Defends ‘Inarguable’ Facts in ‘Chappaquiddick’ (Listen)\n\nWASHINGTON — John Curran’s “Chappaquiddick,” which opens in theaters this weekend, is a dramatization of what happened late one night in 1969 when Sen. Edward Kennedy (D-Mass.) drove his car off a narrow bridge on Martha’s Vineyard, killing the passenger he was riding with, Mary Jo Kopechne.\n\nKennedy survived, but waited nine hours to report it to authorities, while the story of Kopechne, who had been a campaign worker on Robert Kennedy’s presidential campaign, were often in the backdrop in the scandal that lingered for decades later.\n\nCurran says that his movie is a “very nuanced and very compelling and very balanced” look at what happened, with key details based largely on the inquest that followed.\n\nHe defends the movie against criticism from some of Kennedy’s friends and from literary agent Esther Newberg, who complained to People that when she read the screenplay, she saw “one thing made up after another.” Newberg was among the group of RFK campaign workers, known as the “boiler room girls,” who had gathered for a house party reunion earlier that evening along with Kopechne and Kennedy.\n\n“Really, Ted and Mary Jo are the only people who really know what happened on the bridge that night,” Curran tells Variety‘s “PopPolitics” on SiriusXM. “The people like Esther, they have stuck to the inquest testimony, and we drew all of our information from the inquest, from their words.\n\nHe said that there are liberties with the dialog, like in any historical movie, but “in terms of the facts of the case and the decisions that were made by the boiler room girls, the brain trust around Ted, they are inarguable.”\n\nKennedy is played by Jason Clarke and Kopechne by Kate Mara, and the movie was shot in part at the actual location, Curran says.\n\nHe said that they “probably stretched the truth the most” regarding the relationship between Kennedy and his father, Joseph Kennedy Sr. (Bruce Dern), who was then incapacitated by a stroke. In the movie, Kennedy Sr. communicates his displeasure with the way that his son has handled the tragedy and urges him to pursue an “alibi.”\n\n“He probably could say one word, and I believe it was ‘No,'” Curran says. But the movie reflects the expectations that the Kennedy patriarch placed on his sons even later in his life, Curran says. Kennedy Sr. died in 1969.\n\n“I am a fan of Ted’s,” Curran says. “My generation, in terms of political titans, I believe he was on the right side of history, and I agree with a lot of the legislation he championed. But I realized I had a blind spot about this episode of his life.”\n\nHe said that it was a good time to tell the story because “history repeats itself. We are reaching that divisive point where people will support their party’s representatives, and be completely blind to the deficiencies of those people.”\n\nHe adds, “I think it is very relevant. I think it is another example of the corruption of power, and using it to sort of band-aid over character flaws of a presidential candidate.”\n\n“PopPolitics,” hosted by Variety’s Ted Johnson, airs from 2-3 p.m. ET/11 a.m.- noon PT on SiriusXM’s political channel POTUS. It also is available on demand.\n\nListen nowListen to this article now3 min listenPowered byTrinity Audio00:0003:20\n\nEnglishDeutschFrançaisEspañol中文Italiano\n\n \n \n \n \n\n10101.0x0.50.60.70.80.91.01.11.21.31.41.51.61.71.81.92.0\n\n \n \n \n \n\n1.0x\n\n Oops, we couldn’t find that track.",
  "playbillVerdictUrl": "http://variety.com/2018/legit/reviews/the-iceman-cometh-review-denzel-washington-broadway-1202787371/",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews"
  ],
  "bwwScore": 8
}
