{
  "showId": "for-colored-girls-who-have-considered-suicide-when-the-rainbow-is-enuf-2022",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/For-Colored-Girls/1072",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/For-Colored-Girls/1072",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $69\n Buy Tickets\n\nCititour.com Review\n As a white man, I am in no position to know how black women felt about their particular joys or struggles in 1976, when Ntozake Shange’s groundbreaking work “for colored girls who have considered suicide/when the rainbow is enuf” first premiered at the Public Theater, nor can I speak any more accurately to how black women feel today. For this, and many other reasons, I wholeheartedly welcome this superb, long-overdue revival of Shange’s singular “choreopoem” now at Broadway’s Booth Theater (the same venue where it played after the Public for over a year). \n\nOf course, I do know times have changed over the past 46 years; Today, for example, we have an African American female Vice President and an African American Supreme Court justice (both unthinkable in 1976). Still, Shange’s text, broken into over two dozen segments, feels utterly authentic both for its time as well as of-the-moment. \n\nMoreover, these lessons of human existence imparted by Shange are being brought to full-bodied life (pun intended) by seven ultra-talented performers under the sure-handed direction of the extraordinarily talented Camille A. Brown, who supplies the show’s stunning movement and choreography (much of it set to Martha Rebdone and Aaron Whitby’s original score).\n\nAs is befitting the universality of these stories, the text ensures there are no set characters on stage, just seven women distinguished by the color of their costumes (well-rendered by Sarafina Bush). While these ladies are a superb ensemble, each of these women also get to truly stand out during some individual segments of the show.\n\nAs “Lady in Blue,” Stacy Sargeant is both defiant and heartbreaking as she describes getting an abortion, primarily because of her own shame in getting pregnant, or sharing her despair about having moved to Harlem. Meanwhile, Tendayi Kumbi, as “Lady in Brown” is marvelously present throughout, especially in a segment in which she tells the story of a young girl who plans to run away to Haiti after reading a book about the revolutionary Toussaint L’Overture, but who ends up staying in 1955 St. Louis when she meets a different Toussaint.\n\nThe deaf actress Alexandria Wailes, as the “Lady in Purple,” proves to be mesmerizing without uttering a sound, especially in the section entitled “sechita” (with the narration provided by Armara Granderson as the “Lady in Orange.”)\n\nOkwui Okpokwasili, as “The Lady in Green,” consistently commands our attention purely by her physical presence. More importantly, her almost-matter-of-fact recitation of the all-too-timely “latent rapists” -- alongside the excellent “Lady in Yellow” D. Woods – is utterly shattering, while her rightfully indignant version of “somebody almost walked off wid alla my stuf” not only cuts straight to the heart and soul but will likely remain there.\n\nFinally, Broadway veteran Kenita Miller, as the “Lady in Red,” proves once again how to keep an audience completely engrossed when given the solo spotlight. Whether she’s sharing one of Shange’s fierce anti-love “love poems” or when she relates “a nite with beau willie brown,” a terrifying story of a woman who tries to escape the grip of the troubled man who has fathered her two children – a story one fervently wishes will end differently than it ultimately does – Miller is the ultimate physical embodiment of a woman’s inner strength and outer pain.\n\nSo, one thing I do know is that, even in such a busy theatrical season, these outstanding performances and these remarkable words should not be overlooked.\n By Brian Scott Lipton\n\nVisit the Sitehttps://forcoloredgirlsbway.com/CastAmara Granderson, Tendayi Kuumba, Kenita R. Miller, Okwui Okpokwasili, Stacey Sargeant, Alexandria Wailes, D. WoodsOpen/Close DatesOpening 4/20/2022Closing 5/22/2022\nTheatre Info\nBooth Theatre222 West 45th StreetNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 663,
  "archivePath": "data/archives/reviews/for-colored-girls-who-have-considered-suicide-when-the-rainbow-is-enuf-2022/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:43:53.523Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 663,
  "tierReason": "Full review text"
}