{
  "showId": "for-colored-girls-who-have-considered-suicide-when-the-rainbow-is-enuf-2022",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Unknown",
  "url": "https://www.newyorktheatreguide.com/reviews/for-colored-girls-broadway-review",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/for-colored-girls-broadway-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Ntozake Shange's powerful paean to Black women, for colored girls who have considered suicide/when the rainbow is enuf, returns to Broadway in a bold revival that burns intensely, though with little nuance. As directed and choreographed by the much-lauded dancemaker Camille A. Brown, this production places an exclamation point at the end of its title, as if to claim that it will punch through every moment of grief until all that is left is celebratory victory. While that approach serves as a pleasant corrective to Lea C. Gardner's gloom-laden interpretation of the work ― which played at The Public Theater in 2019, with Brown as choreographer ― it does not create much of a throughline between the numerous arias assigned to for colored girls's characters. Nor does it deepen the meaning of the text. Instead, audiences are presented beautiful pictures and intense moments that smolder in isolation. In composing for colored girls, Shange borrowed from African griot traditions to craft a new form of epic storytelling: the choreopoem, a fusion of poetry, dance, music, and song that transcends plot. The choreopoem instead focuses on establishing emotional rapport with audiences through the lyricism of Black language and customs as Shange experienced them. In for colored girls, Black women are represented by different colors, such as Lady in Blue (Stacey Sargeant, delightful) or Lady in Brown (Tendayi Kuumba, a lioness), and given rhapsodic poems that plumb every hue. Rather than rely on words alone, Shange mandated that the unconquerable spirit of Black womanhood take flight through movement and music in addition to text. Brown, who has created her own resounding choreopoems ― most notably BLACK GIRL: Linguistic Play and Mr. TOL E. RAncE ― has not yet woven those elements into a cohesive whole. Rather, she delineates as if she were directing a traditional Broadway musical, or even a revue. When the women dance, it often feels as if they are staking their claim to the entire universe. While that image is satisfying, it does not engage with what the text tells us: besides strong, Black women are also soft, vulnerable, confusing, inquisitive, and impossible to nail down. In presenting her cast as consummate warriors, Brown limits the range of what they can convey. This is most clear with Lady in Yellow (D. Woods), who dives wholeheartedly into the exuberance of a young Black woman exploring her sexual agency. Yellow is often seen as the color of friendship, but it also deepens into royal gold. True to initial form, Woods strikes all the highlights of fun inquisitiveness and excitement that we associate with a young women enraptured by her own sexual power, but she stops short of commanding newer territory. Instead, she presents a collection of poses that lose meaning with every repetition. Similarly, and through no fault of her own, Lady in Purple's (Alexandria Wailes) voice is also left unfulfilled. Indeed, her right to tell her own story is stolen by the decision to have Lady in Orange (Amara Granderson) speak for her. Wailes, who is deaf, signs beautifully, and with greater distinction than Granderson is able to convey. But even if Granderson had a better handle of her text, Brown is more than capable of transliterating Shange's aria for Wailes into brilliant movement language. Depriving Wailes of the opportunity to speak solely for herself is disappointing. However, for colored girls frequently soars, particularly when its performers meet the moments that Brown is trying to convey. Lady in Green, Okwui Okpokwasili (in a brilliant Broadway debut) shows us what might have been as she calmly swaggers through the fantastic \"Somebody Almost Run Off With Alla My Stuff.\" Here she shows us that green is not only the color of envy, but also earthy dominion as she takes the full measure of someone who tries to own her without really understanding the immensity of her being: \"If it's really my stuff you got, you got to give it to me. If you want it, I am the only one that can handle it.\" As Green, Okpokwasili gathers the entire production together. There is much to say about Brown's bold directorial choices ― including the decision to cast a heavily pregnant Kenita R. Miller as Lady in Red without tying that pregnancy to Red's poem about a women whose children are murdered by their father ― and the failure of the cast to render them effectively. That is the tragedy of this production: Brown has arranged many glorious moments, but their potential remains unfulfilled. I wish that I was reviewing a for colored girls with different costumes from Sarafina Bush's guerilla-warfare garb, more sensitive lighting than Jiyoun Chang's punchy pulses, and fewer of Aaron Rhyne's Reading Rainbow-evoking projections. And I wish I was reviewing it four weeks from now, when the cast has had time to marinate in the material. Because even when I don't agree with Brown's choices, I respect what Okpokwasili has revealed they could be. for colored girls who have considered suicide/when the rainbow is enuf is at the Booth Theatre through August 14. Get for colored girls who have considered suicide/when the rainbow is enuf tickets on New York Theatre Guide. Photo credit: Stacey Sargeant (Lady in Blue), Alexandria Wailes (Lady in Purple), Kenita R. Miller (Lady in Red), Tendayi Kuumba (Lady in Brown), D. Woods (Lady in Yellow), Okwui Okpokwasili (Lady in Green), and Amara Granderson (Lady in Orange) in for colored girls who have considered suicide/when the rainbow is enuf. (Photo by Marc J. Franklin) Originally published on Sep 29, 202209:12",
  "isFullReview": true,
  "textWordCount": 924,
  "archivePath": "data/archives/reviews/for-colored-girls-who-have-considered-suicide-when-the-rainbow-is-enuf-2022/nytg--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:04:44.119Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 924,
  "tierReason": "Full review text"
}