{
  "showId": "for-colored-girls-who-have-considered-suicide-when-the-rainbow-is-enuf-2022",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/for-colored-girls-returns-home-to-broadway-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/for-colored-girls-returns-home-to-broadway-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "This first Broadway revival, at the same Booth Theatre in which it premiered half a century ago, is nominally a transfer from the Public Theatre's excellent 2019 production. In losing Leah C. Gardiner as its director and having choreographer Camille A. Brown step up for double duty, however, it also loses the simple conversational spark that made their collaboration such an electrifying, sanctified experience.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-FOR-COLORED-GIRLS-Opens-On-Broadway-20220420",
  "fullText": "Tendayi Kuumba and the company | Photo: Marc J. Franklin\n\nThe emotional apex of one of For Colored Girls’ many monologues elicited a loud, involuntary reaction from an audience member seated not too far behind me. Proposing that she and her partner “go on ahead & be white,” the excellent Tendayi Kuumba had just mused that “maybe tonite i’ll find a way to make myself come without you.”\n\nIt was so real, so in the moment, that the entire Booth Theatre couldn’t help but laugh. Kuumba didn’t break character (Ntozake Shange’s landmark choreopoem doesn’t call for much fiction) but paused to smile, pointing affirmatively in the audience member’s direction. The other ladies onstage beamed at each other, acknowledging the catharsis that had rippled through the space. It was a moment that — hand me my tissues — illustrated the magic that live performance can create; a performer and an audience exalting moments of recognition for ourselves, those around us, and everything in-between.\n\nShange’s 1976 piece — full title: For Colored Girls Who Have Considered Suicide / When the Rainbow Is Enuf — provides an earthy blueprint for many such moments. Assembled from poems and monologues she’d been performing in bars across the country, it relays the weight of Black womanhood in America through the powerful stories and proclamations of seven women, named only after the colors they wear.\n\nThis first Broadway revival, at the same Booth Theatre in which it premiered half a century ago, is nominally a transfer from the Public Theatre’s excellent 2019 production. In losing Leah C. Gardiner as its director and having choreographer Camille A. Brown step up for double duty, however, it also loses the simple conversational spark that made their collaboration such an electrifying, sanctified experience.\n\nThat iteration felt like a prayer circle, its strong ensemble onstage throughout the entire play, actively listening to each other and offering (sometimes physical) support to each other. Shange’s words work as a free-flowing conversation, a roundtable sharing of wounds and cures that mirror the laying-on of hands through which the ladies console each other at the work’s climax, when the titular consideration becomes unbearably strong. The women’s physical performances are meant to be extensions of their psyches, emerging from that same deepness as the awestruck audience member at the performance I attended.\n\nBrown is more interested in using choreography as the shared language for a segment of our population who defies all odds through continuous movement; no matter how tough life gets, there is always a shoulder to roll, a palm to reach towards the sky. But by highlighting the work’s potential for dance, the director-choreographer seems to become weary of Shange’s words, not allowing them the space to breathe and, in turn, take our breath away with the starkness of their intimacy. Over-choreographed to a fault, the ladies onstage are left fighting to make an impact.\n\nNevermind that they must also fight the ’90s PBS-sounding music (by duo Redbone and Whitby) that insists on taking centerstage, especially throughout the one-act production’s first half. A generic blend of jazz, salsa, and beat-poetry drumming you might find in a spa waiting room is cranked past noise limits by music director Deah Love Harriott and sound designer Justin Ellington, never drowning out the actors’ voices but not granting them the clarity their words require.\n\nAnd what words to drown! Shange’s gorgeous poetry, epitomized by the Lady in Yellow’s maxim that “bein alive & bein a woman & bein colored is a metaphysical dilemma i havent conquered yet,” is as bittersweetly transformative as the best out-of-body experiences. Weaving together strands of abuse, resilience, heartbreak, race, and motherhood into a rainbow of shared Black womanhood, it shines out onto anyone fortunate enough to catch it. Some are idiosyncratic enough that they must be performed alone, like the Lady in Green’s “somebody almost walked off wid alla my stuff,” in which a spellbinding Okwui Okpokwasili demands closure from a runaway lover. Others are calls and responses that grow from each one’s input, as with “my love is too,” a powerful ode to one’s capacity for humanity performed by the entire, excellent cast—rounded out, by the way, by Amara Granderson (Orange), Kenita R. Miller (Red), Stacey Sergeant (Blue), Alexandria Wailes (Purple), and D. Woods (Yellow).\n\nSuch overstimulation on the production side all but prohibits the visceral engagement — among the ensemble as much as between performer and spectator — Shange’s choreopoem drew from that one audience member who was moved towards a physical response. No longer a quiet space for healing where the beauty lies, as I wrote in my review of the 2019 production, “in the radical act of sharing one’s story and hearing themselves in others’,” Brown’s production wants to substitute motion for emotion; the ladies running on and offstage to deliver their lines. With little cohesion to shake the presentational nature of the work, the choreopoem seems to come from nowhere, though delivered from everywhere.\n\nMyung Hee Cho has replaced her mirror ball set from the Public with a bare, characterless above which Aaron Rhyne’s paintbrush-y projections are displayed on hanging screens. The Tumblr galaxy-print nature of these images are in line with Sarafina Bush’s costumes: cute, but not enough to not seem like they were found at a Bushwick thrift shop. These unthinking production aspects were foretold by the revival’s poster, a disgraceful affront to Shange’s masterwork seemingly designed on an iPad. While trying not to judge a book by its cover, a friend suggested the production might be taking cues from the rise of Instagram infographics, which rush to present salient information without much care for nuance.\n\nThe same could ultimately be said of this production of For Colored Girls. The work is good because the text is good—because Ntozake Shange’s choreopoem is one of the best and most important works of 20th century American art. In rushing to bring it to the new millennium, though, this revival forgets to stop and listen to its own words. It’s not an ideal production, but if you can focus on the words themselves rather than the other stimuli thrown your way, it remains essential, vivid, and affirming.\n\nFor Colored Girls Who Have Considered Suicide/ When the Rainbow Is Enuf is in performance at the Booth Theatre on 45th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 1164,
  "archivePath": "data/archives/reviews/for-colored-girls-who-have-considered-suicide-when-the-rainbow-is-enuf-2022/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:43:59.057Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251212034336",
  "archiveOrgUrl": "http://web.archive.org/web/20251212034336/https://www.theatrely.com/post/for-colored-girls-returns-home-to-broadway-review",
  "contentTier": "complete",
  "wordCount": 1164,
  "tierReason": "Full review text"
}
