{
  "showId": "swept-away-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2024/11/19/swept-away-adrift-on-a-dark-dark-sea/",
  "publishDate": "2024-11-19T22:55:22",
  "fullText": "Swept Away represents one of those Broadway producing choices that time will prove brave or misguided. The expectation is that audiences will embrace a grim, historically remote morality play that covers ground well trodden by the likes of Melville and Conrad: themes of guilt and innocence, and the individual’s responsibility to the brotherhood of man. Right at the start of the Christmas season, yet.\n\nPlaywright John Logan, he of Red and red-redolent Moulin Rouge!, goes monochromatic in fashioning the story (inspired by a doomed British yacht circa 1884) of a whaling ship out of New Bedford, Mass., wrecked by a storm in 1888. Tellingly, there’s no Great White to be found anywhere near this musical’s action: We’re informed up front that the bounty years of hunting blubber and ambergris are long past, adding an extra note of futility to the torturous circumstances in which four survivors will find themselves.\n\nWhispers from the show’s tryouts at the Berkeley Rep in ’22, and Arena Stage in ’23, suggested that a lack of character texture was seen as a flaw. Such complaints are moot. In the Middle Ages, playgoers didn’t expect nuance from characters named Sloth, Good Works or Everyman. Nor should we seek multidimension in the cross-section of humanity that finds itself Swept Away on a tiny skiff in a maelstrom’s wake. As I watched the show, in fact, I found myself thinking of its four principals in medieval mystery play terms.\n\nFor instance, an attractive newcomer, Adrian Blake Enscoe, is “Little Brother,” though in a morality play he’d be called Innocence. As much as he cherishes his beloved Melody Anne, he deserves “one goddamn frolic before he’s done” and sets out to See the World. As “Big Brother,” a sturdy Stark Sands embodies Piety, leaping aboard to persuade the lad to return to the farm, though not in time to get his own carcass off the vessel. He will provide conscience en route in lieu of “Captain” (Wayne Duvall, stalwart yet haunted), who stands for Authority but who will prove incapable of taking control when things become most dire.\n\nAll three types pale before “Mate,” a role that gives Tony winner (for Spring Awakening) John Gallagher Jr. much to chew on, and not just because he adopts a quirky New England accent as he narrates from his bed in a 1910 tuberculosis ward. A self-described sinner many times over, he could be thought of as Fallen From Grace, though he will attempt to restore himself to grace before this tale is told. “I need to be clean,” he signals early on.\n\nBefore we get to crunch time, there’s much to admire and even to love on this voyage. All the me-hearties dialogue exudes authenticity, as does the air cast by Rachel Hauck’s Billy Budd-like set and Kevin Adams’s smoky lighting. Aside from Captain’s Old Testament moodiness, and the Mate twitting the brothers for their religiosity, the deck is a-crawling with shipmates in motion (director Michael Mayer is always good at simultaneous action). Whenever they let their hair down, David Neumann provides rousing, shitkicking choreography to the tunes of The Avett Brothers who, as millions of folk-rock-bluegrass fans have come to know, can do more with a banjo, fiddle, guitar and drum than most combos many times their size.\n\nThen comes the storm, beautifully realized. But as the ship sinks, so do the suspense and entertainment value. The desultory foursome floats and drifts without food, water or rain for six days, then 16, in a wash of feverish monologues and remorseful ballads. (For the first time, the Avetts’ songs start to sound too similar.) We wait impatiently for the inevitable realization of what will be required for any chance at survival – a survival that Mate has already suggested (1) is in the cards and (2) he will need to be cleansed of. One final frisson of surprise wraps up the story, but the intended catharsis, to my mind, never arrives.\n\nThe show makes highminded use of The Avett Brothers’s album Mignonette – the name of that wrecked British yacht – much as Girl From the North Country wove early Bob Dylan into bleak narrative (albeit with a more complex environment and fully-realized characters). Both come out of the haut-Broadway tradition of Menotti operas and Marc Blitzstein, often as not seen as caviar to the general. The new work is obviously a labor of love executed with exemplary taste but, in the end, lacking in qualities by which an audience is likely to be swept away.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "nyc-theatre"
  ],
  "originalScore": "3/5 stars",
  "nycTheatreExcerpt": "It's strong stuff, and hardly the sort of musical for tourists simply looking for a fun time. But this superbly staged and acted production exerts a powerful, hypnotic force that demands attention and respect.",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
