{
  "showId": "swept-away-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2024/11/19/swept-away-a-haunting-musical-tale-of-survival/",
  "publishDate": "2024-11-19T22:56:59",
  "fullText": "Despite its title, Swept Away is not a musicalization of the classic Lina Wertmuller film (or its abysmal Madonna-starring American remake). Rather, the show featuring the songs of the popular band The Avett Brothers is a dark, fable-like tale, inspired by a real event, about the fateful aftermath of a shipwreck. It’s strong stuff, and hardly the sort of musical for tourists simply looking for a fun time. But this superbly staged and acted production exerts a powerful, hypnotic force that demands attention and respect.\n\nThe story begins with a prologue in which we’re introduced to one of the four main characters, none of whom are given names: Mate (John Gallagher Jr.) who’s dying in a New York City tuberculosis ward. The events of his past literally come back to haunt him in the form of visitations from his shipmates of 22 years earlier, the crusty Captain (Wayne Duvall) and sibling sailors Big Brother (Stark Sands) and Little Brother (Adrian Blake Enscoe, Apple TV’s Dickinson) who urge Mate to tell their story.\n\nCut to 22 years earlier, 1888, when we’re introduced to a much more vibrant, rakish Mate, one of the sailors working on a whaling vessel sailing off the coast of New England, led by the Captain. The two brothers are last minute arrivals before the ship sets sail, but only the younger one was supposed to be there. He’s idealistic and in search of adventure, and has been followed by his more straitlaced, religious sibling who boards at the last minute to retrieve his brother and instead finds himself trapped on the ship when it unexpectedly departs.\n\nThose thumbnail descriptions are pretty much it when it comes to the characterizations which are skimpy at best and reflect the weakness of the book by John Logan (The Last Ship, Moulin Rouge). And in case you think the ship has an uncommonly small crew, be advised that there’s a full contingent of sailors on board, played by a hard-bodied twelve-person male ensemble, who figure prominently in the musical numbers in the first section before they’re unfortunately dispatched by the shipwreck caused by a massive storm. (Although they do make a striking reappearance as ghostly apparitions rising from the sea in the powerful number “Satan Pulls the Strings.”)\n\nThat storm, magically conveyed through scenic, sound, and lighting effects (not to mention the gales of wind that assault audience members like slaps in the face) is an undeniable highlight of the show, which afterwards switches gears dramatically. We’re left with the four main characters, the only survivors, stranded at sea in a lifeboat, with no food or water. To say that things become dark at that point is an understatement, but there’ll be no spoilers here. (Google if you must.)\n\nSwept Away was inspired by the The Avett Brothers’ 2004 album Mignonette, named after a British yacht that sank in the 1880s and upon which this story is based. The show, which uses songs from that album as well as others from the band’s catalogue, could thus be described as a jukebox musical. But it’s far more similar to the Bob Dylan musical Girl from the North Country than the standard bio-musicals (Jersey Boys, Beautiful) or frothy larks (& Juliet, Mamma Mia!) with which the genre is commonly associated.\n\nThe Avett Brothers’ music is not very theatrical in the traditional sense, but it’s wonderful, an enthralling and frequently haunting blend of folk, rock and country often referred to as Americana. It’s rendered beautifully here, not only by the strong-voiced performers but also the superb orchestrations for the musicians which features such instruments as banjo, harmonica, and acoustic guitars.\n\nGallagher, Jr., reuniting with director Michael Mayer after their collaborations on Spring Awakening and American Idiot, anchors the proceedings with his charismatic performance which takes huge swings from ebullience to despair. His co-stars are equally good, with Sands particularly moving as the older brother desperate to protect his sibling. And while Mayer’s staging is necessarily hampered by the fact that the second half of the 95-minute show takes place within the confines of a small boat (revolving it repeatedly only does so much), it nonetheless fully succeeds in conveying the salty nautical atmosphere.\n\nSwept Away will certainly not be for all tastes. But if you’re willing to accept it on its own terms it emerges as one of the most original and audacious musicals of the season.\n\nSwept Away opened November 19, 2024 at the Longacre Theatre. Tickets and information: sweptawaymusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
