{
  "showId": "swept-away-2024",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Aramide Tinubu",
  "url": "https://variety.com/2024/legit/reviews/swept-away-review-broadway-1236221067/",
  "publishDate": "November 19, 2024",
  "fullText": "There's so much to recommend \"Swept Away\" — about two brothers from a religious family who get trapped on an ill-fated whaling ship with a crew of doomed heathens — that it seems unkind, or even unfair, to call it a misfire.\n\nThe music, for one thing — which comes from the discography of the beloved folk-rock band The Avett Brothers — is beautifully written and performed by the show's three leads, Adrian Blake Enscoe, Stark Sands and John Gallagher Jr., all of whom have good pipes and perform their parts, under the direction of Michael Mayer, with ease and humor. And David Neumann's choreography — which is not at all made up of kitschy Broadway numbers but instead rollicking reels performed by the all-male cast on the ship's deck — is so joyous that it dares audience members not to jump to their feet and clog.\n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Disney Outlines Mega Marketing Group Leadership Structure Under Chief Marketing and Brand Officer Asad Ayaz \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Disney CEO Succession Drama: How Josh D’Amaro Won the Battle to Replace Bob Iger\n\nRachel Hauck's set design, too — at first the rather naturalist deck of a sailing ship, and then a dingy in which the two brothers, along with the captain (Wayne Duvall) and the first mate, lay dying after the ship has sunk — is inspired: The hull of the ruined boat rises from in the middle of the stage, and the men are reflected in its mirrored bottom, the way they might be by the surface of the water.\n\n \n Popular on Variety\n\nKevin Adams's lighting too is masterful — a character unto itself, as it stands in for cruel Mother Nature with her glittering stars and moonlight as blue as a corpse.\n\nBut it's John Logan's story that's lacking. True, you fall in love with the younger of the two siblings, Little Brother (the very charming Enscoe), an innocent who steals aboard the ship because he senses there's more to life than working on a farm. And you sympathize with his keeper, Older Brother (Sands), who is loyal to his parents and his God and can't understand why Little Brother doesn't see the beauty in farm life and family. In contrast, the first mate (Gallagher Jr.) has neither family nor faith, and though this doesn't make him evil, it allows him to come up with the one idea that might both save him and ruin him forever: He wants to kill the weakest of the men in the dinghy, Little Brother, so that the rest can then eat his flesh and live.\n\nFor the rest of the show we watch how that idea plays, with a twist.\n\nThis is not Samuel Beckett or even David Mamet. The four men in the dingy are not particularly deep or philosophical, and their lot in life is not metaphorical. The narrative of \"Swept Away\" turns out to be Christian, where faith in God makes the characters better people and helps them at the end of their lives. If the first mate, in the last moments of the play, can find God and forgiveness, then he, too, can die in peace. But this understanding of redemption must be supplied by audience members, because it's not adequately explored throughout the play. It's only in the last few minutes that it's raised at all.\n\nPeople will come to see \"Swept Away\" for the music, and they'll be glad they did. And they'll come for the acting, too, which is accomplished and polished. And they'll come for the cannibalism, because that's how people are. But if they've come for a satisfying story, they'll leave hungry.",
  "isFullReview": true,
  "dtliExcerpt": "Despite its flaws, 'Swept Away' is a passionate and deeply felt musical that showcases the power of folk music to tell stories of human resilience in the face of unimaginable tragedy.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Despite its flaws, 'Swept Away' is a passionate and deeply felt musical that showcases the power of folk music to tell stories of human resilience in the face of unimaginable tragedy.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 606,
  "archivePath": "data/archives/reviews/swept-away-2024/variety--aramide-tinubu_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:10:43.842Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "duplicateTextOf": "variety--peter-marks.json",
  "wordCount": 606,
  "tierReason": "Full review text"
}