{
  "showId": "almost-famous-2022",
  "outletId": "broadwaynews",
  "outlet": "Broadway News (Brittani Samuel)",
  "criticName": "Brittani Samuel",
  "url": "https://bway.ly/2hyf10",
  "playbillVerdictUrl": "https://bway.ly/2hyf10",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Musical genres do not have perfect opposites, but if heavy syncopation and electric guitar are foundational to rock, the breezy melodies and steel pan of soca music — what populates my playlists — are as close to contradiction as possible. Musical genres do not have perfect opposites, but if heavy syncopation and electric guitar are foundational to rock, the breezy melodies and steel pan of soca music — what populates my playlists — are as close to contradiction as possible. Rock ’n’ roll is a sonic phenomenon that I was neither raised around nor grew familiar with, so who better to learn from than Lester Bangs, legendary music critic of “Creem” and “Rolling Stone” glory? A fictionalized Bangs (played by actor Rob Colletti) opens the musical “Almost Famous,” now running at the Bernard B. Jacobs Theatre. Bangs explains that the “genius of rock” is that it is “gloriously and righteously dumb.” Those seeking to glean respectability or meaning from the form suffocate it: “The day it ceases to be dumb is the day it ceases to be real.” It is a genius way of setting up a loud, flashy musical with no real stakes, while also shielding the show from that very same critique. When the musical’s Lester Bangs breaks down these rules of rock ’n’ roll, he is doing so to a 15-year-old boy named William Miller (Casey Likes). William is an avid student of Led Zeppelin, Black Sabbath, et al., and aspires to be a rock journalist. Love of the form lands the cherubic but socially awkward teen his dream story: profiling the up-and-coming band Stillwater for “Rolling Stone.” William joins Stillwater on the road, and the closer he grows to them — particularly brooding frontman Russell Hammond (an earnest Chris Wood) — the murkier his goals become: Will he extol the band’s genius like his newfound friends want him to? Will he divulge the group’s arguments like his editors want him to? And — most important — will he make it back home for high school graduation as his mom (Anika Larsen) wants him to? It’s a feeble attempt to set up conflict for a musical that, inherently, has none.",
  "isFullReview": true,
  "textWordCount": 363,
  "archivePath": "data/archives/reviews/almost-famous-2022/broadwaynews--brittani-samuel_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:38:34.292Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 363,
  "tierReason": "Full review text"
}