{
  "showId": "almost-famous-2022",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Dalton Ross",
  "url": "https://ew.com/theater/theater-reviews/almost-famous-review-broadway-musical/",
  "playbillVerdictUrl": "https://ew.com/theater/theater-reviews/almost-famous-review-broadway-musical/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "​ \n\n \n\n \n\n \n\n \n\nTop Stories\n\n1\n\nRosie says she and Ellen never resolved their issues \n\n2\n\nBill Maher responds to Larry David's essay mocking his dinner with Trump\n\n3\n\nBowen Yang calls J.D. Vance 'a pope killer' on 'The View'\n\n4\n\nDavid Kinne says girlfriend left him after he didn't win 'Survivor'\n\nAlmost Famous review: The Broadway musical misses a few notes\nThe stage adaptation of Cameron Crowe's coming-of-age film doesn't take enough risks.\n\nCalifornia Dreams was better than Saved by the Bell. There, I said it.\n\nCalifornia Dreams was better than Saved by the Bell. There, I said it.\n\n\"It's over.\" That's Lester Bangs uttering the first words of the new Almost Famous musical now playing at the Bernard B. Jacobs Theatre in New York City. Or, rather, that's actor Rob Colletti playing Lester Bangs. The \"it\" in question is rock & roll. Real rock & roll. A genre Bangs declares already dead by the year 1973.\n\nWhile watching this new stage adaptation of Cameron Crowe's 2000 coming-of-age-on-a-tour-bus film, I couldn't help but wonder what the actual Bangs — the preeminent rock critic of his era obsessed with the anarchic lo-fi danger of the Stooges — would make of being a character in a splashy Broadway musical. It's safe to say he would probably not be a fan. But Bangs might also find himself wondering how a musical all about the love of music could fall so flat when it comes to the actual, you know, music.\n\nThat is the biggest flaw in an adaptation that faithfully follows the original source material… sometimes a little too faithfully, with entire sections of dialogue and almost every scene and plot point seemingly lifted directly from the original film. In the end, you find yourself wishing that a production about the rebellious world of rock & roll would let its hair down a bit more and take bigger risks instead of playing it safe at almost every turn.\n\nWhile the Broadway version of Almost Famous may not be full of surprises, it capably and dutifully retells Crowe's semi-autobiographical tale of aspiring teen rock journalist William Miller (Casey Likes), who scores a job writing about a Led Zeppelin-esque rock outfit named Stillwater. William befriends the band, which becomes a problem when he then needs to write the truth about what he sees out on the road — a road he travels not only with the group, but the groupies (or \"Band-Aids\" as they call themselves), including the alluring Penny Lane (Solea Pfeiffer).\n\nLikes matches the eager and awkward dorkiness of the role originated by Patrick Fugit on screen, and Pfeiffer struts the stage and belts out tunes with the same vulnerability-masking confidence that Kate Hudson brought to her Oscar-nominated performance. They lead an engaging cast also buoyed by the fire and ice performances of Stillwater bandmates Drew Gehling and Chris Wood, who play singer Jeff Bebe and guitarist Russell Hammond.\n\nGehling steals scenes playing to the back row of the theater with his preening, peacocking prima donna take on Bebe, while Wood contrasts well, playing to the front row with a more laid-back easy-going charm — at least when not going full Golden God. Anika Larsen is not given a lot to do in the first act as William's uptight mom Elaine (originally played on screen to perfection by Frances McDormand), but is provided more (including her own number) in the second.\n\nThe production's often sparse set and staging succeeds in capturing the hectic on-tour vibe of the band, with equipment crates and doors seemingly always on the move. Meanwhile, the sea of bell-bottoms, retro tees, furry collars, and random scarves on display from costume designer David Zinn place the story well and are likely to inspire many a trip to the local vintage clothing store.\n\nUnfortunately, the original songs — with music and lyrics by Tom Kitt as well as lyrics by Crowe, who also wrote the book — let the rest of the show down. A notable exception is \"Something Real,\" which translates the brilliant stupidity of Russell's \"be real\" speech to song — leaning into the absurdity of a pampered rock star attempting to convince himself he is somehow above the pomposity of stardom by pretending to be a man of the people. It's one of the few times the show opens up to actually wink and laugh at itself.\n\nAs for the rest of the original numbers, unfamiliar tunes are naturally going to struggle next to established songs from the film like Stillwater's \"Fever Dog\" and Elton John's \"Tiny Dancer\" (as well as other well-known jams like Zeppelin's \"Ramble On,\" T Rex's \"20th Century Boy,\" and Stevie Wonder's \"Higher Ground\"). Even so, the vast majority of new material — especially Penny Lane's snoozy ode to Morocco titled… \"Morocco\" — fail to inspire. Or, even worse, rock.\n\nAt least until the play is over. The production's curtain call, in which each of the characters belts out a line of \"Fever Dog\" for their final bow is inspired, free-wheeling, unexpected fun. If only the rest of the show had done more of the same. B–",
  "isFullReview": true,
  "textWordCount": 852,
  "archivePath": "data/archives/reviews/almost-famous-2022/ew--dalton-ross_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:38:39.235Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426000354",
  "archiveOrgUrl": "http://web.archive.org/web/20250426000354/https://ew.com/theater/theater-reviews/almost-famous-review-broadway-musical/",
  "contentTier": "complete",
  "wordCount": 852,
  "tierReason": "Full review text"
}