{
  "showId": "almost-famous-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2022/11/03/almost-famous-cameron-crowe-almost-tunes-up-his-2000-hit-flick/",
  "publishDate": "2022-11-03T20:54:39",
  "fullText": "Hey, musical chroniclers, here’s this week’s tuner based on – as the now decades-long dictum claims must be – a successful (or successful enough) book, film or play.\n\nIt’s Almost Famous, adapted from the 2000 movie of the same name, written and directed by Cameron Crowe and the recipient of many Oscar and Golden Globe commendations ($47-plus million at the box office, not to be sniffed at).\n\nFor the transfer, Crowe wrangled the book and lyrics with busy-busy Tom Kitt, who’s supplied lyrics and music, returning from last season’s less than incandescent Flying Over Sunset and The Visitor, yet another movie-plucked item.\n\nFans of Almost Famous likely recall Crowe’s tale of 15-year-old wannabe journalist and rock fan William Miller receiving a surprising 3,000-word Rolling Stone assignment to follow climbing 1973 metal band Stillwater on a cross-country tour from San Diego to New York City. (The story is somewhat autobiographical, Crowe having been a Rolling Stone contributor at an early age.)\n\nFired up, Miller (likable newcomer Casey Likes) leaves behind his severely dubious teacher-mother Elaine (Anika Larsen) and his impending graduation to confront possible corruption (drugs!) by the band members, who, as with most rock band members, are forever on the verge of breaking up.\n\nMentored by real-life figure, rock journal Creem’s much-lauded leading light, Lester Bangs (Rob Colletti, wearing Bangs’ favored “Detroit Sucks” T-shirt), the inordinately naïve William gets caught up with aging groupie Penny Lane (Solea Pfeiffer) and her heartthrob, Stillwater’s master guitarist and married Russell Hammond (Chris Wood).\n\nAlso on hand and often much too hand-sy are the groupies nicknamed Band-Aid, Sapphire (Katie Ladner), Estrella (Julia Cassandra), and Polexia (Jana Djenne Jackson). Rolling Stone’s real-life Ben Fong-Torres (Matthew C. Yee) puts in a couple showings. (The zine’s Jann Wenner does warrant a mention.)\n\nAny musical maven would have good reason to think something like Almost Famous, which deals with musicians, would be a prime contender for hot-hot musicalization. It may be, but this reworking doesn’t substantiate the promise.\n\nThe change in spitfire English director Jeremy Herrin’s production isn’t immediately easy to explain. It appears, however, that the addition of songs (and, often, only parts of Metallica-like outbursts) precludes characters’ full dimensions. As the 29 – count ‘em, 29 – numbers accumulate, it becomes more a question of whom Almost Famous is following.\n\nWhere’s the focus? Though William, Penny, and Russell do interact (and other figures have their moments), it feels as if the three are skimped, stranded in their own situations. Does William really learn anything on his literal and psychological journey? He and his nagging mom may achieve something of a happy ending, but have they earned it? What’s Penny’s background? Shouldn’t there be more known about Russell?\n\nThere is an even larger drawback. While top-notch Broadway creators like scenic designer Derek McLane, costumer David Zinn, lighting designer Natasha Katz, and lighting designer Peter Hylenski wage their level-best, the score is not up to par – certainly nowhere near surpassing par.\n\nWriter-director Crowe lacks inspiration as a lyricist. Less helpful are Kitt’s melodies. (Hard to know, of course, on which lyrics he and Crowe collaborated.) The composer is building up an impressive Broadway resumé, Next to Normal perhaps his best success so far. But is he contacted and contracted so regularly because he’s sufficiently come through previously?\n\nA couple of insertions stand-out, none of them numbers for the feuding Stillwater four. Those are pastiches, several times begun only to be curtailed partway along. Kitt’s best are Penny’s ballad “Morocco” and another for William, “No Friends.” That one somewhat bafflingly contains a lyric about the singer’s being expected to have, well, no friends. Huh? Beautiful as the melody is, the negative sentiment (Kitt’s? Crowe’s? both?) works against its manifest beauty.\n\nThe score’s drawbacks are compounded by a bigger red flag: presentations, mentions and allusions to inspired songs from the rock ‘n’ roll, songbook. The most outstanding is the Elton John-Bernie Taupin “Tiny Dancer,” which Crowe slotted into his film. He uses it here to close the first act. Why William sings it isn’t clear, unless it’s placed where it is solely because it’s supremely sure-fire.\n\nThen there’s the character Penny Lane, whose moniker (she was born Lady Goodman), instantly conjures Paul McCartney’s charming Liverpool neighborhood reminiscence. Not only that, but this Penny Lane declares that her favorite song is Joni Mitchell’s mesmerizingly melancholy “River.”\n\nCounting on its effect, Crowe has her sing “River” snippets when, late in her downward spiral, she’s Quaaluded out on Sapphire’s leave-behinds. A mistake. “River” devotees would rather hear more of Mitchell and less of what’s surrounded it. There also are a few measures of Stevie Wonder’s “Higher Ground,” another tease of something unforgettable.\n\nIt needs to be said that as the established songs of tunesmithing brilliance and others moderately serviceable emerge, they’re sung by a cast of first-rate rock belters, led by the likes of Likes, Pfeiffer, and Wood. Patrons are advised not to leave before the curtain-call finale, when each of the gifted ensemble barrels forward to show his or her sizzling stuff.\n\n“Penny Lane” is not delivered entirely or partially. So, McCartney’s memorable lyric isn’t heard about the Penny Lane nurse who “though she feels as if she’s in a play, she is anyway.” Crowe’s Penny Lane is in a play, a musical —and not an especially powerful one, at that.\n\nAlmost Famous opened November 3, 2022, at the Bernard B Jacobs Theatre. Tickets and information: almostfamousthemusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "show-score-playwright",
    "playbill-verdict"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2022/11/03/almost-famous-cameron-crowe-almost-tunes-up-his-2000-hit-flick/",
  "showScoreExcerpt": "\"Any musical maven would have good reason to think something like 'Almost Famous,' which deals with musicians, would be a prime contender for hot-hot musicalization. It may be, but this reworking doesn’t substantiate the promise.\"\n\nRead more"
}