{
  "showId": "almost-famous-2022",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/almost-famous-barely-there-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/almost-famous-barely-there-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "In another devastating blow to the 'West Coast Has Taste' community, the musical Almost Famous has opened on Broadway, after a well-received premiere run in San Diego, to put another nail in that idealistic California coffin. It is a production so dull, with poor direction, ugly sets, uninteresting music, and flat performances, that it really needn't exist at all. Mind you, my beef here is mainly with the Pacific-facing critics who-be it through payola, their overall lack of theatre, or whichever self-help cult they've got going on over there these days-allowed me to raise my expectations for a show which counts among the most artistically lacking I've seen.",
  "bwwScore": 2,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ALMOST-FAMOUS-Opens-On-Broadway--See-What-The-Critics-Are-Saying-20221103",
  "fullText": "Casey Likes & the company of Almost Famous | Photo: Matt Murphy\n\nIn another devastating blow to the “West Coast Has Taste” community, the musical Almost Famous has opened on Broadway, after a well-received premiere run in San Diego, to put another nail in that idealistic California coffin. It is a production so dull, with poor direction, ugly sets, uninteresting music, and flat performances, that it really needn’t exist at all.\n\nMind you, my beef here is mainly with the Pacific-facing critics who—be it through payola, their overall lack of theatre, or whichever self-help cult they’ve got going on over there these days—allowed me to raise my expectations for a show which counts among the most artistically lacking I’ve seen.\n\nAnd what a softball for them! You’d think their senses would be sharper analyzing a musical with a book adapted by Palm Springs native Cameron Crowe from his own, semi-autobiographical film, which beautifully captured the sun-drenched vibes of the state’s ‘70s rock scene and became an instant Hollywood hit, winning an Oscar for Best Screenplay. But the book captures almost nothing of that beloved history, let alone the film’s plot: of a 15-year-old Crowe stand-in (Casey Likes, very good, considering) who scams his way onto a Rolling Stone assignment to follow the fictional band Stillwater’s troubled tour, meeting “band-aids” like the wise beyond her years Penny Lane (Solea Pfeiffer, also very good, considering). Overstuffed with composer Tom Kitt’s music, there is barely a chance to let any beats register before it’s onto the next stop.\n\nTo be fair, regionalism won’t do anyone any favors here. Kitt (NY)’s original music and lyrics are anything but—a bland idea of what rock music might sound like to the ghost of a sheltered toddler. I’d mention that Peter Hylenski’s over-amped sound design often makes it impossible to distinguish words whenever more than two people are singing, but with lyrics like “everybody’s coming together / everybody’s here on the scene / people being good to each other / come and see just what I mean,” it’s probably for the best.\n\nAnd British director Jeremy Herrin, whose inventive work on People, Places, and Things first brought him stateside, has not yet mastered the Broadway musical. His staging might work for more experimental plays staged in the round but, at the Jacobs, mostly just looks as if an entire ensemble is aping a DVD screensaver logo, bumping around aimlessly and trying not to hit any corners. The largest sign of his inadequacy here is in making a character played by the supremely talented and watchable Pfeiffer feel uninteresting, in what I imagine is an attempt to overcorrect the book’s lack of California-ness by directing everyone to act as buzzed-out as possible.\n\nIt was her involvement, plus the show’s early reviews, that made me hope this might be one of the few good screen-to-stage adaptations. At the very least, one that gave us damn good music. (And, if not, then why is Derek McLane’s cheap set design a series of hideous scaffoldings, reminiscent of a concert stage, if there aren’t really any concert numbers?). But, no, this Almost Famous is about as rock ‘n’ roll as an Urban Outfitters sale, and half as memorable.\n\n‍Almost Famous is in performance at the Bernard B. Jacobs Theatre on West 45th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 666,
  "archivePath": "data/archives/reviews/almost-famous-2022/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:05:45.445Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250908123104",
  "archiveOrgUrl": "http://web.archive.org/web/20250908123104/https://www.theatrely.com/post/almost-famous-barely-there-review",
  "contentTier": "complete",
  "wordCount": 666,
  "tierReason": "Full review text"
}