{
  "showId": "choir-boy-2019",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Nick Romano",
  "url": "http://ew.com/theater-reviews/2019/01/08/choir-boy-review/",
  "playbillVerdictUrl": "http://ew.com/theater-reviews/2019/01/08/choir-boy-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nTheater\n\nTheater Reviews\n\nMoonlight writer Tarell Alvin McCraney's Choir Boy makes a spectacular, necessary Broadway debut: EW review\n\nBy\n Nick Romano\n \n\n \n\nNick Romano\n\n \n\n \n\n \n\n \n\n \nNick is an entertainment journalist based in New York, NY. If you like pugs and the occasional blurry photo of an action figure, follow him on Twitter @NickARomano.\n\nEW's editorial guidelines\n\nPublished on January 8, 2019 10:00PM EST\n\n \n\n \n\n \n Photo: © Matthew Murphy, 2018\n\n For playwright Tarell Alvin McCraney, art isn’t just for amusement, escapism, or cultural critique. It’s necessary. For Pharus, the protagonist of McCraney’s Broadway debut, art is even more than that — it’s survival.\n\nChoir Boy first debuted Off Broadway in June 2013, but a lot has happened for McCraney since then. His unpublished semi-autobiographical play In Moonlight Black Boys Look Blue became the basis for the Oscar-winning film Moonlight in 2016. With a statuette of his own from the Academy for Best Adapted Screenplay, McCraney now revisits Choir Boy for a bow at New York’s Samuel J. Friedman Theatre. No matter the stage, the stories of Pharus and the fellow students in his school’s gospel choir are just as significant as they were five years ago — perhaps even more so.\n\nPlayed by the strikingly talented, fresh-faced Jeremy Pope, Pharus, a young gay black teen, struggles to exist at the Charles R. Drew Prep School for Boys, an elite institution flaunting a legacy of producing strong black men. Every sway of the hip, every bend in the wrist draws criticism from his headmaster (despite the support he tries to instill) and homophobic slurs from his classmates. Pharus’ performance of the school song “Trust and Obey” during a graduation ceremony is interrupted by his tormentor, the headmaster’s nephew Bobby Marrow (J. Quintin Johnson), quietly calling him the N- and F-words. Asked by the headmaster to explain why he halted his singing, Pharus remains silent because a “Drew man” doesn’t snitch, yet Bobby is convinced Pharus gabbed when he’s punished with trash duty, fueling the pair’s ongoing confrontations through the play. Nevertheless, Pharus, named by McCraney for the bright Grecian Pharos lighthouse in Alexandria, commands the spotlight as leader of the school’s illustrious gospel choir just as confidently as Pope commands the stage.\n\nWith Moonlight still looming so presently in our current cultural consciousness, McCraney’s past work, accompanied by this brief premise, paints a more solemn coming-of-age tale, which makes the joy that bursts forth from this cast of largely budding talents unexpected and well balanced. In addition to low, from-the-gut laughs, largely coming from Pharus’ whip-smart comebacks (“I’ve never missed a key of G since I was 3”), AJ (John Clay III), Pharus’ friend and roommate, offers brotherly warmth and acceptance as a tall, jock baseball player.\n\nThe stakes for Pharus are still present, and he lays them out in one of the play’s crucial scenes where a classroom discussion erupts into chaos. He argues for a more nuanced, more updated perspective on gospel spirituals that goes against the more traditional standards that had been passed down through the black community, that spirituals contained veiled messages to slaves in the Civil War-era South to help them survive and escape slavery. Pharus’ take is that instead of passing on what we think about spirituals, because none of them were actually alive during this time to know for sure, why don’t they pass down what they can confirm to be true about spirituals — that the music freed the slaves in a spiritual sense instead of a literal one, while leaving behind their earthly possessions to their oppressors.\n\nFor Pharus, music is what frees him spiritually, even though his battle is with an unmoving, traditional institution. As progressive as Headmaster Marrow (Chuck Cooper) likes to believe he is, there’s still a struggle with the core beliefs of Drew Prep that constrain Pharus. In one scene, Marrow tries to comfort his charge, though it’s largely due to Pharus’ unmatched music talent. In the same breath, Marrow goes to correct — or “tighten up” — the student’s limp wrist. Pharus is then hindered by a more physical representation of tradition; his more confident and openly gay demeanor enrages Bobby, who maintains a more toxically masculine mindset and bemoans his uncle’s tolerance of Pharus. Bobby fights his classmate at every turn, including a ferocious pushback on his thesis on spirituals.\n\nThe bonds that bind Pharus, however, also bind the other boys. Bobby wrestles to resolve the pillars of traditional manhood (the whole “boys don’t cry” commandment) with his raw emotions left behind by his mother’s death. Another member of the choir, David (Caleb Eberhardt), a gangly, more contemplative member, verbalizes to Bobby how he doesn’t have the luxury of being loud and disruptive as he’s struggling to maintain his scholarship and stay in school. They all need choir because, as Pharus lays out, music frees them, no matter the form it takes.\n\nEach member of the cast offers something nuanced to complement the struggles with Pharus as the small red-hued set expertly shifts between settings and step-dancing sequences. (Scenic and costume design are from David Zinn; choreography is by Camille A. Brown.) But these strong performances also diminish the ending. The characters don’t evolve much from where they begin the story, though one yearns for some clear revelation on the point of Bobby or a triumphant moment for Pharus. Nothing changes. Perhaps that’s the point.\n\nThe music, meanwhile, does. Gospel songs, performed entirely a cappella by the cast, follow the initial performance of “Trust and Obey” to transition between scenes and capture the mood. Later, David, alone in the choir room, hesitantly performs L.T.D.’s “Love Ballad” on assignment from Mr. Pendleton (another impressive and hilarious turn from Austin Pendleton), a white alumnus teaching a class for creative thought. Accompanied by a dream-like sequence of David’s classmates performing a glittery backup routine, the song allows David to profess the true feelings eating him away. Bobby’s bud Junior, played by the jubilant Nicholas L. Ashe, then skips onto the stage with an infectious spirit to deliver a priceless routine to Boyz II Men.\n\nIt feels appropriate, though, that Choir Boy begins and ends with “Trust and Obey.” Because while bonds are broken and progress is made, Pharus and the boys are still trapped in many ways. The proverbial chains are still present, but as Pharus finds joy in singing the school song, emblematic of the systemic issues holding him down, there’s a spark of hope. The music, no matter the form, still sets him free. A-",
  "isFullReview": true,
  "textWordCount": 1085,
  "archivePath": "data/archives/reviews/choir-boy-2019/ew--nick-romano_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:56:47.783Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241224171353",
  "archiveOrgUrl": "http://web.archive.org/web/20241224171353/https://ew.com/theater-reviews/2019/01/08/choir-boy-review/",
  "contentTier": "complete",
  "wordCount": 1085,
  "tierReason": "Full review text",
  "bwwExcerpt": "With Moonlight still looming so presently in our current cultural conscious, McCraney's past work, accompanied by this brief premise, paints a more solemn coming-of-age tale, which makes the joy that bursts forth from this cast of largely budding talents unexpected and well balanced. In addition to low, from-the-gut laughs, largely coming from Pharus' whip-smart comebacks ('I've never missed a key of G since I was 3'), AJ (John Clay III), Pharus' friend and roommate, offers brotherly warmth and acceptance as a tall, jock baseball player.",
  "bwwScore": 9
}
