{
  "showId": "choir-boy-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2019/01/08/choir-boy-brave-new-voice-on-broadway/",
  "publishDate": "2019-01-08T21:31:52",
  "fullText": "Tarell Alvin McCraney’s Choir Boy is a knockout tale of music, homophobia, and racism told in rousing and entertaining manner. Manhattan Theatre Club, which first presented the play in a limited run at their smallest stage in the summer of 2013, has now finally moved it to Broadway—and it’s about time! Choir Boy was brave and stunning back then. With an expanded production, a strengthened script, and the return of three of the central actors, McCraney’s play is even more powerful now at the Friedman.\n\nThat it should take five years to make the move is perhaps understandable, given the unconventional subject matter and a then-relatively unknown playwright. Since 2013, McCraney has won himself a screenwriting Oscar for Moonlight, which was based on an unfinished script he wrote while in college; has been anointed a MacArthur Foundation Fellow, which we’ve learned to no longer call a genius grant; and is presently chair of the Playwriting Department at Yale. Which is to say that the author not only deserves a Broadway opportunity; he belongs on Broadway, as a visit to Choir Boy makes abundantly clear.\n\nThis is, yes, a play about the boys in the choir: High school students at the Charles R. Drew Prep School for Boys, which is known for its choir and makes substantial use of it for fundraising purposes. Pharus Young (Jeremy Pope) is clearly the lead talent; he is also unapologetically flamboyant, despite being a scholarship student at this religious school. Headmaster Marrow (Chuck Cooper) accepts Pharus for who he is, but clearly has long been counseling him to show restraint. Which is not in the boy’s nature.\n\nTrouble comes when one of the choirboys, Bobby Marrow (J. Quinton Johnson), slings homophobic slurs while they are singing at a commencement ceremony. This is compounded by the circumstance that Bobby is one of the “legacy students” and nephew to the headmaster. As the play proceeds, there are other undercurrents of sexuality, which eventually boil over.\n\nRacial undertones overlap with the arrival of noted historian Mr. Pendleton (played, as it happens, by Austin Pendleton; the surname might be coincidental, or not). Putting the white septuagenarian in with the black boys has an obvious effect, with McCraney adding unanticipated depth by giving Pendleton a relevant Civil Rights pedigree.\n\nSpirituals, sung by the choir, are woven through the drama. These are not mere window dressing or entertainment interludes; the plot builds to a philosophical argument about the use of spirituals as signposts for escaping slaves. (I.e., does “Wade in the Water” advise fugitives fleeing along the Mississippi to wander offshore for the purposes of throwing off bloodhounds? Or is it, simply, a spiritual?)\n\nWhat is most significant about these spirituals is that they are so exceptionally performed by Pope (as Pharus) and his colleagues, including the bigoted Bobby. The rousing a cappella arrangements and musical direction by Jason Michael Webb literally stop the show, and when was the last time you saw a play with repeated musical showstoppers? What is crucial to the evening, and to McCraney’s purpose, is that the singing intermingles with sometimes difficult dramatic scenes, and serves to continually lift and engage the audience. The musical staging by Camille A. Brown (who is credited for “movement”) heightens the effect, and does indeed raise the temperature inside the Friedman.\n\nPope is remarkable as the self-assured singer who refuses to back down. (One imagines that the play has autobiographical components, as did McCraney’s Moonlight.) This was a stunning performance back in 2013; it’s rather astounding that Pope is only now making his Broadway debut. In the interim, he has created a leading role in the new Temptations musical, Ain’t Too Proud, which is scheduled to begin previews at the Imperial ten days after Choir Boy closes.\n\nJoining Pope in the spotlight are the two Broadway veterans, Cooper and Pendleton. Tony-winner Cooper (from Caroline, or Change and The Life, among others) is giving what might be his finest performance as the strict headmaster who nevertheless recognizes that the fragile Pharus deserves special treatment. As for Pendleton, he too is at his best as the near-doddering white teacher dedicated to helping the students. Pendleton has been on Broadway for 55 years, since creating the role of the self-effacing tailor Motel Kamzoil in the original production of Fiddler on the Roof. He is also an accomplished director and acting teacher, and recipient of a special Drama Desk Award as “a Renaissance man of the American theatre”—all of which seems to enhance his performance.\n\nThe actors playing the four featured boys offer fine support for Pope: John Clay III as the roommate AJ, who gives what might be the most sympathetic performance; Caleb Eberhardt as the conflicted David, who is in training for the ministry; Nicholas L. Ashe (repeating from the 2013 cast) as Junior, the henchman to the class bully who ultimately switches allegiance; and Johnson as Bobby, with a splendid portrayal of the villainous 17-year-old bigot who nevertheless is dedicated to singing bass in the choir.\n\nTrip Cullman (Lobby Hero, Significant Other) has recreated his superlative staging, with scenic/costume designer David Zinn providing a simple but extremely versatile unit set that allows freedom of movement. The set seems to be expanded here, with more width and depth than possible at City Center Stage II. Peter Kaczorowski, as ever, sensitively sculpts the piece with light.\n\nMcCraney has done a certain amount of work on the play; the action takes place “last year,” which is quite different today than when the play was first produced. (While Choir Boy does not deal with politics, there are some clearly relevant new gibes which would not have occurred to the author or landed with the audience in 2013.) The cast has been expanded as well. While Pharus used to have four fellow choir boys, there are now eight—which is to say that the understudies are now onstage at key spots, amplifying the choral strength and filling in the larger playing area.\n\nOne thing which is missing at the Friedman is “I Been in the Storm So Long,” which Cooper—arguably the strongest singer in either cast—delivered with rafter-rising intensity. One can understand why the rousing number was excised; there was little dramaturgical logic in having the Headmaster, who unlike the boys is not a singer, overshadow the choir. Perhaps McCraney and Cullman and MTC can reinstate it after the bows, which would no doubt send the already delighted customers floating out to 47th Street on a choral cloud.\n\nChoir Boy opened January 8, 2019, at Samuel J. Friedman Theatre and runs through March 10. Tickets and information: manhattantheatreclub.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
