{
  "showId": "choir-boy-2019",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2019/legit/reviews/choir-boy-review-play-broadway-1203102655/",
  "publishDate": "January 8, 2019",
  "fullText": "Praise the Lord! The boys in the choir are back -- this time on Broadway.\n\nHonestly, I was afraid that \"Choir Boy\" — the sweetly exuberant account of a gifted prep school boy's coming of age, written by \"Moonlight\" Oscar winner Tarell Alvin McCraney — would be swallowed up in a Broadway house, after winning us over in an Off Broadway staging in 2013. But aside from the odd set piece (a back wall of big bricks painted red and meaning ... what?), the play transfers nicely, under the surefooted direction of Trip Cullman, from Manhattan Theatre Club‘s smaller studio space. The new venue also gives the show's sensational young lead, Jeremy Pope, more room to spread his wings and soar.\n\nPope plays Pharus Young, a Junior at the Charles R. Drew Prep School for Boys who's refreshingly candid about being gay — so candid that Headmaster Marrow (Chuck Cooper, a rock-solid presence) is concerned that he might provoke the school bullies. \"You gotta tighten up,\" he advises Pharus. \"Like all men hold something in.\"\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Industry' Season 4 Premiere Viewership Jumps 20% From Season 3 \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'It's Florida, Man' Renewed for Season 3 at HBO\n\nBut having been entrusted to sing the school song at the Seniors' graduation, Pharus is too proud and honor-bound to snitch on the headmaster's big-bully nephew Bobby Marrow (a sturdy J. Quinton Johnson) for cruelly hassling him about his \"sissy\" mannerisms. Praising the Lord and leading the Charles Drew Prep Choir are all that the deeply religious Pharus really cares about, so he can put up with whatever torture Bobby can dish out.\n\nBut when the bullying does get too much for Pharus, he's always got a big, strong, loyal friend in his jock roommate, Anthony, played with quiet strength by John Clay III.\n\nMcCraney has an ear for schoolboy vernacular and the confidential bedtime talks between Pharus and Anthony are innocently funny and downright sweet. \"Sick of people calling me something I ain't doing,\" Pharus complains to Anthony about the sexual innuendos. \"I'm just Pharus.\" To which complaint Anthony simply and kindly responds, \"Ain't nothing wrong with being Pharus.\" He's quite right. Pharus is a strange and wonderful character with the courage to be his own exceptional self.\n\nNevertheless, tensions become so fraught that the headmaster asks Mr. Pendleton (Austin Pendleton, basking in a role that suits all his endearing quirks), who has come out of retirement to teach a course in \"creative thinking,\" to serve as the choir's faculty advisor.\n\nMr. Pendleton doesn't have much luck curbing the animal spirits that make prep school a harrowing experience for sensitive students like Pharus. But in a pivotal scene that's much too short, the old professor (who can't even sing) elicits a lively debate on the history of Negro spirituals. And it's through his encouragement that the boys learn to express their deepest feelings through song — proving Pharus's point that spirituals can't be confined to history because this music has never lost its power to comfort and heal.\n\nThe music is as joyous to the audience as it is for Pharus. In music director Jason Michael Webb's fresh arrangements, the songs follow an arc from familiar hymns sung in strict choral harmony to less formal, but meaningful solos. Everyone gets his moment on the musical high wire. Bad-boy Bobby and his baby-boy sidekick, Junior (the angelic Nicholas L. Ashe), get goofy playing at being Boys II Men. A pious divinity student earnestly played by Caleb Eberhardt has a shattering moment with the old Skip Scarborough song \"I Have Never Been So Much in Love Before.\" But honestly, when all is said and sung, you've never heard a more plaintive sound than the voices of a roomful of homesick boys singing themselves to sleep with \"Sometimes I Feel Like a Motherless Child.\"",
  "isFullReview": true,
  "dtliExcerpt": "Jeremy Pope gives a powerhouse performance as Pharus, a talented but troubled teenager whose soaring soprano voice and flamboyant personality make him a target for bullying at his elite prep school.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Jeremy Pope gives a powerhouse performance as Pharus, a talented but troubled teenager whose soaring soprano voice and flamboyant personality make him a target for bullying at his elite prep school.",
  "contentTier": "complete",
  "contentTierReason": "Short text (31 words)",
  "rejectedAt": "2026-02-03T15:30:52.255Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a plot summary or character description mentioning performance quality, but contains no critical evaluation or recommendation about the show itself.; openai: The text is a description of a character and performance, not a review or evaluation of the show.",
  "promptVersion": "5.2.0",
  "textQuality": "full",
  "playbillVerdictUrl": "http://variety.com/2019/legit/reviews/choir-boy-review-play-broadway-1203102655/",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "previousUrl": "https://variety.com/2019/legit/reviews/choir-boy-review-broadway-1203119926/",
  "urlDiscoveredAt": "2026-02-03T23:45:39.638Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 638,
  "archivePath": "data/archives/reviews/choir-boy-2019/variety--marilyn-stasio_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:45:39.644Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 638,
  "tierReason": "Full review text"
}