{
  "showId": "you-cant-take-it-with-you-2014",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "http://www.vulture.com/2014/09/theater-review-you-cant-take-it-with-you.html",
  "playbillVerdictUrl": "http://www.vulture.com/2014/09/theater-review-you-cant-take-it-with-you.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Joan Marcus Most contemporary stage comedies are aggressively joke-based. In effect, the playwright demands that theatergoers bend to the rhythm of his punch lines and cough up laughs on cue. It can be a satisfying if rarely a surprising experience, like watching sitcoms in public. In any case such comedies have all but snuffed out the older, milder kind that flourished on Broadway in the first half of the last century with a minimum of mandatory yocks; few written before 1960 seem revivable, at least to commercial producers. It is therefore not just a treat but also a lesson in humor to find a 76-year-old play like You Can’t Take It With You still springing off the page and tearing through an audience. It may be a chestnut, but when staged and cast as smartly as this Broadway revival, a chestnut goes down like marron glacé.\n\nThere’s no avoiding its old-fashionedness; You Can’t Take It With You has a principal cast of 15, three acts, and a taste for whimsy over realism. Its idea of an au courant namedrop is Trotsky. But in this, the third of the eight 1930s collaborations between George S. Kaufman and Moss Hart, the dramatic architecture feels more purpose-built than those once-modish elements might suggest. The whimsy is tactical. The period is crucial. And the play’s argument requires its big structure. That argument, as the title indicates, is about the uses of money: a topic no less worthy of consideration in 1938, when the country was leaping from depression toward war, than it is today, when it is doing something similar.\n\nBut before the play argues, it beckons.\n\nShow \n 0 Comments / 0 New\n \n Comment\n \n\n Theater Review: You Can’t Take It With You\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 329,
  "archivePath": "data/archives/reviews/you-cant-take-it-with-you-2014/vulture--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:29:11.870Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "contentTier": "needs-rescrape",
  "wordCount": 329,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T15:22:59.680Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be a truncated excerpt mixed with website navigation elements and promotional text rather than a complete review with a critical verdict.; openai: The text contains navigation elements, promotional content, and lacks evaluative content about the production.; kimi: The text is truncated and contaminated with website UI elements (comment sections, 'Your product is saved' notifications, affiliate disclosures) and lacks a visible verdict or conclusion necessary to determine the recommendation.",
  "promptVersion": "5.2.0",
  "bwwExcerpt": "There's no avoiding its old-fashionedness; You Can't Take It With You has a principal cast of 15, three acts, and a taste for whimsy over realism. Its idea of an au courant namedrop is Trotsky. But in this, the third of the eight 1930s collaborations between George S. Kaufman and Moss Hart, the dram...",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-YOU-CANT-TAKE-IT-WITH-YOU-Opens-on-Broadway-2014"
}
