{
  "showId": "anastasia-2017",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "David Gordon",
  "url": "https://www.newyorktheatreguide.com/theatre-news/news/anastasia-sets-first-preview-date-of-23-march-2017",
  "publishDate": "April 28, 2017",
  "fullText": "The stage adaptation of the 1997 animated musical Anastasia will begin previews on 23 March 2017 before officially opening at Broadway's Broadhurst Theatre on 24 April 2017. Anastasia is helmed by Hartford Stage Artistic Director and Tony winner Darko Tresnjak and features a book by Terrence McNally, with music by Tony winner Stephen Flaherty & lyrics by Tony winner Lynn Ahrens. Synopsis: \"From the twilight of the Russian Empire to the euphoria of Paris in the 1920s, the new musical, Anastasia, is the romantic, adventure-filled story of a brave young woman attempting to discover the mystery of her past. The new musical is inspired by the Twentieth Century Fox Motion Pictures.\" Initial casting includes Christy Altomare (Anya), Derek Klena (Dmitry), John Bolton (Vlad Popov) and Caroline O'Connor (Countess Lily Malevsky-Malevitch), all reprising their respective roles from the world premiere Hartford production, with additional casting to be announced at a later date. Mr Klena and Ms Altomare previously performed together in the off-Broadway production of 'Carrie.' Additional casting will be announced in the coming months. Click HERE for our review of the out-of-town tryout at Hartford Stage. The creative team behind Anastasia features choreography by Peggy Hickey, music supervision & direction by Thomas Murray, orchestrations by Doug Besterman, scenic design by Alexander Dodge, costume design by Linda Cho, lighting design by Donald Holder, sound design by Peter Hylenski, projection design by Aaron Rhyne, and hair & wig design by Charles LaPointe. Anastasia is produced on Broadway by Stage Entertainment USA, Bill Taylor and Tom Kirdahy Productions. Twentieth Century Fox's 1997 animated feature Anastasia was nominated for two Oscars: Best Score (Lynn Ahrens, Stephen Flaherty and David Newman) and Best Original Song (Ahrens and Flaherty) for \"Journey To The Past.\" It featured the voice talents of Meg Ryan, John Cusack, Kelsey Grammer, Christopher Lloyd, Hank Azaria, Bernadette Peters, Kirsten Dunst, Andrea Martin, and Dame Angela Lansbury. Christy Altomare made her Broadway debut as Sophie Sheridan in 'Mamma Mia!' from 2012 to 2013. Off-Broadway she played the role of Sue Snell in the 2012 MCC Theater production of 'Carrie.' Derek Klena has appeared on Broadway as Fiyero in 'Wicked' in 2013 and as Michael in 'The Bridges of Madison County' in 2014. His off-Broadway credits include the Second Stage Theatre production of 'Dogfight' in 2012 and the MCC Theater production of 'Carrie,' also in 2012. Originally published on Oct 19, 201700:00",
  "isFullReview": true,
  "dtliExcerpt": "Christy Altomare brings both vocal power and emotional depth to the title role, while Derek Klena provides strong support as the romantic lead Dmitry.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Christy Altomare brings both vocal power and emotional depth to the title role, while Derek Klena provides strong support as the romantic lead Dmitry.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (24 words)",
  "previousUrl": "https://newyorktheatreguide.com/reviews/anastasia-broadway-review",
  "urlDiscoveredAt": "2026-02-03T09:02:23.272Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 398,
  "archivePath": "data/archives/reviews/anastasia-2017/nytg--david-gordon_2026-02-03.html",
  "textFetchedAt": "2026-02-03T09:02:23.278Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 398,
  "tierReason": "Missing proper ending or other signals"
}