{
  "showId": "an-enemy-of-the-people-2024",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=-SOJG7R",
  "publishDate": null,
  "fullText": "It's like a trip back to the 1980s: This revival of Henrik Ibsen's An Enemy of the People, with Jeremy Strong and Michael Imperioli, recalls the days when Circle in the Square hosted the likes of George C. Scott, Philip Bosco, and Rosemary Harris in straightforward, but muscular, productions of classics ranging from The Bacchae to Death of a Salesman. And, for the first half at least, Sam Gold's naturalistic production is very much in the Circle-in-the-Square mold. True, the scenic collective known as dots has erected an unsightly and distracting ceiling piece over the stage and, in the first of the play's five acts, Isabella Byrd's admirable attempt at imitating the lamplit look of late nineteenth-century interiors leaves one squinting to see the actors' faces. But still, it's nice to hear Ibsen's words ringing through the house again. Those words, however, have been heavily adapted by Amy Herzog, a fine contemporary playwright who, based on this offering and last season's A Doll's House, has been dubbed \"the Ibsen whisperer\" by the New York Times. To my mind, she is more like a dramaturgical Marie Kondo, busily neatening up and decluttering plays: removing any character under the age of sixteen, severely reducing the servant population, and, in this case, nearly eliminating the voluble crowd at a town meeting. She even goes so far as to remove the leading lady; Dr. Stockmann, the play's protagonist, is now a grieving widower, cared for by his daughter Petra, who, no doubt, is relieved to have survived the cut. The loss of Mrs. Stockmann is, I think, central to Herzog's purposes, for if Dr. Stockmann is the protagonist of An Enemy of the People, it's less clear that he qualifies as a hero. He has been a driving force in developing a spa designed to turn his financially struggling community into a boomtown resort. With opening day drawing near, he discovers that the waters are poisoned by runoff from local tanneries, making the supposedly healthful baths into a typhoid-spreading deathtrap. (It has always seemed a little peculiar that Doctor Stockmann has never thought of these dangers, especially since one of the toxic facilities is run by the father-in-law whom he so cordially dislikes.) Motivated by civic duty, he takes his findings to the town fathers who, briefly, thank him -- until they realize the costs and delays involved in fixing the system. Backpedaling, they prevaricate, obfuscate, and dither over making even cosmetic changes. And when Dr. Stockmann fights them, they unhesitatingly smear him as a malcontent, a crank, and a huckster -- hence the play's title. There's no question that Dr. Stockmann is a force for good, bent on saving the town from self-destruction and sparing untold numbers from misery. But in other, more faithful, translations, he's also rather stuck on himself, imagining with self-congratulatory glee how the locals will lionize him, and bursting into rage when they don't. His chief antagonist, the mayor, is also his brother and their relationship is riddled with mutual envy and distrust. Armed with unassailable arguments, Dr. Stockmann is also his own worst enemy, as his entirely sympathetic and supportive wife repeatedly notes. Denouncing a society run by \"curs\" who degrade intelligent beings (like him), he sounds rather like a defender of eugenics or an Ayn Rand superior man touting the supreme rights of the individual. It's this tension between idealism and bluster that gives An Enemy of the People its dramatic grit. But Herzog -- seeing the obvious parallels between Ibsen's plot and today's combative, often flagrantly dishonest political culture -- reshapes Dr. Stockmann as a lone crusader against the mob, pushing back against groupthink and fake news. in Strong's characterization, he is a pillar of virtue, an innocent who hasn't a clue about quid-pro-politics. (Stockmann has spent much of his adult life in penury, ministering to the poor in a remote outpost, and he takes an almost childlike delight in the creature comforts brought by his lucrative new position as the spa's medical officer.) That An Enemy of the People speaks to the current moment is beyond a doubt but denuding the lead character of any irascibility and egotism -- indeed, almost sanctifying him -- leaves him diminished, almost neutered. Removing Mrs. Stockmann also deprives the play of a countervailing point of view. In this case, Herzog is less an adaptor than a manicurist, snipping away anything wild or contradictory to create an easily digestible message that few theatergoers will disagree with. Gold matches Herzog's careful tone with a surprisingly tame staging until the finale of the first half. To set up the next scene, at a public forum where Stockmann intends to read his findings, a four-sided bar unit, emblazoned with a corporate logo, is lowered in. A five-minute break is announced, and audience members are invited onstage for a shot of liquor. Heard on the sound system is the A-ha hit \"Take on Me\" -- hey, it's Scandinavian! -- and a party atmosphere takes over. When closing time arrives a few minutes later, the bar unit remains in place -- Strong plays most of the next scene atop it -- and a handful of spectators stay onstage, standing in for the townspeople cut from the text. It's as if Gold, bored with merely moving actors around the stage, had to cut loose a little. In any case, it's the greatest example of product placement in Broadway history: Remember: Linie Aquavit, the production's \"official partner,\" is the drink of the people! Within the constraints imposed by Herzog, Strong gives a solid, often compelling performance, conveying Dr. Stockmann's bewilderment and sadness as he becomes a general object of loathing, his loved ones subject to reprisals. Even with his graying hair, the star seems oddly boyish, a diligent graduate student frustrated that his teachers won't give him better grades. Imperioli practically oozes corruption as Mayor Stockmann, simmering with resentment that fate has handed him a foolish brother. As Dr. Stockmann's right-thinking daughter, Victoria Pedretti, a new face, is a clarifying, common-sense presence. But Caleb Eberhardt, Matthew August Jeffers, and Alan Trong do little more than hit their marks as the Stockmann family's hangers-on. (Eberhardt especially seems hamstrung by the character of the local newspaper publisher who flips from revolutionary to backroom dealer in less than a minute.) As the chair of the local property owner's association, Thomas Jay Ryan is unctuous to a fault. David Patrick Kelly finds a positively satanic glee in Dr. Stockmann's father-in-law, whose financial shenanigans provoke outrage on all sides. In addition to the design contributions mentioned above, David Zinn's costumes are solid period creations -- especially the ceremonial hat from which the mayor can't be parted -- and Mikaal Sulaiman's sound is solid. The production will certainly satisfy Strong's many fans, and it often captures the dark comedy of a town ruled by a venal herd mentality. (The play, written in fury, is Ibsen's response to the horde of critics who thought that Ghosts, his previous work, was beyond the pale; some of Dr. Stockmann's intemperate nature can be attributed to the author.) You can also argue that Herzog is following the lead of Arthur Miller in his version of An Enemy of the People. But a play that isn't easily pinned down, that asks complicated questions about the individual versus the crowd, has been made into a homily. This time, Herzog and Gold aren't challenging their audiences; instead, they're catering to them. --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1259,
  "archivePath": "data/archives/reviews/an-enemy-of-the-people-2024/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:34:31.598Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}