{
  "showId": "an-enemy-of-the-people-2024",
  "outletId": "new-york-theatre-guide",
  "outlet": "New York Theatre Guide",
  "criticName": "Allison",
  "url": "https://www.newyorktheatreguide.com/reviews/an-enemy-of-the-people-broadway-review-jeremy-strong-michael-imperioli-victoria-pedretti",
  "publishDate": "March 18, 2024",
  "fullText": "Read our review of An Enemy of the People on Broadway, starring Succession's Jeremy Strong, The Sopranos's Michael Imperioli, and You's Victoria Pedretti. Henrik Ibsen wrote his seminal play An Enemy of the People in 1883, but its themes of power, corruption, public safety, and environmental issues hit the pulse of current headlines. The show is so relevant that I overheard a fellow audience member incredulously say, “Wait, this was written how many years ago?” The drama’s 10th revival on Broadway, in a new translation by Amy Herzog, gets the star treatment with Jeremy Strong (Succession) and Michael Imperioli (The Sopranos). Director Sam Gold's production of An Enemy of the People skillfully balances the play’s history and its timeliness. An Enemy of the People follows Dr. Thomas Stockmann (Strong), the medical officer for a resort and spa baths in his small Norwegian town. The Baths lure visitors and hold promise to transform the town into “a teeming metropolis.” When Stockmann discovers the water in the baths is contaminated, he sounds the alarm. Stockmann’s brother, Peter (a steely Imperioli), is the mayor and chairman of the baths project, who spearheads the charge in turning the townspeople against Stockmann. Instead of being heralded as a town hero, he is marked as a pariah, and the public safety issue turns political. Sound familiar? Just a reminder: The play debuted 141 years ago. But this production beautifully integrates its 19th-century Nordic roots. The set, designed by the collective dots, features lunette windows and white walls adorned with blue “rosemåling,” a traditional Nordic design. Cast members sing Norwegian folk songs during scenic transitions, and the stage is aglow with candle lanterns (lighting by Isabella Byrd), imbuing the spirit of “hygge,” a Scandinavian word for “comfort.” Key to the play’s balancing act is Strong’s performance. Stockmann’s transition from being a servant of the people to their titular enemy is swift, and Strong expertly portrays the demise. The local newspaper staff ensure their support for Stockmann, declaring, “We are behind you like a wall.” But their backing flickers out as quickly as the extinguished candles between scenes. Stockmann, however, remains steadfast in his convictions. In one of the strongest scenes, Strong is curled in a ball onstage, his wool trousers wet from melting ice cubes. (The ice cubes are clever stand-ins for rocks, driving home the play’s theme of water.) He’s been iced out, literally, and rises to his feet to keep speaking truth to power. It’s an impactful message. The drama follows Doctor Thomas Stockmann, the medical officer of a health resort and Baths in a small Norwegian town. When a university study reveals the town’s water supply is severely contaminated, Stockmann attempts to expose the truth for the public’s safety, but he’s met with resistance from those in power — mainly his brother, the mayor. Stockmann is ostracized, and his scientific findings are deemed improbable and less important than the town’s economy. The two-hour play has a “pause,” but no intermission. Instead, there’s a 10-minute break where audience members are encouraged to walk up to a bar on stage and imbibe in free shots of the Nordic spirit aquavit. (Linie Aquavit is a sponsor of the show.) While some audience members might prefer more time to queue up for the restroom, this lively pause, accompanied by the singing of folk songs, may be a welcome surprise for others. The drink break also sets the tone for the play’s town hall scene, where audience members, with cups in hand, become attendees at a heated community meeting. This is where the Circle in the Square Theatre's in-the-round setup, with audiences on three sides of the stage, really shines. With the house lights up, the audience is implicated in the discourse — especially the lucky few seated on stage for the riveting scene. At the time of publication, An Enemy of the People has a 90% rating on Show-Score, with audiences raving about the performances and translation. Read more audience reviews of An Enemy of the People on Show-Score. This production of An Enemy of the People may be driven by star power, but its enduring message packs a punch for seasoned theatregoers and those new to Ibsen’s works. And audiences will be talking about the bar on stage for years to come. Learn more and get An Enemy of the People tickets on New York Theatre Guide. An Enemy of the People is at the Circle in the Square Theatre through June 16. Photo credit: Victoria Pedretti and Jeremy Strong in An Enemy of the People. (Photo by Emilio Madrid) Succession's Jeremy Strong returns to Broadway for the first time since 2008 in Ibsen's drama about small-town scandal. A doctor publicizes poison in the water and is punished for daring to threaten the town's prosperity. Find out more about tickets to this thrilling revival. An Enemy of the People on Broadway is playing at Circle in the Square Theatre. The theatre is located at 235 West 50th Street , New York, 10019. The running time of An Enemy of the People on Broadway is 2hr. No intermission. There will be one brief pause. The recommended age for An Enemy of the People on Broadway is Ages 12+. Children under 4 years old will not be admitted.. Book tickets for An Enemy of the People on Broadway on New York Theatre Guide. Jeremy Strong has been on Broadway once before, in 2008's A Man for All Seasons. He also performed in six Off-Broadway plays between 2006 and 2012, including Our House, Defiance, and The Great God Pan. Jeremy Strong stars as Dr. Thomas Stockmann, a doctor in a small town who exposes polluted water in the town's lucrative spa baths and turns the town against him. Henrik Ibsen wrote An Enemy of the People in 1882. For the 2024 Broadway revival, Amy Herzog adapted Ibsen's script. She is best known for her Pulitzer-nominated play 4000 Miles and for adapting Ibsen's A Doll's House for Broadway in 2023. An Enemy of the People is running on Broadway for 16 weeks only in winter 2024. Exact dates have yet to be announced. Sam Gold directs An Enemy of the People on Broadway. He is best known for his Tony-winning direction of Fun Home and Tony-nominated A Doll's House, Part 2. More recently, he directed revivals of King Lear and Macbeth on Broadway. An Enemy of the People is recommended for ages 14 and up. The play deals with moral and political issues that may be too mature for young children. Please note that children 4 and younger are not permitted in Broadway theatres. An Enemy of the People is widely regarded as one of Ibsen's masterworks, and this production also features an acclaimed lead actor, adaptor, and director. The production has yet to open, but there is lots of talent involved. Originally published on Mar 18, 202422:00",
  "isFullReview": true,
  "dtliExcerpt": "This production of An Enemy of the People may be driven by star power, but its enduring message packs a punch for seasoned theatregoers and those new to Ibsen’s works. And audiences will be talking about the bar on stage for years to come.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/an-enemy-of-the-people/",
  "needsScoring": true,
  "textWordCount": 1147,
  "archivePath": "data/archives/reviews/an-enemy-of-the-people-2024/new-york-theatre-guide--allison_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:30:33.393Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright"
}