{
  "showId": "an-enemy-of-the-people-2024",
  "outletId": "pagesonstages-wordpress-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.wordpress.com/2024/05/08/an-enemy-of-the-people/",
  "publishDate": null,
  "fullText": "An Enemy of the People, 08 May 2024 It’s hard to believe that Henrik Ibsen wrote An Enemy of the People in 1882. The societal hypocrisies he criticizes are so relevant to today’s world that there were moments in which I had chills. As with Amy Herzog’s A Doll’s House, the thematic content appears unaltered. That is to say, Ibsen really had these ideas; Herzog just modernized the language and made some thoughtful cuts to keep a modern audience’s attention. This production made strong choices to keep the aesthetic firmly grounded in the late 19th century. This was particularly present in the lighting design—both the practicals and the design itself. The flow of the show was consistent and engaging throughout act one, but the five minute interval where the audience was give complimentary liquor and some audience members were taken on stage as part of the drinking debacle felt like a very abrupt, nonsensical transition. Restarting after it was seamless, and while I understand the desire to keep the house lights on as though we were all the townspeople, I do wish they had dimmed us a little bit. I found it hard to focus on the right people with so much visual information. I’m used to lighting indicating where I should look and who I should look at—without it, it was a little bit hard for me to follow the beginning of Dr. Thomas Stockman (Jeremy Strong)’s trial. Once the trial was really underway, I was struck by how flawless the consistencies were in the supporting characters. Billling (Matthew August Jeffers) delivered every line with the same desirous, lusty, cocky attitude that he used when expressing his attraction to Petra (Victoria Pedretti). Hovstad (Caleb Eberhardt) maintained his calmness, but continued to take things personally and let it cloud his judgment—completely in line with his portrayal in the first act. Aslaksen (Thomas Jay Ryan) kept his infuriating smugness and unsuccessful attempts to hide his self serving nature. I’m commenting on this because sometimes in supporting roles, it does not feel like the actors are always playing the same character—sometimes the delivery of lines and the way an actor holds themselves in moments where they don’t have a line for a while starts to lapse because the focus is not on them anyway. This cast was fully committed in a way that was commendable and meaningful. The stunt with dumping the ice on Dr. Stockmann and then using the ice to represent rocks breaking his window was brilliant, accompanied by the world becoming colder (aided by lighting design as well as acting). Not sure if the idea of a drink on the rocks and then the ice representing literal rocks was truly intended or just a fabulous coincidence. Either way, in this moment, it felt like time seemed to freeze. When the characters came back in and informed us that it had been mere hours, I felt the weight that Dr. Stockmann felt—that the world had shifted so much that it could have been eons. The part of the show that frightened me, as intended, was the commitment to masquerading self interest as truth. The list of politicians and movements engaged in this strategy today, ~140 years later, is mind boggling. It hurt my heart to watch the truth lose. To watch the layers of threats pile on mercilessly. At the end, Dr. Stockmann decided the family was staying in town to hold their ground, rebuild their reputation, and prove that the truth was not so easily brushed aside. This evoked something that Georgia politician Stacey Abrams said at a book talk I attended last year and 92NY. She said that (paraphrasing) in our current system, if everybody leaves the areas where they are not the political majority, then those areas become increasingly cemented in what they currently are and it becomes more difficult to exact change in those areas. Even though it’s difficult, she and Ibsen’s fictional Dr. Stockmann had the same chilling conclusion—if you want people to believe the truth, you have to stay in the areas that demonize you for telling the truth so that, over time, those against you begin to doubt that you are their enemy. I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 710,
  "archivePath": "data/archives/reviews/an-enemy-of-the-people-2024/pagesonstages-wordpress-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:38:38.868Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}