{
  "showId": "an-enemy-of-the-people-2024",
  "outletId": "time-out-new-york",
  "outlet": "TIME OUT NEW YORK",
  "criticName": "Adam",
  "url": "https://www.timeout.com/newyork/theater/an-enemy-of-the-people-broadway-review-jeremy-strong-michael-imperioli",
  "publishDate": "March 18, 2024",
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Emilio Madrid | An Enemy of the PeopleReview\n\n4 out of 5 starsJeremy Strong and Michael Imperioli face off in a revival of Ibsen's classic environmental drama.Theater, DramaRecommendedMonday March 18 2024ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\nIt’s not easy being Strong. Licking his wounds in the aftermath of a divisive 2021 magazine profile of him, Succession star Jeremy Strong found that he could relate to the maligned and besieged hero of Henrik Ibsen’s 1882 social drama An Enemy of the People: Thomas Stockmann, a doctor who discovers that the spa water in his small Norwegian resort town is polluted with deadly bacteria. “Doing Enemy of the People is my response to what I experienced from the New Yorker article,” he told the New York Times in a recent interview, noting that Ibsen wrote the play out of a sense of betrayal by people he trusted. “I’m an actor: I want to channel things that I feel into a piece of work, and that’s why I’m doing this play.”\n\nThe actor’s aggrieved but steadfast self-image is a succesful match for his role in this engrossing new production. Stockmann’s refusal to back down from his findings, even though they could destroy the town’s economy, alienates him from the locals at every level: the managers, led by his stuffed-shirt brother, the mayor (Michael Imperioli, imperiously contemptuous); the industrialists, such as his ornery father-in-law (David Patrick Kelly); the tradesmen, embodied by the chair of the landowners association (a hilariously complacent Thomas Jay Ryan); and the working class, represented by the firebrand editor of a local socialist newspaper (Caleb Eberhardt). Only his daughter—played with luminous composure by Victoria Pedretti—is reliably on his side.\n\nLike its spiritual grandchild The Normal Heart, Ibsen’s drama scores hard points against real social ills while also suggesting that a passionate crusader can sometimes be his own worst enemy. But director Sam Gold’s revival of the play, adapted by Amy Herzog (Mary Jane), comes down firmly on Stockmann’s side. Yes, he is an imperfect messenger for his cause: As his frustration mounts, Strong’s tweedy manner gives way to a righteous indignation that doesn’t help his case. And his rhetoric is impolitic: too broad in his denunciation of a society “built on a heap of lies,” too insulting in his rage at “the incredible stupidity of the authorities,” too personal in his attitude toward his brother (“this bigoted, blinkered man”). But there is no question that he is right, and his mistakes seem less like problems of character—pride, elitism, recklessness—than of what we now call optics.\n\nAn Enemy of the People | Photograph: Courtesy Emilio Madrid\n\nIn this regard, Gold’s An Enemy of the People—notwithstanding its 19th-century costumes (by David Zinn) and sets (by the design collective dots) and elaborate period business (the loading of pipes, the heating of drinks, the lighting and snuffing of lamps)—feels pointedly modern, a quality that is brought to the fore in the production’s pivotal scene: a public meeting at which Stockmann tries to share his findings directly with the populace. The scene takes place after a short intermission during which members of the audience go onstage for free shots of aquavit at a shiny modern bar stamped with the logo of the brand providing the liquor. Breaking from the cozy naturalism of the production’s first half, Gold introduces elements of environmental theater: He brings up the house lights and treats the audience as part of the meeting; the characters address us directly, and a few spectators are even seated onstage to pad out the crowd. Circle in the Square’s in-the-round seating plan is ideal for this scene, a public square within a circle of observers.\n\nIt is in this bright corporate space, which stands in sharp contrast with Stockmann’s warmly candlelit private home, that the doctor’s ideas get shouted down. Imperioli’s mayor is effectively the boss of the mob, but everyone is complicit. In a canny adaptation choice, the leftist newspaper editor is now an immigrant of mixed ethnic heritage—so when Stockmann dismisses him with an ill-advised comparison between nonscientists and scientists (“there’s a difference between a stray and a poodle”), the comment takes on racial overtones that inflame the situation. The ending of the scene is chilling.\n\nClimate-change protesters interrupted this sequence at a press preview last week, but the scene itself is already making their point. So far in this century, An Enemy of the People has been revived in New York more than any other Ibsen work, including A Doll’s House. I have seen productions that laid out the counterarguments and personality conflicts more compellingly, but none that focused so intently and mournfully on the underlying issue of contamination, both of the environment and of public discourse. This version of the play is a plea to the audience. Ibsen’s text ends on a note of hero worship, with Stockmann declaring himself the strongest man in the world. Strong, in this revival, seems more conscious of the limits of personal strength. His Stockmann ends instead with a wish for the future that we are watching from: “We just have to imagine that the water will be clean and safe and the truth will be valued…” he says, drifting off. “We just have to imagine.”\n\nAn Enemy of the People. Circle in the Square (Broadway). By Henrik Ibsen. Adapted by Amy Herzog. Directed by Sam Gold. With Jeremy Strong, Michael Imperioli, Victoria Pedretti, Caleb Eberhardt, Thomas Jay Ryan, David Patrick Kelly, Matthew August Jeffers, Alan Trong. Running time: 2hrs. One intermission.\n\nFollow Adam Feldman on X: @FeldmanAdamFollow Time Out Theater on X: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nAn Enemy of the People | Photograph: Courtesy Emilio Madrid\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "dtliExcerpt": "I have seen productions that laid out the counterarguments and personality conflicts more compellingly, but none that focused so intently and mournfully on the underlying issue of contamination, both of the environment and of public discourse. This version of the play is a plea to the audience.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/an-enemy-of-the-people/",
  "needsScoring": true,
  "textWordCount": 1258,
  "archivePath": "data/archives/reviews/an-enemy-of-the-people-2024/time-out-new-york--adam_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:45:20.575Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}