{
  "showId": "chaplin-2012",
  "outletId": "usatoday",
  "outlet": "USA Today",
  "criticName": "Elysa Gardner",
  "url": "https://www.usatoday.com/story/life/theater/2012/09/11/chaplin-broadway-review/1570825/",
  "publishDate": "September 11, 2012",
  "fullText": "Rob McClure gives a performance of remarkable physical and vocal dexterity as the Little Tramp, capturing both Chaplin's comic genius and his darker personal struggles.",
  "isFullReview": false,
  "dtliExcerpt": "Rob McClure gives a performance of remarkable physical and vocal dexterity as the Little Tramp, capturing both Chaplin's comic genius and his darker personal struggles.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "There are surely few harder-working men in show business right now than Rob McClure, the immensely likeable star of the new Broadway musical Chaplin. In the title role, that of film legend Charlie Chaplin, McClure begins the show literally walking a high wire. For more than two hours, he is the dominant figure onstage, aging from a teenager to an octogenarian while alternately channeling his character's unique genius for physical comedy and singing his guts out. As if that's not enough, Chaplin's leading man must also traverse a book...with enough mawkish melodrama to fuel a dozen silent-film parodies. It's this last aspect that ultimately sinks what might have been an exciting new work, and still manages to be, in substantial chunks, an entertaining one.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Rob McClure gives a performance of remarkable physical and vocal dexterity as the Little Tramp, capturing both Chaplin's comic genius and his darker personal struggles.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (25 words)",
  "rejectedAt": "2026-02-03T15:24:36.578Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or quote about a performance, not a complete review with an evaluative verdict or recommendation.; openai: The text is a brief excerpt focusing solely on a performance without evaluating the overall show.",
  "promptVersion": "5.2.0",
  "textQuality": "partial",
  "bwwScore": 6,
  "sources": [
    "web-search",
    "bww-reviews"
  ]
}
