{
  "showId": "master-class-2011",
  "outletId": "newyorker",
  "outlet": "The New Yorker",
  "criticName": "Hilton Als",
  "url": "http://www.newyorker.com/arts/critics/theatre/2011/07/25/110725crth_theatre_als",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "web-search"
  ],
  "bwwExcerpt": "During the intermission, I found myself wondering how Daly and her excellent director, Stephen Wadsworth, would keep all this intellectual and emotional splendor aloft. Though they’d captured my heart with the first half, there was the worry that exhaustion or lack of imagination would cause the acting or the directing to topple ... What Daly understands about her role as Maria Callas is that Callas can’t put herself on: she doesn’t distinguish between her life and her performance. Her life is a career, and her career is her life—a fact that becomes even clearer in the second act, when she must deal with a strong-willed diva-in-training, Sharon Graham (the appropriately haughty Sierra Boggess).",
  "bwwScore": 9,
  "contentTier": "invalid",
  "fullText": "Alexandra Silber and Tyne Daly, as student and diva, in Terrence McNally’s 1995 play. Photograph by Ruven Afanador.\n\nI’m not really much of an opera queen. When, among my gay male friends of the eighties, the talk turned to opera seria versus the “reform” operas of the mid-eighteenth century, say, or opera buffa and its influence on England’s Savoy operas, I shrank to the edge of the discussion, a taciturn schoolboy lost in the cognoscenti’s glittering world of productions picked apart and triumphs recalled. Still, listening to those friends argue the finer points of Maria Callas’s career—or Grace Bumbry’s or Teresa Stratas’s—could be educational and amusing, too, a live version of the world that James McCourt described so knowingly in his 1975 novel about “divadom,” “Mawrdew Czgowchwz.” And it was the memory of those critical, passionate friends, many of whom died of AIDS, that haunted my viewing of the current, brilliant revival of Terrence McNally’s 1995 play, “Master Class” (a Manhattan Theatre Club production, at the Samuel J. Friedman). I can’t say for sure that I would have enjoyed the show as much had I never known those men, but I do know that my sadness at their loss was mixed with joy that McNally had indirectly captured something of their voices in his characterization of the ultimate Voice—Callas.\n\nThe titanic American-born Greek soprano (1923-77) had a terrible face. Or thought she did. Her nose was as long as an anteater’s, and her wide mouth as jarring to the eye as a raw red scar on her olive skin. Had you met her, you might have been afraid to look her in the eye, for fear of recrimination: the world had failed her early on. Her parents, George and Evangelina Kalogeropoulos, had three children: a beautiful girl named Jackie, a boy who died of typhoid fever as a toddler, and then Maria. (The family emigrated from Athens to Queens five months before Callas’s birth.) Evangelina’s disappointment that her third child wasn’t a boy was so great that, for several days, she refused even to look at Maria. Things went downhill from there. Evangelina favored the musically inclined Jackie, but when it was discovered that the four-year-old Maria had a voice she was put to work. In 1937, Evangelina left George and took her daughters back to Athens, where Maria, overweight, myopic, clumsy, and impoverished, was finally taken on by a knowledgeable instructor, who proclaimed her a dramatic soprano. Other teachers followed, all of whom marvelled at the young girl’s tenacity, her bel-canto singing, and her peerless acting ability. (Before Callas, most bel-canto singers just stood at center stage and sang pretty.) Perhaps Callas learned to act in order to entertain the Italian and Greek soldiers her mother forced her to go out with in exchange for food and other wartime scarcities. If that was the case, she extracted herself from her mother’s controlling cruelty by expertly developing what she could control: her voice and her revolutionary approach to a role. As she told one interviewer, she relied on the music to tell her how to play a part; it was all there in the score, if you listened and used your brain a little—but not enough to make you self-conscious.\n\nIn this, Callas resembled another singer who changed the rules: Billie Holiday. Like Holiday, Callas used music as a way of expressing her indomitable, wounded self. While she managed to make opera democratic—by 1956, she had appeared on the cover of Time, and people who had never attended an opera were familiar with her exploits: the broken contracts, the dismissed managers, and so on—there was nothing middle class or comforting about her; she treated opera as a high art that she could fill with base feelings. And, again like Holiday, she was drawn to the wrong men, to men she considered more dangerous and powerful than herself: greatness is isolating. Callas met the Greek shipping tycoon Aristotle Onassis in 1957, while she was married to an Italian industrialist, Giovanni Meneghini, whose money and management had propelled her career forward. Two years later, she left her husband, and she spent the rest of her life in love with Onassis, who eventually dumped her for Jacqueline Kennedy (whom he married in 1968). Callas’s sadness over this lost love distanced her more and more from the world in which she had made her name. Perhaps owing to her dramatic weight loss in the fifties, her voice became strained, and from 1965 onward her appearances were infrequent.\n\nIn the fall of 1971, Callas agreed to teach a series of voice classes in New York, and that is where “Master Class” begins. In a black suit, Callas (Tyne Daly) enters the stage, where her accompanist, Emmanuel Weinstock (the charming Jeremy Cohen), waits, smiling. (He is her anchor throughout the play.) The theatre itself is the classroom. Speaking directly to the audience, Callas asks if the room is too bright. Can the lights be turned down, please? Where’s the cushion she asked for, for her seat? Where’s the footstool she needs in order to sit properly? Ah, you. The pianist. Who are you? You don’t look familiar. Speak up! No one can hear you. “Yesterday morning, we worked on ‘Don Carlos’ together.” “Was that you?” Callas doesn’t remember Manny, as she now calls him—she says each character’s name as if she had invented it—because he doesn’t have a distinctive look. As a matter of fact, you there, sitting in the first or third row, you don’t have a look, either. Those lights are turned down now, much better. Bravo. Next victim, please. Ha-ha, of course that’s a joke.\n\nMore news, politics, culture, business, and technology:\n\n© 2013 Condé Nast. All rights reserved\n\n Use of this site constitutes acceptance of our User Agreement (effective August 1, 2011) and Privacy Policy (effective August 1, 2011).\n \n Your California Privacy Rights \n The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.",
  "isFullReview": true,
  "textWordCount": 1005,
  "archivePath": "data/archives/reviews/master-class-2011/newyorker--hilton-als_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:28:47.719Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20130820080339",
  "archiveOrgUrl": "http://web.archive.org/web/20130820080339/http://www.newyorker.com:80/arts/critics/theatre/2011/07/25/110725crth_theatre_als",
  "wordCount": 1005,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T08:18:50.724Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is biographical content about Maria Callas and setup for the play, but contains no evaluation of the current Broadway production's performances, direction, or quality; openai: The text provided is primarily a biographical context about Maria Callas and lacks evaluative content about the current production of 'Master Class'.",
  "promptVersion": "5.2.0",
  "publishDate": "August 8, 2011"
}
