{
  "showId": "master-class-2011",
  "outletId": "vulture",
  "outlet": "New York Magazine",
  "criticName": "Scott Brown",
  "url": "http://nymag.com/daily/entertainment/2011/07/theater_review_the_diva_parado.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Problem is, in Wadsworth’s Class, the world just doesn’t feel that dangerous. And while Daly, with her clipped, rabbit-punching rhythms and deep reserves of phlegm, is often wickedly funny (“Does anyone know what time it is? I have a beauty parlor appointment after this”) and unspeakably poignant (“Never move on your applause. It shortens it”), I sometimes felt her playing less the tragic has-been than the self-deluded never-was. For the true diva, maybe there’s not much difference. And maybe that’s why I have trouble caring.",
  "bwwScore": 6,
  "contentTier": "truncated",
  "fullText": "I can’t say that Master Class (playing at the Friedman through August 14), Terrence McNally’s wittily imagined version of the tutorials held by a phlegmatic, reminiscing, mot juste–dispensing Maria Callas at Julliard in the seventies, has ever really spoken to me. I’m no opera buff, and since I’m in a confessional mode, I'll tell you that I’m not much for “divas” either; at least, not as theatrical fetish objects. I mostly find them exhausting — the regret, the defiance, the one-liners, I get it. (Nor did I see the original 1996 production of Master Class, which won Zoe Caldwell a Tony, and then cycled through Patti LuPone and Dixie Carter; Faye Dunaway took the role on tour. Even typing all those names exhausts me; I feel like I’m hoisting each individual letter up to a 40-foot marquee.)\n\nMaster Class, produced by Manhattan Theatre Club, is at the Samuel J. Friedman Theatre.",
  "isFullReview": false,
  "textWordCount": 151,
  "archivePath": "data/archives/reviews/master-class-2011/vulture--scott-brown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:31:30.714Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20111114224657",
  "archiveOrgUrl": "http://web.archive.org/web/20111114224657/http://nymag.com/daily/entertainment/2011/07/theater_review_the_diva_parado.html",
  "textIssues": [
    "Word count too low: 151 (min: 300)"
  ],
  "wordCount": 151,
  "tierReason": "Short text (151 words)"
}