{
  "showId": "a-raisin-in-the-sun-2014",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "https://www.newsday.com/entertainment/theater/a-raisin-in-the-sun-review-magnificent-denzel-washington-h17380",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/a-raisin-in-the-sun-review-magnificent-denzel-washington-1.7587798",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "previousUrl": "http://www.newsday.com/entertainment/theater/a-raisin-in-the-sun-review-magnificent-denzel-washington-1.7587798",
  "urlDiscoveredAt": "2026-02-04T02:21:09.489Z",
  "urlDiscoveryMethod": "google-serp",
  "fullText": "Denzel Washington and LaTanya Richardson Jackson during a performance of \"A Raisin in the Sun\" at the Ethel Barrymore Theatre in Manhattan. Credit: AP / Brigitte Lacombe\n\nRemember the questions raised about Denzel Washington being too old to play Walter Lee Younger and about \"A Raisin in the Sun\" being too recently revived in a stratospherically high-profile production starring Sean Combs in 2004?\n\nForget all that. Forget any and all reservations, except the kind that are so hard to get for director Kenny Leon's shattering revival of Lorraine Hansberry's seminal 1959 drama about a struggling black family in Chicago.\n\nWashington, 59, is magnificent -- disaffected, exuberant, heart-shredding -- as the character Sidney Poitier created on Broadway when just 32. Yes, this Walter Lee now says he is 40, not 35, in one of his raw and bruised laments about a life that never really began. But the numbers mean nothing in this devastating portrayal, except to deepen it.\n\nThe actor, at least as impressive as he was in his 2010 Tony-winning performance in \"Fences,\" uses the age to make Walter Lee's dream of using his mother's insurance money to buy a liquor store even more desperate. This really feels like a last chance for a man who has been stunted, with his wife (Sophie Okonedo) and his young son (Bryce Clyde Jenkins), in his mother's tiny apartment (by designer Mark Thompson) for too long. Washington lets us see both the cocky child and the empty man in his face. He seems too big for the space, as if he has so much bottled energy inside that he doesn't know where to put it.\n\nThis time, Leon, who directed Combs on Broadway and in the 2008 ABC film of the play, doesn't have to balance an otherwise stellar cast with a hip-hop mogul in his theater debut. The expert ensemble now feels like a family, full of the lived-in nuance that can shift with just a gesture.\n\nGet the latest on celebs, TV and more.\n\nBy clicking Sign up, you agree to our privacy policy.\n\nOkonedo (\"Hotel Rwanda\") has a face that finds wondrous layers as Ruth, Walter Lee's nearly broken wife. Anika Noni Rose captures the bright ambition of Walter Lee's sister, while Ann Roth's perceptive costumes make sure we notice how the favored child is spoiled. LaTanya Richardson Jackson, who stepped into the production when Diahann Carroll found rehearsals too strenuous, makes a loving, if not multifaceted, mother.\n\nHansberry, the first black woman playwright to have a play produced on Broadway, understood the back-to-Africa movement and the underside of assimilation, and had few illusions about the perils of moving to a middle-class neighborhood. \"Raisin\" is famously inspired by Langston Hughes' poem about a \"dream deferred. . . . Does it dry up like a raisin in the sun?\" With Washington in the center, this one just feels ripe.\n\nWHERE Barrymore Theatre, 243 W. 47th St.\n\nINFO $65-$147; 212-239-6200; raisinbroadway.com\n\nBOTTOM LINE Magnificent Washington, stunning revival\n\nThe Newsday app makes it easier to access content without having to log in.\n\nUnlimited Digital AccessOnly 25¢for 6 months",
  "isFullReview": true,
  "textWordCount": 516,
  "archivePath": "data/archives/reviews/a-raisin-in-the-sun-2014/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:21:09.493Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 516,
  "tierReason": "Full review text"
}