{
  "showId": "a-raisin-in-the-sun-2014",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "http://www.nydailynews.com/entertainment/music-arts/raisin-sun-theater-review-article-1.1742462",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/music-arts/raisin-sun-theater-review-article-1.1742462",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "ExpandDenzel Washington and Sophie Okonedo in “A Raisin in the Sun”\n\nDenzel Washington's popularity makes the revival of \"A Raisin in the Sun\" a hot ticket, but there's a better reason: He and the show are flat-out excellent.\n\nReprising Sidney Poitier's role, Washington is stunning as the dreamer-schemer Walter Lee Younger, whose frustration throbs at the heart of an American classic that is as deeply humorous as it is affecting.\n\nThe Oscar and Tony winner squeezes this juicy role with all his might, yet also melds seamlessly with his fellow actors.\n\nThat's the way it should be. The women in Walter Lee's life — his mother Lena, wife Ruth and sister Beneatha — are just as integral to this story of three generations of black struggle.\n\nFrom left, Sophie Okonedo, Denzel Washington and Anika Noni Rose in “A Raisin in the Sun”\n\nLorraine Hansberry's 1959 drama — enduring and solid as they come — took shape as the civil rights movement gained steam but was still uncertain.\n\nGuided by director Kenny Leon, performances are natural and lived-in, giving the audience the feeling that they're overhearing private conversations. But listening — and really heeding — is the point.\n\nLeon forces us to use our ears. We sit in the dark just as the play is about to start and we hear a tape of Hansberry and Studs Terkel discussing her play and its still-relevant issues.\n\nDenzel Washington and LaTanya Richardson Jackson in “A Raisin in the Sun” at the Ethel Barrymore Theatre\n\nLights come up and the sterling cast — principals and supporting actors — let \"A Raisin in the Sun\" speak for itself as it tackles timeless themes of race, God and roots.\n\nThe story spins around an inheritance of $10,000, or about $100,000 today. The money is willed to Lena (a wonderful LaTanya Richardson Jackson) by her late husband — and she plans to use it to move the whole family into a white suburb. But there are bumps along the way.\n\nJackson brings dignity, strength and laughter, while Anika Noni Rose charms with contagious exuberance as Beneatha, who wants to be a doctor and to learn more about her African heritage.\n\nAs Walter's long-suffering wife, Ruth, the sublime Sophie Okonedo wears a haunted expression that conveys a world of ache. It's almost a shock when she smiles.\n\nFrustration adds years to anyone's mug. So it's no big deal that 59-year-old Washington is two decades older than Walter Lee. Like a walking mood ring, Washington's performance registers the colors of joy, despair, fury and determination.\n\nAs the play ends, streaks of sky crack through apartment walls. Those patches of blue might hint at hope. Or maybe bright spots that hover out of reach.\n\nSuch uncertainty makes Hansberry's smart and discomforting drama as relevant and resonant as today's headlines.",
  "isFullReview": true,
  "textWordCount": 469,
  "archivePath": "data/archives/reviews/a-raisin-in-the-sun-2014/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:21:49.654Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230329072037",
  "archiveOrgUrl": "http://web.archive.org/web/20230329072037/https://www.nydailynews.com/entertainment/music-arts/raisin-sun-theater-review-article-1.1742462",
  "contentTier": "complete",
  "wordCount": 469,
  "tierReason": "Full review text"
}