{
  "showId": "the-king-and-i-2015",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Jason Clark",
  "url": "http://www.ew.com/article/2015/04/16/the-king-and-i-lincoln-center-broadway-ew-review",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "If this production has put the romantic passion of the tale on a bit of simmer, it has boosted the overall theme of intersocietal behavior and respect. 'Getting to Know You', for example, has never seemed more relevant to the score. In this production, it's not a mere classroom charm-song one-off, but an outward reflection of the uneasy feelings the characters are struggling with in that moment...The gender politics involving Anna, Lady Thiang and Tuptim also feel deeply resonant here. Without hammering away at the point too impulsively, Sher's intents seem to sway the story back to a uniquely feminist state of mind...Watanabe is a charismatic and relatively subdued King, but often very hard to decipher; his big number 'A Puzzlement' ends up being just that. Strangely though, the latter's surface debit sometimes works to some advantage--after all, the King is a man struggling with the ability to fully connect to others. O'Hara could bring out the romantic swoon in just about any male costar, and Anna is another triumph in her winsome recent gallery of fine portrayals. (And hearing her luscious soprano on beauties like 'Hello, Young Lovers' is like finding a precious gift inside a jewel box.)",
  "bwwScore": 9,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-KING-AND-I-Opens-on-Broadway-Updating-LIVE-20150416",
  "showScoreExcerpt": "\"If you’re quite sure of the lengths that can be achieved on Lincoln Center's stage, you’ll need to think again after witnessing Bartlett Sher’s breathtakingly appointed take on 'The King and I'...Judiciously stops short of fetishizing Eastern culture...It has boosted the overall theme of intersocietal behavior and respect...Sher’s intents seem to sway the story back to a uniquely feminist state of mind.\"\n\nRead more"
}