{
  "showId": "the-king-and-i-2015",
  "outletId": "timeout",
  "outlet": "Time Out New York",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/the-king-and-i",
  "publishDate": "April 16, 2015",
  "fullText": "This lavish revival of Rodgers and Hammerstein's 1951 musical is a feast for the eyes and ears, with Kelli O'Hara delivering a luminous performance as Anna.",
  "isFullReview": false,
  "dtliExcerpt": "This lavish revival of Rodgers and Hammerstein's 1951 musical is a feast for the eyes and ears, with Kelli O'Hara delivering a luminous performance as Anna.",
  "originalScore": 80,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "...in a year of bland nostalgic revivals, this grand and glorious production gives you hope in the nonprofit stewardship of our theatrical heritage...let's be frank: Although Hammerstein's characterization of the King has pain and pathos in addition to comic bluster, he speaks a pidgin English that few actors can pull off today. Luckily, the Japanese Watanabe shows a man struggling with a foreign tongue. (His accent can be thick, but that adds authenticity.) The 55-year-old Watanabe also cuts an older figure than Lou Diamond Phillips did in the 1996 revival, which adds gravitas as well as humor to his outbursts and temper tantrums. O'Hara sounds angelic as ever...her silky, shimmering soprano a treasure -- and the role plays to her strengths: wryness, warmth and quiet dignity. Sher directs her and the rest of an exceptionally good cast...with palpable respect for the material and a care to avoid orientalist humbug.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This lavish revival of Rodgers and Hammerstein's 1951 musical is a feast for the eyes and ears, with Kelli O'Hara delivering a luminous performance as Anna.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (26 words)",
  "textQuality": "truncated",
  "playbillVerdictUrl": "http://www.timeout.com/newyork/theater/the-king-and-i",
  "sources": [
    "web-search",
    "bww-reviews",
    "playbill-verdict",
    "show-score-playwright",
    "bww-roundup"
  ]
}
