{
  "showId": "once-upon-a-one-more-time-2023",
  "outletId": "broadwaynews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.broadwaynews.com/review-once-upon-a-one-more-time-thrillingly-weds-fairy-tale-princesses-and-pop/",
  "publishDate": null,
  "fullText": "The musical of Britney Spears songs hits all the right notes of zaniness, creativity and unbridled joy. Liberation sits at the foundation of our favorite pop songs, and few superstars have more to say about freedom than Britney Spears. The Mississippi-born singer held on to juggernaut status in the pop arena for over a decade with an ample discography of hits she now lends to the new Broadway musical “Once Upon a One More Time.” But the music is where all direct connections to my namesake end. The plot instead centers on a group of old-school princesses, including Cinderella (Briga Heelan), Snow White (Aisha Jackson), Little Mermaid (Lauren Zakrin) — the gals — whose lives change when the Original Fairy Godmother (Brooke Dillman) introduces “The Feminine Mystique” to their book, err sorry, scroll club. Friedan’s words tug at Cinderella’s already hankering suspicion that there is more to “happy ever after.” But the princess posse has to deal with obstacles in the form of their omnipotent male Narrator (Adam Godley) and Cinderella's Stepmother (Jennifer Simard, already gunning for her third Tony nomination with this deliciously vampy performance), who swiped the manifesto. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 202,
  "archivePath": "data/archives/reviews/once-upon-a-one-more-time-2023/broadwaynews-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:29:45.278Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 202 (min: 300)"
  ]
}