{
  "showId": "once-upon-a-one-more-time-2023",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/theater/theater-reviews/once-upon-a-one-more-time-review-britney-spears-justin-guarini-briga-heelan/",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nOnce Upon a One More Time review: Justin Guarini and Briga Heelan charm in Britney Spears musical\nA group of fairytale princesses discover there's a lot more to life than marrying a prince in the jubilant new jukebox musical.\n\nOh baby, baby, how were the fairytale princesses of yore supposed to know that something wasn't right about their happily ever afters?\n\nThe Grimms Girlies — including Cinderella (Briga Heelan), Snow White (Aisha Jackson), Rapunzel (Gabrielle Beckford), and more — are officially closing the book on their \"deeply problematic\" storylines once and for all in Once Upon a One More Time, a jubilant jukebox musical opening June 22 at the Marquis Theatre.\n\nThe musical, which was authorized by a post-conservatorship Britney Spears and features some of her greatest hits, isn't your run-of-the-mill rendition of the pop princess' life story. Instead, it sets up its wildly whimsical premise straight out of the gate: Each night, a princess is selected to act out her whirlwind romance as a bedtime story for children around the world. However, it's clear that tonight's protagonist, Cinderella, isn't as charmed by glass slippers and glittering gowns as the rest of her companions. After finishing her story, she tentatively asks Prince Charming (Justin Guarini) if he ever wants… you know… something more than just pumpkins and proposals?\n\nThe idea is nothing short of blasphemy to the Prince's ears — \"You're paid to be pretty and I'm paid to be charming,\" he tells her, prompting Cinderella to ask, \"You're being paid?\" — but it's exactly what the Notorious O.F.G (Brooke Dillman), the Original Fairy Godmother, has been longing to hear in the neon-soaked, happy-go-lucky kingdom brought to life by set designer Anna Fleischle.\n\nShe bequeaths Cinderella a copy of Betty Friedan's 1963 novel The Feminine Mystique, that opens her eyes to a world beyond never-ending household chores, evil stepmothers, and self-centered princes. After sharing the novel with her Scroll Club pals, Cinderella suddenly finds herself at the forefront of a full-scale royal rebellion against the dastardly Narrator (Adam Godley), who demands that all roles be performed exactly as written, and their frustratingly outdated folk tales.\n\nBook writer Jon Hartmere reimagines the heroines and their stories under a new, Gen Z-inspired lens that is equally as hilarious as it is self-aware. He makes no qualms about pointing out how brutal the fables used to be — with Cinderella's Stepmother (Jennifer Simard) waxing nostalgic about the good ol' days when she would cut off her daughter's toes — and the real-life implications they continue to have on readers, as Cinderella frets that her and her pals have all been peddling a \"warped version of the real world\" to impressionable children for centuries.\n\nTheir self-discovery journey is perfectly soundtracked by Spears' sparkling discography, which transforms the musical into a high-octane concert that will leave theatergoers breathless. While Spears' songs are no stranger to the Broadway stage — several of her hits are incorporated in other shows currently playing across the Great White Way — they take on new life in Once Upon a One More Time with a few lyrical twists that succeed in not only reframing their meanings, but also preventing theatergoers from unconsciously singing along too (\"Toxic\" will never not be catchy, okay?).\n\nIn turn, Hartmere's story beats are all precisely timed to each beat drop, like when Belinda (Amy Hillner Larsen) and Betany (Tess Soltau) command Cinderella to clean the mansion as they sing a hilarious rendition of \"Work Bitch,\" or Charming's side-splitting, absolutely outrageous performance of \"3\" as he frantically learns how to read so he can impress Scroll Club.\n\nThe performances are bolstered by inspiring choreography from Keone and Mari Madrid, who are also working double duty as the musical's directors. The couple — who have choreographed for BTS, Justin Bieber, and So You Think You Can Dance — have crafted a collection of high-energy routines that not only drew audible reactions from the crowd, but whipped them into a frenzy that led to several pauses for applause throughout the evening. As directors, the pair keep its story moving at an equally speedy gait, never pausing for longer than necessary before diving headfirst into the next musical number.\n\nBeing able to perform the demanding routines alone and sing Spears' iconic songs is a hefty challenge, but it's one that Once Upon a One More Time's talented cast more than rises to meet. Guarini is phenomenal as the delightfully smarmy Charming, a role which highlights both his comedic chops and dominating stage presence as he powers through sensational renditions of \"Circus\" and \"Oops! … I Did it Again,\" the latter of which incorporates Spears' original choreography.\n\nHeelan, in her Broadway debut, maintains Cinderella's starry-eyed innocence and warmth without ever making her feel out of touch, and her celebratory \"Brightest Morning Star\" duet with Jackson's stellar Snow White is one of the most stunning performances of the evening. Hooray for female friendships getting the love and respect they rightfully deserve!\n\nWhile its main conflict may resolve itself a bit too easily in the end — not unlike its source material — Once Upon a One More Time is a youthful, exuberant take on beloved tales that's more dazzling and polished than Cinderella's glass slipper. Expect to keep on dancin' long after the musical ends. Grade: B+",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 887,
  "archivePath": "data/archives/reviews/once-upon-a-one-more-time-2023/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:32:31.588Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee"
}