{
  "showId": "once-upon-a-one-more-time-2023",
  "outletId": "exeuntnyc-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://exeuntnyc.com/reviews/review-once-upon-a-one-more-time-at-the-marquis-theatre/",
  "publishDate": null,
  "fullText": "Loren Noveck is not wooed by the combination of Britney Spears and happy ever after. Justice Moore, Mikey Ruiz, Selene Haro, and Joshua Daniel Johnson in Once Upon a One More Time. Photo: © Matthew Murphy I’m usually a sucker for a fractured fairy tale or a feminist spin on the classics. And yet Once Upon a One More Time, a new musical “based upon the music performed and recorded by Britney Spears” left me cold, frequently bored, and occasionally annoyed enough to verge on outrage. (One imagines the contract negotiations by which they came up with the precise phrasing by which the music–most of which Spears didn’t write–is credited might have a plot as complex as the show itself.) Derivative where it’s not baffling, and paper thin where it’s not derivative, Once Upon a One More Time can’t even pull off the baseline achievement of jukebox musicals: make the songs sound good. There’s two kinds of jukebox musicals—the biopic, where the goal is to make the songs sound like the original artists’ versions, and the book musical, where the goal is to make the songs sound like they belong in musical theater. To build the latter, you’re either shoehorning song into story or carefully constructing a scaffolding of story around the songs; either way, it requires a good bit of suspension of disbelief. But while I might have remained unconvinced by the narrative infrastructure of Jagged Little Pill or Head Over Heels or even Enda Walsh’s Lazarus musical, there was enjoyment to be found in hearing the way those familiar songs had been arranged and sung by gifted singers in another musical genre. You don’t even get that here. The arrangements are thin and flat, rarely for more than one voice. And rather than let the audience enjoy the slightly silly way in which the songs have been levered into the narrative, book writer Jon Hartmere soups up the lyrics to reference fairy tales, but in the same generic pop vocabulary as the originals. They haven’t become musical theater songs; they don’t say anything about character–they just now mention “once upon a time” and the like. (And on top of that, the sound mix is so murky that from the fifth row it was often impossible to tell who was singing.) But if the songs have been rethought with a little too much dogged literalness for the show’s fairy tale setting, everything else has become so meta that the whole show feels like a giant wink at the audience, in which we’re somehow also supposed to find rousing female empowerment as the heroines of a grab bag of classic tales break free of their preordained narrative, and a little bit of heart (a teeny queer love-at-first-sight story between a secondary prince and one of Snow White’s lesser-known dwarfs; Ryan Steele and Nathan Levy do their best to make us believe someone in the show has a genuine emotional connection). We’re backstage on the fairy tale lot, where all our familiar characters play out all their familiar tales, night after night, for the benefit of little children enjoying their favorite bedtime stories. Our Narrator (Adam Godley) rules as maestro, setting the players to work. Only Cinderella (Briga Heelan) is just a little dissatisfied. A little lonely. A little unsure if Prince Charming (Justin Guarini of American Idol fame) is enough. If this is really happy ever after. She has a book club (scroll club, don’t ask) with the rest of the gang of fairy tale heroines: her best friend Snow White, beautiful but a little dim (Aisha Jackson); Sleeping Beauty (Salisha Thomas at the performance I saw); Rapunzel (Gabrielle Beckford); the Little Mermaid, who for some reason has given up her voice but still has her mermaid tail and can still sing even though she can’t speak (Lauren Zakrin); Princess Pea (of “The Princess and the Pea” fame; Morgan Whitley seems to be having a great deal more fun than the other princesses even if her princess is entirely lacking in character). But when the OFG (Original Fairy Godmother, played by Brooke Dillman, who gets saddled with most of the feminist messaging and exposits it with gusto) shows up with a copy of The Feminine Mystique, Cin is inspired to take the squad and break out of Fairyland in search of OFG’s mystical homeland of Flatbush. (Spoiler alert: they don’t make it.) For a longish show, not much happens. Cinderella and the gang dither about their next move and expound on the power of friendship; the various heroines one at a time discover they’re all being wooed by the same prince (this is where “Oops, I Did It Again” comes into the mix). Cinderella’s stepmother (Jennifer Simard) and stepsisters (Amy Hillner Larsen and Tess Soltau) show off their nasty act. But none of it feels honest, let alone original. Sondheim used the gimmick of Guarini’s dim but cocky “princessizer” first in Into the Woods, with more snark and more charm. As deliciously bitchy as Jennifer Simard’s stepmother is, she owes a lot to Cruella; likewise, Heelan’s Cinderella reminds one of Amy Adams in Enchanted. Even the attempts to give the princess realm a little twenty-first-century social conscience feel ill-thought-out. Snow White and Rapunzel are Black here, but they’re still the sassy and none-too-bright Black sidekicks to Cinderella’s pretty princess. There’s a gay love story, but one of the lovers is the bizarre creation of Clumsy, Snow White’s dwarf houseboy. Cinderella’s stepsisters may develop a shred of a conscience in the end, but they’re still “ugly”–translated here as noticeably heavier than the core princesses. And in the end, the Narrator still has to give his approval in order for Cinderella and the other women to rewrite their stories. Keone and Mari Madrid are best known as choreographers, and it often seems that they don’t entirely know how to direct actors (the director David Leveaux is credited as a creative consultant). So it’s no surprise that the dancers are the true standouts here–I constantly found myself watching Justice Moore and Joshua Daniel Johnson. But while the hard-hitting hip-hop choreography works on its own–and would be great in an actual Britney Spears concert–it feels pretty divorced from the world of the show. The whole edifice feels as if it’s built on lazy shortcuts, including design elements that are overly fussy without a lot of purpose: there’s a tendency to throw flashy lights (Kenneth Posner) and dizzying projections (Sven Ortel) and a costume change at every slack moment. (Loren Elstein’s sequin-bedecked costumes may evoke Britney Spears costumes, but also add a cacophony of color.) The princesses may get to rewrite their “happy ever after” endings without the philandering Prince (who also gets to defend himself, btw, with the excuse that he’s just as trapped by the story as they are) but there’s not even an attempt to show what that self-determination would look like. I’m all for a good book club, but it’s hardly the be all and end all of feminist empowerment–but it’s pretty much all Once Upon a One More Time can think of. Loren Noveck is a writer, editor, dramaturg, and recovering Off-Off-Broadway producer, who was for many years the literary manager of Six Figures Theatre Company. She has written for The Brooklyn Rail, The Brooklyn Paper nytheatre.com, and NYTheater now, and currently writes occasionally for HowlRound and WIT Online. In her non-theatrical life, she works in book publishing. Read more articles by Loren Noveck",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1244,
  "archivePath": "data/archives/reviews/once-upon-a-one-more-time-2023/exeuntnyc-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:32:37.917Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_read_more_prompt",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}