{
  "showId": "once-upon-a-one-more-time-2023",
  "outletId": "nystagereview-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nystagereview.com/2023/06/22/once-upon-a-one-more-time-what-youre-tired-of-fairy-tale-musicals/",
  "publishDate": null,
  "fullText": "★★★☆☆ The songs of pop star Britney Spears fuel this latest campy musical exercise in fairy tale revisionism. For the first time in more than four decades, there are no shows with music by Andrew Lloyd Webber currently playing on Broadway. There are, however, no less than three current musicals featuring the songs of Britney Spears, including Moulin Rouge, & Juliet, and now Once Upon a One More Time, the score of which consists entirely of numbers originally recorded by the pop star. Consider it the “Toxic Invasion.” I’ll leave it to the theater historians and pundits to debate the ramifications of this turn of events in Broadway musical theater. My job, such as it is, is to report on how well the show’s creators succeed in fulfilling their artistic aspirations. Of course, that’s assuming they have any. Based on the fact that it distributes free glowing bracelets to every audience member to wave in the air for the inevitable megamix during the curtain call, they’re not exactly straining for Sondheim-level depth. [Read Sandy MacDonald’s ★★★☆☆ review here.] Rather, they simply want their target audience to have a good time; not, as the characters in Seinfeld used to sheepishly say, that there’s anything wrong with that. The problem is that this latest revisionist exhumation of fairy tales arrives shortly after such superior examples of the burgeoning genre as the recent revival of Into the Woods and & Juliet (not a fairy tale, I know, but it feels like one) and such far worse examples as Bad Cinderella. It’s beginning to seem as if Broadway is less a destination for the tired businessman than the tired tyke who didn’t get in their nap. Not that they’d be able to sleep through this show if they tried, since the volume is pumped up to the sort of deafening levels you’d expect at, well, a Britney Spears concert. That the main plot element of Jon Hartmere’s book is Cinderella asserting her self-identity after being introduced to Betty Friedan’s The Feminist Mystique by her “O.F.G.,” or Original Fairy Godmother (a very funny Brooke Dillman), gives you an idea of how weird it is. (I’d love the see the Venn diagram detailing the intersection between Spears and Friedan fans.) Before Cinderella (Briga Heelan) has the chance to share Friedan’s ideas with her fellow fairy tale characters Snow White (Aisha Jackson), Rapunzel (Gabrielle Beckford), Sleeping Beauty (Ashley Chiu), the Little Mermaid (Lauren Zakrin), Princess Pea (Morgan Whitley), the book is seized by her wicked Stepmother (Jennifer Simard, uproarious). Needless to say, Cinderella is less inclined to appreciate the romantic overtures of Prince Charming (Justin Guarini), especially when she finds out he’s also been wooing Sleeping Beauty (which amusingly provides the cue for him to sing “Oops! I Did It Again.”) Meanwhile, Prince Erudite (Ryan Steele) finds himself swooning over Clumsy (a charming Nathan Levy) despite his diminutive height, in a cute subplot that elicits happy “Ooohs” from the audience when the couple finally kisses. “Who is that short drink of water whistling while he works?” the inaccurately named Erudite asks when he first spots Clumsy. The proceedings, which thanks to the sterile, projection-heavy scenic design looks like they take place less in an enchanted kingdom than an understocked Apple Store, are presided over by a very cranky Narrator (Adam Godley, whose last Broadway appearance was in the rather different The Lehman Trilogy). To say more about the storyline would only serve to distinguish it. But it does provide the opportunity for a plethora of gags — some funny, many not — including, for some reason, lots of jokes referencing the Brooklyn neighborhood of Flatbush. (I mean, “Gowanus” is funnier, and “Dumbo” seems more appropriate). And, of course, it features more than twenty songs associated with Spears, ranging from hits (“Baby One More Time,” “Womanizer,” “Lucky,” “Circus”) to deep cuts that nearly everyone in the audience seemed to recognize, many of them with tweaked lyrics to make them fit better into the narrative. The musical highlight was Simard’s pull-out-the-stops rendition of “Toxic” in the second act, which was both powerfully sung and utterly in keeping with the character of the Stepmother. Heelan, a veteran television performer (Great News, B Positive) making her Broadway debut, is a charming if vocally underpowered Cinderella, especially compared to Jackson’s take-no-prisoners Snow White. Justin Guarini proves hilarious as Prince Charming, not only landing every joke but also singing and dancing with dazzling virtuosity. For one number, he even proves himself a semi-capable magician. Zakrin is endearing as the Little Mermaid, but she benefits greatly from the fact that her character doesn’t speak. But much like Carolee Carmello did in Bad Cinderella, Simard steals the show with her hilarious turn as the Stepmother, demonstrating that theater actresses should forget aspiring to play Lady Macbeth and instead brush up on their Brothers Grimm. Married directing team Keone and Mari Madrid, making their Broadway debut, don’t handle the book scenes as well as the musical numbers, for which they also provided the incredibly energetic choreography that would put most Super Bowl halftime shows to shame. It’s all a bit much, frankly, but then again, it’s not like anyone was expecting waltzes. Oh, and just in case you were wondering, the producers of Once Upon a One More Time take pains to assure us in the press release that the musical was “fully authorized by Britney Spears post-conservatorship.” Which is probably the last thing we need to worry about when it comes to Britney Spears. Once Upon a One More Time opened June 22, 2023, at the Marquis Theatre. Tickets and information: onemoretimemusical.com Frank Scheck has been covering film, theater and music for more than 30 years. He is currently a New York correspondent and arts writer for The Hollywood Reporter. He was previously the editor of Stages Magazine, the chief theater critic for the Christian Science Monitor, and a theater critic and culture writer for the New York Post. His writing has appeared in such publications as the New York Daily News, Playbill, Backstage, and various national and international newspapers.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1015,
  "archivePath": "data/archives/reviews/once-upon-a-one-more-time-2023/nystagereview-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:38:14.468Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}