{
  "showId": "once-upon-a-one-more-time-2023",
  "outletId": "observer",
  "outlet": "Observer",
  "criticName": "David Cote",
  "url": "https://observer.com/2023/06/review-once-upon-a-one-more-time-wont-leave-britney-alone/",
  "playbillVerdictUrl": "https://observer.com/2023/06/review-once-upon-a-one-more-time-wont-leave-britney-alone/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "Once Upon a One More Time | 2hrs 30mins. One intermission. | Marquis Theatre | 210 West 46th Street | 212-307-4100 By clicking submit, you agree to our <a href=\"http://observermedia.com/terms\">termsice</a> and acknowledge we may use your information to send you emails, product samples, and promotions on this website and other properties. You can opt out anytime. Somewhere in the middle of Once Upon A One More Time, the family-friendly, fractured fairy tale, feminist-ish jukebox musical cobbled around Britney Spears songs, I had a vision of Broadway’s future. The street itself will be under five feet of water, but the shows to which crowds will eagerly paddle? Singing princesses. All of the eight surviving Broadway houses (the rest were burned down in the Sondheim Riots) will host some combination of pop music and girlboss revisionist myth. Wicked, Six, and & Juliet are still running; Bad Cinderella is back, with VR headsets; and Disney manufactured the rest—AI-sicals, naturally. Baby, baby, I jest. Once Upon A One More Time (OUAOMT?!?) is hardly the beginning of the end. Repackaging hit tunes with pretty girls is as old as Flo Ziegfeld and his Follies. What’s new (not really) is the middle finger to heteropatriarchy. A group of classic fairytale princesses (Snow White, Rapunzel, et al.) rebel against their oppressive Narrator and faithless Prince, ultimately busting out of their happy-ever-after corsets. “We’re not here to make fairy tales,” the Narrator huffs. “We’re here to follow them.” Betty Freidan’s The Feminine Mystique lands in Cinderella’s hands and starts a revolution among the royal maidens. Even that flipped script is a tame move. Young women in 2023 are not modeling their identity on the Brothers Grimm or Uncle Walt’s movies; they grow up today knowing that gender roles and orientation are, at best, sketchy suggestions. Their parents, on the other hand, might giggle at the Freidan gags. If the new Barbie satirizes the iconic doll discovering mortality and freedom, the chuckles are strictly for the adults in the room; the kids are Okay-Boomer-ing and slipping chunky headphones on. Book writer Jon Hartmere’s premise is contrived bordering on cringe. A Little Girl (Mila Weir) walks onstage and opens her book of fairy tales. Instantly, in some land of folkloric make-believe, the British and stodgy Narrator (Adam Godley) appears, ordering the princesses to audition for their lives; if the girl picks their tale, they get to perform. And so, a half-dozen damsels beg in silken, seductive tones for a child’s attention using Spears’s “Baby One More Time,” a song—I surmise—about a teenager beseeching her ex to call her or… do something else. “Show me how you want it to be, tell me baby,” the storybook sirens croon at their prepubescent reader. “Pick me baby, one more time.” Yeah, don’t think about it too hard. Admittedly, fairy tales, like teen pop, have always been safe spaces for the young to explore fears and desires. The more suggestive lyrics have been watered down so as not to prompt uncomfortable questions on the ride home. Hartmere’s editorial interventions are most noticeable in “Work Bitch,” Spears’s EDM bop from 2013’s Britney Jean. Cinderella (Briga Heelan) suffers taunts from her nasty stepsisters Belinda (Amy Hillner Larsen) and Betany (Tess Soltau) alongside the evil Stepmother (Jennifer Simard). The original: “You want a hot body? You want a Bugatti? You want a Maserati? You better work, bitch.” The Broadway version: “You want the pretty dresses / You wanna make the messes / You wanna hear the yesses / You better work, bitch.” Admiration for Britney’s lyrical sophistication was not on my bingo card. Nor did I expect to yearn for a jukebox bio-musical about her. But instead of a gutsy, passionate recounting of the pop star’s stardom, struggles, and fight for control over her legacy and wealth, we have a marketing gimmick. Impale the bait of a blockbuster catalog on a feminist and queer hook (a spare prince falls in love with one of the Seven Dwarfs) and reel in a cross-generational revenue stream. At least the cast is full of appealing pros and fiercely well-executed breakdance sequences choreographed by Keone and Mari Madrid, the husband-and-wife team who also directed the candy-colored live cartoon. Keyed to the beat of Britney’s tunes (among them, “Toxic” and “Circus”) the ensemble rips through torrents of toprock, downrock, and freezes with virtuosic brio. Between these “insane dance breaks” (per the script, and accurate) there’s a sporadically funny farce about the gals getting revenge on Prince Charming (Justin Guarini) who has been two-timing all of them, and Cinderella’s brave rejection of her fairytale life (cue the glass slipper exploding into a shower of glitter). But the empowerment narrative is emotionally uninvolving, the sisterhood between Cinderella and Snow White (Aisha Jackson) superficial. As with the late, unlamented Bad Cinderella, seasoned character actors are the secret weapons: Simard’s boozy, sadistic Stepmother sounds like Jennifer Coolidge doing an impression of Lorne Michaels. As the Original Fairy Godmother who introduces Cinderella to Friedan, Brooke Dillman is the perfect peppy, daffy aunt—Mame Dennis if she lived in Flatbush with her girlfriend. Comic divas and spectacular dances help pass the time, but the real show-stealer is Guarini’s blissfully vain Prince Charming. Guarini may be 44 but he pops and locks like a b-boy half his age. (Dude’s American Idol debut was 21 years ago. Feeling old?) The production’s standout triple threat, he breaks, sings, and nails the laughs. Caught cheating by Snow White, the philandering cad breaks into a cocky, mock contrite “Oops! . . . I Did It Again” making wolf ears with his hands and scampering around the stage. That’s about when you mentally airlift Guarini out of this garish trifle and set him into the national tour of Into the Woods—which stands in relation to One More Time as The Shining does to Saw 7: The Final Chapter. Princesses the least active or interesting figures on stage? That’s something Britney would never allow.",
  "isFullReview": true,
  "textWordCount": 988,
  "archivePath": "data/archives/reviews/once-upon-a-one-more-time-2023/observer--david-cote_2026-02-01.html",
  "textFetchedAt": "2026-02-01T23:43:15.748Z",
  "designation": "Recommended",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}