{
  "showId": "once-upon-a-one-more-time-2023",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/OnceUponaOneMoreTime.html",
  "publishDate": null,
  "fullText": "Broadway Reviews\n \n\n Once Upon a One More Time\n\n\nTheatre Review by Howard Miller - June 22, 2023\n\nOnce Upon a One More Time. Based on the music performed and recorded by Britney Spears. Book by Jon Hartmere. Directed and choreographed by Keone & Mari Madrid. Creative consultant David Leveaux. Scenic design by Anna Fleischle. Costume and hair design by Loren Elstein. Lighting design by Kenneth Posner. Sound design by Andrew Keister . Projection design by Sven Ortel. Wig design by Nikiya Mathis . Air sculptor Daniel Wurtzel. Associate director J.V. Mercanti. Associate choreographer Isidro Rafael. Music supervisor and coordinator Patrick Vaccariello. Music producer Matt Stine. Music director Ben Cohn. Orchestrations by James Olmstead and Matt Stine. Vocal arranger Nadia DiGiallonardo. Dance arranger James Olmstead.\nCast: Briga Heelan, Justin Guarini, Jennifer Simard, Adam Godley, Brooke Dillman, Aisha Jackson, Amy Hillner Larsen, Tess Soltau, Mila Weir, Gabrielle Beckford, Ashley Chiu, Nathan Levy, Ryan Steele, Morgan Whitley, Lauren Zakrin, Liv Battista, Pauline Casi&ntilde;o, Selene Haro, Joshua Daniel Johnson, Salisha Thomas, Justice Moore, Kevin Trinio Perdido, Mikey Ruiz, Jacob Burns, and Stephen Scott Wormley.\nTheater:  Marquis Theatre, 211 West 45th Street (Between Broadway and 46th Street)\nTickets:  Ticketmaster\n\n\nThe Cast Photo by Matthew MurphyBehold a recipe for Broadway Surprise Cake. Start with a distillation of Into the Woods. Incorporate two heaping tablespoons of Six. Add a generous dash of & Juliet and another of Wicked. Blend in a hearty helping of twentieth century feminism. Stir it all together, and then dredge everything in the music of a well-known pop singer. Et voil&agrave;! You've got yourself a little something called Once Upon a One More Time, opening tonight at the Marquis Theatre.\n\nAll right. I can see you rolling your eyes (OMG, not another derivative, mishmash of a jukebox musical!). But best unroll them, because, against all odds, Once Upon a One More Time, which is being touted in attorney-speak as \"fully authorized and licensed post-conservatorship by Grammy Award-winning pop icon Britney Spears,\" is a surprisingly tasty treat, both for the eyes and for the ears.\n\nBet you didn't see that coming. But, miraculously, the show, with a book by Jon Hartmere and based on music \"performed and recorded\" by Spears, has sidestepped just about every potential pothole in its path and has found a formula that might very well turn it into a major hit. So Bibbidi Bobbidi Boo to all the skeptics and naysayers out there. Once Upon a One More Time is as comfortable in its shoes as Cinderella is in her glass slippers.\n\nHmm. Perhaps I'll have to convince you. After all, didn't we just see a less-than-successful musical twist on the Cinderella tale that came and went like a phantom in the night? And yet, here we are again. Cinderella is back, this time with her gal pals Snow White, Rapunzel, Sleeping Beauty, Princess Pea, Little Mermaid, Belle, Esmerelda, Gretel, Goldilocks, and Red Riding Hood. All of them seemingly are trapped for eternity, forced to relive their well-worn stories over and over and over again, just to please children like Little Girl (a rotating role, Mila Weir appeared at the performance I attended). Not to mention the fact that they are in thrall to the all-powerful Narrator (Adam Godley), who will brook no disobedience or variation from the expected.\n\nNot that disobedience is on anyone's mind as they await backstage in the world of fairy tales for the call to take their place, just as soon as Little Girl decides which story will be on the menu for tonight. What always was is what always will be. And so, it's story told, child asleep, and \"happily ever after\" as the gang is dismissed to hang around until tomorrow night.\n\nJustin GuariniPhoto by Matthew MurphyBut a totally predictable life, in which you are expected to smile and be pretty and to show up and play your dutiful part, is beginning to gnaw at our Cinderella (Briga Heelan). There must be more to live for than going to balls and falling into the arms of a handsome prince. Cue the fairy godmother (Brooke Dillman, an astute and sunny delight), generally referred to as \"Notorious O. F. G.,\" who bestows upon Cinderella not a gown and pumpkin coach, but a copy of Betty Friedan's \"The Feminine Mystique.\" And before you can say \"Equal Rights Amendment,\" the fairy tale princesses' eyes are open to the possibilities beyond the walls of their confinement. Plotwise, it's a little unusual, and perhaps some audience members may need a brief history lesson on Friedan and her 1963 book. Still, it works to hold the show together.\n\nBut what makes Once Upon a One More Time rise above your typical jukebox musical is a combination of outstanding talent and a genuine spirit of collaboration among the cast and creative team. There is not a prima donna in sight. Everyone gets the opportunity to shine, whether they are in a leading role or in a supporting one. The underlying questions about the cast members seem to have been, \"who can sing this song the best? Who can dance this number the best?\"\n\nBriga Heelan as Cinderella ostensibly has the leading role, but there is nothing explosive about her performance, nor should there be. She is the calm and popular leader of the rebellion, the first to understand the implications of \"The Feminine Mystique\" and the one who is able to get the others to follow, even against the threat of banishment to the desolate world of \"Story's End.\" It's not for nothing that Notorious O. F. G. pegged her for the job; as she puts it, \"I've been waiting forever for a princess in this kingdom to ask for something that didn't involve fabric.\"\n\nIn this spirit, let's talk about Justin Guarini as Prince Charming. Remember, this is a show about female empowerment. Yet it is Guarini who blows us away every time he sings or dances (His \"Oops!...I Did It Again\" is an absolute star turn). Still, he is there to play the role, and, audience cheers notwithstanding, he stays fully and effectively in character as the clueless male lead. In a similar vein, the always marvelous Jennifer Simard makes for a particularly nasty Stepmother, whether it's joining with her daughters Betany (Tess Soltau) and Belinda (Amy Hillner Larsen at the performance I attended) in the inordinately appropriate \"Work Bitch\" or setting the house ablaze with her rendition of \"Toxic.\" Stepmother may be showing off in order to manipulate the others, but we never feel that Simard is hogging the spotlight.\n\nThis is true of every single performer. Teamwork all around. It is also true of the design elements, from the colors that go from fairy tale pastels to the darkness of \"Story's End\" at the drop of a hat, and from the costumes that change as attitudes change, from recognizably in princess character to contemporary club wear. Directors/choreographers Keone and Mari Madrid, making their Broadway debut, have done wonders keeping everything flowing smoothly and have provided a buoyant array of club dances that, likewise, are flawlessly executed.\n\nI honestly don't know how he did it, but Jon Hartmere, the bookwriter, has managed to make this \"fractured fairy tale\" wrap seamlessly around Britney Spears' songs, so that it is all of a piece. And if he has dipped his quill into territory carved out by other shows (three of the numbers are also incorporated into the score of & Juliet, another successful jukebox musical), it all somehow works, the kind of magic only a fairy godmother could produce.\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n                  \n\n                                                  \n                \n              \n            \n          \n        \n      \n    \n  \n\n\n\n\n\n\n\n\n    \n    \n    \n                \n                \n                \n\n            \n             \n            \n                \n                    \n                        Share:",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1260,
  "archivePath": "data/archives/reviews/once-upon-a-one-more-time-2023/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:42:41.552Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250605035507",
  "archiveOrgUrl": "http://web.archive.org/web/20250605035507/https://www.talkinbroadway.com/page/world/OnceUponaOneMoreTime.html"
}