{
  "showId": "once-upon-a-one-more-time-2023",
  "outletId": "telegraph",
  "outlet": "The Telegraph",
  "criticName": "Diane Snyder",
  "url": "https://www.telegraph.co.uk/theatre/what-to-see/once-upon-a-one-more-time-marquis-review-britney-spears/",
  "playbillVerdictUrl": "https://www.telegraph.co.uk/theatre/what-to-see/once-upon-a-one-more-time-marquis-review-britney-spears/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "US Edition\n \n \n \n\n \n\n \n \n \n \n\n \n\n \n \n \n \n \n\n \n \n \n\n \n \n\n \n\n \n\n \n\n \n \n \n\n \n\n \n\n \n \n \n\n \n\n \n \n \n\n \n\n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n\n \n \n\n \n\n \n\n \n\n \n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n \n \n\n \n\n \n\n \n \n \n \n \n\n \n \n\n \n\n \n\n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n\n \n \n\n \n \n\n \n \n \n \n \n\n \n \n \n \n \n\n \n \n \n \n Once Upon a One More Time, at the Marquis Theatre, on Broadway\n \n \n\n \n \n \n \n Credit: Matthew Murphy\n \n \n \n \n\n \n\n \n \n\n \n\n \n\n \n \n\n \n \n \n \n \n\n \n\n \n \n\n \n \n\n \n \n \n\n \n \n \n \n \n \n\n \n \n\n \n \n \n\n \n \n \n\n \n\n \n \n\n \n \n \n \n \n \n\n \n \n\n \n \n\n \n \n\n \n \n \n\n \n \n \n \n \n Diane Snyder\n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n\n \n\n \n \n \n\n \n \n \n \n \n \n\n \n\n \n \n 23 June 2023 2:00am BST\n \n \n\n \n\n \n \n\n \n \n\n \n\n \n\n \n \n\n \n\n \n \n\n \n \n\n \n \n Oops!...They did it again. The creators of Broadway’s new Britney Spears jukebox musical have ventured into & Juliet female-empowerment territory. Instead of giving Shakespeare’s tragic teenager a happier outcome, however, this plot concerns a malcontent Cinderella yearning to forge a more meaningful life than the one she’s been saddled with by her fairy-tale overlord (aka the narrator).\n\nAt its best, Once Upon a One More Time is an arena-style concert full of rousing numbers (Baby One More Time, Crazy), agile, athletic dancers and pulsating light displays directed and choreographed by husband-and-wife Broadway newcomers Keone and Mari Madrid. (Concertgoers – sorry, audience members – even get an LED wristband that lights up during the final number.) But the story, by another Broadway newbie, Jon Hartmere, aims for both impishness and profundity, with muddled results.\n\nCinderella’s OFG (Original Fairy Godmother, played by Brooke Dillman) raises her consciousness by introducing her to Betty Friedan’s Feminine Mystique. Suddenly, instead of doing what’s expected of a proper princess and prepping for the ball, she’s rallying her troops – Snow White, Rapunzel and Sleeping Beauty among them – to rebel and become the authors of their own tales.\n\nBest not to think too much about the logistics of the plot, although it does bear a passing resemblance to Spears’s own troubles with her father, who, as her conservator, exercised tremendous control over her life until recently. Adam Godley, in a complete 180 from his last Broadway outing (the weighty Lehman Trilogy), plays the narrator, who keeps all the princesses in line like an authoritative father.\n\nAnd Cinderella is certainly having her moment as a Broadway heroine. In the past year, she has also been a character in both a first-rate revival of Into the Woods and Andrew Lloyd Webber’s short-lived Bad Cinderella. Here, played by Briga Heelan (another Broadway debutante), she’s a solid if unsensational protagonist. Aisha Jackson’s ditzy Snow White proves a solid sidekick with a powerful voice, but it’s the supporting cast that command the spotlight.\n\nOnce Upon a One More Time, at the Marquis Theatre, on Broadway\n \n \n\n \n \n \n \n Credit: Matthew Murphy\n \n \n \n \n\n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n\n \n \n In a show about princesses finding their voice, it may seem inappropriate to rave about an unfaithful Prince Charming – it’s not his fault, he’s written that way, he insists – but the charismatic Justin Guarini’s turn as the narcissistic royal is one of the musical’s highlights. When the prince’s two-timing is revealed, he’s the one who gets to sing one of the show’s best numbers, Spears’s chart-topper Oops!...I Did It Again.\n\nCinderella’s stepsisters (Amy Hillner Larsen and Tess Soltau) are menacing but also a hoot as they tell their scrubbing charge, “You better work, b---h,” the refrain of another Spears hit. But it’s Jennifer Simard’s deadpan stepmother who brings down the house with her showstopping rendition of Toxic.\n\nThese, however, are songs to gyrate to at a club, and they’re not well suited for revealing character. Neither is the book. “Well-behaved princesses rarely make history,” Cinderella declares. If only Once Upon a One More Time took its own advice and challenged the audience. The idea that women need to be the authors of their own stories is hardly radical anymore.\n\nBooking until Nov 19; onemoretimemusical.com",
  "isFullReview": true,
  "textWordCount": 557,
  "archivePath": "data/archives/reviews/once-upon-a-one-more-time-2023/telegraph--diane-snyder_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:01:43.849Z",
  "designation": "Recommended",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 137 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee auth failed: Monthly API calls limit reached: 250000"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}