{
  "showId": "once-upon-a-one-more-time-2023",
  "outletId": "timeout-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.timeout.com/newyork/theater/once-upon-a-one-more-time-broadway-musical-review-britney-spears",
  "publishDate": null,
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Matthew Murphy | Once Upon a One More TimeReview\n\n3 out of 5 starsBroadway has a new princess musical.Theater, MusicalsRecommendedThursday June 22 2023ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out saysBroadway review by Adam Feldman\n\nOops! They’ve done it again. Every time I think the jukebox musical is played out, another crazy circus comes along, stuffed with pretty girls and boys; from the bottom of my broken heart, it’s enough to make me scream and shout. But sometimes, if I’m lucky, the latest show turns out to be one of the genre’s stronger efforts. I didn’t wanna go, but I admit that a piece of me had a lot of fun at Once Upon a One More Time, a bubblegum-feminist Cinderella story constructed around the pop hits of Britney Spears. For a fan of more substantial musicals, with original scores, it’s a masochistic pleasure.  Fine, Broadway, gimme more! Hit me, Broadway, one more time.\n\nWisely avoiding the biomusical route, book writer Jon Hartmere takes inspiration from Spears’s media moniker, the Princess of Pop, to spin a yarn about the dissatisfaction of fairy-tale princesses after their happily evers. Cinderella (Briga Heelan), in particular, has reservations about how her story keeps getting told—especially once she learns that she shares her philandering Prince Charming (a gleefully unctuous Justin Guarini) with all the other girls, including her sweet but dim friend Snow White (Aisha Jackson). After the banished Original Fairy Godmother (played with old-school gusto by Brooke Dillman) slips her a copy of Betty Friedan’s 1960s womanifesto The Feminine Mystique, Cinderella leads a rebellion against the Narrator (an ominous Adam Godley), and widespread destruction follows intermission.\n\nOnce Upon a One More Time | Photograph: Courtesy Matthew Murphy\n\nIf this seems familiar, that’s because it is: Once Upon a One More Time is basically Into the Woods for Dummies, spliced with DNA from two other musicals from last season, & Juliet and Bad Cinderella. But you don’t go to a Britney Spears jukebox musical looking for originality: You go to hear songs you know and watch dancing in a style that evokes the turn of the 21st century, and director-choreographers Keone and Mari Madrid certainly don’t stint on those. More than 20 Spears songs—cannily re-orchestrated by James Olmstead and Matt Stine, under the music supervision of Patrick Vaccariello—are in the mix, tweaked to fit their new plot placement. And the crackerjack ensemble executes its action-packed dances energetically, often in synchronized formation; there are so many rapid hand gestures that it sometimes looks like they’re signing. (Tina Landon’s original choreo for “Oops!…I Did It Again” is tucked into the staging as an homage, like Bob Fosse’s “Hot Honey Rag” in Chicago.)\n\nAmid all the bright lights, loud sound and frenetic staging—at one point, Guarini swings from a chandelier—the musical’s most powerful weapon is its least effortful one: musical-comedy genius Jennifer Simard’s thoroughly original spin on Cinderella’s devious stepmother. With deadpan command and a somehow lugubrious flounce, she brings wit to each word she speaks or sings, whether laying waste to “Toxic” or, flanked by her washout daughters (Tess Soltau and Amy Hillner Larsen), telling the not-yet-liberated Cinderella to “Work Bitch.” Simard is delicious; the rest of the show, if you turn off your brain, is merely yummy in a candy-coated way. That’s not nothing: Once Upon a One More Time is a well-assembled and entertaining diversion. But this is now the third musical currently running on Broadway that features at least one Britney song, and that should give theater lovers pause. Musicals are capable of more ambitious roles than merely carrying Spears.\n\nOnce Upon a One More Time. Marquis Theatre (Broadway). Book by Jon Hartmere. Music and lyrics by various artists. Directed by Keone and Mari Madrid. With Briga Heelan, Justin Guarini, Jennifer Simard, Adam Fodley, Aisha Jackson, Brooke Dillman. Running time: 2hrs 40mins. One intermission.\n\nFollow Adam Feldman on Twitter: @FeldmanAdamFollow Time Out Theater on Twitter: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nOnce Upon a One More Time | Photograph: Courtesy Matthew Murphy\n\nOnce Upon a One More Time | Photograph: Courtesy Matthew Murphy\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "dtliExcerpt": "“Simard is delicious; the rest of the show, if you turn off your brain, is merely yummy in a candy-coated way. That’s not nothing: ‘Once Upon a One More Time’ is a well-assembled and entertaining diversion...Musicals are capable of more ambitious roles than merely carrying Spears.”\n\nRead more",
  "originalScore": null,
  "assignedScore": 100,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 986,
  "archivePath": "data/archives/reviews/once-upon-a-one-more-time-2023/timeout-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:50:46.918Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "designation": "Critics_Choice",
  "scoreSource": "time-out-stars",
  "scoreConfidence": "medium",
  "originalRating": "5/5 stars"
}