{
  "showId": "hells-kitchen-2024",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://cititour.com/NYC_Broadway/Hells-Kitchen/1182",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $0\n\t Buy Tickets\n\nCititour.com Review\n    Being able to brilliantly straddle the line between (semi)autobiography and a universal coming-of-ale tale is just one of the many achievements of the vibrantly exciting new musical, “Hell’s Kitchen,” now at the Public Theatre. \n\nThe extraordinary singer-songwriter Alicia Keys (winner of 15 Grammy Awards, among many other honors) has clearly put her heart, soul and much of her esteemed musical catalogue into this deeply personal enterprise about a gifted if unhappy 17-year-old named Ali (played with remarkable assurance by stage newcomer Maleah Joi Moon). \n\nWe watch eagerly as Ali struggles to find her true self while growing up in 1990s Manhattan with an overly protective white mother (the vocally dazzling Shoshana Bean), a mostly absent African-American father (Brandon Victor Dixon, oozing charm from every pore and singing like a dream) and the possibility of danger just outside her door.\n\nRather than letting the show feel trite or even self-indulgent, either of which could have been the outcome, librettist Kristoffer Diaz, director Michael Greif, and choreographer Camille A. Brown have all used their considerable talents to make this story feel both fresh and heartfelt. (Brown’s modern-dance choreography for the large, athletically gifted ensemble is among the evening’s high points, even if it pops up a bit too often and in some unnecessary places.)\n\nIndeed, thanks largely to Diaz, there’s a surprising poignancy in both Ali’s brief, ill-conceived romance with Knuck, a somewhat older “thuggish” street musician (beautifully embodied by Chris Lee, who serves up the perfect mixture of toughness and tenderness) and her relationship with Miss Liza Jane (the unbelievably powerful Kecia Lewis), a no-nonsense pianist who lives in Ali’s building and becomes her teacher and her mentor. (For the record, Keys was already a trained classical musician by the age of 12 and received her first record deal at age 13.)\n\nStill, the show’s wealth of emotion derives primarily from Keys’ music, alternately soulful, defiant and even anthemic -- and with even her most familiar songs stunningly rearranged (by Keys and Adam Blackstone). For example, “Girl on Fire” is no longer a solo boast, but a community’s congratulations of Ali’s personal achievement; “Not Even the King,” gorgeously performed mostly by Dixon, and “Fallin’,” now a jazzy duet for Bean and Dixon, both redefine the idea of a romantic love song; while the depth of mother-daughter love is stunningly expressed by Moon and Bean in the irresistible “No One.”\n\nMeanwhile, Lewis makes us practically stand up and salute during her roof-raising rendition of “Perfect Way to Die.” Bean does everything she can (which is EVERYTHING) on the angry-yet-humorous “Pawn It All.” And for those who feared the mega-hit “Empire State of Mind” would become a mega-mix singalong, let me just say it doesn’t!\n\nThe show’s physical production isn’t overly lavish, but it works. The amazing five-person band is seated on Robert Brill’s two-tiered stands that moves back and forth from the often-vacant stage. (A piano is often placed dead center with Dixon, Lewis and Moon appearing to play it). Dede Ayite’s costumes are (as usual) colorful and decade appropriate. And Peter Negrini’s evocative projections (some of which, unfortunately, are merely distracting) set the time and place with precision.\n\nWhile the run at the Public is essentially sold out, rumor has it that “Hell’s Kitchen” will be cooking again later this spring on Broadway, just steps away from the musical’s setting. So, to change the title of one of Keys’ songs: “Looks Like You Will See Them Again.”\n\n    \t    By Brian Scott Lipton\n\nVisit the Sitehttps://publictheater.org Open/Close DatesOpening 11/19/2023Closing 1/14/2024\nTheatre Info\nPublic Theater425 Lafayette StreetNew York, NY 10003\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 662,
  "archivePath": "data/archives/reviews/hells-kitchen-2024/cititour-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:44:43.904Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "sourceMethod": "scrapingbee"
}