{
  "showId": "hells-kitchen-2024",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Scott Lipton",
  "url": null,
  "publishDate": "2024-04-20T22:17:06-04:00",
  "fullText": null,
  "isFullReview": false,
  "bwwExcerpt": "Being able to brilliantly straddle the line between (semi)autobiography and a universal coming-of-age tale is just one of the many achievements of the vibrantly exciting new musical, “Hell’s Kitchen,” now at the Shubert Theatre. Expect a lot of Tony Award nominations – and perhaps even a statuette or two – for this extremely accomplished, feel-good musical!        Average Rating: 66.5% {   \"@context\":\"https://schema.org\",   \"@type\":\"LiveBlogPosting\",   \"@id\":\"/article/Review-Roundup-HELLS-KITCHEN-Opens-on-Broadway-20240420\",   \"about\":{     \"@type\":\"Event\",     \"startDate\":\"2024-04-20T10:17:06-05:00\",          \"name\":\"Review Roundup: HELL'S KITCHEN Opens on Broadway\",            \"eventAttendanceMode\": \"https://schema.org/OnlineEventAttendanceMode\",       \"location\": {         \"@type\": \"VirtualLocation\",         \"url\": \"/article/Review-Roundup-HELLS-KITCHEN-Opens-on-Broadway-20240420\"         }     },   \"coverageStartTime\":\"2024-04-20T10:17:06-05:00\",      \"coverageEndTime\":\"2024-04-21T01:17:06-05:00\",   \"headline\":\"Review Roundup: HELL'S KITCHEN Opens on Broadway\",      \"description\":\"Let's hear it for New York! The new Broadway musical HELL’S KITCHEN, conceived by 16-time Grammy Award winner Alicia Keys and directed by Tony Award nominee Michael Greif opens tonight at the Shubert Theatre. Check out what the critics are saying!\",   \"liveBlogUpdate\":[     {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Times - ‘Hell’s Kitchen’ Review: Alicia Keys’s Musical Finds Its Groove on Broadway\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"The most exciting complement to the music is the choreography by Camille A. Brown, a Tony Award nominee for “Choir Boy” and “For Colored Girls Who Have Considered Suicide/When the Rainbow Is Enuf.” The movement pulses with life and is fully integrated into the show’s overall aesthetics, but it’s the attention to detail that’s memorable. As is standard for Broadway these days, the dancing is ensemble-based, but Brown and her troupe brilliantly find the individual in the group, and each one exists, like the dancer blowing gum bubbles in the middle of a number. There is, always, a sense of the person within a community, as with Ali growing up in a village known as Manhattan Plaza. That she’s back in the old neighborhood feels just right.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Variety - ‘Hell’s Kitchen’ Review: Alicia Keys Musical Brings a Vibrant Depiction of Teen Girlhood to Broadway\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"In addition to Moon and Bean’s sensational vocal range, “Hell’s Kitchen” illustrates how tender mother/daughter relationships can be. It also reflects the issues underlying New York City in the ’90s while demonstrating the impact of loss, absentee fathers and over-policing in communities of color. Since the play runs at a lengthy 2 hours and 30 minutes (including an intermission), these themes are often drawn out and sometimes feel cliché, bordering on corny. However, the absolute dynamism of the cast keeps the show from falling into pure melodrama.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"TimeOut - Hell's Kitchen\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"As its title suggests, Hell’s Kitchen extends its attention to the neighborhood beyond the central story. The fire escapes and signage of Robert Brills’s scenic design and Perter Nigrini’s projections, augmented by the dazzle of Natasha Katz’s lighting, help set the urban scene. But the most important factor is Brown’s outstanding choreography: Executed gorgeously by an ensemble that includes several dancers she has worked with in the past, the show’s bold and graceful movement summons a world of kinetic energy for Ali to tap into when she is finally able to organize her talent. When Hell’s Kitchen inevitably concludes with “Empire State of Mind,” the song doesn’t feel tacked on, because New York has been keenly felt throughout the show. It may touch on social issues of consequence, but Hell’s Kitchen is ultimately a celebration of the city—and the people who make it pop. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Vulture - Hell’s Kitchen Is the WE❤NYC of Musicals\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"Moon, to her credit, grounds all this wherever she can. She’s a great discovery, a virtuoso who also appears surprised and delighted by her own talent. In Dede Ayite’s throwback ’90s costumes — so much Tommy Hilfiger, such giant pants — Moon has both swagger and that crucial touch of naïveté that makes Ali feel like a real and contradictory teenage girl, even when the plot swerves around her. Her voice, for all its power, has a sandpaper edge, a texture that makes her stand out when so many young singers sound cleanly uniform. If only the material written for her could be as distinctive. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Wrap - ‘Hell’s Kitchen’ Broadway Review: Alicia Keys Holds Court Far Above 42nd Street\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"Since “Hell’s Kitchen” doesn’t have much of a story to tell, Diaz pumps up the drama in a couple of ways that ultimately feel false. He ends Act One of this two-and-a-half-hour musical with the cops confronting Knuck, which leads to the delivery of the Keys 2020 single “Perfect Way to Die.” The reference to Black Lives Matter is powerful, but provides more weight than this musical can sustain — especially when the facts of Knuck’s “arrest” are revealed in Act Two.  \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Entertainment Weekly -  Hell's Kitchen review: The Alicia Keys Broadway musical is a rousing delight\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"What is so remarkable about Hell’s Kitchen, however, is that a story so familiar can also somehow feel so fresh. Right from the outset, both the neighborhood and stage come alive — bursting with energy as characters bound about in their FUBU shirts and saggy, baggy jeans, popping poses and banging buckets. The Hell’s Kitchen ensemble is working hard, interpreting the music through motion that feels like the bustling city streets outside Ali’s Manhattan Plaza building. If modern, hyped-up dance is your thing, they got you, thanks to scene-stealing choreography by Camille A. Brown.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Daily News - BROADWAY REVIEW: ‘Hell’s Kitchen’ is a vibrant, romantic tale inspired by Alicia Keys\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"The young actress Moon has a formidable task on her plate here and she’s a charming lead. But she doesn’t always sing in the middle of the notes of these blazing Keys songs, or at least that was the case at the performance I saw. In all fairness, it sounded like her instrument was not at its healthiest in the typically exhausting run up to opening night. So that may not be your experience. Dixon, though, sounds just as spectacular as Bean and Lewis, embodying as he does the unreliable charmer — a stereotypical musician-dad for sure, and I had to fight some irritation there and elsewhere at the broadness of the narrative strokes. But kudos to Keys for making her younger self a needy pain in the neck, otherwise known as an artistically inclined teenager.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The New York Sun - The Alicia Keys Musical, ‘Hell’s Kitchen,’ Makes Its Way Uptown to Broadway\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"The show has nonetheless arrived at the Shubert Theatre, with its excellent principal cast (lovingly directed by Michael Greif) and its buoyant book and score intact — and, for the most part, the transition feels seamless. The company is led by the bubbly Maleah Joi Moon, who made her professional debut in the Public staging as 17-year-old Ali, a character brd on the young Ms. Keys, though there are striking differences: At Ali’s age, Ms. Keys had already graduated the Professional Performing Arts School at the top of her class and was securing the record contract that would make her a sensation three years later.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Post - ‘Hell’s Kitchen’ review: Alicia Keys’ musical fires up on Broadway\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"Along with choreographer Camille A. Brown, whose dances burst with unrestrained youth and Manhattan chutzpah, the director gives Ninth Ave’s unique bustle energy without resorting to old cliches.  It’s a show that’s true to its city. And at the end, when the cast sings the lyric “concrete jungle where dreams are made of,” the crowd walks out into Times Square fully believing it.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Associated Press  - Theater Review: Not everyone will be ‘Fallin’ over Alicia Keys’ Broadway musical ‘Hell’s Kitchen’\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"Outside this apartment building in the Hell’s Kitchen neighborhood — we get a clue the time is the early 1990s — are “roaches and the rats/heroin in the cracks.” But no criminality is shown — at worst some illegal krumping? — and the cops don’t actually brutalize those citizens deemed undesirable. They sort of just shoo them away. This is a sanitized New York for the M&M store tourists, despite the lyrics in Keys’ songs.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Theater - Hell’s Kitchen Opens on Broadway\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"If Dixon and Bean give swoon-worthy interpretations of some of Keys’ catchiest melodies, Kecia Lewis is on fire in Keys’ most moving and intense tune, “Perfect Way To Die.” The song is about a woman whose son has been shot dead. Nobody is shot dead in “Hell’s Kitchen.” There’s no indication that Miss Liza Jane had a son who was killed. Miss Jane sings the song after Ali enters the Ellington room and tells her she is too angry to play piano right now. In the scene right before, the police have a (somewhat murky) encounter with Knuck,  possibly instigated by Jersey, which led to his arrest.  Miss Liza Jane excoriates her student: “Then why the hell are you in here and not out there. ¥ou were in pain. That pain led you here. Listen to that pain. Do something with it.” If the lyrics don’t correspond to the situation of the scene, the emotions are deeply aligned and easily shared by the audience. The same could be said about much of “Hell’s Kitchen.”\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - HELL’S KITCHEN: WELCOME TO ALICIA KEYS’ NEW YORK\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"If only all of Keys’ songs fit so easily into Kristoffer Diaz’s libretto. The biggest head-scratcher: “Pawn It All,” sung by an angry Jersey to Ali’s dad, Davis (the velvet-voiced Brandon Victor Dixon). Perhaps the creators simply wanted to give Bean a show-stopping song—as well as something for her character to do besides pour water, chop vegetables, and serve dinner. But bursting into her ex’s audition at a nightclub and throwing all of her jewelry at the booker? And why is Bean closing her eyes and belting like she’s onstage at 54 Below?\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - HELL’S KITCHEN: ALICIA KEYS’ LIFE INSPIRES A SWELL MUSICAL\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"Still and all, the secret sauce of this entertainment package is choreographer Camille A. Brown. While many a show highlights athletic, exuberant street dance in all its forms, Brown is determined to tell story through dance. Her ensemble is never there just to show off, but participates to reflect and extend character. As Ali visualizes a future with Knuck, pairs of dancers express her vision; when she issues her independence manifesto through the thrilling “Girl on Fire,” the chorus provides active encouragement. The highlight of much of this Broadway season has been choreography, and Brown’s work ranks among the very best.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Chelsea Community News  - Review: ‘Hell’s Kitchen’ is a Coming of Age Musical That’s in All the Right (Alicia) Keys\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"The cast couldn’t be better. Making her Broadway debut, Maleah Joi Moon is a find, with stunning vocals and just the right mixture of irritability and vulnerability. Without affect, she effortlessly lives the part up on that stage. Shoshana Bean (Mr. Saturday Night) is a marvel as her overprotective mother, rooting the show’s dramatic conflict and singing so amazingly, she turns Jersey’s pain into showstopping moments. As her seemingly good for nothing musician ex (and Ali’s dad), Brandon Victor Dixon is perfection, always trying to be less absent, including on an impressionistic version of Fallin’ that he deliciously sings to Jersey in a last-ditch effort to win her back. And Kecia Lewis is terrific as Miss Liza Jane, though she has to emit some dialogue people would normally never say. (“Your rage is real. Your rage is earned. But I will not let it defeat you.”) \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Showbiz411 - Broadway: Alicia Keys’s Musical “Hell’s Kitchen” Is a High End Jukebox Musical with Soaring Voices\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"“Hell’s Kitchen” is a very high end jukebox musical, Direction (Michael Greif), Choreography (Camille A. Brown) plus costumes, sets, lighting — they’re all top notch. What would have made this show something extra? A real book, more than cardboard cut outs of characters. Allie wants is a boyfriend, which she gets. Big deal. She stumbles into music but there’s no drama. Nothing is in her way. Her mother is doing a good job. Her father is not a bad guy.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Theatre Guide - 'Hell's Kitchen' review — Alicia Keys musical is on fire with powerhouse performances\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"In a marvelous Broadway debut, 21-year-old Maleah Joi Moon plays 17-year-old Ali, a lead character inspired by a young Keys. As told through Ali's eyes, the story of her life in the title NYC neighborhood is as frenetic as any real teenager: the book by Kristoffer Diaz attempts to juggle coming of age, familial tensions, young love, racism, overpolicing, and more. With none of these themes emerging as the dominant one, what emerges instead is a reminder of Keys' marvelous songwriting talent via her soulful, soaring R&B hits — and Moon's ability to bring down the house with song after song after song.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Cititour - HELL'S KITCHEN\",       \"datePublished\":\"2024-05-09T05:29:38-05:00\",         \"articleBody\": \"Being able to brilliantly straddle the line between (semi)autobiography and a universal coming-of-age tale is just one of the many achievements of the vibrantly exciting new musical, “Hell’s Kitchen,” now at the Shubert Theatre. Expect a lot of Tony Award nominations – and perhaps even a statuette or two – for this extremely accomplished, feel-good musical!\"     }             ] }",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HELLS-KITCHEN-Opens-on-Broadway-20240420",
  "textStatus": "missing"
}
