{
  "showId": "hells-kitchen-2024",
  "outletId": "EW",
  "outlet": "Entertainment Weekly",
  "criticName": "Dalton Ross",
  "url": "https://ew.com/hells-kitchen-broadway-review-alicia-keys-musical/",
  "publishDate": "2024-04-20",
  "fullText": "​ Page Not Found This is not the page you are looking for. We hope you can go about your business by using our menu or search option. By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Accept All Cookies",
  "isFullReview": false,
  "bwwExcerpt": "“Perfect Way to Die.” The reference to Black Lives Matter is powerful, but provides more weight than this musical can sustain — especially when the facts of Knuck’s “arrest” are revealed in Act Two. Dalton Ross, Entertainment Weekly: What is so remarkable about Hell’s Kitchen, however, is that a story so familiar can also somehow feel so fresh. Right from the outset, both the neighborhood and stage come alive — bursting with energy as characters bound about in their FUBU shirts and saggy, baggy jeans, popping poses and banging buckets. The Hell’s Kitchen ensemble is working hard, interpreting the music through motion that feels like the bustling city streets outside Ali’s Manhattan Plaza building. If modern, hyped-up dance is your thing, they got you, thanks to scene-stealing choreography by Camille A. Brown. Chris Jones, New York Daily News: The young actress Moon has a formidable task on her plate here and she’s a charming lead. But she doesn’t always sing in the middle of the notes",
  "showScoreExcerpt": "\"Lively choreography and powerhouse vocal performances...overcome a so-so story.\"",
  "originalScore": null,
  "assignedScore": 78,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HELLS-KITCHEN-Opens-On-Broadway-20240421",
  "textStatus": "partial",
  "textWordCount": 59,
  "archivePath": "data/archives/reviews/hells-kitchen-2024/ew--dalton-ross_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:45:27.627Z",
  "textIssues": [
    "Word count too low: 59 (min: 300)",
    "Show title not found in text"
  ]
}