{
  "showId": "hells-kitchen-2024",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=-KHZR4P",
  "publishDate": null,
  "fullText": "Maleah Joi Moon, Jackie Leon, and Vanessa Ferguson. Photo: Joan Marcus The trouble with Hell's Kitchen, I think, is that it didn't spend enough time in the development kitchen. The new musical at the Public is a seriously undercooked dish, a slice of New York life that comes out of the oven tasting distressingly bland. Working with a talented playwright but first-time librettist (Kristoffer Diaz) and a fabulously successful pop songwriter (Alicia Keys), director Michael Greif hasn't managed to bend their considerable skills to the specific storytelling needs of musical theatre. For all the busy coming and going onstage, it is a strangely low-energy affair that never catches the streetwise, multi-ethnic flavor of Manhattan's West Side before the fancy high-rises and cute restaurants moved in. Diaz's book, apparently based on Keys' early years, focuses on seventeen-year-old Ali, who lives in the neighborhood of the title with her mother, Jersey, a former actress turned working stiff tied down, by economic necessity, to two jobs. (As evidence of the show's lack of texture, we never learn what Jersey does for a living.) Alone in their apartment on the forty-second floor of Manhattan Plaza, Ali feels like a prisoner; crazy with energy (and hormones), she yearns to take part in local street life, but Jersey has deputized her friends, the building staff, and even the local cops, ordering them to keep tabs on her daughter's every move. The intergenerational conflict, which has a racial undertone (Ali is Black, Jersey is white), boils over when Ali falls for Knuck, who, passing time drumming on a plastic bucket, looks like her ideal bad boy. In reality, he's an ordinary guy, a housepainter by trade who attends church on Sunday and works hard at staying out of trouble. He is also nearly a decade her senior, but that doesn't stop Ali, who showers him with attention, and soon they land in bed. Catching them in the act, Jersey calls the police on Knuck, nearly triggering a George Floyd incident. In desperation, she also summons her ex, Davis, Ali's father, a jazz musician whose true love is his next gig. (Jersey got pregnant at seventeen and is terrified Ali will repeat her mistake.) Meanwhile, Ali falls under the influence of Miss Liza Jane, an aging, ailing pianist who, in addition to music lessons, schools the girl in the musical achievements of her Black ancestors by way of teaching her something about self-worth. The setup -- a gifted, troubled adolescent dealing with two tough-love mother figures, an absent father, and a boyfriend who unwittingly spells trouble -- is promising, but Ali and Jersey rehearse the same arguments for nearly two acts, while Miss Liza Jane is less a character than an icon of Black consciousness dispensing Pez-like nuggets of uplift. Key points are announced rather than shown: Squaring off against Jersey, who resents any intrusion on her parental rights, Miss Liza Jane points at the piano and says, \"I am not the reason your daughter spends so much time in this room. Her passion for the instrument is insatiable.\" Maybe, but all we see is Ali running around Manhattan, chasing after Knuck. It doesn't help that the number, \"Kaleidoscope,\" which is supposed to demonstrate Ali's newfound intoxication with music, begins like this: \"Tonight is shining bright you know/Oh yeah ohhh no/So light it light it light it light it up/Put it in the air and let it go/Oh yeah ohh no.\" Then again, the generic quality of the lyrics is only obvious when one can make them out. The opener, \"The Gospel,\" aims to establish the neighborhood's gritty flavor and fails, largely because it is unintelligible; other songs succumb to vocal mush. This is not, I think, the fault of the sound designer Gareth Owen, whose work is, typically, bright, brassy, and thoroughly clear. In part, it's because the lyrics -- for this number, anyway -- are too wordy and delivered too fast. The issue of clarity persists, however, because the actors sing in a stylized pop manner, heavy on melisma and short on enunciation. It's less of a problem when Keys' biggest hits, like \"Fallin',\" are heard - we already know what they're about -- but the selections from her catalog often only notionally fit their situations. Then again, those written specifically for the show often sound like this: \"She's seventeen/And her brain just don't work/She's seventeen/And she's a piece of work.\" Keys writes gorgeous, sophisticated, soulful melodies -- although, arguably, too much of Hell's Kitchen relies on similar styles -- but her lyrics fall far short. With a book that paints the characters in only the broadest strokes and songs that don't fill in the details, the actors work hard with little support. As Ali, Maleah Joi Moon is an attractive presence with a nice voice, especially in the effective ballad \"The River,\" which expresses her character's loneliness and frustration; if she isn't quite the heartbreaker the show needs, it very well may be the authors' fault. The other characters each get a single trait: Shoshana Bean's Jersey is a bit of a harpy, Brandon Victor Dixon's Davis is an easily dismissible lightweight, and Kecia Lewis' Miss Liza Jane is a one-note pillar of rectitude. (Lewis does make her two numbers sound better than anything else in the score.) Chris Lee is touching as Knuck, who doesn't need the threat of a statutory rape charge thanks to Ali's fibs about her age. Perhaps because he doesn't trust the material, Greif allows choreographer Camille A. Brown to overstage several sequences; it's especially odd to see dancers creeping onstage during private moments set in living rooms and bedrooms or for the mourners at a memorial service to take part in unnecessary bits of coordinated movement. The latter scene, in particular, would benefit from the idea that stillness is a virtue. Robert Brill's set, featuring sliders with panels of perforated metal and moving towers that house the onstage band, is useful for reconfiguring the space; Peter Nigrini's layered projections -- of Manhattan skylines, neon signs for the restaurant Odessa and the jazz club Arthur's Tavern, and images of the Black musical greats Florence Price and Hazel Scott -- provide a sense of time and place. Natasha Katz's lighting and Dede Ayite's costumes are solid contributions. The show has its charming moments, when Ali, riding the elevator in her building, hears musicians and actors working in different styles or when Tiny, Ali's obstreperous friend, interrupts a falling-in-love song, to ask, crankily, \"Hold up. The world is hers 'cause she got a man now? That's what we're doing?\" Jersey, casting a cold eye on some street kids, mutters, \"Mayor Giuliani's going to clean all of this right up.\" \"Don't worry,\" Ali assures the audience. \"This show is not about him.\" Hell's Kitchen could use more humor to leaven its all-too-earnest life lessons. Indeed, everything comes together during the finale, when all the characters unite for an ecstatic rendition of \"Empire State of Mind,\" accompanied by stunning images of nighttime Manhattan. At last, the cast cuts loose and the show delivers on the promise of \"a love song to New York City\" found in artistic director Oskar Eustis' program note. Otherwise, this one is, sadly, a missed opportunity, a sketchy story hitched to a mostly pre-existing score, a combination that almost inevitably produces underwhelming results. --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1241,
  "archivePath": "data/archives/reviews/hells-kitchen-2024/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:48:00.587Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "sourceMethod": "playwright"
}