{
  "showId": "hells-kitchen-2024",
  "outletId": "ny-stage-review",
  "outlet": "New York Stage Review",
  "criticName": "Rose Bernardo",
  "url": "https://nystagereview.com/2024/04/20/hells-kitchen-welcome-to-alicia-keys-new-york/",
  "publishDate": "April 20, 2024",
  "fullText": "Location, location, location.\n\nThe simple fact that, after premiering at downtown's Public Theater in late 2023, Hell's Kitchen has moved uptown—just a stone's throw from the area for which the show is named—can't be why the musical plays better on Broadway. But it certainly doesn't hurt. Because when Ali (played by the incandescent Maleah Joi Moon) tells us that she and her mom live in the heart of Hell's Kitchen, the audience at the Shubert Theatre erupts in applause and cheers.\n\nThe locals know she's referring to Manhattan Plaza, the high-rise affordable housing development occupied by performing artists, where HK creator and composer Alicia Keys spent her formative years.\n\nKeys' own words are perhaps the best description of her own show: an ode to New York, a love letter to the city (and the people) that helped her become the artist she is today.\n\nHell's Kitchen is powered by a catalog of her hits and contains a few similar biographical elements—a girl named Ali, her eventual embrace of the piano, the Manhattan Plaza locale. But it's not a biomusical. It's simply the story of a sassy 17-year-old struggling to find herself in NYC in the 1990s. Along the way, she falls for the much-older Knock (Chris Lee), a housepainter/bucket drummer; fights at every meal with her mom, Jersey (Shoshana Bean); and meets Miss Liza Jane (the vocal powerhouse Kecia Lewis), a gifted pianist and fierce role model who'll become her teacher and mentor.\n\nThat first encounter with Miss Liza Jane gives rise to the intoxicating \"Kaleidoscope,\" a new-for-the-show song that represents Ali's artistic awakening. It's an exhilarating number—the dancers move in overlapping circles like, well, a kaleidoscope—and a perfectly placed moment.\n\nIf only all of Keys' songs fit so easily into Kristoffer Diaz's libretto. The biggest head-scratcher: \"Pawn It All,\" sung by an angry Jersey to Ali's dad, Davis (the velvet-voiced Brandon Victor Dixon). Perhaps the creators simply wanted to give Bean a show-stopping song—as well as something for her character to do besides pour water, chop vegetables, and serve dinner.\n\n\"The Gospel,\" \"The River,\" and, of course, \"Empire State of Mind\"—that's where Hell's Kitchen truly shines. Notice how Brown's choreography—a dazzling mix of social dance, step, and modern—captures the constant, chaotic movement of the city. There's really no other way this ode to Keys' New York could end.",
  "isFullReview": true,
  "bwwExcerpt": "If only all of Keys’ songs fit so easily into Kristoffer Diaz’s libretto. The biggest head-scratcher: “Pawn It All,” sung by an angry Jersey to Ali’s dad, Davis (the velvet-voiced Brandon Victor Dixon). Perhaps the creators simply wanted to give Bean a show-stopping song—as well as something for her character to do besides pour water, chop vegetables, and serve dinner. But bursting into her ex’s audition at a nightclub and throwing all of her jewelry at the booker? And why is Bean closing her eyes and belting like she’s onstage at 54 Below?",
  "originalScore": "3/5",
  "assignedScore": 60,
  "source": "playwright-scraped",
  "scrapedAt": "2026-01-24T05:30:00.000Z",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HELLS-KITCHEN-Opens-on-Broadway-20240420",
  "textStatus": "missing"
}
