{
  "showId": "hells-kitchen-2024",
  "outletId": "ny-stage-review",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2024/04/20/hells-kitchen-alicia-keys-life-inspires-a-swell-musical/",
  "publishDate": "April 20, 2024",
  "fullText": "Hell's Kitchen is a distinctly superior entry in the jukebox musical genre, which has been booming in number (if not creativity) of late. Librettist Kristoffer Diaz crafts a highly theatrical version of singer-songwriter Alicia Keys' wrestling with adolescence that is moving throughout.\n\nIf it incorporates familiar coming-of-age tropes (overbearing-mother issues, absent-father issues, boyfriend issues, rebelliousness, why-am-I-here questions), it does so with an emotional authenticity that audiences should find easy to embrace. At the same time, Keys' song hits are artfully woven into the plot, and executed by a first rate creative team.\n\nThe title Hell's Kitchen is something of a misnomer. We hear about the hardscrabble, rough-and-tumble part of Manhattan. We certainly see it in Robert Brill's ingenious arrangements of scaffolding and platforms, against Peter Nigrini's arresting photocollage projections. Still, most of the action takes place in and around Manhattan Plaza, the fabled apartment complex/enclave known as \"Broadway's Bedroom.\"\n\nManhattan Plaza is the long-time home of artists of all stripes, and it's where our heroine chafes under the iron fist of mom Jersey (Shoshana Bean), a onetime chorine who wants Ali safe indoors. To say that the story isn't phonied up with melodramatic incident is a distinct compliment, because what is dramatized – the yearning for purpose of a young person of unfocused energy and inchoate dreams – is not just universal, but at the heart of the score's poetry.\n\nDirector Michael Greif is in fine fettle on the streets of Manhattan again. Bean – and Brandon Victor Dixon as Ali's wandering dad – are two of the glories of today's musical theater, and their chemistry is as smokin' as their acting and singing. And I don't want to predict too much about young Ms. Moon's future, if only for fear of jinxing it, but she possesses all the pipes and personal sang-froid to go places.\n\nStill and all, the secret sauce of this entertainment package is choreographer Camille A. Brown. While many a show highlights athletic, exuberant street dance in all its forms, Brown is determined to tell story through dance. Her ensemble is never there just to show off, but participates to reflect and extend character. The highlight of much of this Broadway season has been choreography, and Brown's work ranks among the very best.",
  "isFullReview": true,
  "bwwExcerpt": "Still and all, the secret sauce of this entertainment package is choreographer Camille A. Brown. While many a show highlights athletic, exuberant street dance in all its forms, Brown is determined to tell story through dance. Her ensemble is never there just to show off, but participates to reflect and extend character. As Ali visualizes a future with Knuck, pairs of dancers express her vision; when she issues her independence manifesto through the thrilling “Girl on Fire,” the chorus provides active encouragement. The highlight of much of this Broadway season has been choreography, and Brown’s work ranks among the very best.",
  "originalScore": "3/5",
  "assignedScore": 60,
  "source": "playwright-scraped",
  "scrapedAt": "2026-01-24T05:25:00.000Z",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HELLS-KITCHEN-Opens-on-Broadway-20240420",
  "textStatus": "missing"
}
