{
  "showId": "hells-kitchen-2024",
  "outletId": "nypost-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nypost.com/2024/04/21/entertainment/hells-kitchen-review-alicia-keys-musical-fires-up-on-broadway/",
  "publishDate": null,
  "fullText": "Seventeen-year-old Ali (Maleah Joi Moon) is a stand-in for Alicia Keys in \"Hell's Kitchen\" on Broadway.\t\t\t\t\t\t\n\t\t\t\t\t\t\tMarc J. Franklin\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\nThis girl is finally on fire.\n\nTwo hours and 40 minutes, with one intermission. At the Shubert Theatre, 225 West 44th Street.\n\nThe Alicia Keys musical “Hell’s Kitchen,” which opened Saturday night on Broadway following a rocky run last fall at the Public Theater, has greatly improved now that it’s only blocks away from its title neighborhood.\n\nThe springtime spring in its step comes, in part, because at home in a much bigger theater — the Shubert — the vocal powerhouses of the cast can really let it rip.\n\nAnd, damn, do they ever. It’s the best singing you’ll find on Broadway.\n\nKeys’ hit songs weave an evocative and lively tapestry of 1990s New York City, and these phenomenal actors knock you over with her tunes such as “Not Even The King,” “Pawn It All” and, of course, “Empire State of Mind.”\n\nEspecially the wildly talented Maleah Joi Moon.\n\nShe plays Ali, a fictionalized 17-year-old stand-in for Keys at a turning point in her life. Like the singer once did, Ali lives with her mom, here called Jersey (Shoshana Bean), in Manhattan Plaza, an artist-filled, subsidized apartment building on West 43rd Street.\n\nThe wonderful actress, making her Broadway debut, wows us straightaway when she rebelliously runs off to the Hudson and croons “The River,” and then tops that minutes later with a fabulous new number from Keys called “Kaleidoscope.”\n\nWhile musically epic, however, the plot of “Hell’s Kitchen” doesn&#8217;t match the score&#8217;s grandiosity.\n\nLanding on the lighter end of coming-of-age tales, writer Kristoffer Diaz’s book has Ali develop an all-consuming crush on an older guy named Knuck (Chris Lee), duke it out with her stern mother over the boy and poignantly discover her flair for the piano thanks to a larger-than-life teacher, Miss Liza Jane (Kecia Lewis).\n\nDowntown, I found that story slight. I still do. And I’m not a fan of its over-reliance on Ali’s narration. And yet, with the music amped up and director Michael Greif’s staging resized for Broadway, now it plays more as a sweet expression of how intensely teenagers can feel — even when the stakes are pretty low.\n\nAfter Ali spends the night at Knuck’s, for instance, the cast sings the triumphant “Girl On Fire.&#8221; A big number for what, for a 17-year-old, is a major moment.\n\nKeys has found a star in Moon. She&#8217;s a richly expressive performer who audiences instantly adore, and who has an instrument that makes our hearts leap and sink all at once. Leap because of how astoundingly powerful it is; and sink because you just know NYC will lose her to Los Angeles in two seconds.\n\nBut Moon is just one fourth of a quartet of incredible vocalists here.\n\nAs Jersey, Bean becomes both diva and doting mom when she belts “Pawn It All” at her ex, and Ali’s absent musician dad, Davis (Brandon Victor Dixon) at Arthur&#8217;s Tavern on Grove Street after his latest screw-up.\n\nAnd it’s the satin smoothness of Dixon’s voice that deepens his character from deadbeat. Yes, he disappears for months on end, but when he so beautifully performs “Not Even The King” and “If I Ain’t Got You,” it’s all too easy to leave the door unlocked for him.\n\nAny hard-hitting resonance “Hell’s Kitchen” achieves is because of the indomitable Lewis. While her formidable character is not fleshed out enough by Diaz, the actress grabs our hearts with the thunderous Act One closer, “Perfect Way To Die.”\n\nIt’s good to see Greif, who made his name with “Rent” in 1994, return to New York City street scenes. He understands them more than most.\n\nAlong with choreographer Camille A. Brown, whose dances burst with unrestrained youth and Manhattan chutzpah, the director gives Ninth Ave’s unique bustle energy without resorting to old cliches.\n\nIt&#8217;s a show that&#8217;s true to its city. And at the end, when the cast sings the lyric “concrete jungle where dreams are made of,” the crowd walks out into Times Square fully believing it.",
  "isFullReview": true,
  "dtliExcerpt": "\"It’s a show that’s true to its city.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 682,
  "archivePath": "data/archives/reviews/hells-kitchen-2024/nypost-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:51:46.606Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250422213728",
  "archiveOrgUrl": "http://web.archive.org/web/20250422213728/https://nypost.com/2024/04/21/entertainment/hells-kitchen-review-alicia-keys-musical-fires-up-on-broadway/"
}