{
  "showId": "hells-kitchen-2024",
  "outletId": "NYSR",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2024/04/20/hells-kitchen-welcome-to-alicia-keys-new-york/",
  "publishDate": "2024-04-20",
  "fullText": "April 20, 2024 11:55 pm Hell’s Kitchen: Welcome to Alicia Keys’ New York By Melissa Rose Bernardo ★★★☆☆ The 16-time Grammy-winning singer-songwriter brings her music and her vision to Broadway Maleah Joi Moon and the company of Hell’s Kitchen. Photo: Marc J. Franklin Location, location, location. The simple fact that, after premiering at downtown’s Public Theater in late 2023, Hell’s Kitchen has moved uptown—just a stone’s throw from the area for which the show is named—can’t be why the musical plays better on Broadway. (Can it?) But it certainly doesn’t hurt. Because when Ali (played by the incandescent Maleah Joi Moon) tells us that she and her mom “live on the 42nd floor of a 44-story building on 43rd Street between Ninth and Tenth Avenues, right in the heart of the neighborhood some people know as Hell’s Kitchen,” the audience at the Shubert Theatre erupts in applause and cheers. The locals know she’s referring to Manhattan Plaza, the high-rise affordable housing development occupied by performing artists, where HK creator and composer Alicia Keys spent her formative years. And the tourists have certainly heard of the neighborhood (even if their frame of reference doesn’t extend beyond Taxi Driver ). [ Read Bob Verini’s ★★★☆☆ review here. ] So the crowd is immediately into it. And the very first number we hear is “The Gospel,” from Keys’ 2016 album Here , a song that, in an interview with PBS, Keys described as “an ode to New York…the New York I know, about who lives there, what they look like, what’s their story, the doors that revolve them in and out…and our dreams and wishes and the things we’re trying to escape and where we end up and how we get there and who we are.” Keys’ own words are perhaps the best description of her own show: an ode to New York, a love letter to the city (and the people) that helped her become the artist she is today. Hell’s Kitchen is powered by a catalog of her hits and contains a few similar biographical elements—a girl named Ali, her eventual embrace of the piano, the Manhattan Plaza locale. But it’s not a biomusical à la MJ or Beautiful . It’s simply the story of a sassy 17-year-old struggling to find herself in NYC in the 1990s. (Dede Ayite is the designer responsible for the perfectly on-point throwback streetwear looks, from rugby shirts and logo jerseys to baggy jeans and Timberland boots.) Along the way, she falls for the much-older Knock (Chris Lee), a housepainter/bucket drummer; fights at every meal with her mom, Jersey (Shoshana Bean); and, in a fit of anger, wanders into her building’s Ellington Room and meets Miss Liza Jane (the vocal powerhouse Kecia Lewis), a gifted pianist and fierce role model who’ll become her teacher and mentor. That first encounter with Miss Liza Jane gives rise to the intoxicating “Kaleidoscope,” a new-for-the-show song that represents Ali’s artistic awakening: “Nights like this they belong in the Guinness/ Nights like this never want them to finish,” she sings. It’s an exhilarating number—the dancers move in overlapping circles like, well, a kaleidoscope—and a perfectly placed moment. (A humble suggestion to the Tony Awards producers: “Kaleidoscope” would be a beautiful way to open the telecast. Keys could play the piano and start the song; plus, it features Moon and the incredible ensemble. And host Ariana DeBose could easily take on Camille A. Brown’s intricate choreography.) If only all of Keys’ songs fit so easily into Kristoffer Diaz’s libretto. The biggest head-scratcher: “Pawn It All,” sung by an angry Jersey to Ali’s dad, Davis (the velvet-voiced Brandon Victor Dixon). Perhaps the creators simply wanted to give Bean a show-stopping song—as well as something for her character to do besides pour water, chop vegetables, and serve dinner. But bursting into her ex’s audition at a nightclub and throwing all of her jewelry at the booker? And why is Bean closing her eyes and belting like she’s onstage at 54 Below? “The Gospel,” “The River,” and, of course, “Empire State of Mind”—that’s where Hell’s Kitchen truly shines. Notice how Brown’s choreography—a dazzling mix of social dance, step, and modern—captures the constant, chaotic movement of the city. It’s no spoiler to reveal that “Empire State of Mind,” Keys’ and Jay-Z’s 2009 anthem immortalizing the “concrete jungle where dreams are made of,” ends the show. There’s really no other way this ode to Keys’ New York could end. Hell’s Kitchen opened on Broadway April 20, 2024, at the Shubert Theatre. Tickets and information: hellskitchen.com -->",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 60,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:02:00.129Z",
  "bwwExcerpt": "Still and all, the secret sauce of this entertainment package is choreographer Camille A. Brown. While many a show highlights athletic, exuberant street dance in all its forms, Brown is determined to tell story through dance. Her ensemble is never there just to show off, but participates to reflect ..."
}
