{
  "showId": "hells-kitchen-2024",
  "outletId": "nystagereview-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nystagereview.com/2023/11/19/hells-kitchen-a-musical-neighborhood-worth-visiting/",
  "publishDate": null,
  "fullText": "★★★★☆ Featuring old and new songs by Alicia Keys, the musical is loosely based on the performer's early life. Don’t go to the new musical receiving its world premiere at the Public Theater expecting an Alicia Keys jukebox musical. Sure, the show delves extensively into the pop singer’s extensive catalogue, incorporating pop hits, deep cuts, and a handful of original songs. And yes, it’s based on the story of her early life, kinda, sorta. But really, Hell’s Kitchen is mostly a coming-of-age story revolving a teenage girl struggling to find herself, and about her relationships with such people in her life as her financially struggling single mother, the father whom she barely knows, her first boyfriend, and the mentor who awakens her musical interest by teaching her how to play piano. It’s a familiar tale, not very interestingly told via the underwhelming book by Pulitzer-finalist Kristoffer Diaz (The Elaborate Entrance of Chad Deity). But much like Keys, who overcame modest beginnings to become a pop star who’s sold tens of millions of records and multiple Grammys, the musical ultimately triumphs thanks to the soul-stirring music. By the time this production terrifically staged by Michael Greif reaches its conclusion, you’ll definitely be in an empire state of mind. Another major reason for the show’s success is its newcomer leading lady, Maleah Joi Moon, who plays the 17-year-old version of Keys, here called “Ali.” Making a remarkable stage debut, the 21-year-old performer instantly proves herself a budding star with her powerhouse vocals and irresistibly charming performance. She makes her character, who narrates the proceedings, consistently sympathetic even when behaving like a typically self-absorbed, frequently bratty teenager. [Read Melissa Rose Bernardo’s ★★★☆☆ review here.] Ali is shown to be living with her mother Jersey (Shoshana Bean), who works several jobs to keep them afloat, in Manhattan Plaza, the neighborhood’s apartment complex featuring subsidized housing for artists. She’s thus exposed to all forms of music and dance merely by riding the elevator to different floors, or stopping by the Ellington Room, a communal space featuring a grand piano. But as much as she delights in the cultural stimulation, Ali has other things on her mind, especially Knuck (Chris Hart), a burly local workman who spends his free time drumming on buckets. The lovestruck young girl pretty much throws herself at Knuck, who at first proves resistant but ultimately succumbs to her charms, not knowing she’s underage. Along the way, she fights constantly with her mother, who desperately attempts to keep her out of trouble and contacts Ali’s long-gone father Davis (Brandon Victor Dixon), a charming but unreliable musician, for help with her daughter after Knuck gets into trouble with the police through no fault of his own. The headstrong Ali also forms a close friendship with the piano-playing Miss Liza Jane (an outstanding Kecia Lewis), an older woman living in the building who instills in her a love of piano and harbors a secret. Hell’s Kitchen (the show presents a dramatically darker portrait of the neighborhood than it really was at the time) makes good use of Key’s songs, many of which are delivered with dramatically different arrangements and lyrical alterations from the recorded versions. They’re effectively integrated into the storyline, only occasionally feeling shoehorned in, and sound terrific in the hands of the lead performers and the talented ensemble. Lewis knocks it out of the park with her heart-wrenching delivery of the first act closer “Perfect Way to Die”: Dixon turns “If I Ain’t Got You” into a touching ode from a father to his daughter; Bean delivers a fiercely powerful “Pawn It All”; and the two make “Fallin’” into a torrid duet. Moon, meanwhile, sings the hell out of every number she’s given. The show feels both narratively thin and overstuffed, lacking a compelling storyline and featuring too many superfluous, underdeveloped characters, including Knuck and Ali’s respective friends, a few neighbors, and a helpful doorman. But it doesn’t matter, thanks to the procession of sensational musical numbers, many enhanced by Camille A. Brown’s dynamic, if at times too busy, choreography. Hell’s Kitchen clearly has its eyes on Broadway, and thanks to its composer’s name recognition and the star-making performance of its young lead, it may very well make the leap to the area just east of the neighborhood that gives the show its name. Hell’s Kitchen opened Nov. 19, 2023, at the Public Theater and runs through Jan. 14, 2024. Tickets and information: publictheater.org Frank Scheck has been covering film, theater and music for more than 30 years. He is currently a New York correspondent and arts writer for The Hollywood Reporter. He was previously the editor of Stages Magazine, the chief theater critic for the Christian Science Monitor, and a theater critic and culture writer for the New York Post. His writing has appeared in such publications as the New York Daily News, Playbill, Backstage, and various national and international newspapers.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 820,
  "archivePath": "data/archives/reviews/hells-kitchen-2024/nystagereview-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:51:52.185Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "sourceMethod": "playwright"
}