{
  "showId": "hells-kitchen-2024",
  "outletId": "NYTG",
  "outlet": "New York Theatre Guide",
  "criticName": null,
  "url": "https://www.newyorktheatreguide.com/reviews/hells-kitchen-broadway-review-alicia-keys",
  "publishDate": "2024-04-21",
  "fullText": "'Hell's Kitchen' review — Alicia Keys musical is on fire with powerhouse performancesRead our review of Hell's Kitchen on Broadway, a new musical featuring Alicia Keys' songs and loosely inspired by her life, playing at the Shubert Theatre.Gillian RussoApril 20, 2024, 00:00Before she was a 16-time Grammy Award winner, Alicia Keys was a 15-year-old girl with her first record deal and a 20-year-old woman releasing her first album, 2001's Songs in A Minor — whose lead single \"Fallin'\" remains one of her best-loved tracks. It's fitting, then, that in the new Broadway musical Hell's Kitchen, Keys' songs are a showcase for rising young talent. In a marvelous Broadway debut, 21-year-old Maleah Joi Moon plays 17-year-old Ali, a lead character inspired by a young Keys. As told through Ali's eyes, the story of her life in the title NYC neighborhood is as frenetic as any real teenager: the book by Kristoffer Diaz attempts to juggle coming of age, familial tensions, young love, racism, overpolicing, and more. With none of these themes emerging as the dominant one, what emerges instead is a reminder of Keys' marvelous songwriting talent via her soulful, soaring R&B hits — and Moon's ability to bring down the house with song after song after song. Amid its many themes, Hell's Kitchen is at its strongest when it's a mother/daughter story — or rather, one of two. The fraught relationship between Ali and her single mother, Jersey (Shoshana Bean), is central to the show: The protective Jersey has to learn not to harm others in the name of love for Ali, and Ali has to learn to accept her mother's fierce love and wisdom. When on the outs with her mom, Ali develops a maternal relationship with no-nonsense piano teacher Miss Liza Jane (Kecia Lewis), who teaches Ali how to channel her pain, rage, and passion — at her mother, at the world — into the piano. Bean and Lewis are established Broadway talents, and Hell's Kitchen is a showcase for them, too. While Bean's Act 2 showstopper, \"Pawn It All,\" is her capital-M Moment, her more understated rendition of \"Teenage Love Affair\" — which smartly shows the parallels between her younger self and Ali — is just as beautiful. And Lewis gets the Act 1 finale, a wrenching rendition of the anti-racism lament \"Perfect Way to Die\" that explodes with sorrow and passion. Between Moon, Bean, Lewis, and Keys, these girls are on fire. Hell's Kitchen summary Following a world-premiere Off-Broadway run at the downtown Public Theater last fall, Hell's Kitchen has come home. The Shubert Theatre, which now houses Alicia Keys' musical on Broadway, is about a block northeast of Manhattan Plaza, the subsidized apartment building for artists where Keys grew up, and where the show takes place. Hell's Kitchen follows Ali as she pursues an ill-advised relationship with an older man (Knuck, played by a sympathetic Chris Lee), struggles with the erratic reappearance (and re-disappearance) of her father from her life, and witnesses discrimination against her fellow members of Hell's Kitchen's Black community who, to her, are the people whose music and art make the city come alive. Unlike Keys, who began learning piano at a young age, Ali stumbles into a passion for it during Hell's Kitchen — and it unlocks a vision for her future. Keys' catalog of songs including \"No One,\" \"Empire State of Mind,\" and \"If I Ain't Got You,\" as well as some deeper cuts and previously unreleased songs, score Hell's Kitchen. What to expect at Hell's Kitchen Set designer Robert Brill's gray scaffolding puts the \"concrete\" in \"concrete jungle where dreams are made of.\" But the ensemble of performers, in vibrant costumes by Dede Ayite, provides the colorful, wild \"jungle.\" At times, dancers (performing Camille A. Brown's invigorating choreography) will appear not just as city dwellers, but as personifications of the characters' inner emotions and fantasies, or those of Ali's diverse community, or else of music notes emerging from a piano or a sidewalk. Or sometimes all three at once. There are also multiple times when Hell's Kitchen feels like an Alicia Keys concert. Moon has a very similar vocal quality to Keys, and Bean goes into full stadium headliner mode during \"Pawn It All\" (earning a mid-show standing ovation at my performance). And at the end, when \"Empire State of Mind\" urges us to put \"one hand in the air for the big city,\" many people did, dancing along in their seats until the lights went down — at which point they immediately leapt to their feet again. What audiences are saying about Hell's Kitchen Totaled from over 700 ratings of Hell's Kitchen on and off Broadway, the show has a 90% approval rating on Show-Score, earning it \"audience acclaimed\" status on the review-aggregating site. \"Going into the show I could not name any of Alicia Keys' songs, now I plan to download the cast recording or her songs. Since most of the songs were unknown to me it was like seeing an original musical and not a Juke Box productions.\" - Show-Score user Travelling Jersey Boy \"It's got great moments but the overall theme meanders. Is it about mother/daughter dynamics? Portrait of a neighborhood? Police discrimination against young black men? A kid finding her voice? The women rule this show with amazing singing and acting, but the story would benefit from editing.\" - Show-Score user Lauren 7090 \"There isn’t a moment on Broadway this season that is more powerful than Kecia Lewis singing 'Perfect Way to Die' in Hell’s Kitchen. Honestly, I think it’s one of the greatest performances of a song that I’ve ever seen.\" - David Gordon of TheaterMania via X \"Shoshana Bean's second act showstopping number is worth the price of admission.\" - Show-Score user GreatAvi Who should see Hell's Kitchen Mothers and daughters — Hell's Kitchen depicts mother/daughter relationships in all its love and messiness alike. (My mother, with whom I attended the show, teared up three separate times.) Alicia Keys fans should see it, of course, especially those who want to hear some deep cuts. But even those who don't know her music inside and out may enjoy discovering it as though it was written for the stage. New York locals. We may get jaded toward our city the longer we're here, but Ali — a local with the boundless wonder of a young Kansas transplant — might remind us why we came (or stayed) in the first place. Learn more about Hell's Kitchen on Broadway Hell's Kitchen makes New York's streets — and Alicia Keys' songs — feel brand-new. Powerhouse vocal, acting, and dance performances turn the concrete jungle into a living, breathing soundscape filled with art and possibility if we're willing to look for it. Learn more and get Hell's Kitchen tickets on New York Theatre Guide. Hell's Kitchen is at the Shubert Theatre. Additional Hell's Kitchen content Everything you need to know about Alicia Keys’s musical Hell's Kitchen Hear the songs of Alicia Keys in Hell's Kitchen on Broadway Make a day out of Hell's Kitchen on Broadway How Hell's Kitchen reflects and differs from Alicia Keys' life All the times Alicia Keys did theatre From Suffs to Hell's Kitchen, the Public Theater champions Broadway hits This Women's History Month, female theatre artists celebrate a record season Video: What is the sound of New York City? Photo credit: Maleah Joi Moon (center) and the cast of Hell's Kitchen on Broadway. (Photo by Marc J. Franklin)Frequently asked questionsWhere is Hell's Kitchen playing?Hell's Kitchen is playing at Shubert Theatre. The theatre is located at 225 West 44th Street (between Broadway and 8th Avenue), New York, 10036.How long is Hell's Kitchen?The running time of Hell's Kitchen is 2hr 35min. Incl. 1 intermission.What's the age requirement for Hell's Kitchen?The recommended age for Hell's Kitchen is Ages 8+. Children under 4 are not permitted..How do you book tickets for Hell's Kitchen?Book tickets for Hell's Kitchen on New York Theatre Guide.Who wrote Hell's Kitchen?Alicia Keys (music and lyrics) and Kristoffer Diaz (book) wrote Hell's Kitchen. Keys is a 15-time Grammy Award-winning musician, and Diaz is a Pulitzer Prize finalist for The Elaborate Entrance of Chad Deity.Who directed Hell's Kitchen?Michael Greif directs Hell's Kitchen. He is a four-time Tony Award nominee for shows including Dear Evan Hansen and Rent, and he also staged Hell's Kitchen's Off-Broadway premiere production.What Alicia Keys songs are in Hell's Kitchen?More than 20 Alicia Keys songs are included in Hell's Kitchen, including her world-famous hits \"If I Ain't Got You,\" \"No One,\" \"Fallin',\" and \"Empire State of Mind.\" Learn more about all the Alicia Keys songs in Hell's Kitchen on Broadway.Is the Hell's Kitchen musical appropriate for kids?Hell's Kitchen is recommended for teens and adults, as the musical contains strong language and references to violence and sex. Please note that children 4 and younger are not permitted in Broadway theatres.Originally published on Apr 20, 202423:59",
  "isFullReview": true,
  "bwwExcerpt": "Allie wants is a boyfriend, which she gets. Big deal. She stumbles into music but there’s no drama. Nothing is in her way. Her mother is doing a good job. Her father is not a bad guy. Gillian Russo, New York Theatre Guide: In a marvelous Broadway debut, 21-year-old Maleah Joi Moon plays 17-year-old Ali, a lead character inspired by a young Keys. As told through Ali's eyes, the story of her life in the title NYC neighborhood is as frenetic as any real teenager: the book by Kristoffer Diaz attempts to juggle coming of age, familial tensions, young love, racism, overpolicing, and more. With none of these themes emerging as the dominant one, what emerges instead is a reminder of Keys' marvelous songwriting talent via her soulful, soaring R&B hits — and Moon's ability to bring down the house with song after song after song. Brian Scott Lipton, Cititour: Being able to brilliantly straddle the line between (semi)autobiography and a universal coming-of-age tale is just one of the many achieve",
  "showScoreExcerpt": "\"Alicia Keys musical is on fire with powerhouse performances\"",
  "originalScore": null,
  "assignedScore": 80,
  "source": "bww-roundup",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:02:03.835Z",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HELLS-KITCHEN-Opens-On-Broadway-20240421",
  "textStatus": "complete",
  "textWordCount": 1482,
  "archivePath": "data/archives/reviews/hells-kitchen-2024/nytg--unknown_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:00:35.946Z"
}