{
  "showId": "hells-kitchen-2024",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/ob/11_19_23.html",
  "publishDate": null,
  "fullText": "Ali (Maleah Joi Moon, a sparkling bundle of talent making her theatrical debut) and her single mom, Jersey (Shoshana Bean, a theatre vet and knockout talent in her own right), live in the heart of things at the Manhattan Plaza apartment complex on the western edge of the Times Square area, in the neighborhood that bears the same name as the show's title: Hell's Kitchen.\n\nAs a character, Ali is a stand-in if not for Alicia Keys herself, then for the whirlwind of memories of the world into which the show's composer, lyricist, and music arranger was born. Keys, a genuine power broker in the music industry, has been working on Hell's Kitchen with its bookwriter Kristoffer Diaz (a Pulitzer Prize finalist for The Elaborate Entrance of Chad Deity) for more than a decade. She has been quite clear about her goal of taking it to Broadway following what is now a sold-out, twice-extended run at the Public. During the journey to this point, she has been joined by director Michael Greif (Dear Evan Hansen, Rent) and much-in-demand choreographer Camille A. Brown (Once on this Island Broadway revival, Fire Shut Up in My Bones for the Metropolitan Opera).\n\nIt should be noted, as it has been in the advertising for Hell's Kitchen, that Keys is not appearing in the show, and that any resemblance between Ali and the superstar is mere coincidence. So let's just consider Ali as the conduit through whose eyes we experience the energy and the angst of teenagehood. But don't expect an adult's eye view of a misty past; this is not a memory play but one which is unfolding as events occur. As Jersey sings in \"Seventeen,\" one of the show's three brand new songs (20 others are reconceptualized, newly arranged numbers from Keys' vast songbook), \"she's seventeen and her brain just don't work.\"\n\nAs interesting as it is to live at the Manhattan Plaza (a very real place that provides subsidized rentals to those in the performing arts), it is the world outside that Ali longs to be part of. Her friends, the music, the dancing, the good looking older guys who are perfecting the art of bucket drumming while looking hot. But Mom, boringly predictable (\"every night dinner between six and six-thirty before she leaves for work\") and demanding (\"In bed by nine; homework done before then\"), keeps interfering. Indeed, she has enlisted the doorman and various friends from the neighborhood to keep an eye on Ali while she is away. \"I don't know what she thinks she's keeping me safe from. Far as I can tell, there ain't much to fear outside this apartment door.\"\n\nWell, for one thing, there is the reason Jersey is trying to keep the flame burning low. That would be her own experience with Ali's mostly absent father Davis (Brandon Victor Dixon, as smooth as Marvin Gaye and reliable as a fox in a hen house). They met back in the era of hippiedom and free love, and guess who showed up nine months later. And now, with Ali left to her own devices while Mom works two jobs to pay the bills, here right on cue comes Knuck (Chris Lee), the good-looking guy who catches Ali's eye in a big way. Soon the hormones rise to sizzling, and while Knuck, who thinks Ali is past the legal age of consent, gallantly resists the obviously less experienced teen, it is not long before they are going full out Romeo and Juliet.\n\nBut apart from the usual high school Weltschmerz, Ali is also finding herself drawn back inside to the Ellington Room at the Manhattan Plaza, where she starts hanging out and listening to a wonderful classical pianist, a dignified older Black woman Miss Liza Jane (Kecia Lewis, whose great resonance and vocal range will make you sit up and take notice whenever she speaks or sings). She takes Ali under her wing, teaches her to play, and helps her to find a greater purpose to her life.\n\nApart from the many songs that encompass R&B, pop, hip-hop, and jazz that reflect both Keys' musical skills and the feel of Ali's world, there is Camille A. Brown's expansive choreography that powerfully serves to define the teenager's emotional state. The stage is filled to overflowing with an exceptionally fine company of dancers, with many eye-popping standouts; you'll never think for a moment that these pros are mere backdrops to the singing. Overall, the very large and gifted cast is almost too much to be contained on the stage of the Public's Newman Theater, but it's easy enough to envision it all in a much larger Broadway space, where the explosion of music and dance will likely find a better home. If Alicia Keys has anything to say about it, that will happen soon enough.\n\nHell's Kitchen\nThrough January 14, 2024\nPublic Theater, Newman Theater, 425 Lafayette Street (at Astor Place), New York NY\nTickets online and current performance schedule: PublicTheater.org",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 831,
  "archivePath": "data/archives/reviews/hells-kitchen-2024/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:57:33.344Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "sourceMethod": "brightdata"
}