{
  "showId": "hells-kitchen-2024",
  "outletId": "theaterscene-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://theaterscene.com/Hell-Kitchen-DD.html",
  "publishDate": null,
  "fullText": "Editor : Jeannie Lieberman | \n    Submit an Article | \n    Contact Us\n\nMaleah Joi\nMoon and the company of Hell's Kitchen. (Photo: Marc J. Franklin)\n\nThe\nnew Alicia Keys-scored musical Hell's Kitchen is now heating up the\nboards at the Shubert Theatre. Inspired by the life of Alicia Keys&#8212;global\nmegastar and winner of fifteen Grammy Awards&#8212;it focuses on several months in\nthe life of a musically precocious seventeen-year-old girl in New York in the\n1990s.\n\nHell's\nKitchen got its stage\nlegs during the fall 2023 season at the Public Theater. While the show received\nmostly favorable reviews, some critics felt it was a tad repetitive. The good\nnews is that the Broadway version has a stronger spine, the characters' arcs\nare more clearly defined, and the dancing is crisper.\n\nPrimarily\nset in the midtown Manhattan neighborhood of Hell's Kitchen, we meet Ali\n(Maleah Joi Moon in a powerful Broadway debut) who yearns for art and love, and\nher mother Jersey (Shoshana Bean), a sometime actress who works part-time at\nvarious office jobs. They live at Manhattan Plaza, an apartment building that\noffers affordable housing for artists. The relationship between Ali and Jersey\nprovides most of the conflict in the story: Ali wants her mother to stop\nsmothering her with love and restricting her freedom; Jersey wants Ali to stay\noff the city streets and not make the same mistakes that she did as a teenager.\n\nKristoffer\nDiaz' book doesn't sugarcoat this coming-of-age story. He portrays Ali as a\nrebel and Jersey as a devoted, if overreactive, mom who's trying to prevent her\ndaughter from becoming involved with Knuck (Chris Lee), the drummer who jams\nwith his friends, 'Riq (Lamont Walker II) and Q (Jakeim Hart) outside Manhattan\nPlaza. To this end, Jersey talks with their doorman Ray (Chad Carstarphen), in\nhopes of having Knuck and his buddies arrested. But Ray reminds Jersey that\nhe's not a policeman:\n\nJersey:\n\"Listen: if you see any of those boys talking to my daughter, have them\narrested. Hell, you have my permission to arrest her.\"\n\nRay: \"I'm not\na cop. I'm the doorman.\"\n\nWhile\nJersey plans to upend Ali's budding romance, Ali does what teenagers have been\ndoing for ages: she dreams up how she and Knuck can secretly continue their\nrelationship. Suffice it to say, things don't go smoothly for the young lovers.\n\nThe\nmusic is front and center in this show. And it's not only because of Keys'\nsignature anthems baked into this confection. It begins with Ali giving us an\nelevator tour of Manhattan Plaza, with the door opening up on various floors\nand her giving the audience a snapshot of who lives there. Or as she puts it:\nThere's \"Mr. Gordone, 32nd floor, forever on his trumpet... and a\nwhole string section on 27\". Little wonder that Ali herself began playing a\nmusical instrument: the piano. But, unlike what we see in the musical, Keys\nactually began tickling the ivories at the tender age of seven.\n\nKecia\nLewis, Maleah Joi Moon (Photo: Marc J. Franklin)\n\nAli's\nrelationship with her piano teacher and mentor, Miss Liza Jane (Kecia Lewis),\nis vital to the story. A kind of Nina Simone-esque figure, Miss Liza Jane is an\nanchor for Ali, offering the teen both musical instruction and lessons on life.\nAli's bonding with Miss Liza Jane, however, leads to some resentful feelings\nfrom Ali's mother Jersey. Or as Jersey bluntly says to Miss Liza Jane in the\nEllington Room:\n\nJersey:\n\"Listen: I get that you and this piano are her shiny new toys and I'm just the\nannoying old monster who constantly reminds her to do dumb things like eat\ndinner, stay out of trouble, you know, maybe not get pregnant before she\nfinishes high school. She likes you. She hates me. That's fine. But she is my\ndaughter.\"\n\nIf\nthe mother-daughter battles keep the audience leaning in, the nearly two dozen\nmusical numbers from Keys' catalog that waft over the footlights are utterly\nmesmerizing. There are her mega-hits, including \"Girl on Fire,\" \"If I Ain't Got\nYou,\" and \"Empire State of Mind.\" Keys also composed some new songs for the\nmusical, most notably \"Kaleidoscope,\" which focuses on Ali's first meeting with\nher piano teacher, Miss Liza Jane.\n\nManhattan\nPlaza is a key character in the musical. Beyond providing real New York flavor\nto the piece, it also points out that Ali was not born with a silver spoon in\nher mouth. Indeed, whether we witness her arguing with her single working\nmother or briefly reconnecting with her often-absent dad, Ali evidently is not\na child of privilege.\n\nMaleah Joi\nMoon, Chris Lee, and the company of Hell's Kitchen (Photo: Marc J. Franklin)\n\nThe\nacting is top-notch. Maleah Joi Moon is a triple threat with titanium pipes,\nhip-hop dance moves, and a natural acting style. Shoshana Bean is well-cast as\nthe mother who finds it difficult to let go of her only child. Kecia Lewis\nlooks regal as Ali's piano teacher and delivers her speeches with ancestral\nwisdom. Brandon Victor Dixon, as Ali's father Davis, comes across as an\nambitious artist who hasn't yet learned how to balance his art and life. Chris\nLee's Knuck is spot-on as Ali's love interest, a street-smart young man who has\na vulnerable side.\n\nCamille\nA. Brown's dazzling choreography is the pulsating heartbeat of the musical,\npushing the story forward with its hip-hop vibe. Hell's Kitchen is the\nfifth Broadway show that Brown has worked on, and it shows her at her very\nbest. Little wonder she has snagged her first Tony nomination for her work on\nthis musical, not to mention her Drama Desk and Outer Critics Circle\nnominations.\n\nRobert\nBrill's dynamic, ever shifting set captures the landscape of the city and\nreflects its vibrancy. Brill, who also designed the set for the show's Off-Broadway\nrun at The Public, had to fill the larger spaces of the Shubert. And he did,\nwith sensational results.\n\nWhile\ncargo pants and matching tops might not be the stuff of glamor, Dede Ayite's\nurban outfits for the cast cut the mustard and are right in step with the 90s.\nTheatergoers might remember that Ayite worked on another Broadway show earlier\nin the season, Jaja's African Hair Braiding, and her costumes have also graced\nmany others on the Great White Way.\n\nAs\nably directed by Michael Grief, Hell's Kitchen is a musical that tells\nan uplifting New York story. Why not visit the Shubert and be inspired?\n\nFor tickets https://www.hellskitchen.com/broadway/tickets\n\nRunning time:\n2:30 with intermission.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1083,
  "archivePath": "data/archives/reviews/hells-kitchen-2024/theaterscene-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T02:04:44.135Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241006170924",
  "archiveOrgUrl": "http://web.archive.org/web/20241006170924/https://theaterscene.com/Hell-Kitchen-DD.html"
}