{
  "showId": "hells-kitchen-2024",
  "outletId": "theatrereviews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theatrereviews.com/off-broadway-review-hells-kitchen-at-the-publics-newman-theater-through-sunday-january-7-2024/",
  "publishDate": null,
  "fullText": "Immediately after the first number in the new musical “Hell’s Kitchen” which is a loosely based auto biographical story about musician Alicia Keys growing up and coming of age during the late nineties in the New York City neighborhood which the show is named after, you get the feeling this might be headed to Broadway. That assumption would be right since The Public Theatre, where the show is now playing, has already announced the move uptown to The Shubert Theatre with previews beginning in March 2024. The production can be considered a juke box musical with all the songs chosen from the catalog of Alicia Keys, except for three new originals written by the artist. Directed by Michael Greif, it is smooth, slick and saturated with energy overflowing and powerhouse vocals that raise the roof. The story revolves around a mixed race seventeen-year-old Ali (a curious and determined Maleah Joi Moon), daughter of a white single mother Jersey (a domineering Donna Vivino), a former actor, and a black jazz pianist Davis (a sharp and silky Brandon Victor Dixon). Ali and her overly protective mother live in Manhattan Plaza, a federally funded apartment complex built in the seventies, mostly dedicated to housing tenants that worked in the performing arts. Ali longs to become part of the nitty gritty fabric of the city, while her mother keeps tight reigns, garnering help from close friends, neighbors and the doorman. Sneaking out of the building after her mother leaves for her second job, she meets African American, dreadlocked Knuck (a smart, sensitive and serious Chris Lee), who is a street performer by night and apartment painter by day. He is not interested but Ali persists, lying about her age, and finally getting caught having sex in the apartment after her mother leaves for work. Her mother calls the police, Knuck ends up not being arrested, and Jersey calls the estranged Davis for help. In her despair Ali barges into the music room, interrupting resident pianist and teacher Miss Liza Jane (a remarkable Kecia Lewis), playing the piano, enjoying peace and solitude. This is the turning point for Ali where her love of music and the piano is awakened, as this symbiotic relationship develops. In the end, each of the principal characters follows their heart and all ends well. The body of the show is without a doubt the music, while the soul can be accredited to the energetic choreography of Camille A Brown. Although some of the movement after a while seems repetitious, that might be attributed to over produced direction, where dance at times seems inappropriate and unnecessary in certain scenes becoming more of a distraction. The book by Pulitzer Prize finalist Kristoffer Diaz, is the weakest link, with a sort of rom com feel that never provides depth or delineation to the characters. Costume design by Dede Ayite is spot on for the period, and the versatile set designed by Robert Brill resembles the skeleton of city buildings, providing enough windows to view the ever-changing projections of Peter Nigrini which designate location. The entire cast is incredible, with boundless energy and commitment to the production. Miss Moon gives a brilliant break out professional debut, with strong vocals and dynamic stage presence. At this performance Donna Vivino understudied Shoshana Bean, and impeccably performed the role of Jersey, being sincere, savvy, cynical and strong, but always vulnerable. She delivers powerful and dramatic vocals. Mr. Lee creates a smart, passionate, levelheaded Knuck, determined to escape the unjust turmoil of the city. Mr. Dixon provides Davis with smooth vocals and a suave, ambiguous behavior that makes the audience hate to love him. Miss Lewis embodies a diva in her interpretation of Liza Jane, straightforward, calculated, controlled and masterful. Here vocals are triumphant and haunting, filled with emotion. This musical, although not perfect and hardly thought provoking, is bursting at the seams waiting for the chance to build and expand onto a larger stage. Only time will tell if it proves to be a worthy product for Broadway. The most recent offering at MCC Theater is a new musical entitled “The Lonely Few” with music and lyrics by Zoe Sarnak and a book penned by Rachel Bonds. Basically, it can be considered a rom com musical with a simple plot that takes a bit too long to develop… Currently running at the Public’s Newman Theater, “The Harder They Come” is based on the 1972 film by the same name produced and directed by Perry Henzell and co-written with Trevor Rhone. The first paragraph of David Katz’s guest essay added to the Library of Congress National Registry in 2020 summarizes the film… Lorraine Hansberry’s “A Raisin in the Sun” debuted on Broadway in 1959 and appeared in London’s West End five months later. The musical adaptation “Raisin” won the Tony Award for Best Musical in 1973 and the play had two Broadway revivals in 2004 and 2014. This powerful and ground-breaking story…",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 824,
  "archivePath": "data/archives/reviews/hells-kitchen-2024/theatrereviews-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T02:04:57.885Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "sourceMethod": "playwright"
}