{
  "showId": "hells-kitchen-2024",
  "outletId": "thewrap",
  "outlet": "TheWrap",
  "criticName": "Robert Hofler",
  "url": "https://www.thewrap.com/hells-kitchen-broadway-review-alicia-keys/",
  "publishDate": "April 20, 2024",
  "fullText": "As monikers go, “Hell’s Kitchen” is much sexier than “Manhattan Plaza” — which is probably why Alicia Keys’ new stage musical, with a book by Kristoffer Diaz, goes for the much hotter title. After its world premiere last year at the Public Theater, “Hell’s Kitchen” opened Saturday at the Shubert Theatre on Broadway.\n\nThe musical is reportedly semi-autobiographical; in press reports, the words “loosely based on” are sometimes used. Diaz’s book looks back at the singer-songwriter’s life as a teenager, growing up with a single mother in the Manhattan Plaza apartment complex, located in the southern end of Hell’s Kitchen between 42nd and 43rd Streets. Nothing could be more different from the old tenements of Hell’s Kitchen, once home to Irish immigrants, than the high-rise apartment towers that were built in the 1970s to house upper-middle-class tenants.\n\nWhen renters with that kind of money didn’t pony up to live on the doorstep of sordid Times Square, Manhattan Plaza turned itself into a haven for people in the performing arts, devoting 70% of its nearly 1,700 apartments to such artists at reduced/regulated rent. The elderly and neighborhood residents continue to make up the remainder of its occupants.\n\nEarly in “Hell’s Kitchen,” the 17-year-old Ali (Maleah Joi Moon) sings a lovely what-I-want song titled “The River,” in which she laments being stuck on the 42nd floor of a Manhattan Plaza tower with her mother, Jersey (Shoshana Bean). Her only solace is the apartment’s view of the Hudson River, a source of inspiration that symbolizes this teenager's desire to be released and swept away.\n\n“The River” delivers because it is one of only four songs written specifically for this musical. It’s what’s called a book song, establishing a character and moving the story forward, and director Michael Greif takes full advantage of the moment.\n\nHe prepares us for “The River” by establishing this production’s most effective visual leitmotif: Natasha Katz’s lighting and Peter Nigrini’s projections, which replicate the many floors of Manhattan Plaza, each delivering a different musical motif to embody the assorted artists living there.\n\nWhen Ali isn’t trapped way upstairs, she meets a group of young street musicians who bang on bucket drums and run into trouble from a bunch of tight-ass white people — including Ali's mother — who want to sleep (or read a book or watch porn in peace) and end up calling the police to stop the noise.\n\nExcuse me, the music.\n\nDisclaimer: I live in Hell’s Kitchen a few blocks north of Manhattan Plaza, so I had a little problem cheering for this supposedly put-upon character named Ali who has an unobstructed view of the Hudson River — but there are “dirty windows,” she complains — and who adamantly supports those noisy drummers. I also had to wonder how her single mother, since she is no longer an actor, gained entry to Manhattan Plaza with its reduced/regulated rents.\n\nEven to this day, the Manhattan Plaza stands as a collection of ivory towers in this erstwhile gritty neighborhood, with all the meanings that the words “towers” and “ivory” convey, including the word “white.” Yet Keys’ songs and Diaz’s book never explore the special status of Ali’s residence at Manhattan Plaza.\n\nAli blithely blows off all her advantages by telling us, “best thing about seeing [the doorman] is: once you walk past him and get through these doors, it’s like all New York City is singing to you.” Like so many 17-year-olds, Ali doesn’t see her privilege because she is privileged.\n\nKeys and Diaz instead focus on their young heroine’s burgeoning sexual desire and her hot pursuit of one of the street drummers, Knuck (Chris Lee). It is refreshing to see the tables turned — here, the girl aggressively pursues the boy, who remains the elusive love object. Ali even follows Knuck to his place of employ, where he paints the exterior of buildings atop a ladder. Robert Brill’s set beautifully utilizes scaffolding both to suggest the cityscape and to house members of the orchestra.\n\nAs played by Moon, Ali is all cocky and assured in her desire to seduce the remote Knuck; however, after a while, it’s no more interesting to hear a man repeatedly say “no” than it is to hear a woman repeatedly say “no” before the inevitable romantic surrender. At a certain point in “Hell’s Kitchen,” you may want to yell at the stage, “Would you two screw so we can get this story started?” When they finally do have sex, it’s clear that Moon and Lee have simulated this task too many times on stage, since they both shed their costumes with all the finesse of a couple of robots.\n\nBeyond her finally getting laid, Ali's big concern is coping with her overly protective mother, who has never recovered from being abandoned by Ali’s father (Brandon Victor Dixon). Most of the songs in “Hell’s Kitchen” are Keys standards. It’s nice to hear them sung so well — the exception being the angry “Pawn It All,” which Shoshana Bean caterwauls to such an extreme that it surpasses Leslie Rodriguez Kritzler’s parody of a caterwauling diva in the current “Spamalot” revival.\n\n“Pawn It All” and the nearly 20 other Keys songs from her many albums are not book songs. They effectively encapsulate an emotion or a state of mind, but they stop the narrative cold. To keep the show moving, Greif’s direction beefs up these moments by enlisting choreographer Camille A. Brown to overpopulate the stage with dancers who stomp, wave, thrust, swivel and perform other exercises.\n\nSeveral of these choreographed moments are even delivered while a solo or duet is being performed, as if wonderful vocals weren’t enough. It’s a theatrical access that is already a cliché at the stuffy old Metropolitan Opera, where, ever since HD performances have been broadcast to cinemas around the world, directors feel the need to give audiences something visual to keep them from refilling their boxes of Jujyfruits.\n\nAn interesting feature of Greif’s direction is how it tends to leave Brandon Victor Dixon alone and uninterrupted when he sings. Only once during his four songs does a dancer feel the need to take focus away from the singing. Dixon consistently mesmerizes, and even though he’s essentially playing the villain here, he gives by far the show’s most reserved and powerful performance.\n\nSince “Hell’s Kitchen” doesn’t have much of a story to tell, Diaz pumps up the drama in a couple of ways that ultimately feel false. He ends Act One of this two-and-a-half-hour musical with the cops confronting Knuck, which leads to the delivery of the Keys 2020 single “Perfect Way to Die.” The reference to Black Lives Matter is powerful, but provides more weight than this musical can sustain — especially when the facts of Knuck’s “arrest” are revealed in Act Two.  \n\nThe other Big Faux Drama comes when Ali overhears a pianist at Manhattan Plaza. She’s a woman incredulously named Miss Liza Jane (Kecia Lewis), who is based on Keys’ real piano teacher, the famed Margaret Pine, wife of character actor Larry Pine. As played by Lewis, Miss Liza Jane resembles that old MGM trope of an émigré ballet or voice instructor (often played by Maria Ouspenskaya) who lives atop Carnegie Hall and whose extreme condescension is meant to convey her artistic rigor. In “Hell’s Kitchen,” this character is a pompous bore, although Miss Liza Jane’s technique for teaching piano is as delightfully absurd as the way Johann Strauss (Fernand Gravey) composes music in 1938’s camp classic “The Great Waltz.”\n\nOn Broadway, Ali is so excited by her piano lessons that she sings a song not heard in “Hell’s Kitchen” at the Public Theater. The new song is titled “Kaleidoscope,” and I had to look up the lyrics because they are undecipherable when performed in the Shubert Theatre. Here’s a sample: “Kaleido-leido-leido-leido-leido-leidoscope/Everyone looking high and low, oh yet, oh no/You’re movin’, movin’, movin’, movin’ way too slow/I think I got that antidote, oh yea, oh no, huh.”\n\nKeys and Diaz can concoct any story they want, and what they’ve come up with resembles a publicist’s press release. Keys started taking piano lessons as a child, not at 17. Her father was a flight attendant, not a jazz singer-pianist. Her piano teacher was white, not a Black historian of African American music.\n\nClearly, Keys’ real-life privilege and rather ordinary childhood (except for living among hundreds of first-rate artists in a doorman building with a spectacular but “dirty” view of the Hudson River) would not play well with her fans who want to worship a far edgier idol.\n\n\t\t\tRead Next\n\n\t\t\tAlicia Keys&#039; Super Bowl Voice Crack Autotuned in Official Video Posted After Halftime Performance | Video",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HELLS-KITCHEN-Opens-on-Broadway-20240420",
  "dtliThumb": "Meh",
  "scrapedAt": "2026-01-23T22:04:15.779Z"
}