{
  "showId": "hells-kitchen-2024",
  "outletId": "timeout",
  "outlet": "TimeOut",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/hells-kitchen-musical-broadway-review-alicia-keys",
  "publishDate": "2024-04-20T22:17:06-04:00",
  "fullText": "Broadway review by Adam Feldman Hell’s Kitchen, whose score is drawn from the pop catalog of Alicia Keys, could easily have gone down in flames. Jukebox musicals often do; songs that sound great on the radio can’t always pull their weight onstage. But playwright Kristoffer Diaz, director Michael Greif and choreographer Camille A. Brown have found the right recipe for this show—and, in its vivid dancers and magnificent singers, just the right ingredients—and they've cooked up a heck of a block party. Inspired by Keys’s life, Hell’s Kitchen has the sensibly narrow scope of a short story. Newcomer Maleah Joi Moon—in a stunningly assured debut—plays Ali, a beautiful but directionless mixed-race teenager growing up in midtown’s artist-friendly Manhattan Plaza in the 1990s, a period conjured winsomely and wittily by Dede Ayite’s costumes. The issues Ali faces are realistic ones: tensions with her protective single mother, Jersey (Shoshana Bean); disappointment with the charming musician father, Davis (Brandon Victor Dixon), who yo-yos in and out of their lives; a crush on a thicc, slightly older street drummer, Knuck (Chris Lee); a desire to impress a stately pianist, Miss Liza Jane (Kecia Lewis), who lives in the building. Hell’s Kitchen | Photograph: Courtesy Marc J. Franklin The show’s chain of Keys songs is its most obvious selling point, but it could also have been a limitation. Musically, the tunes are not built for drama—they tend to sit in a leisurely R&B groove—and the lyrics, while effective, are not especially inventive or rigorous. (Describing New York City as a “concrete jungle where dreams are made of [sic]” is careless enough writing to make a person [sic]). What they do deliver is a vibe, and Greif’s production rides it smartly. It lets the songs set a general tone while clear acting beats take care of the specifics; the characters relate around the songs as much as through them. And Diaz rolls out Keys’s oeuvre in a way that complements his coming-of-age narrative. Hell’s Kitchen’s first half is constructed around relatively unfamiliar material, including a few new songs written for the show. “Girl on Fire” flares up toward the end of the first act in a number led by Ali’s friends Tiny (an ebullient Vanessa Ferguson) and Jessica (Jackie Leon), the Bess and George to her Nancy Drew; but otherwise, the biggest Keys hits—including “Fallin’,” “If I Ain’t Got You” and “No One”—are saved for after intermission, as though to reinforce our sense of Ali’s growing confidence and maturity. We don’t need much convincing on that front. With apologies to astronomers: Moon is a star. Beneath Ali’s failed efforts to look cool are a mess of strong feelings—she’s at an age where everything seems important—but beneath those strong feelings is the actual cool of a young performer with the self-possession to own a Broadway stage. And Moon’s unforced, distinctively breathy voice sits perfectly between those of her two maternal figures in the show. Below her is Lewis’s cavernous contralto; when Miss Liza Jane closes the first act with a shattering “Perfect Way to Die,” a song about police violence, it’s like the earth itself is rising up in pain. And above her is the muscular mix of Bean’s high belt, which she flexes in a furious musical tirade, “Pawn It All,” whose staggeringly precise runs stop the show cold. Dixon’s vocals, meanwhile, help explain why people keep falling for Davis; at least he sounds like an angel. (Garth Owen’s sound design gives all of these remarkable singers the support they deserve.) Hell’s Kitchen | Photograph: Courtesy Marc J. Franklin As its title suggests, Hell’s Kitchen extends its attention to the neighborhood beyond the central story. The fire escapes and signage of Robert Brills’s scenic design and Perter Nigrini’s projections, augmented by the dazzle of Natasha Katz’s lighting, help set the urban scene. But the most important factor is Brown’s outstanding choreography: Executed gorgeously by an ensemble that includes several dancers she has worked with in the past, the show’s bold and graceful movement summons a world of kinetic energy for Ali to tap into when she is finally able to organize her talent. When Hell’s Kitchen inevitably concludes with “Empire State of Mind,” the song doesn’t feel tacked on, because New York has been keenly felt throughout the show. It may touch on social issues of consequence, but Hell’s Kitchen is ultimately a celebration of the city—and the people who make it pop. Hell’s Kitchen. Shubert Theater (Broadway). Music and lyrics by Alicia Keys. Book by Kristoffer Diaz. Directed by Michael Greif. With Maleah Joi Moon, Shoshana Bean, Kecia Lewis, Brandon Victor Dixon, Chris Lee, Vanessa Ferguson, Jackie Leon. Running time: 2hrs 30mins. One intermission. Follow Adam Feldman on X: @FeldmanAdamFollow Time Out Theater on X: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page Hell’s Kitchen | Photograph: Courtesy Marc J. Franklin Been there, done that? Think again, my friend. By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. Thanks for subscribing! Look out for your first newsletter in your inbox soon! Discover Time Out original video",
  "isFullReview": false,
  "bwwExcerpt": "As its title suggests, Hell’s Kitchen extends its attention to the neighborhood beyond the central story. The fire escapes and signage of Robert Brills’s scenic design and Perter Nigrini’s projections, augmented by the dazzle of Natasha Katz’s lighting, help set the urban scene. But the most important factor is Brown’s outstanding choreography: Executed gorgeously by an ensemble that includes several dancers she has worked with in the past, the show’s bold and graceful movement summons a world of kinetic energy for Ali to tap into when she is finally able to organize her talent. When Hell’s Kitchen inevitably concludes with “Empire State of Mind,” the song doesn’t feel tacked on, because New York has been keenly felt throughout the show. It may touch on social issues of consequence, but Hell’s Kitchen is ultimately a celebration of the city—and the people who make it pop.      Jackson McHenry, Vulture: Moon, to her credit, grounds all this wherever she can. She’s a great discovery, a virtuoso who also appears surprised and delighted by her own talent. In Dede Ayite’s throwback ’90s costumes — so much Tommy Hilfiger, such giant pants — Moon has both swagger and that crucial touch of naïveté that makes Ali feel like a real and contradictory teenage girl, even when the plot swerves around her. Her voice, for all its power, has a sandpaper edge, a texture that makes her stand out when so many young singers sound cleanly uniform. If only the material written for her could be as distinctive.",
  "originalScore": null,
  "assignedScore": 88,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HELLS-KITCHEN-Opens-on-Broadway-20240420",
  "textStatus": "complete",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.920Z",
  "showScoreExcerpt": "\"Hell’s Kitchen is ultimately a celebration of the city—and the people who make it pop.\"",
  "textWordCount": 869,
  "textFetchedAt": "2026-01-25T14:27:30.890Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/hells-kitchen-2024/timeout--adam-feldman_2026-01-25.html",
  "textQuality": "partial",
  "sourceMethod": "bww-roundup",
  "scoreSource": "sentiment-strong-positive",
  "scoreConfidence": "medium"
}