{
  "showId": "hells-kitchen-2024",
  "outletId": "variety-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://variety.com/2023/legit/reviews/hells-kitchen-review-alicia-keys-musical-1235795883/",
  "publishDate": null,
  "fullText": "&#8220;Hell&#8217;s Kitchen,&#8221; playwright Kristoffer Diaz&#8216;s new musical with songs by Alicia Keys, begins at a dinner table. 17-year-old Ali (a magnetic Maleah Joi Moon, making her professional debut) has dinner with her mom, Jersey (Shoshana Bean), in their Hell&#8217;s Kitchen apartment every night at the same time. It&#8217;s a routine that Jersey insists on to keep Ali safe from the perils of New York City in the 1990s. But for Ali, their one-bedroom apartment on the 42nd floor feels like a cage. She longs to hang out with her friends, listen to music and flirt with an older drummer named Knuck (Chris Lee), who uses the courtyard of their Manhattan Plaza building as his stage.\n\nStyled in baggie jeans, Timberland boots, Tommy Hilfiger crop tops and gold chains, Ali speaks directly to the audience about her feelings, dreams and desires. She welcomes viewers into her beautifully chaotic teenage world as if opening up her diary. Without an outlet to express herself, she comments on her increasing frustrations with Jersey&#8217;s overbearing attitude while gathering the courage to approach Knuck.\n\nIt&#8217;s difficult to unlock the experience of being a 17-year-old girl, but under Michael Greif&#8217;s direction, &#8220;Hell&#8217;s Kitchen&#8221; does just that. Loosely based on Grammy Award winner Keys&#8217; personal experiences, the musical, now premiering at the Public Theater, captures Ali&#8217;s ever-evolving emotions and her quest for freedom. Despite her mother&#8217;s rules, Ali rebels against them, staying out late, getting to know Knuck intimately and fighting Jersey at every turn.\n\nBecause her estranged father, Davis (Brandon Victor Dixon), is a professional musician, Ali only begrudgingly learns to play the piano from her stern neighbor, Miss Lisa Jane (Kecia Lewis). But soon she discovers that music might be the best way to convey her feelings.\n\nWith absolute powerhouse vocals from the cast and songs written by Keys with orchestrations and arrangements by Emmy and Grammy winner Adam Blackstone, &#8220;Hell&#8217;s Kitchen&#8221; moves beyond Ali&#8217;s teenage experiences. The play also showcases Jersey&#8217;s perspective as a single mother determined to get her daughter to make different choices from her own. Though Keys&#8217; iconic music is used throughout, Diaz and Blackstone don&#8217;t haphazardly sprinkle the tunes across two acts. Instead, tracks like &#8220;You Don&#8217;t Know My Name&#8221; and &#8220;Fallin&#8221; come thundering forward from surprising characters at unexpected times.\n\nThe set design, though simple, captures the essence of New York City. Designer Robert Brill uses black steel rectangles to showcase the city&#8217;s vertical structures and linear lines. Image projection is used in the background to orient the audience in a specific neighborhood or place. The minimalism of the stage and Ali&#8217;s earnest narration make the viewers feel a part of the production rather than just spectators.\n\nIn addition to Moon and Bean&#8217;s sensational vocal range, &#8220;Hell&#8217;s Kitchen&#8221; illustrates how tender mother/daughter relationships can be. It also reflects the issues underlying New York City in the &#8217;90s while demonstrating the impact of loss, absentee fathers and over-policing in communities of color. Since the play runs at a lengthy 2 hours and 30 minutes (including an intermission), these themes are often drawn out and sometimes feel clich&eacute;, bordering on corny. However, the absolute dynamism of the cast keeps the show from falling into pure melodrama.\n\nStill, &#8220;Hell&#8217;s Kitchen&#8221; is a quintessential musical. Some of the dancing is over-elaborate at times, especially during tender numbers like &#8220;Hallelujah/Like Water&#8221; or sensual moments including &#8220;Un-thinkable (I&#8217;m Ready).&#8221; While these segments could have shined with the singing alone, the ensemble&#8217;s talent is undeniable. With stunning harmonies and the infusion of on-stage pianists, guitarists and drummers, the show feels like watching a glorious tapestry come together.\n\nWhen it&#8217;s all said and done, &#8220;Hell&#8217;s Kitchen&#8221; is more than a story about a young woman&#8217;s first love affair. Ali&#8217;s involvement with Knuck is a central component, but as one of her homegirls points out, having a man isn&#8217;t the sole all-important element of the narrative. Instead, &#8220;Hell&#8217;s Kitchen&#8221; is a sparkling story paying homage to New York, to that beautiful and heartbreaking transition between girlhood and womanhood and to the women who hold our hands through it all.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 680,
  "archivePath": "data/archives/reviews/hells-kitchen-2024/variety-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:37:26.638Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20231212034525",
  "archiveOrgUrl": "http://web.archive.org/web/20231212034525/https://variety.com/2023/legit/reviews/hells-kitchen-review-alicia-keys-musical-1235795883/"
}