{
  "showId": "children-of-a-lesser-god-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2018/04/11/children-of-a-lesser-god-joshua-jackson-broadway/",
  "publishDate": "2018-04-11T20:55:50",
  "fullText": "It’s a bizarre decision, to revive Children of a Lesser God in 2018.\n\nAnd it’s an equally bizarre decision to open said production with several uninterrupted minutes of Stevie Wonder, played over a moodily lit stage, after the houselights are down and as audience members shift awkwardly in their seats, wondering if it might be some new sort of exhortation to unwrap your hard candies.\n\nPerhaps the problem is that rights weren’t available to the more obvious sound cue here, a dramatic reading of Kipling’s “The White Man’s Burden.” Because this is a play that holds as its hero a hearing, white, male bully of a speech teacher, boldly dedicated to saving his hearing-impaired charges by training them to speak and, occasionally, with the attractive female ones, committing light sexual assault. It was a Tony Award winner for best play in 1980, translated into the William Hurt-Marlee Matlin film in 1986, and now, freshly revived at Studio 54, appears today as a remarkably, uncomfortably dated work. (Though Roundabout Theatre Company gets a producer credit, presumably because it’s the landlord, this is not a Roundabout production.)\n\nThe TV and movie star Joshua Jackson gets top billing, bulldozing his way through his Broadway debut. He’s James Leeds, a theoretically charismatic new therapist at a school for the deaf. He is an idealist, we’re made to believe, a sixties wannabe-radical (he burned his Blue Cross card to protest the draft, because he was scared to burn his actual draft card) who served in the Peace Corps. “The guy who taught the Ecuadorians to grow and love brussels sprouts,” he calls himself at one point, and no doubt Ecuador renamed an airport in his honor.\n\nSoon James meets Sarah, a beautiful and strong-willed student in the school, who refuses to make any effort to speak. (Lauren Ridloff, making her Broadway debut, is a former Miss Deaf America and, on the evidence, a spectacular actress.) She’s taking a political position: She’s fully able to communicate, she points out in one argument; why is it her job to learn how to communicate verbally rather than a hearing person’s responsibility to learn to sign?\n\nPlaywright Mark Medoff makes Sarah 26 years old, conveniently, but, still, she’s introduced to James as a student, a reluctant speaker whom he should “take on in his spare time.” Effectively, we’ll eventually learn, she’s a ward of the school, there since childhood, cut off from her family, happily working as a dormitory maid. When she refuses to follows James’s instruction, his solution is to ask her to dinner at “a little Italian restaurant I discovered last weekend.” The next time they get together, they fight a bit and then James stops her from leaving and forces a kiss. His next line of dialogue moves the moment from Horace-Mann-in-the-1970s weirdness to Weinstein-era alarm bells. “It’s always worked before,” he says. “See, when I get in trouble, I kiss the girl and make everything better.” She runs off.\n\nThe first act, as James continues to both bully and seduce Sarah, is icky. They fall in love, and they marry, but in a dysfunctional, James-dominated relationship. The lack of any chemistry between the leads doesn’t help. And that this production, staged by the great, Tony-winning African-American director Kenny Leon, makes Sarah (and her mother) black turns it from icky to deeply discomfiting.\n\nThe second act, when Sarah is no longer a preyed-upon student, when James the teacher is no longer shimmying up trees and through dorm windows, is less gross but no less uncomfortable. It’s even easier to mansplain when the recipient of the lectures is literally silent, and James (and Jackson’s portrayal of him) milks that to the hilt: It’s a play about deaf people, and there is constant shouting. Even the theoretically progressive point about which everyone is shouting—that deaf people are entitled to valuable lives on their own terms—is a call for self-assertion and group pride that may have been eye-opening in 1980 but seems self-evident today.\n\nChildren of a Lesser God has some things going for it. Ridloff is sensational, as expressive as she is lovely, able to convey wells of shame and frustration and pride and anger without ever uttering a word. The play is described as taking place “in the mind of James Leeds,” which labels it simultaneously a memory play and his take on the relationship with Sarah (can you imagine being such an ass even in your own recounting?) and, finally, as a world in which people hear words and the deaf are considered silent. The simple set of doorways and treetrunks, by Derek McLane, and especially the lighting, by Mike Bladassari, are lovely. Kecia Lewis has quiet, sad dignity as Sarah’s mother, John McGinty is compelling as Orin, the lip-reading student trying to take a stand for deaf rights, and Treshelle Edmond gives ebullience to Lydia, the younger student who grows infatuated with James.\n\nThe bad guy in the deaf-rights fight is the school’s punctilious director, Mr. Franklin, a man who on one hand has devoted his life to educating deaf kids and on the other says things like, “I won’t continue in the field if the subjects of my efforts are going to tell me how to minister to them.” He is a bore and an ass, and mostly forgettable, and ER residuals must not be what they used to because for some reason Anthony Edwards has chosen to take the role.\n\nEarly in the second act, Sarah believes she’s found happiness and contentment as Mrs. Leeds, cooking quiches and showing off her new blender. Eventually, by its end, she’s fled their home and James’s rages, returned to her mother. For the relationship at the heart of the play, that’s supposed to be a tragedy. For an audience today, it looks like freedom.\n\nChildren of a Lesser God opened April 11, 2018, at Studio 54 and runs through May 27. Tickets and information: childrenofalessergodbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
