{
  "showId": "children-of-a-lesser-god-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2018/04/16/children-of-a-lesser-god-mark-medoff-prize-winner-back-forthrightly/",
  "publishDate": "2018-04-16T18:18:26",
  "fullText": "When Mark Medoff’s Children of a Lesser God bowed on Broadway in 1980 after a Berkshire Theatre Group tryout, it nabbed the Tony, The Pulitzer Prize and, on opening in London, the Olivier. This isn’t to say that the Pulitzer crowd, for instance, is always right—not when in 1962 the administrators passed on Edward Albee’s Who’s Afraid of Virginia Woolf?\n\nNonetheless, the accumulated Medoff citations suggest that something positive about the drama must endure. It does in this tale of James Leeds, a teacher of the deaf who specializes in perfecting the ability to speak, and Sarah Norman (Lauren Ridloff), a deaf woman strongly uninterested in learning to speak.\n\nThough at first the argumentative Sarah rebuffs the initially patient James because he’s not deaf, he soon overcomes her resistance to him—but not her conviction never to speak. He gets through to her so effectively in one way that they begin a romance, eventually marry but then continue to differ, often volatilely, over her inflexible attitude.\n\nThey bicker vocally and through American Sign Language (ASL), with James simultaneous speaking and signing (an activity known as sim-coming). Intermittently, school head Mr. Franklin (Anthony Edwards) interrupts, as do speaking deaf students Lydia (Treshelle Edmond), who has a crush on James, and Orin Dennis (John McGinty), who sometimes resents James’s manner. Mrs. Norman (Kecia Lewis), Sarah’s mother from whom she’s been estranged, is invited back into her distressed life.\n\nAt its core Children of a Lesser God is a love story. It’s a love story that becomes a story about nurturing love in a troubled married life. It’s the story of a marriage where one partner has focused on his belief in an ability to change the other—and the unfortunate consequences of the misconception. To that end, it can be said that Medoff’s work also operates as a metaphor for any marriage where one partner is under the misguided impression that he or she can affect change when few people ever truly do. It’s a pulsing screed of miscommunications’ tribulations.\n\nThirty-eight years later, Children of a Lesser God, as tightly directed by Kenny Leon, has the power it had—and will likely have 38 years and more on. The depiction of a man and a woman who love each other but stay stubbornly committed to conflicting beliefs reflects a universal happenstance. (The same for goes for same-sex couples, of course)\n\nNeedless to say the play’s power is maximized through the forceful performances. Jackson and Ridloff offer those. At the outset, Jackson is an understanding mentor confident he’s able to get through to his students no matter how recalcitrant they may be. James’ slow realization that he’s been wrong about his intentions, as inflexible as Sarah’s, is something Jackson achieves movingly.\n\nThe indefatigable Sarah—whose fury about an unwelcoming hearing world is constant and whose fragility is underlined by costume designer Dede Ayite’s filmy outfits—is outstanding. She’s a dervish of discontent. Lewis, Edmond, McGinty, and Lewis, as well as Julee Cerda as part of a commission investigating the school, are fine in support.\n\nDerek McLane has designed what at first looks to be a puzzlingly abstract set. Prominent on it are a series of doors placed separately and at right angles to each other. Mike Baldassari has lighted the insides of the doorless blue frames a deep Dan Flavin pink that gives the production an eerie glow.\n\nThe reason for the unspecific location—standing for many locations—is explained by a questionable program line: “The play takes place in the mind of James Leeds.” In other words, Children of a Lesser God is a memory play. This puts it in a category including, for one unforgettable instance, The Glass Menagerie.\n\nInserting the explanatory line here has the curious effect of implying that what the audience is seeing might be factually loose, whereas it’s usually assumed that memory plays, unless otherwise mentioned in the script, are presenting unvarnished truths.\n\nSince many patrons may not even find this disclaimer, it can’t be regarded as more than a minor drawback. Not so minor is another problem in the writing and performing. Throughout the play, James not only translates what Sarah is saying but also speaks and signs everything he says. Unfortunately, the process, not required in real life, is increasingly trying.\n\nIt’s especially so because much of the intensifying dialog that leads to the play’s harrowing climax is unnecessarily repetitious. It may be that the Tony, Pulitzer and Olivier deciders thought so highly of the themes at hand that they overlooked the attenuation.\n\nBut nowadays? Since 1980 playwriting has been noticeably transformed.   Then, the trend towards intermissionless 90-minute (or shorter) plays hadn’t quite kicked in. Were Medoff writing Children of a Lesser God today, however, he might have kept it trimmer, thereby minimizing both the strain on any actor taking up the demands of the James Leeds and the strain on viewers having to listen to and watch him carry unrelentingly on.\n\nNevertheless, what Sarah and he have to say to each other, no matter now they express it, is emotionally cogent. Children of a Lesser God packs the solar plexus wallop punch it always has.\n\nChildren of a Lesser God opened April 11, 2018, at Studio 54 and runs through May 27. Tickets and information: childrenofalessergodbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
