{
  "showId": "floyd-collins-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2025/04/21/floyd-collins-jeremy-jordan-goes-deep-as-a-forgotten-headliner-from-1925/",
  "publishDate": "2025-04-21T22:00:47",
  "fullText": "It is good to hear and see Floyd Collins again. The musical about a man who is trapped in a Kentucky cavern – and what happens 200 feet above his head over the next three weeks – is a challenging work to produce successfully. Few companies have the resources to fulfill the beautiful, yet demanding score created by Adam Guettel and the dark, real-life saga crafted by Tina Landau. Lincoln Center Theater has a deservedly fine reputation for staging musical theater works – Guettel’s lovely The Light in the Piazza among its premieres – and does well by Floyd Collins in its revival of the 1996 work that opened Monday at the Vivian Beaumont Theater.\n\nJeremy Jordan shines in every way amid the darkness of the story and his bleak surroundings as a young spelunker who hopes to find a tourist attraction and instead finds himself stuck in crumbling, wet rubble in the deep underground. Floyd’s scary situation soon explodes into the headline sensation of 1925. Amid efforts to extricate Floyd, a horde of 20,000 thrill-seekers arrives, plus various hucksters and others wanting to make a buck. Significant characters are Clyde’s hardscrabble Kentucky relatives, their neighbors and his would-be rescuers.\n\nSophisticated in terms of its craft but artfully giving the impression of homespun substance, Floyd Collins is a sorrowful musical drama that is illuminated by often beautiful music reflecting the story’s bluegrass and country & western environs. Guettel’s sonorous score is orchestrated by Bruce Coughlin for a dozen musicians and flavored with licks of banjo and harmonica. Fiddles and stringed instruments prevail, while the sweet harmonies heard among the vocal arrangements would make Grand Old Opry lovers swoon. In varying degrees, key musical sequences integrate echo effects aptly provided by sound designer Dan Moses Schreier.\n\nGuettel’s lyrics share an easy, spontaneous quality, and if there is an inevitable quality to Landau’s two-act text – at least to anyone who knows in advance how things turned out – her storytelling is cogent and the characters speak like people true to their rural 1920s circumstances. (Landau also contributed lyrics.) The seeming authenticity of the musical and dramatic writing lends power to the show.\n\nThe revival is directed with assurance by Landau, who staged the off-Broadway original. While Landau obtains sterling performances from the company – more about them below – the visuals are not always satisfying, although they certainly look mighty gloomy. The Beaumont stage is vast and deep, so communicating Floyd’s claustrophobic squeeze underground is especially hard to achieve. The dots design collective and Scott Zielinski, an ace lighting designer, do better illustrating events happening upon a stark, rocky field up top; silhouetting figures and structures against bright or burning open skies and evoking ephemeral razzle dazzle for those nasty carnival doings. The Beaumont and the designers work best together for the expansive nature of Floyd’s exultant opening song and later on when the poor fella drifts into hallucinations.\n\nDressed for the most part in muddy browns and grays by designer Anita Yavich, whose lived-in clothes reinforce their characterizations, the ensemble provides fine voices and solid acting to the production, which Landau usually rolls out at a measured pace to allow the audience to appreciate the drama and its music. Jon Rua devises the fleeting dance sequences, notably a cheerful vaudeville-style turn by several hoofing journalists.\n\nLandau’s authoritative production is doubly supported through deeply sincere performances by Jason Gotay as Homer, Floyd’s loving brother who shares his happy dreams and memories, and by Taylor Trensch as a skinny cub reporter who desperately struggles to rescue him. Marc Kudisch simmers as Floyd’s volatile dad who frays into madness. Lizzy McAlpine gives a sweet, plaintive musicality and a poignant presence to the role of Floyd’s troubled sister. Sean Allan Krill depicts an officious interloper with square-jawed confidence. Wade McCollum, Clyde Voce and Cole Vaughan capably vocalize and vividly depict local not-so-good-ole-boys. (The gifted McCollum of Ernest Shackleton Loves Me repute understudies the title figure; somebody let me know whenever he plays Floyd.)\n\nIt is likely that plenty of viewers will be attracted to Floyd Collins to catch Jeremy Jordan as this musical’s title figure. Although they may ultimately feel the show to be a terribly sad experience, they will not be at all disappointed by the touching performance here from the former star of The Great Gatsby. Jordan’s splendid, angelically-pure voice, handsome all-American looks, and still boyish earnestness are perfectly suited to project this character of a Kentucky farm boy who seeks a better life. Jordan easily, persuasively and tenderly portrays a simple fellow, a character not unlike Jay Gatsby at heart, whose dream to achieve greatness twists into a phenomenon beyond his comprehension or in Floyd’s tragic case, beyond even his line of vision.\n\nFloyd Collins opened April 21, 2025, at the Vivian Beaumont Theater and runs through June 22. Tickets and information: lct.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
