{
  "showId": "purlie-victorious-2023",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/theater/theater-reviews/purlie-victorious-review-leslie-odom-jr-broadway/",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nPurlie Victorious review: Leslie Odom Jr. makes a heroic return to Broadway\nThe first-ever revival of Ossie Davis' 1961 play has whip-smart dialogue, historical wisdom, and the physical comedy of a top-notch farce.\n\nChristian Holub is a writer covering comics and other geeky pop culture. He's still mad about 'Firefly' getting canceled.\n\nHamilton remains the singular Broadway supernova of the modern era — so much so that many of its original stars have naturally moved on to movies and TV. Since winning his Tony for playing Aaron Burr, Leslie Odom Jr.  has earned an Oscar nomination for One Night in Miami — but more often, movies like Glass Onion ended up feeling like they didn't make the most of Odom's many talents. So it's a welcome development to see the charismatic actor return to Broadway this month for a starring role in the first-ever revival of Purlie Victorious.\n\nOriginally written and performed in 1961 by playwright/actor Ossie Davis as a star vehicle for him and his wife Ruby Dee, Purlie Victorious is a self-described \"romp\" through the racial politics of the Deep South. One of the play's first jokes is that the costumes and stage design mislead you about the specific setting: Though it all looks like the era of the Civil War, Purlie Victorious is really set in the 20th century. It's just that in the Deep South, rich white Confederate descendants like Ol' Cap'n Cotchipee (Jay O. Sanders) used burdensome debt and the sharecropping system to recreate slavery in all but name.\n\nOdom's title character aims to change this state of affairs. As the play begins, he returns to his Georgia hometown with a scheme that might just be harebrained enough to work. Since one of his late cousins had been promised $500 by the old white man, Purlie Victorious Judson has come back with a woman (Kara Young) who he thinks bears a striking resemblance to the cousin. He's hoping they can fool Cotchipee into handing over the money, which Purlie wants to use to buy a local dilapidated barn and transform it into a church and preach the gospel of Black liberation.\n\nThe way Odom feasts on Davis' rich, whip-smart dialogue, you can't help but think he could've made a passionate preacher himself. Even when he's not singing (though the musical Purlie was adapted from Davis' play, this is just the straight prose) his voice is incredibly melodious.\n\nPlaying the role originated by Dee, Young is every bit Odom's equal. In addition to being stunningly beautiful, she also has quite a talent for both verbal dexterity and physical comedy. The scene where her character (who hails from the rural backwoods of Alabama) impersonates Purlie's college-graduate cousin, struggling to balance in her high heels while enunciating high-falutin' words, is one of the play's highlights.\n\nThe pleasures of Purlie Victorious aren't just verbal. The high-energy production often has the physicality of a top-notch farce, with characters running back and forth across the stage — sometimes to restrain Purlie's more careless impulses, other times to protect each other from white wrath. Somewhere around the halfway point, Purlie's schemes land him in hot water with Cotchipee and the gun-toting sheriff. But before the plot can come too close to the darkest moments of a movie like 12 Years a Slave, things go sideways and the fight becomes farcical in hilarious fashion.\n\nPurlie Victorious manages to have fun without shying away from the historical reality of Black oppression. It also speaks to the wide variety of African-American experience and opinion — while Purlie preaches revolution, Young's Lutiebell delights in the simple pleasures of corn fritters and cookouts, strapping cotton-picker Gitlow (Billy Eugene Jones) does his best to fly under the white man's radar, and Idella Landy (Vanessa Bell Calloway) teaches Cotchipee's son Charlie (Noah Robbins) to have a greater sense of empathy and justice than his Confederate forebears.\n\nAlong with the revival of The Sign in Sidney Brustein's Window earlier this year, this second-ever Broadway production of Purlie Victorious makes you wonder how many other vital works by Black playwrights are sitting somewhere, underused and underseen, waiting to be brought up under the bright lights where they belong. Grade: B+",
  "isFullReview": true,
  "dtliExcerpt": "“The pleasures of ’Purlie Victorious’ aren't just verbal. The high-energy production often has the physicality of a top-notch farce, with characters running back and forth across the stage...’Purlie Victorious’ manages to have fun without shying away from the historical reality of Black oppression.”\n\nRead more",
  "originalScore": null,
  "assignedScore": 85,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 700,
  "archivePath": "data/archives/reviews/purlie-victorious-2023/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:50:56.152Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "scoreSource": "extracted-grade",
  "scoreConfidence": "medium",
  "extractedGrade": "B"
}