{
  "showId": "purlie-victorious-2023",
  "outletId": "nystagereview-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nystagereview.com/2023/09/27/purlie-victorious-a-revival-that-lives-up-to-its-title/",
  "publishDate": null,
  "fullText": "★★★★☆ Leslie Odom Jr. plays the title role in Kenny Leon's revival of Ossie Davis' 1961 racial satire, also featuring Kara Young and Jay O. Sanders. Satire doesn’t always age particularly well. Fortunately, the new production of Ossie Davis’ 1961 play Purlie Victorious has sidestepped any issues about its being dated for two reasons, one good and one bad. The good is that director Kenny Leon has provided such a breakneck, well-staged rendition, superbly performed by its terrific ensemble, that the fun never lags. The bad is that the issues depicted in the play have lost little of their resonance even in these supposedly “post-racial” times. For evidence of the latter, simply look to the hysterical reaction from the audience to one character swinging a metal folding chair in menacing fashion (look up the meme online). That’s not to say that the production entirely succeeds in its wildly farcical depiction of a traveling preacher, the elegantly named Purlie Victorious Judson (Leslie Odom Jr.), who attempts to claim a $500 inheritance by duplicitous means in order to fund his dream of starting his own church. The humor leaps from broad to wildly over-the-top to mixed results, with not all of the gags landing. And some may have trouble with the “white savior” trope with which the proceedings are resolved, although it’s here employed so charmingly that it’s hard to resist. [Read Steven Suskin’s ★★★★★ review here.] Set in “the recent past” in “the cotton plantation country of the Old South,” the play concerns Purlie’s return to his Georgia hometown with his loyal disciple Lutiebelle (Kara Young) in tow. Purlie intends for Lutiebelle to impersonate his late cousin to claim an inheritance due her from ’Ol Cap’n Cotchipee (Jay O. Sanders), the white racist owner of a plantation where Purlie’s brother Gitlow (Billy Eugene Jones) still works. Needless to say, many wacky complications ensue, especially when Cotchipee hands the money over to Lutiebelle and then demands her immediate arrest when she forgetfully signs her real name on the receipt. Director Leon, who seems wary of audience reaction to the play since he prefaces the evening with a taped introduction advising us to “lean into it,” keeps the production going at such a frenetic pace that the plot absurdities are easily overlooked. Sometimes, it’s too frenetic, with the performers, employing thick regional dialects, delivering their lines at such a rapid-fire pace that many of them are easily missed. But overall, it seems a sound approach, delivering the three-act play in an intermissionless 100 minutes that doesn’t give the audience time to catch its breath or mind the fact that they’re not watching a revival of the 1970 musical version Purlie instead. In the roles originally played by Davis and his wife Ruby Dee (which they repeated, along with most of the original cast, in the little-seen 1963 film adaptation Gone Are the Days!), Odom and Young are terrific. Odom, employing his natural charisma and gravitas, proves thoroughly convincing as a preacher who could easily spellbound his congregation. But it’s Young who proves the true revelation — not of her talent, which was obvious with her Tony nominated performances in Cost of Living and Clyde’s, but rather her comedy skills. Young goes for broke in the role, seeming almost like a marionette being manipulated by a maniacal puppeteer in her wildly physical performance that is matched only by her hilarious vocal intonations. She makes her innocent character so inherently adorable that she wins our hearts while stealing the production right out from under her co-star. But everyone in the ensemble shines, with the standouts including Billy Eugene Jones, garnering big laughs as Gitlow; Jay O. Sanders, bellowing hilariously as Ol’ Capn’, Noah Robbins, lovable as Ol’ Capn’s son Charlie, who doesn’t share his father’s racist views; and Vanessa Bell Calloway, endearing as Idella, who treats Charlie as if he was her very own. Derek McLane’s deceptively simple, wood-paneled set design proves versatile enough to convey several locales, beginning with an essentially bare stage to which the actors bring out various pieces of furniture, while Emilio Sosa’s homespun costumes perfectly suit the antebellum period. Purlie Victorious: A Non-Confederate Romp Through the Cotton Patch opened September 27, 2023, at the Music Box Theatre and runs through February 4, 2024. Tickets and information: purlievictorious.com Frank Scheck has been covering film, theater and music for more than 30 years. He is currently a New York correspondent and arts writer for The Hollywood Reporter. He was previously the editor of Stages Magazine, the chief theater critic for the Christian Science Monitor, and a theater critic and culture writer for the New York Post. His writing has appeared in such publications as the New York Daily News, Playbill, Backstage, and various national and international newspapers.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 795,
  "archivePath": "data/archives/reviews/purlie-victorious-2023/nystagereview-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:51:57.129Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "Request failed with status code 503"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}