{
  "showId": "purlie-victorious-2023",
  "outletId": "stagebuddy-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://stagebuddy.com/theater/theater-review/purlie-victorious-non-confederate-romp-cotton-patch",
  "publishDate": null,
  "fullText": "It’s been over 60 years since “Purlie Victorious” played on Broadway. Written by actor Ossie Davis and premiering in 1961, the play feels as relevant as when it first opened. Deftly directed by Kenny Leon, the play reminds us that despite advances, some things have not changed.\n\nAlthough it is set years after the Civil War and the emancipation of the slaves, Georgia is still governed by the Jim Crow laws. Purlie Victorious Judson (played by Leslie Odom Jr.) a silver-tongued preacher, wishes to rebuild Big Bethel, the local church, by using inheritance money left to his long-lost cousin. The problem is that she has died, so Purlie talks Lutiebelle Gussie Mae Jenkins (Kara Young) into pretending to be the cousin. Although she doesn’t resemble the cousin, Purlie is sure his plan will work, telling his sister-in-law, “What's the difference! White folks can't tell one of us from another by the head!”\n\nCap’n Cotchipee ( (a burly over-the-top Jay O. Sanders), the local landholder, has possession of the money as well as the large local plantation upon which everyone works. As far as he’s concerned, the Civil War changed nothing. He is at odds with his son Charlie who keeps reminding him that “it’s the law of the land.”  Lutiebelle and Purlie must convince the Cap’n that she is the true heiress for them to get the money.\n\nThere’s much satire, humor, and comedy embedded in the sad truths of the play.\n\nDespite the laws declaring freedom, the South, represented by Cap’n, still conducts business as if nothing has ever changed. He has Black workers to pick his cotton and gets them indebted to him in his commissary so they can never leave. It’s another form of slavery. Even when the law is on their side, as Purlie’s brother Gitlow notes, everyone in power is white.\n\nAt first I wasn’t sure if Purlie Victorious was a musical, especially given the presence of the Hamilton star, Leslie Odom Jr.  (In fact, the show was made into a musical in 1970 called “Purlie” starring Cleavon Little and Melba Moore.) Although it is a comedy, Davis’ beautiful lyric language and Odom’s Jr’s fluid delivery provides a musicality to the script. Odom Jr.is a delight to listen to and even more fun to watch as he moves gracefully around the stage. Sometimes he seems to be preaching as if every room transforms into a pulpit.\n\nAs the “cousin-heiress Lutiebelle, Young portrays a slightly naive simple young woman who is as smitten by Purlie as is the audience. Although he coaches her in her role, we know this won't be easy. Young provides much of the humor, with her body language and delivery (floundering in high heels, loudly emphasizing words incorrectly, making  mistakes in the script she memorized.) Although many in the audience appreciated her portrayal, I found her screechy at times, making her difficult to understand.\n\nSanders is the bad guy you love to hate. Big and brash, he is overblown and a bully. In contrast to him is his only son and heir Charlie (Noah Robbins,)  a slender, young man who is a good foot shorter. Was this done intentionally?  The contrast in the two physically makes Charlie’s task seem even more impossible as he tries to convince his father to change his ways.\n\nPurlie wants freedom and equality now - not measured  “by the spoonful but by the shovelful”  And he will go out and get it any way he can.\n\nMeanwhile his brother Gitlow (delightfully played by Billy Eugene Jones) plays a different kind of role, that of “an Uncle Tom” toadying up to the Cap’n, all the while mocking him with double entendres. Although on the surface, Gitlow seems diffident and submissive, he is rebellious and subversive in his own way.\n\nAlthough “Purlie Victorious”  is a revival, the play feels very current.  The audience hears no  new message but the same humorous dialogue Davis wrote 60 years ago seems appropriate today. So this humor has a wry quality to it.  Doesn’t feel like we’ve made much progress.\n\nThe Music Box\n239 West 45th St.\nNew York, NY",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 687,
  "archivePath": "data/archives/reviews/purlie-victorious-2023/stagebuddy-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:53:44.910Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251112010247",
  "archiveOrgUrl": "http://web.archive.org/web/20251112010247/https://stagebuddy.com/theater/theater-review/purlie-victorious-non-confederate-romp-cotton-patch"
}