{
  "showId": "purlie-victorious-2023",
  "outletId": "thefrontrowcenter-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://thefrontrowcenter.com/2023/10/purlie-victorious/",
  "publishDate": null,
  "fullText": "Posted by Margret Echeverria | Oct 20, 2023 | Reviews\n\nKara Young, Heather Alicia Simms, Leslie Odom, Jr., Vanessa Bell Calloway, Billy Eugene Jones, and Noah Robbins in PURLIE VICTORIOUS - Photo by Marc J. Franklin\n\nMany of us have been stuck in guilt over the racial divide in this nation for too long healing nothing.  Healing requires action.  Jonathan McCrory, Artistic Director of National Black Theatre, says that laughter is a vibration that can take us into despair and then nirvana all while keeping our consciousness in the &#8220;now&#8221; where love lives.  Love is the healing action and laughter is the vehicle offered in the revival of PURLIE VICTORIOUS written by Ossie Davis now playing at The Music Box Theatre on 45th Street .\n\nDirector, Kenny Leon, arranges the opening of the show with the characters pulling costume pieces from a wardrobe rack while the set magically dresses itself for a quick portrait.  How we wish that racism was so far in the past that we would have to dig up old pictures to remember it.  But the Playbill does not have to tell us that this story is set in the recent past.  We giggle slightly uncomfortable when the actors freeze and grin at the bright flash of the camera.  The first words are spoken when Purlie Victorious Judson (Leslie Odom, Jr.) bursts into his family home on a bright Georgia morning brimming with a righteous mission steeped in poetic mischief.  Ossie Davis&#8217; lyrical text pours from Odom almost like music in its poetry.  I advise anyone seeing this show to take their seat early to settle and quiet the mind so that you can take in all that is said.  Lines are spoken very fast by all the characters and you don&#8217;t want to miss the cleverness in them.  Purlie has brought a young woman, Lutiebelle Gussie Mae Jenkins (Kara Young), whom he recruited from a church junior choir in Alabama to help him and his family bait and switch the white plantation owner, Ol Cap&#8217;n Cotchipee (Jay O. Sanders), on whose land they stand, work and live for an inheritance Cotchipee has stolen from them.  The complicated plan is that Lutiebelle must impersonate a dead Judson cousin.  Missy Judson (Heather Alicia Simms) greets the prodigal Purlie while embracing Lutiebelle more excited that the young woman is about to become family than she is about actually recovering any inheritance.  Gitlow Judson (Billy Eugene Jones), Purlie&#8217;s uncle &#8211; I think &#8211; and definitely Missy&#8217;s husband, has worked himself into Cotchipee&#8217;s favor unlike Purlie who still smarts from a bullwhip beating in his youth executed by the Ol&#8217; Cap&#8217;n.  Gitlow, concious of his sub human status on the Cotchipee cotton plantation, hesitates to upset the status quo acting as a highly creative diplomat.  There is so much pain here; what could possibly be funny?\n\nIt&#8217;s classic comedy &#8211; bait and switch, slave out-smarting his master, disguises, romantic intrigue, spies, sex and triumph over evil.  And the despair McCrory promised is present as well.  Young&#8217;s physicality is like a living vine made of humor that winds its way over the stage and twists deep into our hearts when we realize Lutiebelle is in danger, we love her as much as Purlie does and he may have to die to save her.  The theatre a second ago was alive with snorts and squeals and now many deep throated sounds of &#8220;Mm hmmm&#8221; hum through the air.  Odom mugs to the audience for sympathy for the lies he tells made necessary to his survival by his unfairly assigned lower class stating he never says anything he does not fully intend to make true eventually.  Ha!  And, Ouch!  Every actor in this show gives us their character&#8217;s suffering through exposing the raw truth of the matter.  The banter between Jones and Sanders drips with fear and submission locked deep behind witty tongues in their respective characters&#8217; hearts .  The wisdom is that humanity triumphs through comedy delivered with love which builds community and heals the tremendous pain of oppression.\n\nThe return of this show to Broadway is revealing to us that, tho sixty-one years have passed since the original staging, it is urgent that we insert love into the world before it is too late.\n\nPURLIE VICTORIOUS A NON-CONFEDERATE ROMP THROUGH THE COTTON PATCH written by Ossie Davis, directed by Kenny Leon\n\nWITH Leslie Odom, Jr. (Purlie Victorious Judson), Kara Young (Lutiebelle Gussie Mae Jenkins), Heather Alicia Simms (Missy Johnson), Billy Eugene Jones (Gitlow Judson), Noah Robbins (Charlie Cotchipee), Vanessa Bell Calloway (Idella Landy), Jay O. Sanders (Ol&#8217; Cap&#8217;n Cotchipee), Bill Timoney (The Sheriff), Noah Pyzik (The Deputy).\n\nSets by Derek McLane; Costumes by Emilio Sosa; Lighting by Adam Honoré, Sound by Peter Fitzgerald; Original Music by Guy Davis\n\nThrough February 4, 2024.  The Music Box, 239 West 45th Street, New York, NY 10036.  Get tickets HERE.\n\nSummary Every actor in this show gives us their character's suffering through exposing the raw truth of the matter.  The banter between Jones and Sanders drips with fear and submission locked deep behind witty tongues in their respective characters' hearts .  The wisdom is that humanity triumphs through comedy delivered with love which builds community and heals the tremendous pain of oppression.\n\nIn the summer of 1978, while watching a performance of A Murder is Announced on the London stage, Margret fell in love with the theatre.  Born and raised in Cedar Falls, Iowa, Margret came to New York City in 1994.  She was admitted to Newmyn’s Nose Limitless Theatre Limited, an innovative and award winning improvisational company, in the summer of 1995 and eventually became a member of the company’s board.  Margret starred in the critically acclaimed short film Jigsaw Venus by Dean Capsalis in 2000 (Best Actress, Buenos Aires International Independent Film Festival) and her film career was begun.  She played the adorable Fag Hag (GenX does not find this term offensive at all), Audrey, in both A Four Letter Word (2007) as well as Violet Tendencies (2010), films by Casper Andreas and Jesse Archer.  She has a co-starring role in Max Emerson's film, Hooked.  Always sentimental about performing for a live audience, Margret penned and performed Orangerie, a one-woman show exploring the subject of finding love while traveling non-traditional avenues, which premiered at the Bowery Poetry Club in November of 2005 and ran through the spring of 2006 to critical acclaim.  After Margret’s family survived the death of their son, Gavin, to SIDS in 2011, she penned her last one woman show, Finding Gavin, which premiered in New York City in 2015.  Margret has appeared in sketch comedy scenes as Nurse Margret in P. Diddy’s television series, Making the Band; she says Puffy is a marvelous partner in improvisational comedy.  She was on the season finale of Law & Order SVU in 2021. \n Margret studied Acting at Regent’s College in London, Classical Voice and Opera at the Royal Academy of Music in London, and Acting at Sally Johnson Studio here in New York City.  She has a BFA in Acting from Rockford University.  Margret is also a published poet.  She lives in Yonkers, NY with her daughter, Alyson.\n\nOpening Night Our Criteria Get our reviews by email\n\nJoin our mailing list to receive the latest news and updates from our reviewers.\n\nJoin our mailing list to receive the latest reviews from the Front Row Center. We will email you all of the reviews twice weekly.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1242,
  "archivePath": "data/archives/reviews/purlie-victorious-2023/thefrontrowcenter-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:01:11.957Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240415192833",
  "archiveOrgUrl": "http://web.archive.org/web/20240415192833/https://thefrontrowcenter.com/2023/10/purlie-victorious/"
}