{
  "showId": "the-last-ship-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2014/10/27/theater/the-last-ship-with-songs-by-sting-opens-on-broadway.html?partner=rss&emc=rss&smid=nytimesarts&_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "But along with its accomplishments, which include a host of vital performances from its ample cast under the direction of Joe Mantello, 'The Last Ship' also has its share of nagging flaws. The book, by John Logan ('Red') and Brian Yorkey ('Next to Normal'), and inspired in part by Sting's own upbringing in the northeast England town Wallsend, where the show is set, is unfocused and diffuse. It's hamstrung by a division between a David versus Goliath story - of the little folk fighting against the faceless forces of the global economy - and a romantic love triangle.",
  "bwwScore": 7,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Sting-in-Broadways-THE-LAST-SHIP-20141222",
  "fullText": "Hard times, blighted lives and the bleak humor that occasionally lifts the fog: The universe of “The Last Ship,” the new musical with a score by Sting about a shipbuilding town in decline, lies at some distance from its peppier neighbors on Broadway, where megaphoned uplift and easy escapism tend to thrive.\n\nFor that reason alone, it’s hard not to root for this ambitious, earnest musical, which opened on Sunday night at the Neil Simon Theater. Rich in atmosphere — I half expected to see sea gulls reeling in the rafters — and buoyed by a seductive score that ranks among the best composed by a rock or pop figure for Broadway, the musical explores with grit and compassion the lives of the town’s disenfranchised citizens, left behind as the industry that gave them their livelihood set sail for foreign lands.\n\nBut along with its accomplishments, which include a host of vital performances from its ample cast under the direction of Joe Mantello, “The Last Ship” also has its share of nagging flaws. The book, by John Logan (“Red”) and Brian Yorkey (“Next to Normal”), and inspired in part by Sting’s own upbringing in the northeast England town Wallsend, where the show is set, is unfocused and diffuse. It’s hamstrung by a division between a David versus Goliath story — of the little folk fighting against the faceless forces of the global economy — and a romantic love triangle.\n\nA prologue introduces us to the restless young Gideon (Collin Kelly-Sordelet), who yearns to escape the town where he’s grown up, and where his forebears have always worked the shipyards. Even after an injury at the yards leaves his father, Joe (Jamie Jackson), unable to work, the pugnacious Gideon rebels against the life ordained for him. “His life may be over,” he tells his girlfriend, Meg (Dawn Cantwell), “but mine’s not.” Although she refuses to join him, Gideon sets out “to find us a berth at the end of the earth,” as he sings, and promises to return to rescue her.\n\nYouthful dreams have a way of evaporating when they meet the hard exigencies of life, and when Gideon returns 15 years later (Michael Esper plays the adult Gideon, Rachel Tucker the adult Meg), he finds that the town has sunk into economic depression, the shipyards have closed and Meg has moved on. Her almost-fiancé is Arthur Millburn (the excellent Aaron Lazar, making the most of his gentle love ballad), who, in alliance with a local businessman, urges the unemployed workers to take the only jobs on offer: at a new salvage company.\n\nHow to wade through the crush of culture coming your way this season? Here’s a guide to 100 events that have us especially excited, in order of appearance.",
  "isFullReview": true,
  "textWordCount": 460,
  "archivePath": "data/archives/reviews/the-last-ship-2014/nytimes--charles-isherwood_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:33:11.900Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 460,
  "tierReason": "Full review text"
}