{
  "showId": "the-river-2014",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "http://www.vulture.com/2014/11/theater-review-the-river.html",
  "playbillVerdictUrl": "http://www.vulture.com/2014/11/theater-review-the-river.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "One scene stands out in Thomas Bradshaw’s adaptation of Chekhov for the wrong reasons. It’s a play-within-the-play, in which the son of a famous actress stages a show that doesn’t go over well with her. In Chekhov’s “The Seagull,” Konstantin’s play is dense and difficult, and his mother Irina laughs at it in ridicule. In Bradshaw’s “The Seagull/Woodstock NY” adaptation, Kevin’s play is raunchy and transgressive, involving racist language and masturbation, and his mother Irene is offended by it. Bradshaw’s use of graphic vulgarity is hardly surprising from the playwright who made an X-rated version of the Biblical story Job in “Fulfillment” Off-Off Broadway in 2015, confronted an Off-Broadway audience with outright pornography a year earlier in “Intimacy,” and contributed the play “Hard” to the 2021 outdoor theatrical anthology “The Seven Deadly Sins.” But what is most surprising is how little Bradshaw has actually changed the play. In The New Group production directed by Scott Elliott that has some standout performances but is unevenly acted and only intermittently well-paced, “The Seagull/Woodstock NY” occasionally seems fresh and intriguing, but more often feels like an exercise in transposition. Yes, there is a little raunch (though not as much as Bradshaw’s fans might be expecting); the action takes place in a house in Woodstock in the present day rather than on a country estate in Russia in the 1890s; there’s constant namedropping of current-day celebrities (Alec Baldwin, Bryan Cranston, the Kardashians); there are even a couple of Woodstocky songs shoehorned in — by the Grateful Dead and Crosby, Stills Nash and Young. But the characters and the storylines track closely to the original. Two actresses, a doctor, a writer and a teacher are among the ten characters in Bradshaw’s play, as they were among Chekhov’s thirteen (Bradshaw dispenses with the cook, the maid and the workman.) There are mostly the same love triangles, or, more precisely, geometries of desire and frustration: Mark pines for Sasha who pines for Kevin who pines for Nina who pines for William, who may actually pine for Nina too but is with Irene. Kevin still inexplicably kills a seagull. The characters are still disappointed and lonely. Chekhov aficionados might be relieved that it’s mostly the same play – or they might wonder: So what’s the point? It’s a question that Irene (standout Parker Posey) poses to Nina (Aleyse Shannon) during an argument after Kevin’s play: “Maybe the classics no longer matter. Maybe all that matters today is making a splash. But I’d still argue for substance. You know, there’s a difference between ‘edgy’ work and work that alienates the audience. I’ve been walking on the edge my whole career, but I never, EVER alienate my audience. What’s the point in that? “ This is cheeky coming from Bradshaw, but, ironically enough, it’s one of the few moments that make the play feel reimagined. There are several other such moments where he diverges from the original. In Chekhov, the country estate on which the play takes place is Pyotr Sorin, a kind man who is Irina’s brother. The two things he wanted in life were to be married and to be a writer, and he achieved neither. Bradshaw, the character is Samuel (David Cale, another standout); he is not Irene’s brother, but her best friend (and Kevin’s honorary uncle.) Sam and Irene own the Woodstock house together. They met at Yale; he wanted to be an actor, but couldn’t get work, so he became a lawyer. Now he is retired. What most sets him apart from the original is that he’s gay; he literally dreams of getting it on with a hot guy on a Harley in the desert. “People think desire evaporates with age – but it doesn’t.” In the original, the novelist Boris Alexeyevich Trigorin talks to Nina about fame and the challenges of being a writer, so too does the writer William (Ato Essandoh) to Nina on these subjects. But then he also talks about what it’s like being a Black writer, and then what it’s like being Black. When he studied in France (against his parents’ wishes; they wanted him to go to Africa), he had trouble appreciating the beauty of Notre Dame, a voice telling him: “You can’t relate to this. This place was built for those who raped, enslaved, and colonized your people.” But then he took a DNA test and learned his ancestors came from ten countries, including France. “My ancestors did build Notre Dame…I saw for the first time that I am a citizen of the world.” (Peopling the play with Black and gay characters makes the confrontation between Irene and Kevin (Nat Wolf) all the uglier, when they shoot racist and homophobic insults at one another,). If in the original play, Trigorin can easily be seen as stand-in for Chekhov, so William in his conversation with Nina seems a stand-in for Bradshaw (who is Black.) The play, in that moment, becomes his. The Seagull/Woodstock NYThe New Group at Signature through April 9Running time: two hours and forty minutes including one intermission.Tickets: $38 to $97by Thomas Bradshaw, adapted from ChekhovDirected by Scott ElliottScenic Design by Derek McLane, Costume Design by Qween Jean, Lighting Design by Cha See, Sound Design by Rob Milburn & Michael Bodeen. Fight and Intimacy Direction by Unkle Dave’s Fight HouseCast: David Cale as Samuel, Ato Essandoh as William, Patrick Foley as Mark, Hari Nef as Sasha, Daniel Oreskes as Darren, Parker Posey as Irene, Bill Sage as Dean, Aleyse Shannon as Nina, Amy Stiller as Pauline and Nat Wolff as Kevin A Week of The Weird Art. Broadway Celebrates Juneteenth. #Stageworthy NewsJune 20, 2022In \"New York Theater\" West Village Theaters On The Rise. So many names, so much #Stageworthy News of the WeekMarch 6, 2023In \"New York Theater\" People, Places & Things Review: An Alcoholic Actress Steps Up in RehabOctober 25, 2017In \"New York Theater\"",
  "isFullReview": true,
  "textWordCount": 978,
  "archivePath": "data/archives/reviews/the-river-2014/vulture--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:09:58.234Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 978,
  "tierReason": "Full review text"
}