{
  "showId": "outside-mullingar-2014",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/outside-mullingar-review-debra-messing-bryan-f-o-byrne-transcend-1.6856865",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/outside-mullingar-review-debra-messing-bryan-f-o-byrne-transcend-1.6856865",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "8:26 PM In Nassau accident on The Southern St Pkwy WB at Grand Ave/Baldwin Rd/X20\n\nIn Nassau accident on The Southern St Pkwy WB at Grand Ave/Baldwin Rd/X20\n\n16&deg;\n Hi 28&deg; Lo 23&deg;\n Clear\n\nHumidity: 47%\n Wind: WSW 5 mph\n Barometer: 30.27 Hg\n\nFull forecast\n Hour-by-hour\n Local map\n\nis looking at photos of the Rangers and Isles playing in Yankee Stadium.\n\nOriginally published: January 22, 2014 4:29 PM\n Updated: January 23, 2014 3:47 PM\n \n By LINDA WINER\n linda.winer@newsday.com\n\nBrian F. O'Byrne and Debra Messing star in John Patrick Shanley's new play, \"Outside Mullingar,\" starting previews Jan. 3, 2014 at the Samuel J. Friedman Theatre in Manhattan. (Credit: Andrew Eccles)\n\nDebra Messing and Brian F. O'Byrne are so, what's a more grown-up word for adorable? -- charming? irresistible? combustible? -- together that we wish this romantic comedy would go on for hours.\n\nThe problem is that \"Outside Mullingar\" is only a romantic comedy for the last altogether enchanting scene. For the rest of John Patrick Shanley's 95-minute oddity, we are thrust into some cartoon universe, where rural Irish folk speak wisdom in kooky locutions, fester on peculiar grudges and debate whether shy, middle-aged, hardworking Anthony Reilly (O'Byrne) loves the farm enough to inherit it from his cranky old dad.\n\nSince this world premiere is by Shanley, of course, there are bursts of unpredictable, luscious writing and twists of humane individuality. And if the prolific playwright had written nothing but the Pulitzer Prize-winning \"Doubt\" -- and he has written much, much more -- that one stunning achievement would have earned him bushels of tolerance for creative meanderings.\n\nBut \"Outside Mullingar\" feels like a throwback to Shanley's early days of moonstruck Italian-American eccentrics, works that, despite their popularity, had the bogus feel of a tourist getting a crush on a foreign culture and shopping for novelties in a second language. Now the Bronx-born Irish-American has gone to the land -- the actual farm -- of his late father. Instead of finding his own voice in those roots, he creates dark, off-center country characters who force unfortunate comparisons with many by today's celebrated Irish playwrights.\n\nMessing, in a long red braid and conscientious Irish accent, is delightful as Rosemary, the simultaneously hard and needy aging neighbor from the adjoining farm. The actress, a New York University theater graduate before TV stole her, has a kind of feisty Annie Oakley facade and an unusually blunt honesty. O'Byrne, the original priest in \"Doubt,\" makes us care deeply for this increasingly strange, touching, crushing man, who squeezes out lyrical sentences with the agony of someone trying to bolt or fly away.\n\nRosemary's mother and his father (the excellent Dearbhla Molloy and Peter Maloney, respectively) are assigned more familiar Irish caricatures, storytellers who ramble about death and betrayal with a comic lilt. The premiere, Manhattan Theatre Club's 10th Shanley production, has been lovingly conceived by director Doug Hughes and the rest of the creative team of \"Doubt.\" Too bad they all can't start from that wondrous last scene and go from there.\n\nWHERE Samuel J. Friedman Theatre, 261 W. 47th St.\n\nINFO $67-$125; 212-239-6200, manhattantheatreclub.org\n\nBOTTOM LINE Debra Messing and Bryan F. O'Byrne transcend a cartoon-Irish John Patrick Shanley play.\n\nUser rating: 4\n \n \n \n \n \n \n \n \n (3) Click to rate\n\nadvertisement | advertise on newsday\n\nBieber turns self in on Toronto assault charges 8:08 PM\n\n13 best new movies streaming on Netflix\n\nadvertisement | advertise on newsday",
  "isFullReview": true,
  "textWordCount": 566,
  "archivePath": "data/archives/reviews/outside-mullingar-2014/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:39:51.636Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140130041420",
  "archiveOrgUrl": "http://web.archive.org/web/20140130041420/http://www.newsday.com:80/entertainment/theater/outside-mullingar-review-debra-messing-bryan-f-o-byrne-transcend-1.6856865",
  "contentTier": "complete",
  "wordCount": 566,
  "tierReason": "Full review text"
}