{
  "showId": "outside-mullingar-2014",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2014/10/19/nyregion/a-review-of-outside-mullingar-at-the-george-street-playhouse-in-new-brunswick.html",
  "publishDate": "January 23, 2014",
  "fullText": "In the beautifully bittersweet “Outside Mullingar,” by John Patrick Shanley, nearly every conversation involves the passing of time.\n\n“I’ll be dead in a year,” says the aged but seemingly healthy Aoife Muldoon, who has been a widow for just three days.\n\n“Half a year,” counters Tony Reilly, her 75-year-old neighbor. As for himself: “I’ll be dead in two months.” Yet no matter how short their time, Tony’s son, Anthony, and Aoife’s daughter, Rosemary, may have it worse: these two unmarried, middle-age souls see a longer future ahead, one that looks awfully lonely.\n\nIt’s hardly a surprise that Anthony and Rosemary soon turn to each other. For sure, you’ve encountered lonesome hearts like these before, in plays by Eugene O’Neill and Martin McDonagh, and heard many of their jokes, too. Yet “Outside Mullingar” finds a way to make their fumbling courtship fresh and funny, with more than a little melancholy thrown into the mix.\n\nAnthony, 42, has been toiling at the family farm in Ireland all his life. While his work has kept him away from the rest of the world, he’s been hiding as well; a failed teenage love affair is still an open wound, and he’s got a few quirks that don’t exactly endear him to others. He sometimes hears voices when he is working in the fields.\n\n“I’m just more with nature ... than people,” he tells Rosemary, later adding: “The problem is there’s just not enough air in the world to suit me and there never has been. That’s all. Modernization has run roughshod over the spaces between things.”\n\nRosemary, too, can be a strange bird. She lives next door to Anthony, but has harbored a grudge against him since she was 6. And she’s never been one to hold her tongue. Her own mother describes her as “stubborn to the point of madness.”\n\nObstacles between the two potential lovers rise and fall, and secrets are eventually unearthed. Throughout it all the humor remains delightfully odd and dark. In one scene Rosemary tells of calling to her mother after finding her elderly father’s body. “Mam came, and her face went white, so I gave her a drink of water. But didn’t the glass have his teeth in it!” She points out that Aoife “won’t drink from a glass since.”\n\nComedy aside, it’s the sense of lost youth and thinning chances that’s most affecting in this 100-minute play. Mr. Shanley, best known for “Doubt,” which won a Pulitzer Prize and a Tony Award, sets most of the scenes at night and often in the rain. The isolated farmland doesn’t just provide food. It also fosters seclusion.\n\nJohn Bolger, as Anthony, captures a man perplexed by his own being. Watching him ache for love, yet fear the same emotion, can be moving. Ellen McLaughlin, as Rosemary, is a fine contrast, a plucky woman who presses Anthony to shake off his timidity.\n\n“You have to push back, man, now and then, or they’ll eat you alive, the people of this world,” she tells him.\n\nPatricia Conolly, as Aoife, employs sharp comedic timing while David Schramm, as Tony, is full of bluster that conceals a tender heart. His last scene is outstanding.\n\nThough at a recent performance some accents were less than assured (and some voices were still seeking the right volume), the four are otherwise well directed by David Saint at the George Street Playhouse in New Brunswick. R. Michael Miller’s sets, complete with falling rain, are a treat.\n\nIt doesn’t give anything away to say that “Outside Mullingar,” which had a limited run on Broadway this year, ends up just where you’d expect, and where it should. Indeed, you’ve seen similar tales before. Still, it’s worth your own time to see this one too.",
  "isFullReview": true,
  "dtliExcerpt": "Mr. Shanley has created two beautifully matched portraits of emotional paralysis that complement each other like interlocking pieces of a jigsaw puzzle.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mr. Shanley has created two beautifully matched portraits of emotional paralysis that complement each other like interlocking pieces of a jigsaw puzzle.",
  "contentTier": "complete",
  "contentTierReason": "Short text (22 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/01/24/theater/outside-mullingar-by-john-patrick-shanley-opens.html?_r=0",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "previousUrl": "https://www.nytimes.com/2014/01/24/theater/reviews/outside-mullingar-at-the-samuel-j-friedman-theater.html",
  "urlDiscoveredAt": "2026-02-04T00:47:33.048Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 625,
  "archivePath": "data/archives/reviews/outside-mullingar-2014/nytimes--ben-brantley_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:47:33.052Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20141022084705",
  "archiveOrgUrl": "http://web.archive.org/web/20141022084705/http://www.nytimes.com:80/2014/10/19/nyregion/a-review-of-outside-mullingar-at-the-george-street-playhouse-in-new-brunswick.html?",
  "wordCount": 625,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-04T01:19:12.373Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production at the George Street Playhouse in New Brunswick, not the current Broadway run.; kimi: This text reviews a production at George Street Playhouse in New Brunswick, not the Broadway production. The text explicitly references the Broadway run in the past tense ('had a limited run on Broadway this year') and evaluates the performances at the New Jersey venue with a different cast.",
  "promptVersion": "5.2.0"
}
