{
  "showId": "outside-mullingar-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2014/01/24/theater/outside-mullingar-by-john-patrick-shanley-opens.html?_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "The wait proves to be a wholly diverting one in 'Outside Mullingar,' which represents Mr. Shanley's finest work since 'Doubt,' the winner of both the Tony Award and the Pulitzer Prize in 2005. This isn't to suggest that they are equally sturdy or significant plays. For all its satisfactions - which include supporting performances to savor from the wonderful Peter Maloney and Dearbhla Molloy - 'Outside Mullingar' is a lighter, slighter play, a softhearted comedy freckled with dark reflections on the unsatisfactory nature of life and the thorns of love. But Mr. Shanley's lyrical writing, and the flawless production, directed by Doug Hughes forManhattan Theater Club, give such consistent pleasure that even though we know the equations that define romcoms will add up to the familiar sums, we are happy to watch as they do.",
  "bwwScore": 7,
  "contentTier": "needs-rescrape",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-OUTSIDE-MULLINGAR-Opens-on-Broadway-Updating-LIVE-20140123",
  "fullText": "https://www.nytimes.com/2014/01/24/theater/outside-mullingar-by-john-patrick-shanley-opens.htmlShare full articleAdvertisement\n\nThe rain pours down in steady streams, shrouding in gloom the Irish countryside of “Outside Mullingar,” the new play by John Patrick Shanley that opened on Thursday night at the Samuel J. Friedman Theater. Gloomy, too, is the talk of lost loves, deaths and other grim subjects dear to the hearts of the Irish, or at least those who populate Broadway stages. As is also regularly the case in plays set there, the reaper will pay a house call before the curtain has fallen.\n\nBut you needn’t be a cockeyed optimist to deduce that the skies will ultimately clear for the play’s moody, broody central characters, two middle-aged farmers winningly played by Brian F. O’Byrne and Debra Messing. As soon as we hear of the prickly antipathy between these two life-battered souls, we can settle back in our chairs comfortably and await a satisfying final clinch. A woman’s loudly professed aversion for a man — or a man’s for a woman — is the surest sign that we are in the realm of romantic comedy, which demands that plenty of high hurdles be placed in the path of true love.\n\nThe wait proves to be a wholly diverting one in “Outside Mullingar,” which represents Mr. Shanley’s finest work since “Doubt,” the winner of both the Tony Award and the Pulitzer Prize in 2005. This isn’t to suggest that they are equally sturdy or significant plays. For all its satisfactions — which include supporting performances to savor from the wonderful Peter Maloney and Dearbhla Molloy — “Outside Mullingar” is a lighter, slighter play, a softhearted comedy freckled with dark reflections on the unsatisfactory nature of life and the thorns of love. But Mr. Shanley’s lyrical writing, and the flawless production, directed by Doug Hughes for Manhattan Theater Club, give such consistent pleasure that even though we know the equations that define romcoms will add up to the familiar sums, we are happy to watch as they do.\n\nMr. O’Byrne plays Anthony Reilly, who has been keeping up the family farm in the Irish Midlands for years. His father, Tony (Mr. Maloney), allows that Anthony has worked hard and well, but he mulishly maintains that his son will never be a true man of the earth. “You don’t stand on the land and draw strength from it,” he says, drawing a look of wounded surprise from his dutiful son. And because, at 42, Anthony has never married, and Tony wants to see the farm remain in the family, he goes on to suggest blithely that he might just pass the farm to Anthony’s American cousin when he dies.\n\nMatters of inheritance are on Tony’s mind because they have just returned from the funeral of Christopher Muldoon, the proprietor of the neighboring farm. His widow, Aoife (Ms. Molloy), has honored them with a visit, and as Anthony cleans the kitchen and makes tea, the elders trade prognostications about their impending ends. “You’ll be dead within a year,” Tony stoutly tells Aoife, who philosophically agrees. But he later adds a gentlemanly qualification: “Me? I’ll be dead within two months.”\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 542,
  "archivePath": "data/archives/reviews/outside-mullingar-2014/nytimes--charles-isherwood_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:43:26.172Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203859",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203859/https://www.nytimes.com/2014/01/24/theater/outside-mullingar-by-john-patrick-shanley-opens.html?_r=0",
  "wordCount": 542,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T08:36:34.874Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: Text ends with error message about retrieving article content and JavaScript settings, indicating incomplete/corrupted content; openai: The text includes a URL, navigation prompts, and a message about enabling JavaScript, indicating it's not a complete review.",
  "promptVersion": "5.2.0"
}
