{
  "showId": "american-son-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2018/11/04/american-son-ripped-from-the-headlines/",
  "publishDate": "2018-11-04T22:01:37",
  "fullText": "With its ripped-from-the-headlines plot, deliberate arguments, and crystal-clear-from-the-start ending, American Son would have made an excellent episode of Law & Order. (The original version, of course.) It’s eminently watchable, the cops get in a few wisecracks, and and you know when a rerun pops up 20 or 30 years from now that it’ll still be relevant. Unfortunately.\n\nIs it pessimistic to say that Christopher Demos-Brown’s play—which centers on a mixed-race couple, Kendra (Scandal star Kerry Washington, making a welcome return to Broadway) and Scott (Steven Pasquale), whose teenage son is missing—will probably always be timely? The entire show is set in a sterile police station in Miami (the playwright’s home), where Kendra is pacing and presumably thinking—as the audience is—the absolute worst has happened. First, she must contend with the rookie Officer Larkin (Jeremy Jordan), who seems very surprised that her 18-year-old son has no prior arrests, asks about the kid’s street name (“June Bug,” Kendra jokes, recalling a childhood nickname. “It’s what I call him now when I want to knock the cool out of him in front of his friends.”), and wonders if he has any “distinguishing” physical marks like “scars, tattoos, gold teeth.” Then he directs her to the side-by-side water fountains—can you guess why this old Southern building has two water fountains?—but not before assuring her that “we’re gonna find out where Jerome is.” Her son’s name is Jamal.\n\nThings get both better and worse when Scott arrives: better because he’s white and wearing a badge—he’s an FBI agent—so the underling cop immediately begins kowtowing to him; worse because Scott and Kendra have been separated for the last few months. (Before they even really address their son’s situation, they get into a totally frivolous but nonetheless hilarious spat about grammar. Kendra: “ ‘Alls I’m sayin’.’ ‘A whole nother.’ Just purge that shit.” Scott: “A whole nother”? Kendra: “Yeah. ‘The current situation is probably a whole nother thing.’ ” Scott: “Sweet Sweating Jesus.”) It turns out that Scott has assumptions just like Officer Larkin does—especially when he learns that his private school–educated, West Point–bound son was one of “three black males” pulled over for some unspecified reason. “I think our half-White, half-Black, who-gives-a-shit-what-race-he-is son— the one who got a 1470 on his SAT and aced AP Physics—knows better’n to commit unforced errors in life by taking stupid risks,” Scott argues. Demon-Brown makes it easy to see both sides. Jamal should be able to “associate with other Black kids without stamping a presumption of guilt all over himself,” Kendra maintains. The playwright, incidentally, who’s making his Broadway debut with American Son, is also a practicing lawyer, and it shows. Presumption of innocence may be the basis of the American criminal justice system, but this mother is smart enough to know that “presumption of guilt” might as well be stamped on her son’s forehead.\n\nOf course, at this point, no one knows where Jamal is, what he’s supposedly done, or who these other boys are—only that the car, a Lexus that Kendra and Scott gave to Jamal for his 18th birthday, was involved in an “incident.” (You can guess, and chances are you’ll be correct.) Everything has to go through some mysterious “AM liaison officer,” Lieutenant Stokes (Eugene Lee). A bumper sticker was seen on Jamal’s Instagram: “Shoot Cops with your phone whenever they make a bust.” (The words “shoot cops” are in “huge letters,” says Larkin. “The rest in little bitty font so’s all anyone wasn’t two feet away from the bumper could see was a Lexus that said ‘Shoot Cops.’”) There’s also a grainy cellphone video with gunshot sounds.\n\nOnce Lieutenant Stokes swoops in—calling Kendra “sistah” in a condescending attempt to bond with, or perhaps placate, her (this psychology professor and her self-described “Ph.D.-havin’ ass” are, thankfully, too smart for that)—he wastes no time making a few presumptions of his own: “One thing I know for sure about this incident already. Just like almost every other one of ’em: If the young brothers woulda just shut their mouths and done what they were told, none of us would be here tonight.” Stokes gets off his high horse and exits soon after that, leaving Kendra (and us) to simmer in her anger.\n\nTony winner Kenny Leon (A Raisin in the Sun) directs with the smooth efficiency befitting this procedural-style work, and the cast—Washington and Pasquale are especially fine as parents whose emotions ricochet from angry to anguished to afraid and back again—wrings just about all the drama they can out of the newsprint-thin script. Hopefully they’ll both be available for the inevitable small-screen adaptation (Netflix, perhaps?). And expect regional theaters and college campuses to jump at American Son too. Timeliness is everything.\n\nAmerican Son opened Nov. 4, 2018, and runs through January 27, 2019 at the Booth Theatre. Tickets and information: americansonplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
