{
  "showId": "american-son-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2018/11/04/american-son-modern-injustice-wrought-as-melodrama/",
  "publishDate": "2018-11-04T22:00:31",
  "fullText": "It feels almost irresponsible to pan a play as well-intentioned and laser-focused on timely and vital subject matter as American Son, the new melodrama starring Scandal star Kerry Washington and Steven Pasquale as parents of a biracial young man who goes missing one night, landing them at a Miami police station in the wee hours of the morning.\n\nThe setup, for those unfamiliar with Christopher Demos-Brown’s play—which earned attention, and praise, in two previous productions—should give you a sense of the pressing issues at hand, racial identity and conflict and police brutality and accountability prominent among them. Demos-Brown, a trial lawyer whose playbill bio tells us he has written more than a dozen full-length plays and screenplays (and won awards doing so), clearly knows something about the frustrating procedural barriers facing a mother and father like Washington’s Kendra and Pasquale’s Scott as they await information linking their son to an incident, and how race can further complicate that process.\n\nThis can even be true, Demos-Brown takes pains to show us, when the parents of the dark-skinned youth possibly in police custody are accomplished and well-connected: Kendra is a college professor with a Ph. D, and Scott, who is white, works for the FBI. As the couple, which has been separated for several months, is thrown back together under the worst of circumstances, their festering grievances are expressed; many have to do with race, with the fed—played by Pasquale with a stiff machismo that, while convincing, reinforces the banality of the dialogue—hurling some especially ugly innuendo and invective.\n\nIn his admirable but misguided determination to cram our country’s wretched record of racial injustice and polarization into an 85-minute play, Demos-Brown seems more focused on dropping in obvious historical and cultural references than he is in character development. Nods to Jim Crow, the O.J. trial and Black Lives Matter feel arbitrary or contrived, as does Kendra and Scott’s mention—during the inevitable where-did-our-love-go? interlude that makes Son feel even more like a basic-cable TV movie—of their shared affection for Thelonious Monk.\n\nThe clichés extend to the playwright’s portrait of a junior officer, a dumb lackey (a role wasted on the talented Jeremy Jordan) who, trying to impress Kendra, mistakes Charles Dickens’ words for Emily Dickinson’s. He also munches donuts, cluelessly offering the distraught Kendra one: “What can I say? We really do like ’em!”\n\nKendra does have a poignantly written, disturbing monologue tracing the fears and nightmares that are unique to a black mother, particularly of a son, and Washington, under Kenny Leon’s sensitive direction, delivers it movingly. For the most part, though, the actress—who appeared once on Broadway before, nearly a decade ago, in a play titled, by chance, Race (by David Mamet)—makes Kendra a cauldron of indignation and irritation who erupts with increasing volume. There’s a good deal of yelling in the performance—not an unheard-of reaction for mothers of missing children, especially if they’re confronting people who may be withholding information. But it would have been nice to see a bit more nuance, more than tiny glimmers of the shock and terror and despair one would also expect, perhaps in greater measure.\n\nSon’s most memorable scene pairs Washington with a more seasoned stage actor, Eugene Lee, who lends gravelly wit to the part of a brash police lieutenant who’s been around the block a few more times than Kendra or her husband. The old cop is something of a bully, but he’s also an African-American, and his insights into the limits of privilege and fairness for people with the wrong skin color—even those who have achieved as much as Kendra, or been born into circumstances as favorable as those that greeted her son, described repeatedly as a smart, sensitive soul—provide the sharpest and, at one point, funniest lines.\n\nThe production’s most impressive feature, in the end, is Derek McLane’s scenic design, detailing a bleak, sterile waiting era, surrounded by windows through which we can see a steady downpour of rain, which stops intermittently but never for long. The set reflects Kendra’s and her son’s tragic conundrum—our nation’s, really—more credibly and cannily than American Son, for all its noble aspirations, does overall.\n\nAmerican Son opened November 4, 2018, at the Booth Theatre and runs through January 27, 2019. Tickets and information: americansonplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-roundup"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2018/11/04/american-son-ripped-from-the-headlines/",
  "bwwExcerpt": "The production's most impressive feature, in the end, is Derek McLane's scenic design, detailing a bleak, sterile waiting era, surrounded by windows through which we can see a steady downpour of rain, which stops intermittently but never for long. The set reflects Kendra's and her son's tragic conundrum-our nation's, really-more credibly and cannily than American Son, for all its noble aspirations, does overall. Roma Torre, NY1: Enhancing the production is an outstanding company of A-listers: Je",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Do-The-Critics-Think-of-AMERICAN-SON-Updating-Live-20181104"
}
