{
  "showId": "american-son-2018",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2018/legit/reviews/american-son-review-kerry-washington-1203017336/",
  "publishDate": "November 5, 2018",
  "fullText": "Super Bowl LX \n \n \n\n \n \n \n \n \n All the ads and trailers from the big game\n\nWinners, snubs and surprises from music's major night\n\nNetflix, Paramount Skydance face off\n\nThe Grammys had the weight of Bad Bunny and Billie Eilish speaking to the ICE chaos, the silliness of production numbers and an epic In Memoriam.\n\nWhy the Puerto Rican superstar's triumph is bittersweet amid ICE's brutal immigration enforcement campaign.\n\nBust out the cashmere and fire up the wood burning stove in that perfectly appointed Hamptons house – Nancy Meyers is back.\n\n The woman whose name is synonymous with…\n\nA ubiquitous red carpet producer was benched from Sunday’s Grammy awards following a string of online controversies, Variety has learned.\n\n During arrivals for…\n\nThe disappearance of “Today” anchor Savannah Guthrie’s mom Nancy Guthrie is being treated as a crime, according to the sheriff of Pima County, Ariz. \n\n “We saw some…\n\nThe biopic chronicles Michael Jackson's rise from child star to the King of Pop.\n\nThe two discuss 'Wicked: For Good,' what makes them cry and loving 'The Waterboy.'\n\nThe two on their life-changing 'Mummy' friendship, loneliness and learning to stop trying so hard.\n\nA Variety and iHeartRadio Podcast\n\nRachel McAdams thrives on a desert island in Sam Raimi's twisted survival thriller. Going back to his roots, Raimi wickedly flips the dynamic between a number cruncher and her nightmare boss.\n\nIn a mockumentary that plays it straight, Charli xcx is teamed with a doofus director (Alexander Skarsgård) who wants to clean up her image. But why would any version of Charli xcx say yes?\n\nBrett Ratner's First Lady documentary is a cheeseball infomercial of staggering inertia. There's no drama to a film that should have been called \"Day of the Living Tradwife.\"\n\nJason Statham vs. the world again, Scottish edition. He plays a fugitive former MI6 agent forced to protect himself and a teenage innocent from assassins in a slick if undistinguished action opus.\n\n'Interior Chinatown' Struggles to Turn an Allegorical Novel Into a Show\n\nHBO Prequel Series 'Dune: Prophecy' Capably Tailors the Epic Franchise to Television\n\nTaylor Sheridan's 'Landman' Gives the West Texas Oil Fields the 'Yellowstone' Treatment\n\nEddie Redmayne and Lashana Lynch's 'The Day of the Jackal' Is an Exhilarating Assassin Thriller\n\nBillie Eilish and producer Finneas keep up their winning streak with a surprising and intimate third album.\n\nChildish Gambino's latest is a masterpiece, and a kaleidoscopic showcase for his seemingly endless talents.\n\nVince Staples searches for light on his new album, his most vulnerable project to date.\n\nDua Lipa's new album is a joyous blast of pop savvy.\n\nSam Gold's production is an actorly face-off between Jeremy Strong and Michael Imperioli, but the script ultimately let's the audience off the hook.\n\nPatricia Clarkson gives a luminous performance in an otherwise uneven revival of Eugene O'Neill's family drama.\n\nThe stage adaptation has escapism, enchantment and heart, all elevated to new, literal heights that blend theater and cirque.\n\nPopular on Variety\n\n \n \n \n\n \n\n \n \n ‘Joybubbles’ Director Rachael Morrison and Editors Bradford Thomason and Patrick Lawrence on Their Retro Phone Hacker Doc\n \n \n \n\n \n \n Perfection is rarely achieved in movies, but this heaven-sent concert doc hits the sweet spot. Over two days in January 1972, the Queen of Soul, Aretha Franklin — she was 29 at the time — sweeps into the New Temple Missionary Baptist Church in Watts in front of a congregation and testifies to God in song. The blessed thing took nearly half a century to come out because director Sydney Pollack failed to sync the image with the sound. Then digital angels stepped in, and glory, glory, hallelujah!\n\nPopular on Variety\n\n \n \n \n\n \n\n \n \n ‘Joybubbles’ Director Rachael Morrison and Editors Bradford Thomason and Patrick Lawrence on Their Retro Phone Hacker Doc\n \n \n \n\n \n \n Perfection is rarely achieved in movies, but this heaven-sent concert doc hits the sweet spot. Over two days in January 1972, the Queen of Soul, Aretha Franklin — she was 29 at the time — sweeps into the New Temple Missionary Baptist Church in Watts in front of a congregation and testifies to God in song. The blessed thing took nearly half a century to come out because director Sydney Pollack failed to sync the image with the sound. Then digital angels stepped in, and glory, glory, hallelujah!\n\nPopular on Variety\n\n \n \n \n\n \n\n \n \n ‘Time and Water’ Editors Erin Casper, Mark Harrison and Jocelyne Chaput on Capturing the Generational Trauma of Climate Change in Iceland\n \n \n \n\n \n \n Perfection is rarely achieved in movies, but this heaven-sent concert doc hits the sweet spot. Over two days in January 1972, the Queen of Soul, Aretha Franklin — she was 29 at the time — sweeps into the New Temple Missionary Baptist Church in Watts in front of a congregation and testifies to God in song. The blessed thing took nearly half a century to come out because director Sydney Pollack failed to sync the image with the sound. Then digital angels stepped in, and glory, glory, hallelujah!\n\nPopular on Variety\n\n \n \n \n\n \n\n \n \n ‘Undertone’ Editor Sonny Atkins and Colorist AJ McLauchlin on Bringing the A24 Podcast Horror Movie to Life\n \n \n \n\n \n \n Perfection is rarely achieved in movies, but this heaven-sent concert doc hits the sweet spot. Over two days in January 1972, the Queen of Soul, Aretha Franklin — she was 29 at the time — sweeps into the New Temple Missionary Baptist Church in Watts in front of a congregation and testifies to God in song. The blessed thing took nearly half a century to come out because director Sydney Pollack failed to sync the image with the sound. Then digital angels stepped in, and glory, glory, hallelujah!\n\n'Sinners' Dominates With 16 Nods, 'One Battle After Another' Follows With 13",
  "isFullReview": true,
  "dtliExcerpt": "Kerry Washington gives a powerhouse performance as Kendra, a psychology professor whose biracial teenage son has been detained by police after a traffic stop.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Kerry Washington gives a powerhouse performance as Kendra, a psychology professor whose biracial teenage son has been detained by police after a traffic stop.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Short text (24 words)",
  "textWordCount": 931,
  "archivePath": "data/archives/reviews/american-son-2018/variety--marilyn-stasio_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:50:51.345Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 931,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-03T13:34:14.756Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be a website navigation menu or homepage content with repeated text blocks about various entertainment topics, not a theater review; openai: The text provided is a collection of unrelated headlines and snippets, not a coherent review of the target show.; gemini: This is a collection of article titles and snippets, not a review of a specific show.; kimi: The provided text is a jumble of unrelated Variety headlines and article snippets (Super Bowl ads, Grammy coverage, movie reviews, TV show listings) rather than a coherent Broadway review. While it contains brief fragments about theater productions, it lacks the structure of a single review and does not contain the content described in the aggregator context (Kerry Washington in the specified role).",
  "promptVersion": "5.2.0"
}
