{
  "showId": "american-son-2018",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "http://www.vulture.com/2018/11/theater-review-the-good-intentions-of-american-son.html",
  "playbillVerdictUrl": "http://www.vulture.com/2018/11/theater-review-the-good-intentions-of-american-son.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "American Son has power behind it: Shonda Rhimes, Jada Pinkett Smith, Dwayne Wade, and the show's star, Kerry Washington, are on its long, glittery list of producers. It has its serious sights set on a subject of indisputable tragic weight: the unjustifiable killing of unarmed black men in America by unaccountable police officers. It also has a contrived, TV-ish script peopled by one-note characters and peppered with amateurish flourishes. Its playwright, Christopher Demos-Brown, a writer and lawyer who runs a practice in Miami, seems to be positioning himself as a kind of John Grisham for the stage, and its director, Kenny Leon, can't push the material past its inherent paperback flatness. Derek McLane's bulky, photo-real Miami police-station set, with real rain falling outside the upstage windows, tells us all we need to know about tone: There's nothing remotely theatrical about this play, no reason for it to be a play at all - save that we retain a kind of anxious cultural cachet about drama. Putting something on stage seems to aggrandize it, make it more serious-minded and more luxurious, closer to opera than Netflix. But the truth is that contemporary plays like American Son are simply imitations of the shows on Netflix-or, in this case, NBC-and pale ones at that, because unlike our age's spate of fascinating television, these plays want to be something they're not. They neither take joy in the possibilities of their own form nor respect its demands.",
  "bwwScore": 2,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Do-The-Critics-Think-of-AMERICAN-SON-Updating-Live-20181104"
}
