{
  "showId": "mcneal-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Roma Torre",
  "url": "https://nystagereview.com/2024/09/30/mcneal-robert-downey-jr-stars-in-riveting-new-play/",
  "publishDate": "2024-09-30T20:57:57",
  "fullText": "Let it be known that I have never used ChatGPT or any other AI generated content to write my reviews…and that is true at least until the foreseeable future…which is when Ayad Akhtar’s phenomenally prescient play McNeal takes place. And I must admit, seeing how incredibly impressive ChatGPT is in crafting and imitating great work, the temptation is very real.\n\nBefore I get into the merits of the play and Lincoln Center’s thrilling production, something else that’s very real is the extraordinary talents of its leading man. Making his Broadway debut, Robert Downey Jr., who most of us know only through his film work, is a great stage actor. As famed novelist Jacob McNeal, an egotistical, self-acknowledged asshole, he is a fascinating creature treading the line between obnoxious and seductive.  You can’t take your eyes off him…and happily, he’s on stage for the entirety of Akhtar’s 90-minute drama.\n\nWe first meet him in his doctor’s office being warned to stay off the booze which has already ravaged his liver. It’s October and all he cares about is the imminent announcement from the Nobel committee naming the winner of the Literature Prize.\n\nThe play actually begins before we even see him. The set lights up revealing a giant phone screen as the words are typed out “Who will win the Nobel prize in literature this year?” And after the answer comes back speculating the names of several other famed authors, we see the cursor moving with the next prompt asking “What is the likelihood Jacob McNeal will win the Nobel prize this year?” No spoiler alert here but McNeal does find out who wins while still in the doctor’s office.\n\nAs the story progresses, it becomes clear that, despite his refusal to admit it, he does use ChatGPT in his writing, a lot of it. We come to discover it’s the extension of a practice started years earlier when he stole (or is it “borrowed”?) the works of others. And after years of being criticized for hating women in his stories, suddenly his latest book features a strong female protagonist. Turns out, that was stolen too in a disgraceful act of plagiarism.\n\nIt’s easy to see how and why someone like McNeal would find artificial intelligence so appealing. All he has to do is input classic works – King Lear, Madame Bovary, Hedda Gabler, Oedipus Rex  etc. –  and then ask the app to rewrite them “in the style of Jacob McNeal”. And what might take humans days if not weeks and months to accomplish, ChatGPT can produce results in seconds.\n\nAkhtar, the Pulitzer Prize winning author of  Disgraced 11 years ago, may be in the running yet again.  His writing is crisp and compact but it’s also richly complex. Each scene featuring key figures in McNeal’s life reveals another sordid layer in his warped personality. With his doctor – the excellent Ruthie Ann Miles – he’s self-destructive.\n\nDespite his agent’s best efforts to capitalize on his star power, McNeal is uncooperative and difficult. Andrea Martin is terrific in the role exhibiting just the right mix of gleeful swagger and exasperation.\n\nMcNeal’s son, Harlan, is a very troubled young man. And no wonder. His mother, a frustrated writer, suffered mentally in the shadow of her egocentric husband, and committed suicide years earlier when Harlan was a boy. Left to be raised by McNeal in what must have been a fairly loveless home, he is now filled with loathing for his father. Their chilling scene together is raw and intensely bitter, Rafi Gavron in his first Broadway role delivers a heartbreaking performance as a son betrayed by not one but both of his parents.\n\nA scene featuring McNeal’s interview with a New York Times reporter assigned to profile the acclaimed novelist brings out McNeal’s arrogance and contrarian nature.  Right off the bat he asks the young African American reporter if she’s “a diversity hire”; and later states that he “envied Harvey Weinstein.” Brittany Bellizeare, also making her Broadway debut, does a nice job as a woman who’s offended by McNeal but also finds his honesty surprisingly refreshing.\n\nThe last encounter is with McNeal’s former lover. Melora Hardin is engaging as Francine Blake, a writer and editor with whom he tries to re-ignite the relationship. She’s not interested at first but softens and then rejects him after describing all the ways he stole the sensitive details of her life for his so-called “art,” saying his hubris is repulsive. At this point in the production, the physical world and the cyber merge, and it’s hard to make sense of what’s real. Or are we in a virtual hallucination?\n\nAkhtar’s prophetic tale is rendered in a production that’s directed exquisitely by Bartlett Sher. It’s a gorgeous collaboration marrying technology, the spoken word, performance, story and stage craft all in one cohesive design. In between each scene, the stage is filled with a panoramic evocation of artificial intelligence that’s so integral to the narrative, it must be regarded as another character. And by play’s end, much like Hal, the rogue computer from 2001: A Space Odyssey, the technology seems to come alive. Credit the artistry of the design team Michael Yeargan & Jake Barton who crafted the sets, and Barton’s stunning projections.\n\nAs spectacular as it all appears, Downey Jr.’s performance is the linchpin of the entire production, and it’s a tribute to his gifts as an actor that he turns the work into an engrossing study of the intersection of art and the powers of cyber science. His McNeal is a deeply flawed individual and yet one who recognizes his shortcomings, though not enough to change. He explains “computers are our fondest enablers.”\n\nAt play’s end, we see the screen light up again with the prompt: “Please write a final speech for an audience confused by what is real and what isn’t, inspired by Prospero’s final speech to the audience in Shakespeare’s The Tempest.” What pops up is a soliloquy closely matching the eloquence of the Bard’s words. I had to know if it was actually the product of AI, and so I asked the production team. The response was “Ayad did not use GPT to write the play’s text…only the last speech’s final couplet, which was generated by AI.”\n\nThose two lines are indeed poetic, but considering everything else in Akhtar’s exceptional play is human made, I find it hard to believe that anything artificial intelligence could come up with would be as wholly rewarding and profound.\n\nMcNeal opened September 30, 2024, at the Vivian Beaumont Theater and runs through November 24. Tickets and information: lct.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "Before I get into the merits of the play and Lincoln Center’s thrilling production, something else that’s very real is the extraordinary talents of its leading man. Making his Broadway debut, Robert Downey Jr., who most of us know only through his film work, is a great stage actor. As famed novelist Jacob McNeal, an egotistical, self-acknowledged asshole, he is a fascinating creature treading the line between obnoxious and seductive. You can’t take your eyes off him…and happily, he’s on stage for the entirety of Akhtar’s 90-minute drama.",
  "bwwScore": 9
}
