{
  "showId": "mcneal-2024",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/mcneal-fights-ai-audience-loses-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/mcneal-fights-ai-audience-loses-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Downey, though lacking in stagecraft and more or less acting from beat to beat, is not without merit. He embodies the self-important asshole-yness of a 20th century literary giant with ease, and could likely have crafted a more memorable character had he been written a meatier role. But his McNeal is as wandering and ineffective as the play itself. Akhtar, whose work has always existed in the liminality between tradition and vanguard, is here lost in the slop. McNeal, the character, doesn’t land on any side of the “Is AI good for art, or killing it?” divide, instead treating it with the safe curiosity of a successful man with little to lose in his later years. (I must here grudgingly point to a titan like David Lynch archly commenting on Donald Trump’s value in waking up the national consciousness a few years back.) That’s interesting. But Akhtar does not explore that, attacking the personal choices, rather than the possible ideologies, of his largely archetypal character. McNeal, the play, therefore comes and goes; a mild thumbnail in a growing pile of decreasingly worthwhile content, featuring artists and themes we know and love, borne back ceaselessly into the archive.",
  "bwwScore": 3,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Robert-Downey-Jr-More-Star-In-MCNEAL-on-Broadway-20240930",
  "fullText": "The company of McNeal | Photo: Matthew Murphy and Evan Zimmerman\n\nI’ve been a little upset with Robert Downey Jr lately. Not that I’ve thought about him too often since his near-complete absorption into the Marvel universe, but because of reports that his salary for participating (I can’t quite say ‘acting’) in the franchise’s next two films hovers around $100 million, plus private jet travel, dedicated security and a “trailer encampment” on set.\n\nI know, I know: Don’t hate the player, hate the game. Maybe, amid what truly feels like the planet’s final inning, he’s planning to donate it all to the whales or something. And since when has the shifty matter of financial worth mattered when assessing craft?\n\nBut this is the vibe going into his Broadway debut in McNeal, an impotent new Ayad Akhtar play about the value of art and the moral dangers of artificial intelligence – I think. It seems to want to warn us of the soullessness of technologies like ChatGPT in its tale of a Great Male Novelist (Downey) staring down an authenticity scandal just as he’s awarded his long-awaited Nobel. But the play’s premiere production at Lincoln Center isn’t too sure.\n\nIt’s not a new paradigm – Genius Artist Exploits Others For Material – despite the amount of diversions Akhtar throws its way via a cavalcade of supporting performances from embarrassingly overqualified actors. His doctor (Ruthie Ann Miles) warns against his drinking; his son (Rafi Gavron) and ex-lover (Melora Hardin) warn against his selfishness in using them in his work; his agent (Andrea Martin) warns against discussing his budding fascination with AI, especially during a New York Times interview by a writer (Brittany Bellizeare) who is a young, Black woman (how else to set up a low-hanging identity gap confrontation?).\n\nMcNeal, the author, marvels at technologies which can absorb the entirety of the written human experience and churn out a detailed account from a particular voice (“Please rework these texts in the style of Jacob McNeal,” he asks the machine), and it is interesting to think of generative AI as the latest iteration in a long line of intellectual property theft. Shakespeare’s basically rewriting of a preexisting King Lear story for his own masterful use is mentioned often. But the AI element seems shoehorned in; a topical way to zhuzh up a trite tale about an unscrupulous writer.\n\nAnd I cannot be asked to consider, in good conscience, the perils of AI in a production that proudly boasts a “Metahuman digital composite” of Downey created by the Russo brothers’ AGBO studio. I’m not entirely sure how it is any different from your average CGI, by the way, except that it was made by the very people conspiring to kill cinema, and that it might have created (god save us) the definitive piece of Ronald Reagan nightmare fuel.\n\nThe production is directed by Bartlett Sher in a way that activates much of the large Beaumont stage’s potential. Michael Yeargan’s set has the cleanliness of an Apple Store and mostly gives way for Jake Barton’s crisp projections which, to their credit, do convey the uncanny valley eeriness – and appeal – of artificial intelligence.\n\nDowney, though lacking in stagecraft and more or less acting from beat to beat, is not without merit. He embodies the self-important asshole-yness of a 20th century literary giant with ease, and could likely have crafted a more memorable character had he been written a meatier role. But his McNeal is as wandering and ineffective as the play itself.\n\nAkhtar, whose work has always existed in the liminality between tradition and vanguard, is here lost in the slop. McNeal, the character, doesn’t land on any side of the “Is AI good for art, or killing it?” divide, instead treating it with the safe curiosity of a successful man with little to lose in his later years. (I must here grudgingly point to a titan like David Lynch archly commenting on Donald Trump’s value in waking up the national consciousness a few years back.) That’s interesting. But Akhtar does not explore that, attacking the personal choices, rather than the possible ideologies, of his largely archetypal character.\n\nMcNeal, the play, therefore comes and goes; a mild thumbnail in a growing pile of decreasingly worthwhile content, featuring artists and themes we know and love, borne back ceaselessly into the archive.\n\n‍McNeal is in performance through November 24, 2024 at the Vivian Beaumont Theatre on West 65th St in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 858,
  "archivePath": "data/archives/reviews/mcneal-2024/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:16:52.897Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251212012519",
  "archiveOrgUrl": "http://web.archive.org/web/20251212012519/https://www.theatrely.com/post/mcneal-fights-ai-audience-loses-review",
  "contentTier": "complete",
  "wordCount": 858,
  "tierReason": "Full review text"
}