{
  "showId": "mcneal-2024",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Aramide Tinubu",
  "url": "https://variety.com/2024/legit/reviews/mcneal-review-robert-downey-jr-broadway-1236160088/",
  "publishDate": "October 23, 2024",
  "fullText": "As technology continues to evolve, the arts and humanities are having a reckoning, and it’s not pretty. In his newest play, “McNeal,” Pulitzer Prize winner Ayad Akhtar (“Disgraced”) confronts the ethics of AI, plagiarism and ownership in storytelling. Directed by Bartlett Sher, the play centers on Jacob McNeal (Robert Downey Jr. in his Broadway debut), an acclaimed novelist whose alcoholism and mental illness have come to a tipping point at the crux of his career. While beautifully staged and produced, “McNeal” is a dull and garbled play that says very little about ethics and artificial intelligence and instead hoists up a pompous and exhausting man who has only ever cared about himself and his legacy. \n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n\n VIP+\n \n\n \n \n\n \n \n \n \n Why the Video Game Industry Can’t Shake Its Struggles \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Kaos' Creator 'Gutted' About Netflix Canceling Series After One Season: 'I Don't Want This News to Overshadow What We Did Make'\n\n“McNeal” opens in a doctor’s office. Anticipating a call from the Swedish Academy, which is set to announce the annual Nobel Prize winner in literature, Jacob ignores the pleas of Dr. Sahra Grewal (Ruthie Anne Miles) to stop his alcohol abuse. Though his liver is rapidly failing, Jacob is solely concerned with the debut of his new novel and his pending Nobel Prize. In a frenzy of an opening scene, Dr. Grewal’s concerns about Jacob’s hallucinations and improper use of medication fall on deaf ears as he grumbles, recalling being passed over for the Nobel in the past while griping about technological advances and other perceived personal injustices.\n\nDr. Grewal and Jacob’s agent, Stephie (Andrea Martin), don’t realize that as much disdain as the writer has for AI, he is also fascinated by it. Unbeknownst to them, his latest novel is a ChatGPT-esque creation infusing historical speeches, passages from the Bible, famous texts and his late wife’s unpublished manuscript. The central theme of “McNeal” is supposed to center on the impending horrors of AI. Yet, the play is fixated on the morality of using other people’s personal stories and passing them off as original ideas. Without truly tackling the impact of AI in the world of literature and instead focusing on plagiarism, “McNeal” isn’t offering audiences anything unique or new to contend with. \n\n \n Popular on Variety\n\nAs a character, Jacob is intensely unbearable. He uses his alcohol abuse almost as a cloak of armor, and it only exacerbates his misogyny and narcissism. His cruelty is specifically highlighted in a scene with his adult son, Harlan (Rafi Gavron), who confronts him for stealing his late mother’s book. An initially sharp illustration of a broken father/son relationship quickly dissolves into melodrama after a horrifying reference to incest is thrown into the plot. Since it does nothing to move the narrative forward, this reference seems clearly added for shock value. One of the play’s final scenes is even more baffling. Set in a park, it showcases the women in Jacob’s life hovering in the background, including his ex-lover Francine (Melora Hardin), whom he emotionally abused for years. Since “McNeal” fails to center itself on one premise, it is unclear whether this is a hallucination or another of Jacob’s AI narratives.\n\nMoreover, the dialogue in the 90-minute play is so choppy and robotic that the actors, Downey in particular, seem unable to make their way through it. Miles, Martin and Hardin are barely more than supporting figures — which is ironically how Jacob treats all women. It’s only during a booze-filled conversation he has with a New York Magazine reporter, Natasha Brathwaite (Brittany Bellizeare), that a character is given the dialogue and the space to truly engage with Jacob. Unlike everyone else, Natasha immediately sees Jacob for who he is, not the humanist he portrays himself as.\n\nThough “McNeal” has very little to add on the subject of AI, it is one of the most visually stunning and uniquely staged productions on Broadway. Running at Lincoln Center’s Vivian Beaumont Theater, set designers Michael Yeargan and Jake Barton, lighting designer Donald Holder, sound engineers Justin Ellington and Beth Lake and the digital effects by AGBO (and projections by Barton) work together to create a genuinely immersive experience that incorporates gasp-worthy mixed media and projections, keeping the audience engaged even when the story itself fails to do so.\n\n“McNeal” falters because it doesn’t know what it wants to say. Moreover, the narrative felt confusing and meaningless, with a mix of genres and no actual theme or climax. Jacob is a writer, but viewers can never penetrate who he is beyond the surface. Instead, the play becomes an illustration of a self-absorbed man who treats the people around him like accessories for his own gain.",
  "isFullReview": true,
  "dtliExcerpt": "While the premise of 'McNeal' is intriguing and certainly timely, the play ultimately feels more like a lecture than a fully realized theatrical experience.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "“McNeal” falters because it doesn’t know what it wants to say. Moreover, the narrative felt confusing and meaningless, with a mix of genres and no actual theme or climax. Jacob is a writer, but viewers can never penetrate who he is beyond the surface. Instead, the play becomes an illustration of a self-absorbed man who treats the people around him like accessories for his own gain.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Robert-Downey-Jr-More-Star-In-MCNEAL-on-Broadway-20240930",
  "showScoreExcerpt": "While the premise of 'McNeal' is intriguing and certainly timely, the play ultimately feels more like a lecture than a fully realized theatrical experience.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "bwwScore": 3,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ],
  "previousUrl": "https://variety.com/2024/legit/reviews/mcneal-review-broadway-lincoln-center-theater-1236196105/",
  "urlDiscoveredAt": "2026-02-05T04:28:01.525Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 776,
  "archivePath": "data/archives/reviews/mcneal-2024/variety--aramide-tinubu_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:28:01.531Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241011093622",
  "archiveOrgUrl": "http://web.archive.org/web/20241011093622/https://variety.com/2024/legit/reviews/mcneal-review-robert-downey-jr-broadway-1236160088/",
  "wordCount": 776,
  "tierReason": "Full review text"
}