{
  "showId": "i-need-that-2023",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani",
  "url": "https://www.broadwaynews.com/the-broadway-review-in-i-need-that-a-home-cluttered-with-rubbish-and-a-play-void-of-resonance/",
  "publishDate": "November 3, 2023",
  "fullText": "Theresa Rebeck’s latest theatrical venture is one of her limpest — a frustratingly monotone, predictable and seasonless dose of comfort theater. Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “I Need That.” What does it say when a man cannot remember his siblings, but can recite with excruciating detail the history of a 67-year-old bottle cap buried in a pile of random junk? It might suggest that the memory of a simple piece of metal (a keepsake from selling soda on Friday nights at church bingo) provides more comfort than family. In veteran playwright Theresa Rebeck’s new dud of a play “I Need That,” aluminum is thicker than blood. The show follows a stubborn older man named Sam (78-year-old Danny DeVito) who amasses domestic junk — magazines, board games, records — much to the chagrin of both the health department and his only child Amelia (Lucy DeVito, the screen favorite’s actual daughter). Rebeck plops each character on opposite ends of the play’s sole conflict — to keep or not to keep, that’s their only question. The two repeat the same argument for the vast majority of the play; each scene resembles the previous one. Rebeck lazily shoots darts at dramatic stakes — the threat of home seizure from the aforementioned government agency; Sam’s best friend Foster’s (Ray Anthony Thomas) habit of pilfering and pawning treasures found in Sam’s trash — but neither stick. Sam hardly cares and since the ever-watchable, ever-hammy Danny DeVito is the singular lifeblood of this play, neither do we. It’s not that the production is terrible by any means. It remains humorous and heartwarming at the right times, but with all the thrill of TV dinner meatloaf: low effort, over quickly and indistinguishable on the inside. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": true,
  "dtliExcerpt": "It’s not that the production is terrible by any means. It remains humorous and heartwarming at the right times, but with all the thrill of TV dinner meatloaf: low effort, over quickly and indistinguishable on the inside.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "MEH",
  "dtliUrl": "https://didtheylikeit.com/shows/i-need-that/",
  "needsScoring": true,
  "textWordCount": 321,
  "archivePath": "data/archives/reviews/i-need-that-2023/broadway-news--brittani_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:55:34.408Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}