{
  "showId": "i-need-that-2023",
  "outletId": "newyorktheatreguide-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.newyorktheatreguide.com/reviews/i-need-that-broadway-review-danny-devito",
  "publishDate": null,
  "fullText": "Read our review of I Need That on Broadway, a new play by Theresa Rebeck starring Danny DeVito, at the American Airlines Theatre through December 30. The vintage board game Sorry! wasn't designed to be played alone. Leave it to Emmy winner Danny DeVito, who shines as the aimless widow Sam in I Need That, to turn the unlikely moment into a theatrical highlight that’s silly, sad, and, no joke, poetic. After all, it’s an original way of indicating Sam is knee-deep in sorrow. He’s also buried in clutter, one more ratty afghan shy of being a shut-in hoarder. Otherwise, Theresa Rebeck’s wispy comedy about love, loss, and coping with the aftermath, is all too expected. It seeks to say something significant and memorable but doesn’t quite get there. Early on in the Roundabout Theatre Company production, which runs about 100 intermissionless minutes, we learn Sam is up against the clock. His nosy New Jersey neighbor peeked through his windows, photographed his hell house, and contacted the authorities. Set designer Alexander Dodge’s residential setting neatly captures the chaos of books, blankets, magazines, old appliances, dishes — you name it. Sam has ignored official warning letters. The fire department is coming in a week, and his home will be condemned. Sam, a walking unmade bed, will be on the streets. But Sam is moved to inaction. Rebeck (Bernhardt/Hamlet, Seminar) is a witty writer. She initially plays the circumstances for laughs. “You have to figure out what you want to keep, and what you can let go,” Sam says. “It’s like Sophie’s Choice.” His bossy but well-meaning daughter, Amelia (Lucy DeVito, the daughter of the show’s star), who’s hunting for a job and has issues of her own, loudly disagrees. She says it’s the final scene in Carrie, “where the house is so full of terrible things it just sucks itself into the earth.” Foster (Ray Anthony Thomas), Sam’s only friend, shows support by popping in regularly with croissants and hamburgers. The generosity is a smoke screen. Foster uses his visits to snatch valuables – pieces of jewelry, collectible treasures – when he thinks Sam isn’t looking. But Sam knows what Foster is up to and doesn’t care. Sam is adrift from the loss of his beloved wife, Ginny, who died three years earlier. He has tried to preserve every book, knickknack, ancient TV set, parlor game, and trinket that holds any recollection of Ginny. She “disappeared” into what’s never named but sounds like Alzheimer’s. At this point the mood turns serious. The cast, directed by Moritz von Stuelpnagel, hugs the tonal contours skillfully. From the get-go, it’s a safe bet that Sam and his home will transform. Thanks to a late-in-the-game twist, he also gets a shot to step up as a dad. In the end, I Need That is pleasant but leaves you wanting. “Things don’t give your life meaning. People do,” Amelia declares, as if it’s a newsflash. Sorry — it doesn't take a play to know that. I Need That is at the American Airlines Theatre through December 30. Get I Need That tickets on New York Theatre Guide. Photo credit: Danny DeVito in I Need That. (Photo by Joan Marcus) Danny DeVito returns to Broadway in Theresa Rebeck's new play stuffed with laughs and heart. As the reclusive hoarder Sam, who's forced to finally clean up his act and his home, he searches for the difference between trash and treasure. I Need That on Broadway is playing at Todd Haimes Theatre. The theatre is located at 227 West 42nd Street, New York, 10036. The running time of I Need That on Broadway is 1h 40m The recommended age for I Need That on Broadway is 13+. Book tickets for I Need That on Broadway on New York Theatre Guide. Award-winning playwright Theresa Rebeck wrote I Need That. She is known for her Pulitzer-nominated play Omnium Gatherum and her Broadway plays Bernhardt/Hamlet, Dead Accounts, Mauritius, and Seminar. Moritz von Stuelpnagel directs I Need That, marking his second time directing a Theresa Rebeck play following 2018's Bernhardt/Hamlet. He's also known for directing Hand to God and Present Laughter. I Need That is recommended for ages 13 and up due to strong language. Please note that children 4 and younger are not permitted in Broadway theatres. I Need That promises to be heartfelt and entertaining, and the play has a lot of talent involved: Danny DeVito; his real-life daughter, Lucy; and an award-winning playwright and Tony-nominated director. Originally published on Nov 1, 202321:00",
  "isFullReview": true,
  "dtliExcerpt": "“The vintage board game Sorry! wasn't designed to be played alone. Leave it to Emmy winner Danny DeVito, who shines as the aimless widow Sam in ‘I Need That’, to turn the unlikely moment into a theatrical highlight that’s silly, sad, and, no joke, poetic.”\n\nRead more",
  "originalScore": null,
  "assignedScore": 75,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 753,
  "archivePath": "data/archives/reviews/i-need-that-2023/newyorktheatreguide-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:00:13.628Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "designation": "Recommended",
  "scoreSource": "extracted-thumbs-up",
  "scoreConfidence": "low"
}