{
  "showId": "i-need-that-2023",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/INeedThat.html",
  "publishDate": null,
  "fullText": "Broadway Reviews\n \n\n I Need That\n\n\nTheatre Review by Howard Miller - November 2, 2023\n\n\nI Need That by Theresa Rebeck. Directed by Moritz von Stuelpnagel. Set design by Alexander Dodge. Costume design by Tilly Grimes. Lighting design by Yi Zhao. Sound design Fitz Patton and Bradlee Ward. Original music by Fitz Patton. Hair and makeup design by Tommy Kurzman Movement consultant Robert Westley.\nCast: Danny DeVito, Lucy DeVito, and Ray Anthony Thomas.\nTheater: American Airlines Theatre, 227 West 42nd Street (Between 7th and 8th Avenues)\nTickets: RoundaboutTheatre.org\n\n\nRay Anthony Thomas, Lucy DeVito, and Danny DeVitoPhoto by Joan MarcusTheresa Rebeck's new play I Need That, opening tonight at the American Airlines Theatre, was created specifically as a vehicle for actor/comedian Danny DeVito and his daughter Lucy DeVito. No doubt the pair are making the most of the opportunity. Danny plays to the audience with his characteristic combo-pack of quirky charm and irascibility recognizable from his television roles, while Lucy keeps things on the straight and narrow as his loving but hapless offspring. But the play itself, which treads lightly upon some serious subject matter, never manages to find its footing as it meanders from issue to issue, while a plot thread involving a potentially quite interesting third character comes off as an underdeveloped afterthought.  \n\nRebeck has demonstrated through the years a deftness at finding the humor in weighty situations and of creating complicated characters who must navigate both sides of the equation. Here, however, at least as directed by Moritz von Stuelpnagel, the humor in I Need That is generally an offshoot of Danny DeVito's persona and not of the situation or of the character he portrays. That would be Sam, a near-hoarder and quasi-agoraphobic who is at risk of losing his home, said to be a potential health and fire hazard and therefore a threat to the entire neighborhood somewhere in New Jersey.\n\nThe play opens on a darkened living room dominated by seemingly random piles of miscellanea. As designed by Alexander Dodge, it's not quite the overwhelming heap of refuse we've come to imagine as belonging to a stereotypical hoarder, but it's well on its way. There's no one in view among the flotsam and jetsam until an insistent pounding on the front door rouses Sam, who has been asleep under a pile of covers on the sofa. \n\nIt is his buddy Foster (well played by Ray Anthony Thomas within the constraints of the underwritten role). They spend the next few minutes chit-chatting, mostly about the overcrowded room and the need for Sam to \"organize some of this right out the door.\" Jokey punchlines about a 67-year-old bottle cap and plastic bingo chips fill the conversation until there is another knock at the door. It's Amelia, Sam's daughter, who wants very much to help him get things in hand before the fire department arrives to condemn the place. And we're off on a round of she says/he says.\n\nSo she says it's a \"disaster, a collapse, the weight of the universe.\" And he says he's merely sorting through everything, figuring out what to keep and what to let go. She compares the teetering assemblage of books, papers, board games, clothing, and seemingly useless ephemera to the ending of Carrie, \"where poor psycho Carrie and her evil mother are buried under the wreckage of their lives.\" He compares his process of decluttering to Sophie's Choice. And round and round they go, until Amelia leaves for an appointment about a job interview. Not to worry, though. She'll be back with plenty of trash bags and bubble wrap. \n\nMuch of I Need That, which runs 100 minutes with no intermission, consists largely of the ongoing father-daughter debate, idle conversation between Sam and Foster, and a plethora of sitcom jokes, most of them tossed off with great aplomb by Danny DeVito, a master of comedic technique and timing. A solo excursion into the board game of Sorry, for instance, is both quite funny and revealing of what drives Sam and is perhaps the creative high point of the proceedings. But for the most part, it does seem that the playwright has been quite chary about disclosing much about her characters.\n\nThematically, you might say I Need That deals with the human capacity to become mired in the past, the present, or the future. Quite sparingly, in tiny bits and pieces, we learn about the source of Sam's underlying problems and what it is from his past he really is clinging to; about the challenging issues that Foster is facing that keep him locked into the present; and about Amelia's hesitancy about marching into a future life for herself. In true Rebeck fashion, a couple of surprising revelations are sprung on us out of the blue, along with a hopeful ending that more-or-less sorts things out. But because the plot consists of a conglomeration of barely examined ideas, the whole fails to satisfy beyond the comedic stylings of Danny DeVito.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                  \n\n                                                  \n                \n              \n            \n          \n        \n      \n    \n  \n\n\n\n\n\n\n\n\n    \n    \n    \n                \n                \n                \n\n            \n             \n            \n                \n                    \n                        Share:",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 827,
  "archivePath": "data/archives/reviews/i-need-that-2023/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:05:20.752Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "timeout of 90000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250603075448",
  "archiveOrgUrl": "http://web.archive.org/web/20250603075448/https://www.talkinbroadway.com/page/world/INeedThat.html"
}