{
  "showId": "i-need-that-2023",
  "outletId": "theaterlife-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://theaterlife.com/i-need-that-1-2/",
  "publishDate": null,
  "fullText": "November 8, 2023: There’s nothing new about the practice of hoarding—especially when it reaches psychologically perilous levels—although the fascination in recent years with it in books, movies, and TV shows (both documentary and fiction based), not to mention the Marie Kondo syndrome of de-hoarding specialists, might make you think otherwise. Many of us probably know someone—maybe even ourselves—who, at least partly, is addicted to saving old magazines, newspapers, tchotchkes, electronics, hardware, or you-name-it, being unable to part with even the most trivial object. Perhaps this is because of some arguably sentimental value it possesses, or maybe there’s some other reason it would require analysis to discover. November 8, 2023: There’s nothing new about the practice of hoarding—especially when it reaches psychologically perilous levels—although the fascination in recent years with it in books, movies, and TV shows (both documentary and fiction based), not to mention the Marie Kondo syndrome of de-hoarding specialists, might make you think otherwise. Many of us probably know someone—maybe even ourselves—who, at least partly, is addicted to saving old magazines, newspapers, tchotchkes, electronics, hardware, or you-name-it, being unable to part with even the most trivial object. Perhaps this is because of some arguably sentimental value it possesses, or maybe there’s some other reason it would require analysis to discover. My first encounter with a play about hoarding was in 1981 when Julianne Boyd directed an Off-Broadway play by Mark St. Germain, The Collyer Brothers at Home,about those eponymous New York siblings, Homer and Langley, on a set piled high with bundled newspapers. Many years later, in 2006, Boyd offered it again, now with another director, during her first season as artistic director at the Barrington Stage in the Berkshires. Sam, the main character in I Need That, the sentimental, sporadically laugh-generating, three-hander comedy written by the prolific Theresa Rebeck (Bernhardt/Hamlet) for its world premiere on Broadway at the Roundabout’s American Airlines Theatre, is not as far gone as Homer and Langley Collyer. However, as Alexander Dodge’s amusingly—if you don’t have to live there—cluttered set reveals, he certainly isn’t far behind. Board games, books, magazines, an unworkable DYI TV with rabbit ears, an old guitar with a story, a set of false teeth, and numerous other forms of detritus are jammed into every nook and cranny (although the kitchen and bathrooms are kept clean). And with the beloved, diminutive, 78-year-old (soon to be 79) TV and movie star Danny DeVito playing this grungy, obstinate, old hoarder-in-chief, a cloud of mangy white hair circling his otherwise bald pate, you might at first wonder where the junk begins and its collector ends. I Need That is a vehicle, written by Rebeck specifically for DeVito (and his daughter, Lucy, who costars as, yes, his daughter). It’s built to highlight the kind of profane, lovable, everyman curmudgeon DeVito has specialized in since he played Louie De Palma on TV’s “Taxi.” Its structure is essentially that of a situation, with material suitable for an hour-long one-act unconvincingly stretched to fill an extra 40 minutes or so. Just as the set is crammed with personal “stuff,” so is I Need That with dramaturgic stuff. The situation is that Sam, a reclusive widower, is in imminent danger of losing his New Jersey house because, pursuant to neighbors’ complaints, its overgrown, shabby exterior and firetrap interior conditions are deemed unsightly and hazardous; the place must be cleaned up before next week’s fire department inspection or Sam will lose it. He, however, remains secluded in his one accessible chair, never even venturing outside. His chief excuse is his inability to do anything that will disturb his memories of his boyhood family or his late wife, who had dementia. Sam’s unmarried daughter, Amelia, who rarely visits, does now. Determined to convince her father to get rid of all his crap if he doesn’t want to face the consequences, she’s increasingly frustrated by his resistance. Since his obsession seems lifelong, not latter day, one wonders why it took her so long to make a fuss. Sam, for his part, resists the need to discard even the most innocuous junk, like an old bottle cap. His only friend, an elderly African American man named Foster (Ray Anthony Thomas), who has his own problems, also tries to convince Sam to reform, but he’s planning to move to Cleveland (a name with which DeVito has a comic field day). Foster’s relationship with Sam, however, seems more a way to have someone for Sam to talk things over with than anything organic; this seems even more obvious when he gets to expound on his own issues. Finally, Sam decides to act, but, just when the action should be wrapping up, we move into a discussion of Amelia’s personal issues with holding onto things. It helps tie things together, and gives Lucy DeVito something to chew on, but is nonetheless an unconvincing contrivance that seems more filler than fulfilling. Moritz von Stuelpnagel’s direction maintains the appropriate sitcom pace and spirit, and Lucy DeVito and Ray Anthony Thomas, appropriately costumed by Tilly Grimes, do what their two-dimensional roles require. Dodge’s set, lit well by Yi Zhao, is on a turntable that allows it to do some tricks when the house’s frontage comes into view. Its return to a renewed view of the interior inspires a round of applause. But the loudest applause goes to DeVito, a consistently enjoyable presence, his comical cantankerousness both funny and honest. His big scene is a technically complex set piece in which he plays a game of “Sorry!” with imaginary competitors, joyfully demolishing them with vulgar putdowns. No doubt about it: this is the Danny DeVito show (it’s only his second Broadway role). If you’re a theatrical hoarder, anxious to collect as many Broadway memories as you can, you’ll need to add I Need That to your pile, if only for the chance to appreciate DeVito doing what he does best. I Need That ***1/2American Airlines Theatre/Roundabout Theatre Company227 W. 42nd Street, NYCThrough December 30, 2023Photography: Joan Marcus",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 50,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 998,
  "archivePath": "data/archives/reviews/i-need-that-2023/theaterlife-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:06:36.269Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "scoreSource": "extracted-rating",
  "scoreConfidence": "medium",
  "extractedRating": "1/2"
}