{
  "showId": "i-need-that-2023",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Trish Dietch",
  "url": "https://variety.com/2023/legit/reviews/i-need-that-review-danny-devito-broadway-1235778734/",
  "playbillVerdictUrl": "https://variety.com/2023/legit/reviews/i-need-that-review-danny-devito-broadway-1235778734/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "duplicateOf": "variety--trish-deitch.json",
  "fullText": "Let's face it: No one's going to hire Danny DeVito to play Lear. Or Willy Loman. Or even George to Albee's Martha. In the eyes of the world, DeVito is a clown, just short of having a Bozo nose. If he stood onstage reading the obituary page, people would die laughing.\n\nSo it doesn't really matter that playwright Theresa Rebeck's \"I Need That\" — written for DeVito and his daughter, Lucy DeVito, and playing at the Roundabout Theatre Company's American Airlines Theatre on Broadway — is basically a 90-minute sitcom episode, full of sentimentality. TV is what DeVito does best, and he's good at this. He's easy, relaxed and sparking with grumpy mirth.\n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Sharon Stone Makes 'Euphoria' Season 3 Debut in First Look at Her Studio Boss Role: 'She Runs the Show' \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Eric Dane Drops Out of Awards Gala 'Due to the Physical Realities of ALS'\n\nDirected by Maritz von Stuelpnagel, \"I Need That\" centers around a stubborn old hoarder threatened with eviction because his decades worth of memorabilia is spilling out onto the front lawn. And though there are moments of tension — as when the old man's daughter (played charmingly by Lucy DeVito) and best friend (in a heartfelt performance by Ray Anthony Thomas) are haranguing him about cleaning up, or, later, admitting to him that they must move on — DeVito spends most of the play up there in his bathrobe, hair all mussed, interacting with a sea of fun props: boardgames, a television set with rabbit ears, old poker chips, a beat-up electric guitar. The best moment in the play is watching DeVito, alone in the house, beat himself at the boardgame Sorry!",
  "isFullReview": true,
  "textWordCount": 279,
  "archivePath": "data/archives/reviews/i-need-that-2023/variety--trish-dietch_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:55:25.654Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 279,
  "tierReason": "Short but structurally complete review"
}