{
  "showId": "mean-girls-2018",
  "outletId": "chicagotribune",
  "outlet": "Chicago Tribune",
  "criticName": "Chris Jones",
  "url": "http://www.chicagotribune.com/entertainment/theater/broadway/sc-ent-mean-girls-broadway-review-0408-story.html",
  "playbillVerdictUrl": "http://www.chicagotribune.com/entertainment/theater/broadway/sc-ent-mean-girls-broadway-review-0408-story.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "web-search",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "All of Fey's long-form shows have unfolded at rapid paces and 'Mean Girls' is no exception. It's packed with body-twisting and often witty choreography from Nicholaw, whose show, with a set by Scott Pask, is so stocked with stimulation (verbal, physical, digital) that it rests not for a second, a choice that does not help Henningsen really change, given that Richmond's score, as energetic and funny as everything else here, is hardly centered on self-reflective ballads. But that likely will delight much of the audience who'll be trying to figure out why that dance number had boys in drag (don't ask me) and that one had that Easter egg and so on. At the Saturday matinee I saw, the balcony was having so much whoop-it-up fun, I was worried about someone's tucked-away phone falling and smacking me on my balding pate.",
  "bwwScore": 6,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Did-the-Critics-Think-MEAN-GIRLS-Was-Fetch-All-the-Reviews-Updating-Live-20180408",
  "showScoreExcerpt": "\"Fey still writes funnier, smarter, sharper satire than most anyone else...Janice and her sidekick Damian have the heart of the story, but not the stage-time. And that, in the end, is a structural strain...Packed with body-twisting and often witty choreography...So stocked with stimulation that it rests not for a second, a choice that does not help Henningsen really change, given that Richmond's score, as energetic and funny as everything else here, is hardly centered on self-reflective ballads.\"\n\nRead more",
  "publishDate": "April 13, 2018"
}