{
  "showId": "mean-girls-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/04/08/mean-girls-tina-feys-little-foxes-slay-broadway/",
  "publishDate": "2018-04-08T21:39:49",
  "fullText": "Tina Fey, having conquered the small screen, the big screen, the best seller list and who knows what other celebrity/writer/personality yardsticks, has now brought a stage adaptation of her rambunctious 2004 movie Mean Girls to the August Wilson Theatre, and who’d imagine that we’d be conjoining Wilson and Fey in the same sentence? But life upon the wicked stage ain’t ever what a girl supposes, to quote the immortal Oscar, whose Oklahoma! opened 75 years ago last weekend. And who’d imagine that we’d be conjoining Hammerstein and Fey in the same sentence?\n\nHere comes Fey storming onto the Rialto, having never concocted such a thing before. Perhaps she might profitably have taken a few lessons on musical comedy, you might wonder? No; maybe she should be giving lessons. Because Mean Girls is “fetch.” Which in the parlance might be considered “mean good”; or as Tina might say, but Oscar most assuredly would not, “tits.” The legally pink juniors from North Shore High have taken residence of the stage long claimed by those Jersey boys, and these Chicago girls are likely to enjoy a similarly raucous reign.\n\nMean Girls is like a chocolate box filled with goodies. One can imagine the authoress sitting on a hammock in her backyard with one of those 48-piece Whitman’s Samplers, sampling all four dozen and carefully replacing the ones not to her liking in the crinkly brown wrappers (as if an acolyte might come along to taste the half-eaten rejects). Because no, not every concoction in this new musical is 100 percent up to snuff; but most of them are.\n\nWe can skip the book, as we’ve already made clear that it is pretty damn funny, and what a novel statement is that to make about a contemporary musical comedy. Not since The Book of Mormon, maybe; which is not coincidental, as Mean Girls comes from that musical’s wizardly Casey Nicholaw along with other cohorts. (These include universally respected executive producer Stuart Thompson, who died in August but retains producer billing on the new show). Director-choreographer Nicholaw, who is known for dance numbers that are so over-the-top that you can’t possibly top them except he continually does, is in a happy mood here; a tap-happy mood, if you will, as he returns to Mormon form after three less gleeful efforts.\n\nThe score comes from newcomer Jeff Richmond, composer of TV’s 30 Rock and husband to the librettist, and lyricist Nell Benjamin. To say that the latter was lyricist of Legally Blonde is not altogether beside the point; at times, Mean Girls plays something like a mix of Legally Blonde and Mormon. Benjamin has heretofore demonstrated a way with words; she was also author of the underappreciated but outlandishly funny comedy The Explorer’s Club. The Richmond/Benjamin wares are consistently amusing and more than functional, which compared to the winter/spring crop of musicals is high praise indeed. At some point the songwriters seem to have run out of steam, leaving too many songs that seem like what we just heard. Even so, the score is mostly cheery and spirited.\n\nThe joys of the evening continue with the scenery by Mormonite Scott Pask, which serves as a perfect palette for the video design by Finn Ross and Adam Young: Mean Girls continually pops when Nicholaw mixes dance moves with the physical goings on. The costumes of Gregg Barnes and lighting by Kenneth Posner round out an altogether nifty production. The lead producers are longtime Fey cohort Lorne Michaels, of Saturday Night Live and producer of the Mean Girls film; the aforementioned Thompson; and Sonia Friedman, the producer of seemingly every West End hit of the past decade, including the U.K. Mormon. Friedman’s present slate includes Harry Potter and the Cursed Child and Jez Butterworth’s thoroughly astonishing The Ferryman (opening at the Jacobs in October, and get your tickets now).\n\nThe cast, too, enhances the fun. Erika Henningsen, whose only Broadway appearance has been as a replacement Fantine in Les Misérables, makes a refreshingly bright impression as Cady, the home-schooled girl transplanted from a Kenya game park to the Chicago jungle. (Watch for the manner in which Nicholaw and designers skewer Disney’s African musical.) Taylor Louderman, of Bring It On: The Musical, leads the plastic mean girls of the title; she is treacherously lethal as the first act Regina, and effectively handles the comedy as she carbo-balloons into non-pink sweatpants. Kate Rockwell (Bring It On) garners character sympathy and plenty of laughter as Karen, the vapid mean girl. Ashley Park is delightful and ultimately touching as the overly accommodating Gretchen, our appreciation growing as we realize midway through that this is the same actor who made a stirring Tuptim in the Kelli O’Hara King and I.\n\nTwo performers more or less pilfer the evening’s comedy. Grey Henson, a replacement Elder McKinley in Mormon, sweeps through the evening as the wry Damian. Henson is rewarded with “Stop,” a glitz and tap Nicholawian showstopper that is altogether purloined from “Turn It Off” in Mormon. And if you think building one of these numbers is easy, head over to SpongeBob, Margaritaville or Frozen, where they attempt the same with more perspiration than inspiration.\n\nThe supercharged secret weapon of the evening is Kerry Butler, playing three adult roles. Well remembered from Bat Boy and Hairspray, Butler is altogether uproarious here. (While one assumes that no dogs were harmed in the production of Mean Girls, Butler might make your mind momentarily flash to Edward Albee’s The Goat.) The rest of the cast is terrific, with Cheech Manohar and Mathlete buddies Ben Cook and Nikhil Saboo meriting special mention.\n\nMean Girls does not apparently aspire to be an instant Broadway classic on the level of Mormon, Hamilton or Dear Evan Hansen, but it succeeds as an exuberantly mirthful crowd-pleaser. In high school parlance, Nicholaw earns himself a scarlet-and-spangled A while Fey graduates summa cum laughter.\n\nMean Girls opened April 8, 2018, at the August Wilson Theatre. Tickets and information: meangirlsonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
