{
  "showId": "mean-girls-2018",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2018/04/08/theater/mean-girls-review-broadway-musical.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2018/04/08/theater/mean-girls-review-broadway-musical.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "web-search",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "That this 'Mean Girls' takes place (still at an Illinois high school) 14 years later than the film has proved no obstacle to Ms. Fey. After all, social media only increases opportunities for social climbing and subversion. The disconnect that troubles this musical isn't a matter of adapting to changing times. Scott Pask's set, Gregg Barnes's costumes and Finn Ross and Adam Young's video designs render sociological exactitude with flat comic-strip brightness. No, the trouble lies in the less assured translation of Ms. Fey's sly take on adolescent social angst into crowd-pleasing song and dance. Mr. Richmond and Ms. Benjamin's many (many) musical numbers are passable by middle-of-the-road Broadway standards (though Ms. Benjamin's shoehorned rhymes do not bear close examination).",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Did-the-Critics-Think-MEAN-GIRLS-Was-Fetch-All-the-Reviews-Updating-Live-20180408",
  "showScoreExcerpt": "\"Likable but seriously over-padded...The trouble lies in the less assured translation on adolescent social angst into crowd-pleasing song and dance. Richmond and Benjamin’s many many (many) musical numbers are passable by middle-of-the-road Broadway standards...Yet they rarely capture either the tone or the time of being a certain age in a certain era...As long as they're talking, the leading students of 'Mean Girls' exude an idiosyncratic, carefully exaggerated comic charm.\"\n\nRead more",
  "publishDate": "April 8, 2018"
}