{
  "showId": "the-curious-incident-of-the-dog-in-the-nighttime-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2014/10/06/theater/the-curious-incident-of-the-dog-in-the-night-time-opens-on-broadway.html",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/10/06/theater/the-curious-incident-of-the-dog-in-the-night-time-opens-on-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "Ever had one of those days in the city when you feel like you forgot to put your skin on? Sure you have. It happens when you haven’t slept, or you drank too much the night before, or you’ve been brooding over bad news.\n\nAll your senses, it seems, have been heightened to a painful acuity; your nerve endings are standing on guard. And every one of the manifold sights and sounds of urban life registers as a personal assault. You’re a walking target in a war zone, and that subway ride that awaits you looms like a descent into hell.\n\nSuch a state of being is conjured with dazzling effectiveness in “The Curious Incident of the Dog in the Night-Time,” which opened on Sunday night at the Ethel Barrymore Theater. Adapted by Simon Stephens from Mark Haddon’s best-selling 2003 novel about an autistic boy’s coming-of-age, this is one of the most fully immersive works ever to wallop Broadway.\n\nSo be prepared to have all your emotional and sensory buttons pushed, including a few you may have not known existed. As directed by Marianne Elliott (a Tony winner for the genius tear-jerker “War Horse”), with a production that retunes the way you see and hear, “Curious Incident” can be shamelessly manipulative.\n\nBut more than any mainstream theater production I know, it forces you to adopt, wholesale, the point of view of someone with whom you may initially feel you have little in common. That’s Christopher Boone, a 15-year-old mathematical genius for whom walking down the street or holding a conversation is a herculean challenge.\n\nPlayed by the recent Juilliard school graduate Alex Sharp, in the kind of smashing Broadway debut young actors classically dream about, Christopher is in some ways a parent’s nightmare. He hates being touched, is bewildered by the common clichés of small talk and is sent into cataclysmic tantrums by any violation of his rigidly ritualized world.\n\nHow to wade through the crush of culture coming your way this season? Here’s a guide to 100 events that have us especially excited, in order of appearance.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 372,
  "archivePath": "data/archives/reviews/the-curious-incident-of-the-dog-in-the-nighttime-2014/nytimes--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T17:50:46.659Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250715074755",
  "archiveOrgUrl": "http://web.archive.org/web/20250715074755/https://www.nytimes.com/2014/10/06/theater/the-curious-incident-of-the-dog-in-the-night-time-opens-on-broadway.html",
  "contentTier": "needs-rescrape",
  "wordCount": 372,
  "tierReason": "Full review text",
  "bwwExcerpt": "Adapted by Simon Stephens from Mark Haddon's best-selling 2003 novel about an autistic boy's coming-of-age, this is one of the most fully immersive works ever to wallop Broadway. So be prepared to have all your emotional and sensory buttons pushed, including a few you may have not known existed. As directed by Marianne Elliott (a Tony winner for the genius tear-jerker 'War Horse'), with a production that retunes the way you see and hear, 'Curious Incident' can be shamelessly manipulative...Played by the recent Julliard school graduate Alex Sharp, in the kind of smashing Broadway debut young actors classically dream about, Christopher is in some ways a parent's nightmare.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-CURIOUS-INCIDENT-OF-THE-DOG-IN-THE-NIGHT-TIME-Opens-on-Broadway-Updating-Live-20141005",
  "rejectedAt": "2026-02-06T01:32:45.137Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is truncated and ends with technical error messages about JavaScript and access verification, making it impossible to determine the critic's final verdict.; openai: The text includes navigation instructions and a content retrieval error, indicating it is not a complete review.",
  "promptVersion": "5.2.0"
}
