{
  "showId": "sweeney-todd-2005",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/entertainment/broadway/ny-broadway-sweeney-todd-review-20230327-evqibkjo6vb5vhtzavhi2b3vdy-story.html",
  "playbillVerdictUrl": "https://www.nydailynews.com/entertainment/broadway/ny-broadway-sweeney-todd-review-20230327-evqibkjo6vb5vhtzavhi2b3vdy-story.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Many Broadway revivals of musicals from decades past insist on revising, reconsidering and imposing. Thomas Kail’s triumphant revival of “Sweeney Todd: The Demon Barber of Fleet Street” does none of that. At once funny, scary and disarmingly moving, this must-see production is content to peel back any cobwebs or artifice and let Stephen Sondheim and Hugh Wheeler’s Gothic revenge tragedy of a musical howl anew with the agony of human injustice and the ameliorating constancy of love.\n\nGaten Matarazzo, Annaleigh Ashford, Alicia Kaori, DeLaney Westfall and Kristie Dale Sanders in the 2023 Broadway production of \"Sweeney Todd.\" (Evan Zimmerman/Photo by Matthew Murphy and Evan Zimmerman)\n\nAll of Sondheim’s musicals have risen exponentially in fame and commercial viability since the Great One’s death. But “Sweeney,” first seen under Hal Prince’s direction in 1979, was always his most accessible and populist show: A penny dreadful-inspired thriller set in Victorian London about a vengeful barber who returns after being transported to Australia on trumped-up charges, only to use his razors to slash the throats of enemies in his chair and then pack them off as tasty fillings for Mrs. Lovett’s struggling pie shop, conveniently located downwind and downstairs.\n\nThey’ve long been Broadway’s most lovable cannibalistic murderers, and they have never been more fun, nor more potent, than when played by Josh Groban and Annaleigh Ashford in a shrewdly deceptive production that makes you think you are watching a minimalist staging designed by Mimi Lien and evasively lit by Natasha Katz, until the mechanizing brutality of Victorian London explodes all over the stage before you and kills whatever humanity you thought was left.\n\nAnnaleigh Ashford and Josh Groban in the 2023 Broadway production of \"Sweeney Todd.\" (Matthew Murphy and Evan Zimmerman/Photo by Matthew Murphy and Evan Zimmerman)\n\nAshford’s Mrs. Lovett is a performance to attend, if ever there was one; she wins a laugh on almost every line, spoken or sung, and does so without compromising her musical performance. Her improvising brain seems to dance across the stage, seemingly spontaneously making up the cascading rhyming jokes in Sondheim’s masterful Act I closer, “A Little Priest,” as if she were a diabolic baker in love with roasted human flesh.\n\nShe’s atypically but very shrewdly cast; Ashford’s Mrs. Lovett is far more than comically seductive. She’s an avaricious, still-young woman clinging to what’s left of her prime and yet also offering an empathetic option for shelter for Groban’s traumatized Sweeney, if only the barber was not so wracked with pain and regret. He shows us, and richly vocalizes, every moment of that fight, which is the key struggle of the show. Groban builds his portrait methodically, but when his Sweeney finally blows at the death of the beggar woman (Ruthie Ann Miles), last hopes gone, his fall drips with magnitude.\n\nIn “Sweeney,” as in most of his other musicals, Sondheim repeatedly defines love as existential, the only solution to a world described in this show as a place where “at the top of the hole sit a privileged few/Making mock of the vermin in the lower zoo.” Wheeler’s book shows us that inequality and oppression, as Judge Turpin (Jamie Jackson), The Beadle (John Rapson) and various other charlatans and mountebanks scheme and denigrate.\n\nBut in the middle of this horror show, Sondheim stuck the love ballad “Johanna,” in my view his most beautiful melody, and the equally gorgeous “Not While I’m Around,” earnestly sung here by Gaten Matarazzo of “Stranger Things” fame, an assertion that even in hell’s furnace itself there sometimes is the deepest and strangest affection.\n\nThe show might be famous for the chute that sends the bodies from the tonsorial parlor to the oven, but it’s really about how love is our only possible defense against despair. And that’s why audiences have always responded to its themes.\n\nSteven Hoggett, a choreographer adept at making great singers dance, takes the show’s Brechtian frame and shows us impoverished humans as a kind of heaving blob, tall poppies cut down by the tyranny of anesthetizing low expectations. Thereafter, he and Kail fuse their mutual staging into a consistent struggle to survive but, remarkably, without squelching the theatricality and fun of the piece.\n\nAnnaleigh Ashford in the 2023 Broadway production of SWEENEY TODD. (Matthew Murphy and Evan Zimmerman/Photo by Matthew Murphy and Evan Zimmerman)\n\nAnd that’s the secret sauce here: You get the gravitas but all of the grisly yuks, too. All that and the formidable musical supervisor Alex Lacamoire (”Hamilton”) conducting in the pit and catching every note of excitement in Jonathan Tunick’s justly legendary orchestrations wherein strings slice and dice at one moment, and then haunt with tenderness at the next. Nevin Steinberg’s sound design has all those interconnected colors. Most Sweeneys I’ve seen make you pick. Not this one.\n\nIn some productions, the love story between Anthony (Jordan Fisher) and Todd’s daughter Johanna (Maria Bilbao) offers a greater hold on the emotions than is the case here, and, over the years and across the world, this piece has had particular efficacy in smaller theaters than the Lunt-Fontanne, which necessitates a certain distance from faces, although blood travels.\n\nBut everyone involved here clearly understands that this is fundamentally the story of two desperate souls unable to reconcile their pasts and present, an indictment of human brutality and a classic Sondheim declaration that to love is to live. All of that wrapped up in a Broadway horror story of murder most tasty. It will be a tough ticket, but the demon barber had it rougher.",
  "isFullReview": true,
  "textWordCount": 919,
  "archivePath": "data/archives/reviews/sweeney-todd-2005/nydailynews--chris-jones_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:22:48.036Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230510213559",
  "archiveOrgUrl": "http://web.archive.org/web/20230510213559/https://www.nydailynews.com/entertainment/broadway/ny-broadway-sweeney-todd-review-20230327-evqibkjo6vb5vhtzavhi2b3vdy-story.html",
  "contentTier": "complete",
  "wordCount": 919,
  "tierReason": "Full review text"
}