{
  "showId": "sweeney-todd-2005",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Robert Hofler",
  "url": "https://www.thewrap.com/sweeney-todd-broadway-review-josh-groban/",
  "playbillVerdictUrl": "https://www.thewrap.com/sweeney-todd-broadway-review-josh-groban/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Opera lovers know how to deal with these situations in the theater. They go to hear the music – more specifically, they go to hear the voices – and they know how to block out or, at least, ignore elements of the production that don’t jibe with what they’re hearing. All those things that are important to the seasoned theatergoer, like acting and direction and a cogent plot, are just icing on an evening in the opera house.\n\nWhich brings us to the strange but wonderful hybrid that is “Sweeney Todd.” Despite being performed in opera houses around the world, it is not an opera. In addition to there being way too much spoken dialogue, it’s nearly impossible for any singer to project ditties like “A Little Priest” or “By the Sea” into a 2000-plus-seat opera house without amplification.\n\nThe bass-baritone Bryn Terfel sang a definitive Sweeney in a concert version of the musical with the New York Philharmonic in 2014, Emma Thompson being his Mrs. Lovett. A fully staged “Sweeney Todd” opened Sunday at Broadway’s Lunt-Fontanne Theatre, and beyond the aforementioned concert version, it is the best sung version of the Stephen Sondheim and Hugh Wheeler musical I’ve ever heard – and that includes both casts of the original 1979 production. Plus, we’re treated here to a full orchestra of 26 players, and that is much more than mere icing. You can’t help but hear the difference between how the score is meant to sound and how Broadway has been cheating us in recent years by performing Sondheim with under half that number of players in the pit. Bravo to the producers!\n\nPlaying Sweeney Todd, Josh Groban isn’t a true baritone. When he needs to boom out a few low notes, he growls instead. But his Sweeney is a beautifully sung one that humanizes the demon barber, which, in the end, makes for a more perverse serial killer. There are moments, especially during “A Little Priest,” that it appears Mrs. Lovett’s dream of wedding the erstwhile Benjamin Barker might actually come true.\n\nEveryone from Angela Lansbury to Patti LuPone to Helena Bonham Carter (in the 2007 movie version) has brought a comic stridency to the role of Mrs. Lovett. I didn’t think it possible to sing the character’s music any other way. Annaleigh Ashford finds the way, and it is a revelation to hear some of these phrases of comic depravity delivered with such tonal beauty and accuracy. The result is that she and Groban present an unusually young couple on the road to their premature destruction.\n\nAnd yet, as good as these two stars are vocally, the musical high point of Act 1 belongs to Jordan Fisher in the sailor role of Anthony when he sings a very passionate “Johanna.” In Act 2, the most memorable star turn comes from Gaten Matarazzo in the role of the simpleton Toby. He matches Fisher’s vocal intensity when he sings an especially wounded version of “Not While I’m Around.” As the Beggar Woman, Ruthie Ann Miles also impresses throughout, providing that tragic leitmotif that ties everything into a funeral bow. Only the strident coloratura soprano of the ingénue Johanna (Maria Bilbao) disappoints. Sadly, the Judge’s “Mea Culpa” has been cut in a production that already lasts almost three hours.\n\nAll this analysis of the singing might be a clue to what’s occasionally wrong with Thomas Kail’s direction when his actors aren’t thrilling us with their superb vocals. Kail brings out the humor in “Sweeney Todd” that both John Doyle (2005 Broadway revival) and Tim Burton (2007 film version) eschewed. Ashford sees to that almost singlehandedly. She doesn’t miss a chance to twist a phrase or an eyebrow in her burlesque seduction of Sweeney. Elsewhere, Kail’s approach is a little too operatic, too respectful. There’s even a stateliness verging on lethargy between some of the musical numbers. “Pirelli’s Miracle Elixir” and “The Contest” have always been problematic.\n\nIn the original production, there were three contests, which quickly got reduced to the one shaving battle we see today. For some reason, this production’s Pirelli (Nicholas Christopher) makes a very unspectacular entrance that is several beats late. At the very end of Act 2, Toby’s reappearance takes place in the dark and leaves Sweeney on stage with the corpse of Lucy for an eternity before getting his throat slit. In the original production, director Hal Prince shocked us with quick efficiency by having Toby, in a white fright wig, enter through a trap door to do his business in record time.\n\nMimi Lien’s grand set design literally keeps much of the drama at a distance. Instead of Sweeney’s murders taking place in our face, Kail and Lien have placed the barber shop on a bridge that is raised and lowered to indicate various other settings. Even at its lowest position, for the barber shop, it features a fence (a safety requirement?) that messes with our view of the actors. More significant, the bridge is placed way too far upstage. Granted, Groban is not giving us the most possessed or driven demon barber ever seen on stage, but it would help if his murders weren’t taking place across the street and up a steep flight of stairs. Natasha Katz’s lighting compensates by presenting a series of spooky tableaux. This is just a guess, but the best seats to see this “Sweeney Todd” might be in the front mezzanine of the Lunt-Fontanne.\n\nSince this space has been used so often to complain about the hideous amplification of current plays (“A Doll’s House”) and musicals (“& Juliet”) on Broadway, a shout-out of congratulations needs to go to sound designer Nevin Steinberg. Even the original 1979 production of “Sweeney Todd” blurred the multiple singing voices in the songs “Kiss Me” and the reprise of “Johanna” in act two. It wasn’t until I heard the original cast recording that I discovered the intricate beauty of these ensemble pieces. Steinberg’s amplification maintains the individuality of the voices so that we can fully enjoy the unusual mosaic of Sondheim’s music in a live performance.",
  "isFullReview": true,
  "textWordCount": 1013,
  "archivePath": "data/archives/reviews/sweeney-todd-2005/thewrap--robert-hofler_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:24:02.053Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1013,
  "tierReason": "Full review text"
}