{
  "showId": "sweeney-todd-2005",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2005/legit/reviews/sweeney-todd-3-1117927294/",
  "publishDate": "November 3, 2005",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "This new production of Stephen Sondheim's masterwork benefits from a brilliantly conceived staging that strips away all extraneous elements to focus on the dark heart of the piece.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "With his boyish good looks, and despite a burly beard,Mr. Groban appears young for the role, looking scarcely older than Anthony ( Jordan Fisher), the sailor who rescued Sweeney when their ship heading to England foundered. More problematically, Mr. Groban has not yet reached deeply enough into the ...",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This new production of Stephen Sondheim's masterwork benefits from a brilliantly conceived staging that strips away all extraneous elements to focus on the dark heart of the piece.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 384,
  "archivePath": "data/archives/reviews/sweeney-todd-2005/variety--charles-isherwood_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:13:41.945Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "WASHINGTON — Three watchdog groups have derided a recent Federal Communications Commission report that broadband use notably is expanding as “misleading” and “at best, wildly optimistic.”\n\nContrary to the rosy conclusions of the FCC report, issued last month, groups claimed that Americans are “falling woefully behind the rest of world in broadband access.”\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Disney and Fashion Label Ganni Expand Partnership With New Daisy Duck Collection, Along With Collectible Fanzine \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Bob Iger to Step Down as Disney CEO Before End of 2026: Report\n\nAfter reviewing the report’s data, Free Press, the Consumer Federation of America and Consumers Union on Wednesday released a joint statement, saying the agency analysis “is misleading and glosses over serious problems behind an ever-widening digital divide.”\n\nThe report trumpeted a significant increase in broadband use across the country. FCC chairman Kevin J. Martin, a proponent of expanding broadband, then wrote favorably about the report’s implications in an op-ed for the Wall Street Journal.\n\n“But upon closer scrutiny, the claims made in the report — and (in the) subsequent op-ed — are, at best, wildly optimistic,” the groups said in their statement.\n\nClaiming a lack of competition among broadband service providers, the researcher also pointed out, “On a per megabit basis, U.S. consumers pay 10 to 25 times more than broadband users in Japan.” The FCC recently released DSL providers from open-access requirements, which agency officials said would promote competition, but critics have claimed will do the opposite.\n\n“The FCC is trying to put the best face on this problem it can, but the people who can’t afford or don’t have access to high-speed Internet know the truth,” Mark Cooper, research director of CFA, said in a statement. “If the FCC continues to ignore reality, the gap between the (broadband) haves and have-nots will become too wide to bridge,” he predicted.\n\n“Fudging the facts won’t provide high-speed Internet access to those who need it most,” said CU senior policy analyst Jeannine Kenney in a statement. “If the FCC is content to let cable and phone companies control the broadband market, then consumers need a third option — wireless broadband that is less expensive and which doesn’t depend on DSL or cable modems.”\n\nGroups called on Congress to enact policies that will promote broadband competition.\n\nAn FCC spokesman declined to comment.",
  "sources": [
    "bww-roundup"
  ],
  "_showNotMentionedDiscoveryAttempted": true
}
