{
  "showId": "sweeney-todd-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2023/03/26/sweeney-todd-a-bloody-good-treat-for-sondheim-fans/",
  "publishDate": "2023-03-26T20:53:41",
  "fullText": "Recently, I read an article theorizing that Stephen Sondheim fans group themselves into camps according to their favorite shows—Into the Woods people, Follies people, etc. Presumably there’s some kind of psychological diagnosis to be made here: Company fanatics are more likely to be commitment-phobes and loners (“Marry me, and everybody will leave us alone”); Sunday in the Park With George acolytes are surely artists; Assassins enthusiasts—well, I just hope the government is monitoring their social media activity.\n\nI’d never call myself a Sweeney Todd person—thrillers simply aren’t my thing, on stage or screen—but every time I see a production I leave with a deeper appreciation for Sondheim’s score, packed with swoon-worthy melodies and subversively witty lyrics. (Is “A Little Priest” the best-ever example of Sondheim’s wordplay? Discuss.) The new Broadway revival—starring Josh Groban, Annaleigh Ashford, a 26-member orchestra, and Jonathan Tunick’s original orchestrations—is guaranteed to do the same for you. It sounds spectacular.\n\nJudging by the ear-splitting shrieks that greet his entrance—a brilliant coup-de-théâtre by director Thomas Kail (Hamilton, In the Heights) that you’ll wish you could rewind and watch over and over—Groban is this version’s main draw. And while he’s no stage neophyte—he received a 2017 Tony nomination for his turn as the melancholy Pierre in Natasha, Pierre & the Great Comet of 1812—Groban certainly isn’t the obvious choice for the “demon barber of Fleet Street.” There will be some griping that he’s not scary enough. But if theatergoers are thinking about the last New York City revival, the intimate Tooting Arts Club import that turned the Barrow Street Theater into a bakehouse, it’s tough to match the menace of Jeremy Secomb locking eyes with you from mere inches away. Also note that Groban isn’t given the horror makeup treatment—no pasty white face, or hollowed-out eyes (I can still see Michael Cerveris’ supremely creepy Sweeney in the 2005 John Doyle Broadway revival). Groban essentially embodies this lyric that company sings after Sweeney reunites with his beloved razor: “His voice was soft, his manner mild.” But you want frightening? His “Epiphany”—when Sweeney decides that “we all deserve to die”—is downright bone-chilling, Groban crouched on the floor in a fit of madness, his face lit from below like he’s hovering perilously above the fires of hell.\n\nAs Sweeney’s literal partner-in-crime, Mrs. Lovett, Ashford (a Tony winner for You Can’t Take It With You) plays the part of the worst piemaker in London for laughs—big laughs—and gets ’em. She’s hilarious—and extremely handsy with Sweeney—but, regrettably, not at all villainous. Remember, it’s she who comes up with the cannibalism scheme: Sweeney just wanted to slit the throat of Judge Turpin (Jamie Jackson), the man who wrongly imprisoned him and separated him from his wife and now teenaged daughter, Johanna (Maria Bilbao, lovely)—and then, well, anyone else who got in his way. She had the depraved, if economical, idea to grind up the corpses for pastry filling. (Upcycling centuries before it was trendy!) But there’s not a hint of depravity in Ashford’s portrayal, full of genius comic touches though it is.\n\nRuthie Ann Miles (a Tony winner for her Lady Thiang in 2015’s The King and I) makes the most of the small but pivotal role of the Beggar Woman; no spoilers, but when she sings “Hey, don’t I know you, mister?” to Sweeney, that’s what we call a clue. And Gaten Matarazzo (Netflix’s Stranger Things) couldn’t be better as Tobias, the “simple” boy who goes from hawking hair tonic for faux Italian barber Pirelli (Nicholas Christopher) to pushing pies for suddenly in-demand baker Mrs. Lovett.\n\nThe other star of this production? Natasha Katz’s lighting, a master class in chiaroscuro that brings some much-needed dimension to the massive stage of the Lunt-Fontanne. One wishes for a smaller Broadway theater to get closer to this Sweeney Todd, but perhaps then we wouldn’t have had a couple dozen people moving about onstage like The Walking Dead (pretty cool). Or the trick barber chair that sends Sweeney’s victims sliding down a tunnel into the basement (very cool). Or, of course, that massive orchestra—the coolest thing of all.\n\nSweeney Todd opened March 26, 2023, at the Lunt-Fontanne Theatre. Tickets and information: sweeneytoddbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-roundup"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "I’d never call myself a Sweeney Todd person—thrillers simply aren’t my thing, on stage or screen—but every time I see a production I leave with a deeper appreciation for Sondheim’s score, packed with swoon-worthy melodies and subversively witty lyrics. (Is “A Little Priest” the best-ever example of Sondheim’s wordplay? Discuss.) The new Broadway revival—starring Josh Groban, Annaleigh Ashford, a 26-member orchestra, and Jonathan Tunick’s original orc"
}
