{
  "showId": "sweeney-todd-2023",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2023/03/26/theater/sweeney-todd-broadway-review-josh-groban.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2023/03/26/theater/sweeney-todd-broadway-review-josh-groban.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "https://www.nytimes.com/2023/03/26/theater/sweeney-todd-broadway-review-josh-groban.htmlGive this article+Advertisement\n\nHow do you like your “Sweeney Todd” done?\n\nStephen Sondheim, who wrote the score, favored the musical thriller take: the one that focuses on gore and shock. Blood spouts everywhere when Sweeney, “the demon barber of Fleet Street,” slits the throats of his customers; when his accomplice, Mrs. Lovett, grinds the corpses into meat pies, you wince at every crunch.\n\nAlso rather nice: the social critique version promoted by Harold Prince, the director of the original production in 1979. In that one, Sweeney, seen as a byproduct of the Industrial Revolution, isn’t so much a villain as a victim. The greed of the overlord class, mimicked by the grasping Mrs. Lovett, is what makes mincemeat of the proletariat.\n\nOr perhaps you prefer your “Sweeney” intimate, with razors so close you recoil. Or psychological and stripped to the bone, with barely a set and Mrs. Lovett on tuba.\n\nIf there are so many worthy “Sweeney” options, that’s because the show isn’t just one of the greatest American musicals but several. Sondheim’s score, a homage to the sinister soundtracks of Bernard Herrmann, cannibalizes the book (by Hugh Wheeler) and the book’s remoter sources (a 1970 play by Christopher Bond, a 19th-century penny dreadful) until only their bones remain. But in return you get arias so beautiful, and musical scenes so intricately layered, that every possible genre seems to be baked inside.\n\nNow comes a new special on the menu: the ravishingly sung, deeply emotional and strangely hilarious “Sweeney” revival that opened on Sunday at the Lunt-Fontanne Theater. Starring Josh Groban and Annaleigh Ashford, and directed by Thomas Kail, it has a rictus on its face and a scar in its heart.\n\nThe “gorgeously sung” part is no surprise with Groban, whose quasi-operatic pop baritone perfectly encompasses the range of the role, and whose technique makes sure every word is bell clear. That some of the songs are thus even prettier than usual is all to the better; Sondheim’s technique of setting the most grotesque moments to the most romantic music — as when, in “Pretty Women,” Sweeney prepares to murder the judge who raped his wife and abducted their baby daughter, Johanna — is beautifully served.\n\nAnd though it can’t be said that Groban invokes terror, that’s partly the result of Kail’s attention to naturalistic detail within an expressionistic palette. Even dwarfed (and unfortunately sometimes obscured) by Mimi Lien’s awesomely vast sets, we always see Sweeney as a human being, albeit a strange one. Perfectly matching Sondheim’s first description of the character — “His skin was pale and his eye was odd” — he looks almost overexposed and, squinting throughout, as if he needs glasses. Some of the production’s humor comes from his growing resemblance to an impassive suburban husband whose job happens to be murder, as Ashford’s Mrs. Lovett tries to domesticate him.\n\nBut most of the humor comes from Ashford herself, a brilliant comic for whom comedy is not the end but the means. Her Mrs. Lovett — despite a tip of the wig to Angela Lansbury, who originated the role — is not the music-hall zany Lansbury created, but a brutal schemer for whom zaniness is a useful cover. As she hilariously enacts her romantic dramas with a noncompliant Sweeney, you see that she is also trying to protect herself from his mania by getting his mind off avenging his wife and reclaiming Johanna. Later, as the evil begins to crowd in closer, the jokes go dry on her tongue.\n\nIt’s a great, very specific performance — and very well sung — if occasionally pushed too hard histrionically and often too hard to hear. (Both she and Jordan Fisher, beamish as the sailor who falls in love with Johanna, seem to be under-amplified.)\n\nThat the rest of the cast is also so specific is a Kail trademark even more in evidence here than it was in his staging of “Hamilton.” The evil judge (Jamie Jackson), his oily beadle (John Rapson), a “half-crazed beggar woman” (Ruthie Ann Miles), a rival barber (Nicholas Christopher) and the barber’s abused assistant (Gaten Matarazzo, who sings an especially haunting “Not While I’m Around” with Ashford) all find curious ways, within the confines of the archetypes they must inhabit, of suggesting that the archetypes got that way for a reason. And as the grown-up Johanna, Maria Bilbao makes fascinating sense of an often-bland character by turning her into a bird, twisting with tics and scratching as if to escape the cage of her own skin.\n\nThese details help compensate for the extremity that has been somewhat leached from the title character. Steven Hoggett’s choreography, much more central than in other productions, has a similar effect, filling the stage with strange, disorienting gestures: extreme leaning, ratlike huddling, abdominal contractions that look like retching. Mrs. Lovett’s upward mobility can be traced, as if on a graph, in the lines of Emilio Sosa’s costumes. Natasha Katz’s extraordinary lighting is likewise expressionistic, its silvery beams often stabbing the gloom like a set of knives.\n\nThese effects are certainly large. (Sweeney’s trick barber chair is a production in itself.) But the original staging included the framework of an actual iron foundry, so nothing here feels out of scale. And scale is one of the reasons we’ve had so many so-called Teeny Todds: The work is usually deemed too difficult and expensive to pull off at the size Prince imagined and that Sondheim, in his gigantic score, achieved. Even with a few discreet cuts, the nearly three-hour show is about 80 percent sung, which is why some people call it an opera.\n\nCertainly Kail’s production makes a convincing new case for “Sweeney” as a Broadway-size property, with its cast of 25 (I’ve seen it with as few as nine) and its orchestra playing Jonathan Tunick’s original orchestrations for 26. (You can’t believe the difference three trombones make in creating the sound of doom, especially compared to none.) Under Alex Lacamoire’s musical supervision, the musicians’ performance, like that of the ensemble in the choral numbers, is glorious.\n\nFull disclosure: My parents, responding to an ad in The Times in 1978, invested $1,800 in the original production, and after 10 or 15 years earned a profit of, I think, $80. But even putting that windfall aside, I have never not loved “Sweeney.” In a pie shop or a foundry, I am always transported, largely by the music, to a place where grief twists people into nightmares, and others find ways to monetize that.\n\nI hope the current producers likewise find ways to monetize Kail’s production, because what is Broadway for if not a “Sweeney” that, however rare, is this well-done?\n\nSweeney Todd: The Demon Barber of Fleet StreetAt the Lunt-Fontanne Theater, Manhattan; sweeneytoddbroadway.com. Running time: 2 hours 45 minutes.",
  "isFullReview": true,
  "textWordCount": 1129,
  "archivePath": "data/archives/reviews/sweeney-todd-2023/nytimes--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:25:49.900Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230327010151",
  "archiveOrgUrl": "http://web.archive.org/web/20230327010151/https://www.nytimes.com/2023/03/26/theater/sweeney-todd-broadway-review-josh-groban.html/",
  "contentTier": "complete",
  "wordCount": 1129,
  "tierReason": "Full review text"
}