{
  "showId": "dames-at-sea-2015",
  "outletId": "the-three-tomatoes",
  "outlet": "The Three Tomatoes",
  "criticName": "Valerie Samaldone",
  "url": "http://thethreetomatoes.com/dames-at-sea-ahoy-broadway",
  "publishDate": null,
  "fullText": "by Valerie Smaldone · Published November 7, 2015 · Updated November 6, 2015 When choosing a Broadway show to attend, sometimes, it’s good to just pick something that is light, airy and doesn’t require any heavy lifting on the part of the audience. In other words, a romantic comedy musical. With that in mind, I recommend you set sail for Dames at Sea, now at the Helen Hayes Theatre. Dames is the musical credited for launching the career of Bernadette Peters in the late 1960’s off- Broadway run. Now for the first time on the Broadway stage, you can enjoy this adorable parody of a lavish 1930’s musical, where there is always a diva, a young fresh faced kid off the bus from the mid west and a brewing romance between a chorus girl and a military man. The plot is kind of thin, but no matter, the star of this show is the incredible tap dancing numbers showcasing awesome talent. Dames at Sea kicks off with credits rolling on a screen in black and white, as if we were about to see a film. It gets you in the proper mood right away. Think words like “swell” and phrases like “gee whiz” that might be peppered about the dialogue. In this production, you can expect an astounding performance by Lesli Margherita as the delicious Mona Kent. Lesli has a powerhouse voice and is an accomplished dancer. Eloise Krupp plays Ruby, the young woman from Utah, desperate to get on a Broadway stage, and is a tap-dancing phenom, and Mara Davi is perfect as Joan, the confident chorus girl who also gets the guy. John Bolton, Danny Gardner and Cary Tedder are the three great male counterparts to the ladies. With book and lyrics by George Haimsohn and Robin Miller and music by Jim Wise, Dames At Sea happily showcases the little seen art of tap dance. Randy Skinner is director and choreographer. The story is predictable, but nonetheless super fun. <img decoding=\"async\" class=\"aligncenter size-full wp-image-6026\" src=\"https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_474,h_768/https://www.thethreetomatoes.com/wp-content/uploads/2015/11/damesatsea2.jpg\" alt=\"damesatsea2\" width=\"474\" height=\"768\" srcset=\"https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_474/https://www.thethreetomatoes.com/wp-content/uploads/2015/11/damesatsea2.jpg 474w, https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_185/https://www.thethreetomatoes.com/wp-content/uploads/2015/11/damesatsea2-185x300.jpg 185w\" sizes=\"(max-width: 474px) 100vw, 474px\" />If you think you may have seen Dames at Sea…somewhere, you are probably right. It has played in summer stock, community theatre and high schools all across the country, but now you can enjoy the musical in a full out Broadway production complete with a fine orchestra. For old fashioned kitschy fun, Dames at Sea is the perfect choice. Valerie Smaldone is a 5-time Billboard Magazine Award winner and is well known for her unprecedented success holding the #1 on-air position in the New York radio market on 106.7 Life-FM, an iHeart station. She has hosted, produced, and created several award-winning nationally syndicated programs featuring in-depth interviews with stars like Paul McCartney, Celine Dion, Rod Stewart, Elton John and Mariah Carey among others. Her radio talk show \"Bagels and Broadway\" highlighted theatre and food personalities. She is an accomplished interviewer and voice artist heard on commercials, narrations, promos and audiobooks, as well as a sought after live announcer. Most recently, Valerie produced and directed a film, The Thursday Night Club, featuring pop diva Gloria Gaynor in her movie acting debut. She is one of the creators and producers of a docu-series, Divine Renovation, starring Erik Estrada, on streaming networks soon. Tags: broadway reviewsdames at seathe three tomatoesvalerie smaldone Valerie Smaldone is a 5-time Billboard Magazine Award winner and is well known for her unprecedented success holding the #1 on-air position in the New York radio market on 106.7 Life-FM, an iHeart station. She has hosted, produced, and created several award-winning nationally syndicated programs featuring in-depth interviews with stars like Paul McCartney, Celine Dion, Rod Stewart, Elton John and Mariah Carey among others. Her radio talk show \"Bagels and Broadway\" highlighted theatre and food personalities. She is an accomplished interviewer and voice artist heard on commercials, narrations, promos and audiobooks, as well as a sought after live announcer. Most recently, Valerie produced and directed a film, The Thursday Night Club, featuring pop diva Gloria Gaynor in her movie acting debut. She is one of the creators and producers of a docu-series, Divine Renovation, starring Erik Estrada, on streaming networks soon. by Valerie Smaldone · Published October 18, 2019 · Last modified October 20, 2019 by Valerie Smaldone · Published November 24, 2018 · Last modified November 23, 2018 by Valerie Smaldone · Published March 17, 2018 · Last modified March 16, 2018 by Valerie Smaldone · Published July 23, 2021 by Valerie Smaldone · Published August 12, 2017 · Last modified August 11, 2017 by Valerie Smaldone · Published September 10, 2016 · Last modified September 13, 2016 by Valerie Smaldone · Published February 4, 2017 · Last modified February 3, 2017 by Valerie Smaldone · Published February 3, 2018 · Last modified February 2, 2018 by Valerie Smaldone · Published May 28, 2016 · Last modified May 27, 2016 by Valerie Smaldone · Published June 9, 2018 · Last modified June 8, 2018 Your email address will not be published. Required fields are marked * This site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"When choosing a Broadway show to attend, sometimes, it’s good to just pick something that is light, airy and doesn’t require any heavy lifting on the part of the audience. In other words, a romantic comedy musical. With that in mind, I recommend you set sail for 'Dames at Sea'...The plot is kind of thin, but no matter, the star of this show is the incredible tap dancing numbers showcasing awesome talent.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 857,
  "archivePath": "data/archives/reviews/dames-at-sea-2015/the-three-tomatoes--valerie-samaldone_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:28:59.413Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 857,
  "tierReason": "Full review text",
  "isMultiShowReview": true,
  "multiShowReason": "Roundup article: 2 other shows mentioned 3+ times (november, well)"
}
