{
  "showId": "six-2021",
  "outletId": "EW",
  "outlet": "Entertainment Weekly",
  "criticName": "Ruth Kinane",
  "url": "https://ew.com/theater/six-broadway-review/",
  "publishDate": "2021-10-03",
  "fullText": "​ Page Not Found This is not the page you are looking for. We hope you can go about your business by using our menu or search option. By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Accept All Cookies",
  "isFullReview": false,
  "bwwExcerpt": "ering yet another #MeToo story. Those theatrical commonplaces aside, \"Six\" is a needed antidote to \"Anastasia,\" \"Frozen,\" \"Jagged Little Pill,\" \"Wicked\" and other pompous shows of female empowerment. Ruth Kinane, Entertainment Weekly : Sitting in a theater packed with fellow fully-vaccinated, mask-wearing Broadway lovers brings a sense of solidarity and camaraderie to the atmosphere, a vibe mirrored on-stage by the cast s girl-group dynamic. Add to that the joy that s always been the DNA of this production, and Six truly is the top ticket to celebrate the return of the live stage show. Look, if a somber play is your idea of Broadway s best, then by all mean, enjoy! But if you re up for a euphoric celebration of the musical medium, Six is queen of the castle. Long may it reign. Johnny Oleksinski, The New York Post : \"Six\" is more of a concert than a traditional book musical, though, with nine numbers and a megamix crammed into a quick 80 minutes. The songs here, by Toby Marlow and Lucy",
  "originalScore": null,
  "assignedScore": 95,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-SIX-Opens-on-Broadway-20211004",
  "textStatus": "partial",
  "textWordCount": 59,
  "archivePath": "data/archives/reviews/six-2021/ew--ruth-kinane_2026-01-25.html",
  "textFetchedAt": "2026-01-25T05:11:25.580Z",
  "textIssues": [
    "Word count too low: 59 (min: 300)",
    "Show title not found in text"
  ],
  "textQuality": "excerpt",
  "sourceMethod": "bww-roundup"
}
