{
  "showId": "six-2021",
  "outletId": "MASHABLE",
  "outlet": "Mashable",
  "criticName": "Erin Strecker",
  "url": "https://mashable.com/article/six-broadway-review",
  "publishDate": "2021-10-03",
  "fullText": "Picture it: Catharine of Aragon with a microphone. Anne of Cleves in a sparkly leotard. Anne Boleyn dancing under a spotlight.Welcome to Six, the fun, feminist new Broadway musical about the six wives of Henry VIII. But this isn't exactly your mother's Philippa Gregory novel. Yes, these women have been gossiped about about incessantly in both fiction and academic circles over the past 500 years, but this version of the tale, by newcomers Toby Marlow and Lucy Moss, gives these ladies a very refreshing 2021 update. While the show is mostly surface-level rah-rah sisterhood, Six does grapple with the incredible darkness of abused women lurking just below the surface. The show — a hit in the UK for the last few years — was originally slated to open on Broadway in March 2020, but literally hours before that happened, Broadway shut down. Now it's back (with lots of COVID-19 precautions* in place) and I can happily note this smart, silly production remains just as easy to embrace.The plot is simple. (Very simple; don't think about it too hard.) The six exes of one very tyrannical king are here to have a little contest: Which one of them was treated the worst by dear ol' Henry? The \"winner\" such as they are will be rewarded by getting to be the lead singer of their new pop group. Tagline? \"Divorced, Beheaded, Live!\" Let the games — and incredibly clever tunes — begin.This brisk, 80-minute musical co-directed by Moss and Jamie Armitage knows what to hit. It's basically a concert, complete with stage spotlights, loud \"Yas Queen!\" cheers, and an all-female onstage band (dubbed the Ladies in Waiting, natch). One by one, each ex-wife, channeling different musical divas, gets up to sing her tale of woe. The songs are incredibly clever and fun (\"OK ladies now lets get in reformation\"). You won't learn much beyond very broad-strokes history, but fans will surely be humming these sharp anthems as they leave the theater. So many aspects of the show are a pure pleasure. The costumes, by Gabrielle Slade, perfectly meld Tudor imagery with Ariana Grande-inspired stage looks; lighting design by Tim Deiling channels an epic rock show. The six ex-wives — the full cast — thrillingly showcase a range of diverse appearances and personalities. You'll be cheering and dancing in your seat as they break down how \"history's about to get overthrown.\" (At one performance I attended, a young man got carried away and attempted to stand up and dance along with the women near the stage; the ladies rolled with it.) window.videoEmbeds = window.videoEmbeds || []; window.videoEmbeds.push({ elemId: 'video-container-01KFMJDK0N9ADSV0BS78BXYDKQ', data: {\"slug\":\"wtZuO5YyLW8\",\"url\":\"https:\\/\\/www.youtube.com\\/watch?v=wtZuO5YyLW8\",\"start_time\":\"\"}, videoPlayerType: 'in-content' }); Six is so silly and smart and creative but one might wish there was...more of it. Marlow and Moss's book eschews much background. The show really is \"come up to the mic and tell us your story.\" While each of the women are dynamic performers, with just a handful of songs, characterization typically isn't that deep: Anne Boleyn (Andrea Macasaet) here is Bratty, Jane Seymour (Abby Mueller) is Sad. SEE ALSO: 'Jagged Little Pill' on Broadway has a lot on its mind. Maybe too much. The show is most successful when it hits on something real. These are ladies and \"characters\" begging for a feminist reexamination, so while, yes, the show is mostly surface-level rah-rah sisterhood, Six does grapple with the incredible darkness of abused women lurking just below the surface.It's most effective with wife number five, Katherine Howard (an appropriately haunting Samantha Pauly), whose big number \"All You Wanna Do\" finds Howard as a Britney Spears-esque pop provocateur crooning \"I was 13 going on 30\" about her first sexual relationship with an older man. Often, history dismisses Howard as a temptress, someone who got in over her head with multiple men. Here, the same facts are presented — again, via an incredibly, disturbingly catchy song — as something likely far closer to the truth: a young girl who was let down time and time again by the older, much more powerful men who surrounded her. It's chilling, and a strong moment in an otherwise light show. The occasional reminder that this all was far from a game when it was going down adds an appropriate amount of heft — as opposed to, say, the beheading jokes Anne Boleyn tosses out, which made me feel slightly uncomfortable, oh, about 50 percent of the time. Quips aside, a show that interrogates the horror men can inflict on women seems particularly apropos these days, but of course it was also chillingly apropos when this review was originally written back in March 2020&hellip;just as it would have been the year before that and the year before that, on and on for eternity. Six has glamorous costumes and a fantastical vibe, but my favorite thing is that it provocatively wonders what any period in history might look like if women's experiences were ...",
  "originalScore": null,
  "assignedScore": 88,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:08:07.676Z"
}