{
  "showId": "six-2021",
  "outletId": "THR",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/lifestyle/arts/six-broadway-review-1235024613/",
  "publishDate": "2021-10-03",
  "fullText": "From left: Adriana Hicks, Andrea Macasaet, Brittney Mack and Samantha Pauly in 'Six' Courtesy of Joan Marcus Share on Facebook Share on X Google Preferred Share to Flipboard Show additional share options Share on LinkedIn Share on Pinterest Share on Reddit Share on Tumblr Share on Whats App Send an Email Print the Article Post a Comment Getting your head lopped off is viewed as the ultimate act of patriarchal slut-shaming in the frothy new musical Six . This is definitely a history of the English monarchy for people who found the Dynasty -style salaciousness of The Tudors too highbrow, and your enjoyment may depend on how far puberty is behind you. The phenomenon that grew from fringe novelty to London smash and global sensation — let's avoid the word &#8220;viral&#8221; — arrives on Broadway with a robust fan base already in place. That's evident from the hysterical squeals with which young women and junior gays greet the half-dozen talented performers the instant they take the stage, appearing out of a thicket of smoke decked out in Early Renaissance gladiatorial chic. The show was originally set to open March 12, 2020, the night Broadway went dark in a bid to curb the COVID-19 outbreak. Now it finally arrives as the first new musical since the extended shutdown, still shiny and precision-drilled after a year and a half&#8217;s delay. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-article-mid-article-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[300,250],[2,2],[300,251],[620,350],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); Related Stories Business Broadway Box Office: &#039;Harry Potter&#039; Brings In $2.65 Million As Industry Heads Into Slow Winter Months Lifestyle Channing Tatum&#039;s &#039;Magic Mike Live&#039; Comes to New York Simultaneously clever and jejune, it's the brainchild of writing team Toby Marlow and Lucy Moss, and was first hatched in college as a 2017 project of Cambridge's Musical Theatre Society for submission to the Edinburgh Fringe Festival. Very much Hamilton -lite in its appropriation of an anachronistic pop vernacular and contemporary attitudes to re-examine history, this is also a spawn of the Time's Up era in its mandatory reframing of a female-centric narrative separated from the male gaze. This latter aspect seems a tad forced and opportunistic. It's as if the authors want to have it both ways, notably in their treatment of Katherine Howard (Samantha Pauly). Traditionally viewed as a promiscuous temptress, she's depicted here with a pink, Ariana Grande-esque topknot and a Barbie bod, boasting, \"Ever since I was a child, I'd make the boys go wild.\" In her solo, \"All You Wanna Do,\" she recounts learning about &#8220;dynamics&#8221; at age 13 from her music teacher, then scatters a trail of double entendres about sexual experience as she retraces her upward path from lady-in-waiting to wife No. 5. When Henry's bad temper and his gross friends cause her to seek the friendship of a kind courtier, she flips the perspective to point up the pattern of predatory male behavior that landed her on the chopping block. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-dsk-tab-mid-article2-uid1' ) .setTargeting( 'pos', [\"mid\",\"mid-article2\",\"mid-articleX\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article2\") .addSize([[300,250],[300,251],[620,350],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); That's certainly as legitimate a reading of history as anything else in this all-singing, all-dancing Tudor History for Dummies , though Six lacks the substance to tap into the debate about men abusing their power for sexual coercion with any seriousness. The musical is more persuasive when it's in winking, insouciant mode, as is the case with the delicious Anne Boleyn, played by diminutive comic firecracker Andrea Macasaet as a gleefully chirping, selfie-snapping mean girl who just wants to have fun. \"Sorry, not sorry,\" sings the sassy homewrecker, with a nod to Demi Lovato in \"Don't Lose Ur Head.\" She recounts snatching Henry away from his first wife, Catherine of Aragon (Adrianna Hicks), whose protestations in the punchy \"No Way\" make amusing work of her thankless marriage; she was shipped over from Spain at 16 and spent seven years in prison when her originally intended royal spouse inconveniently croaked. Catherine's devotion can't halt Anne's determination as she brings about England's break with the Vatican. \"Everybody chill / It's totes God's will,\" sings Macasaet with the kind of blithe self-justification that made Boleyn a nationally popular choice for execution. Marlow and Moss (the latter also co-directed with Jamie Armitage) drop in frequent references to contemporary pop hits, from The Spice Girls to Destiny's Child and Beyonc&eacute;. (The openi...",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 62,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:07:25.042Z"
}
