{
  "showId": "six-2021",
  "outletId": "time-out-new-york",
  "outlet": "Time Out New York",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/six-broadway-review-musical",
  "publishDate": null,
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Joan Marcus | SixReview\n\n4 out of 5 starsSix English queens have their day in a flashy new Broadway musical.Theater, MusicalsLena Horne Theatre, Midtown WestOpen runRecommendedSunday October 3 2021ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\nWho doesn’t enjoy a royal wedding? The zingy Broadway musical Six celebrates, in boisterous fashion, the union of English dynastic history and modern pop music. On a mock concert stage, backed by an all-female band, the six wives of the 16th-century monarch Henry VIII air their grievances in song, and most of them have plenty to complain about: two were beheaded, two were divorced, one died soon after childbirth. In this self-described “histo-remix,” members of the long-suffering sextet spin their pain into bops; the queens sing their heads off and the audience loses its mind.\n\nThat may be for the best, because Six is not a show that bears too much thinking about. Toby Marlow and Lucy Moss wrote it when they were still students at Cambridge University, and it has the feel of a very entertaining senior showcase. Its 80 minutes are stuffed with clever turns of rhyme and catchy pastiche melodies that let mega-voiced singers toss off impressive “riffs to ruffle your ruffs.” The show's own riffs on history are educational, too, like a cheeky new British edition of Schoolhouse Rock. If all these hors d’oeuvres don’t quite add up to a meal, they are undeniably tasty.\n\nAside from the opening number and finale and one detour into Sprockets–style German club dancing, Six is devoted to giving each of the queens—let’s call them the Slice Girls—one moment apiece in the spotlight, decked out in glittering jewel-encrusted outfits by Gabriella Slade that are Tudor by way of Starlight Express. The boss Catherine of Aragon (Adrianna Hicks) sings a defiant Beyoncé-style number, and a pointedly insouciant Anne Boleyn (Andrea Macasaet, unflappable and funny) gets an Avril Lavigne-ish ditty. The earnest Jane Seymour (Abby Mueller) goes the Sia route, while Anna of Cleves (Brittney Mack) tears up a Nicki Minaj–ian banger. Katherine Howard (Samatha Pauly), under Ariana Grande’s fountainous ponytail, performs “All You Wanna Do,” a sexy pop-princess strut that turns sour. (Perhaps Six’s most ambitious song—it’s the only one that involves a real dramatic arc—this is also the least well-crafted. But in a show as meta as this one, that may be an intentional jab at pop lyric-writing.)\n\nIt ultimately falls to Catherine Parr (Anna Uzele), the wife who survived, to try to add the show’s big numbers into a sum, and this is the point at which Six flags a bit. The show is directed with let’s keep-this-party-going energy by Moss and Jamie Armitage, supported by the formations of Carrie-Anne Ingrouille's choreography, but its girl-power vibe can’t sustain it forever. At heart, Six is a sparkly lark—Hamilton Extra Lite, with the multiculturalism and anachronism and knowing name-dropping but without the plot, emotion and depth—and by the finale, you can feel it grasp for cohesion: six characters in search of a binding authorial concept. But who, these days, expects any royal marriage to have a perfect ending? Six is not deep. Six is fun. Let yourself go and enjoy the finery.\n\nSix. Brooks Atkinson Theatre (Broadway). Book, music and lyrics by Toby Marlow and Lucy Moss. Directed by Lucy Moss and Jamie Armitage. With ensemble cast. Running time: 1hr 20mins. No intermission.\n\nFollow Adam Feldman on Twitter: @FeldmanAdamFollow Time Out Theater on Twitter: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "bwwExcerpt": "Six is not a show that bears too much thinking about. Toby Marlow and Lucy Moss wrote it when they were still students at Cambridge University, and it has the feel of a very entertaining senior showcase. Its 80 minutes are stuffed with clever turns of rhyme and catchy pastiche melodies that let mega-voiced singers toss off impressive \"riffs to ruffle your ruffs.\" The show's own riffs on history are educational, too, like a cheeky new British edition of Schoolhouse Rock. If all these hors d'oeuvr",
  "bwwRoundupUrl": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "dtliThumb": null,
  "needsScoring": true,
  "showScoreExcerpt": "\"At heart, Six is a sparkly lark—Hamilton Extra Lite, with the multiculturalism and anachronism and knowing name-dropping but without the plot, emotion and depth...Six is not deep. Six is fun. Let yourself go and enjoy the finery.\"",
  "showScoreUrl": "https://www.show-score.com/broadway-shows/six",
  "textWordCount": 888,
  "archivePath": "data/archives/reviews/six-2021/time-out-new-york--adam-feldman_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:36:12.165Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ]
}