{
  "showId": "six-2021",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "https://variety.com/2021/legit/reviews/six-review-broadway-musical-1235079922/",
  "publishDate": "October 3, 2021",
  "fullText": "This fast-paced show — it’s just 80 minutes long — places these Old Spice Girls in a competitive pop-rock concert — think “The SiX Factor” — with the wife who is judged as having suffered the most to be elevated to lead singer. It may not be much of a compensation for their pains — especially for those who have been literally on the chopping block. But for theatergoers, this show (by twenty-somethings Toby Marlow and Lucy Moss and directed by Moss and Jamie Armitage) is as sharp and shiny as a sequined stiletto heel, and couldn’t have come at a better time.",
  "isFullReview": false,
  "dtliExcerpt": "Home Legit Reviews Oct 3, 2021 6:00pm PT &#8216;Six&#8217; Review: Long Live These Broadway Queens By Frank Rizzo Plus Icon Frank Rizzo Latest &#8216;Ragtime&#8217; Review: Broadway Revival Is a Timely, Glorious Panorama of Changing Times in America 3 months ago &#8216;Waiting for Godot&#8217; Review: Keanu Reeves and Alex Winter Bring a Cooler, Cosmic Take to This Broadway Waiting Game 4 months ago &#8216;Call Me Izzy&#8217; Review: Jean Smart Dazzles in a Broadway Play That Treads All-Too-Familiar Territory 7 months ago See All Joan Marcus Strutting strong, arms akimbo and ready for a royal rumble, the sextet of cheeky spouses of King Henry VIII take to the stage in triumph &#8212; not just over the much-married monarch who did them wrong, but also in celebration of the deferred Broadway bow of the musical &#8220; Six ,&#8221; shut down by the pandemic last year just hours before its scheduled opening night. But these ladies have been waiting for centuries even, ready to give some perspective and personality to their reductive footnote in history, as echoed in the schoolyard chant: \"Divorced, beheaded, died; divorced, beheaded, survived.\" You can now add \"gloriously revived\" thanks to this Brit import that has gathered passionate followers as the show made its journey from university lark to viral juggernaut to, finally, celebratory West End and now Broadway musical. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-variety-article-mid-article-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[300,250],[2,2],[300,251],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); Related Stories &#039;Euphoria&#039; Season 3 Trailer: Zendaya, Sydney Sweeney and Jacob Elordi Return as Rue Battles Drug Dealers, Cassie Becomes a Cam Girl and More",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:08:10.597Z",
  "dtliThumb": "Up",
  "bwwExcerpt": "There's the spirit-lifting energy of an arena concert, the humor and sass of a special sisterhood, and a ton of biographical exposition easily received in rap and snap - and which might evoke another recent historical musical. Just as Lin-Manuel Miranda's \"Hamilton\" made us hyper-aware of \"who lives..."
}
