{
  "showId": "the-wiz-2024",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani",
  "url": "https://www.broadwaynews.com/the-broadway-review-a-busy-revival-of-the-wiz-still-doles-out-verifiable-fun/",
  "publishDate": "April 18, 2024",
  "fullText": "Schele Williams beckons the Black theater staple back to Broadway for a directorially untethered but reliably good time. Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “The Wiz.” While the original Broadway production of “The Wiz” was a landmark achievement and hit with audiences, subsequent productions garnered mixed reviews — with the first major revival fizzling out in less than a month and Sidney Lumet’s 1978 film currently rotting around 44 percent on Rotten Tomatoes’ critics scale. But “The Wiz” never longed for approval from anyone but the people it glorifies. And in Black homes, the musical is canon. In this second major Broadway revival, the show’s extravagant display of Black magical realism and its persistent humor blaze over the technical challenges. The script — updated by comedian and Tony Award-nominated scribe Amber Ruffin — maintains its timeless charm even as it lurches (rather than eases) us through Dorothy’s fantastical journey. Major happenings — landing in Oz, meeting the Scarecrow (Avery Wilson), Tinman (Phillip Johnson Richardson) and Lion (Kyle Ramar Freeman), arriving at Emerald City — sweep in at tornado pace, jerking us from one scene to the next. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": false,
  "dtliExcerpt": "Still, these missteps can’t smudge out a defining truth: “The Wiz” is a certifiable, soulful great time. And thankfully, it’s back home.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/the-wiz-bway/",
  "needsScoring": true,
  "textWordCount": 220,
  "archivePath": "data/archives/reviews/the-wiz-2024/broadway-news--brittani_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:43:38.691Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 220 (min: 300)",
    "Show title not found in text"
  ]
}