{
  "showId": "the-wiz-2024",
  "outletId": "chicagotribune",
  "outlet": "Chicago Tribune",
  "criticName": "Chris Jones",
  "url": "https://www.chicagotribune.com/2024/04/17/review-the-wiz-on-broadway-is-freshened-up-and-ready-for-an-adoring-audience/",
  "publishDate": null,
  "fullText": "NEW YORK — “Everybody look around,” they’re singing, festively, at the Marquis Theatre. “There’s reason to rejoice, you see.”\n\nFor a lot of Broadway fans, especially Black audiences of a certain age, the return of the Super Soul Musical (it was the 1970s) “The Wiz” to the Great White Way after some 50 years is a cause for celebration. For all its flaws, and whatever qualms might now exist about a white writer, William F. Brown, cheerfully writing in a Black vernacular, “The Wiz” is just one of those rare and special titles that gets an audience ginned up, glammed up and ready to drop the big bucks necessary for a night out at the theater in the Emerald City,\n\nWho can forget Stephanie Mills? Or André de Shields, the original Wiz, who I’ve more than once watched show off his 1970s costume to squeals of delight? Or songs from the great Charlie Smalls like “Ease on Down the Road” (one of the great musical connective-tissue numbers of all time) and the power ballad “Home,” a favorite of every musical theater kid?\n\nSmalls died in 1987 at 43  from a burst appendix. Sitting there at the Marquis, I started to think about what else he might have composed for Broadway, had he kept on easing down the road of life.\n\nThis revival, directed by Schele Williams and with a book update by Amber Ruffin, toured the country before coming to Broadway, and will ease on back out there later this year. I first caught it in Chicago, when the production remained a bit of a mess, and can report that the Broadway version reflects a lot of good new work. An initially bizarre approach to “Brand New Day” has been visually retooled and, although JaQuel Knight’s choreography retains an eccentric dimension (and I say why not?), it’s now a bright detour into psychedelic “Hair” territory. The show is modestly scaled; the quirky set is from Hannah Beachler and the costumes, which are fun and referential, are by Sharen Davis.\n\nWayne Brady has been added to the cast in a title role that’s more of a cameo, really. But The Wiz really has to be a face that audiences recognize, that’s just about as important as the quality of the performance,  and Brady is well within his wheelhouse and perfectly fine. He does what needs to be done and is bathed in a warm responsive bath.\n\nThe cast has some other familiar faces, including no less than Deborah Cox as Glinda, an L. Frank Baum character that might have morphed into the star of “Wicked,” but who was woefully underwritten in “The Wiz.” That means that Cox, a veteran of many Frank Wildhorn tours and a knockout singer, remains underused, with Melody A. Betts getting far more attention as Aunt Em and Evelline. I wish there had been more for Cox to do, but  that likely would have meant messing with the score.\n\nRuffin, a capable wit, has freshened up the book although not invasively so. And the three friends of Dorothy who follow those yellow bricks toward self-actualization, Avery Wilson’s Scarecrow, Phillip Johnson Richardson’s Tinman (the most moving I’ve seen) and Kyle Ramar Freeman’s Lion, cowardly variety, really are the heart of this particular revival and they’re a delightful quartet when they carry along Nichelle Lewis’ much improved Dorothy.\n\nDorothy is a tough role in this show, not least because her big belter functions not only as the so-called 11 o’clock number but has to justify the entire end of the musical; few shows have so abrupt an ending. It does not satisfy here. Lewis hits the notes, and these are tough notes to hit, but the overall performance remains too guarded to really launch itself fans’ hearts, even though at the show I saw, everyone was more than ready to receive and respond. This is, after all, “The Wiz.” It attracts a particularly generous kind of audience and it sure was good to see them out.\n\nAt the Marquis Theatre, 210 W. 46th St., New York; wizmusical.com\n\nChris Jones is a Tribune critic.",
  "isFullReview": true,
  "bwwExcerpt": "This revival, directed by Schele Williams and with a book update by Amber Ruffin, toured the country before coming to Broadway, and will ease on back out there later this year. I first caught it in Chicago, when the production remained a bit of a mess, and can report that the Broadway version reflects a lot of good new work. An initially bizarre approach to “Brand New Day” has been visually retooled and, although JaQuel Knight’s choreography retains an eccentric dimension (and I say why not?), i",
  "bwwRoundupUrl": null,
  "bwwThumb": "Up",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 684,
  "archivePath": "data/archives/reviews/the-wiz-2024/chicagotribune--chris-jones_2026-01-29.html",
  "textFetchedAt": "2026-01-29T02:34:32.112Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250618094014",
  "archiveOrgUrl": "http://web.archive.org/web/20250618094014/https://www.chicagotribune.com/2024/04/17/review-the-wiz-on-broadway-is-freshened-up-and-ready-for-an-adoring-audience/",
  "textIssues": [
    "Show title not found in text"
  ]
}