{
  "showId": "the-wiz-2024",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/the-wiz-broadway-revival-review-8635100",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\nTheater\n\nThe Wiz review: Run, don't ease, on down the road to this spectacular revival of the classic musical\nA sensational cast, including Deborah Cox and Wayne Brady, as well as a few notable updates, makes this perhaps the best iteration of &#34;The Wiz&#34; yet\n\nLester Fabian Brathwaite is a staff writer at Entertainment Weekly, where he covers breaking news, all things Real Housewives, and a rich cornucopia of popular culture. Formerly a senior editor at Out magazine, his work has appeared on NewNowNext, Queerty, Rolling Stone, and The New Yorker. He was also the first author signed to Phoebe Robinson's Tiny Reparations imprint. He met Oprah once.\n\nLester Fabian Brathwaite is a staff writer at Entertainment Weekly, where he covers breaking news, all things Real Housewives, and a rich cornucopia of popular culture. Formerly a senior editor at Out magazine, his work has appeared on NewNowNext, Queerty, Rolling Stone, and The New Yorker. He was also the first author signed to Phoebe Robinson's Tiny Reparations imprint. He met Oprah once.\n\nPound for pound, song for song, is there any American musical packed with more pure, uncut hits than The Wiz?\n\nMaybe West Side Story, maybe Chicago, possibly Dreamgirls, but, particularly for Black audiences, the score of The Wiz plays like a greatest hits compilation.\n\nThe new revival of the 1975 musical by Charlie Smalls (et al) and William F. Brown updates some references (with the help of Amber Ruffin, fresh off her success with Some Like It Hot) and takes what worked from the 1978 movie (namely the Michael Jackson-as-Scarecrow solo “You Can’t Win”) and the popular TV musical (the swag, my god, the swag) to produce what may be the best version of The Wiz to date.\n\nReally, the only thing keeping the revival back is its choice of venue, the Marquis Theatre, where it is currently playing, under the direction of Schele Williams. The acoustics there leave a bit to be desired.\n\nAnyone familiar with The Wizard of Oz knows the plot of The Wiz. Young Dorothy Gale is transported, via magical tornado, to the Wonderful World of Oz, an acid trip of a town full of kindly creatures under the cruel rule of the Wicked Witch of the West. She meets three fantastical friends and together they overthrow the Witch and topple The Wiz’s patriarchy of lies and deception. The main difference from L. Frank Baum’s original is that The Wiz is Black as hell.\n\nThis time around, the Munchkin district of Oz has been transformed into the French Quarter of New Orleans, tapping into the historical Blackness and magic inherent in that place. And Orleans' bounce, as well as other styles of dance and music, wind their way through this reimagined Wiz, choreographed by the Beyoncé-approved JaQuel Knight (“Single Ladies,” Formation,” “Diva,” come on). And like that ubiquitous diva-best-believa, The Wiz mines and melds different corners of Black culture to deliver an enormously entertaining spectacle.\n\nWhen it first premiered on Broadway, The Wiz was an anomaly — an all-Black, big budget musical — but its infectious energy and parade of nonstop bangers made it a hit with people from all backgrounds. The Wiz also offered a message of hope, perseverance, and community, as well as critiques on masculinity, to Black audiences. That message feels a bit muddled in this revival only because the plot is secondary to the show-stopping musical numbers. But that’s absolutely fine when the story is so well-known and the numbers are so show-stopping.\n\nThis cast is remarkable. Nichelle Lewis shines as Dorothy, always the least showy role and one that requires both a wide-eyed wonder and steely strength, which Lewis captures perfectly. Shame for the acoustics, however, as Lewis’ lovely voice often felt drowned out compared to everyone else’s. Still, either by design or accident, Dorothy seems to sing louder as the show goes on so that by the ending number (the true classic “Home”) she earns her ovation. The revival also makes a smart choice to end Act I with “Be a Lion,” an underrated gem that finally gets its due, and on which Lewis simply soars.\n\nBut this show belongs to the Scarecrow (Avery Wilson), the Tin Man (Phillip Johnson Richardson), and the Cowardly Lion (Kyle Ramar Freeman). Wilson’s long, limber legs, impressive athleticism (he does a full aerial split in Timbs, for crying out loud), and dynamic voice channel the late MJ, who is the Scarecrow by which all Scarecrows will forever be judged. The choreography even nods to the erstwhile King of Pop, and the revival is smart to swap out the original production’s rather forgettable “I Was Born on the Day Before Yesterday” for the funk workout “You Can’t Win” from the film version.\n\nRichardson is a slow burn, giving the Tin Man an air of B-boy cool before showcasing some major pipes and soul on the emotional “What Would I Do If I Could Feel.” And Freeman — if everyone needed a little help being heard in the Marquis, Freeman sounded like he didn’t even need a mic. His Lion is boisterous, flamboyant, and the biggest ham this side of a pork shoulder. He’s clearly having the most fun out of everyone and it’s impossible not to share in it.\n\nBecause everyone gets a solo (or two), everyone gets a chance to show out, adding more runs than a track meet, to the whooping delight of the audience. It’s a bit Showtime at The Wiz Apollo, but that sort of over-singing is just a tradition stemming from the Black church, contributing to this revival's air of being an actual revival. Whenever someone takes it to church, as they so often do, it’s a reminder of the communal spirit that only religious experiences, and great theatrical ones, can create.\n\nThe big names in the cast — Deborah Cox as Glinda the Good and Wayne Brady as The Wiz — aren't above stealing the show, either. Brady’s gift for comedy proves an asset in the 11 o’clock number “Y’all Got It,” in which the Wiz basically admits that he’s a charlatan and so what? Brady bridges the buoyant “Everybody Rejoice” with Cox’s big revelatory solo, “Believe in Yourself,” before Lewis takes it on home with, well, “Home.” That’s quite the run of songs but it leaves you feeling nothing short of euphoric.\n\nThe Wiz is all about feeling. It opens with the plaintive “The Feeling We Once Had,” about remembering the good times when things get bad. The musical is designed to uplift. Its cheery sentiment and its devotion to believing in oneself, to relying on one another, to easing on down the road of life and refusing to carry anything &#34;that might be a load&#34; may seem simplistic. But in complex times, its simple message rings loud and clear — even with some minor sound issues. A",
  "isFullReview": true,
  "dtliExcerpt": "\"The Wiz is all about feeling...in complex times, its simple message rings loud and clear\"\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1142,
  "archivePath": "data/archives/reviews/the-wiz-2024/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:43:46.830Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250302155334",
  "archiveOrgUrl": "http://web.archive.org/web/20250302155334/https://ew.com/the-wiz-broadway-revival-review-8635100",
  "textIssues": [
    "Show title not found in text"
  ]
}