{
  "showId": "the-wiz-2024",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Johnny Oleksinki",
  "url": "https://nypost.com/2024/04/17/entertainment/the-wiz-broadway-review-were-off-to-see-the-cheap-natl-tour/",
  "publishDate": "April 17, 2024",
  "fullText": "Jeremy Daniel\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\nMy apologies to Evilene, the wicked witch in “The Wiz,” who famously demands in song that her henchmen bring her “no bad news.”\n\nTwo hours and 30 minutes, with one intermission. At the Marquis Theatre, 210 W. 46th Street.\n\nBecause I must unfortunately report that the new revival of that musical, which opened Wednesday night at the Marquis Theatre, is not the dazzler that fans have waited so long for. Quite the contrary.\n\nAnd that&#8217;s bad news, indeed.\n\nDespite the cozy feeling of being reunited with beloved material 40 years after it was last on Broadway, director Schele Williams’ production is deflatingly flimsy and lackluster. Clumsily staged, it’s a Wiz-sper of what it should be.\n\nStill, the Emerald City offers occasional shimmers of hope.\n\nThe all-black riff on L. Frank Baum&#8217;s “The Wizard of Oz,” which was made into a 1978 movie starring Michael Jackson and Diana Ross, is chockablock with infectious tunes, such as “Ease On Down The Road” and “Home,” and is sometimes rescued here by the voices of its talented cast.\n\nThen — I’ll get you my pretty! — we spot the villain that’s lurking behind them: ugly CGI backdrops that look like Windows XP screensavers. Surely, the creative team can do better than that.\n\nIf they only had more than practicality on the brain! This “Wiz” arrives in New York via a months-long national tour. It’s obviously been built to easily fit into a wide array of venues around the country.\n\nBut Hannah Beachler’s sets are so cheap and unremarkable, and Daniel Brodie’s artificial-intelligence-style projections so prominent, that the overwhelming vibe is that we and the tour are actually still stuck in Kansas. We&#8217;re certainly not on Broadway.\n\nSuch cut corners are hard to stomach in a tale of a lush, magical land over a rainbow, especially when another take on “Oz” — “Wicked” — remains a visual wow, 20 years later and only four blocks away.\n\nYes, “The Wiz” should ease on down the road — but with boundless creativity and awe.\n\nFor the two of you who don’t know, it’s the old story of Dorothy (Nichelle Lewis), a Kansas farmgirl who’s whisked by a tornado to the Land of Oz, with a new — or, rather, 49-year-old — twist.\n\nIn the 1970s, composer Charlie Smalls brought Motown-style music — the sort you don’t just hear, but feel from head to toe — to Munchkinland.\n\nEn route to get help from the Wizard (Wayne Brady), Dorothy meets the Scarecrow (Avery Wilson), Tinman (Phillip Johnson Richardson) and Lion (Kyle Ramar Freeman), who all have unique struggles of their own.\n\nTheir songs are fabulous. The quartet doesn’t follow the Yellow Brick Road, they “Ease On Down” it. The Tinman’s “If I Only Had A Heart” becomes “Slide Some Oil To Me.” And “Somewhere Over The Rainbow” gets an altogether differently poignant counterpart in “Home.”\n\nRichardson, as that poor rusty bucket of bolts, does best with writer Amber Ruffin’s newly added, funny jokes. And his number is the most energizing of the three supportive Ozians, likable though the others are.\n\nThey’re tormented by the powerful Evilene, sung with vigor by Melody A. Betts, who gets this “Wiz”’s closest thing to a showstopper in “Don’t Nobody Bring Me No Bad News.”\n\nBrady, cameo-style, plays the Wizard with a Center Square personality. And Deborah Cox croons a lovely, maternal rendition of “Believe in Yourself&#8221; as Glinda.\n\nThen, in a wildly rushed ending that gives zero closure, Lewis nicely sings “Home.&#8221;\n\nIt&#8217;s too bad that elsewhere in the musical, her Dorothy tends to let the wackier, flashier roles take over, whenever she’s not belting downstage center. This staging’s biggest flaw, actually, is forgetting that the show is more than just a bopping playlist — it’s the story of a scared girl who’s lost and discovering what matters most in her life.\n\nBut a lot has fallen to the wayside here. Not much is distinctive about this &#8220;Wiz&#8221; besides a memorable start of Act 2, during an extended dance called “Emerald City.”\n\nIt’s a modern nightclub sequence that’s a lively breath of fresh air. Finally, the show has been given a contemporary context beyond 3D images ripped from our scariest nightmares.\n\nBefore and after that, though, Jaquel Knight’s choreography is underwhelming and lacks theatricality and crispness. It doesn&#8217;t fill the stage, so much as clutter it.\n\nFor example, Ozian guards flank the four friends during “Ease On Down The Road,” marching and awkwardly moving their staffs not quite in unison. Their cumbersome decoration makes the spirited trip down the road bumpier than need be.\n\nLike so much of this hit-and-miss production.\n\n“The Wiz” ideally should have audiences proclaiming, “There’s no place like Broadway!” at the end.\n\nAlas, back on W. 46th St. at 10:30 p.m., I headed to the train thinking, “There’s no place like home.”",
  "isFullReview": true,
  "bwwExcerpt": "Despite the cozy feeling of being reunited with beloved material 40 years after it was last on Broadway, director Schele Williams’ production is deflatingly flimsy and lackluster. Clumsily staged, it’s a Wiz-sper of what it should be.",
  "bwwRoundupUrl": null,
  "bwwThumb": "Down",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "dtliThumb": "Meh",
  "needsScoring": true,
  "dtliExcerpt": "Because I must unfortunately report that the new revival of that musical, which opened Wednesday night at the Marquis Theatre, is not the dazzler that fans have waited so long for. Quite the contrary. And that’s bad news, indeed.",
  "sources": [
    "bww-roundup",
    "dtli"
  ],
  "textWordCount": 806,
  "archivePath": "data/archives/reviews/the-wiz-2024/nypost--johnny-oleksinki_2026-01-29.html",
  "textFetchedAt": "2026-01-29T02:30:09.838Z",
  "designation": "Recommended",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241003075348",
  "archiveOrgUrl": "http://web.archive.org/web/20241003075348/https://nypost.com/2024/04/17/entertainment/the-wiz-broadway-review-were-off-to-see-the-cheap-natl-tour/",
  "textIssues": [
    "Show title not found in text"
  ]
}