{
  "showId": "the-wiz-2024",
  "outletId": "pagesonstages-wordpress-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.wordpress.com/2024/04/25/the-wiz/",
  "publishDate": null,
  "fullText": "Though The Wiz is a classic, I’ll admit it’s one I had never seen before. I went into this production, which originally premiered in 1974, with the mindset of someone who lives in a world that has seen 50 years of progress toward social and racial equality. Which is not to say that I have seen the removal of harmful stereotypes—far from it. I enjoyed watching The Wiz both expose and celebrate these stereotypes in a colorful, over-the-top imagining that reflected a brighter future while acknowledging a darker past. The first set we saw was the one of Kansas with Aunt Em before the tornado, and it was an absolutely stunning black-and-white homage to The Wizard of Oz. I was, quite appropriately, blown away. But in those opening lines of dialogue, the discomfort began to creep in. The audience demographics were similar to those I observed twos week ago at Hell’s Kitchen, a Broadway musical by Alicia Keys that also comments on the Black experience. At Hell’s Kitchen, the Black members of the audience were loving it—the gospel riffs and the representation seemed to resonate. In the audience of The Wiz, I knew from Aunt Em’s (u/s Allyson Kaye Daniel) first over-the-top moment of exaggerating Black culture that The Wiz was not going to get the same response. As the show progressed it gave way to afrofuturist cartoon projections and blatant stereotypes of Black people as brainless, heartless, and cowering in fear stripped of their pride. Yet it also showcased an incredible number of Black people who seemed to enjoy the exaggerated recalling of African dance styles embedded in the choreography. The beautiful colors in the scenic design, projection design, and costume design, as well as highly inventive and fantastic props design recalled many versions of African pride—I loved that the first scene in Oz looked vaguely like New Orleans. By the end of the show, I realized how many people of African heritage were involved in the show, and started to see the overblown stereotypes and historical references to times of enslavement, Jim Crow laws, and Black subjugation in a different light. There were outright mentions of poverty and economic inequality, as well as implications the simplicity of Black peoples’ abilities. These ideas were a product of an earlier time (Frank L. Baum’s book was written in 1900), yet they were not a miscalculation. Reevaluating the journey at different places along the yellow brick road was the intention of the show. As Glinda says at the end, Dorothy’s journey is about a lesson. That lesson is in all the different ways there are to be Black, the inevitability that the world will exaggerate and misjudge Blackness, and the perceived absurdity of a future where Black people are examined as people first. The show played with a demeaning frivolity of Black people not being fully human, not belonging anywhere or having a home, wanting drugs (the poppies) and power, dancing joyfully through hard work (“Don’t Nobody Bring Me Bad News”), not being trustworthy/able to keep promises… all of a sudden I realized that the way this production presents Black people as a collective is meant to be as ridiculous and blatantly fake as the projections design and costume design make their world look. As a White theatregoer, I was not there to experience Black culture in the way that I thought I was (just as Dorothy was not ready to see the world as it really was)—I was here to look at fifty year old stereotypes and acknowledge that I had difficulty discerning if it was alright to mock the pride of a lion as an allusion to the queer/drag community, the heartlessness of a tin man who cannot feel as an allusion to the justification for slavery, and the brainlessness of a scarecrow who can’t think as an allusion to denying Black people the right to vote or a fair shot at higher education. My most powerful takeaway was the humbling realization that I spent a lot of the show unsure if it was crossing lines that I thought had been clear to me. I had moments that made me think of everything from Uncle Tom to Ru Paul. The leads had some beautiful, playful riffs yet the faces of most of the ensemble mostly remained fixed and serious. These actors were here for something more than a paycheck. They wanted us to see that this show, which was celebrated 50 years ago, depicts a variety of caricatures and not a spectrum of people. They played into it to expose it and celebrate that we’ve come far enough that White theatregoers like me were attuned to the discomfort. This is progress because I enjoyed the colorful lights and beautiful video wall, and I also felt profoundly moved by the lack of enthusiasm from the audience even when the Scarecrow (Avery Wilson) and Glinda (Deborah Cox) hit fantastic gospel riffs shows. It made me feel the theatre world shifting under my feet– times are changing and people are returning to caring more about the message than the spectacle. We can’t change history, and it would be wrong to rewrite The Wiz in a politically correct way so that we can keep singing “Ease on Down the Road.” But using design and over the top acting to showcase how far we’ve come as a society? Saying these words in ways that cannot be real or acceptable in today’s world? That felt like a solid reminder that change is possible, even within a human life span. So despite a few moments of inner turmoil, I left the theatre empowered by the idea that we can infuse our current truth, our current moment into these stories that capture a moment in time when the world was a different place for people of color. We don’t have to discard our history because we can see the progress when we insert these reminders into its retelling. And that, more than anything, gives me hope for a brighter future, where 50 years from now the world has provided more and more people with a sense of home and belonging. I attended this performance on a press pass from DKC/O&M.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1033,
  "archivePath": "data/archives/reviews/the-wiz-2024/pagesonstages-wordpress-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:47:16.511Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ]
}