{
  "showId": "the-wiz-2024",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theaterscene.net/musicals/broadway/the-wiz/victor-gluck/",
  "publishDate": null,
  "fullText": "Posted on May 16, 2024 by Victor Gluck, Editor-in-Chief in Broadway, Musicals Kyle Ramar Freeman as the Lion, Nichelle Lewis as Dorothy, Phillip Johnson Richardson as the Tinman and Avery Wilson as the Scarecrow in a scene from the revival of the musical “The Wiz” at the Marquis Theatre (Photo credit: Jeremy Daniel) [avatar user=”Victor Gluck” size=”96″ align=”left”] Victor Gluck, Editor-in-Chief[/avatar] The (nearly) 40th anniversary revival of The Wiz is a joyous, colorful affair. This second Broadway revival of the hit musical from 1975 no longer seems groundbreaking as it did originally being the first all-Black musical adaptation of a classic story. However, as revised by Amber Ruffin (co-author of the recent musical version of Some Like It Hot) from William F. Brown’s original book, the show has been made a bit more relevant for today. While this is the show that gave us “Ease on Down the Road,” it does have many more hit songs by Charlie Smalls with some new emendations to the score. The high-powered cast includes several noted recording stars as well as Grammy nominees and winners. The direction by Schele Williams is always fast-paced and exciting even in a story this well known. Among the changes that Ruffin has made are to streamline the story, cut and add songs, rearrange the running order, update the dialogue and cut material that has become dated. In the first scene, Toto and Uncle Henry have been cut, and Dorothy is now an orphan from the city who has come to live with her Aunt Em in rural Kansas but is having trouble fitting in at her new school. The opening sequence before the tornado which transports Dorothy to Oz is in black, white and grey, a tribute to the original 1939 MGM movie as well as to Dorothy’s depression before her multicolored adventures with the Scarecrow, Tinman and Lion. Wayne Brady as The Wiz with Ozians in a scene from the revival of the musical “The Wiz” at the Marquis Theatre (Photo credit: Jeremy Daniel) Among the cut songs are the Scarecrow and the Crows’ “Born on the Day Before Yesterday” (replaced by “You Can’t Win”), “Who Do You Think You Are?” and Glinda’s “A Rested Body.” Added are “We’re Gonna Make It” and Dorothy’s “Wonder, Wonder Why” (added to the 1984 revival.) The intermission now takes place before Dorothy and her friends reach the Emerald City and The Wiz’s throne room. Instead of meeting The Wiz for the second time at the Fairgrounds we discover that he is an actor and that Oz is all a stage set which seems perfectly correct for today. The eye-filling sets by Hannah Beachler and video and projection design by Daniel Brodie include subtle tributes to Black Culture that not all theatergoers may notice on a first look. When Dorothy first lands in Oz, the landscape and houses are reminiscent of Tremé, the Black neighborhood in New Orleans decimated by Hurricane Katrina. The overhead set piece is inspired by the arch in New Orleans’ Louis Armstrong Park as well as incorporating patterns found in quilts on the Underground Railroad. African symbols are carved into the bark of the trees along Dorothy’s path on the Yellow Brick Road as well as depicted on the sides of the theater proscenium arch. When Glinda enters, she comes out of a house at the address 1804, commemorating the year of Haiti’s independence. The red and black sets and costumes (by Sharen Davis) for the sequence in the Castle of Evillene are a tribute to West African culture. Deborah Cox as Glinda, the Good Witch of the South, and Nichelle Lewis as Dorothy in a scene from the revival of the musical “The Wiz” at the Marquis Theatre (Photo credit: Jeremy Daniel) The best performances are by the veteran actors. Melody A. Betts is a compassionate Aunt Em particularly in her song “The Feeling We Once Had,” and reappears as the over-the-top Evillene, the Wicked Witch of the West, who stops the show with “Don’t Nobody Bring Me No Bad News.” Canadian Music Hall of Fame inductee and Grammy nominee Deborah Cox is glamorous as Glinda, the Good Witch of the South, in a sparkling gold dress, who gets to state the theme of the show with her beautiful solo, “Believe in Yourself.” Five-time Emmy winner and Grammy nominee Wayne Brady is dynamic as the all-powerful Wiz who turns out to be a fraudulent potentate but a very good actor. Making her Broadway debut as the fearless Dorothy, Nichelle Lewis is endearing and applies her lovely soprano to her solos ”Soon As I Get Home” and “Wonder, Wonder Why.” Her companions along the way each have their specialty and get to sing their own solos: Avery Wilson’s slow-witted Scarecrow (“You Can’t Win”), Phillip Johnson Richardson’s spunky Tinman (“Slide Some Oil to Me”), and Kyle Ramar Freeman as the preening and cowardly Lion (“Mean Ole Lion”.) Among other outstanding performances are Allyson Kaye Daniel as the cheerful Addaperle, Good Witch of the North, and Anthony Murphy as the gutless Lord High Underling, under the thumb of the repellent Evillene. Melody A. Betts as Evillene, the Wicked Witch of the West, and Winkies in a scene from the revival of the musical “The Wiz” at the Marquis Theatre (Photo credit: Jeremy Daniel) The choreography by Jaquel Knight (one of Beyoncé’s favorites) adds another dimension to the show as does the large hard-working ensemble who appear in many guises: townspeople, Yellow Brick Road, Poppies, Ozians, and Winkies. Knight turns “He’s the Wiz,” “Poppies,” “The Emerald City,” “Meet the Wizard,” “Don’t Nobody Bring Me No Bad News,” “Everybody Rejoice,” and “Y’All Got It” into fast-paced, toe-tapping production numbers. The score by the late Charlie Smalls with its mix of rock, gospel, pop and soul still sounds up-to-date and exciting. The one song everyone remembers from the show, “Ease on Down the Road,” is not sung as often as most people think they recall. Joseph Joubert is responsible for the new orchestrations and musical supervision. While the new incarnation of The Wiz, last seen on Broadway in 1984, is no longer cutting edge or trailblazing, it is still an entertaining, satisfying show. With an energetic cast, splashy and highly colorful design, and a collection of pleasant and enjoyable songs, The Wiz is still a diverting musical comedy. In this new version, you may catch some things you have not noticed before. And the message of “Believe in Yourself” is always worth repeating so this is not just a light-hearted musical comedy. The Wiz (through August 18, 2024) Marquis Theatre, 1535 Broadway between 45th and 46th Streets, in Manhattan For tickets, visit http://www.thewizmusical.com Running time: two hours and 35 minutes with one intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1121,
  "archivePath": "data/archives/reviews/the-wiz-2024/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:51:19.786Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ]
}