{
  "showId": "the-wiz-2024",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Robert Hofler",
  "url": "https://www.thewrap.com/the-wiz-broadway-review-funniest-lion-scarecrow-tin-man/",
  "publishDate": "April 17, 2024",
  "fullText": "Skip to content\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\t\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\t\t\n\t\t\n\n\t\t\n\t\t\t\n\n\n\t\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\n\nThere’s a wonderful, magical moment near the top of the new revival of “The Wiz” that opened Wednesday at the Marquis Theatre. It comes when the tornado descends and Dorothy’s house doesn’t do much more than split apart and spin around, accompanied by a few simulated flashes of lightening. Rather than being visualized literally, the tornado comes courtesy of a troupe of dancers. Equally imaginative, four dancers dressed in drum major outfits are the famous yellow brick road.\n\nToo often nowadays, going to the theater is not that much different from going to the movies. And overamplification is only part of the problem. Rather than letting an audience use its imagination, the makers of musical theater want to wow us with splashy effects that are too generally literal to the extreme. From “Chitty Chitty Bang Bang” to the current Broadway production of “Back to the Future,” if the script calls for a flying car, the producers give us a flying car, and our imaginations shift into autopilot.\n\nThe new “Wiz” has toured the country, and this is one instance where the simple but stylish production &#8212; with sets by Hannah Beachler, costumes by Sharen Davis and lighting by Ryan J. O’Gara &#8212; is a refreshing relief. Most of the set changes are handled efficiently with Daniel Brodie’s often arresting videos and projections.\n\nAlso a real treat, JaQuel Knight’s choreography; besides delivering a furious tornado, he brings a nifty slow-burn progression to the Act II opening showstopper “Emerald City.”\n\nIn other words, the actors and dancers in this “Wiz” carry the show magnificently, with Kyle Ramar Freeman’s Lion, Phillip Johnson Richardson’s Tin Man and Avery Wilson’s Scarecrow the funniest trio of misfits ever to take us on this trip to Oz. Watching these three actors outperform each other is a friendly competition not to be missed. This kind of ensemble doesn’t come out of nowhere and credit must go to director Schele Williams. But the secret sauce here is Amber Ruffin, who’s credited with “additional material for this production.” No way did William F. Brown’s book for the original 1974 Broadway production of “The Wiz” offer this many inspired one-liners. Ruffin provides a lot of great stand-up, put-down humor for Melody A. Betts’ wonderful Evilene (a Wicked Witch) and Allyson Kaye Daniel’s equally terrific Addaperle (a Good Witch). Leading the Munchkins, Daniel sets the stage afire until Wilson, Richardson and Freeman come aboard to burn it down completely.\n\nIn such a comedy free-for-all, it’s probably wise that Wayne Brady presents an elegant, understated and, yes, sexy con artist. In the original production, André De Shields made his name playing a very imposing wizard. Brady makes the role his own by turning The Wiz into a confidence man who is simply super-slick.\n\nBack at the Tonys in 1975, “The Wiz” won for Best Musical, but Stephanie Mills wasn’t even nominated for best actress. While her vocals impressed, Mills wasn’t a charismatic Dorothy. In the current revival, Nichelle Lewis in her Broadway debut presents a very sympathetic young heroine. Williams’ direction of her songs, however, pushes Lewis to be far too grand. Imagine the young Judy Garland delivering the iconic “(Somewhere) Over the Rainbow” from “The Wizard of Oz” as if she were Garland delivering “The Man That Got Away” from “A Star Is Born.”",
  "isFullReview": true,
  "bwwExcerpt": "In other words, the actors and dancers in this “Wiz” carry the show magnificently, with Kyle Ramar Freeman’s Lion, Phillip Johnson Richardson’s Tin Man and Avery Wilson’s Scarecrow the funniest trio of misfits ever to take us on this trip to Oz. Watching these three actors outperform each other is a friendly competition not to be missed. This kind of ensemble doesn’t come out of nowhere and credit must go to director Schele Williams. But the secret sauce here is Amber Ruffin, who’s credited with",
  "bwwRoundupUrl": null,
  "bwwThumb": "Up",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "dtliThumb": "Up",
  "needsScoring": true,
  "dtliExcerpt": "But the secret sauce here is Amber Ruffin, who’s credited with “additional material for this production.” No way did William F. Brown’s book for the original 1974 Broadway production of “The Wiz” offer this many inspired one-liners.",
  "sources": [
    "bww-roundup",
    "dtli"
  ],
  "textWordCount": 555,
  "archivePath": "data/archives/reviews/the-wiz-2024/thewrap--robert-hofler_2026-01-29.html",
  "textFetchedAt": "2026-01-29T02:30:17.455Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251116085102",
  "archiveOrgUrl": "http://web.archive.org/web/20251116085102/https://www.thewrap.com/the-wiz-broadway-review-funniest-lion-scarecrow-tin-man/",
  "textIssues": [
    "Show title not found in text"
  ]
}