{
  "showId": "linda-vista-2019",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2019/10/10/theater/linda-vista-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2019/10/10/theater/linda-vista-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "The everyday poison known as toxic masculinity becomes dangerously easy to swallow in 'Linda Vista,' Tracy Letts's inspired, ruthless take on the classic midlife-crisis comedy. In the sunny opening scenes of this very funny, equally unsettling Steppenwolf Theater production - which opened on Thursday at the Hayes Theater - you'll probably feel like cozying up to that sheepish, disheveled big guy who rules the stage with his outspoken wit.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Tracy-Letts-LINDA-VISTA-Opens-On-Broadway-See-What-The-Critics-Are-Saying-20191010",
  "fullText": "The everyday poison known as toxic masculinity becomes dangerously easy to swallow in “Linda Vista,” Tracy Letts’s inspired, ruthless take on the classic midlife-crisis comedy. In the sunny opening scenes of this very funny, equally unsettling Steppenwolf Theater production — which opened on Thursday at the Hayes Theater — you’ll probably feel like cozying up to that sheepish, disheveled big guy who rules the stage with his outspoken wit.\n\nPlayed with immense, shaggy charm — and anger to match — by Ian Barford in a performance that reminds you of how brilliantly bruising Steppenwolf acting can be, this charismatic loser is named Wheeler. Actually, it’s Dick Wheeler, but he prefers to dispense with the first name, perhaps on the theory that it’s better not to provide too many clues to your essential nature.\n\nWhen we first see Wheeler, he’s moving into new digs in San Diego, with the help of his best friend, Paul (Jim True-Frost), schlepping boxes and overstuffed bags with the sloppy casualness of college boys returning to campus. Never mind that Wheeler is 50.\n\nTheir conversation, too, has a sophomoric ring, as they debate the right word for big breasts, like the pair on one of Wheeler’s co-workers. And there’s a hilarious riff on their teenage crush on Ali MacGraw, who, Paul says, confessed to being a sex addict in her memoir.\n\nIs this talk too sexist for comfort? Wheeler might argue that he and Paul are just goofing (sort of), that they’re also enlightened 21st-century men who understand that some kinds of behavior regarding the opposite sex are no longer cool. You can sense that kind of self-consciousness at work when he’s talking to women.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 303,
  "archivePath": "data/archives/reviews/linda-vista-2019/nytimes--ben-brantley_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:11:51.990Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250604214234",
  "archiveOrgUrl": "http://web.archive.org/web/20250604214234/https://www.nytimes.com/2019/10/10/theater/linda-vista-review.html",
  "contentTier": "needs-rescrape",
  "wordCount": 303,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T15:02:37.230Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is truncated and ends with a technical error message about JavaScript and verification access, making it impossible to determine the critic's verdict.; openai: The text is truncated and includes a message about enabling JavaScript, indicating it's not a complete review.; gemini: The review text is incomplete and ends abruptly with a message about JavaScript errors, indicating that the full article content could not be retrieved.",
  "promptVersion": "5.2.0"
}
