{
  "showId": "machinal-2014",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/machinal-review-the-machine-age-is-murder-1.6807322",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/machinal-review-the-machine-age-is-murder-1.6807322",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "1/20/14 In Nassau road construction. two lanes closed on The Southern St Pkwy WB between Rt-106/X25 and Meadowbrook Rd/X23\n\nIn Nassau road construction. two lanes closed on The Southern St Pkwy WB between Rt-106/X25 and Meadowbrook Rd/X23\n\n1/20/14 In Melville road construction. left lane closed on Rt-110 SB between Old Country Rd and CR-3/Pinelawn Rd\n\nIn Melville road construction. left lane closed on Rt-110 SB between Old Country Rd and CR-3/Pinelawn Rd\n\n1/20/14 In Melville road construction. left lane closed on Rt-110 NB between CR-3/Pinelawn Rd and Old Country Rd\n\nIn Melville road construction. left lane closed on Rt-110 NB between CR-3/Pinelawn Rd and Old Country Rd\n\n33&deg;\n Hi 25&deg; Lo 12&deg;\n Mostly Cloudy\n\nHumidity: 50%\n Wind: NNW 12 mph\n Barometer: 29.87 Hg\n\nFull forecast\n Hour-by-hour\n Local map\n\nwatched the Nets top the Knicks and reflects on their best rivalry moments.\n\nOriginally published: January 15, 2014 5:31 PM\n Updated: January 17, 2014 12:20 PM\n \n By LINDA WINER\n linda.winer@newsday.com\n\nPhoto credit: Joan Marcus | Rebecca Hall and Morgan Spector in Sophie Treadwell's \"Machinal\" at American Airlines Theatre.\n\nDescribing \"Machinal\" as ahead of its time is just the tip of the revelations in Sophie Treadwell's 1928 expressionist stunner. This little-known adventure in psychological, sociological and stylistic boundary-pushing -- not on Broadway in 86 years -- has been given a dazzling, daring revival that feels especially startling in the doggedly conventional environs of the Roundabout Theatre Company's American Airlines Theatre.\n\nThe lavish yet beautifully stark production reintroduces Treadwell, the pioneering American journalist and criminally forgotten author of more than 40 plays, and introduces to Broadway the provocative British director Lyndsey Turner and gifted, courageous actress Rebecca Hall.\n\nIn just 95 minutes, Treadwell takes us into the dehumanizing world of the machine age and into the desperately limited life of a sensitive, ordinary woman. She is called, simply, Young Woman, but her journey -- from secretary to the wife of her overbearing boss and to her execution for his murder -- is anything but generic.\n\nIt cannot be easy to play a character so tightly trapped behind society's facade. But Hall -- with a beanpole body like an exclamation point and a face of a thousand worried looks -- brings us deep inside the long, virtuosic bursts of halting half-sentences and tangled mazes of internal monologues.\n\nWe first meet her squashed and panicked in a crowded subway car, one of several wordless new scenes that Turner adds as strikingly visual connective tissue between what Treadwell calls her nine tight, far-reaching \"episodes.\" Eighteen first-rate actors, many playing multiple characters, talk in punchy, staccato fragments with a rat-a-tat satirical flair that could have been written by David Mamet.\n\nAlthough the woman's life is stunting and stifling, Treadwell opens it up so we can eavesdrop on surrounding conversations. At a table in a speak-easy, an older man tries to talk a younger man into coming home with him. At another table, a man talks a woman into having an abortion because \"It don't amount to nuttin'.\"\n\nMichael Cumpsty has an almost touching lack of self-awareness as Husband, whose unbearable bromides contrast violently with the passion of Young Woman's Lover (the charismatic Morgan Spector), a drifter with the freedom she can never have.\n\nAll this happens on Es Devlin's extraordinary set -- a rectangle of corrugated, prison-brown rooms on a turntable. Costumes, by Michael Krass, capture the dark, pulpy allure of the era. The lights, by Jane Cox, are almost a separate character, moving shafts that seem to have escaped from the bottom of the window shade that, remarkably, keeps Treadwell's doomed Everywoman from unattainable freedom. WHAT \"Machinal\"\n\nWHERE American Airlines Theatre, 227 W. 42nd St.\n\nINFO $52-$127; 212-719- 1300; roundabouttheatre.org\n\nUser rating: 4\n \n \n \n \n \n \n \n \n (2) Click to rate\n\nadvertisement | advertise on newsday\n\n10 best new movies streaming on Netflix\n\nadvertisement | advertise on newsday",
  "isFullReview": true,
  "textWordCount": 637,
  "archivePath": "data/archives/reviews/machinal-2014/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:49:19.978Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140121054252",
  "archiveOrgUrl": "http://web.archive.org/web/20140121054252/http://www.newsday.com:80/entertainment/theater/machinal-review-the-machine-age-is-murder-1.6807322",
  "contentTier": "needs-rescrape",
  "wordCount": 637,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-04T10:53:06.968Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This text contains road construction reports, weather information, and navigation content mixed with what appears to be fragments of a theater review. The content is corrupted or improperly scraped.; openai: The text is primarily road construction updates and weather information, not a review of the show.",
  "promptVersion": "5.2.0"
}
