{
  "showId": "american-idiot-2010",
  "outletId": "bloomberg-news",
  "outlet": "Bloomberg News",
  "criticName": "Jeremy Gerard",
  "url": null,
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "With scorching arrangements by Tom Kitt (who just won a Pulitzer for his “Next to Normal” score), the songs sneer and whine just as a rock-n-roll concert ought to. Still, 90 minutes of barbaric yawp does not an opera, punk or otherwise, make.",
  "bwwScore": 3,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Broadway-Blog-AMERICAN-IDIOT-Review-Roundup-20100420",
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 731,
  "archivePath": "data/archives/reviews/american-idiot-2010/bloomberg-news--jeremy-gerard_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:21:21.998Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_text"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Charly Triballeau/AFP/Getty ImagesTrump Orders Pullback in Minneapolis, Says ‘Softer Touch’ NeededRelatedSupreme Court Allows New California Voting Map for MidtermsOpinion: Congress Should Make It Harder to Abuse the Insurrection Act Video Player is loading.MuteCurrent Time 0:00Loaded: 0.00%0:001xPlayback Ratecaptions off, selectedEnglishShare6:58Watch: Trump Intends to Use Force Somehow: Farkas on US, Iran\n\nVideo Player is loading.MuteCurrent Time 0:00Loaded: 4.13%0:001xPlayback Ratecaptions off, selectedEnglishShare4:01Watch: Trump, Xi Talk Trade, Taiwan Ahead of April Meeting\n\nChina Is Said to Pause Panama Deals After Ports Operation NulledUS and Russia Enter Uncertain Era as Key Nuclear Pact ExpiresSingapore Urges Global Cooperation to Tackle Shadow Fleet ShipsDemocrats Demand Limits on ICE as Funding Deadline NearsKarp Steps Down as Paul Weiss Chairman After Epstein EmailsTrump Vows to Donate Any Proceeds From $10 Billion IRS LawsuitFred Mery/BloombergThe Big TakeHow Japan’s Iron Lady Learned to Spend Boldly and Challenge ChinaVoters look set to back Prime Minister Sanae Takaichi’s vision of a more assertive Japan. Markets are wary.Get the Balance of Power newsletterThe latest political news, analysis, charts and dispatches from around the globe.PreviewPlus Signed UpPlus Sign UpPlus Sign UpBy continuing, I agree to the Privacy Policy and Terms of Service.\n\n16:34Get the Balance of Power newsletterThe latest political news, analysis, charts and dispatches from around the globe.PreviewPlus Signed UpPlus Sign UpPlus Sign UpBy continuing, I agree to the Privacy Policy and Terms of Service.\n\n16:34ExplainersWhy Does the US Government Keep Shutting Down?How Thailand’s Election Will Test Old Guard’s Grip on PowerThe Complex History of US-Iran Relations: A Visual TimelineCan Trump Fire Lisa Cook? What the Supreme Court Will ConsiderBalance of Power51:27Balance of PowerDemocratic Lawmakers Press Bessent During Hearing | Balance of Power: Late Edition 02/04/20266:58Trump Intends to Use Force Somehow: Farkas on US, Iran8:24Get Your Facts Right: Rep. Casten on Scott Bessent4:03Senator Ted Cruz Says ICE Doing 'Heroic, Difficult Job'USChina Is Said to Pause Panama Deals After Ports Operation NulledUS and Russia Enter Uncertain Era as Key Nuclear Pact ExpiresDemocrats Demand Limits on ICE as Funding Deadline NearsTrump Vows to Donate Any Proceeds From $10 Billion IRS LawsuitUKUS and Russia Enter Uncertain Era as Key Nuclear Pact ExpiresStarmer Premiership in Crisis After Day of Drama in ParliamentUK MPs Vote for Government to Disclose Mandelson Vetting FilesFiles Show Mandelson Sought Visa for Epstein via DeripaskaAmericasChina Is Said to Pause Panama Deals After Ports Operation NulledColombia Bars Presidential Frontrunner From Key Primary VoteChile’s Kast Revives Role of Culture Warrior on European TourIndia Made Long Push With Trump Behind Scenes to Clinch US DealEuropeUS and Russia Enter Uncertain Era as Key Nuclear Pact ExpiresStarmer Premiership in Crisis After Day of Drama in ParliamentZelenskiy Asks Trump for More Arms to Force Putin to End the WarMacron’s Envoy Traveled to Moscow for Rare Meetings With RussiaAsiaChina Is Said to Pause Panama Deals After Ports Operation NulledUS and Russia Enter Uncertain Era as Key Nuclear Pact ExpiresSpanish Prime Minister Sánchez to Travel to China in AprilModi Officials Move to Allay Fears US Deal Is Bad for IndiaMiddle EastCongo to Ship Copper to Saudi Arabia, UAE via US-Backed VentureUS Military Hits Islamic State Targets in Syria Over Past WeekRoblox Banned in Egypt Amid Concerns Over Child SafetyPutin and Xi Tout Trade and Political Ties in Video CallMore Politics news36 min ago36 min agoChina Is Said to Pause Panama Deals After Ports Operation Nulled50 min ago50 min agoUS and Russia Enter Uncertain Era as Key Nuclear Pact Expires2 hr ago2 hr agoSingapore Urges Global Cooperation to Tackle Shadow Fleet Ships3 hr ago3 hr agoDemocrats Demand Limits on ICE as Funding Deadline Nears5 hr ago5 hr agoKarp Steps Down as Paul Weiss Chairman After Epstein Emails5 hr ago5 hr agoTrump Vows to Donate Any Proceeds From $10 Billion IRS LawsuitLoad moreHomeBTV+Market DataOpinionAudioOriginalsMagazineEventsNewsMarketsEconomicsTechnologyPoliticsGreenCryptoAIWork & LifeWealthPursuitsBusinessweekCityLabSportsEqualityManagement & WorkMarket DataStocksCommoditiesRates & BondsCurrenciesFuturesSectorsEconomic CalendarExploreNewslettersExplainersPointed News QuizAlphadots GameThe Big TakeGraphicsSubmit a TipAbout UsTerms of ServiceDo Not Sell or Share My Personal InformationTrademarksPrivacy PolicyCareersAdvertiseAd ChoicesHelp©2026 Bloomberg L.P. All Rights Reserved.\n\nExplore live news and interviews, documentary features, reporter analysis and more, all in one place.\n\nWe've updated our terms\n \n By accepting, you agree to our updated\n Terms of Service,\n including the arbitration provision and class action waiver. You understand that we process your information as described in the\n Privacy Policy,\n which may include sharing information about your use of\n Bloomberg.com\n with third parties. Accepting does not affect your right to opt-out at any time via the Do Not Sell or Share My Personal Information link in the website footer."
}
