{
  "showId": "american-idiot-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2010/legit/reviews/american-idiot-1117942305/",
  "publishDate": "April 19, 2010",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Green Day's punk-rock song cycle gets a vibrant staging that's heavy on style and emotion but light on narrative coherence.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Green Day's punk-rock song cycle gets a vibrant staging that's heavy on style and emotion but light on narrative coherence.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (20 words)",
  "textWordCount": 431,
  "archivePath": "data/archives/reviews/american-idiot-2010/variety--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:48:44.160Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "showNotMentioned": true,
  "wordCount": 431,
  "tierReason": "showNotMentioned — wrong content scraped",
  "wrongFullText": "The 90-minute performance ran according to Carey's clock.\n\n“We Belong Together” may have been the climactic moment of Mariah Carey’s Gibson Amphitheater show Tuesday (the first of two sold-out nights), and “you and I” something of a lyrical refrain, but the 90-minute performance ran according to Carey’s clock.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Karlovy Vary Prizewinner ‘Broken Voices’ Sells to Multiple Distributors (EXCLUSIVE) \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n North American Rights for 'Broken Voices' Acquired by Sumerian (EXCLUSIVE)\n\nShe fluttered her eyes and bragged about making it to the stage on time, stopped the show at one point and beckoned her hair and makeup people onstage for some mid-concert primping, then draped herself over a chaise lounge for a glass of champagne (a plug for her “Angel’s Rose” bottling) — pouting over the delay in having a mic stand brought to her and complaining about her shoes (the latter was met with a chair and a robe for the star to relax).\n\nThese are, of course, diva prerogatives, and as the most successful female vocalist of the last two decades, Carey certainly had earned them. But they were performed with a dose of winking humor and surprising self-knowledge.\n\nHer vocals have also undergone a transformation, relying less on the almost athletic runs of her early, lachrymose ballads than on the staccato, hip-hop inflected phrasing (some of it buttressed by her trio of backup singers) that shows off her impressive breath control. If her voice isn’t what it once was — the stunning purity of her high end has eroded somewhat — she has learned how to make the best use of it.\n\nThe slight roughness gives “Shake It Off” and “”Up Out of My Face” (from last year’s Island/Def Jam release “Memoirs of an Imperfect Angel”) urgency, and she brings an almost Pentecostal fury to “Make It Happen.” A mash-up of Diana Ross’ “Love Hangover” with “Heartbreaker” was also impressive. She chose, in spots, to let fly with her trademark runs, but by the end of the night, some strain was evident.\n\nThe production that accompanies her is also somewhat lower key; it’s a diva’s version of recession. It opens up with something out of the Ziegfeld Follies, with Carey lowered onto the stage on a swing, but for most of the night, she’s alone on the stage, her four-piece band, backup trio and dance troupe on raised platforms.\n\nCarey herself barely moves, except to scamper from one side of the stage to the other. And although she deploys the now de rigueur acrobatics of “Angel’s Cry,” unlike Pink and Beyonce, Mariah lets someone else hang from the rafters.",
  "_showNotMentionedDiscoveryAttempted": true
}
