{
  "showId": "head-over-heels-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/07/26/head-over-heels-a-new-musical-with-plenty-of-surprises/",
  "publishDate": "2018-07-26T21:30:20",
  "fullText": "There are surprises galore on the stage of the Hudson Theatre, where Head Over Heels has landed following two West Coast tryouts. Surprises in tone: The source material is an Elizabethan comedy by one of the Bard’s lesser contemporaries, set to songs by an all-female 1980s rock group called The Go-Go’s. Surprises in gender, which are pretty much the point of the evening. Surprises in production, with director Michael Mayer and his team altogether littering the stage with jokes and gags and gimmicks which grow, like a snowball, until just about everything gets a laugh. The most surprising thing, perhaps, is that after all is said and done, this purposely low-brow, far-from-subtle propaganda statement for sexual equality turns out to be a wittily wicked romp.\n\nNot that there aren’t flaws in the evening; there are, and by the midpoint it seems like it’s just about time to throw in the towel. But what appears to be meandering is actually part of the subversive whole, as Mayer and crew—and an immensely likable cast—ratchet up the fun past expectations.\n\nThe plot is taken from Sir Philip Sidney’s Arcadia, which it turns out was not a play but a work of prose. Sir Philip was true royalty; when he was 10, Uncle Bob—Robert Dudley, favorite suitor of Elizabeth I and a familiar face from all those Elizabeth vs. Mary plays—was named Earl of Leicester. Sir Philip published Arcadia in 1580 and was substantially through a vastly-expanded rewrite (The New Arcadia) when he died fighting Spain on the battlefield in 1586. The book was later finished by his sister Mary, published in 1593 as The Countess of Pembroke’s Arcadia. After half a century, busy playwright James Shirley dramatized it as The Arcadia, the comedy hit of 1640.\n\nWe have read neither Arcadia, The New Arcadia, sister Mary’s Arcadia or Shirley’s play, but we surmise that it includes a certain amount of cross-dressing. It is most likely, though, that the Head Over Heels character Pythio—described as “a non-binary plural, neither he nor she but they”—was not so conceived by Sir Philip, Countess Mary nor playwright Shirley. The musical itself has gone through a bit of turmoil, it seems, with Jeff Whitty of Avenue Q fame receiving “Conceived and Original Book by” credit but apparently pushed aside by James Magruder (from Mayer’s quickly-failed Triumph of Love), who receives “Adapted by” credit.\n\nAll of which brings us back to the current century, where dramatological plotting and gender are somewhat more fluid. King Basilius (Jeremy Kushnier) of Arcadia and his roving Queen Gynecia (Rachel York) have two marriageable daughters, the overbearing and overflowing-her-gown Pamela (Bonnie Milligan) and timid heroine-in-hiding Philoclea (Alexandra Socha). Philoclea is in love with the shepherd boy Musidorus (Andrew Durand), while Pamela rifles through unsuitable suitors by the dozen. She is faithfully attended by Mopsa (Taylor Iman Jones), daughter of court official Dametas (Tom Alan Robbins), and it doesn’t take more than one-and-a-half songs to discern that princess and handmaiden are sure to find themselves head over heels together. In fact, we can instantly tell that these eight principals will be neatly wrapped into four blissful couples.\n\nIf this sounds overly-contrived and ultimately obvious, that is part of director Mayer’s game as he weaves these familiar story strands into a contemporary comedy which—like all good stories—ultimately grabs our attention.\n\nMusically, alas, the evening is weak; highly energetic and often rambunctious but weak. The Go-Go’s (and yes, the punctuation is misguided but that’s what they call themselves) were, and are, a popular all-female new wave band out of Los Angeles. They have enough of a catalog to serve as the basis for a jukebox musical, and this is it. The music is mighty frisky, especially as gussied up by arranger/orchestrator Tom Kitt and led by musical director Kimberly Grigsby and her all-girl band. The lyrics, though, rarely match the plot and in any event are often indecipherable. At points, though, the songs do indeed match the exuberant spirit onstage. The basis of the plot is that in Arcadia “they got the beat!”; the plot crisis comes when the oracle prophesizes that they are in danger of losing the beat. Head Over Heels has the beat, all right, and a boisterous one; but it turns out to be pretty much the same beat, song after song after song after song.\n\nThe cast is game. Kushnier (who as a lad led the cast of Broadway’s Footloose) and York (who has been slaying ’em since City of Angels) are the adults in the room. Milligan is droll as the oversized princess, and well-matched by Jones (Groundhog Day). The non-binary Pythio is portrayed by a new-to-us artist named Peppermint (known for RuPaul’s Drag Race) and makes a good impression, while Robbins (the original Pumba from The Lion King) provides numerous laughs. Socha, a fine Medium Alison in the Public’s original production of Fun Home and a spunky heroine in Encores’ Paint Your Wagon, is sweet and pert. The find of the evening, though, is Durand, who has previously been noticeable in supporting roles (Yank!, the recent Robber Bridegroom). It turns out that he is a rubber-face comedian who has a field day as the shepherd transformed into the Amazonian warrior (or is it warrioress?) who is lustily chased by most of the others.\n\nStar of the evening, though, is Mayer, who has previously brought us diverse fare ranging from Thoroughly Modern Millie to Spring Awakening. No gag is too small for him, and he is ably abetted by choreographer Spencer Liff (Falsettos). What’s more, Mayer arms set designer Julian Crouch (The Addams Family) and costume designer Ariane Phillips with a full barrage of ammunition causing frequent laughter; even some of the props get belly laughs. Mayer presents lighting wizard Kevin Adams (Spring Awakening, SpongeBob, et al.) with the same comic license, and some of the evening’s images—like the forest green glade set against a fuchsia sky—will likely stay with you as you hurtle out onto 44th Street.\n\nHead over Heels opened July 26, 2018, at the Hudson Theatre. Tickets and information: headoverheelsthemusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
