{
  "showId": "head-over-heels-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2018/07/26/head-over-heels-the-beat-goes-on/",
  "publishDate": "2018-07-26T21:31:54",
  "fullText": "Here’s the sad truth: If you’ve been walking around the house humming “Heaven Is a Place on Earth,” it’s probably because you heard it on a Progressive insurance commercial. Even I, a card-carrying Belinda Carlisle fan (and someone who has performed that song more than once at karaoke), will admit that her oeuvre—meaning, of course, the music of her ’80s all-female pop-punk band the Go-Go’s—wasn’t exactly ripe for the Broadway treatment.\n\nBut the giddy, gleeful Head Over Heels isn’t a biomusical in the Beautiful/Jersey Boys vein. It’s more like Mamma Mia!—with songs plopped into a totally convoluted ready-made plot. From the mad-genius mind of Jeff Whitty (Avenue Q) and adapted by James Magruder (who penned the libretto for the Marivaux musical Triumph of Love, but let’s not hold that against him), HOH lifts its story from Sir Philip Sidney’s late-16th-century romp-in-the-forest romance The Countess of Pembroke’s Arcadia. (Fun fact: The Arcadia planted quite a few seeds for Shakespeare’s As You Like It, and the Bard even poked fun at Sidney in a couple of his plays.)\n\nIn the land of Arcadia, there’s a king and queen, Basilius (Jeremy Kushnier) and Gynecia (Rachel York); plain princess Philoclea (Alexandra Socha) and hilariously vain princess Pamela (Bonnie Milligan, in a star-making performance); the king’s faithful viceroy Dametas (Tom Alan Robbins) and his daughter, Mopsa (Taylor Iman Jones), Pamela’s attendant; Musidorus (Andrew Durand), a shepherd and Philoclea’s true love; and the “non-binary plural” Oracle of Delphi, Pythio (RuPaul’s Drag Race breakout star Peppermint), who delivers some bad news to Basilius: “Arcadia could lose its famous beat.” Something about redistricting and impending chaos and mass extinction—the point is: Arcadia is all about the beat.\n\nSpeaking of beats: As soon as the curtain goes up, you’ll hear the unmistakable driving drum riff of “We Got the Beat,” one of the band’s first (and best) singles, here transformed into a rousing full-company production number packed with exhaustingly good choreography by Spencer Liff. (The “La Vie Bohème”–meets––“Big Spender”–meets–The Last Supper moment he creates is genius.) If that number doesn’t put a smile on your face, go grab a frosé from the lobby bar at intermission, because you need a boozy millennial-pink frozen beverage to relax your facial muscles.\n\nHOH is a parade of cross-dressing, mistaken identities, and, above all, moments of profound silliness. Some work, such as a flock of sheep singing backup on “Mad About You” (“ma-ad about ewe”). And some, like a lion-slaying scene, don’t. (Granted, decapitating a fake lion for laughs is a tall order.) Musidorus disguising himself as an Amazon warrior woman pays off brilliantly: Wearing a bronzed armor-style bustier and thigh-high boots, he looks like a platinum-blonde version of Gal Gadot’s Wonder Woman; of course the whole royal family falls for him. Designer Arianne Phillips knows how to make a woman—and a man dressed as a woman—look gorgeous (also see: 2014’s Hedwig and the Angry Inch). But I’m still puzzling out the point of staging “Heaven Is a Place on Earth” as a massive bonk-fest silhouetted behind a curtain.\n\nAnyway—back to the beat. During the (dancing) curtain call, you’ll notice a group of five fab women who’ve been keeping it tight all night: guitarists Ann Klein and Bess Rogers, bassist Catherine Popper, drummer Dena Tauriello, and keyboardist/conductor Kimberly Grigsby, Broadway’s most badass musical director. They’re doing the Go-Go’s—Carlisle, Charlotte Caffey, Gina Schock, Kathy Valentine, and Jane Wiedlin—proud. Fittingly, they’re wearing crowns.\n\nHead Over Heels opened July 26, 2018, at the Hudson Theatre. Tickets and information: headoverheelsthemusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
