{
  "showId": "natasha-pierre-and-the-great-comet-of-1812-2016",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Unknown",
  "url": "http://theater.nytimes.com/2013/05/17/theater/reviews/natasha-pierre-and-the-great-comet-of-1812-at-kazino.html?pagewanted=all&_r=0",
  "playbillVerdictUrl": "http://theater.nytimes.com/2013/05/17/theater/reviews/natasha-pierre-and-the-great-comet-of-1812-at-kazino.html?pagewanted=all&_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "fullText": "https://www.nytimes.com/2013/05/17/theater/reviews/natasha-pierre-and-the-great-comet-of-1812-at-kazino.htmlShare full articleAdvertisement\n\nThe clash of armies is not to be heard during “Natasha, Pierre and the Great Comet of 1812,” the vibrant, transporting new musical adapted from a potent slice of Tolstoy’s “War and Peace.” True, Napoleon is nominally present, presiding with a stern semi-smile over the proceedings from within a copy of a Jacques-Louis David portrait. But the roiling sounds of battle do not intrude on the romantic drama unfolding before us in Dave Malloy’s freshly imagined pop opera, which opened on Thursday night at a custom-built cabaret called Kazino, in the meatpacking district.\n\nThe clash of cutlery, on the other hand, occasionally echoes as Tolstoy’s tale of love, corruption and fateful meetings swirls like a feverish dream before us, above us, around us. Following its acclaimed, sellout run last fall at Ars Nova, the production has been given a stylish and sumptuous upgrade, and now comes with a full meal attached.\n\nThe show is performed in an elaborately appointed salon, with claret-colored velvet draperies and period paintings adorning the walls. Spiky candelabras modeled on the starbursts at the Metropolitan Opera twinkle from above. (Mimi Lien’s set designs form a crucial part of the mise-en-scène.) The audience sits at tables and banquettes clustered tightly together. Dinner service begins an hour before the performance. (The Broadway-size price tag is $125, but on Broadway you don’t get borscht.) For those who truly want to enter into the spirit of the drama, carafes of vodka can be purchased.\n\nYes, bottle service has come to Off Broadway. (Where more appropriately than in the meatpacking district?) I suspect it was inevitable: audiences are flocking to productions that dispense entirely with the theater’s traditional fourth wall and provide nightclub-style amenities. Punchdrunk’s “Sleep No More,” which allows patrons to dawdle for a drink before, during and after the show, remains a hot ticket. (One of its producers is among the presenters of “Natasha.”) The interactive musical “Here Lies Love,” at the Public Theater, invites the audience to boogie on down with Imelda Marcos and friends.\n\nBut those with anxiety issues surrounding audience participation need not fear for their nerve endings at Mr. Malloy’s romp, directed with propulsive sweep by Rachel Chavkin. Although the characters may occasionally plop down at a table, and much of the drama unfolds in a narrow alley between the tables, no enforced folk dancing will be required, and no one will offer an arm to pull you into a polonaise.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 433,
  "archivePath": "data/archives/reviews/natasha-pierre-and-the-great-comet-of-1812-2016/nytimes--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:24:44.948Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 433,
  "tierReason": "Full review text",
  "bwwExcerpt": "Under the astute eye of the director, Rachel Chavkin - one of the most gifted working today - the show remains a witty, inventive enchantment from rousing start to mournful finish. It is both the most innovative and the best new musical to open on Broadway since \"Hamilton,\" and an inspiring sign that the commercial theater can continue to make room for the new. (Heresy alert: I prefer this show to that one.) Oh, and as for Mr. Groban, making his Broadway debut? He's not merely adequate; he's abs",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-NATASHA-PIERRE-AND-THE-GREAT-COMET-OF-1812-Opens-on-Broadway--Updating-Live-20161114"
}
