{
  "showId": "natasha-pierre-and-the-great-comet-of-1812-2016",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Unknown",
  "url": "http://variety.com/2013/legit/reviews/legit-review-natasha-pierre-and-the-great-comet-of-1812-1200482835/",
  "playbillVerdictUrl": "http://variety.com/2013/legit/reviews/legit-review-natasha-pierre-and-the-great-comet-of-1812-1200482835/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Commercial transfer smartly brings back a seductive, unpredictable, immersive musical\n\nAs Russian supper club entertainment goes, “Natasha, Pierre and the Great Comet of 1812″ could put belly dancers out of business. In this smartly engineered transfer, Dave Malloy‘s innovative musical treatment of (a very thin slice of) “War and Peace” has been installed in Kazino, an ersatz Russian nightclub housed in an elaborate tent set up in the trendy Meatpacking District. The environmental staging (brilliant work by helmer Rachel Chavkin) places the performers on raised platforms and at strategic floor locations among the audience, who sit at tables dining on Russian fare and tossing down vodka shots. “Za Vas!”\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Saccharine' Review: A Grisly Body-Image Body Horror for the Age of Weight Loss Meds \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Bedford Park’ Review: Two Children of Korean Immigrants Make an Unlikely Connection in Touching but Slightly Contrived Drama\n\nThe narrative thread that survives from Tolstoy’s monumental work is the one that romantic readers take away from the novel. It’s “War and Peace” without the war and pretty much boiled down to the tragic story of Natasha (Phillipa Soo, the vocal essence of innocence), who loses her true love, Andrey (a brief but touching perf from Blake Delong), when she falls for that dashing rogue Anatole (the dashing tenor, Lucas Steele).\n\nFor anyone who’s really desperate to keep track of who’s who, the players introduce themselves in a saucy Prologue, while reminding the aud that “this is all in your program.”\n\nSo it is, but who can tear their eyes from the seductive environment? In Mimi Lien’s comprehensive design, the set has the gaudy look of a Russian nightclub, with blood-red walls hung with gilded mirrors and reproductions of 19th century paintings in ornate frames. The dominant color accent is the burnished gold of an old coin and the eye-catching chandeliers look like miniature Sputniks. Bradley King’s tricky lighting design manages to light the actors, who are scattered throughout the room, while casting a flattering glow on the faces of patrons sitting at the tables.\n\nLike the performers, individual band members pop up in the most unlikely places, which seems unorthodox but generates a surround-sound that adds to the impression that the entire room is one big stage.\n\nMalloy’s eclectic score is likewise all over the place.\n\nA pseudo-operatic style serves for the delicious number (“The Opera”) in which the innocent Natasha is introduced to tout le monde in decadent Moscow society. “Balaga” is a lusty piece of Russian folk music that finds Anatole carousing at a gypsy orgy. “Sonya Alone,” full of feeling and beautifully sung by Brittain Ashford, is close to a traditional aria.\n\nOther songs sound exactly like the personalities of the characters who sing them. In Amber Gray’s fiery performance, “Charming” conveys the spiteful fury that the Countess Helene feels for Natasha. “In My House” is all muscle, reflecting Grace McLean’s strength of will as Natasha’s protective godmother, Marya D.\n\nAnd on occasion Malloy (who plays Pierre, the sad-sack philosopher of the title) will come out with something like “Letters,” a quick-witted, intellectually bracing song that feels more French than Russian.\n\nThe calculated lack of musical consistency is enough to drive a purist crazy. The lyrics also march defiantly to their own drumbeat, observing no rhyme scheme, ignoring historical authenticity, and overstepping their musical limits, if they feel like it. There’s an air of danger to that kind of unpredictability — and how sexy is that.",
  "isFullReview": true,
  "textWordCount": 574,
  "archivePath": "data/archives/reviews/natasha-pierre-and-the-great-comet-of-1812-2016/variety--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:25:01.917Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (503): Request failed with status code 503"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 574,
  "tierReason": "Full review text"
}