{
  "showId": "here-lies-love-2023",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani",
  "url": "https://www.broadwaynews.com/review-2/",
  "publishDate": "July 20, 2023",
  "fullText": "David Byrne’s immersive musical is a thrilling pageant of theatrics, but abstracts Filipino history better than enacting it. Toni Morrison asserted that the writer’s responsibility is to remember. By remembering the world, the writer holds enough power to create it anew. Scottish-born artist David Byrne takes up this charge of transformation in his Big beat-laced musical “Here Lies Love.” The work remembers the infamous Philippine first family, Imelda and Ferdinand Marcos, who flirted themselves to power in the 1960s but then warped their democratically elected might into an abusive monocracy. Conceiver-composer-lyricist Byrne, composer Fatboy Slim and director Alex Timbers — who have continued to develop the project since its world premiere in 2013 — dress up this dense Filipino history as a hyper-pixelated, discotheque dance party. It’s an irrefutably great time — one that rivals the Hell’s Kitchen clubs mere blocks away — even as the weight of autocratic abuse hovers just above the lustered air. An expertly crafted dramaturgical installation wraps the walls outside the theater, and the production itself uses historical footage from the Marcos’ regime to contextualize all of the funk-fueled revelry, but how much right does anyone who is not Filipino have to party here? It’s a difficult question to consider, and one Byrne, Fatboy Slim and Timbers completely avoid by driving up the production’s universal amiability. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": true,
  "dtliExcerpt": "As a frequenter of both, it was easy to surrender to “Here Lies Love.” But that ease feels directly tied to my lack of cultural connection to the musical’s complicated history. The production boasts that it can be enjoyed by all, but who decides when populism helps Filipino people — offering greater representation to a wider audience — and when it harms them?",
  "originalScore": null,
  "assignedScore": 35,
  "source": "dtli",
  "dtliThumb": "MEH",
  "dtliUrl": "https://didtheylikeit.com/shows/here-lies-love-bway/",
  "needsScoring": true,
  "textWordCount": 233,
  "archivePath": "data/archives/reviews/here-lies-love-2023/broadway-news--brittani_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:29:50.997Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 233 (min: 300)"
  ],
  "scoreSource": "extracted-strong-negative",
  "scoreConfidence": "medium",
  "extractedPhrase": "avoid"
}