{
  "showId": "here-lies-love-2023",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://cititour.com/NYC_Broadway/Here-Lies-Love/1158",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $65\n\t Buy Tickets\n\nCititour.com Review\n    A woman rises from her humble beginnings to become one of the world’s most influential leaders and is eventually hated by her own country’s people – as well as millions of others -- for her cruelties and extravagance. Yes, “Here Lies Love,” which has finally made a long-awaited transfer from its original home, The Public Theater, to the Broadway Theatre, may sound a lot like a certain Andrew Lloyd Webber musical. Yet, for all its similarities, this extravagantly reconceived production about the life of former Philippines first lady Imelda Marcos now feels like “Evita” on steroids.\n\nThat’s both a compliment and a critique, as Alex Timbers’ multimedia treatment is so heavy on spectacle it makes “Moulin Rouge” (another Timbers production) seem simple by comparison. As a result, the 90-minute show is consistently great for the eye, but its considerable substance, conveyed through an infectious pop-meets-disco score by David Byrne, is too often overwhelmed or obliterated by the design elements.\n\nWhy listen to the score’s often trenchant lyrics – which tell Imelda’s rags-to-riches story -- when you can just as easily focus on the historical projections (by Peter Negrini) or ogle the stunning-looking dancers cavorting all around you, especially if you’re on the seat-less orchestra floor? (The show’s superb choreography is by Annie-B Parson; and the consistently fabulous costumes, which should be sold in its own catalogue, are by the brilliant Clint Ramos.) \n\nAs for that floorless set, David Korins’ re-design of the theater is undeniably miraculous if arguably unnecessary; there is a lot less audience movement than in its original incarnation, and now it makes more sense to actually sit in the mezzanine, where Timbers has directed the cast to focus its attention. And while the 360-degree nightclub lighting (by Justin Townsend) is incredibly dazzling, it’s also perhaps a bit distracting to the task at hand.\n\nMixing the personal with the political, the sung-through piece charts 40 years in the life of Imelda (the strong-voiced Arielle Jacobs in bravura turn) as it takes us from her very humble beginnings as a local beauty queen to her exile from her home country in light of the People’s Power Revolution of 1986. In between, we watch numerous significant moments in Imelda’s life, including her many interactions with her early-lover-turned-eventual opponent Ninoy Aquino (a truly charismatic Conrad Ricamora) and her troubled marriage to Ferdinand Marcos (a fine, forceful Jose Llana). \n\nImelda, who seems more interested in pretty dresses than politics, gets addicted to pills in the early days of her marriage as Marcos rises to the presidency. But ultimately, she hardens her heart and grows a core of steel, effortlessly dealing with the revelation of her husband’s affair with young actress Duvie Beams (a fine Julia Abueva), stepping into positions of power as Marcos’ health fails, and jet-setting around the world to solidify her “relationships” with world leaders and celebrities.\n\nThrough it all, though, Imelda seems oblivious to her transformation – and its effects on her reputation -- as evidenced by the progression from the show’s wonderful title (and opening) number, which serves as both Imelda’s self-claimed life philosophy and her supposed epitaph, through the self-praising “Your Star and Slave” and her pleading last song, “Why Don’t You Love Me” (which certainly echoes “Don’t Cry for Me, Argentina.”)  But we still leave the show unsure why Imelda asks that last question to anyone; did she really believe everything she did was for the good of others?\n\nMeanwhile, Byrne and his team of collaborators (notably Fatboy Slim) have crafted plenty of other memorable songs to tell their larger story, including the poignant “When She Passed By,” sung by Imelda’s disillusioned childhood friend and maid Estrella (the excellent Melody Bitiu), the sizzling “Men Will Do Anything” (led by the extraordinary Jasmine Fosberg), the haunting ensemble number “Order 1081,” and, especially, the mournful “Just Ask the Flowers,” led by Ninoy’s mother, Aurora (played for the next few weeks only by the peerless Lea Salonga). Indeed, the entire cast of 23 Filipino performers is to be highly commended for their unceasing commitment and energy.\n\nIn the end, “Here Lies Love” will go down as a show for the history books, in more ways than one. \n    \t    By Brian Scott Lipton\n\nVisit the Sitehttps://herelieslovebroadway.com/CastArielle Jacobs, Jose Llana, Conrad Ricamora, Lea Salonga (thru 8/13), Melody Butiu, Jaygee Macapugay, Julia Abueva, Aaron Alcaraz, Kristina Doucette, Jeigh Madjus, Geena Quintos, Shea Renne, Angelo Soriano, Moses Villarama, Jasmine Forsberg, Reanne Acasio, Renée Albulario, Carol Angeli, Nathan Angelo, Roy Flores, Timothy Matthew Flores, Sarah Kay, Aaron \"AJ\" MercadoOpen/Close DatesOpening 7/20/2023Closing 11/26/2023\nTheatre Info\nBroadway Theatre1681 BroadwayNew York, NY 10019\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 831,
  "archivePath": "data/archives/reviews/here-lies-love-2023/cititour-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:30:45.690Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}