{
  "showId": "here-lies-love-2023",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/theater/theater-reviews/here-lies-love-review-broadway-david-byrne/",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nHere Lies Love review: David Byrne's new Broadway musical is a history lesson and disco dance party\nThe all-Filipino cast does a marvelous job telling the Cold War history of the Philippines and making it resonate with our current moment.\n\nChristian Holub is a writer covering comics and other geeky pop culture. He's still mad about 'Firefly' getting canceled.\n\nIt took years for David Byrne's latest musical to make its way to the Broadway stage, but summer 2023 feels like the perfect time for Here Lies Love. Unlike in Byrne's last Broadway production, American Utopia, he does not take center stage here. A musical history of the Philippines centered around the married Marcos dictators who ruled the islands during the middle of the 20th century, Here Lies Love stars an all-Filipino cast performing songs written and composed by Byrne and Fatboy Slim. It's an important history lesson, an innovative use of theater space, and a disco dance party, all at once.\n\nThe first thing that stands out about Here Lies Love is its set design. Unlike in most Broadway productions, the audience at this show is creatively integrated into the action via a two-tiered arrangement. Around half the audience will sit in regular seats, but the rest stand on a dance floor that takes the place of the pit. They don't stand immobile, either; a cross-shaped dais in the middle of this section regularly revolves around, requiring the audience to move around — especially fun during the dance numbers!\n\nThis is an extremely impressive blending of content and form. Here Lies Love is a story about politics that places the audience in the shoes of voters. When Jose Llana first appears as future dictator Ferdinand Marcos, he moves through the standing audience, shaking hands and smiling with them for a political campaign newsreel that is being projected live onto the traditional stage. Like Imelda Marcos herself, Arielle Jacobs rises up from the crowd to a privileged place of glamor above them after she marries Ferdinand following an 11-day courtship.\n\nBy contrast, Conrad Ricamora riles the audience up as Marcos' left-wing political rival (and Imelda's first love) Ninoy Aquino, working to inspire the people instead of using them as media props. Between this and last year's Fire Island (where he played a tenant lawyer who is the protagonist's love interest), Ricamora proves he has a real knack for portraying leftist heartthrobs.\n\nA pamphlet included with the Playbill helpfully provides a timeline of the historical events addressed in the musical, from the U.S. colonization of the Philippines in 1898 through the People Power Revolution that ousted the Marcos family in 1986. This allows viewers, regardless of their pre-existing knowledge, to relish the visual storytelling and enjoy the music. The score is a little uneven, a classic problem with musicals drawn from real life, but certain numbers will stick in your head.\n\nAlthough Imelda is the character we start with, she is not the main focus of this story, to the production's credit. Unlike Evita, Here Lies Love is not a valorization of a dictator's wife. Jacobs inhabits her character so well that Imelda's vanity and selfishness (flying across the world from one high-end party to another while her people starve) becomes abundantly clear. When Marcos falls sick, Imelda does not hesitate to fill his shoes. While she says she's doing this to prove that women can do anything men can do, what she really demonstrates is that she's just as complicit in the regime's crimes as her husband.\n\nBecause once Aquino riles up the people, civil conflict breaks out — again, the stage design places you the viewer in the action, as the room fills with smoke and sounds of gunfire, making it hard to tell what exactly is going on — and Marcos uses this as justification to make himself dictator and rule the country through martial law.\n\nThe Marcos pair couldn't hold onto power forever, though, and while Aquino doesn't live to see their downfall, his mother does. This is where Lea Salonga comes in — and though it might seem like a bit of a waste to hold such a talented, iconic actress until close to the show's final minutes, it means that Aurora Aquino's leadership of the peaceful revolution strikes with the appropriate impact. Her song \"Just Ask the Flowers\" is a beautiful tribute to all the murdered protesters of the Cold War era.\n\nThe show ends on a haunting note, though. Here Lies Love hitting Broadway in 2023 means that Bongbong Marcos, son of Ferdinand and Imelda, is the current president of the Philippines following last year's election. As peaceful and inspiring as the People Power Revolution was, how powerful was it in the end if the vanquished dictators' son can return to power after a few decades to whitewash his family name? Do we overestimate the power of electoral democracy to make lasting, positive change in the world?\n\nMoses Villarama's DJ, who acts as master of ceremonies throughout the musical, openly invites the audience to consider these questions on their way out. They certainly resonate with an American audience who have seen basic democracy come under attack. If love lies here, maybe political hopes do as well. Bravo to a Broadway show that's willing to ask such big questions in such an entertaining way. Grade: A-",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 95,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 891,
  "archivePath": "data/archives/reviews/here-lies-love-2023/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:32:26.902Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "scoreSource": "extracted-grade",
  "scoreConfidence": "medium",
  "extractedGrade": "A"
}