{
  "showId": "here-lies-love-2023",
  "outletId": "exeuntnyc-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://exeuntnyc.com/reviews/review-here-lies-love-at-broadway-theatre/",
  "publishDate": null,
  "fullText": "Nicole Serratore panics on the disco floor finding Here Lies Love’s immersion doesn’t quite work on Broadway. Arielle Jacobs in Here Lies Love (Photo: Billy Bustamante, Matthew Murphy and Evan Zimmerman) There are two things I must say upfront about the Broadway production of Here Lies Love. First, the staging of the assassination of Ninoy Aquino remains one of the most gut-wrenching moments of theater I have ever seen. Even knowing it is coming makes it no less powerful. Second, it was nearly impossible for me to see most of this show from the dance floor because of the high number of audience members being packed into that area now. So, this review is based on what I could see between people’s heads and armpits. After a decade, the musical, directed by Alex Timbers, with music from David Byrne and Fatboy Slim, transfers to Broadway and now has Broadway’s first all-Filipino cast. It tracks the rise and fall of Imelda Marcos (Arielle Jacobs) who alongside her husband Ferdinand (Jose Llana) ruled the Philippines in an unforgiving dictatorship. It also shows their battles with political rival, Ninoy Aquino (Conrad Ricamora, but at the performance I attended, Aaron Alcaraz). One of the key elements of the show’s power Off-Broadway was that the immersive dance floor where the show was staged (with some minimal seating looking down on the floor) made you feel complicit with the rise of the Marcoses so when they had their political rival murdered it felt it like you participated. You were disco dancing with Imelda while their political enemies were imprisoned and tortured. When I was given the choice of where to see the show on Broadway, I wanted to return to the dance floor. I saw the show twice Off-Broadway and never had an issue with crowds. It was naturally a much smaller space. But with moving platforms that shifted and manipulated the audience you were in constant state of the director’s control. This totalitarianism was the point. In fact, you easily accepted it and maybe enjoyed it, until it was too late. That gave the show its structural punch. It justified the choice to be immersive. This in no way works on Broadway from the vantage of the floor. They have packed in ticket holders like sardines. I had no ability to move, step back, or change positions to get a better view. When the time came to move platforms, I got nudged a few steps one-way or the other, with a slight feeling of being trapped in a vise by the shifting tides of other audience members, but I never got to explore any other angles on the show. I caught glimpses of action taking place on the platforms which surround the dance floor. With the help of projections filming live, I could see Ferdinand Marcos glad-handing audience members. The projections with news headlines, propaganda films, and audio transcripts contextualize the politics and they were my occasional narrative lifeboat as I was drowning in the audience sea. But the metaphor of being controlled by the politicians/theater director through the call-and-response structure of the show and dance moments was so muddied for me. I could not appreciate any of Annie-B Parson’s choreography which I remember loving downtown. The sense of complicity with the Marcoses was a lot less present in this overstuffed space. Since, I had no ability to physically move, perhaps a different political metaphor is apt. The Marcoses success through violence and corruption was inevitable and had I no choice but to accept it. Dictatorships are like that. But the restrictiveness I experienced is probably more the accidental by-product of the economics of Broadway crushing me and my li’l critic’s notebook, rather than Ferdinand Marcos via theater stealing my agency. I know they need to sell these floor spots to cover their costs and tearing out a whole Broadway theater to make this immersive was expensive. Sometimes capitalism can be brushed away when you are reviewing. But here it was front and center and blocking my view of Broadway legend Lea Salonga (who was playing Ninoy Aquino’s mother in a cameo appearance). She looked indomitable as best I could tell. And this might sound like petty gripes from someone who received a comp ticket. But if we are talking about what theater feels like post-pandemic and what it should and should not be doing, this is a good example of the complexity of scaling-up for Broadway and how sometimes bigger is not better for the art (or audiences). I cannot pretend this experience was what I had been hoping for. I longed for audience member Jason Robert Brown’s seat in the gallery where he was not being physically smushed and had a pretty good view. Maybe being above the fray would have delivered the message better this time around. Plus, people are paying for these tickets. I cannot in good conscience recommend seeing the show from the armpit seats/dance floor. Especially if you are short person (though my taller plus one did not fare much better). Space in theater matters (putting aside any health implications of overcrowded indoors spaces while we have a COVID surge right now). How space communicates a message is part of an immersive show. This space speaks to outside forces and not the art. For those who do see the show seated, the actors are, at times, stationed around the seats. There is a podium spot for direct address in the front row of the traditional seats. Interestingly, this choice made me think more and more about the Evita comparisons for this show. Arielle Jacobs’ Imelda also leans into this (as best I could tell). Her Imelda is a product of political creation. The Evita-ness flowed from there. Cutthroat and plastic. I’m not sure she really ever longed to be loved. With a megawatt smile that only occasionally dimmed, she was always the opportunist. Whereas Ruthie Ann Miles’ Imelda Off-Broadway, dangerously, garnered my sympathy. She made me believe Imelda was buying her own bullshit. And central to her Imelda was this emotional hole she was trying to fill. Jacobs is more calculating and the emotional setbacks she experiences do not feel as acute as a result. But her mean hits a lot harder. She is a political machine eliminating any resistance in her life. And I dislike even making an Evita reference. It feels reductive. There is a very specific story here about the circumstances which led to the Marcoses coming into power to begin with, American imperialism and colonialism in the Phillippines, and the US government’s habit of getting cozy with dictators (or at least there are hints of this). But stick a coiffed woman in front of a podium and have her raise her arms and I’m Santa Evita-ing in my mind, such is our theater lexicon. Also, with the passage of time, I wanted to think more about what this show means now and whether greater Filipino representation in the show changes a text that is largely unchanged from 10 years ago (and one created by white men). It was a little hard to do so without having a full view of things. I appreciated the depth and complexity raised in this article. When I saw audience members decked out in their sequins and ready for a night on the town on the dance floor, I felt like maybe the shows messaging was more opaque than I had appreciated. Or the marketing was. The show does acknowledge the fact that Ferdinand and Imelda’s son is now the leader of the Philippines. So, any relief you might feel upon their exile or any celebration of the taking back their country through the People Power Revolution at the end of the show is quickly diminished with this fact. Though the musical is trapped in amber. Just because David Byrne’s album ended there does not mean the story has. And it leaves an unanswered question of what does the return of the Marcoses mean to the people of the Philippines. How did this happen? And that’s something a 95-minute musical cannot cover. For all my grumbles, Ninoy Aquino going to his death stopped me short yet again this time. Through music, sound, and image, it remains a shocking emotional scene that I cannot shake. I know this show has the power to do that. I just wish I had been able to see more of it to really assess what this new iteration achieves or doesn’t. Nicole Serratore writes about theater for Variety, The Stage, American Theatre magazine, and TDF Stages. She previously wrote for the Village Voice and Flavorpill. She was a co-host and co-producer of the Maxamoo theater podcast. She is a member of the Drama Desk and Outer Critics Circle. Read more articles by Nicole Serratore",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1469,
  "archivePath": "data/archives/reviews/here-lies-love-2023/exeuntnyc-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:32:33.174Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_read_more_prompt",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}