{
  "showId": "here-lies-love-2023",
  "outletId": "newyorktheater-me",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://newyorktheater.me/2023/07/27/here-lies-love-broadway-review/",
  "publishDate": null,
  "fullText": "“Here Lies Love” can be viewed in distinctly different ways. That’s literally true – one can see the show while standing on the main floor in the midst of the action or seated in one of four more distant sections – but I also mean one can consider this Broadway musical from three separate perspectives. Some will see “Here Lies Love” first and foremost as the story of the rise and fall of Imelda Marcos, former First Lady of the Philippines. A large all-Filipino cast briskly presents some four decades of her nation’s history told through her life, from rural beauty queen to extravagant, self-dramatizing wife of a ruthless dictator and finally to political exile. (The title of the show is the phrase that Mrs. Marcos, who is still alive at 94, has said she wants on her gravestone.) Some will treat it primarily as the return to Broadway of 71-year-old eclectic, inventive musical talent David Byrne (Talking Heads frontman and star of “American Utopia”) thirteen years after “Here Lies Love” began as a concept album in collaboration with Fatboy Slim, and a decade after it was turned into a pop opera Off-Broadway. The musical features some two dozen loud, danceable tunes and belting ballads supplied with lyrics largely fashioned out of the real-life characters’ actual speeches and interviews. Or one can welcome “Here Lies Love,” as I do, as the closest Broadway will probably ever get to immersive theater, a dozen years after that genre first ignited in New York (and seven years after the next-closest immersive experiment on Broadway, “Natasha, Pierre and the Great Comeet of 1812.”) Several of the central elements of immersive theater are present, starting with set designer David Korins’ radical transformation of the century old Broadway Theater, eliminating the proscenium by replacing the orchestra seats with a disco dance floor. Having changed Broadway to accommodate a downtown show, rather than the other way around, “Here Lies Love” repeats much of what was thrilling about the production at the Public Theater in 2013 and 2015. It is a marvel of (set, costume, lighting, sound, projection) design, (Annie-B Parson’s) choreography and (director Alex Timbers’) coordination, which replaces standard Broadway stagecraft with a combination dance party and ever-changing multimedia art installation, enhanced by a smooth-moving ensemble. If you get one of the 300 tickets on the floor, a platoon of “audience wranglers” in pink jumpsuits and glowing cattle prods gently herd the crowd around the ever-shifting modular stage platforms. We sometimes wind up within a mere foot or two of the performers, as they sing to us or glad-hand us, or include us in their live feed, broadcast on the many video screens throughout the theater, or urge us to dance. If I sensed more herding and less dancing on Broadway than I remember downtown, it’s still a fun night out. Each of the three aspects of “Here Lies Love” – the historical narrative, the unconventional musical, the immersive dance party – offers its own pleasures, even as each has its own shortcomings, and together they sometimes work at cross purposes. When we first meet Imelda, she is portraying herself as “a simple country girl who has a dream” – a suspect self-characterization by a figure who in her heyday was known in America for two things: owning 3,000 pairs of shoes and dancing in discos. Her love of the 1970’s Studio 54 is the reason why the show takes place in a convincing facsimile of a disco, but there is only one reference to shoes in “Here Lies Love”: When she was a child, she was so impoverished she had (as she sings) “no clothes, no bed, no jewelry, sometimes I had no shoes.” Her shoeless childhood, and the implication that she sees jewelry as one of life’s necessities, are sly clues to her later life of let-them-eat-cake lavishness. As a young woman, her “first love” is Benigno “Ninoy” Aquino, a rising reform politician. In her telling, Aquino rejects her for a rich girl. Imelda then meets Ferdinand Marcos, a hero of World War II, and, after an 11-day courtship, they wed. Her love life is thus central to the plot – and, in this telling, to the history of the Phillippines – because, once Marcos is elected president, Aquino becomes the Marcos family’s chief critic and its most famous victim, his assassination leading to the bloodless People Power Revolution that ends the Marcos 21-year dictatorship. Jose Llana and Conrad Ricamora are reprising the roles they originated a decade ago at the Public Theater as Ferdinand Marcos and Ninoy Aquino, respectively. In the performance I attended, Aquino was replaced by his understudy Aaron Alcaraz, who did a fine job, and Llana is even more charismatic and intense than I remember. Imelda is now portrayed by Arielle Jacobs, whose previous roles on Broadway have been replacement ingenues or brats in “Wicked,” “In The Heights” and “Aladdin.” A powerful singer who captures the freshness of Imelda’s early years, Jacobs is nevertheless at a disadvantage for those of us who saw the original actress who played Imelda, Ruthie Ann Miles it is harder to detect the double consciousness of a crafty character who is herself playing a role – as a misunderstood lover of the people, and glamor queen jetsetter role model for her people. Luckily, the design sometimes does the heavy lifting in the absence of insightful dialogue or meticulous character work. Costume designer Clint Ramos has Aquino consistently dressed in pure white, while Imelda and Ferdinand are constantly changing outfits: At one point, they rip off their wedding outfits to reveal sexy matching bathing suits; another time, Imelda tears off a demure First Lady outer garment to emerge in a shimmering gold disco dress. Ramos’ costumes and hair designer Craig Franklin Miller’s wigs also work wonders in aging Imelda from youthful lover to hardy campaigner to matronly power player. To be fair, the actors must create their characters largely on their own. “Here Lies Love” is a superficial work of drama, with little effort at providing political context in the show itself (they offer a website for that instead) as well as little psychological insight and little interest in exploring the cruelty and corruption of the Marcos regime. Yes, the musical is less admiring of its central character than the show to which it is often compared, Andrew Lloyd Webber and Tim Rice’s “Evita.” But the crucial difference is that Eva Peron was long dead. Imelda Marcos is not only still alive; her son, Ferdinand Marcos Jr., aka Bongbong Marcos, is the new president of the Phillippines. “Here Lies Love,” ends now with a new song, a low-key ballad called “God Draws Straight” that’s in praise of the People Power Revolution (with the lyrics all taken from oral testimony by the participants) Soldiers come out-and they mixed with the crowd tears came to my eyes-we’re just walking around You might think you are lost, but then you will find That God draws straight, but with crooked lines It’s not the only moving song in the show — “Just Ask the Flowers,” sung by Aquino’s mother is devastating, not least so because Aurora Aquino is portrayed (through August 13th) by Lea Salonga. But there’s a disorienting edge to “God Draws Straight,” because it’s led by Moses Villarama, accompanying himself on guitar. Throughout the ninety minutes of the show, Villarama has played the D.J., egging us to dance and cheer on Ferdinand and Imelda during their rise to power, and then abuse of it. Perhaps we’re supposed to see that the DJ has realized the error of his support for the regime, and then be forced to acknowledged that our DJ-led merrymaking also made us complicit. Or maybe he’s just a good guitarist. Here Lies LoveBroadway TheaterRunning time: 95 minutes with no intermissionTickets: $49 to $199 (the floor and the front mezzanine are generally the same price; the rear mezzanine is cheaper; floor side seats and VIP lounge are more expensive.)Concept by David Byrne, music by Byrne and Fatboy Slim; Lyrics by David Byrne; Additional music by Tom Gandey and José Luis PardoDirected by Alex Timbers, choreographed by Annie-B Parson. Set design by David Korins, costume design by Clint Ramos, lighting design by Justin Townsend, sound design by M.L. Dogg & Cody Spencer, projection design by Peter Nigrini, Hair Design by Craig Franklin Miller; Make-Up Design by Suki Tsujimoto; Cast: Arielle Jacobs as “Imelda Marcos,” Jose Llana as “Ferdinand Marcos,” Conrad Ricamora as “Ninoy Aquino,” Melody Butiu, Moses Villarama, Jasmine Forsberg, Reanne Acasio, Jaygee Macapugay, Julia Abueva, Renée Albulario, Aaron Alcaraz, Carol Angeli, Nathan Angelo, Kristina Doucette, Roy Flores, Timothy Matthew Flores, Sarah Kay, Jeigh Madjus, Aaron “AJ” Mercado, Geena Quintos, Shea Renne, Angelo Soriano, and Lea Salonga (through August 11th) as Ninoy Aquino’s mother. Photographs by Billy Bustamante, Matthew Murphy and Evan Zimmerman July 2023 New York Theater OpeningsJuly 1, 2023In \"Broadway\" Dorian Theater Awards 2024. Queer Critics Weigh InJune 6, 2024In \"Awards\" The Heart of New York Theater. Stageworthy News of the WeekNovember 13, 2023In \"New York Theater\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 85,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1511,
  "archivePath": "data/archives/reviews/here-lies-love-2023/newyorktheater-me--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:35:58.910Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "scoreSource": "extracted-strong-positive",
  "scoreConfidence": "medium",
  "extractedPhrase": "raves"
}