{
  "showId": "here-lies-love-2023",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/HereLiesLove.html",
  "publishDate": null,
  "fullText": "Broadway Reviews\n \n\n Here Lies Love\n\n\nTheatre Review by Howard Miller - July 20, 2023\n\nHere Lies Love. Concept, music and lyrics by David Byrne. Music by Fatboy Slim. Additional music by Tom Gandey and Jos&eacute; Luis Pardo Directed by Alex Timbers. Choreography by Annie-B Parson. Scenic design by David Korins. Costume design by Clint Ramos. Lighting design by Justin Townsend. Sound design by M. L. Dogg and Cody Spencer . Projection design by Peter Nigrini. Hair design by Craig Franklin Miller . Makeup by Suki Tsujimoto. Music director J. Oconer Navarro. Vocal arranger Kimberly Grigsby and Justin Levine. Music production and additional arrangements by Matt Stine and Justin Levine. Associate director Andrew Scoville. Associate choreographer Elizabeth DeMent. Assistant director Billy Bustamente. Assistant choreographer Renée Albulario. Cultural advocate and facilitator Sophia Skiles. Creative consultant José Antonio Vargas and Clint Ramos. Production architect Mitchell Kurtz Architect PC. Fight director Jacob Grigolia-Rosenbaum. Music coordinator Tomoko Akaboshi. Creative director Bianca Moran Parkes. Cultural and community liaison The 7107 Media Group and Giselle \"G\" T&ouml;ngi.\nCast: Arielle Jacobs, Jose Llana, Conrad Ricamora, Lea Salonga, Melody Butiu, Moses Villarama, Jasmine Forsberg, Reanne Acasio, Jaygee Macapugay, Julia Abueva, Renée Albulario, Aaron Alcaraz, Carol Angeli, Nathan Angelo, Kristina Doucette, Roy Flores, Timothy Matthew Flores, Sarah Kay, Jeigh Madjus, AJ Mercado, Gina Quintos, Shea Renne, and Angelo Soriano.\nTheater: Broadway Theatre\nTickets: Telecharge.com\n\n\nArielle Jacobs and Jose LlanaPhoto by Billy Bustamante, Matthew Murphy, and Evan ZimmermanIt's been a decade since the disco/pop musical Here Lies Love, based on the rise and fall of former Philippines politico Imelda Marcos, made its highly successful New York debut at the Public Theater. Now, at long last, the 90-minute sung-through show, with music by David Byrne and Fatboy Slim, lyrics by Byrne, and additional music by Tom Gandey and Jos&eacute; Luis Pardo, has found a home on Broadway, where it opened tonight at the Broadway Theatre. It is, in a nutshell, a triumph of substance and style on all counts, terrifically performed by its all-Filipino cast, and achieving a big win for Local 802 of the American Federation of Musicians.\n\nProducers for the show had initially intended to make use of recorded music, aimed at creating a karaoke-like environment. But after protests by the union, an agreement was reached to include 12 in-person musicians. Happily for audiences, the live music fits in perfectly, especially with the percussionists who are visibly present as part of the overall brilliantly conceptualized mise-en-sc&egrave;ne.\n\nDirector Alex Timbers and the entire design team have done a stunning job of reconfiguring the Broadway Theatre into a dance club, replete with a giant disco ball, pulsing lights, and projections everywhere, as well as  multiple platforms and a stage that is often on the move, sweeping standing audience members along with it like some mobile version of Shakespeare's groundlings. Standees get an up close and personal view of the performers, but there is a seating option. Sightlines are great in either case, and a very active DJ (Moses Villarama) is on hand to signal everyone to dance in place from time to time.\n\nHere Lies Love is not, of course, the first musical to deal with a dictatorship and a powerful and power-hungry First Lady. There are a lot of similarities between this and the Andrew Lloyd Webber/Tim Rice show Evita. But since the corrupting effects of power seem to emerge with great frequency in real life, there's plenty of room for telling the story more than once, with a change of characters and venues. No musical can be a substitute for the breadth and depth of historical reporting, but both of these shows manage to paint the big picture for audiences, who can then, if they wish, read further. A handy overview is included with the Here Lies Love Playbill.\n\nImelda Marcos herself, who, as of this writing, is still alive at the age of 94, is said to have been flattered by the creation of Here Lies Love, the title of which reflects a remark she made about the inscription she wants for her tombstone. Based on the portrait that emerges of her in the show, it is understandable that the corrosive potency of narcissism encircles her self-image. \n\nConrad RicamoraPhoto by Billy Bustamante, Matthew Murphy, and Evan ZimmermanEspecially in the first half, she is portrayed as a naïve young woman who is wooed first by Ninoy Aquino (Conrad Ricamora), who would eventually become her bitter political rival, and later by Ferdinand Marcos (Jose Llana), whom she marries and stands alongside as he seizes power and rules with an iron fist. As the years fly by, we see her become increasingly corrupted, while maintaining the delusion that she is only doing it for her people.\n\nBoth Ricamora and Llana are brilliantly recreating their roles from the Public Theater production, as is Melody Butiu as Imelda's childhood friend Estrella, who unfortunately finds herself facing Imelda's wrath. But it is this production's Imelda, portrayed by Arielle Jacobs, who steals the show. Jacobs, a former \"Princess Jasmine\" in Aladdin, carries the lioness's share of onstage time, managing with great aplomb and talent her performance of 14 of the show's songs (splendidly choreographed by Annie-B Parson), while slipping in and out of at least that number of Clint Ramos' multitude of colorful costumes. Also on hand, and giving a deeply moving performance as Ninoy Aquino's mother Aurora, is Lea Salonga (currently only scheduled to appear through August 13).\n\nBy any measure, Here Lies Love is a perfectly crafted, thrilling production that should make audiences very happy indeed. The only sour note is that, in real life, Imelda Marcos remains free as a bird despite being convicted and sentenced to prison for graft and corruption. And to pepper the stew even more, the current President of the Philippines is her son, Ferdinand Marcos Jr. It certainly adds a tone of irony to the proceedings while we dance the night away.\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n                  \n\n                                                  \n                \n              \n            \n          \n        \n      \n    \n  \n\n\n\n\n\n\n\n\n    \n    \n    \n                \n                \n                \n\n            \n             \n            \n                \n                    \n                        Share:",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 985,
  "archivePath": "data/archives/reviews/here-lies-love-2023/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:42:59.048Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250605034935",
  "archiveOrgUrl": "http://web.archive.org/web/20250605034935/https://www.talkinbroadway.com/page/world/HereLiesLove.html"
}