{
  "showId": "here-lies-love-2023",
  "outletId": "theaterlife-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://theaterlife.com/here-lies-love-1-2/",
  "publishDate": null,
  "fullText": "July 27, 2023: Ten years ago, I was standing on the crowded floor of a modestly-sized space at Off Broadway’s Public Theatre with a couple of hundred other human sardines, feeling the beat of a rocking disco-like score, originally produced as a concept album three years earlier. We were watching Here Lies Love, a mostly sung-through musical about the rise and fall of Imelda Marcos, world-famous Filipino political leader and glamorous celebrity figure. Bopping along next to me was one of its brilliant creators, the white-suited David Byrne, of the Talking Heads, who had conceived the show, composed its music (with Fatboy Slim), and written its lyrics. Large yellow ear plugs were provided as protection from the music’s eardrum-shattering volume. July 27, 2023: Ten years ago, I was standing on the crowded floor of a modestly-sized space at Off Broadway’s Public Theatre with a couple of hundred other human sardines, feeling the beat of a rocking disco-like score, originally produced as a concept album three years earlier. We were watching Here Lies Love, a mostly sung-through musical about the rise and fall of Imelda Marcos, world-famous Filipino political leader and glamorous celebrity figure. Bopping along next to me was one of its brilliant creators, the white-suited David Byrne, of the Talking Heads, who had conceived the show, composed its music (with Fatboy Slim), and written its lyrics. Large yellow ear plugs were provided as protection from the music’s eardrum-shattering volume. The immersive experience, built around an important story of autocratic political overreach (consider it a disco-inspired Evita, but with a less romantically treated heroine), was staged by Alex Timbers in an exciting style that employed movable stages amid the teeming throng, shifting the audience around as needed within a matrix of technically complex lighting and video images. A little more than 40 audience members viewed the show from seats set into the perimeter. Memorable as the show was, even more so was the title song, “Here Lies Love,” whose rhythmic refrains rattled in my head for weeks. Unfortunately, in the show’s spectacular new uptown version, that earworm of a song comes and goes early on, leaving no resounding reverberations. Am I wrong to wonder if any reprises were cut in the interests of time? Otherwise, the 90-minute show, with a splendid all-Filipino-descended company, is as vibrant as ever. Its expansion into a supercharged production required the remarkable transformation of the Broadway Theatre (which has undergone similar renovations, like those for Dude and Candide in the 1970s) into a Studio 54-like discotheque, with 800 standees and 300 viewers seated on the sides and in what remains of the old mezzanine. (One of its scenes actually takes place in Studio 54.) If you look hard enough, you can glimpse elements of the 1924 venue’s architectural beauty through the interstices in David Korin’s awesome modern construction, which includes performance spaces wherever you turn. The standing audience is frequently on the move, guided by ushers in special costumes holding lighted wands like those used at airports to help pilots park their aircraft. Given the show’s immersive nature, you sometimes have to keep looking everywhere to locate the actors; you might be concentrating on one corner of the space before realizing there’s someone dancing or singing only a few feet away in another. I chose to sit this time, rather than stand, which gave me a perimeter seat on an elevated level that provided a good view of much of the action, but a few far corners proved blind spots. The chairs are movable, so, to see better what’s below you have to move your chair closer to the barrier in front of you and lean over. I had to keep gripping my glasses, of course, for fear they’d fall into the maelstrom below. A great deal of the show is taken up with participatory activity—you’re often invited to stand and move to the beat—so the emphasis is generally on having a good time and getting into the spirit of things. This means that, regardless of the inherent interest in the history being told, the sequence of cleverly staged numbers (Alex Timbers directing again, with Annie B-Parson repeating as choreographer) becomes more about how entertaining they are than how powerfully they reach you on an emotional or intellectual level. I don’t recall being particularly moved when I was part of the crowd, but viewing the show and its grooving masses—whose pliability carries a chilling message of its own—from a raised position only further objectified the experience, making it as much about the event’s awesomeness as anything deeper. Which isn’t to say that the story of small-town beauty queen Imelda Marcos (Arielle Jacobs) isn’t intrinsically fascinating, with its tale of a woman we at first take to our hearts only for her to become corrupted by wealth, vanity, and power. The high points are here, including Imelda’s relationship with the woman, Estrella Cumpas (Melody Butiu), who cared for her and her siblings, and who later turns against her; Imelda’s romance with liberal politician Ninoy Aquino (Conrad Ricamora); her marriage, after an 11-day courtship, to World War II hero and future strongman politician Ferdinand Marcos (Jose Llana); their politically fraught reign after he’s elected president, marked by wasteful spending and social problems; the tapes that exposed Marcos’s extramarital affair; his declaration of martial law and his incarceration of his nemesis, Aquino; Aquino’s assassination; Marcos’s illness; and the 1986 overthrow of the Marcos regime by the People’s Power Revolution, leading to the presidential couple’s being forced to flee their native land. This is a lot to encompass when exposition is limited to projections and lyrics often based on actual statements by the principals. It’s a credit to the stunningly creative team that they’re able to convey so much so concisely. It’s also almost impossible not to watch with a creeping awareness of how something akin to the Marcos narrative, in which democracy is threatened by rightwing populism, is possible here, a message that, despite its obviousness, gets an applause-generating reminder from the show’s narrator-like “DJ” (Moses Villarama) toward the end. Remember, Imelda Marcos, now 94, eventually returned to the Philippines, was elected to high public office, and retired only four years ago. Her son, Bongbong, is currently president. Try putting such an eventuality into the context of the United States 10 or 15 years down the line and see if your stomach doesn’t turn. Here Lies Love has put together a solid company of artists to convey its message, led by the gracefully expressive, full-throated Arielle Jacobs (Aladdin, High School Musical) as the black-haired, power-hungry fashionista known for her vast collection of shoes, a reference surprisingly absent from the show. Her costars are equally well cast, and there’s the added delight of Lea Salonga (Miss Saigon). Playing Ninoy Aquino’s mother, Aurora, Salonga—reportedly to be present only for the early weeks of the run—makes her every note count when she sings the heartfelt “Just Ask the Flowers,” honoring political martyrs. Justin Townsend’s breathtaking lighting uses so many diverse instruments it’s practically an expo for the state of modern theatre and concert lighting, while Peter Nigrini’s ceaselessly imaginative projections do the same for his area of expertise. Thanks to M.L. Dogg and Cody Spencer’s sound design I needed to cup my hands over my ears only once, while the brilliant, multitalented Clint Ramos once again provides costumes that are to die for. Here Lies Love, words said to have been spoken by Imelda Marcos over the coffin of her husband, may not be perfect; not all its songs work the same magic, and the one I liked best from the show’s 2013 original no longer claims predominance. But Here Lies Love is nonetheless an “event,” and given its easily digestible score, its historical pertinence, its abounding energy, and its unforgettable ambience, I think it’s going to be loved for quite a while. Here Lies Love ****1/2Broadway Theatre1681 Broadway, NYCOpen runPhotography: Billy Bustamante, Matthew Murphy and Evan Zimmerman (2023)",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1328,
  "archivePath": "data/archives/reviews/here-lies-love-2023/theaterlife-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:46:22.440Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}