{
  "showId": "here-lies-love-2023",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Juan A.",
  "url": "https://www.theatrely.com/post/here-lies-love-still-shines-and-shimmies-review",
  "publishDate": "July 20, 2023",
  "fullText": "Arielle Jacobs and Company | Photos: Billy Bustamante, Matthew Murphy, and Evan Zimmerman\n\nWhat I knew then as the experimental David Byrne/Fatboy Slim disco musical about Imelda Marcos might have been the first off-Broadway show I ever saw and, in 2013, Here Lies Love did not disappoint. In fact, it still ranks highly as one of my favorite ever theatrical experiences—a standard that was upheld when I caught the Public Theater’s remount the following year. It’s been a decade of following fits and starts, wondering if Broadway would or could ever be ready for such a formally inventive, and thematically audacious, musical.\n\nArriving at the Broadway Theatre, Here Lies Love proves itself more than a gimmick, or an Obama-era flash in the pan: it’s a spectacular look at celebrity, vanity, and power, undergirded by a nonstop parade of danceable, singable hits. It’s still a bit heady, and anyone unfamiliar with the basics of late-20th century Filipino politics would do well to read the Playbill insert, as it rushes through nearly 40 years in the life of Imelda Marcos (Arielle Jacobs), the poor pageant girl turned First Lady to the power-obsessed Ferdinand (Jose Llana), whose dictatorship gripped the country for over two decades.\n\nJacobs imbues Imelda with a shimmery veneer under which runs a deep teenage pettiness, perpetually stuck, as she sings in the venomously sweet, “The Rose of Tacloban,” cutting out magazine models’ faces and replacing them with her own. Reprising their roles, Llana, who was born under the actual Marcos’ brutal martial law, plays Ferdinand as a slimy opportunist and the diametric opposite of Conrad Ricamora’s sweet, nerdy revolutionary Ninoy Aquino, Ferdinand’s rival and Imelda’s one-time boyfriend. Lea Salonga briefly joins the cast for a powerhouse 11 o’clock dirge that signals the end of the Marcoses’ reign, jutting out into the dancing audience—did I mention the best seats are.. not seats?—which reconfigures itself amid David Korins’ clubby set.\n\nDespite Imelda’s glossy facade, Here Lies Love does not rest on its surfaces. Though, with Alex Timbers’ immersive, dynamic direction, Annie-B Parson’s kinetic choreography, Clint Ramos’ specific, dance-ready costumes, and Justin Townsend’s lighting, it easily could. But Byrne’s concept, impeccably executed through his lyrics, and the music he co-wrote with Fatboy Slim, is a digestible, hip-shaking challenge. With most of its lyrics lifted directly from actual words spoken by its subjects, it asks us to keep a critical eye, even as we’re bombarded with feel-good slogans and unchecked vanities, made doubly dangerous by the Studio 54 beats underneath. It asks us to embody the ambition, mendacity, and ruthlessness we carry with us, even when we think we’ve danced them off, and question our complicity. After the non-stop party, the show’s sobering end reminds us that dancing can be as inattentive as it is cathartic.\n\nHere Lies Love is in performance at the Broadway Theatre on Broadway in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "dtliExcerpt": "It asks us to embody the ambition, mendacity, and ruthlessness we carry with us, even when we think we’ve danced them off, and question our complicity. After the non-stop party, the show’s sobering end reminds us that dancing can be as inattentive as it is cathartic.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/here-lies-love-bway/",
  "needsScoring": true,
  "textWordCount": 590,
  "archivePath": "data/archives/reviews/here-lies-love-2023/theatrely--juan-a-_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:49:45.263Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee"
}