{
  "showId": "here-lies-love-2023",
  "outletId": "vulture-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.vulture.com/2023/07/theater-review-here-lies-love-marcos-byrne-fatboy-slim-broadway.html",
  "publishDate": null,
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nOn the dancefloor in Here Lies Love.\n                  Photo: Evan Zimmerman\n              \n            \n              \n        On the dance floor of Here Lies Love, the musical for which the Broadway Theatre was remade into a disco, you’ll often find yourself just a few feet away from the show’s three main characters, who appear on platforms above the audience, singing songs built out of political sloganeering. You’re also face-to-face with another class of performers. As the musical follows the rise of Imelda Marcos, first lady of the Philippines, a group of employees in pink jumpsuits shuffle through the stage doing crowd control—nudging people to face the right direction for a character’s entrance, or clearing a path for another performer to zip through the audience before breaking into song. The show sets the Marcoses’ rule in a club (Imelda frequented Studio 54 and had a mirror ball installed in her Upper East Side townhouse), which puts the nimble, silent, and very capable jumpsuited crowd managers in a fascinating dramaturgical position. I kept thinking of them as little avatars of the show’s authors assembling together the facts into a narrative, or Marcos-era enforcers, or physical embodiments of American meddling abroad, keeping the regime running as long as it benefits overseas interests. They’re here to make sure you have a good time with some bad people.\n\nThanks in part to their hard work, Here Lies Love is a great, unsettling time. The show originates with David Byrne, who conceived an album built around Imelda’s story with lyrics largely excerpted from her and other political figures’ interviews and speeches, laid juicy get-on-your-feet hooks devised in collaboration with Fatboy Slim. The resulting music is irresistible to a totalitarian degree. The title song references the phrase Imelda (still alive at 94) has said she wanted on her gravestone, and starts out with her diaphanous platitudes about her humble upbringings before it hits a chorus that hints at her megalomaniacal ambitions and practically begs everyone to sing along. The point, as elsewhere in the show, is to get the audience grooving with the synthy messaging of dictatorship, with enough moral dissonance to make your stomach churn as your feet keep moving—a that’s how they get you parable.\n\nThe Off Broadway version of Here Lies Love, which had two runs at the Public Theater from 2013 to 2015, ended with a grand, straightforward reprise of that Imelda solo. This time, it’s rightly been cut so the emphasis falls more on the People Power Revolution that marked the end of the Marcoses’ regime in 1986. That’s not the only place where the producers, Byrne, and director Alex Timbers—perhaps cashing cred from his movie-to-musicals Moulin Rouge! and Beetlejuice to help get this older work to Broadway—have anxiously, defensively worked over the text. The DJ (Moses Villarama), introduced as a grandly amoral emcee taking the crowd from Manhattan to Manila, now has a brief due-diligence line noting that Imelda’s son, Ferdinand “Bongbong” Marcos Jr., returned to the family to power in 2022. Your Playbill comes with an insert timeline of the history, and there are infographics on the digital screens in the lobby. Here Lies Love itself has barely any dialogue, instead leaning on Peter Nigrini’s projections to provide crucial facts. Look to the side of the stage between songs for text that explains when and where the current piece of narrative takes place, and often, what you should be feeling about it.\n\nHedonism and didacticism are oil and water, and the trick of Here Lies Love involves keeping the show moving quickly enough to generate a frothy emulsion, the critical suspended within the superficial. Timbers makes sure there’s almost always something to catch your eye; the actors always seem to be entering the dance floor suddenly and from unexpected angles, wearing costumes by Clint Ramos that always seem to come with show-stopping tearaway reveals. A standout sequence of the so-wrong-it’s-right variety involves ensemble members’ donning party masks of world leaders to dance along with Imelda and the crowd, a lesson in disco and its soft power.\n\nThat’s a tough tone to sustain, and when it breaks, it breaks toward the breezy and even blithe. The show charts a nearly jukebox-bio-musical arc for Imelda herself, with Arielle Jacobs playing her from new-to-the-city ingenue through to disillusion with her marriage to Ferdinard and demagoguery. It’s a shallow vision of Imelda’s interiority—Annie-B Parson’s choreography includes mannered gestures of Imelda downing pills—that thematically fits her public shallowness. It also elides the harshest aspects of her rule, and is clearly hard to play. Jacobs, who’s new to this production, seems unsure how much sympathy to lend Imelda, which is understandable considering that the whole thing can’t quite make its mind up about her. On the question of whether she’s naïve or calculating, the show tries to have it both ways. But Jacobs gets a grip on Imelda once she turns icier, becoming a spidery Norma Desmond/Donna Summer, glittery and vampiric. Her unforgiving final moments, in which Imelda demands “Why Don’t You Love Me?” to an unsatisfied populace, come off like the wicked witch melting, making you ponder musical theater’s long love affair with belting strong women whose names end in A (Evita, Elphaba, Elsa, et cetera).\n\nPerhaps it’s right for a show so ambivalent about its central figure that the supporting cast tends to overwhelm her. Jose Llana, as Ferdinand, and Conrad Ricamora, as opposition leader Ninoy Aquino, both returning to roles they played at the Public, are better locked in. Llana ups the slime, roping audience members into video appearances for his campaign, while Ricamora provides the show with a bristling conscience. Right near the end of the intermission-less 90-minutes, Ninoy’s mother, Aurora, arrives for a solo that reorients the piece around popular democratic uprising. At my performance, and for the next month, Lea Salonga lent her star power to play Aurora. She sounds incredible, as you might expect, though I think it will work well to have a less recognizable name effect that 11 o’clock shift of power (is the only way out from diva rule another diva?). And Here Lies Love has plenty of talented actors to showcase in its all-Filipino cast. Melody Butiu, as Imelda’s discarded caretaker and childhood friend Estrella Cumpas, is especially poignant, with a powerful voice to match. She also has my favorite gesture of the show, which comes while Estrella watches through a bit of fencing as Imelda’s wedding celebration passes by. When Butiu moves around the dance floor to sing another verse, she simply carries the fence with her on the platforms around the audience and then starts into the next verse, as if still trapped on the other side.  In the midst of so much Broadway-scale pomp, you get something human-size.\n\nThe matter of scale ends up being crucial to Here Lies Love. Audience members can choose between standing on the disco floor and sitting in a conventional seat in the galleries and mezzanine. I was on the floor, feeling as though the best way to evaluate it would be to experience the most immersive version possible—even then, it doesn’t ask too much of you, as long as you dance a bit, move around when the platform at the center starts to turn, and occasionally cheer on a campaign you probably shouldn’t endorse. But people I’ve talked to who saw it from the galleries and mezzanine said they appreciated the bird’s-eye view of the choreography below them, all carefully managed by those ushers in pink jumpsuits. More than Imelda, the crowd itself is Here Lies Love’s main character, this mass of people looking to be appeased by a good performance, no matter who’s singing the political karaoke. The show ends with democracy, but it has a wary relationship with the masses. The thought may be that, lured by a beat good enough, they’ll dance along to anything.\n\nHere Lies Love is at the Broadway Theatre.\n\nShow \n      \n    \n    Leave a Comment\n  \n\n\n\n      Here Lies Love Is an Unsettlingly Good Time\n\n\n\n  \n  \n\n\n  \n\n\n\n        Things you buy through our links may earn Vox Media a commission.\n\nThis email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n\nPassword must be at least 8 characters and contain:\n\nYou’re in!\n        As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.\n\nThis email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n\nPassword must be at least 8 characters and contain:\n\nYou’re in!\n        As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.",
  "isFullReview": true,
  "dtliExcerpt": "“...the crowd itself is ‘Here Lies Love’s’ main character, this mass of people looking to be appeased by a good performance, no matter who’s singing the political karaoke. The show ends with democracy, but it has a wary relationship with the masses. The thought may be that, lured by a beat good enough, they’ll dance along to anything.”\n\nRead more",
  "originalScore": null,
  "assignedScore": 85,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1475,
  "archivePath": "data/archives/reviews/here-lies-love-2023/vulture-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:28:56.983Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250428193044",
  "archiveOrgUrl": "http://web.archive.org/web/20250428193044/https://www.vulture.com/2023/07/theater-review-here-lies-love-marcos-byrne-fatboy-slim-broadway.html",
  "scoreSource": "extracted-strong-positive",
  "scoreConfidence": "medium",
  "extractedPhrase": "raves"
}