{
  "showId": "west-side-story-2020",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2020/02/20/west-side-story-damp-desolate-and-usually-distracting/",
  "publishDate": "2020-02-20T19:46:11",
  "fullText": "No arguments: West Side Story is an enduring masterwork of musical theater.\n\nConfirming its resilience as a classic, West Side Story pretty well endures the harsh treatment it gets from Ivo van Hove, the director, who evidently intends to deliver a Broadway production that reflects our currently miserable and distracted times.\n\nThis latest revival opened on Thursday at the cavernous Broadway Theatre, built in 1924 as a movie palace. Since van Hove’s staging almost ceaselessly presents the musical’s physical action against enormous projections of live and pre-recorded video, it is the perfect house for just such an attraction.\n\nYou likely are familiar with the details of the Arthur Laurents storyline drawn from Romeo and Juliet and the terrific Leonard Bernstein-Stephen Sondheim score, so we’ll move along, yes?\n\nAs the show begins, a live shot pans across the actors depicting the Sharks and the Jets. Their close-up faces and bodies loom large along the theater’s back wall. Everybody is dressed in scruffy 2020 streetwear, displays tattoos all over, and appears to be smoldering away in extremely bad moods.\n\nNot so incidentally, the two gangs are peopled mostly by young performers of various color, and since their clothes sport no insignia, it’s a challenge to tell the warring factions apart. Probably this casting is meant to signify the multi-cultural mix of today’s conflicted population.\n\nPossibly you have heard that “I Feel Pretty” and the “Somewhere” ballet have been eliminated, the lyrics used for the “America” number are the acrid movie version, and Jerome Robbins’ original choreography has been jettisoned here. All true. Swiftly performed and sans an intermission, the show runs a grim 105 minutes.\n\nDwarfed by their vast video selves or slow-mo panoramas of bleak Bronx streets, the performers energetically rumble through plenty of writhing, mostly low-on-the-floor choreography by Anne Teresa De Keersmaeker. Some of these moments are projected onscreen from overhead camera angles, like an old Busby Berkeley number.\n\n“Gee, Officer Krupke” is performed against a video montage of courtrooms, jails, and police brutality. The “America” montage presents sweet and sour images of Puerto Rico and Manhattan today.\n\nSometimes the performers leave the stage entirely and can be glimpsed only through video: What was formerly known as the Bridal Shop (cited in the program here as the Sweatshop) and Doc’s drugstore are realistically depicted within inset stages that only the cameras can capture. There is no balcony onstage for the “Tonight” balcony scene, but a backstage area has been remade into the apartment where Maria and Anita dwell for the camera to project live onscreen.\n\nExtensive use of live video projections is characteristic of van Hove’s directorial style, and so is rain. Here the rains begin during “The Rumble” sequence and pour down intermittently for the remainder of the show. Sometimes lighted in toxic yellow, this West Side Story looks entirely desolate.\n\nThe relentless misery of the director’s gloomy interpretation of the musical scarcely allows for any contrasting moments of joy or sweetness as Tony and Maria discover each other and fall in love. The show’s most striking moments are those involving conflict, as when an embracing Tony and Maria literally are torn away from each other by the opposing gangs.\n\nSomething should be said about the performances, but there’s little to mention except that everybody, lead players and ensemble members, render their character’s music, motions, and emotions capably enough. The shows that van Hove directs usually are cool in temperature, and this one is no exception. No hot young stars blaze forth in the production’s damp firmament here.\n\nStill, the Bernstein-Sondheim score remains beautiful and touching to hear, and music director Alexander Gemignani mostly conducts it at a quick clip that moves the show along neatly.\n\nI suspect that younger viewers will appreciate this production more than others. Raised on video games and computer screens, they are less likely to find the nearly wraparound video of the staging as distracting as their elders might. And, of course, newcomers to the musical are likely to be struck by the loveliness of the score and the urgent nature of its story.\n\nBy the way, should anyone have the urge to see this rather doleful rendition of West Side Story, best viewing is in the front mezzanine, from where the dance patterns can be seen across the deck.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial"
}
