{
  "showId": "west-side-story-2020",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2020/legit/reviews/west-side-story-review-broadway-ivo-van-hove-1203507979/",
  "playbillVerdictUrl": "https://variety.com/2020/legit/reviews/west-side-story-review-broadway-ivo-van-hove-1203507979/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "Feb 20, 2020 5:00pm PT \n\n \n\n \n \n \n\n \n\n \n ‘West Side Story’: Theater Review\n \n \n\n \n\n Director Ivo Van Hove dares to fiddle with perfection in this modernized but still respectful re-working of Jerome Robbins’ 1957 masterpiece.\n\nWhittled down to one hour and forty-five minutes, “West Side Story” – with book by Arthur Laurents, music by Leonard Bernstein, lyrics by Stephen Sondheim, and choreography by Jerome Robbins — has grown exceedingly dark and mislaid some of its moving parts in the new Broadway revival from edgy Belgian director Ivo Van Hove. (Can you bear to lose “I Feel Pretty”?) But the plot of this beloved musical remains intact: We are still witnessing the deadly ethnic-fueled violence of two rival street gangs destroy the Romeo-and-Juliet romance of those immortal young lovers, Maria and Tony.\n\nWith her soaring soprano and beguiling air of innocence, newcomer Shereen Pimentel makes a sweet and touching Maria, who dares to defy the strict social codes of her Puerto Rican family when she falls in love with a local gang-banger. Isaac Powell, blessed with a true voice and a rare quality of gentle masculinity, makes Maria’s teenaged lover, Tony, seem even more vulnerable than she is. Their glorious love songs, “Somewhere” and “Tonight,” would melt the most frigid of hearts.\n\nOther key figures in the tragedy are played with conviction and style. Amar Ramasar, cast as Bernardo, leader of the Sharks, and Dharon E. Jones, his scary counterpart for the Jets, are both attractively menacing, especially in An D’Huys’ battle-ready costumes and sporting the intimidating tattoos designed by Andrew Sotomayor.\n\nBernardo’s feisty girlfriend, Anita, gives off sparks in Yesenia Ayala’s bold-as-brass performance, most notably in the exuberant “America” and in her piercing take on “A Boy Like That.” But there are no flies anywhere on this dynamic — and unusually youthful — company. In fact, this younger ensemble feels like the most contemporary element in the whole production. If this show doesn’t entice a young audience into the theater, nothing will.\n\nOf primary interest, however, is the choreography. Anne Teresa De Keersmaeker had some chutzpah to re-think the traditional moves associated with Robbins. Although not without grace, her own style is less balletic, more athletic, and occasionally even brutal — an authentic style for our own era. At times, the corps even takes on the function of a Greek chorus. As Tony and Maria sing “Somewhere,” the fractured movements of the looming chorus make a stunning visual statement about how alienated these kids really are from their fiercely oppositional social groups.\n\nThere’s no doubt that the sensibility has shifted in this revival, but not enough to seem theatrically radical. Although we no longer seem to be in the 50s, the modern elements are mainly structural, like the gigantic scenic projections (designed by Luke Halls) on the back wall. At first they seem intrusive, more aggressive than enlightening because they’re competing with, and often overwhelming, the stage action below. They become integral to the show only when they reveal things we can’t see for ourselves, like the confidential exchanges between Maria and Anita in the back room of Doc’s Drugstore, and the electrifying night run that Tony takes on the rain-slicked streets of Hell’s Kitchen.\n\nMost of the updating is modest enough. No one pulls out a cell phone to call for reinforcements for the rumble, though one kid is spotted using an ATM. But there seems to be no rationale for fiddling with the time frame in the first place. The 50s were a dark and dangerous era in New York City. Nowadays, you have to go north of Fort Washington to find any meaningful gang action, and the only real competition on the West Side is between Zabar’s and Fairway.",
  "isFullReview": true,
  "textWordCount": 618,
  "archivePath": "data/archives/reviews/west-side-story-2020/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T18:50:51.362Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 618,
  "tierReason": "Full review text",
  "bwwExcerpt": "There's no doubt that the sensibility has shifted in this revival, but not enough to seem theatrically radical. Although we no longer seem to be in the 50s, the modern elements are mainly structural, like the gigantic scenic projections (designed by Luke Halls) on the back wall. At first they seem intrusive, more aggressive than enlightening because they're competing with, and often overwhelming, the stage action below. They become integral to the show only when they reveal things we can't see for ourselves, like the confidential exchanges between Maria and Anita in the back room of Doc's Drugstore, and the electrifying night run that Tony takes on the rain-slicked streets of Hell's Kitchen.",
  "bwwScore": 8
}
