{
  "showId": "33-variations-2009",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2009/legit/reviews/33-variations-1200472233/",
  "publishDate": "March 9, 2009",
  "fullText": "\"Sex at teatime!\" protests Mary Whitehouse, the British teacher and housewife who launched a one-woman crusade against smut televised by the BBC in the 1960s. As played by Julie Walters, \"Filth\" is a surprisingly affectionate and sympathetic portrait of a character who easily could have been presented as a priggish scold. Instead, Walters' Whitehouse is in the tradition of cinematic heroines like Erin Brockovich and Norma Rae, taking on an outsized establishment -- even if her cause is wanton profanity and depictions of sex. Given the unending culture wars, it's a timely and utterly timeless tale. “Sex at teatime!” protests Mary Whitehouse, the British teacher and housewife who launched a one-woman crusade against smut televised by the BBC in the 1960s. As played by Julie Walters, “Filth” is a surprisingly affectionate and sympathetic portrait of a character who easily could have been presented as a priggish scold. Instead, Walters’ Whitehouse is in the tradition of cinematic heroines like Erin Brockovich and Norma Rae, taking on an outsized establishment — even if her cause is wanton profanity and depictions of sex. Given the unending culture wars, it’s a timely and utterly timeless tale. Whitehouse was basically the British answer to Terry Rakolta, the Michigan housewife who waged a one-woman battle against the then-fledgling Fox network over “Married … With Children.” As so often happens, the campaign largely backfired, helping publicize a show that proceeded to run for 37 years (or perhaps it merely seemed to). First espied racing around on her bicycle, Whitehouse initially looks a bit like Elmira Gulch, the witch’s alter ego in “The Wizard of Oz.” Yet this whimsical production by director Andy de Emmony (who just did “Masterpiece’s” “God on Trial,” completely on the opposite end of the tonal spectrum) and writer Amanda Coe paints her like any crusader bucking an unfeeling system — here, a boundary-pushing BBC led by Sir Hugh Greene (Hugh Bonneville), which haughtily ignored outside criticism. As a teacher, Whitehouse is convinced that sex and foul language are having a toxic effect on kids (sound familiar?), insisting that they should not be “confronted by a tide of filth, violence and degradation” when they turn on the TV. That said, she’s a wonderfully human character — anxious about public speaking, wounded at being ridiculed in a satiric sketch show, loving with her patient husband Ernest (the excellent Alun Armstrong), and amusingly naive. At first, she christens the campaign Clean Up National TV, before Ernest gently notes that the acronym might not convey the proper message. Although the movie doesn’t necessarily take Whitehouse’s side as she rails against things like the lyrics of “I Am the Walrus,” “Filth” never for a moment questions her motives. Right or wrong, she is convinced that curbing TV will aid society and is appalled by the growing sense of permissiveness in the ’60s. Walters turns in a marvelous performance, with the one drawback being that there’s not much else going on around her. Still, it’s a breezy reminder that the war to delineate standards for entertainment has spanned not just generations but borders, and that even without much sex, violence or vulgarity, something like “Filth” can be a jolly good time. A Variety and iHeartRadio Podcast",
  "isFullReview": true,
  "dtliExcerpt": "Jane Fonda makes a triumphant return to Broadway after a 46-year absence in Moises Kaufman's '33 Variations,' a meditation on obsession, legacy and the mysterious creative process.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Jane Fonda makes a triumphant return to Broadway after a 46-year absence in Moises Kaufman's '33 Variations,' a meditation on obsession, legacy and the mysterious creative process.",
  "contentTier": "complete",
  "contentTierReason": "Short text (27 words)",
  "textWordCount": 537,
  "archivePath": "data/archives/reviews/33-variations-2009/variety--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T07:18:39.228Z",
  "fetchMethod": "browserbase",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 1.5,
      "method": "browserbase",
      "success": true
    }
  ],
  "fetchTier": 1.5,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "browserbase",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 537,
  "tierReason": "Full review text"
}