{
  "showId": "twelfth-night-2013",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "Frank Scheck",
  "url": "https://www.hollywoodreporter.com/review/twelfth-night-theater-1131005",
  "playbillVerdictUrl": "https://www.hollywoodreporter.com/review/twelfth-night-theater-1131005",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Normal\n 0\n \n \n \n \n false\n false\n false\n \n EN-US\n X-NONE\n X-NONE\n\nIllyria has never been so welcoming, or so heavily populated, as it is in the free production of Twelfth Night being presented at Central Park’s Delacorte Theater. A revised version of the Public Works’ musical adaptation previously seen in 2016, this freewheeling version of Shakespeare’s classic comedy proves a consistent delight. Purists may blanch, but everyone else will be thoroughly charmed by an interpretation that also serves as an excellent Shakespeare start-off for younger theatergoers.\n\nThe basic bones of the cross-dressing, mistaken-identity tale are contained in this 90-minute truncated version conceived by playwright and co-director Kwame Kwei-Armah and composer Shaina Taub. The latter also contributes the infectious pop music score and plays the jester Feste. The fun begins even before the show starts, with audience members invited to join the cast on the expansive Delacorte stage for various games and free popcorn.\n\nThe production uses professional actors to play the lead roles, including Tony Award winner Nikki M. James (The Book of Mormon) as Viola. But the distinguishing feature is its use of non-pros in an ensemble derived from local community groups, including Children’s Aid, Domestic Workers United, Military Resilience Foundation, the Fortune Society and others. The stage is periodically filled by the “radically inclusive” cast ranging from children to senior citizens...so filled, in fact, that there are two ensembles, the “Red” and the “Blue,” who appear at alternate performances. The cast list is so voluminous you’ll need a magnifying class to read all the names in the program.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Related Story\n \n \n \n \n\n \n \n \n \n Female-Led Broadway Startup Shaking Up Theater Ticket Sales\n\nNone of this would matter if the production weren’t also entertaining. But it is, in spades, from the New Orleans-style jazz funeral that opens the show to the exuberant group musical number that ends it. There’s just enough of the plot to be explicable for beginners and just enough of Shakespeare’s language to satisfy those who’ve seen the play countless times.\n\nNot surprisingly, much of the evening’s energy is derived from the comic elements. Veteran actor Shuler Hensley (Oklahoma, Young Frankenstein) is a hoot as the drunken Sir Toby Belch, and Andrew Kober makes for a riotous Malvolio, whose humiliations in this version include being locked in a Porta-Potty that is tipped over with predictably messy results.\n\nDespite the broad humor on display, the adaptation doesn’t stint on the piece’s emotional power. James’ Viola proves very touching in her hidden love for Orsino (Ato Blankson-Wood), who doesn’t know that his new employee is actually a woman. And her joy at being reunited with her twin brother Sebastian (Troy Anthony), whom she believed had died in a shipwreck, is palpable.\n\nAmong the standout performers are Nanya-Akuki Goodrich, garnering big laughs with her larger-than-life Olivia, and Blankson-Wood, cutting a dashing figure as the oblivious Orsino. The elfin Taub, who also plays piano and serves as bandleader, is so captivating that she seems inevitably destined to become a very big star.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Related Story\n \n \n \n \n\n \n \n \n \n Summer Theater Treats: 8 Must-See Shows\n\nBut it’s the amateur performers who truly make the evening shine, their energy and enthusiasm at being onstage entirely infectious. Their ranks include cops, a mailman, martial artists, signers for the deaf and even a brass band. Co-directors Kwei-Armah and Oskar Eustis (the Public’s artistic director) deserve credit for the sheer traffic management involved.\n\nUnlike so many drab Park productions, this Twelfth Night is a visual feast as well. Rachel Hauck’s lavish palazzo and courtyard setting, complete with colored tents under which the band sits, and Andrea Hood’s wildly diverse, colorful costumes are a pleasure to behold.\n\nThere have been other musical versions of the play before, but none as giddily pleasurable as this one. “If music be the food of love, play on!” sings Taub’s Feste in the opening number. By the time the fast-paced evening reaches its conclusion, you’ll be wishing that this Twelfth Night could play on forever.\n\nVenue: Delacorte Theater, New York\n Cast: Shaina Taub, Nanya-Akuki Goodrich, Ato Blankson-Wood, Nikki M. James, Shuler Hensley, Lori Brown-Niang, Daniel Hall, Andrew Kober, Troy Anthony, Jonathan Jordan, Patrick J. O’Hare\n Playwright: William Shakespeare\n Conception: Kwame Kwei-Armah, Shaina Taub\n Music and lyrics: Shaina Taub\n Directors: Oskar Eustis, Kwame Kwei-Armah\n Choreographer: Lorin Latarro\n Set designer: Rachel Hauck\n Costume designer: Andrea Hood\n Lighting designer: John Torres\n Sound designer: Jessica Paz\n Production: Public Works\n Presented by The Public Theater",
  "isFullReview": true,
  "textWordCount": 733,
  "archivePath": "data/archives/reviews/twelfth-night-2013/hollywood-reporter--frank-scheck_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:58:34.546Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (507): Request failed with status code 507"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 733,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-04T06:31:36.453Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production at Central Park's Delacorte Theater, not the current Broadway run.; kimi: This review covers the Public Works production at the Delacorte Theater in Central Park (Shakespeare in the Park), which is an Off-Broadway/outdoor venue, not a Broadway theater.",
  "promptVersion": "5.2.0"
}