{
  "showId": "twelfth-night-2013",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/twelfth-night-review-shakespeare-in-the-park",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Between bicycles, bongs, beatboxing, and buffoonery cranked to the max, playfulness rules in director Saheem Ali’s contemporary staging. That’s a viable approach to this 400-plus-year-old play — it’s a romantic comedy, after all. Nonetheless, like the richest rom-coms, Twelfth Night can cut deep when it matters most. Separated siblings get a life-and-death wake-up call. A melancholy woman gets her groove back. Here, though, the heavy emphasis on lightheartedness mutes the more serious edges of the play that can summon deeper emotions around these key elements.",
  "bwwScore": 8,
  "contentTier": "complete",
  "fullText": "Read our review of the Free Shakespeare in the Park production of Twelfth Night starring Lupita Nyong'o, Sandra Oh, Peter Dinklage, and Jesse Tyler Ferguson. A joyful reunion is a big event in Twelfth Night, so it’s a perfect choice to mark the return of Free Shakespeare in the Park after the Delacorte Theater's 18-month renovation. Welcome back! Oscar winner Lupita Nyong’o’s spirited star turn anchors The Public Theater’s sturdy, easy-to-like production of Twelfth Night that spills over with music and a freewheeling vibe. Spelled out in giant red letters that span the stage is the play’s alternative title: What You Will. In other words, anything goes. Between bicycles, bongs, beatboxing, and buffoonery cranked to the max, playfulness rules in director Saheem Ali’s contemporary staging. That’s a viable approach to this 400-plus-year-old play — it’s a romantic comedy, after all. Nonetheless, like the richest rom-coms, Twelfth Night can cut deep when it matters most. Separated siblings get a life-and-death wake-up call. A melancholy woman gets her groove back. Here, though, the heavy emphasis on lightheartedness mutes the more serious edges of the play that can summon deeper emotions around these key elements. All those feelings are first set swirling after shipwrecked Viola (Nyong’o), who’s convinced her twin brother Sebastian has drowned, disguises herself as a mustachioed, manspreading dude named Cesario. Affairs of the heart quickly get messy for this stranger in a strange land who sometimes slips into Swahili. A gender-bending Viola falls for the strapping Orsino (Khris Davis, biceps bulging for his entourage), who yearns for standoffish Olivia (Sandra Oh), who develops the hots for Viola in drag. Sebastian (Junior Nyong’o, the star’s brother), alive and well, further complicates matters. And then there’s Antonio (b, terrific), whose feelings for Sebastian run deep. While real-life siblings as the twins is an inspired idea Viola and Sebastian’s reunion here left me surprisingly dry-eyed. Olivia’s initial grief is also underplayed, so that when she awakens to love and its multiple possibilities, it’s also undercut. She utters the play’s best line — “Most wonderful,” no spoilers for the context — and the impact isn’t as, well, wonderful as it can be. That may be nitpicking, but so be it. No quibbles with Oana Botez’s classy costumes, Maruti Evans’s animated set, and Bradley King’s vibrant lighting. All those elements combine for an exuberant end to the Night. When Viola is shipwrecked in the land of Illyria, she adopts the disguise of a man named Cesario to join the court of the duke Orsino, whom she falls for — while his would-be love, Olivia, falls for Cesario. Elsewhere, Olivia’s stuffy steward Malvolio (Peter Dinklage, an ace clown) falls prey to a prank involving a forged love letter, devised by Olivia’s hard-partying uncle Sir Toby (John Ellison Conlee), her wily maid Maria (Daphne Rubin-Vega), and noisy selfie-snapping Sir Andrew Aguecheck (Jesse Tyler Ferguson). Still elsewhere, Viola's twin brother, Sebastian, also survived the shipwreck and makes his own journey to Illyria. With its various disguises, mistaken identities, and tangled romances, Twelfth Night is a puckish yet thoughtful dive into the complexities of love and desire as well as the fluidity of gender and identity. Evergreen themes, to be sure. It’s no wonder why the play is in regular rotation at the Delacorte: This summer’s star-packed production follows ones in 2009 with Anne Hathaway and Audra McDonald, in 2002 with Julia Stiles and Jimmy Smits, and 1989 with Michelle Pfeiffer and Jeff Goldblum. Director Saheem Ali has cleverly included Elizabethan Easter eggs in his production. The vessel Viola arrives in bears the prefix WS1564, William Shakespeare’s birth year. A beach towel with the Bard’s likeness also pops up, as does a portion of the famous “All the world’s a stage” monologue borrowed from As You Like It. It’s a clever heads-up of who we ultimately have to thank for this show. In the lead-up to the show’s opening, the play has earned a 94% audience approval rating on the review aggregator Show-Score. Theatregoers have praised the acting, costumes, and LGBTQ-friendly themes. Read more audience reviews of Twelfth Night on Show-Score. Shakespeare in the Park’s starry, lighthearted revival is a serious reminder of how love often defies logic. Learn more about Twelfth Night on New York Theatre Guide. Twelfth Night is at the Delacorte Theater through September 14. Photo credit: The Free Shakespeare in the Park production of Twelfth Night off Broadway. (Photos by Joan Marcus) Originally published on Aug 21, 202522:00",
  "isFullReview": true,
  "textWordCount": 743,
  "archivePath": "data/archives/reviews/twelfth-night-2013/nytg--joe-dziemianowicz_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:58:41.357Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "wordCount": 743,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-05T15:35:23.114Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This is a review of Shakespeare in the Park at the Delacorte Theater, not a Broadway production; openai: The review is about the Free Shakespeare in the Park production of Twelfth Night, not the current Broadway run.",
  "promptVersion": "5.2.0"
}
