{
  "showId": "china-doll-2015",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Unknown",
  "url": "http://www.theguardian.com/stage/2015/dec/03/china-doll-review-mamet-and-pacinos-troubled-two-hander-falls-flat",
  "playbillVerdictUrl": "http://www.theguardian.com/stage/2015/dec/03/china-doll-review-mamet-and-pacinos-troubled-two-hander-falls-flat",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "‘Just when I thought I’d got out’: Christopher Denham and Al Pacino in a scene from China Doll. Photograph: Jeremy DanielView image in fullscreen‘Just when I thought I’d got out’: Christopher Denham and Al Pacino in a scene from China Doll. Photograph: Jeremy Daniel This article is more than 10 years oldReviewChina Doll review – Mamet and Pacino's troubled two-hander falls flatThis article is more than 10 years oldGerald Schoenfeld theatre, New YorkAl Pacino’s querulous lion routine pulls in the crowd but he’s doomed to repeat the same old shtick in Mamet’s lacklustre Broadway transfer\n\nDavid Mamet’s two-hander China Doll is really a monologue with occasional interruption. It stars Al Pacino, in querulous lion mode, as Mickey Ross, a titan of some nameless industry. In a luxurious penthouse he grouses to lawyers, hotel managers and airplane salesmen via Bluetooth, while occasionally deigning to berate his assistant Carson (Christopher Denham, in a thankless role).\n\nRead moreChina Doll has been doing extraordinarily well at the box office, which should be bemusing, but isn’t. Legions of Godfather fans still abound, and Mamet and Pacino are kind enough to indulge them. Ross never quite says: “Just when I thought I was out, they pull me back in,” but he does say, that he “dragged myself back when all I had to do was walk away” and “It’s just ‘the Old Life.’ Reaching out to drag one back.” (If a play this superfluous can be said to have a theme, this is probably it.)\n\nIt’s unclear how much Pacino is enjoying the exercise. Certainly he gravitates toward roles like this and in his prowling posture, bent at the knees, but slightly stooped at the waist, you can read the depredations of old age or the crouch of a fighter, just waiting for his chance to spring. But he often seems distracted, stuttering over his sentences. And when he works himself into high dudgeon, many of the lines feel as though they have quotation marks around them – that he is Al Pacino playing Al Pacino playing Mickey Ross, because that is what the crowd, who applaud loudly at his arrival, ostensibly want.\n\nView image in fullscreenIt’s unclear how much Pacino is enjoying the exercise … China Doll. Photograph: Jeremy Daniel/APMuch of the first act feels like throat clearing, a long limbering up to set the wheels of plot spinning. Spinning is most of what they continue to do throughout the second act until a wildly improbably finale. Ross is upset because he can’t reach his unseen fiancée, who has traveled by private plane to Toronto. Then he becomes more upset upon learning the plane has been impounded for a sales tax violation. He then learns that his fiancée has been detained and strip-searched and the upset grows. And so forth. There’s a suggestion of a great rivalry between Ross and a governor, the son of his mentor, but this mainly registers as a chance to take shots at politics in general (a couple of these are pretty funny) and liberal politicians in particular.\n\nThe director, Pam MacKinnon, has done fine work elsewhere, but here she has little success in clarifying the relationships or even the setting. Are we at an apartment or in a hotel? How much time has elapsed between the first act and the second? If Pacino had not signed on, would anyone have bothered with this at all?\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 584,
  "archivePath": "data/archives/reviews/china-doll-2015/guardian--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:35:13.102Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 584,
  "tierReason": "Full review text"
}