{
  "showId": "china-doll-2015",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2015/12/theater-review-china-doll.html",
  "publishDate": "December 1, 2015",
  "fullText": "China Doll is a play that seems to have been written in real time, with Mamet discovering what he wanted to say only as he said it.",
  "isFullReview": false,
  "dtliExcerpt": "China Doll is a play that seems to have been written in real time, with Mamet discovering what he wanted to say only as he said it.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Al Pacino is not an actor of much breadth but he stakes a narrow territory deeply, and that can be brilliant to watch onstage. China Doll, his shaky new Broadway vehicle, by David Mamet, offers flashes of that brilliance between long mucky passages in which he appears to be hunting for the narrative, if not the next line...The construction of China Doll is most peculiar. Very little conflict unreels in our presence...It's hard to figure what Mamet is up to...But eventually you can't help facing the fact that Mamet has built what plot there is around the hypocrisy and venality of liberal politicians; the story is rigged to make Mickey, of all people, a victim...Anyway, China Doll doesn't provide convincing evidence even for its own case study, and Pacino's star quality prevents us from inferring any evidence on our own...This gives the play the air of a one-percenter paranoiac fantasy...Whatever one thinks of that sort of attitude as policy, as the basis of a drama it's disastrous.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "China Doll is a play that seems to have been written in real time, with Mamet discovering what he wanted to say only as he said it.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (27 words)",
  "rejectedAt": "2026-02-03T15:29:10.622Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or quote, not a complete review with evaluative content sufficient for scoring; openai: The text provided is a single sentence that lacks evaluative content or a clear verdict on the show. It does not constitute a full review.",
  "promptVersion": "5.2.0",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://www.vulture.com/2015/12/theater-review-pacino-in-mamets-china-doll.html",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews"
  ],
  "bwwScore": 7
}
