{
  "showId": "death-becomes-her-2024",
  "outletId": "NEWYORKPOS",
  "outlet": "New York Post",
  "criticName": "Johnny Oleksinski",
  "url": "https://nypost.com/2024/11/21/entertainment/death-becomes-her-review-claws-are-out-in-broadway-camp-fest/?utm_campaign=nypost&utm_medium=referral",
  "publishDate": "November 21 2024",
  "fullText": "Johnny Oleksinski Theater ‘Death Becomes Her’ review: Leading ladies’ claws are out in funny Broadway camp fest By Johnny Oleksinski Published Nov. 21, 2024, 9:00 p.m. ET Theater review DEATH BECOMES HER .review-block-star { --review-block-star--empty-color: #585858; --review-block-star--fill-color: #000; } .review-block-star { --review-block-star--empty-color: #585858; --review-block-star--fill-color: #000; } .review-block-star { --review-block-star--empty-color: #585858; --review-block-star--fill-color: #000; } .review-block-star { --review-block-star--empty-color: #585858; --review-block-star--fill-color: #000; } Two hours and 30 minutes, with one intermission. At the Lunt-Fontanne Theatre, 205 W. 46th Street. There is a miracle elixir in the campy musical “Death Becomes Her,” which opened Thursday night at the Lunt-Fontanne Theatre. I don’t mean the nuclear-pink liquid that offers eternal youth in exchange for becoming the walking dead, but the comedy chops of stars Megan Hilty and Jennifer Simard. Simply put, they kill it. As the pair of envious, vengeful, demented and eventually deceased narcissists originally played by Meryl Streep and Goldie Hawn, the actresses wring jokes out of every letter and semicolon of Marco Pennette’s catty book. No moment is wasted — and Simard and Hilty are such no-holds-barred risk-takers that they themselves could very well be wasted. More From Johnny Oleksinski Will Timothée Chalamet and Leonardo DiCaprio score Oscar nominations? Ralph Fiennes has already delivered the craziest performance of the year in &#8216;28 Years Later: The Bone Temple&#8217;: review &#8216;Bug&#8217; review: Carrie Coon is terrifying in tense conspiracy-theory play on Broadway Their warped characters from Robert Zemeckis’ culty 1992 movie are the glamorous actress Madeline Ashton (Hilty) and dowdy writer Helen Sharp (Simard), competitive frenemies obsessed with savagely one-upping each other. So, it would seem, are Simard and Hilty. The game pair duke it out for a laugh, and the crowd laps up their verbal and actual jabs as though it’s a WWE match. (Although a quick scan around the house would suggest that nobody at “Death Becomes Her” has so much as accidentally turned on a WWE match). The audience’s howls, especially during the vastly superior first act, help distract from a slippery situation for a massive new musical: The songs by Julia Mattison and Noel Carey are mediocre. And there are far too many of them. 4 Megan Hilty and Jennifer Simard are hilarious in &#8220;Death Becomes Her.&#8221; Matthew Murphy and Evan Zimmerman Lyrics are often clever and naughty, but melody is cast aside in favor of vocal acrobatics. The sole memorable tune, the main theme, is only hummable because it’s a dead ringer for the dark title song of “Kiss of the Spider Woman.” This show’s most entertaining number is the razzmatazz second one. Helen and her doctor fiancé Ernest (Christopher Sieber, good as ever, but underused) go see Madeline in the Broadway show “Me! Me! Me!” and Hilty belts out a silly ditty called “For the Gaze,” as in, “I do it for the gaze.” If I need to tell you why that’s funny, “Death Becomes Her” is definitely not the show for you. 4 The best song, &#8220;For the Gaze,&#8221; is at the beginning of Act 1. Matthew Murphy and Evan Zimmerman Soon, mean Madeline steals Ernest from Helen and sends her hurtling into a psych ward. Ten years later, the spurned ex has mysteriously blossomed into a bombshell who graces red carpets, while the former starlet has let herself go and is trapped in a loveless, booze-soaked marriage. At a party, a smooth-talking gent notices Madeline spiraling and hands her the business card of Viola Van Horn (Michelle Williams of Destiny’s Child, deliciously dry). Viola, he says, can solve all her problems. 4 Once dowdy Helen has been mysteriously reborn — to the shock of her ex, Ernest (Christopher Sieber). Matthew Murphy and Evan Zimmerman Hilty, bubbly and barbaric, explodes with a “Rose’s Turn” called “Falling Apart,” and then Madeline is off to Viola’s mansion to drink her magic brew. Abracadabra! Suddenly, she looks 20 years younger, with luscious hair, tight skin and the radiant glow of youth. Too bad she’s also a corpse with no pulse — just like the hysterical Simard’s maniacal Helen, who’s hellbent on destroying her best friend. Zemeckis’ film, like many of his movies, was made in large part to push the limits of technology. Streep and Hawn’s body contortions and gnarly injuries won the Oscar for Best Visual Effects. Director Christopher Gattelli finds nifty ways of nodding to that legacy onstage. Using dance, drag-queen-style body doubles and illusions, the appropriately over-the-top production recreates a decapitation, an abdominal cavity caused by a shotgun, and, most famously, the 360-degree head turn. 4 Michelle Williams&#8217; Viola gives Madeline her magic elixir — that also turns her into a corpse. Matthew Murphy and Evan Zimmerman Since Act 2 narratively d...",
  "isFullReview": true,
  "showScoreExcerpt": "âEven if the musical doesnât have a discernible heartbeat, Hilty and Simard ensure Death Becomes Her stays fun and fabulous.â",
  "originalScore": null,
  "assignedScore": 62,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:00:02.702Z"
}
