{
  "showId": "death-becomes-her-2024",
  "outletId": "theatermania",
  "outlet": "TheaterMania",
  "criticName": "Zachary Stewart",
  "url": "https://www.theatermania.com/news/review-death-becomes-her-is-broadway-musical-comedy-heaven_1756248/",
  "publishDate": "November 21, 2024",
  "fullText": "Unlike the writers of so many new musicals on Broadway, Pennette, Mattison, Carey, and director-choreographer Christopher Gattelli know exactly what story they’re telling and for whom, making it explicit in the production number “For the Gaze,” which features Hilty executing a dizzying number of costume changes (she’s both Judy and Liza) while sugar-voiced chorus boys tap-dance around her.",
  "isFullReview": false,
  "dtliExcerpt": "If the blockbuster success of Ozempic tells us anything, it’s that Americans say\n\nActor Madeline Ashton (Hilty) and writer Helen Sharp (Simard) have been frenemies for as long as either of them can remember. Even though Madeline has a history of stealing Helen’s boyfriends, Helen decides to wave her new fiancé under her nose. After all, Dr. Ernest Menville (Christopher Sieber) is a stand-up guy, a plastic surgeon who only operates on the needy. But no one is needier than Madeline, who accepts the challenge and manages to snatch the good doctor away. One suspects the free Botox is a fringe benefit of the grand prize: humiliating Helen.\n\nBut as the years go by, Madeline’s youth fades and Ernest’s interest wanes. Then Helen reemerges with a smoking new body. (How did she do it?) Madeline decides to take drastic action, seeking the help of the mysterious and beautiful Viola Van Horn (the irresistibly fabulous Michelle Williams), who possesses an elixir granting eternal youth. “You and your body are going to be together a very long time,” Viola warns Madeline. “Be good to it.” And we know she won’t.\n\nNot that they need an excuse. Helen’s subsequent number, “That Was Then, This is Now,” sounds like vintage Sondheim, while her breakneck patter during the first act finale lives at the corner of rap and operetta. Mattison and Carey joyously pillage over a century’s worth of musical theater tradition to create something that feels simultaneously new and familiar.\n\nDoug Besterman’s big symphonic orchestrations sound gorgeous under the music direction of Ben Cohn, with glorious real brass and woodwinds undergirding the classic Broadway sound. Peter Hylenski’s pristine sound design ensures we can hear it all without missing brilliant lyrics like “Wrinkled wrinkled little star / Remind them who the fuck you are.”\n\nIn addition to smartly condensing and theatricalizing the screenplay, Pennette’s book is full of howlers. “Love her like a twin,” Helen says about Madeline, “who stole my nutrients in the womb.”\n\nSimard’s ultra-dry, just-under-her-breath delivery of that line has the audience in stitches. No one can wring humor out of a script quite like Simard can, but she has a formidable opponent in Hilty, who luxuriates in every beat of Madeline’s self-indulgent awfulness. Not since Bette and Joan has there been a more perfectly matched pair of actors hellbent on mutually assured destruction — and isn’t that what this audience craves? There’s a reason Andy Cohen is a multimillionaire and it’s not because he lifts women up to showcase their best selves.\n\nOf course, the exploitative relationship between women and gay men is a two-way street, as we see from Josh Lamon’s hysterical performance as Stefan, Madeline’s long-suffering personal assistant. Sieber, playing the only heterosexual male in the show, makes for a charmingly hapless dupe and serves the tiniest sliver of sincerity in this big wet poisoned kiss of a musical comedy.\n\nGattelli’s extravagant production never wavers in tone or execution, with classic Broadway showmanship selling stunning special effects. The scene in which Madeline tumbles down a large marble staircase is particularly jaw-dropping (illusions by Tim Clothier, fight direction by Cha Ramos).\n\nThe Gothic arches and funereal curtains of Derek McLane’s set extend into the house, turning the Lunt-Fontanne into a cathedral of morbid humor. Lighting designer Justin Townsend further transforms the space into a sexy and forbidding nightclub for the scenes set in Viola’s lair. Paul Tazewell costumes the beautiful ensemble in form-fitting, flesh-revealing costumes, with Anne Rice-ready hair by Charles LaPointe. It all creates the effect of a nest of sexy vampires.\n\nSpeaking of undead things on Broadway, I kept waiting for the earnest feminist duet meant to justify two-and-a-half hours of woman-on-woman crime. And in “Alive Forever,” we get an acidic twist on the cliché. Madeline and Helen are changed for good all right, but all they have to show for it is an increasingly desperate codependence. “And I know that there are things we can’t undo,” Madeline sweetly sings to Helen, “But you’ve got me / And I’ve got glue!” It’s the most realistic depiction of a marriage I’ve ever seen on a Broadway stage.\n\nGet the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nBroadway performances start on March 27 at the Majestic Theatre.\n\nGet the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nBy providing information about entertainment and cultural events on this site, TheaterMania.com shall not be deemed to endorse, recommend, approve and/or guarantee such events, or any facts, views, advice and/or information contained therein.\n\n©1999-2026 TheaterMania.com, Inc. All Rights Reserved.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-23T21:59:42.176Z"
}