{
  "showId": "death-becomes-her-2024",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Kobi Kassal",
  "url": "https://www.theatrely.com/post/death-becomes-her-is-broadway-comedy-gold-review",
  "publishDate": "November 21, 2024",
  "fullText": "A perfect rejoinder to the ubiquitous Broadway Sucks These Days gripe about the too-many movie-to-stage adaptations has arrived at long last, and it's a simple three-word response: Death Becomes Her. A virtually perfect big-budget, broad-appeal musical comedy that improves in every way over the 1992 film, director-choreographer Christopher Gattelli's wildly entertaining vehicle for two of our best singer-actor-comedians on any stage today renders the movie-as-source snipe worthless.\n\nDon't waste a minute's thought on which of the two—Megan Hilty or Jennifer Simard—come out on top with this delight of a holiday gift (let Tony voters lose sleep over that one next spring). The two work together like the ingredients of a dangerous magical potion, each delivering precisely nuanced yet stupendously big performances in amounts that, were they off by so much as a fraction, would thoroughly undo the magic.\n\nThe story follows narcissistic actress Madeline Ashton (Hilty) and her rival author Helen Sharp (Simard) competing for decades. When Madeline steals Helen's fiancé, Helen seeks revenge, leading both women to consume a mysterious potion granting eternal youth. The lead actresses deliver two delicious tour-de-force performances that are equally hilarious and enthralling, successfully inhabiting roles originally played by Meryl Streep and Goldie Hawn.\n\nChristopher Sieber plays Ernest Menville caught between the rivals, while Michelle Williams contributes superb vocal talents. Josh Lamon earns praise for his comedic turn as Madeline's assistant Stefan.\n\nComposers Julia Mattison and Noel Carey's score features big Broadway showstoppers to comical ballads, while Marco Pennette's book successfully modernizes the three-decade-old source material. Director-choreographer Christopher Gattelli, alongside designers Paul Tazewell and Derek McLane, creates a visually stunning sight to behold.\n\nThis smart, brilliant adaptation delivers one fun night of theatre, maintaining consistent entertainment throughout.\n\nDeath Becomes Her is at the Lunt-Fontanne Theatre.",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": null,
  "source": "webfetch-scraped",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-24T00:00:00.000Z"
}
