{
  "showId": "anything-goes-2011",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/reviews/anything-goes-broadway-review-172002/",
  "publishDate": "April 7, 2011",
  "fullText": "The author's Rancho Mirage abode is on the market for $2.9 million.\n\nCoffins Not Included: Sure, people are using alternative ways to sell real estate these days as housing prices nosedive, but ... Twitter? Author Anne Rice began tweeting March 22 about trying to sell her house on Thunderbird Road in Rancho Mirage, Calif. — which she bought for $3.6 million upon leaving New Orleans in 2005 — for $2.9 million, down from $3.3 million. With six bedrooms and 9,000 square feet, it's a lot of house for one person. \"Almost bedtime,\" Rice tweeted. \"I need to dream of somebody buying this house. My little writer's retreat awaits.\" She also tweeted that she has leased much smaller digs but didn't say where. And Rice is doing a Twitter yard sale of goods from her desert house; they run the gamut from $60 Ralph Lauren jackets on eBay to a collection of books for sale at the Powell's Books site. Among the offerings: Stieg Larsson's The Girl Who Played With Fire. Does the best-selling author really need to sell $20 books?\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Business\n \n \n \n \n\n \n \n \n \n Disney's New CEO Josh D'Amaro on His Vision for Company: \"I'm a Big Risk Taker\" \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n TV\n \n \n \n \n\n \n \n \n \n 'Tell Me Lies' Stars Cat Missal and Costa D'Angelo Say Season 3 Finale Will \"Blow Up the Internet\"\n\nWhen you think of Marcia Gay Harden (Pollock, Mystic River), you don't exactly think \"light\" or comedy. And when you think of Yasmina Reza's Tony-winning play God of Carnage — which starred Harden, James Gandolfini, Jeff Daniels and Hope Davis in the original 2009 Broadway production — you don't exactly think comedy, either. It's the dramatic enactment of the tear-down of two marriages. \"It's so sad, so mean ... and so funny,\" says Harden, now rehearsing the L.A. production — with the original cast — which opens for previews April 5 at the Ahmanson Theatre. \"Anger and fighting can be very funny, if you're watching from a safe place,\" she adds. \"The meaner, the funnier, is what I say.\" And is notorious tough guy Gandolfini funny? \"Hysterical,\" Harden says. \"He plays vulnerable for the first time. That alone is funny.\" Meanwhile, Harden just shot an ABC sitcom pilot called Smothered, about warring grandmothers. \"I'm playing a grandmother!\" the 51-year-old actress laughs. \"Can you believe it? Hollywood, right?\"\n\nJeremy Piven with an unidentified female companion at the new Mediterranean hot spot Fig & Olive on Melrose Place. They enjoyed a bottle of Chateauneuf-du-Pape, plus chicken and branzino. ... Al Pacino dining at Culina at the Four Seasons. ... Melanie Griffith with a vegan lunch at Real Food Daily. ... Seth MacFarlane and Jessica Stroup on the patio at Sushi Roku Santa Monica ... Over at Cecconi's, regular Walter Mirisch fighting Sidney Poitier for the check. Sidney won. Across the room, Nigel Lythgoe. ... Suzanne de Passe at Soho House; her office is in the building. ... Michael Chiklis lunching at Hugo's Studio City. ... Rick Yorn, Tim Allen and The Usual Suspects screenwriter Christopher McQuarrie lunching separately at Craft.",
  "isFullReview": true,
  "dtliExcerpt": "This gorgeous, lavishly appointed production of Cole Porter's 1934 musical comedy is a sparkling showcase for knockout performances by Sutton Foster and Joel Grey.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Foster has a unique comic presence. It's not intended as a slight to say there's nothing especially ladylike about her. With her loping gait and manly stance, she's no delicate flower, but her leggy physique and chameleon-like features allow her to vamp, camp and clown with equal conviction. She also has the rare distinction of striking up real chemistry with every co-star...The girl's definitely got it and this gorgeously sung, buoyantly staged show is bliss.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This gorgeous, lavishly appointed production of Cole Porter's 1934 musical comedy is a sparkling showcase for knockout performances by Sutton Foster and Joel Grey.",
  "contentTier": "complete",
  "contentTierReason": "Short text (24 words)",
  "textWordCount": 505,
  "archivePath": "data/archives/reviews/anything-goes-2011/hollywood-reporter--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T19:06:32.114Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 505,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T01:02:01.311Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is a gossip/entertainment news column with celebrity sightings and real estate news, not a theater review; openai: The text is about various unrelated topics, including real estate and celebrity sightings, not a review of a Broadway show.; gemini: This is a gossip column, not a review of a Broadway show. It mentions various celebrities and events, but does not provide a critical evaluation of any theatrical production.; kimi: This is a gossip column/entertainment news roundup about celebrity real estate and restaurant sightings, not a Broadway theater review. While it briefly mentions the play 'God of Carnage,' it only discusses the upcoming L.A. production in passing and provides no critical evaluation of any Broadway show.",
  "promptVersion": "5.2.0",
  "bwwScore": 9,
  "sources": [
    "web-search",
    "bww-reviews"
  ]
}
