{
  "showId": "irenas-vow-2009",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2009/legit/reviews/irena-s-vow-1200474517/",
  "publishDate": "March 29, 2009",
  "fullText": "The conviction of Tovah Feldshuh's transformative performance drives \"Irena's Vow,\" but it's the compelling true story of courage and heroism that makes Dan Gordon's by-the-numbers script so moving. Recounting the experiences of Irena Gut, a young Polish Catholic housekeeper who sheltered a dozen Jews in the basement of the German major for whom she worked during WWII, the play draws its power more from the nobility of its sentiments and the events it portrays than from the writer's over-explanatory treatment of them. Still, if the audible sobs in the theater at key moments are any indication, audiences may be willing to overlook the clunky dramaturgy.\n\nThe conviction of Tovah Feldshuh’s transformative performance drives “Irena’s Vow,” but it’s the compelling true story of courage and heroism that makes Dan Gordon’s by-the-numbers script so moving. Recounting the experiences of Irena Gut, a young Polish Catholic housekeeper who sheltered a dozen Jews in the basement of the German major for whom she worked during WWII, the play draws its power more from the nobility of its sentiments and the events it portrays than from the writer’s over-explanatory treatment of them. Still, if the audible sobs in the theater at key moments are any indication, audiences may be willing to overlook the clunky dramaturgy.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Everybody to Kenmure Street’ Review: A Timely Document of Scottish Neighbors Standing Up to Immigration Raids \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Iron Lung' Film Review: Markiplier Probes Inner and Outer Space in Sleeper Video-Game Adaptation\n\nTransferring uptown after a well-received Off Broadway run last fall, the play shuffles dramatized events and direct-address linking commentary in a manner that only partly convinces as theater. With its multiple characters and locations, the story seems a more natural fit for screen adaptation. Or, with more imaginative handling, it might have functioned as a solo show, a format that worked well for Feldshuh in “Golda’s Balcony.”\n\nBut even if Feldshuh’s Irena is the vivid center of an exposition-heavy drama otherwise populated by thinly fleshed-out characters and far too much reported action, this is an engrossing tale laced with suspense, horror and uplifting humanity.\n\nFurthering the suggestion it’s a test drive for a movie version (Gordon has a background as a screenwriter on films such as “The Hurricane” and “Wyatt Earp”), the play opens with the elderly Irena, years after emigrating to the U.S., addressing a class of high school students. As Feldshuh removes the pins from her bun and blond hair tumbles down over her shoulders, she’s suddenly a teenage nursing student back in Poland.\n\nWe quickly learn she was abducted by nine Russian soldiers and brutally raped before being repatriated to Nazi-occupied Poland and put to work in a munitions factory. Her Aryan looks and command of the German language land her a spot supervising Jewish laundry workers, and from there, she is appointed housekeeper to Major Rugemer (Thomas Ryan), the town’s senior German official. Despite the advice of a friendly co-worker (Steven Hauck) to keep her eyes down and observe nothing, Irena overhears SS officer Rokita (John Stanisci) outline the plan to systematically break down and eradicate all Jews from the area.\n\nWith one foot in memory and the other in Irena’s present, Feldshuh recounts the chilling turning point of witnessing the vicious murder of a Jewish woman’s baby in the town square before the mother herself was shot. Still shaking and breathless from the shock of the episode, she vows to do whatever she can to save lives.\n\nAs the remarkable story unfolds, we learn that, at great personal cost, Irena hid 12 Jewish adults for two years in a villa in which Nazis were being regularly entertained at dinners and parties. Director Michael Parva maximizes the many terrifying close calls by having Feldshuh step forward as if whispering conspiratorially to the audience while she recalls the difficult logistics of keeping her stowaways safe, even as word leaked out, blackmail threats were delivered and a baby was born to a couple in hiding.\n\nFeldshuh leavens her performance with disarming touches of shticky humor, deftly coloring the gravity of her experiences with the self-dramatizing flair of a born raconteuse and helping to tone down the hagiographic glow of Gordon’s character portrait.\n\nBut the figures around Irena are too sketchily drawn to resonate, many of them also played with insufficient nuance. Only the major has some complexity. A decent man who bristles at all the killing and injustice, he uses his discovery of Irena’s deception to force her to compromise herself, yet he remains a character of surprising tenderness. Again, however, the signals of his behavior might be more effectively planted via screen closeups.\n\nGordon tends to dash through key plot mechanics that might prove problematic for stage presentation, such as the movement of the Jews across town, or their delivery to partisans as the Nazis’ position collapsed. And events after the war, when Irena was interned as a Nazi sympathizer and was liberated and sheltered by the very people she had protected, are expedited into little more than footnotes.\n\nParva’s production is brisk but pedestrian, its minimal design relying too much on Alex Koch’s projections for detail and on Quentin Chiappetta’s heavy-handed score to cue emotional responses.\n\nAs is often the case in Holocaust drama, the text is not averse to moral hectoring. “You are the last generation who will hear from a living witness to the Holocaust,” Irena tells us. “You have a responsibility … every time you meet hatred, you must stand up against it.” Every time you meet bad playwriting, too. It’s a testament to the integrity of Feldshuh’s performance and of the woman she’s playing that the audience responds even while being so transparently manipulated. But there’s a difference between an inspiring story and inspired storytelling.",
  "isFullReview": true,
  "dtliExcerpt": "Tovah Feldshuh gives a commanding performance in this Holocaust drama, though the play itself feels more like an earnest history lesson than compelling theater.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Tovah Feldshuh gives a commanding performance in this Holocaust drama, though the play itself feels more like an earnest history lesson than compelling theater.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 955,
  "archivePath": "data/archives/reviews/irenas-vow-2009/variety--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:03:02.642Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 955,
  "tierReason": "Full review text"
}