{
  "showId": "rent-1996",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "http://theater.nytimes.com/2011/08/12/theater/reviews/rent-revival-at-new-world-stages-review.html",
  "publishDate": "August 11, 2011",
  "fullText": "Rent, Jonathan Larson's 1996 musical, in the revival that opened on Thursday at New World Stages. Here, the cast delivers “Seasons of Love.”\n\nMaybe they should call it \"Sublet.\" The young ensemble members who inhabit the new production of Jonathan Larson's \"Rent,\" which opened on Thursday night at New World Stages, never seem to feel truly at home. It is as if they had taken over the show for a couple of months of fun, as they might an older sibling's house on Fire Island, and are now hesitant to treat it as their own.\n\nAdam Chanler-Berat, left, and Matt Shingledecker in \"Rent.\"\n\nThese performers are, of course, only the latest of many tenants to spend time in \"Rent,\" the multi-award-winning 1996 musical about la vie boh&egrave;me in the East Village. That neighborhood was where the show first opened — at the New York Theater Workshop, to be exact — only weeks after the talented Larson's unexpected death (from an undiagnosed heart condition) at 35. And on a tidal wave of sweeping emotions and great reviews, \"Rent\" moved post-haste to Broadway, where it resided for 5,123 performances before closing on Sept. 7, 2008.\n\nThat means New York has been without \"Rent\" for a little less than three years. To use the calculations employed by the show's best-known song, \"Seasons of Love\" (which asks the musical question, \"How do you measure a year?\"), that's something like a million and a half minutes. But it seems like only about five.\n\nCome to think of it, it seems like only five minutes since I saw \"Rent\" the first time 15 years ago (more than 7,884,000 minutes), and I imagine that feeling holds true for almost anyone who was at New York Theater Workshop that February in 1996. It was one of the most genuinely dramatic — and cathartic — nights at the theater I've ever spent.\n\nGiven the very recent death of Larson — and the mixed advance word (advance word is always mixed) on his new show — we critics were afraid we'd be in the unpalatable position of having to praise faintly a \"nice try\" of a production from someone who would never have the chance try again. Then the musical started, brimming from its first notes with an urgency and insistence you associate with young people of conviction who have something they must, but must, tell you. And I at least fell into a teary trance from which I didn't emerge until well after that performance was over.\n\nLarson, it turned out, had written a show steeped in the chiaroscuro of bright young lives amid mortal shadows, and had done so with a varied, sparkling, emotionally earnest score that seemed to meld the oil-and-water of silky American show music and ragged rock into one smooth, sweet stream. And then there was the cast, directed by Michael Greif, whose every member seemed to be living exactly in the moment of the show, with that heightened individuality that comes from believing you own — nay, that you are — the part you're creating.\n\nO.K., that was the moment that was, and it's not one that's ever likely to be repeated. And since I saw \"Rent\" — both off and on Broadway — only with its original cast (I even passed on the 2005 movie version), it might be better to have a virgin pair of eyes check out this latest incarnation, which is also directed by Mr. Greif.\n\nBut to me this \"Rent\" feels neither close enough to nor different enough from the original to warrant revisiting. It is visually busier than its prototype, with jittery new choreography (by Larry Keigwin) and slapdash mood- and place-defining projections (by Peter Nigrini). It also (and I can't imagine my hearing has grown more sensitive in a decade and a half) sounds both louder and less coherent than it did before, with the careful contrapuntal strains of Larson's score sometimes collapsing into one dissonant blur.\n\nThe cast is passable but seldom more than that in roles loosely inspired by characters from Puccini's opera \"La Boh&egrave;me.\" As the love-burned, H.I.V.-positive rock guitarist Roger Davis, Matt Shingledecker glows a bit bizarrely with ruddy-cheeked, buff-bodied good health and bonhomie.\n\nAs his drug-stoked girlfriend, Mimi Marquez, Arianda Fernandez looks alluring but sings uncertainly. Adam Chanler-Berat (who was terrific on Broadway in \"Next to Normal\") comes across as too nice and easygoing to embody persuasively the self-involved, self-distancing, hyper-intellectual gonzo filmmaker Mark Cohen, the show's narrator. (Anthony Rapp, who created the part, brought a relentless, sometimes abrasive energy to the show that cut through its stickier sentimentality.)\n\nOnly Annaleigh Ashford as Maureen Johnson the performance artist (first played by Idina Menzel, if you please) adds a revitalizing grit to her role. She is more precise and funnier than was Ms. Menzel (whose strengths were of a different stripe) in evoking the particular world of downtown performance that's being satirized here. (Her \"Over the Moon\" number also inspires the evening's cleverest and most resonant use of video.)\n\nNo foreign workers should have to put up with bullying from bosses or threats of firing, or deportation, if they want to organize.\n\nThe Treasury Department should encourage working families to save, not deter them.",
  "isFullReview": true,
  "dtliExcerpt": "Maybe they should call it “Sublet.” The young ensemble members who inhabit the new production of Jonathan Larson’s “Rent,” which opened on Thursday night at New World Stages, never seem to feel truly at home. It is as if they had taken over the show for a couple of months of fun, as they might an older sibling’s house on Fire Island, and are now hesitant to treat it as their own.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "DOWN",
  "dtliUrl": "https://didtheylikeit.com/shows/rent/",
  "bwwExcerpt": "There were moments when the swirling, heart-plucking tunefulness and witty layering of Larson's score struck me anew. But without characters who are credibly grounded by the actors portraying them, the show feels slicker and more contrived than it did. (When Roger and Mark have their climactic showd...",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": null,
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "bww-roundup"
  ],
  "textWordCount": 871,
  "archivePath": "data/archives/reviews/rent-1996/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:57:02.641Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20130616223733",
  "archiveOrgUrl": "http://web.archive.org/web/20130616223733/http://theater.nytimes.com/2011/08/12/theater/reviews/rent-revival-at-new-world-stages-review.html",
  "wordCount": 871,
  "tierReason": "Full review text"
}