{
  "showId": "rent-1996",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steve Suskin",
  "url": "http://www.variety.com/review/VE1117945798?categoryid=33&cs=1&cmpid=RSS%7CNews%7CLatestNews",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "dtli"
  ],
  "bwwExcerpt": "It seems like a mere 525,600 minutes since \"Rent\" -- Jonathan Larson's ground-breaking, Tony-and-Pulitzer-winning study of East Village Bohemians -- blew out its last candle over at Broadway's Nederlander Theater. It's already back, and the news is all to the good. \"Rent\" is not so provocative as it was back in 1996, but even so, the tuner is plenty effective in its new Off Broadway guise.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-RENT-Off-Broadway-20110811",
  "contentTier": "complete",
  "dtliExcerpt": "It seems like a mere 525,600 minutes since \"Rent\" — Jonathan Larson's ground-breaking, Tony-and-Pulitzer-winning study of East Village Bohemians — blew out its last candle over at Broadway's Nederlander Theater. It's already back, and the news is all to the good. \"Rent\" is not so provocative as it was back in 1996, but even so, the tuner is plenty effective in its new Off Broadway guise.",
  "dtliThumb": "UP",
  "publishDate": "August 11, 2011",
  "fullText": "Aug 11, 2011 8:19pm PT \n\n \n\n \n \n \n\n \n\n \n Rent\n \n \n\n \n\n It seems like a mere 525,600 minutes since \"Rent\" blew out its last candle over at Broadway's Nederlander Theater. It's already back, and the news is all to the good.\n\nIt seems like a mere 525,600 minutes since “Rent” — Jonathan Larson‘s ground-breaking, Tony-and-Pulitzer-winning study of East Village Bohemians — blew out its last candle over at Broadway’s Nederlander Theater. It’s already back, and the news is all to the good. “Rent” is not so provocative as it was back in 1996, but even so, the tuner is plenty effective in its new Off Broadway guise.\n\nIt’s been almost three years since the Broadway version closed, which original producers Jeffrey Seller, Kevin McCollum and Allan S. Gordon have determined is hiatus enough. Following the lead of Seller and McCollum’s “Avenue Q” — which after a six-year run reconfigured itself with cheaper Off Broadway contracts at New World Stages — a new production of “Rent” also has opened at the venue.\n\nThese days, the squatters of Alphabet City are a distant memory rather than the razor-sharp slice of life they seemed in 1996, and there are few surprises in the show when a significant portion of the target audience is bound to walk in familiar with Mark and Roger, Maureen and Mimi and the rest.\n\nBut director Michael Greif has reconceived the piece, giving us a similar-but-new production sized to fit one of the 499-seat houses in the sub-basement of New World Stages. Musical supervisor Tim Weil and costume designer Angela Wendt are on hand to repeat their original assignments, but Greif has drafted a new choreographer and set, lighting, and sound designers. (Kevin Adams’ lighting design is an improvement over the original.) Still, “Rent” does seem pretty much to be “Rent” — and happily so.\n\nThe original 1996 cast — Anthony Rapp, Adam Pascal, Daphne Rubin-Vega, Idina Menzel, Taye Diggs, Jesse L. Martin — created their parts so memorably that the current crop can’t be expected to compete. Even so, the 2011 group has a distinct advantage over the dozens of cast replacements on Broadway and on tour, benefiting from a full rehearsal period with director Greif and with each other. As a result, they play well together.\n\nStanding out are Adam Chanler-Berat (the boyfriend in Greif’s “Next To Normal” and Peter in the recent “Peter and the Starcatcher”) as Mark; a very funny Annaleigh Ashford as Maureen; Corbin Reid as Joanne; and MJ Rodriquez as Angel. Cast size is pretty much the same as before, with apparently one less ensemble member. Off Broadway gets the same five-piece orchestration as in the original.\n\nAdding in swings, band and others, the $1.5 million revival has a hefty-for-Off-Broadway union payroll of at least twenty-five. But Larson’s masterwork also has a gilt-edged title, legions of existing fans, and an enormous potential audience of 16- to 22-year-olds who were too young for “Rent” back in 2008. The canny producers of “Avenue Q” and “In the Heights” know just how to market their wares, suggesting that this downsized production — with its reduced off Broadway rent — will prove viable.\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice.",
  "isFullReview": true,
  "textWordCount": 631,
  "archivePath": "data/archives/reviews/rent-1996/variety--steve-suskin_2026-02-07.html",
  "textFetchedAt": "2026-02-07T15:54:32.082Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 631,
  "tierReason": "Full review text"
}