{
  "showId": "true-west-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2019/01/24/true-west-sam-shepards-brotherhood-of-man/",
  "publishDate": "2019-01-24T20:45:48",
  "fullText": "Go West, said a newspaperman many years ago. But what is the West today? What is the modern frontier? What does it mean to be American, a brother, a man? What is freedom? And why would you need a full loaf of toasted white bread?\n\nSam Shepard’s True West, which was a Pulitzer finalist in 1983 and opened tonight in its latest revival in a Roundabout production at the American Airlines, asks these questions, and many more. The play, about a pair of estranged brothers and their apparent role reversal under pressure, is as funny as it is serious, and this new staging, directed by James Macdonald, a specialist in heavy-hitters, is as entertaining as it is profound. This is not a revelatory new interpretation, but it’s a serious and successful look at a seminal modern work.\n\nThe problem, if there is one, is that True West’s previous New York staging, at the Circle in the Square nine years ago, was in fact a revelation. I missed that production, but the reaction was rapturous. The play had made several prior off-Broadway appearances, but for its Main Stem debut director Matthew Warchus had his two leads alternate their roles. It wasn’t just a gimmick: The play is about a duality inside men and inside society. But the decision also achieved the frisson of a great gimmick, because his two actors were Philip Seymour Hoffman and John C. Reilly. Ben Brantley was rapturous, especially about how the two men played the two brothers differently.\n\nNow our two leads are Ethan Hawke and Paul Dano. They are excellent. Hawke plays the dissolute, menacing brother Lee, unshaven and unkempt, who has returned from the desert to his mother’s suburban L.A. home, where he encounters the brother he hasn’t seen in five years. Dano is Austin, the well-educated, clean-cut brother in an Oxford shirt, a moderately successful screenwriter who is taking care of the house while mom is on vacation in Alaska. Hawke luxuriates in his role; his Lee is gloriously, self-indulgently unpleasant, and Hawke gives a looser performance than he often does. Dano is a pleasant fussbudget, a fine, nebbishy stage actor who nicely shades his character’s descent from suburban propriety.\n\nBut you can’t imagine them switching the roles, as their predecessors did. You don’t feel like you’re seeing something unprecedented.\n\nWhat you are seeing, though, is a top-notch take on Shepard’s provocative script. The short version is that Austin begins as the good boy, on the cusp of selling a new script. Lee shows up, cons Austin’s producer into hiring him instead, and thus begins the downfall of one brother and the rise of the other. While in the first act Austin tries to get work done while Lee distracts and harasses him, in Act Two it’s Austin who’s struggling at the typewriter and Lee who, aided by alcohol, has returned to an annoying state of nature.\n\nThey’re in California, where Horace Greeley wanted young men to find new lives, but now (or at least then, in the 1980s) that new life is found through a good deal with a studio. They’re both mixed up about their places in the world. Early on, Lee goes casing neighbors houses for a potential heist. He comments about one that it was “Like a paradise. ‘Kinda place that sorta kills ya inside…. Blond people movin’ in and outta the rooms, talkin’ to each other. Kinda place you sort of wish you grew up in, ya know?” (Catch that contradiction: A paradise that kills you inside, which you wish you’d grown up in.) Austin, on the other hand, who starts as a has-it-all everyman, first becomes determined to prove he can steal something, too — hence a hilarious dozen toasters, and hence all that toast — and then decides that he wants to disappear to the desert, too.\n\nGary Wilmes is duly slimy as the movie producer who change in affection set the reversal in motion, and Marylouise Burke is delightfully sharp and sanguine as the mother who returns home to find her sons destroying her home and each other. The set by Mimi Lien, an anodyne SoCal split-level that is methodically destroyed, is a character of its own.\n\nBut ultimately this is a production where the play, not the performances, is the thing. Shepard would have us believe that order and disorder, domestic man and wild one, are within all of us. Lee turns into Austin and Austin into Lee because they are the same, and this is what society does to us. It’s a very Shepardian worldview, if not necessarily that of anxious New Yorkers, and True West makes a strong case for it.\n\nTrue West opened January 24, 2019, at the American Airlines Theatre and runs through March 17. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2019/01/24/true-west-sam-shepards-brotherhood-of-man/"
}
