{
  "showId": "true-west-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2019/01/24/true-west-shepards-raging-brothers-return/",
  "publishDate": "2019-01-24T20:46:51",
  "fullText": "Let’s now pause in our overdue reckoning with misogyny to consider the many ways men brutalize each other. (We’ll save intra-female brutality for another time.) What better occasion to do so than a fresh revival of True West, Sam Shepard’s brilliant reimagining of the Cain and Abel saga, in which two brothers who couldn’t seem more different on the surface grapple, graphically, with the ties that bind them both as kin and as guys trying to carve out their own destinies in the late 20th century.\n\nIf Shepard’s bracing dissection of American myths, from the idealized Western frontier to the dream of upward mobility, seemed penetrating when the play premiered in 1980, at San Francisco’s Magic Theatre, the play provides no shortage of insights today, when the perils of machismo gone unchecked are on display from sports bars to Silicon Valley to the White House. In Roundabout Theatre Company’s new production, directed wittily and unflinchingly by James Macdonald, our own fragile world never feels that far from the cozy home in suburban Southern California where siblings Austin and Lee—respectively played by Paul Dano and Ethan Hawke— square off.\n\nIn True West’s 2000 Broadway premiere, these central roles were alternated, to wild acclaim, by a young Philip Seymour Hoffman and John C. Reilly. Having missed those performances—and those of John Malkovich and Gary Sinise in a previous Steppenwolf Theatre Company production, also widely praised, that transferred to off-Broadway in the early ’80s—I can only judge Hawke’s and Dano’s fairly, by their own merits, which are considerable.\n\nIn elder brother Lee, a drifter and thief, Hawke has found a vehicle for both his comedic facility (not always mined or guided adroitly, on stage or screen) and his capacity for menace. The character turns up at the house, his mother’s, to find Austin, a productive screenwriter with a prestigious education and a family of his own, keeping an eye on the place while Mom is on vacation. As Austin sits dutifully at his typewriter, trying to resist Lee’s attempts to distract and goad him, Dano is at first blush the mild-mannered, put-upon nerd, a model of forbearance, however prickly or glib at points.\n\nBut as Lee steps up his torment, dangling old demons and reminding Austin that neither he nor the neighborhood is safe while his big brother is around, Austin’s cultivated reserve begins to fray. Dano’s sly, wry portrait underscores how this creative person and husband and father, who is working on a love story, harbors some of the egotism and vulpine ambition that writers and artists and computer geeks can share with more conventional alpha males, even while scorning them. Indeed, it’s a visit from a Hollywood producer interested in his work—played by an astutely unctuous Gary Wilmes—that sets in motion Austin’s inevitable fall off the rails.\n\nLiberated by booze, Austin becomes as destructive and needy and darkly funny an animal as his brother, his physical and verbal flailing bringing the two closer even as they lock horns, until they are one ill wind, blowing…Well, if you’ve never seen or read the play before, be prepared for adjustments to the set before Mom comes home, unexpectedly, in the form of Marylouise Burke, injecting a predictable and by that point welcome air of daffy detachment.\n\nThe scenic designer, notably, is a woman (as are respective costume and lighting designers Kate Voyce and Jane Cox). Mimi Lien, whose past credits include Natasha, Pierre & The Great Comet of 1812 and Taylor Mac’s A 24-Decade History of American Music, has furnished this True West with a set that exudes, per the playwright’s instructions, domestic order and functionality. A mother’s love, too, is evident in the (initially) lush green plants that hang in Lien’s handsome, spacious alcove, and the canary-yellow kitchen, with its (at first) tidily stacked items reflecting years of care and discretion.\n\nBut from the beginning of True West, as also indicated by Shepard, we hear the yapping of coyotes outside the house. “The sense of growing frenzy in the pack should be felt in the background,” the stage directions read; but here, as in any successful production of the play, the real beasts are always visible, and painfully familiar.\n\nTrue West opened January 24, 2019, at the American Airlines Theatre and runs through March 17. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-roundup"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2019/01/24/true-west-shepards-raging-brothers-return/",
  "bwwExcerpt": "In elder brother Lee, a drifter and thief, Hawke has found a vehicle for both his comedic facility (not always mined or guided adroitly, on stage or screen) and his capacity for menace. The character turns up at the house, his mother's, to find Austin, a productive screenwriter with a prestigious education and a family of his own, keeping an eye on the place while Mom is on vacation. As Austin sits dutifully at his typewriter, trying to resist Lee's attempts to distract and goad him, Dano is at ",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Critics-Weigh-In-On-Ethan-Hawke-And-Paul-Dano-In-TRUE-WEST-On-Broadway-20190124"
}
