{
  "showId": "true-west-2019",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2019/legit/reviews/true-west-review-ethan-hawke-paul-dano-1203108474/",
  "publishDate": "January 25, 2019",
  "fullText": "Jan 24, 2019 7:00pm PT \n\n \n\n \n \n \n\n \n\n \n Broadway Review: ‘True West’ With Ethan Hawke, Paul Dano\n \n \n\n \n\n Ethan Hawke and Paul Dano duke it out as battling brothers in a disappointing revival of Sam Shepard’s fierce 1980 classic.\n\nAustin (Paul Dano) is the mild brother, a Hollywood screenwriter holed up in his mother’s house and pecking away at a screenplay. Lee (Ethan Hawke) is the wild brother, a desert rat and sometime thief with more exciting, if improbable, stories to tell. More alike than either one of them would admit, they attack each other like buzzards in “True West,” until they exhaust themselves to a no-win standoff.\n\nThis funny, violent play is one of Sam Shepard’s best works, a fierce summation of some of his undying themes: the archetypal battle between blood brothers; the cultural collision between modern civilization and its violent past; the lingering death of the Old West. “There’s no such thing as the West, anymore,” the playwright tells us. But that doesn’t stop his characters from fighting over what’s left of their wasted inheritance.\n\n“True West” is a neverending battle of sibling rivalry and identity theft. Austin is supposed to be the creative one, but Lee is the one who dreams up the story idea that Hollywood producer Saul Kimmer (Gary Wilmes) is eager to option. Lee is supposed to be a professional thief, but Austin is the one who breaks into his neighbors’ homes to steal toasters.\n\nWithout being aware of what they’re doing, the brothers are slipping into each other’s skins, absorbing each other’s identities and morphing into a single person. Since they’re actually two aspects of the same person, each brother is fighting for his life — and possession of their shared identity.\n\nIf there’s one thing a production of “True West” must have, it’s that haunting sense of the two brothers being one person at war with himself. That’s exactly what director James Macdonald’s new Broadway production doesn’t have. Hawke seethes and smolders in a thrilling approximation of Lee’s craziness, but there’s no hint of Austin in his manic performance. And while Dano is completely convincing as the repressed Austin, there’s no sign of his secret bad boy, not even when he’s breaking into houses and stealing toasters.\n\nMore critically, there’s no real sense of danger when the brothers finally trash the kitchen and go for each other’s throats. When their mother, played by the incomparable Marylouise Burke, returns home and surveys the wreck her sons have made of her kitchen (designed with unspeakable ugliness by clever Mimi Lien), she scolds them as if they were misbehaving children. That seems appropriate here, but how much better it would have been if she could reprimand them as if they were wild animals who have no idea how scary they are.",
  "isFullReview": true,
  "dtliExcerpt": "Hawke and Dano bring a fierce physicality to their roles that makes the violence brewing between these brothers feel genuinely dangerous.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "If there's one thing a production of 'True West' must have, it's that haunting sense of the two brothers being one person at war with himself. That's exactly what director James Macdonald's new Broadway production doesn't have. Hawke seethes and smolders in a thrilling approximation of Lee's craziness, but there's no hint of Austin in his manic performance. And while Dano is completely convincing as the repressed Austin, there's no sign of his secret bad boy, not even when he's breaking into houses and stealing toasters.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Hawke and Dano bring a fierce physicality to their roles that makes the violence brewing between these brothers feel genuinely dangerous.",
  "contentTier": "complete",
  "contentTierReason": "Short text (21 words)",
  "textQuality": "full",
  "textWordCount": 463,
  "archivePath": "data/archives/reviews/true-west-2019/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T18:34:14.116Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 463,
  "tierReason": "Full review text",
  "bwwScore": 6,
  "sources": [
    "web-search",
    "bww-reviews"
  ]
}
