{
  "showId": "spamalot-2023",
  "outletId": "amny-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.amny.com/news/review-spamalot-broadway-revival-2023/",
  "publishDate": null,
  "fullText": "&#8220;Spamalot&#8221; is the musical we need right now.\nThe new Broadway revival of “Spamalot,” the 2005 Tony Award-winning musical adaptation of the 1975 medieval times-meets-slapstick comedy film “Monty Python and the Holy Grail,” is the equivalent of receiving a completely unexpected, seemingly unnecessary birthday gift that turns out to be exactly what you needed.\n\nThere was no plan to bring “Spamalot” back to Broadway. In February, the Kennedy Center (which has its own Encores!-style series in which older musicals receive short revival runs) was forced to cancel a planned production of “Kiss of the Spiderwoman” due to rights issues and, as a last-minute replacement, presented “Spamalot” instead, which unexpectedly went off like gangbusters and has now landed on Broadway.\n\nTechnically speaking, this is not a carbon copy of the original Broadway production, which had direction by Mike Nichols and choreography by Casey Nicholaw (“The Book of Mormon,” “Aladdin”) and starred a dynamite cast including Tim Curry, Sara Ramirez, David Hyde Pierce, Hank Azaria, Christopher Sieber, Christian Borle, and the late Michael McGrath.\n\nThat being said, the supercharged revival, as directed and choreographed by Josh Rhodes, maintains the glitzy, freewheeling, and fast-paced showmanship of the original production. \nIt is led by a new cast that is superbly daffy and game, including James Monroe Iglehart (the original Genie in “Aladdin”) as King Arthur, Leslie Rodriguez Kritzer (“Beetlejuice”) as the Lady of the Lake, Christopher Fitzgerald (“Waitress”), Taran Killam (“Saturday Night Live”), Ethan Slater (“SpongeBob SquarePants”), and Michael Urie (“Torch Song”).\n\nChristopher Fitzgerald and James Monroe Iglehart in the &#8220;Spamalot&#8221; revival.Photo by Matthew Murphy/Provided Leslie Rodriguez Kritzer as the Lady of the Lake in in the revival of &#8220;Spamalot.&#8221;Photo by Matthew Murphy/Provided\n\nOne could argue that the show’s “equal opportunity offender” style of comedy (with bits that unapologetically depict gays, Jews, cheerleaders, and various nationalities as silly stereotypes) is ill-suited to the current cultural climate. Nevertheless, “Spamalot” is too affectionate in its spoofing to provoke even the most hypersensitive person.\n\nIn fact, the second act showstopper “You Won’t Succeed on Broadway” (with the punchline “if we don’t have any Jews” followed by a parade of klezmer sounds, “Fiddler on the Roof,” and Yiddish expressions) feels like a feel-good pep rally in response to rising anti-Semitism. (The number is now topped off with a list of Jewish celebrities, which concludes by naming a disgraced New York politician who falsely claimed to be Jewish.)\n\nPersonally speaking, I had no burning desire to revisit “Spamalot.” (Back in 2005, I rooted for the other shows nominated for the Tony for Best Musical, including “The Light in the Piazza,” “Dirty Rotten Scoundrels,” and “Spelling Bee”). That being said, I must confess that I had a wonderful time at the revival and left feeling rejuvenated, with its burlesque spirit serving as medicine.\n\nWhile the revival may not necessarily be better than the original Broadway production, it is just as good – which is a rare achievement. However, the revival exerts a far stronger impact for a number of reasons. For one, the original production arrived in the midst of a wave of other relatively similar silly musical comedies such as “The Producers,” “Hairspray,” and “Avenue Q.”\n\nBut more than that, given the state of the world today, with people still recovering from the effects of the pandemic and ever intensifying political tensions, we need the cathartic release of pure Broadway musical comedy. We need the killer rabbit skit, Leslie Kritzer impersonating Cher, and an  “Always Look on the Side of Life” singalong.\n\nIn short, we need “Spamalot.”\nSt. James Theatre, 246 W. 44th St., spamalotthemusical.com.\n\nRead more: Ex-Cop from Queens Convicted for Role in Jan. 6 Insurrection",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 608,
  "archivePath": "data/archives/reviews/spamalot-2023/amny-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:47:19.872Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_read_more_prompt",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251017023130",
  "archiveOrgUrl": "http://web.archive.org/web/20251017023130/https://www.amny.com/news/review-spamalot-broadway-revival-2023/"
}