{
  "showId": "spamalot-2023",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/spamalot-review-monty-python-musical-revival-8404332",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nSpamalot review: The Broadway revival gives both timely hilarity and classic spectacle\nThe new production of the Monty Python classic is as funny as ever.\n\nChristian Holub is a writer covering comics and other geeky pop culture. He's still mad about 'Firefly' getting canceled.\n\nAfter Camelot, it only makes sense to go to Spamalot. But while Aaron Sorkin’s Broadway revival of the classic King Arthur musical earlier this year was a bit of a bore, the new iteration of the Monty Python funfest is a welcome dose of both hilarious deconstruction and old-fashioned razzle-dazzle.\n\nInspired by the classic cult favorite Monty Python and the Holy Grail, Spamalot starts much the same way: With King Arthur (James Monroe Iglehart) and his loyal servant Patsy (Christopher Fitzgerald) on a quest to find worthy knights to join their Round Table. In lieu of horses, Patsy clomps two halves of a coconut together to make hoofbeat sounds, which quickly becomes the only topic of conversation with the guards of the first castle they find. This familiar exchange (about how exactly a coconut could be found in the English countryside, and how the heavy fruit might affect the air-speed velocity of an average European swallow) is thankfully not dressed up into a song, because it’s already some of the funniest dialogue ever. But other classic Monty Python and the Holy Grail bits are greatly enhanced by the addition of music. A peasant proclaiming “I am not dead yet” despite a relative trying to pass him off as a plague victim is even funnier when the living human in question is also dancing across a Broadway stage.\n\nIn this and other supporting roles throughout the production, Ethan Slater (known for the Spongebob Squarepants musical and recent celebrity gossip) demonstrates his many versatile performance skills. He can dance, he can sing, he can narrate, he can be a baby or a bunny. Iglehart’s mellifluous voice spices up the basic character of King Arthur, as do his incredible physical reactions (a certain shrug or eyeroll from him, delivered at precisely the right moment, is just as hilarious as some of the bigger punchlines), but the repeated scene-stealer is Fitzgerald’s Patsy. The thankless servant is often doddering around the stage while the king or knights hog the spotlight (aside from when he gets to lead Act 2 opener “Always Look on the Bright Side of Life”), but everything he does is a showcase for slapstick done well.\n\nIn several ways, Spamalot builds on the material of Monty Python and the Holy Grail to make it more representative and contemporary. Leslie Rodriguez Kritzer’s Lady of the Lake stands up for the general lack of female parts in Python films and medieval fantasy as a whole. Her “Diva’s Lament,” in which she stops the show halfway through Act 2 to complain that she hasn’t gotten enough to do, is one of the funniest numbers in the production. Also impressive is the phalanx of female dancers who often show up alongside her and apply themselves to no less a diverse array of tasks than Slater, alternately dressing as nuns, Las Vegas showgirls, and French stereotypes, among others.\n\nSpamalot originally hit Broadway in 2005 (you can read EW’s article about it from the time here), so the script has been sprinkled with various ripped-from-the-headlines references to keep it contemporary. But what really stands out from this production is its commitment to big, brassy Broadway spectacle. Although numbers like “The Song That Goes Like This” purport to deconstruct musical theater tropes, the colorful costumes and closely choreographed tap-dancing serve as demonstrations of why we go to the theater in the first place.\n\nNowhere is this more on display than in the big gay wedding. When Lancelot (Taran Killam) goes to rescue an innocent young person being forced into a marriage they don’t want, he soon finds out they’re a man (Slater again) instead of a woman. Unlike the movie, the musical spurns homophobic jokes in favor of a beautiful ceremony, which it even modernizes with some well-placed evocations of RuPaul’s Drag Race. “Just think, in 1000 years this will still be controversial,” notes one character. But true Broadway razzle-dazzle never goes out of style. Grade: A-",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 95,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 703,
  "archivePath": "data/archives/reviews/spamalot-2023/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:50:22.486Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "scoreSource": "extracted-grade",
  "scoreConfidence": "medium",
  "extractedGrade": "A"
}