{
  "showId": "spamalot-2023",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=BJBN5C",
  "publishDate": null,
  "fullText": "Top: The company. Photo: Matthew Murphy/Evan Zimmerman. Bottom: Henry Lewis. Photo: Pamela Raith Photography. Right now, in New York, you have an opportunity to sample two very different kinds of British humor, each with its own distinct provenance. The choice is yours, although one is, despite its revival status, noticeably fresher than the other. But is there anything more personal than a sense of humor? On the highbrow side (sort of) is the return of Spamalot, a product of the comedy collective Monty Python, itself a direct descendant of the radio series The Goon Show, the stage satire Beyond the Fringe, and the overall tradition of the postwar British revue. Based on the 1975 feature film Monty Python and the Holy Grail, it's a kind of medieval Hellzapoppin', a loose collection of songs and ahistorical gags that make a travesty of the Arthurian legend. For all its long-running success, Mike Nichols' 2005 production felt overproduced and overbearing, not least because of the hard-core fans in the audience shouting out their favorite punchlines before the actors could get to them; it remains the only jukebox musical in which the jokes, not the songs, are the greatest hits. Under the guidance of director-choreographer Josh Rhodes, however, this new Spamalot is funny, scrappy, and fast on its feet, thanks to a gaggle of top Broadway clowns, all of whom have apparently been given wide latitude when it comes to ad-libbing. Some of the biggest laughs at the performance I attended aren't to be found in Eric Idle's script, and several are of the if-you-know-you-know variety: For example, James Monroe Iglehart's Arthur, unschooled in the creation of Broadway musicals (not a well-known subject in the fifth century), gets a tutorial in the format from a colleague who adds, sternly, \"But nothing by Disney.\" Iglehart, the erstwhile star of Aladdin, takes the insult manfully. Iglehart, a pillar of offended dignity whether faced with French taunters; menacing Knights of Ni; or the feckless, dissembling members of his own cohort, has plenty to put up with thanks to a maniacal supporting cast: Ethan Slater is a tweedy academic narrator, a cartwheel-performing deathbed case, and Herbert, the innocent, imprisoned prince, dreaming of a manly knight who will save him from an arranged marriage. Christopher Fitzgerald is Patsy, Arthur's squire, dutifully banging together coconuts to simulate a horse's hooves and vying, vainly, for his master's attention. Taran Kiliam is Lancelot, who, after various adventures, bursts out of the closet and marries a man, announcing, \"Just think, in a thousand years' time, this will still be controversial.\" Nik Walker is Sir Galahad (but you can call him Dennis), who must be coaxed off his \"anarcho-syndicalist commune\" to join the Round Table; he also figures in an astonishingly risky race joke that, at the performance I attended, brought down the house. (Getting away with murder is a core skill in this crowd.) Jimmy Smagula is Galahad's mother, baffled at the idea of the monarchy (\"Well, I didn't vote for you,\" she tells Arthur) and Sir Bedevere, inventor of that dubious military gambit, the Trojan Rabbit. There are two standouts in this onstage asylum. Michael Urie is the starry-eyed, golden-tressed, utterly vacant Sir Robin, whose idea of knighthood involves dressing up and dancing, not the horrifying prospect of armed combat. He romps happily through \"You Won't Succeed on Broadway (If You Don't Have Any Jews),\" a once-edgy number that now plays like an affirmation, ending here with the boffo appearance of an electrified Star of David. Urie also appears as a witheringly sarcastic castle guard, who, told by Arthur, \"I am looking for men,\" sniggers, 'I had a feeling,\" and as another royal henchman so obtuse that he reduces his boss (Walker again, frothing riotously) to a state of near apoplexy. And then there's Leslie Rodriguez Kritzer as the Lady of the Lake, keeper of the Holy Grail, Arthur's spiritual cheerleader, and not-to-be-crossed diva. Making an entrance, she muscles past her fairy chorus, unceremoniously shoving one out of the way. She and Arthur get tangled up in the repetitious melody of \"The Song That Goes Like This,\" a wicked Andrew Lloyd Webber parody courtesy of composers Idle and John Du Prez. When the action moves to a Camelot constructed along the lines of Las Vegas, Kritzer goes full-on Liza Minnelli, modeling a Halston-style sequined pantsuit, scat-singing like a hepcat, and bantering raunchily with the audience. (Shouting out the band, she snaps, \"Seventeen musicians and I've slept with fifteen of them.\" Rim shot. \"But not the drummer.\") She also dispenses teary inspiration in \"Find Your Grail\" and some pointed dramaturgical criticism in \"Diva's Lament.\" (\"Whatever happened to my part?/It was exciting at the start/Now we're halfway through Act Two/And I've had nothing yet to do.\") Kritzer is a variety show all by herself, fully earning her role as the First Lady of Spamalot. Paul Tate dePoo III's scenic and projection design delivers a variety of towering castles, portcullises, drawbridges, and spires, along with airborne cows, annoyed deities, and a hit parade of famous Jews that includes Mel Brooks, Sarah Jessica Parker, and George Santos. Lighting designer Cory Pattak is equally adept at conjuring heavenly beams or glitzy chases; every choice is strongly articulated, relying on bold color choices. Jen Caprio's costumes range from kingly robes to filthy rags, from otherworldly gowns to bow ties, sweater vests, and gay-themed codpieces, everything cunningly designed to facilitate rapid-fire changes. (Tom Watson's wig and hair designs go a long way toward helping out actors cast in six or more roles.) The sound design, by Kai Harada and Haley Parcher, is bright, lively, and thoroughly intelligible. All in all, Spamalot restored my faith in Monty Python's unique brand of high-and-low hilarity -- but watch out for killer bunnies! If you're looking for something more knockabout, there's Mind Mangler, the latest product to roll off the assembly line of Mischief, the franchise that brought you The Play That Goes Wrong and Peter Pan Goes Wrong. The Mischief makers are direct descendants of the British music hall tradition, the Carry On films, Ray Cooney's stage farces, and TV's The Benny Hill Show. You won't find any sly cultural references here, just broad gags, broadly executed. The standard methodology inevitably involves subjecting a well-known entertainment property to a barrage of mayhem; in this instance, co-author (with Jonathan Sayer and Henry Shields) Henry Lewis is the title character, a magician and mentalist whose illusions inevitably...go wrong. (It is subtitled, \"A Night of Tragic Illusion.\") It will give you an idea of the overall approach that every time Shields announces that he is the Mind Mangler, sound designer Helen Skiera unleashes an echo effect (\"mind, mind, mind, mind\"). If this unfailingly cracks you up, New World Stages is the place for you. And so it goes: A volunteer called up to the stage is less than convincing since he sports a T-shirt that says, \"Audience Member.\" Indeed, it is Sayer, playing Lewis' nervous wreck of a stooge. \"Have we ever met before?\", Lewis asks. Sayer, sweating bullets, replies, \"No, we do not live together.\" The third member of the team is Tom Wainwright as the stage manager who brazenly feeds prompts to Lewis during his mind-reading bit. At one point, Wainwright reveals a T-shirt featuring the alphabet, allowing him to spell out the correct answer to his boss. The outrageous, farcical bits keep coming: A \"man versus machine\" sketch features Lewis hooked up to four brains in jars, bested in a chess match with a computer. A \"human radio\" routine focuses on a special mic boom designed to read the thoughts of audience members (\"I'm giving this one star on Tripadvisor\"). Trying to bend a spoon like Uri Geller, Lewis fails, but his mic stand wilts like a dried cornstalk and a light bar comes crashing in. All three performers are pros down to their fingertips and you've got to admire how Lewis and Sayer pick up cues from the audience, working them into unrelated bits all night long. (At the performance I attended, they were merciless with a businessman who owns two pharmacies, repurposing that information several times over.) But if you've seen the other \"...Goes Wrong\" productions, there is little sense of surprise, and, before long, a feeling of sameness sets in; you can set the setups from a mile away. Two hours is far too long for this sort of mechanical gaggery; some ruthless editing would improve the show markedly. Under Hannah Sharkey's direction, Sara Perks' amusingly glitzy set is augmented by Gillian Tan's video design, which combines some clever bits of content with live footage. Steve Brown's music, consisting of hits and zaps lifted from some of the cheesier television competition shows, works well with David Howe's lighting design, which pumps up the action with bursts of saturation and color-changing effects. Lewis does pull off a couple of genuinely surprising illusions, and the climax features a spectacular gag involving a guillotine that seemingly works all too well. If you have a taste of Mischief, you'll almost certainly have a good time at Mind Mangler, but for laughs that really stick with you, I'd book a trip to Spamalot. --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1547,
  "archivePath": "data/archives/reviews/spamalot-2023/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:50:38.762Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}