{
  "showId": "spamalot-2023",
  "outletId": "newyorktheatreguide-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.newyorktheatreguide.com/reviews/spamalot-broadway-review",
  "publishDate": null,
  "fullText": "Read our four-star review of the first revival of Spamalot on Broadway, the musical adaptation of Monty Python and the Holy Grail, at the St. James Theatre. The Phantom of the Opera is not dead yet! The show may have closed at the Majestic Theatre earlier this year, but for five hilarious minutes across the street at Spamalot, during \"The Song That Goes Like This,\" its vestiges float in on a gondola shrouded in smoke, under the light of a video-projected chandelier. And that's far from the only other musical that makes a cameo. Spamalot being a tasting flight of Broadway's past and present hits is one of the best reasons to recommend it. On a budget or a time crunch? For one price of admission, you'll get bits of the can-can dancing of Moulin Rouge!, the jazzy scatting of Some Like It Hot, the iconic French flag wave from Les Mis, the slinky Fosse-esque moves of Chicago (and a direct nod to his iconic \"Mein Herr\" chair-ography from Cabaret), and more. Not to mention the rest of Spamalot, adapted by Monty Python founding member Eric Idle and John Du Prez from Monty Python and the Holy Grail. The irrevent account of King Arthur and the Knights of the Round Table cemented itself as a modern classic upon clinching the holy grail of theatre honors — the Best Musical Tony Award — in 2005. This Broadway revival, Spamalot's first, feels like a proclamation that the musical's heyday is not dead yet, either. Director/choreographer Josh Rhodes's production, in particular Paul Tate dePoo III's set and Jen Caprio's costumes, are plainly inspired by the original's, and Monty Python's trademark, silly sketch comedy is all but entirely intact. That is for better or for worse: Brief bits of man-in-dress humor from 2005 haven't aged well, but the few script updates are similarly hit and miss. New references to the NYC subway and Lea Michele feel fresher than a now-passé nod to the viral \"Angela Bassett did the thing\" video. The most iconic bits — fisch schlapping, coconuts as horseshoes — are timeless, though your laughter will simply be proportional to how much you enjoy Monty Python's silly sketch-comedy style in general. My personal favorites are the \"so bad they're good\" puns, like when Arthur (James Monroe Iglehart) describes the Holy Grail as a \"symbol,\" cueing the cymbalist. The other strength of Spamalot is that it gives every one of its principal cast members a chance to shine. And shine they do. Ethan Slater proves himself one of the best physical comedians on Broadway right now in a variety of bit parts, making each one feel larger than life. Michael Urie makes a meal of the showstopping \"You Won't Succeed on Broadway\" as Sir Robin, and Christopher Fitzgerald does the same with \"Always Look on the Bright Side of Life\" as Patsy, though his best moment is his silent comedic acting in the background of Arthur's \"I'm All Alone.\" And Leslie Rodriguez Kritzer channels no less than half a dozen pop and Broadway divas — Cher, Mariah Carey, and Idina Menzel among them — in her glittering turn as the Lady of the Lake. Nevermind the Act 2 sequence in which the gang actually completes their quest (with some audience help, in one of Spamalot's best scenes) — the high note Kritzer finds at the end of \"Diva's Lament\" is the true holy grail. Spamalot is at the St. James Theatre. Get Spamalot tickets on New York Theatre Guide. Photo credit: Michael Urie, Nik Walker, James Monroe Iglehart, Christopher Fitzgerald, Jimmy Smagula, and Taran Killam in Spamalot. (Photo by Matthew Murphy and Evan Zimmerman) Find your grail at the first Broadway revival of this musical adaptation of Monty Python and the Holy Grail. A roundtable of Broadway favorites leads the cast, putting on a highly irreverent parody of Arthurian legend filled with gags galore. Spamalot on Broadway is playing at St. James Theatre. The theatre is located at 246 West 44th Street (between Broadway and 8th Avenue), New York, 10036. The running time of Spamalot on Broadway is 2hr 20min. Incl. 15min intermission. The recommended age for Spamalot on Broadway is Ages 9+. Children under 4 years old will not be admitted.. Book tickets for Spamalot on Broadway on New York Theatre Guide. Spamalot contains 23 musical numbers, and some of the most famous songs are \"The Song That Goes Like This,\" \"Always Look on the Bright Side of Life,\" and \"Diva's Lament (What Ever Happened to My Part?)\" Spamalot is written by Eric Idle (book, music, and lyrics) and John Du Prez (music). Idle also co-wrote the screenplay for Monty Python and the Holy Grail, on which Spamalot is based, and is a founding member of Monty Python. Josh Rhodes directs and choreographs Spamalot on Broadway in 2023 after staging the production at the Kennedy Center in Washington, D.C. The show marks his Broadway directorial debut. Spamalot is suitable for children ages 9 and up due to some brief adult themes. Please note that children 4 and younger are not permitted in Broadway theatres. Monty Python is timeless, and this Spamalot revival just proves the staying power of its humor. This Tony-winning Best Musical now features a cast of Broadway favorites, and it's not to be missed. Originally published on Nov 16, 202320:00",
  "isFullReview": true,
  "dtliExcerpt": "“This Broadway revival, ‘Spamalot's’ first, feels like a proclamation that the musical's heyday is not dead yet, either...The other strength of ‘Spamalot’ is that it gives every one of its principal cast members a chance to shine. And shine they do. “\n\nRead more",
  "originalScore": null,
  "assignedScore": 75,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 890,
  "archivePath": "data/archives/reviews/spamalot-2023/newyorktheatreguide-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:51:34.839Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "designation": "Recommended",
  "scoreSource": "extracted-thumbs-up",
  "scoreConfidence": "low"
}