{
  "showId": "spamalot-2023",
  "outletId": "nystagereview-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nystagereview.com/2023/11/16/spamalot-spamalot-trumpeting-the-return-of-a-raunchy-musical-comedy-for-the-ages/",
  "publishDate": null,
  "fullText": "★★★★☆ A crack cast reinvigorates Eric Idle’s irreverent slice of highly improbable history. Age – a hiatus of 14 years, some of them plague-ridden – has not withered Spamalot’s inspired looniness. If you saw the Broadway production the first time around (2005-2009), of course you’re going to go back. Who would pass up a chance to relive Eric Idle’s hilariously dark spoof of the Middle Ages, especially as recast with a whole new set of comedic aces? All of the replacements, smartly marshaled by director/choreographer Josh Rhodes for last spring’s Kennedy Center revival, seem to be having the time of their lives. James Monroe Iglehart brings a robust bonhomie to the role of King Arthur, that benighted idealist: it’s fun to track the actor twinkling with sheer delight. Christopher Fitzgerald shines steadily as Arthur’s faithful lackey Patsy, who’s charged with clopping coconut halves to simulate hoofbeats, among other vital tasks. Summoning pools of long-standing pain, Fitzgerald achieves peak poignancy with just his luminous blue eyes (effective lighting throughout by Cory Pattak) as Arthur melodramatically intones the lament, “I’m All Alone.” “I’m here, you twat,” Patsy finally objects. [Read Melissa Rose Bernardo’s ★★★★☆ review here.] Much of the humor is scatalogical, seemingly mined from the mentality of a nine-year-old boy. In one of his three guises (most cast members shoulder multiple roles), Michael Urie excels as a flighty recruit who enlists with qualms: “Oh, there’s fighting, is there?… It’s not just dressing up.” Sir Robin’s bowels prove inadequate to the task, prompting much scurrying offstage. And then, of course, there’s the barrage of flatulence that the “French Taunter” palace guard rains down on the Arthurian pilgrims. Subbing for Alex Brightman (who was part of the Kennedy Center cast and will resume the role January 7), SNL alum Taran Killam is terrific in four guises. His primary character is Sir Lancelot, whose romantic inclinations veer off-course after he responds to a desperate SOS from a lonely royal shut-in (Ethan Slater, ubiquitous in seven cameo roles and sweetly touching in this one). Surpassing this motherlode of talent is Leslie Rodriguez Kritzer, resplendent as The Lady of the Lake, a part seemingly custom-tailored to showcase her talent. Sara Ramirez shone, too, way back when, but Kritzer ratchets it up a notch – as when she and Galahad (Nik Walker) tackle the ever-ascending modulations of “The Song That Goes Like This,” which includes the promise “I’ll sing it in your face / while we both embrace.” Kritzer is fierce! Just wait for the “Diva’s Lament” in Act II, when the Lady grows impatient with her lack of stage time. You’ll relish every second – and thank yourself for revisiting this silly romp — as Kritzer tears a hole in the ceiling with her supersonic melismas. Spamalot opened November 16, 2023, at the St. James Theatre. Tickets and information: SpamalotTheMusical.com Sandy MacDonald started as an editor and translator (French, Spanish, Italian) at TDR: The Drama Review in 1969 and went on to help launch the journals Performance and Scripts for Joe Papp at the Public Theater. In 2003, she began covering New England theater for The Boston Globe and TheaterMania. In 2007, she returned to New York, where she has written for The New York Times, TDF Stages, Time Out New York, and other publications and has served four terms as a Drama Desk nominator. Her website is www.sandymacdonald.com.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 563,
  "archivePath": "data/archives/reviews/spamalot-2023/nystagereview-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:52:30.774Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}