{
  "showId": "spamalot-2023",
  "outletId": "pagesonstages-wordpress-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.wordpress.com/2024/03/03/spamalot/",
  "publishDate": null,
  "fullText": "Spamalot is a show that is near and dear to my heart, and I must say, the audience seemed to share that familiarity and fondness. It was an audience of people who clearly were familiar with Monty Python content, but not necessarily in the context of this specific show, which made for a really fun crowd of people who were laughing at the familiar references and enjoying watching them crop up. The show is not selling at (or near) full capacity, and I suspect that a large part of that is that people who do not already have a connection to this content are not necessarily interested in coming to see the show. Demographics wise, the audience was primarily composed of adults who would have seen these movies in their youth, for whom nostalgia was a significant draw. The show was visually stunning. Paul Tate dePoo III (Scenic and Projection Design) blew me away with how well he walked the aesthetic line between scenic moments that looked three dimensional, real, and gorgeous, and moments that supported the low budget, Monty Python’s Flying Circus cartoon style atmosphere of the show. I was amazed at how well elements of scenic painting and projection interplayed, and how each moment was in a way, both real and not real. The transitions between songs and ideas were seamless (and, in this way, quite at odds with the way the show is written—this was really an astonishing feat that helped mask the haphazard writing and flight of ideas characteristic of the Monty Python franchise). Performance wise, there were some standouts. Alex Brightman (Lancelot) really amazed me with his versatility and his commitment to keeping each character completely separate from his other roles. Likewise, I thought Jonathan Bennett (Sir Robin) and Christopher Fitzgerald (Patsy) did a phenomenal job playing character roles that are often overlooked and overshadowed. Both displayed impeccable delivery. Leslie Rodriguez Kritzer (The Lady of the Lake) exhibited incredible vocal control and, of all of the cast members, definitely departed the furthest from the original production and from the notes on the page. This departure was both good and bad. On the one hand, she brought a fresh energy to a show that was largely mimicry. Some of the shows other moments felt phoned in, like “All for One”, which has some great lines that the knights didn’t really draw attention to. While Kritzer’s numbers were certainly more interesting and certainly more in line with being an actress (and “one unhappy diva”), I felt the humor in her content was similarly lost. Kritzer code switched between genres and ideas a little too freely and a little too frequently, making if difficult for those who did not already know the jokes to catch some of her funnier lines due to lack of consistent diction. The updated references (TikTok, Ozempic, Lea Michele, etc.) were fun but mostly felt like throwaways. I missed Eric Idle’s voice of G-d; Steve Martin just didn’t land for me—maybe this could have been helped with a more specific/more recent reference to Martin’s work. Despite its faults, this show kept me smiling and laughing because I have many great personal memories of designing multiple (considerably) smaller scale productions of Spamalot and laughing at Monty Python and the Holy Grail and Life of Brian as a kid bonding with my dad, who was my earliest introduction to art as escapism that takes you out of yourself for a while and provides some respite from having to think to understand the humor. I had a great time, and was a little sad that the show is not being well attended, so I took a moment to reflect on what people who have no connection to Monty Python might be seeing in the show. And I realized that this style of humor is less and less effective and popular in every medium, not just theatre. We like things to make sense and to be intellectually challenged and to be flooded with political references, and this simply isn’t that kind of show. It’s disorganized and nonsensical. Delightful for some, confusing for others. But the thing that stands out is that it only evokes emotions for those who are already connected. None of these concepts, musical numbers, or hilarious references evoke genuine emotion, and sadly, in today’s world, the idea of knights “prancing ‘round in woolen tights” is a less and less appealing thing to see on Broadway. In light of my own belief in the power of theatre to change and challenge the world, if this is your one opportunity to experience the power of Broadway, or more broadly, live theatre in any form, I am not sure this is the show I’d recommend as most representative of what the art form has become. Theatre has been developing more substantive messages and increasingly relevant calls for social change. This show, while a delight, doesn’t do that, and doesn’t speak to how the industry is shifting. But if you love Monty Python, Spamalot’s the show to choose! I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 849,
  "archivePath": "data/archives/reviews/spamalot-2023/pagesonstages-wordpress-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:52:46.504Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}