{
  "showId": "spamalot-2023",
  "outletId": "slashfilm-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.slashfilm.com/1457038/spamalot-review/",
  "publishDate": null,
  "fullText": "If you want a risk-taking Broadway musical that weaponizes disco-glamour to tell a story of crumbling democracy, I hope you already invested in a ticket to the immersion of \"Here Lies Love\" in its dying breath. If you want a work of artistic and personal self-reflection, see the \"Merrily We Roll Along\" revival. But if you hunger for Broadway-based belly laughs, you have two musical options: \"Gutenberg! The Musical!\" or the \"Monty Python's Spamalot\" revival. \"Lovingly ripped off\" from the 1975 \"Monty Python and the Holy Grail\" as well as other \"Monty Python\" media, \"Spamalot\" (the book, music, and lyrics written by troupe member Eric Idle, music co-credited to John Du Prez) reigned for 1,575 performances from its 2005 Broadway premiere. Transported from the Kennedy Center run in May 2023, this Broadway revival at the St. James Theatre serves up the oldies with adequate variance to its secondhand Pythonesque humor. From the moment the Arthurian tale opens with an irrelevant Finland number, anyone who has not seen anything \"Monty Python\" is in for hijinks. Then the real tale starts when King Arthur (James Monroe Iglehart, a kingly charmer, yet too restrained here) prances in on his invisible horse, followed by his harried squire, Patsy (Christopher Fitzgerald), clopping two halves of a coconut for sound effects. After recruiting a Round Table of trusty knights and spending merriment at the Las Vegasized Camelot (lit splendidly by Cory Pattak's lighting design), God (a voice cameo by Steve Martin, fixing a holy feast out of three minutes) peers down from the heavens to bequeath the knights a quest: find the Holy Grail. Draw a plot map of \"Spamalot\" and you'll get crayon squiggles of sketch-by-sketch shenanigans and off-tangents, though the ending is a tenfold tidier than the movie's. As the supporting actors rotate around comedic parts and don Jen Carpio's eye-popping costume designs, the Round Table is rounded out with the talents of SNL alum Taran Killam as the brash Sir Lancelot (Killam does little compelling with Lancelot, but excels at other roles), Michael Urie as the timid Sir Robin, Jimmy Smagula as the flatulent Sir Bedevere, and Nik Walker as the intellectual Sir Galahad. Ethan Slater (the \"SpongeBob Squarepants Musical\" O.G.) exploits his versatility, swiveling from a stressed Historian, a Not Yet Dead corpse, a mime, and to the poor Prince Herbert who just wants to sing. Bottled within a decorative part, Leslie Rodriguez Kritzer as the Lady of the Lake gobbles her power ballad pastiches like Liza Minnelli and Celine Dion. After all, \"Whatever Happened to My Part\" pokes fun at the Lady's plot disappearance, so she makes every minute count as the musical's sole woman lead. Milking its mileage from the familiar, \"Spamalot\" lays thick the affectionate theatre references (including the headline-raising Lea Michele replacement casting in \"Funny Girl\") and the parodic \"Songs That Goes Like This.\" These include the soaring vocals of \"Defying Gravity,\" the sensual Fosse hip sways of \"All That Jazz,\" and Jerome Robbins' \"Bottle Dance.\" Josh Rhodes' direction and choreography light up the stage with jaunty dancing, tossing throwbacks here and there. Lesser songs like \"I Am Not Dead Yet\" are simply extensions of the movie's lines. The classic \"Always Look on the Bright Side of Life\" (from the \"Life of Brian\" movie) is the tap of a sweet-sounding nostalgia button, but interwoven underwhelmingly into Arthur's setbacks. Cheapness is a charm of the low-budgeted movie, but the stage's derivative projections struggle for a comic identity. With Paul Tate DePoo III's projection and scenic design, the graphic renderings deliver the gags and the environment in conjunction with slick castle and arches, from a genericized computer-generated \"Phantom of the Opera\" chandelier to a cutout-stylization of God (a feeble homage to Terry Gilliam's crude aesthetic). A projected falling-chandelier gag should crack our ribs in hilarity for us theatre-heads rather than induce a chuckle. Your mileage will vary with the humor. Duds include a shoehorned TikTok lyric and a \"She was asking for it\" line. Act 2's recreations of the Knights Who Say \"Ni!\" (Kate Wilson's dialect coaching plays a pivotal role in the accuracy of the Pythonesque cadence) and the Black Knight's duel of amputative proportions are funny but don't land as hard. Perhaps because these jokes functioned onscreen when the movie fooled itself of its gravitas, whilst the stage version hastens to say \"These are funny! Laugh!\" The entrance of a few gag characters is constrained by normative entrances from stage left and right. That's not to deny the scores of well-earned laughter, adding enough of its own color to well-worn gags, such as Killam turning a prolonged raspberry joke into crude art and the outcome of the Killer Bunny incident. It's nice to have something like \"Spamalot,\" its expired jokes aside. To quote \"Find Your Grail,\" if there is a Holy Grail to find in this musical, it's simply to have a silly old time. It's no sin that the \"Spamalot\" revival gallops across \"seen-it-all-before\" territory, though I also walked out of the theatre evaluating that its finest qualities rely on the borrowed. A safe \"Spamalot\" doesn't lack shelf-life in 2023, but it could be funnier. But at least it's Not Yet Dead. \"Spamalot\" has a currently open-ended run on Broadway at the St. James Theatre.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 878,
  "archivePath": "data/archives/reviews/spamalot-2023/slashfilm-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:52:51.987Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}