{
  "showId": "spamalot-2023",
  "outletId": "theaterlife-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://theaterlife.com/monty-pythons-spamalot-3/",
  "publishDate": null,
  "fullText": "November 24, 2023: It looks a lot like the Broadway revival of Monty Python’s Spamalot, now at the St. James Theatre after a fondly received run at Washington’s Kennedy Center this past spring, is the laugh-a-lot musical comedy hit of the new season. Same as in 2005, when I first saw it. November 24, 2023: It looks a lot like the Broadway revival of Monty Python’s Spamalot, now at the St. James Theatre after a fondly received run at Washington’s Kennedy Center this past spring, is the laugh-a-lot musical comedy hit of the new season. Same as in 2005, when I first saw it. I laughed a lot more than I expected after a disappointing revisit to its cinematic source, Monty Python and the Holy Grail, the farcical 1975 British takeoff on the King Arthur legend. That’s the one in which Arthur, proud “King of the Britons,” rides his horse around Britain seeking Knights for his Round Table who will join his quest to find the Holy Grail. The nutty thing, though, is that instead of riding horseback, he trots along on his own two feet, accompanied by Patsy, his similarly trotting, Sancho Panza-like servant. Patsy, wearing a giant backpack, claps two halves of a coconut together to simulate clip-clopping hoof beats. The movie, like all the available Monty Python work, is a cult classic, whose far-out spoofery is familiar to countless fans. While never a committed Pythonite, I usually appreciated much of their get-a-laugh-at-any-cost humor. Viewing the movie again, however, I found too much of it childishly sophomoric, although I admit squeaking out a chuckle at several of the famous bits. Because so much of the show borrows from the movie, it took me some time to warm up to its humor—even while all around me the crowd was losing its collective head—but, eventually, it reached me and I barked as loud as any dyed-in-the-wool Pythonite. Judging by the constant shrieks, that seemed to be 99% of everyone present. Even though you can’t take the show’s songs—by John Du Prez and Eric Idle (one of the original Monty Python funnymen)—seriously, they’re seriously listenable and provide a succession of musically memorable numbers that, for all the daffiness of their lyrics, provide the grounds for cleverly amusing choreography and, in many cases, sensational singing. Idle’s book leans heavily on the film—Pythonites wouldn’t have it otherwise—but there’s enough original material to provide wonderful surprises for those familiar only with the movie. And the cast, under the merrily inspired direction and choreography of Josh Rhodes, is perfectly in sync with the needs of the absurdist humor; it keeps just straight-faced enough to maintain the needed conviction while subverting every line and piece of business with anarchic punch aimed at institutional structures and established beliefs. Among major features not in the film is the Lady of the Lake, acted and sung with scene-stealing, Tony-worthy, comic glee and vocal athleticism by Leslie Rodriguez Kritzer, a veritable blessing. Also not in the film is the sidesplitting sequence inspired by a plot device late in the action that says Arthur (the superb James Monroe Iglehart) and his Knights can’t fulfill their mission unless they put on a successful Broadway musical. Naturally, you can’t accomplish such a feat without Jews; the Fiddler on the Roof-inspired mishegoss that follows has the audience practically wetting its pants. When a list of Jewish Broadway stars’ names flashed on a screen, among them Barbra Streisand and Sarah Jessica Parker, the last one to appear was so perversely hysterical I almost spat out my flipper. Among the most popular routines borrowed from the film is when Arthur fights the Black Knight (Nik Walker) in the forest and chops off his limbs, while the knight—a stump with a head—continues to spout defiance; its place in the plot comes later than in the film, so you have to wait for it, although it would be even funnier if the overtly fake blood spurts shown on screen could be duplicated. Some of the original business is also taken to a new level of ridiculousness, like the taunting raspberry sprayed at Arthur and his men by a goofy, French-accented soldier on the castle ramparts, here extended to symphonic levels. Filling the many roles—as in the movie, all, except Arthur, play multiple parts—associated with such comedic icons as John Cleese, Eric Idle, Michael Palin, Terry Gilliam, Graham Chapman, and Terry Jones (the last two no longer with us) are Ethan Slater, Christopher Fitzgerald, Michael Urie, Taran Killam, Nik Walker, and Jimmy Smagula, each funnier than the next. A cohort of sensational supporting performers and an ensemble highlighted by a bevy of beauteous Broadway babies helps make Spamalot a must-see entry in the season’s sweepstakes. With the world once again torn into ferocious factions, audiences seeking temporary surcease from the madness will find it for nearly two and a half hours at the St. James. The spectacular yet comedically appropriate medieval sets by Paul Tate DePoo III, the extensive and often exquisite costumes by Jen Caprio, the versatile lighting by Cory Pattak, and the spot-on hair and wig designs of Tom Watson go a long way in making Spamalot not just fun to listen to (kudos, btw, to Kai Harada and Haley Parcher’s sound design) but to look at. I met a young woman, a friend of my granddaughter’s, at our family’s Thanksgiving dinner. In the interest of reaching across the generations, I mentioned that I’d passed Ariana Grande on the steps inside a theatre this week. (Grande’s boyfriend, Ethan Slater, is in the cast and costarring with her in the forthcoming movie version of Wicked.)The name having rung a loud bell, she asked where this occurred, and I said at Spamalot. Surprisingly, this attractive, reasonably well-educated, 25-year-old had never heard of it or even of Monty Python. I have no idea of how representative such unawareness is among members of her generation, but I sure hope she’s the exception, not the rule, because Spamalot will have to draw on a huge audience of potential Pythonites if it’s going to meet what must be an enormous nut. It’s a terrific show and I hope, unlike the Black Night, it’s able to keep running. Monty Python’s Spamalot *****St. James Theatre246 W. 44th Street, NYCOpen runPhotos: Matthew Murphy and Evan Zimmerman",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1050,
  "archivePath": "data/archives/reviews/spamalot-2023/theaterlife-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:57:30.554Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}