{
  "showId": "spamalot-2023",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Juan A.",
  "url": "https://www.theatrely.com/post/the-spamalot-you-know-and-love-is-back-on-broadway-review",
  "publishDate": "November 16, 2023",
  "fullText": "The company of Spamalot | Photo: Matthew Murphy & Evan Zimmerman\n\nWho am I to judge if Spamalot has a place on Broadway in 2023? And, to be clear, I mean the original 2005 staging, which has been all but entirely recreated at the St. James Theatre with a different cast and slightly impoverished production values.\n\nThere are those for whom the words “Monty Python” inspire an impossible giddiness, and they would have been in excellent company at the performance I attended. Each fart joke and schoolyard pun was met by ravenous guffaws and applause. The man in front of me even gave  the vocally exciting Leslie Rodriguez Kritzer, a standout as The Lady of the Lake, an emphatic, “Brava!” after her big solo.\n\nThen there are those like me, for whom memories of the era-defining British comedy troupe serve as reminders that straight people will really laugh at anything so long as there's’ an atmosphere of silliness (not necessarily silliness in itself—which might constitute actual camp). My compatriots likely spent the evening wondering when a song might pop up that wouldn’t frighten your average fraternity brother out of performing it at a mixer, or at least seeing it done.\n\nThe music, by John Du Prez and original Python member Eric Idle, can be described as first-draft, baritonal, and Hasty Puddingsesque. Nothing offensive or inventive about score, which is mostly musical theatre pastiche lacking any nuance that might reveal an actual engagement with the form.\n\nIdle, who also wrote the lyrics and book, it seems did not have much room for engagement with the current age, either. The plot is the same, based on the 1975 film Monty Python and the Holy Grail: King Arthur (James Monroe Iglehart) and his servant Patsy (Christopher Fitzgerald) whip up a motley crew — Lancelot (Taran Killam), Sir Robin (Michael Urie), Sir Galahad (Nik Walker), and Sir Bedevere (Jimmy Smagula) —  into the knights of the round table for a quest to find the titular vessel.\n\nHijinks ensue, with most actors swapping roles to portray characters and farcical situations the audience has come to expect from the well-known classic. Were the plot sturdy or the jokes timeless, Idle’s decision to leave the book largely untouched would be fine. But alas, as with many other whose near-two-decade cobwebs were only lightly dusted off, I was left to consume a number about a character’s coming out that, until the final moments when a few Grindr beeps came through, comprised what a 2005 straight man’s idea of gayness was like. (Ironically, the tight-bodied spangles and Vegasness of that number might now be considered part of the heteronorm, but I digress.)\n\nSo, fine, it’s not for me. The cast is clearly having a good time – though only Ethan Slater, swapping through multiple characters, as well as Kritzer, Walker, and especially Killam tap into the all-out comedy the work requires. And the audience? Well, their holy grail was promised and delivered, without much work to obtain it.\n\nSpamalot is in performance at the St. James Theatre on West 44th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "dtliExcerpt": "So, fine, it’s not for me. The cast is clearly having a good time – though only Ethan Slater, swapping through multiple characters, as well as Kritzer, Walker, and especially Killam tap into the all-out comedy the work requires. And the audience? Well, their holy grail was promised and delivered, without much work to obtain it.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "MEH",
  "dtliUrl": "https://didtheylikeit.com/shows/spamalot/",
  "needsScoring": true,
  "textWordCount": 627,
  "archivePath": "data/archives/reviews/spamalot-2023/theatrely--juan-a-_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:01:12.054Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee"
}