{
  "showId": "spamalot-2023",
  "outletId": "time-out-new-york",
  "outlet": "TIME OUT NEW YORK",
  "criticName": "Adam",
  "url": "https://www.timeout.com/newyork/theater/spamalot-review-broadway-musical-revival-monty-python",
  "publishDate": "November 16, 2023",
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nOur newsletter hand-delivers the best bits to your inbox. Sign up to unlock our digital magazines and also receive the latest news, events, offers and partner promotions.\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Matthew Murphy and Evan Zimmerman | SpamalotReview\n\n4 out of 5 starsThe Round Table musical comes round again on Broadway.Theater, MusicalsRecommendedThursday November 16 2023ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\nIn the extremely funny 1975 movie Monty Python and the Holy Grail, the British comedy troupe's lampoon of Arthurian legend, there is only one fully fledged musical number: a cutaway to the roundly ludicrous knights of Camelot, who dance in armored kicklines and describe themselves in such ridiculous rhymes as \"We sing from the diaphragm a lot\" and \"We eat ham and jam and Spam a lot.\" The very thought of it prompts the questing King Arthur to question his plans. \"On second thought, let's not go to Camelot,\" he decides. \"It is a silly place.\"\n\nCut to the 2005 musical Spamalot, which expands the spirit of that 65-second sequence into a two-act Broadway show. It is a silly piece. Adapted by Eric Idle from the Holy Grail screenplay—with help from composer John Du Prez, and a handful of loaners from other Python sources (notably the Life of Brian song \"Always Look On the Bright Side of Life\")—this tongue-in-cheeky pageant still tells the episodic story of King Arthur (James Monroe Iglehart) and his entourage in search of a vaunted relic. But jokes about medieval legend now take a back seat to metatheatrical tomfoolery about musical theater as a genre. Winking at Broadway conventions in a succession of zanily oversold numbers, it is essentially an ongoing parody of itself—so much so that when Gerard Allesandrini spoofed Spamalot for his Forbidden Broadway series, he simply had his actors perform an actual song from the show, \"The Song That Goes Like This.\"\n\nSpamalot | Photograph: Courtesy Matthew Murphy and Evan Zimmerman\n\nMind you, Spamalot's cavalier attitude does not extend to everything about itself. In one regard, it is reverent to a fault: It delivers much of its Python material word for word, and although the movie is nearly 50 years old, some of its most famous bits (the Black Knight, the French Taunter, the Knights Who Say \"Ni!\") continue to elicit entrance applause of recognition. While this provides fan service for those in the audience who grew up obsessively memorizing the film—a group that includes, full disclosure, me—this familiarity is a double-edged Excalibur; Spamalot's comedic reproductions inevitably have the somewhat diminished quality of an echo. For better or worse, it's what might be called a jokebox musical.\n\nSo while I enjoyed the original Spamalot, which was a hit and won a Tony for Best Musical, I didn't love it the way some others did. My reaction to its new and updated—if still slightly dated—Broadway revival, directed and choreographed with flair by Josh Rhodes, is more affectionate. True, this production lacks the outsider pedigree of Mike Nichols's 2005 version, whose faintly above-it-all attitude (which extended to the expert performances of top-billed stars Tim Curry, David Hyde Pierce and Hank Azaria) was part of its appeal to audiences that were tentatively rediscovering the pleasure of musicals in a post-Producers world. But Rhodes's cast of show-tune pros is highly capable, and the show's laughter now seems more like it's coming from inside the Broadway house. It's a true ensemble effort, with most of the actors assuming multiple parts in the Python manner; playing off Iglehart's straight man, they include Michael Urie as the yellow-bellied Robin, Christopher Fitzgerald as the put-upon Patsy and Saturday Night Live alum Taram Killam as the chivalrous Lancelot, as well as Ethan Slater, Nik Walker and Jimmy Smagula. Joined by a lively chorus on the storybook castles of Paul Tate dePoo III's set, and bedecked in Jen Caprio's merry costumes, they dance a lot, prance a lot and sometimes even romance a lot.\n\nIn this company of men, however, it is a woman who really dazzles: Leslie Rodriguez Kritzer as the sword-bestowing Lady of the Lake, whom the show depicts as an attention-hungry prima donna. This is the showcase role that longtime Kritzer fans—another group that includes, full disclosure, me—have been waiting for, and she grabs it by the throat in a full-tilt comedic and vocal tour de force, culminating in the delightfully ostentatious \"Diva's Lament.\" It's in the Lady of the Lake's spotlight moments, the show's biggest departure from the nearly all-male Grail, that Spamalot comes into its own most effectively and takes flight—not as an African swallow, capable of carrying significant weight, or merely as a parrot, possibly dead, but as what it is: a lark.\n\nSpamalot. St. James Theatre (Broadway). Book and lyrics by Eric Idle. Music by John Du Prez and Idle. Directed by Josh Rhodes. With James Monroe Iglehart, Leslie Rodriguez Kritzer, Michael Urie, Taran Killam, Christopher Fitzgerald, Ethan Slater, Nik Walker, Jimmy Smagula. Running time: 2hrs 20mins. One intermission.\n\nFollow Adam Feldman on X: @FeldmanAdamFollow Time Out Theater on X: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nSpamalot | Photograph: Courtesy Matthew Murphy and Evan Zimmerman\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us",
  "isFullReview": true,
  "dtliExcerpt": "My reaction to its new and updated—if still slightly dated—Broadway revival, directed and choreographed with flair by Josh Rhodes, is more affectionate.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/spamalot/",
  "needsScoring": true,
  "textWordCount": 1133,
  "archivePath": "data/archives/reviews/spamalot-2023/time-out-new-york--adam_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:01:56.850Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250420132519",
  "archiveOrgUrl": "http://web.archive.org/web/20250420132519/https://www.timeout.com/newyork/theater/spamalot-review-broadway-musical-revival-monty-python"
}