{
  "showId": "john-lithgow-stories-by-heart-2018",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "David Canfield",
  "url": "http://ew.com/theater/2018/01/11/john-lithgow-stories-by-heart-review/",
  "playbillVerdictUrl": "http://ew.com/theater/2018/01/11/john-lithgow-stories-by-heart-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n \n\nTop Stories\n\n1\n\nRosie says she and Ellen never resolved their issues \n\n2\n\nBill Maher responds to Larry David's essay mocking his dinner with Trump\n\n3\n\nBowen Yang calls J.D. Vance 'a pope killer' on 'The View'\n\n4\n\nDavid Kinne says girlfriend left him after he didn't win 'Survivor'\n\nJohn Lithgow's Stories by Heart is an acting masterclass, but not much else: EW review\nLithgow's acting prowess can't overcome a disjointed script\n\nJohn Lithgow never goes more than a few years without appearing on Broadway, but his newest production still marks something of a late-career breakthrough. His one-person show, Stories by Heart, premiered Off-Broadway in 2008, at the Lincoln Center Theater; in the decade since, he’s taken the show around the country, refining it as he’s moved from city to city. Finally, after being produced in dozens of regional theaters, Stories by Heart has made it to the Great White Way.\n\nThis play is a deeply personal one for Lithgow. Neatly dressed and with a warm smile, he channels his audience’s sense of anticipation upon entering the stage. “So what the hell is this?” he asks, knowingly, before guiding us through the show’s most significant moments. Lithgow takes on the role of an old-fashioned storyteller as he dictates every twist and turn. There’s an innocence to his demeanor which is very much by design: The show is inspired by the times he and his siblings would listen to their father read short stories to them, and transport them to thrilling, imagined worlds.\n\nThis is ultimately a basic piece of theater that never really digs below its cozy, slightly drab surface. Each of the play’s two acts is constructed as follows: one-third background from Lithgow, reminiscing on his childhood or the power of storytelling, and two-thirds his solo performance of a classic short story. The production is strikingly bare-bones — as if you’ve walked into a dusty study that’s just been cleared out for a house move, with only a chair, small desk, and thick ol’ storybook remaining. There is no flourish here. All eyes are meant to be on Lithgow as he loosely moves about, all ears on the tales he spins with vigor.\n\nThe two stories Lithgow chooses are Ring Larder’s tragicomic “Haircut” and P.G. Wodehouse’s slapstick “Uncle Fred Flits By.” Lithgow introduces them, tells us why he’s going to read them — both were read to him as a kid, and he also read “Uncle Fred” back to his father more recently when he had to take care of him — and acts them out exuberantly in their entirety.\n\nIt’s that last detail, perhaps, which explains why Stories by Heart ends up feeling so disjointed. As an actor, Lithgow does brilliant work here, effortlessly veering between the personas of a grieving small-town barber and a collection of snickering and foolish Brits, while also leaving plenty of room to be himself. But the play itself is clunky and a smidge too earnest for its own good. Its PBS-ified, childlike nature gives way to a sort of aimless simplicity. His anecdotes about growing up and growing old feed into stories that hardly deal with those subjects.\n\nThe stories are also dramatically different from one another. “Haircut” at least fits thematically, as it provides a character study of a man telling a story of his own — a story that’s tragic, but that he treats like fleeting community gossip to avoid facing its implications. That the barber rambles on and laughs through disturbing revelations is entirely the point of the story, but it works far better on paper than on a huge Broadway stage, where it’s easy to lose the audience in the run-on details. “Uncle Fred Flits By,” meanwhile, feels superfluous in its comedy of manners, a seemingly random addition to the play — no matter its particular significance to Lithgow — even as it’s better overall entertainment.\n\nIndeed, when taking the play as a whole, the inclusion of these literary classics can almost feel like a distraction from Lithgow’s own performance of memoir. The actor-playwright’s relatively short descriptions of what the stories mean to him — of the role they’ve played in his life — wind up more compelling than the stories themselves. Before he performs “Uncle Fred,” which takes up far too much oxygen right through to the production’s endpoint, Lithgow intimately describes why he’s decided to share it. He poignantly recalls how he’d forgotten the Wodehouse tale in the years since his youth, until he dug it up again after his father got sick, so despondent it looked like he may have given up. As Lithgow tells it in the most beautiful passage of Stories by Heart, “Uncle Fred” brought them back to a different, happier time — and it woke his father up.\n\n“My father started to laugh — a kind of helpless gurgly laugh, almost in spite of himself,” Lithgow tenderly remembers of reading “Uncle Fred” to his elderly father. “It was like the engine of an old car, starting up after years of disuse. I kept reading and he kept laughing — harder and harder, until he was almost out of breath … It was the most wonderful sound. And I’m convinced that it was sometime during the reading of that story that my father came back to life.”\n\nNow that’s how you tell a story. B-",
  "isFullReview": true,
  "textWordCount": 894,
  "archivePath": "data/archives/reviews/john-lithgow-stories-by-heart-2018/ew--david-canfield_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:33:22.058Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250427142823",
  "archiveOrgUrl": "http://web.archive.org/web/20250427142823/https://ew.com/theater/2018/01/11/john-lithgow-stories-by-heart-review/",
  "contentTier": "complete",
  "wordCount": 894,
  "tierReason": "Full review text"
}