{
  "showId": "john-lithgow-stories-by-heart-2018",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "http://www.nytimes.com/2018/01/11/theater/review-john-lithgow-stories-by-heart-broadway.html?_r=0",
  "playbillVerdictUrl": "http://www.nytimes.com/2018/01/11/theater/review-john-lithgow-stories-by-heart-broadway.html?_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright"
  ],
  "fullText": "“Check, check,” goes the razor. “Scha, scha, scha,” goes the strop.\n\nBut there is no razor; there is no strop.\n\nThe only thing making noise onstage during John Lithgow’s “Stories by Heart,” which opened Thursday evening at the American Airlines Theater, is Mr. Lithgow himself. Reciting Ring Lardner’s 1925 short story “Haircut,” set in a small-town barbershop in the Midwest, he brings an anthropologist’s specificity (and a Foley artist’s ingenuity) to every swoop of the apron and slap of the pomade that accompanies the main character’s monologue.\n\nSo, to begin with, give Mr. Lithgow a sound effects award.\n\nAnd then give him one for spiritual effects, because “Stories by Heart” is delightful: illuminating the stories, uplifting us.\n\nI have to admit I didn’t expect to enjoy such an old-fashioned show; delight, illumination and uplift feel like debased currencies in 2018, purchasing nothing. Furthermore, I knew that Mr. Lithgow had been performing “Stories by Heart” for 10 years. A one-act version was first staged in 2008 at Lincoln Center Theater; since then he has brought it to some 35 cities while “leading the life of a time-warp vaudevillian.”\n\nThat was just what worried me: the possibility of past-its-prime ham. (Mr. Lithgow has never been uncomfortable with the grand style.) “Stories by Heart” seemed to be the kind of quick and cheap show that a theater company, in this case the Roundabout, mounts when there’s a hole in its schedule or budget. (The production, directed by Daniel Sullivan, is luxurious only in Kenneth Posner’s lighting.) Besides, who needs the equivalent of a bedtime fairy tale on Broadway when you can have your phone read you “Moby-Dick” on the subway?\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 301,
  "archivePath": "data/archives/reviews/john-lithgow-stories-by-heart-2018/nytimes--jesse-green_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:17:52.603Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203940",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203940/https://www.nytimes.com/2018/01/11/theater/review-john-lithgow-stories-by-heart-broadway.html?_r=0",
  "contentTier": "complete",
  "wordCount": 301,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T01:20:11.059Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is truncated and ends with a technical error message about retrieving content and enabling JavaScript, making it impossible to determine the critic's final verdict.; openai: The text is cut off with a message about trouble retrieving the article content, indicating it is not a complete review.",
  "promptVersion": "5.2.0",
  "showScoreExcerpt": "\"To begin with, give Mr. Lithgow a sound effects award. And then give him one for spiritual effects, because 'Stories by Heart' is delightful: illuminating the stories, uplifting us...Though golden enough for any nostalgist, 'Stories by Heart' is neither soporific nor cute. For starters, the two stories that Mr. Lithgow recites are superb, outlandish and, in very different ways, hair-raising.\"\n\nRead more"
}