{
  "showId": "in-the-heights-2008",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/heights-theater-review-118593/",
  "publishDate": "March 9, 2008",
  "fullText": "It’s part of USA Network’s “Monk” legend by now that star Tony Shalhoub had doubts about portraying Adrian Monk. Thinking he just wouldn’t be any good as the OCD-plagued investigator, Shalhoub took his sweet time before accepting the role.\n\nBut all concerned have been happy since: Six Emmy nominations (and three wins), a pair of SAG Awards and a Golden Globe later, Shalhoub can rest assured he’s doing OK in the part. USA, which saw its fortunes turn around thanks to the success of the show, is also pretty pleased.\n\nOn the eve of the show’s landmark 100th episode, The Hollywood Reporter’s Ray Richmond spoke with Shalhoub and discovered there isn’t much of a gap between the actor and the detective.\n\nHollywood Reporter: How much Adrian Monk is there in Tony Shalhoub?\n\nTony Shalhoub: When you play a character as long as I have this one, it’s sort of inevitable that it becomes a part of you, as much as I’ve tried to keep their two lives separate. I do find myself becoming preoccupied with more insignificant things than perhaps I would have before. Fortunately, I don’t think it’s fatal. It’s just part of the cost. By “cost,” you mean that playing a role takes a little bit of the actor’s personality away?Shalhoub: There is always a price exacted, psychologically and emotionally. A piece of yourself goes with it. It really does take a part of you.\n\nTHR: What were your reservations about agreeing to play Monk?\n\nShalhoub: Frankly, it was a little daunting. I wasn’t sure I could meet the challenge. I mean, the idea of doing a character who was sort of irritating — I wondered if it might be irritating to viewers, too, and whether it would turn people off. I honestly wasn’t sure if I could do it effectively or if I could do it justice. THR: You’ve come around on that score, I imagine.\n\nShalhoub: All I can tell you is that the work remains hard and challenging and truly enjoyable, in part because I so trust and respect the actors who surround me and the people I’m working for. I never dreamed that the show would still be so profoundly challenging after this many years. We’re still able to explore the relationships very deeply and involve Monk in fresh new predicaments every week. That’s particularly true of our 100th episode. THR: Especially on cable, 100 episodes is a real accomplishment, so you must be very proud.\n\nShalhoub: It surely is a very long run. You don’t get to see too many of these during your career, if you even see one. We’ve had to overcome certain hurdles along the way in terms of cast changes, time slot changes, the death of a main character when we lost Stanley. (Actor Stanley Kamel, who portrayed Dr. Charles Kroger, died in April.) Through it all, the audience has been extraordinarily loyal to us. THR: In large part that’s always the case, isn’t it? If they don’t watch, you go off the air. But “Monk’s” ratings haven’t wavered much over seven seasons.\n\nShalhoub: I’m stunned at how loyal this audience is. They’re devoted to the point of being obsessed, like Monk himself. They’ll approach me on the street and talk about a focus and preoccupation with the smallest minutiae and little clues. THR: Isn’t that a little frightening?\n\nShalhoub: Fortunately, it’s all very well-meaning. We’re hopeful that remains the case.",
  "isFullReview": true,
  "dtliExcerpt": "Lin-Manuel Miranda's exuberant musical about Latino life in Washington Heights is a vital shot of pure energy that sends audiences out of the Richard Rodgers Theatre on a high.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Lin-Manuel Miranda's exuberant musical about Latino life in Washington Heights is a vital shot of pure energy that sends audiences out of the Richard Rodgers Theatre on a high.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 572,
  "archivePath": "data/archives/reviews/in-the-heights-2008/hollywood-reporter--david-rooney_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:56:37.005Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 572,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-06T15:27:26.619Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is an interview about the TV show 'Monk' with Tony Shalhoub, not a review of a Broadway production; openai: This text is an interview about the TV show 'Monk' and Tony Shalhoub's role in it, not a review of a Broadway show.; gemini: This is an interview with Tony Shalhoub about the TV show Monk, not a review of a Broadway play.; kimi: This text is an interview about the USA Network television series 'Monk' starring Tony Shalhoub, discussing the show's 100th episode and the actor's experience playing the character. It is not a review of a Broadway theatrical production.",
  "promptVersion": "5.2.0"
}
