{
  "showId": "the-snow-geese-2013",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://variety.com/2013/legit/reviews/broadway-review-the-snow-geese-1200758641/",
  "playbillVerdictUrl": "http://variety.com/2013/legit/reviews/broadway-review-the-snow-geese-1200758641/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "Despite some strong perfs, this bland Chekhov wannabe never takes flight\n\nMary-Louise Parker is much too delicate and entirely too fashionable (in stunning widow’s weeds designed by Jane Greenwood) to be stuck in Syracuse in the dead of winter and at the end of the Gilded Age in America. But that’s the price of playing a Chekhovian heroine in “The Snow Geese,” Sharr White’s bland homage to the master of upper-class existential malaise. The family in this domestic drama is, indeed, as melancholy as any family in a Russian play. But they’re so shallow and self-centered that they are welcome to their misery.\n\nFaced with financial ruin after the recent death of her profligate husband, plucky Elizabeth Gaesling (Parker) is determined to honor his memory by staging one last shooting party on the family estate in upstate New York. In “The Other Place,” White proved himself sensitive to the emotional attachment that people have always had to their beloved family homesteads, and “The Snow Geese” speaks to that devotion.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nJohn Lee Beatty has designed an imposing country home in the grand manner, its lustrous wood furnishings and intricate decorative details the last word in tasteful elegance. The place practically melts with warmth, in Japhy Weideman’s lighting design. And that ancient evergreen forest on the property gives the home place a sense of eternity. No wonder the Gaesling family can’t bear to leave.\n\nIn recent years — that is, since the beginning of World War I — the lodge has also served as a safe refuge from the “Germanaphobia” raging in the city. A good bit of that ill-will has been directed toward Elizabeth’s sister, Clarissa (a quiet sufferer, in Victoria Clark’s perceptive perf), and her German-born husband, Max Hohmann (who grows in stature in Danny Burstein’s ennobling perf), a German-born doctor deserted by his patients.\n\nHelmer Daniel Sullivan has done his customary classy job of giving the production a unifying look, but the show lacks a sturdy performance backbone. Clark and Burstein are plenty solid as the unhappy Hohmanns, and Jessica Love is quietly compelling as Viktorya Gryaznoy, a Ukrainian immigrant of good birth, forced to work as a cook.\n\nBut whatever dramatic tension there is in this static drama comes from the interplay between Elizabeth and her two sons — the pampered pretty boy (Evan Jonigkeit) who accepts all social privileges as his due, and the pragmatic younger son (Brian Cross) struggling with the family’s hopeless finances — and neither thespian is up to the job. This leaves Parker adrift and more inclined to offer a star turn than the grounded performance needed to keep this wispy play from flying away to go where the wild geese go.",
  "isFullReview": true,
  "textWordCount": 475,
  "archivePath": "data/archives/reviews/the-snow-geese-2013/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:41:04.845Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 475,
  "tierReason": "Full review text",
  "bwwExcerpt": "Mary-Louise Parker is much too delicate and entirely too fashionable (in stunning widow's weeds designed by Jane Greenwood) to be stuck in Syracuse in the dead of winter and at the end of the Gilded Age in America. But that's the price of playing a Chekhovian heroine in 'The Snow Geese,' Sharr White's bland homage to the master of upper-class existential malaise. The family in this domestic drama is, indeed, as melancholy as any family in a Russian play. But they're so shallow and self-centered that they are welcome to their misery.",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-SNOW-GEESE-Opens-on-Broadway-Updating-LIVE-20131024"
}
