{
  "showId": "hangmen-2022",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Hangmen/1073",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Hangmen/1073",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $59\n Buy Tickets\n\nCititour.com Review\n From his breakthrough play, “The Beauty Queen of Leenane,” through his recent Oscar-winning film, “Three Billboards Outside Ebbing, Missouri,” Martin McDonagh has never shied away from examining the extremes of human behavior, whether it is unbelievably quirky, unbearably arrogant or extremely self-destructive. Therefore, it’s no surprise that he has does so again in the sharp-edged “Hangmen,” now at Broadway’s Golden Theatre under Matthew Dunster’s keen direction.\n\nLike many of McDonagh’s other plays, it’s a bit of slow burn during the first act (and the authentic-sounding accents can be challenging). Luckily (if not unexpectedly), there’s a huge payoff in Act II, which is where McDonagh’s gifts for melding black comedy, tragedy and surprise come together with peerless skill.\n\nAfter a brief but important prologue set in 1963, the show’s set changes dramatically -- thanks to the expert skills of designer Anna Fleischle – and we land in 1965 in a pub in Northern England owned by the self-aggrandizing, short-tempered, boorish Harry Wade (a truly stupendous David Threlfall) who -- until that very day – had been one of the last two hangmen (executioners) still working in England. \n\nNow relegated to pouring pints alongside his long-suffering wife Alice (an excellent Tracie Bennett) and dealing with the quicksilver moods of his teenage daughter Shirley (the pitch-perfect Gaby French), Harry spends that day entertaining his oafish cronies (memorably played by Jeremy Crutchley, Richard Hollis, Ryan Pope, and, especially, the hilarious John Horton as the half-deaf Arthur) and being subtly cajoled into giving an ill-advised newspaper interview to an intrepid young reporter (Owen Campbell). \n\nBut what ultimately makes this day most memorable is the sudden arrival of Peter Mooney (former “Game of Thrones” star Alfie Allen), a handsome, young, and “vaguely menacing” fellow from the southern part of UK who does little to ingratiate himself with Harry or Alice, even as he claims to want to rent a room above Harry’s pub.\n\nAre his motives suspect or innocent? Is he somehow connected to the murders of two young women, one of whom another man has already been hanged for? Does he have sinister plans for Shirley, whom he ultimately befriends? McDonagh teases us with these questions throughout the rest of the play, and Allen’s rather bizarre performance may have you thinking you know all the answers. Remember, though, the playwright’s real prowess is his awareness that people don’t always act in conventionally explicable ways.\n\nWhile the well-conceived and adroitly executed plot is one of the show’s many virtues, perhaps its greatest pleasures come from its more incidental moments, such as when Harry’s longtime rival hangman Arthur Pierpont (a forceful John Hodgkinson) forces everyone in the bar to smell his hair, or the development of a long-running gag about Harry’s sheepish ex-assistant Sid (a brilliant Reece Shearsmith) and his supposed fascination with male genitalia (which is given a delicious twist).\n\nWith “Hangmen,” as he has for over two decades, McDonagh once again has set the theatrical bar quite high.\n By Brian Scott Lipton\n\nVisit the Sitehttps://hangmenbroadway.com/CastAlfie Allen, Tracie Bennett, Owen Campbell, Jeremy Crutchley, Gaby French, Josh Goulding, John Hodgkinson, Richard Hollis, John Horton, Ryan Pope, Andy Nyman, David Threlfall, Sebastian Beacon, Pete Bradbury, Katie Fabel, Colin McPhillamyOpen/Close DatesOpening 4/21/2022Closing 6/18/2022\nTheatre Info\nGolden Theatre252 W 45th StNeighborhood: West 40sNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 604,
  "archivePath": "data/archives/reviews/hangmen-2022/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:50:26.511Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 604,
  "tierReason": "Full review text"
}