{
  "showId": "hangmen-2022",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Johnny Oleksinski",
  "url": "https://nypost.com/2022/04/21/hangmen-is-the-best-new-play-on-broadway/",
  "playbillVerdictUrl": "https://nypost.com/2022/04/21/hangmen-is-the-best-new-play-on-broadway/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The new comedy is a heaping scoop of jaw-droppers and taboos — albeit with a sophisticated takeaway about the justice system — that’ll make wimps clutch their pearls for dear life.\n\nThanks for contacting us. We've received your submission.\n\nMooney (Alfie Allen) mysteriously wanders into Harry's (David Threlfall) pub in \"Hangmen\" on Broadway. \n Joan Marcus \n \n \n \n \n \n \n\nYou’re absolutely wracked with guilt at “Hangmen” — from laughing so hard at the many, many inappropriate jokes. A crude sight gag near the end had me practically dry heaving.\n\nThat nonstop naughtiness is what makes Martin McDonagh’s killer satire the best new play on Broadway by a green mile.\n\nTwo and a half hours, with one intermission. At the Golden Theatre, 252 West 45th Street.\n\nThe Brit’s comedy, which opened Thursday night at the Golden Theatre, is a heaping scoop of jaw-droppers and taboos — albeit with a sophisticated takeaway about the justice system — that’ll make wimps clutch their pearls for dear life. The rest of us can’t help but chuckle at the macabre madness.\n\nTake the unusual main characters: an executioner and a maybe-murderer.\n\nThe show is set in 1965 England, just as hanging (their preferred method of capital punishment) has been outlawed. A year after the final offing, Harry (David Threlfall) — a famous hangman — now owns a pub in the north and is a local celebrity for stupid, old drunks. They flock to see the man, who dryly estimates he supervised 233 killings, like he’s Lady Gaga at Joanne’s Trattoria.\n\nSays one doddering old fool: “I don’t even like the pints here, but they’ve got a hangman.”\n\nDrunks flock to the local pub to see the hangman (David Threlfall, left) in the flesh. Joan Marcus\n\nThat impolite, possibly immoral premise shakes you awake. If an American student wrote a play like this one about the death penalty at an Ivy League school, they’d probably get expelled and then banned from Twitter. But McDonagh is the Flying Wallendas of playwrights: he’s addicted to risk, irresistibly confident, and more often than not, reaches the end of an impossibly high tightrope victoriously.\n\nHis “Hangmen” takes place during an odd anniversary for Harry. A year earlier, he executed a man who was convicted of killing a young woman, however, the evidence was scant and the prisoner maintained his innocence till death.\n\nOn this inauspicious day, a gangly chap from London named Mooney (Allen) arrives in the pub, saddles up to the bar and creepily chats up Harry’s 15-year-old daughter, Shirley (Gaby French). Mooney is instantly suspicious but, to McDonagh and Allen’s credit, we kinda like him despite our misgivings.\n\nSimultaneously, we wonder who this mystery man is, did the dead inmate do what he’s accused of and, much later on, if a character we’ve just met is alive or dead.\n\nAnna Fleischle’s surprising set is Broadway’s best of the year. Joan Marcus\n\nAs twisty as McDonagh’s script is Anna Fleischle’s phenomenal set — the best this year of any show, play or musical — that’s a veritable Russian doll of scenic surprises.\n\nPlaying the barflys is an ensemble of stars. While Allen, I’m sure, wants to escape the memory of “Game of Thrones,” he brilliantly brings the same sniveling quality of Theon Greyjoy to Mooney but tacks on some cosmopolitan swagger — a Patrick Bateman with an accent. Threlfall, meanwhile, is the type of big personality character actor a cartoonist couldn’t dream up. He’s burly and hysterical.\n\nTracie Bennett, as Harry’s beleaguered wife, could have been transported from “Fawlty Towers” with her ’60s personality and comic chops, and French handles the difficult job of playing an imperiled teenager with the perfect amount of innocence.\n\nMcDonagh fans will be delighted. The playwright gives his executioner and unhinged pervy weirdo the same sympathetic, funny treatment he gave a Northern Irish terrorist in the also teriffic “The Lieutenant of Inishmore.” In fact, this is his finest play since that one, 16 years ago.\n\nHis “Hangmen” kills.",
  "isFullReview": true,
  "textWordCount": 660,
  "archivePath": "data/archives/reviews/hangmen-2022/nypost--johnny-oleksinski_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:01:52.648Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230527060550",
  "archiveOrgUrl": "http://web.archive.org/web/20230527060550/https://nypost.com/2022/04/21/hangmen-is-the-best-new-play-on-broadway/",
  "contentTier": "complete",
  "wordCount": 660,
  "tierReason": "Full review text"
}