{
  "showId": "hangmen-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2022/04/21/hangmen-gallows-humor-literally/",
  "publishDate": "2022-04-21T21:23:58",
  "fullText": "The run-down, old-fashioned pub providing the main setting for Martin McDonagh’s new play may not be the ideal place to grab a pint. More than one patron describes the overly warm libations as “smelling like piss.” It also attracts a disreputable clientele, including one patron who may or may not be a psychopathic criminal. But one thing’s for sure: you can definitely hang out there.\n\nThat’s because the bar happens to be owned by Harry Wade (David Threlfall), formerly England’s most famous hangman before he was unceremoniously cast out of his job when the death penalty was abolished. Well, actually England’s second most famous hangman, since he’s dwarfed both in reputation and the number of hangings by the celebrated (real-life figure) Albert Pierrepoint.\n\nHangman begins with a flashback, set in 1963, in which we see Harry still efficiently plying his trade. A prisoner (Josh Goulding) struggles vigorously against his fate, loudly proclaiming his innocence and, much to Harry’s annoyance, his chagrin at not being executed by Pierrepoint. But nothing stops Harry from getting on with the business at hand (the explicitly staged scene is not for the squeamish) and then hurrying out for breakfast. “I’m fucking starved,” he proclaims.\n\nThe rest of the play, originally seen at London’s Royal Court Theatre, takes place two years later, when Harry is running his pub in Northern England with the help of his wife Alice (Tracie Bennett). The place attracts its share of regulars, including Bill (Richard Hollis), Charlie (Ryan Pope) and the hard-of-hearing Arthur (John Horton). The other patrons include Clegg (Owen Campbell), a journalist there to interview Harry upon the occasion of the death penalty’s abolition, and Inspector Fry (Jeremy Crutchley), a local policeman.\n\nThe play’s events are set in motion with the arrival of Mooney (Alfie Allen, Game of Thrones), a modishly dressed young man who exudes, as even he will admit, an air of menace. He’s come inquiring about a room for rent above the pub, but alienates Alice with his hair-trigger temper, manifested when he erupts into a vicious tirade when she has the temerity to actually contact his references. He also strikes up a flirtation with the couple’s naïve 15-year-old daughter, Shirley (Gaby French, outstanding), and invites her to join him on an outing.\n\nShirley soon goes missing, with Mooney intimating to his friend Syd (Andy Nyman) that he’s kidnapped her to get revenge on Harry and that her life is hanging by a thread. Which makes his later decision to return to Harry’s pub as if nothing had happened all the more dangerous. Harry, it turns out, hasn’t lost his taste for his former profession.\n\nMixing pitch black comedy with genuine terror, Hangman reveals McDonagh at his most technically accomplished, although not his most profound. Overlong at nearly two-and-a-half hours, the play feels like an extended episode of Alfred Hitchcock Presents, complete with twist ending. Despite its longueurs, however, it’s wonderfully entertaining, thanks to the playwright’s gift for acerbically funny and ever-surprising dialogue, the superb performances by its well-honed ensemble, and Matthew Dunster’s marvelous staging that fully immerses you in the morbidly funny proceedings. Anna Fleischle’s set design, featuring inventive use of the overhead space, is a stunner. While the first act drags at times, the second barrels along at breakneck pace, the highlight being the unexpected arrival of Pierrepoint himself (John Hodgkinson, stealing the show in just a few minutes), who makes clear his intense unhappiness at the way Harry spoke about him in his interview.\n\nBecause of some recasting, the play doesn’t quite have the impact that it did in the 2018 staging at Off-Broadway’s Atlantic Theater Company. Threlfall isn’t as engaging as Mark Addy, who mined greater humor as the prideful Harry, and Allen doesn’t exude nearly the same degree of danger as Johnny Flynn, coming across as more petulant than menacing. And do the Northern English accents have to be so authentic that a good percentage of the dialogue is undiscernible? Nonetheless, Hangman remains a wickedly perverse delight for theatergoers possessing the stomach and fortitude to go along for the ride.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://nystagereview.com/2022/04/21/hangmen-gallows-humor-literally/",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
