{
  "showId": "hangmen-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2022/04/21/hangmen-martin-mcdonaghs-slick-comedy-finally-arrives-on-broadway/",
  "publishDate": "2022-04-21T21:24:27",
  "fullText": "After witnessing boiling-oil burns, point-blank executions, and dead cats, we’ve come to expect a certain amount of violence in a Martin McDonagh play. (See: The Beauty Queen of Leenane, The Pillowman, The Lieutenant of Inishmore, and more.)\n\nYes, a couple of corpses pop up in his latest, Hangmen, now on Broadway after an extended pandemic delay following its 2018 run at the Atlantic. What’s most surprising are all the penis jokes.\n\nYears ago, hangman Harry (David Threlfall, best remembered from Broadway’s Nicholas Nickleby and as the patriarch Frank Gallagher in the original U.K. Shameless series) got his stuttering assistant, Syd (Andy Nyman), canned over a remark about, as Harry says, “the private parts” of a dead Manchester gangster. Huffs Syd: “I didn’t expect to have cocks thrown in me face.” (It made quite an impression: “It were enormous!” says Syd. “It weren’t just long, it were wide…”) How does McDonagh get so much mileage from the word cock? To his credit, he gets even more mileage out of the very common hung-versus-hanged mix-up. And who doesn’t love a good grammar joke?\n\nThe first New York production of Hangmen had a creepier aura; this one—slickly directed by Matthew Dunster—leans more heavily into comedy, capitalizing on Threlfall’s purposely pompous puffed-chest, poker-faced delivery of the most wonderfully absurd lines. On the electric chair: “I’m told when that goes wrong they come out sizzling like a bloody steak! No thank you! I’ll have my executions without the need for fried onions if it’s all the same to you. Yank claptrap!” On the guillotine: “Guillotine’s quick but guillotine’s messy and French.” And don’t get him started on his rival, “Albert bloody Pierrepoint,” arguably the country’s most famous hangman, who apparently hung all the Nazis: “I’d’ve been happy to hang some Germans, I’d’ve been chuffed. I never liked them before the war, let alone during. The accent alone…”\n\nNow that hanging has been abolished (the year is 1965), Harry is running a pub in Oldham, outside Manchester, with his gin-drinking, cigarette-smoking wife, Alice (End of the Rainbow’s Tracie Bennett), and their painfully shy but phenomenally sweet daughter, Shirley (the phenomenally sweet but extremely fast-talking Gaby French), aka “our Shirley.” Their only customers seem to be the too-chatty Bill (Richard Hollis); the near-deaf Arthur (John Horton); Charlie (Ryan Pope), who spends most of his time repeating everything for Arthur’s benefit; and Inspector Fry (Jeremy Crutchley), who probably spends more time than he should at the local. “I don’t even like the pints here, but they’ve got a hangman,” he muses to no one in particular. Which probably explains why Pierrepoint (John Hodgkinson) owns a pub as well.\n\nThe trouble starts when a stranger—the initially intriguing but later menacing Mooney (Alfie Allen, Emmy-nominated for his breakout role as Theon Greyjoy in Game of Thrones)—comes in for a pint and befriends Shirley. One minute the pair are discussing footballers, nuns, and paraplegics, and suddenly they’ve taken an extremely awkward turn into the seaside, sand, and swimsuits. Mind you, our Shirley is only 15 years old.\n\nIs Mooney a pervert? A murderer? Or just a really strange chap who likes to wind people up? We’ll never know. On all of those subjects, the clever McDonagh leaves the audience, you’ll pardon the pun, hanging.\n\nHangmen opened April 21, 2022, at the Golden Theatre and runs through June 18. Tickets and information: hangmenbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
