{
  "showId": "hangmen-2022",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/hangmen-holds-a-tight-noose-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/hangmen-holds-a-tight-noose-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup",
    "bww-reviews"
  ],
  "bwwExcerpt": "Fleischle's set, stunningly lit with bisexual lighting by Joshua Carr, screams money - the turn from prologue to pub is mesmerizing - but not distractingly or crassly so. Under Matthew Dunster's attentive direction, McDonagh's play unfolds with the breezy, engaging tension of the mod rock guitars that punctuate scenes (sound design by Ian Dickinson for Autograph). Hangmen is the kind of play we don't really see anymore. There's no immediate hook for our present day situation; it doesn't bend over backwards to make itself relevant. But it's a welcome callback to the plays that built contemporary theatre: sturdy, well-observed, and vividly performed.",
  "bwwScore": 9,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-HANGMEN-By-Martin-McDonagh-Opens-on-Broadway-20220421",
  "fullText": "Alfie Allen and David Threlfall | Photo: Joan Marcus\n\nThe times are a-changin’ in 1965 England, where capital punishment has just become politically passé. Some rejoice, others scoff, but all must now find a way to fully process their own murderous impulses without leaving much anger dangling. Martin McDonagh’s Hangmen, which had its long-awaited Broadway premiere tonight, is an often hilarious play set at a pub owned by a mild-mannered former executioner, not yet put out of his misery but certainly of his former calling. Starring a sturdy, extraordinarily British cast, it quietly questions our complicity in the bloodshed around us.\n\nFollowing a brief prologue during which a convict promises to haunt the business-as-usual coterie of executioners tying the noose around his neck, the play takes us to the Northern English pub owned by Harry Wade (a sterling David Threlfall). Previously the second-best hangman in all the land, he now tends bar with wife Alice (a spirited Tracie Bennett) and teen daughter Shirley (Gaby French, quirkily funny).\n\nAmid a Greek chorus of barflies (Ryan Pope, Richard Hollis, and a hilarious John Horton) walks a young reporter (Owen Campbell), writing up a puffy farewell to the lost art of execution. McDonagh’s clever, twisty script does away with the newsman’s red herring when the mysteriously confident Mooney (Alfie Allen) enters, inquiring about a room for rent. Mooney’s sweet, though he chews on his pints and has too pointed an eye on Shirley, who’s eager to prove her mom’s assertion that she’s “moody on the inside, mopey on the outside” wrong.\n\nThe cast is uniformly excellent, with Allen imbuing his blank-cypher role with real personality and wit. His motivations are revealed deliberately by McDonagh, who paces his book with an old-timer’s respect for a good ol’ fashioned play. His writerly elegance is matched by Anna Fleischle’s scenic and costume designs, which flex a budget rarely seen for “new” plays (the work has made its rounds through London’s theatre scene, as well as New York’s Atlantic Theatre a few years ago).\n\nFleischle’s set, stunningly lit with bisexual lighting by Joshua Carr, screams money — the turn from prologue to pub is mesmerizing — but not distractingly or crassly so. Under Matthew Dunster’s attentive direction, McDonagh’s play unfolds with the breezy, engaging tension of the mod rock guitars that punctuate scenes (sound design by Ian Dickinson for Autograph).\n\nHangmen is the kind of play we don’t really see anymore. There’s no immediate hook for our present day situation; it doesn’t bend over backwards to make itself relevant. But it’s a welcome callback to the plays that built contemporary theatre: sturdy, well-observed, and vividly performed.\n\nHangmen is in performance through June 18 at the Golden Theatre on 45th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 568,
  "archivePath": "data/archives/reviews/hangmen-2022/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:50:31.922Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251011131309",
  "archiveOrgUrl": "http://web.archive.org/web/20251011131309/https://www.theatrely.com/post/hangmen-holds-a-tight-noose-review",
  "contentTier": "complete",
  "wordCount": 568,
  "tierReason": "Full review text"
}
