{
  "showId": "hangmen-2022",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Helen Shaw",
  "url": "https://www.vulture.com/article/hangmen-broadway-review.html",
  "playbillVerdictUrl": "https://www.vulture.com/article/hangmen-broadway-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nAlfie Allen and David Threlfall.\n Photo: Joan Marcus\n \n \n \n Martin McDonagh’s Hangmen seems like a revival. It’s not — its first run was in 2015 — but there’s something deep in its pipes that feels old, old, old. Some of that is due to the period: McDonagh’s touch for 1960s detail and ear for England’s Northern dialect creates that world-gone-by, as does his paranoid Pinter-manqué atmosphere. But there are also creaks and groans down in the thriller structure itself. Most of the play takes place in a paneled Oldham pub, done in shades of Mancunian brown. When a silver fog drifts through the door, it turns dark. You know this place; the whole thing reeks of stale beer.\n\nIn his rural Irish plays (like The Beauty Queen of Leenane), his films (Three Billboards Outside Ebbing, Missouri), and his masterpiece 2003 play The Pillowman, McDonagh established himself as the guy who writes with knives — slashing dialogue, black humor, and a touch of onstage ultraviolence. There’s a character in Hangmen who is hurt when an accomplice calls him creepy. “Menacing. Not creepy,” he insists, creepily, which is McDonagh in a bloodstained nutshell.\n\nIn Hangmen, the playwright started out thinking about the British death penalty, suspended in 1965 and abolished by the end of the decade. This seems to have turned his attention to the public’s secret, fascist heart. Which is worse, the play wonders, the killer who frightens us or the killer who believes he makes us safe? Hangmen therefore ping-pongs between two Bad Men — the blustery bossyboots Harry Wade and the slithery misfit Peter Mooney — who look at first like diametric opposites. I think there’s a reason those last names evoke the sea and tide, though. Their violence ebbs; their violence flows; one compels the other.\n\nHarry Wade is a hangman — or he was. On the day of the play, the day that Parliament ends capital punishment, he is suddenly out of a job, reduced to pulling pints in his wife’s pub. As played by David Threlfall (unrecognizable behind a bureau-size mustache), Wade is brittle, insecure, and preening, only happy when he can play to his small audience of barflies. The funniest stuff in Hangmen comes from watching pub regulars try to slide ingratiatingly under his boot. If hard-of-hearing Arthur (John Horton) misses one of Harry’s bon mots, Charlie (Ryan Pope) will repeat it for him, louder; then Arthur deflates it with candor. Here they are when a newspaperman comes by to get Harry’s thoughts on the end of capital punishment:\n\nHarry: I do have a comment, lad. “No comment.”\n\nCharlie: That was a good one Harry. “No comment.”\n\nCharlie: Newspaper lad, says, “But you must have a comment, Harry.” Harry says, “I do have a comment. No comment.”\n\nArthur: That were a good one! He just said same thing first lad said.\n\nSet up, double-back, double-down — it works over and over.\n\nBut Harry cannot keep himself from commenting. He violates what should be sacrosanct: He talks to the reporter about how many he killed, about those who cried, about those who protested their innocence (a key plot point), and about another hangman who got his “numbers” up by executing Germans during the war. McDonagh is not a political playwright, by his own emphatic assertion, but here he might as well hang out a banner. Harry and his guys are exactly the sorts of men who would have been get-along, go-along Nazis; the fact that their brown shirts fit under their tweeds shouldn’t distract you.\n\nThen, as the canard goes, a stranger walks into the bar. Peter Mooney (Alfie Allen) is a breath of swinging London, which the parochial Northerners hate. Insouciant and lewd in a skinny tie, he’s clearly shifted well off his moral compass, gliding around like an eel. You scan a McDonagh stage looking for victims, so when the pub owner’s 15-year-old daughter, Shirley (Gaby French), comes running down the stairs, we brace for the hell he’s prepared for her. It is a McDonagh-ish joke that the men of England are also in danger here, though the dialogue makes frequent, oblique inference to raping and dismembering girls.\n\nThe nasty-twisty plot works best in the first half, when its goads are sharpest. McDonagh needs speed and an unbalanced audience to keep his pressures high, but the last third of his play wobbles woozily, like a coaster that’s gone rolling off the bar. Some of this is the fault of director Matthew Dunster’s production, though it looks absolutely gorgeous (Anna Fleischle designed both brown set and brown costumes) and sounds incredible (Ian Dickinson can be thanked for many of the jump-scare transitions). Casting is everything in a show so reliant on its two leads, and here, as was the case when it played downtown, the balance isn’t right.\n\nThrelfall has a wonderful behind-the-beat foulness to him. You know that any time he’s a bit confused, cruelty will follow. (He’s always confused.) Allen, however, can’t keep his side of the see-saw down. You can imagine why you’d want him in the part: His voice has an eerie, lilting quality, and his eyes slide weirdly in his head, as if they’ve been oiled. But there’s no blade in the scabbard, there’s no rock in the glove. Everything in Hangmen depends on our fear of Mooney dragging us forward, too quickly to notice the banality-of-evil stuff, which is meant to sink in later. Allen as Mooney hasn’t got the gravity, or the menace. He doesn’t even have the creepiness.\n\nI’ve seen Hangmen three times now, with different casts in different theaters: on London’s West End, at the Atlantic Theater downtown, now on Broadway. That’s not the way to preserve the shock of a plot reveal, though my terrible memory does help me out in that department. It’s useful for thinking about the playwright, though. The playwright’s not always funny when he wants to be; he has Harry make a series of digs at Shirley about her weight, and these go over like lead balloons. What does work each time is McDonagh’s men-are-clowns joke structure. There’s something about punters being cruel to each other that lights up his inner Muse.\n\nThe play’s convictions seem simple: Capital punishment is bad. We’re certainly not in favor of serial murderers. But the play is also making a deeper critique of comedy here — particularly the vicious humor McDonagh is so good at. Everything bad under the sun was done to amuse the boys down at the pub; McDonagh shows us how a snickering impulse can end in pain and injustice and death. When you hear Hangmen itself using cruelty to joke, your ears prick up. If the play works correctly, your own next laugh will come more slowly. Someone will be mean, and you will try to giggle, but then your conscience will loop around your throat — and go tight.\n\nHangmen is at the Golden Theatre.\n\nShow \n \n \n Comment\n \n\n In Martin McDonagh’s Hangmen, Cruelty Provides the Muse\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1188,
  "archivePath": "data/archives/reviews/hangmen-2022/vulture--helen-shaw_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:10:49.204Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251003034716",
  "archiveOrgUrl": "http://web.archive.org/web/20251003034716/https://www.vulture.com/article/hangmen-broadway-review.html",
  "contentTier": "complete",
  "wordCount": 1188,
  "tierReason": "Full review text",
  "bwwExcerpt": "The nasty-twisty plot works best in the first half, when its goads are sharpest. McDonagh needs speed and an unbalanced audience to keep his pressures high, but the last third of his play wobbles woozily, like a coaster that's gone rolling off the bar. Some of this is the fault of director Matthew Dunster's production, though it looks absolutely gorgeous (Anna Fleischle designed both brown set and brown costumes) and sounds incredible (Ian Dickinson can be thanked for many of the jump-scare transitions). Casting is everything in a show so reliant on its two leads, and here, as was the case when it played downtown, the balance isn't right.",
  "bwwScore": 6,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-HANGMEN-By-Martin-McDonagh-Opens-on-Broadway-20220421"
}
