{
  "showId": "the-nap-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2018/09/27/the-nap-no-farce-please-were-british/",
  "publishDate": "2018-09-27T21:29:31",
  "fullText": "When I was a kid, in those pre-streaming days when people still idly channel-surfed and local channels filled late-night hours with sitcom reruns, the anglophiles at WNET had a particular fondness for BBC comedies. Fawlty Towers was the best-case scenario, but many of those reruns, or at least this is what it feels like in my memory, were well sub-Fawlty. They were recognizable as sitcoms but also simulacra of them, by virtue of their Britishness and their mediocrity. They looked different, thanks to divergent pre-digital tech standards, they were 40 or 45 minutes long, rather than the usual 30, they tended toward slapstick, and they weren’t especially funny, at least not to an American.\n\nThe Nap, which opens tonight in a Manhattan Theatre Club production at the Samuel J. Friedman, is the staged version of those not-quite-right British sitcoms. It is funny, but less funny than you’d like it to be. It entertains, but it is instantly forgotten. You can’t shake the feeling that you’re missing something.\n\nAnd, of course, assuming you’re an American, you are missing something.\n\nThe Nap centers around the World Snooker Championships, held each year in Sheffield, in northern England. Snooker is the British version of pool—invented, as the play accurately tells us, by Imperial officers in India in the late 19th century. And the comic plot involves a gangster’s scheme to have an up-and-coming snooker star, Dylan Spokes (Ben Schnetzer), throw a “frame” of a match for their wagering benefit.\n\nAlong the way, we meet Dylan’s soccer hooligan of a father (John Ellison Conlee), his bimbo of a mother (Johanna Day), and the local gangster who’s masterminding everything, a transgender woman with a fake arm named Waxy Bush (Alexandra Billings), who is prone to outrageous malapropisms. You can see how this might feel like a silly British sitcom.\n\nIt could also be, and was clearly hoped to be, a great British farce. The Nap is written by Richard Bean, whose uproarious One Man, Two Guvnors played the Music Box, and won carpool karaoke-er-to-be James Corden a Tony Award, in 2012. That play, adapted from the 18th century Italian comedy Servant of Two Masters, was a masterpiece, carefully constructed, precisely staged, and played to perfection by Corden.\n\nBut The Nap, equally well performed, never ascends to any giddy farcical heights. It remains consistently, stubbornly, mildly amusing. There is nothing laugh-out-loud funny. This is most likely because—and this should come as a surprise to no one—Americans are not primed for snooker humor.\n\nSure, a spoof of the self-seriousness of a minor sport can translate across languages. But The Nap—the title, by the way, refers to the texture of the fabric on a billiards table—is conceived, at its base, as an English in-joke. Every character is an English stereotype. The play debuted in Sheffield, in a theater called the Crucible, that is most famously home to the actual annual snooker championships. The final section, with deadpan commentators following that final match (cleverly staged here by MTC stalwart Daniel Sullivan), evokes the Christopher Guest movie Best In Show. It’s amusing. But not as amusing as if a live version of Best In Show was mounted on the Westminster set in Madison Square Garden.\n\nInstead, what we get is a pleasant, provincial-British diversion. Whoever thought this would be a Broadway hit was simply—it’s unavoidable to say—snookered.\n\nThe Nap opened September 27, 2018, at the Samuel J. Friedman Theatre and runs through November 11. Tickets and information: thenapbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial"
}
