{
  "showId": "the-nap-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/09/27/the-nap-all-balled-up-in-sheffield/",
  "publishDate": "2018-09-27T21:30:34",
  "fullText": "Get snookered, go see The Nap.\n\nRichard Bean, who gave us the blissfully funny One Man, Two Guvnors, returns to Broadway with a tale of snooker. Championship snooker, that is, with the action climaxing in what you or at least Bean might call a championship battle of the balls.\n\nSnooker is something of a variation of billiards; in the realm of The Nap, it is a major sport complete with high-profile, live television coverage. The Nap originated at the Crucible Theatre in Sheffield, in South Yorkshire; the World Snooker Championship has, since 1977, been telecast from the stage of the Crucible. The “nap” refers to the seam of the baize, that green felt covering on pool tables. When you play “with the nap,” the ball runs straight.\n\nMost fortunately for local audiences, snooker turns out not to be some complicated sport like cricket; the game is quickly and easily explained, and the two matches that make up parts of the evening are live-cast above the stage so we can literally see the action. (While the playwright clearly has an intended victor, he has contrived two endings—lest the wrong actor “pots the black” and wins the championship.)\n\nDylan (Ben Schnetzer) is a local boy who has dedicated his life to the game, thus avoiding the usual dead-end fate of everyone else; a prime example of which is his father Bobby (John Ellison Conlee), a retired ex-con bank robber/drug dealer. As Dylan prepares for the championship, he is distracted by a muddle of misfits: His wayward mother, Stella (Johanna Day); her odorous romantic entanglement, Danny (Thomas Jay Ryan); Dylan’s colorfully-coordinated, lizardish manager, Tony (Max Gordon Moore); and a notorious mobster named Waxey Bush (Alexandra Billings), who has lost not only her right hand—like Nicholas Cage in Moonstruck, and that’s worth about five minutes of laughter—but an apparently even bigger appendage in a sex-change operation. All of this brings forth barrels and barrels of jokes.\n\nComplications arrive with the appearance of personable detective Eleanor (Heather Lind) and Mohammad Butt (Bhavesh Patel), integrity officer from the International Centre for Sport Security. The pair are investigating a suspicious bet on Dylan’s last match, and he has no recourse but to cooperate with them on a sting operation. Or is it a sting operation? And just who is going to be stung, or snookered?\n\nFans of One Man, Two Guvnors will recall that Mr. Bean possesses a comic sense which is wild, fantastic and at times insane. He doesn’t simply offer a barrage of jokes; he plants them, marinates them, and finally allows them to burst forth at his hapless auditors. Daniel Sullivan, director of Good People, Rabbit Hole and countless worthy dramas, reveals a perhaps unsuspected flair for comedy both verbal and visual.\n\nSullivan and the folks at Manhattan Theatre Club have seen fit to enlist set designer David Rockwell, who has something of a field day. Costume designer Kay Voyce has outfitted the Sheffield locals in some outrageously impossible leisure ware. With one exception: Tony the manager looks like an orange serpent (with loafers and no socks) in his first scene, turned lavender in the second and raspberry in the finale. Which is to say that director and designers gleefully accommodate the author, while the cast comports itself in high comic style.\n\nNo, The Nap is not quite as broad as One Man; it would be unreasonable to expect it to be, wouldn’t it? But it is easily the funniest new play on Broadway. So go get snookered.\n\nThe Nap opened September 27, 2018, at the Samuel J. Friedman Theatre and runs through November 11. Tickets and information: thenapbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://nystagereview.com/2018/09/27/the-nap-all-balled-up-in-sheffield/",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
