{
  "showId": "the-wiz",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2024/04/17/the-wiz-not-an-oz-picious-revival/",
  "publishDate": "2024-04-17T22:55:49",
  "fullText": "Those with fond memories of M-G-M’s 1939 Wizard of Oz, or William F. Brown and Charlie Smalls’ brash, funky 1975 Tony winner The Wiz, might elect to give the current revival of the latter a pass. It could break your heart. On the other hand, devotees of American Idol oversinging, or the plotless buffoonery of traditional British panto, can safely ease on down the road to the Marquis Theater.\n\nMost of the beats that you remember from past versions are gone or strangely altered. At rise, we hear “Dorothy! A tornado’s coming,” and Aunt Em (Melody A. Betts) emerges to persuade her lonely niece (Nichelle Lewis) to bring in the wash. The storm obligingly waits for Em to deliver two pages of exposition about Dorothy’s late parents and her bullies at school, and fixes the locket those bullies busted while singing about “The Feeling We Once Had.”\n\nBoom! A projection effect blows open the farm and we end up in… New Orleans? Well, not Munchkinland, anyway. (No Munchkins.) But there’s a dead witch under the house for sure, and a colorfully garbed ensemble of Ozians dancing and vogueing everywhere. I have never seen so much vogueing in a single musical. In the poppy field, outside the Emerald City, inside the Emerald City and in the Wicked Witch’s castle. Vogueing and athleticism, that’s Oz’s signature. (JaQuel Knight’s choreography is impressive at first, but doesn’t wear well with repetition.)\n\nAnother witch, Addaperle (Allyson Kaye Daniel) makes jokes at her late sister’s expense: “She flat. Flat as she can be. I mean, this woman is so flat that instead of a coffin, we are gonna use a manila envelope.” Enter Glinda (Deborah Cox): “Wow, you look like an angel.” “Thanks, I moisturize.” Amber Ruffin is credited with “additional material for this production,” but after her sharp work on Some Like It Hot’s book I am loath to ascribe any of these groaners to her. Wanting to go home, Dorothy is pointed in the Wiz’s direction but must assume the corpse’s silver slippers to “Ease On Down the Road.” Yet it’s not a road at all, just a cadre of drum majors in yellow capes and big black hats. Couldn’t anyone come up with something yellow on the floor for the characters to walk on?\n\nDorothy encounters the usual suspects, but what do you know, the Wicked Witch was responsible for everyone’s woes: stealing the heart of the Scarecrow (Avery Wilson), rusting the Tinman (Phillip Johnson Richardson); and scaring the guts out of the Lion (Kyle Ramar Freeman). Turns out the Wiz (Wayne Brady, bland and underused) and the Emerald City generally have similarly been cursed, for no one may leave its gates. So Dorothy’s tracking down Evillene (Betts again) is actually pointedly motivated, and rendered pretty easy, too, what with the Witch telegraphing her Achilles heel (“What is a bucket of water doing up here? Guards, take it away!”).\n\nUnder Schele Williams’ direction, the story is perfunctory, just a series of disconnected scenes. Moment by moment there is little character reality to play: Dorothy’s need to get home is never felt, and there’s no urgency in her journey. Songs and dances don’t arise naturally from the action, just one big variety show. I lost count of the number of songs that shoot up to a high note designed (successfully) to elicit spontaneous applause. Of the cast, Richardson comes off best because he’s allowed most of the time to speak like a normal person. Betts is a warm, nurturing Aunt Em anyone would click their heels to come home to, but with everyone shouting like crazy, her Evillene never becomes scary. She’s just one more yeller.\n\nAs for Dorothy, young Ms. Lewis has undeniable star quality, and it’s not her fault that she seems confused as to whether, at any given moment, she’s supposed to be worried, bold, sassy, or Dr. Phil. (Yes, she’s constantly giving advice, and it’s she, not the Wiz, who wraps up the plot.) Never mind, there are good things in this young lady’s future, you can bet.\n\nTo be completely honest, the show has always had a tough time of it. The original production was drastically unsuccessful during its tryout, until the producer fired the director and handed over the reins to Geoffrey Holder, at that point the show’s costume designer. He was widely credited with turning the show into a hit. This time around, perhaps they opted for a place holder instead of a Holder in place.\n\nI should also point out that nobody bites the Witch in this version, because Dorothy’s dog has been excised. In toto.\n\nThe Wiz opened April 17, 2024, at the Marquis Theatre. Tickets and information: wizmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars"
}
