{
  "showId": "it-shoulda-been-you-2015",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "http://newyorktheater.me/2015/04/14/it-shoulda-been-you-review-the-worst-wedding-on-broadway/",
  "publishDate": null,
  "fullText": "The singular accomplishment of “It Shoulda Been You,” a musical comedy about a wedding that tries hard to be a farce, is that it abruptly swerves in a completely unexpected direction, and yet still manages to be the most predictable show on Broadway. Even more astonishing is how much top-notch theatrical talent – David Hyde Pierce making his Broadway directorial debut; performers including Tyne Daly, Sierra Boggess, Harriet Harris, Montego Glover; veteran designers – has gone into what feels like a vanity production, or at least a family affair: Pierce is married to first-time Broadway book writer and lyricist Brian Hargrove. Even if Hargrove’s gags were funnier, or Barbara Anselmi’s score more noteworthy, they could not make up for the absence of any authentic-feeling observations about love or commitment or weddings or…anything. What’s worse are the many little tricks on the audience, which are less often clever than confusing, and culminate in the over-the-top plot twist. I can’t bring myself to spoil the two biggest surprises, except to say that they make no sense whatsoever, violating some basic rules of storytelling, and undermining what’s good about the show. And there are some things that are good, chief among them the performances by Lisa Howard and Josh Grisetti — amusing, charming, energetic. I don’t mean to imply that the rest of the 13-member cast is bad. There is only one completely repellent character, that of a sex-crazed aunt who hides in closets and behind balconies stalking the male guests, and no actress could have redeemed that part. But the cast members largely do what they can with what they’ve been given. Harriet Harris as the groom’s drunken mother may be incapable of turning in a completely terrible performance, no matter what the material. Tyne Daly expertly wrings what laughter she can from her role as the bride’s stereotypically meddlesome Jewish mother; Chip Zien is appealing as the bride’s slightly less stereotypical Jewish father. These are pros, who manage to keep their dignity even when delivering such lines as what Daly is forced to say to Albert the wedding planner (the reliable Edward Hibbert): “Don’t bullshit me, Albert. That’s right I said ‘Bullshit.’ Does it shock you? Good. Cause if this room isn’t ready by the time the first guest arrives, that’s going to be the nicest word coming out of my mouth. I will cut off your balls.” Most of the cast are familiar faces; the two standouts feel like discoveries. Lisa Howard has a terrific voice, and a great presence, and she is at the center of what comes closest to genuine moments in the show. Her Jenny Steinberg is the main character, who (typical of the musical’s confusing tricks) we first are led to think is the bride but turns out to be the bride’s sister. She is also apparently the member of the wedding most responsible for putting it (and holding it) together. It is wedding day for Jewish bride Rebecca Steinberg (an under-utilized Sierra Boggess) and Catholic groom Brian Howard (an unexceptional David Burtka, an actor best-known as Neil Patrick Harris’s husband.) Nothing much is made of the interfaith relationship, except a few bad jokes, and a supposed hostility between the two mothers, which peters out. Focus shifts to a different plot line: Jenny by accident speed-dials Rebecca’s former boyfriend, Marty Kaufman (Josh Grisetti) , who overhears her talking about the wedding, which he hadn’t known about. Marty looks ecstatic, jumping around like Snoopy on his hind paws at his most elated, singing: It’s a sign! Wasn’t gonna do this though it felt so unresolved But now I know I was right, right from the start ….it’s a sign; I’m going to stop this wedding day. And then he crashes the wedding. When he arrives, we think Rebecca’s parents are alarmed (another little trick), until they start singing “It Shoulda Been You,” the funniest and most memorable of Hargrove and Anselmi’s songs. It is the most promising development in the show — the former boyfriend is going to stop the wedding, with the help of the bride’s parents. A few scenes later, after talking briefly with the bride, Marty drops his effort to stop the wedding. Like the other plot lines, it fizzles. I’m trying to avoid spoilers here, but I do wish to point out that we eventually learn he had no reason to be so ecstatic during that “It’s a sign” number, and he knew he had no reason to be ecstatic. Did the creative team think that the audience would just forget, or that such inconsistency wouldn’t matter to us? Is this what suspension of disbelief is at its worst? I don’t think I’ve seen either Lisa Howard or Josh Grisetti perform before, although Howard has been on Broadway several times. But I can’t wait to see them in their next shows. I suspect I won’t have to wait very long. It Shoulda Been You Brooks Atkinson Theater Book & lyrics by Brian Hargrove and music by Barbara Anselmi Josh Rhodes (Choreography) Anna Louizos (Set Design), William Ivey Long (Costume Design), Ken Billington (Lighting Design), and Nevin Steinberg (Sound Design). Additional lyrics by Jill Abramovitz, Carla Rose Fisher, Michael Cooper, Ernie Lijoi and Will Randall. Cast: Tyne Daly, Harriet Harris, Sierra Boggess, David Burtka, Lisa Howard, Edward Hibbert, Montego Glover, Josh Grisetti, Adam Heller, Michael X. Martin, Anne L. Nathan, Nick Spangler and Chip Zien. Farah Alvin, Gina Ferrall, Aaron C. Finley, Mitch Greenberg, and Jillian Louis. Running time: 90 minutes with no intermission Watch Bring Them Home: A Broadway Prayer for The Oct 7 HostagesNovember 10, 2023In \"song\" Watch Bernadette Peters Sing to a Pooch in Broadway Barks 2015.July 12, 2015In \"New York Theater\" Broadway Responds to Russia’s ‘Gay Propaganda’ BanJanuary 23, 2014In \"New York Theater\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"It abruptly swerves in a completely unexpected direction, and yet still manages to be the most predictable show on Broadway...Even if the gags were funnier, or the score more noteworthy, they could not make up for the absence of any authentic-feeling observations about love or commitment or weddings or…anything.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 963,
  "archivePath": "data/archives/reviews/it-shoulda-been-you-2015/nyt-theater--jonathan-mandell_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:05:33.504Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 963,
  "tierReason": "Full review text"
}