{
  "showId": "it-shoulda-been-you-2015",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Unknown",
  "url": "http://www.thewrap.com/it-shoulda-been-you-theater-review-david-hyde-pierce-takes-a-wedding-party-to-the-bank/",
  "playbillVerdictUrl": "http://www.thewrap.com/it-shoulda-been-you-theater-review-david-hyde-pierce-takes-a-wedding-party-to-the-bank/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "Sting’s “The Last Ship” and Jason Robert Brown’s “Honeymoon in Vegas” were both sabotaged by inferior books, and despite good scores could not survive this season on Broadway. “It Shoulda Been You,” which opened Tuesday at the Brooks Atkinson Theatre in New York, suffers the reverse problem — terrific book, numbingly bland music — which in the crazy world of musical theater does not KO its chances for success. Who knows? “Shoulda” could turn into the surprise hit of the 2014-15 season.\n\nBrian Hargrove’s witty, twist-filled book about a mixed-up wedding party serves as the playground for a superb ensemble that knows precisely what to do with every zinger they’re given. And whenever the jokes are in short supply — which isn’t often — director David Hyde Pierce makes sure there’s a visual gag to fill the space. And what a space it is! Anna Louizos’s hotel set provides enough stairways, corridors, balconies and doors to service a few dozen lesser farces.\n\nHargrove’s lyrics also manage to entertain — five other lyricists are also credited — which is quite a feat since to get at those spirited rhymes you have to listen to Barbara Anselmi’s chipper soft-shoe tunes; it’s the kind of music that did not survive Joseph Brooks’ heyday in advertising.\n\nEven Hargrove’s talent fails him with the female power ballad “A Little Bit Less Than,” which, while not immeasurably worse than any other female power ballad of the past 10 years, is fortunately positioned near the end of the show so that the goodwill and humor of the preceding 90 minutes — it’s a short musical — carries you through to the curtain.\n\nTwo families — one Jewish, the other Gentile — gather for a wedding at which nothing much goes wrong until it becomes apparent what the bride (Sierra Boggess) and groom (David Burtka) are up to with their maid of honor (Montego Glover) and best man (Nick Spangler). Not that this musical is really about them.\n\nHargrove’s best material is reserved for the two mothers, Tyne Daly and Harriet Harris, who know just what to do with a pointed barb, and they never miss their target. Nor does Edward Hibbert, who finds new variations on the cliché of the overly fastidious wedding planner. And let’s not forget the charming Josh Grisetti, whose alternate groom Marty gets to deliver the best ever joke about cellphones in the theater. Not that this musical is really about any of them.\n\nJenny (Lisa Howard), the sister of the perfect bride, is what “Shoulda” means to be all about. Frankly, as written and performed, this role of the plus-size woman who has been disrespected all her life could use a lot more Melissa McCarthy and a little less Jenny Craig. She’s meant to give the show heart, but the pulse belongs to the circus around her.",
  "isFullReview": true,
  "textWordCount": 475,
  "archivePath": "data/archives/reviews/it-shoulda-been-you-2015/thewrap--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:39:33.764Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 475,
  "tierReason": "Full review text",
  "bwwExcerpt": "Brian Hargrove's witty, twist-filled book about a mixed-up wedding party serves as the playground for a superb ensemble that knows precisely what to do with every zinger they're given. And whenever the jokes are in short supply -- which isn't often -- director David Hyde Pierce makes sure there's a visual gag to fill the space...Hargrove's lyrics also manage to entertain...which is quite a feat since to get at those spirited rhymes you have to listen to Barbara Anselmi's chipper soft-shoe tunes...Hargrove's best material is reserved for the two mothers, Tyne Daly and Harriet Harris, who know just what to do with a pointed barb, and they never miss their target.",
  "bwwScore": 8
}
