{
  "showId": "it-shoulda-been-you-2015",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "http://variety.com/2011/legit/reviews/it-shoulda-been-you-1117946375/",
  "publishDate": null,
  "fullText": "Broadway comes to New Brunswick with the new musical comedy \"It Shoulda Been You.\" The cast -- headed by Tyne Daly and Harriet Harris, with the likes of Howard McGillin and Edward Hibbert in support -- is impressive.\n\nBroadway comes to New Brunswick with the new musical comedy “It Shoulda Been You.” The cast — headed by Tyne Daly and Harriet Harris, with the likes of Howard McGillin and Edward Hibbert in support — is impressive. Design team consists of top-level names Anna Louizos, William Ivey Long and Ken Billington. David Hyde Pierce makes what seems to be his directing debut, and producers Scott Landis, Michael Hanel and Daryl Roth are attached. With all this, “It Shoulda Been You” shoulda been good. The score is weak, though, and the book would have been a scream back in 1965.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n How Brandi Carlile’s Girls Just Wanna Weekend Became the World’s Warmest Music Festival: It's Not Just the Tropical Temperatures \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Brandi Carlile and Sam Smith: A Conversation About Bravura Voices, Fashion as Queer Armor and Having a Nonbinary Headliner for Carlile's Girls Just Wanna Weekend\n\nWhat we have here is “Abie’s Irish Rose” all over again. The fact that few people remember that long-running hit indicates just how past-dated “It Shoulda Been You” is; later sitcom models include “The Mothers-in-Law” and “Bridget Loves Bernie.” Jewish girl weds Catholic boy, with the cliche-Jewish mama (Daly) pitted against the tippling WASP mother (Harris); they even reprise those “Abie” jokes about the rabbi and the priest. This is “Love Boat” territory, all in all; but is there still an audience for “The Love Boat”? The authors eventually make things more contemporary, but one twist at the first act curtain and a rapid-and-funny final twenty minutes aren’t enough.\n\nMusic comes from Barbara Anselmi, who also takes credit for the concept. The book is by TV-scribe Brian Hargrove; he also writes half the lyrics, with the rest coming from a committee of five receiving title-page credit. (That’s a lot of writers for gems like “It shoulda been you, at least you’re a Jew.”) There are a very few reasonably effective songs along the way, but we have to wait until the final number for a good one, a quartet for the parents called “That’s Family.”\n\nThe actors go all out to make things enjoyable; each and every one of the 13 brightens the stage. Daly breezes through her role as the Jewish mother to end all Jewish mothers, although people who saw her in last season’s “Master Class” know that she is capable of far more. Harris makes a perfect foil, and is wildly funny; so are McGillin and Richard Kline as the two husbands. Leading the pack and carrying the show is the little-known Lisa Howard — a Drama Desk Award-winner for “The 25th Annual Putnam Valley Spelling Bee” — as sister of the bride. When she sings a song, it gets sung. Hyde Pierce has his actors deliver the jokes effectively and has a knack for farcical staging, while choreographer Noah Racey makes do with his few opportunities.\n\nHow does such a slight entertainment as “It Shoulda Been You” get a gilt-edged, first-class mounting at a small regional like George Street? One guesses that Hyde Pierce, husband of lyricist/librettist Hargrove, pulled strings and called friends. The cast seems to be having a grand time, at least, and their clowning more than compensates for the weary writing.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Viewing the 2011 tryout at the George Street Playhouse in New Brunswick (NJ), I found the humor mirthlessly forced...Thirty months later, I'm here to report that It Shoulda Been You is now considerably better than it was. This, thanks to a general upgrading of the cast (other than four central actor...",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"'It Shoulda Been You' shoulda been good. The score is weak, though, and the book would have been a scream back in 1965...How does such a slight entertainment get a gilt-edged, first-class mounting? One guesses that Director Hyde Pierce, husband of lyricist/librettist Hargrove, pulled strings and called friends. The cast seems to be having a grand time, at least, and their clowning more than compensates for the weary writing.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "bww-roundup"
  ],
  "textWordCount": 572,
  "archivePath": "data/archives/reviews/it-shoulda-been-you-2015/variety--steven-suskin_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:07:47.327Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 572,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-06T15:30:28.908Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review discusses a production at George Street Playhouse in New Brunswick, not the Broadway run.; kimi: This review covers the George Street Playhouse regional production in New Brunswick, NJ (\"a small regional like George Street\"), not the Broadway production. The text explicitly refers to it as a regional mounting, making it ineligible for scoring as a Broadway review.",
  "promptVersion": "5.2.0"
}
