{
  "showId": "the-thanksgiving-play-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2023/04/20/the-thanksgiving-play-the-satire-of-political-correctness-we-need-right-now/",
  "publishDate": "2023-04-20T21:24:01",
  "fullText": "Larissa FastHorse’s clever satire of political correctness is set in a classroom where a group has gathered to “devise” a 45-minute holiday play for an elementary school audience. The team includes Logan (stage veteran Katie Finneran), a drama teacher whose previous directorial credits include a production of The Iceman Cometh featuring fifteen-year-olds; Jaxton (Scott Foley, TV’s Felicity), her very woke yoga practitioner/street performer boyfriend who gifts her with a water bottle “made from recycled glass from broken windows in housing projects”; Caden (Chris Sullivan, returning to Broadway after hitting it big in television’s This is Us), a history teacher with a passion for theater who’s there to make sure the piece is historically accurate; and Alicia (D’Arcy Carden, TV’s The Good Place, making her Broadway debut), a sexy professional actress from Los Angeles who’s  been cast because her Native American heritage fulfills the demands of a “Native American Heritage Month Awareness Through Art” financial grant.\n\n“I have always been drawn to your ways,” Jaxton gushes to Alicia when they first meet. Unfortunately, there’s been a misunderstanding, as Alicia isn’t Native American at all but rather “English and French and a little Spanish.” It turns out that she was mistakenly hired because of her “Native American headshot,” one of six that feature her as different ethnicities. She’s got plenty of experience playing minorities, citing the time she was the “third understudy for Jasmine” at Disneyland.\n\nThe Thanksgiving Play — which was first seen at Off-Broadway’s Playwrights Horizons in 2018 and has since gone on to become one of the most produced plays in America, the first by a Native American playwright to achieve that feat — hilariously dissects political correctness via such plot elements as Logan’s goal to make a “culturally sensitive” play about a holiday revolving around “the slaughter of millions of animals” in spite of her veganism and Jaxton’s determination to get to the core of the “Native American gestalt.” Caden vainly attempts to set the historical record straight about the actual, little-known beginnings of the holiday, while Alicia horrifies the others with her joyous recollection of playing “frozen turkey bowling” as a child. “They call them Butterballs, but they’re not really balls,” she explains.\n\nInterpersonal dynamics also enter into the picture, with both men finding themselves irresistibly drawn to the sexually alluring if not particularly bright Alicia. The insecure Logan becomes increasingly jealous, but Alicia reassures her that she could be gorgeous with just a little make-up and a valuable lesson in “hair-flipping.”\n\nInterspersed with the scenes depicting the piece’s chaotic creation are several holiday-themed videos featuring children, including one in which they’re dressed as pilgrims while singing the parody song “The Twelve Days of Thanksgiving.” There are also some very amusing theatrical in-jokes, including throwaway gags about whether the proper spelling is “theater” or “theatre” and what exactly a dramaturg does.\n\nNot all of the jokes land, and even with its brief 90-minute running time, the evening ultimately has the feel of an overextended sketch. That’s particularly true of this new production directed by Rachel Chavkin, which feels much broader than the original staging and features some theatrical flourishes near the end that feel wholly unnecessary. But the play still delivers plenty of uproarious moments and this starrier Broadway cast milks them for all their worth, with Carden and Finneran particularly hilarious with their physical comedy.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
