{
  "showId": "the-thanksgiving-play-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2023/04/20/a-thanksgiving-play-much-to-give-thanks-for/",
  "publishDate": "2023-04-20T21:23:46",
  "fullText": "Larissa FastHorse, born into the Sicangu Lakota Nation, has been quoted as saying that she came to write The Thanksgiving Play in 2015 because she had been told that since there are no indigenous Native American actors(!?), she couldn’t cast a work requiring native American actors.\n\nTaking that proscription in, she pivoted to write a work concerning Indigenous Americans but using only four white actors.  The result: A Thanksgiving Play, which, after being presented at Playwrights Horizons in 2018 and across the country for several years, now reaches Broadway and, according to disseminated information, makes FastHorse the first Native American to arrive here.\n\nFastHorse has remarked that she favors comedies as the way to communicate her serious beliefs about how misunderstood her people have been over the centuries. She’s on to something piercingly salient, of course, and she’s right about laughs being a potent way to reach audiences with a powerful message.\n\nShe’s written an intermissionless 90-minute joke-filled piece that can certainly be regarded as a comedy. But how comic is it, from start to finish? Her notion is that four white characters have gathered in a high school classroom in an unspecified town. (Riccardo Hernandez, the set designer). Logan (Katie Finneran), a drama teacher has received grants to present a Thanksgiving play. She’s decided to improvise the educational entertainment and has invited participating associates Jaxton (Scott Foley) and Caden (Chris Sullivan) as well as imported Hollywood actress Alicia (D’Arcy Carden), whom Morgan has hired for her tribal background.\n\nLogan, Jaxton and Caden are severe victims of Political-Correct-itis, not necessarily a condition new to satire. Logan, for instance, is so deeply infected, not to say affected, that when she introduces people, she includes names and pronouns. When dismayed, she mutters, “Oh my goddess!”\n\nAlicia is something else again. She knows nothing other than that she’s an actress trained in Disneyland technique. At one moment when told she’s about to learn something, she replies, “I don’t want to learn.” That’s another giggle line, although it doubles – without FastHorse maybe intending it – as a reminder that the United States is currently a sadly dumbed-down nation. Not incidentally, Morgan chose Alicia after looking at a headshot of the actress wearing a turquoise necklace, although this Alicia isn’t Indigenous American, after all.\n\nWith Alicia, the woefully PC three – these contemporary bleeding-heart liberals (if “bleeding-heart liberals” remains an acceptable phrase) – begin shaping their version of a Thanksgiving play. The many improvisations that they imagine quickly strike them as unacceptable. Should they portray Indigenous Americans? Maybe not. Morgan is wary of anything that could affront her grant donors but is uncertain which ideas might offend and which might not.\n\nNo complete list of attempted notions will be given here. They can and do elicit copious giggles, chuckles and chortles from a generally happy audience (though not, always, this viewer). The first improv suggestion is Caden’s that they begin their Thanksgiving dinner history by going back about 4000 years, Morgan objects that they’re restricted to a 45-minute entertainment. Alicia notes that 20 minutes is the Disneyland limit.\n\nOf the many other intermittently amusing improvs, there’s one improv that to this viewer seems questionable. Towards the end, Jaxton and Caden rush forth with bags from which they pull supposedly severed “Indian” heads and toss them bloodily about. Evidently, the sequence is meant to remind jubilating spectators about the historic violence of the country’s earlier history, but there must be a better way to make the point.\n\nClearly, the obviously talented FastHorse, a MacArthur Fellow, is having her puckish way with what fools these present-day knee jerk liberals, these contemporarily “woke” characters be. Thanks to her for that, especially as played by cast members Finneran Foley, Sullivan, and James.\n\nDirector Rachel Chavkin (Tony for Hadestown) has the able four working like Energizer bunnies. As Finneran always does, she wrings as much humor as there is to wring; in the circumstances, maybe even more. So do the other in-for-a-penny-in-for-a-pound players.\n\nN.B.: Before FastHorse’s comic proclamation and the live cast members enter, a downstage screen fills with a video of mixed-race children singing a “Twelve Days of Christmas” parody. The items representing the numbers are “a turkey in a turkey patch,” “two turkey gobblers,” and so on. In a matter of two or three minutes, a notion of how children are inappropriately taught about the meaning and the truth of Thanksgiving, as okayed by today’s CRT-fearing school boards, is presented. It’s a brilliant inspiration that gets A Thanksgiving Play off to a grand start.\n\nThe Thanksgiving Play opened April 20, 2023 at the Helen Hayes Theater and runs through June 4. Tickets and information: 2st.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "Director Rachel Chavkin (Tony for Hadestown) has the able four working like Energizer bunnies. As Finneran always does, she wrings as much humor as there is to wring; in the circumstances, maybe even more. So do the other in-for-a-penny-in-for-a-pound players.",
  "bwwScore": 3
}
