{
  "showId": "time-stands-still-2010",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2010/01/29/theater/reviews/29time.html",
  "publishDate": "January 28, 2010",
  "fullText": "Sarah Goodwin, the complicated woman at the heart of “Time Stands Still,” seems to thrive on conflict, at least professionally. A photojournalist who covers wars and global strife, she keeps chaos at arm’s length by trapping it in the camera lens, exerting a fierce control over moments of horror by fixing them in time.\n\nBut the flux of Sarah’s own life cannot be manipulated so easily, as she learns with growing sorrow in this thoughtful drama by Donald Margulies that stars Laura Linney and Brian d’Arcy James, giving performances of complementary sensitivity and richness. Conflicting needs cannot be held at a cool distance; the wounds of the past cannot be filed away like old negatives; the change that experience brings is not reversible.\n\n“Time Stands Still,” which opened Thursday night at the Samuel J. Friedman Theater in a flawless Manhattan Theater Club production directed by Daniel Sullivan, is handily Mr. Margulies’s finest play since the Pulitzer Prize-winning “Dinner With Friends.” Like that keenly observed drama about the growing pains of adulthood, the new play explores the relationship between two couples at a crucial juncture in their lives, when the desire to move forward clashes with the instinct to stay comfortably — or even uncomfortably — in place.\n\nAs the play opens, the challenges facing Sarah and her partner, James Dodd (Ms. Linney and Mr. d’Arcy James), seem clear enough. James has just brought Sarah home from a hospital in Germany, where she was recuperating from severe injuries suffered while she was covering the war in Iraq. Antsy and unused to the burdens of repose, Sarah rebuffs James’s constant efforts to cushion her from the bumps and bruises of recovery. His anxiety is amplified by a lingering sense of guilt: a reporter himself, he had suffered a breakdown in Iraq and returned to the United States shortly before Sarah’s accident, which has left her with a bum leg and scarred face.\n\nJust how much has changed since Sarah was on assignment is brought home when they receive a visit from their good friend Richard Ehrlich (Eric Bogosian), Sarah’s former flame and mentor from many years before who is the photo editor at a newsmagazine. Richard has a new, much younger girlfriend in tow, Mandy (Alicia Silverstone), whose introduction of a pair of tacky silver balloons into James and Sarah’s funky loft in Williamsburg, Brooklyn, telegraphs just how markedly her sensibility differs from theirs.\n\nSarah accepts this absurd gift with devastating cool, as she greets all Mandy’s efforts to ingratiate herself. These include Mandy’s announcement that she has been praying for Sarah’s quick recovery. “It’s weird ’cause it’s not like I believe in God or anything,” Mandy adds, chirping away obliviously.\n\nMs. Silverstone, whose Broadway debut came in the dreary stage adaptation of “The Graduate,” gets a happy chance at redemption in a tricky role to which she brings warmth, actorly intelligence and delicate humor. She achieves the lovely feat of allowing us to laugh at Mandy’s shallowness even as we are charmed by her good-heartedness.\n\nWhen Mandy disappears into the bathroom, Sarah and James blandly profess to find her “adorable” and “darling,” in tones that make this anodyne praise sound damning. Richard has been running conversational interference in an attempt to minimize Mandy’s missteps, a process that the terrific Mr. Bogosian illustrates in precise comic detail, as Richard’s romantic ardor wars with intellectual mortification.\n\nEventually Richard becomes righteous, insisting that the relationship isn’t just a matter of a middle-aged guy chasing younger women. Sarah’s withering reply: “There’s young, and there’s embryonic.”\n\nMr. Margulies is gifted at creating complex characters through wholly natural interaction, allowing the emotional layers, the long histories, the hidden kernels of conflict to emerge organically. His dialogue throughout “Time Stands Still” crackles with bright wit and intelligence, but it is almost always an expression of the characters’ personalities, not a function of the author’s need to dazzle and entertain. (A few lines feel false or glib, as when Sarah says, “War was my parents’ house all over again, only on a different scale.”)\n\nHe also folds into the writing a few trenchant debates about the moral ambiguities of journalists’ role in covering atrocities. In the play’s premiere production, at the Geffen Playhouse in Los Angeles last year, these sometimes felt tacked on, but Mr. Sullivan, who also staged that version, and his largely new cast have mostly smoothed out any lumps in the writing. The heart of “Time Stands Still” resides in the gently evolving relationship between Sarah and James, which develops troubling new ripples in each scene.\n\nMs. Linney, an actress of unusual economy and seemingly innate grace, does not shy from depicting the thorny aspects of Sarah’s personality: her impatience with views opposing her own, the leftover anger from witnessing her parents’ unhappy marriage, the emotional reserve and the sense of detachment bred in her by her work. But she also reveals the reserves of tender feeling beneath the ample defenses. We sense Sarah’s growing fear that her need to live life on her own terms cannot be reconciled with the path James sees for their future. Ms. Linney’s tough but gently shaded performance honors the character’s seeming contradictions.\n\nMr. d’Arcy James, a remarkably versatile actor equally at home in splashy musicals like “Shrek” and the chiaroscuro delicacies of Conor McPherson’s “Port Authority,” has never been better than he is here. James’s anguish and guilt over his failure to protect Sarah are conveyed with touching warmth. The darker feelings that reside just below his congenial surface — envy of Sarah’s career success, rage at a betrayal he at first chooses to ignore — eventually burst forth, in scenes to which Mr. d’Arcy James brings fierce, raw anger that sets the stage crackling with currents of powerful feeling.\n\nThe loving but uneasy relationship between Sarah and James is contrasted with the effortless companionship of Richard and Mandy, drawn with a lighter but not less convincing sense of truth by Mr. Bogosian and Ms. Silverstone. Although “Time Stands Still” is deceptively modest, even laid back in its structure and sensibility, consisting of a handful of conversations among just four characters, the range of feeling it explores is wide and deep.\n\nSarah and James have spent much of their lives bearing witness to horrific violence, but Mr. Margulies’s quietly powerful drama illustrates just how much pain and trauma are involved in the everyday business of two people creating a life together, one that accommodates the mistakes of the past, the reality of the present and the changes that the future may bring.\n\nBy Donald Margulies; directed by Daniel Sullivan; sets by John Lee Beatty; costumes by Rita Ryack; lighting by Peter Kaczorowski; sound by Darron L West; music by Peter Golub; fight director, Thomas Schall. Presented by the Manhattan Theater Club, Lynne Meadow, artistic director; Barry Grove, executive producer; by special arrangement with Nelle Nugent/Wendy Federman. At the Samuel J. Friedman Theater, 261 West 47th Street, Manhattan; (212) 239-6200. Through March 14. Running time: 1 hour 55 minutes.\n\nWITH: Eric Bogosian (Richard Ehrlich), Brian d’Arcy James (James Dodd), Laura Linney (Sarah Goodwin) and Alicia Silverstone (Mandy Bloom).",
  "isFullReview": true,
  "dtliExcerpt": "Ms. Margulies has created characters who feel genuinely three-dimensional, flawed and searching, and she lets them argue their cases with equal conviction.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Ms. Margulies has created characters who feel genuinely three-dimensional, flawed and searching, and she lets them argue their cases with equal conviction.",
  "contentTier": "complete",
  "contentTierReason": "Short text (22 words)",
  "textQuality": "full",
  "rejectedAt": "2026-02-04T04:56:45.844Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence fragment or excerpt lacking any clear show identification, overall evaluation, or recommendation; openai: The text is a brief excerpt that lacks a clear evaluative verdict about the show. It only comments on the character creation without providing an overall assessment.",
  "promptVersion": "5.2.0",
  "textWordCount": 1188,
  "archivePath": "data/archives/reviews/time-stands-still-2010/nytimes--ben-brantley_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:55:22.761Z",
  "designation": "Critics_Pick",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20150918180231",
  "archiveOrgUrl": "http://web.archive.org/web/20150918180231/http://www.nytimes.com:80/2010/01/29/theater/reviews/29time.html",
  "wordCount": 1188,
  "tierReason": "Full review text"
}