{
  "showId": "time-stands-still-2010",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://theater.nytimes.com/2010/10/08/theater/reviews/08time.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "New plays of substance remain sadly rare on Broadway, and return engagements are almost unheard of, which makes this remounting of 'Time Stands Still' as brave as it is unusual. Thankfully audiences who couldn't make time for this rewarding play last spring now have a second chance to catch it.",
  "bwwScore": 9,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Broadway-Blog-Review-Roundup-TIME-STANDS-STILL-20101008",
  "fullText": "That a good play can sometimes make you feel bad is fairly obvious. If you make it to the sanguinary close of one of Shakespeare's tragedies with nary an inward wince, for example, something is definitely amiss. It was about halfway through my latest visit to Donald Margulies's \"Time Stands Still,\" which reopened on Broadway on Thursday night at the Cort Theater, after a summer hiatus, that my inward wincing became pretty unbearable.\n\nLaura Linney in “Time Stands Still.”\n\nFrom left: Laura Linney and Brian d’Arcy James, as journalists who covered Iraq; Eric Bogosian; and Christina Ricci.\n\nBy now I expected to be able to view Mr. Margulies's moving portrait of a troubled relationship with a certain distanced equanimity. I had already seen the play twice. And yet so intensely felt — and intensely fine — are the performances of Laura Linney and Brian d'Arcy James, playing journalists reeling from the trauma of covering the Iraq war, that the play's subtly accumulating power struck me with unexpected force.\n\nWatching these superb actors portray a man and woman who love each other deeply, and yet cannot establish a comfortable equilibrium, handily undid my own once again. With Ms. Linney and Mr. d'Arcy James bringing this intelligent, absorbing drama to such tortured life, attending \"Time Stands Still\" can feel like eavesdropping on two cherished friends at their most vulnerable and emotionally exposed.\n\nOne measure of the quality of a play is the caliber of the performances it inspires as the actors grow into their roles. Having lived inside these characters for almost a year now, since the play's initial Broadway run beginning last winter, Ms. Linney and Mr. d'Arcy James have burrowed even deeper into their layers, sharpened the pinch of their conflicting desires, honed each moment of confrontation or affection to a precise pitch.\n\nEric Bogosian, who plays Richard, a magazine editor and the couple's closest friend, has also found new layers of empathy — and wry exasperation — in his role. And Christina Ricci, the only newcomer to the cast, makes a confident, appealing Broadway debut, replacing Alicia Silverstone as the young girlfriend of Mr. Bogosian's character.\n\nThis enriched emotional resonance is a matter of meticulous excavation rather than cranking up the volume. There is nothing showy or histrionic in Mr. Margulies's fluid, often funny writing or in the work of the director, Daniel Sullivan. \"Time Stands Still\" weaves a quiet spell of moment-to-moment truth, but the jolts of heightened drama spring at you with unnerving ferocity.\n\nMs. Linney's Sarah Goodwin, a photographer recuperating from serious injuries she incurred while on the job, is now an even more formidably commanding mixture of steely resolve and suppressed feeling. There is admirable integrity in Ms. Linney's commitment to burnishing Sarah's armor to an almost glaring brightness, as she drops acid remark after sarcastic aside on the subject of Ms. Ricci's young and affably daffy Mandy. \"There's young,\" Sarah says of Mandy, pausing to pull the metaphorical pin from the grenade, \"and there's embryonic.\"\n\nThe evidence that pets can improve their owners' mental and physical health doesn't stand up to scrutiny.\n\nA single social program is transforming how countries all over the world help their poor.\n\nRobert Wright of Bloggingheads.tv and Mickey Kaus of kausfiles debate the so-called death panels.",
  "isFullReview": true,
  "textWordCount": 547,
  "archivePath": "data/archives/reviews/time-stands-still-2010/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T19:28:02.417Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20120624073822",
  "archiveOrgUrl": "http://web.archive.org/web/20120624073822/http://theater.nytimes.com/2010/10/08/theater/reviews/08time.html",
  "wordCount": 547,
  "tierReason": "Full review text"
}