{
  "showId": "time-stands-still-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2010/legit/reviews/time-stands-still-1117942142/",
  "publishDate": "January 29, 2010",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Donald Margulies' new play 'Time Stands Still' is a thoughtful, well-crafted drama about war correspondents dealing with trauma and the ethics of their profession.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Donald Margulies' new play 'Time Stands Still' is a thoughtful, well-crafted drama about war correspondents dealing with trauma and the ethics of their profession.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (24 words)",
  "textQuality": "partial",
  "textWordCount": 388,
  "archivePath": "data/archives/reviews/time-stands-still-2010/variety--marilyn-stasio_2026-02-06.html",
  "textFetchedAt": "2026-02-06T19:28:47.189Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Feb 10, 2010 4:17pm PT \n\n \n\n \n \n \n\n \n\n \n Mumford & Sons\n \n \n\n \n\n A unique, high-spirited reworking of a familiar formula.\n\nLondon’s Mumford & Sons arrives on these shores for their first U.S. tour with a unique, high-spirited reworking of a familiar formula that makes their debut, “Sigh No More,” the first five-star album of the young year.\n\nThey employ folk instrumentation and slowly drawn four-part harmony, kindling images of Irish pub singers professing love or personal deficiencies and abruptly changing tempos — consistently veering off the straight and narrow of traditional Brit folk. Opening night of their first U.S. headlining tour, preceding the Feb. 16 release of “Sigh No More,” worked two-fold: cementing an identity and exposing an ambition to push their music in new directions.\n\nThe band, which opened shows 18 months ago in the States for Laura Marling and Johnny Flynn before they had a CD available, arrives with an overabundance of raves — we’re talking words such as “perfect” — from the British media. Adding to the swirl of attention is the label that picked up their album, Glassnote, the Gotham-based indie that imported Phoenix from France and helped create an indie rock sensation last year.\n\nA packed, sold-out house was on hand for Tuesday’s performance at the Troubadour and Mumford & Sons are already working on a return visit in June that will include a stop at the Bonnaroo festival in Tennessee.\n\nThe 75-minute show started with the album’s title track, the piercing refrain of “I’m sorry” merely a starting point for the exposed vulnerability and fragility that would follow. Each of the first four songs were structured the same — soft vocal introductions followed by blazing fast rave-ups led by banjo player Winston Marshall — but in each they captured elements of resilience, reconciliation and redemption with the music driving the emotional pull in equal measure with the lyrics. It takes a cold heart to not respond with a smile to Mumford & Sons.\n\nNew unrecorded songs had less rootsy ornamentation: Songwriter-singer Marcus Mumford, who alternates between rhythm guitar and drums, has started to explore dirge tempos, organ and piano sounds and even ventured toward mid-’90s indie rock. Their presence fleshed out the ambition of this young outfit, demonstrating that anyone who labels their music as Americana wrapped in the Union Jack is unwisely selling them short."
}