{
  "showId": "saint-joan-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2018/04/25/saint-joan-manhattan-theatre-clubs-revival-doesnt-ring-the-bell/",
  "publishDate": "2018-04-25T21:16:55",
  "fullText": "Saint Joan might well be considered the crowning glory of George Bernard Shaw’s long career. After the Theatre Guild’s premiere of the play on Broadway in 1923, its worldwide acclaim and popularity helped to nab Shaw the 1925 Nobel Prize in Literature.\n\nIts current production by Manhattan Theatre Club is scarcely so rewarding, nor will this competent but stolid staging by director Daniel Sullivan win awards for anybody this Broadway season.\n\nStraightforwardly crafting the 15th-century story in modern language, Shaw provides a thoughtful look at Joan of Arc, a charismatic young woman and saint-in-the-making who defied both church and state—and men—and was burnt for the trouble she caused them.\n\nThe whimsical tangents that so often riddle Shaw’s works are minimal. (Some dialogue also has been pared away from the text for this revival.) Instead, the playwright gently depicts Joan as a simple, devout soul who wins battles for France in spite of the crew of petty individuals surrounding her, only to be easily abandoned by them to the English allies who intend to destroy her.\n\nIt is suggested more than once that this world, both way back then and nowadays, has little desire or patience for actual saints.\n\nA drama that is far more about talk than action, the story presents its medieval characters swapping ideas about the rise of nationalism and those would-be Protestant inclinations that eventually will sweep away feudal existence. These Shavian conversations can be pleasing. Nevertheless, Saint Joan is a drama that requires inventive lifting on the part of its director and acting ensemble to make its often static charms amenable to Broadway audiences of today who, the occasional Tom Stoppard work aside, prefer entertainment over edification.\n\nPerhaps Sullivan might have staged the play in some radical style. Rehearsal clothes? Sci-fi décor? In a wild reconfiguration of the Samuel J. Friedman Theatre auditorium?  This staging appears terribly flat. Perhaps Sullivan might have striven for a more ironic or even a comic tone among the performances. This rendition is an awfully conventional interpretation of a play that demands a heightened ambience.\n\nAt the very least, MTC should have secured a more personally resonant actor for Joan than Condola Rashad, whose cheery portrayal of Joan is confident, pleasant, and neither inspired nor inspiring. There should be a streak of madness sparking within Joan that electrifies everyone around her. (Gosh, where’s Nina Arianda when you need her?)\n\nSeveral actors have sufficient presence and technique to overcome the dull way in which the director so often has them simply sitting down and jawing. Patrick Page, always forceful and lucid, illuminates the crucial trial sequence as a mellifluous, sincerely spiritual Inquisitor. Jack Davenport is wonderfully urbane as a crafty English politician eager to incinerate Joan. Daniel Sunjata, radiating boyish charm in his armor, is appealing as Joan’s best chum. John Glover’s chilly archbishop, Adam Chanler-Berat’s peevish Dauphin, and Walter Bobbie’s grumpy bishop are other capable, though traditional, characterizations.\n\nThe most memorable takeaway from the production is designer Scott Pask’s unusual setting, which provides a flexible frame and background for an otherwise bare stage with vertical metallic tubes that resemble over-sized chimes. Lit in varying colors by Justin Townsend, this somewhat overwhelming setting probably was suggested by Joan’s remarks how she heard her saintly voices in the reverberations of church bells. It’s a pity that the rest of this revival of Saint Joan is not nearly so striking.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars"
}
