{
  "showId": "saint-joan-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2018/04/25/saint-joan-shaws-other-fair-lady-grounded-and-soaring/",
  "publishDate": "2018-04-25T21:16:04",
  "fullText": "It has been a quarter century since George Bernard Shaw’s Saint Joan was last performed on Broadway, but its subject has not gone entirely missing from New York stages. Just over a year ago, she popped up at the Public Theater in the musical Joan Of Arc: Into the Fire; played by singer/actress/DJ/indie darling Jo Lampert, this Maid of Orleans was stalwart, fierce and virtually sexless. One could easily have imagined her either leading or disappearing into the ranks of young French soldiers battling the English during the Hundred Years’ War.\n\nCondola Rashad, who assumes the role in Manhattan Theatre Club’s stirring new Broadway revival of Saint Joan, exudes a very different kind of purity. With her doe eyes and sweetly resonant voice, Rashad’s Joan is a distinctly feminine presence, even a girlish one at points, though it’s clear that gender is of no consequence to her.\n\nBut there is no mistaking this Joan’s gentle mien for passivity. Her belief in herself and her cause is absolute—so much so that she neither fears nor questions her divine mission. Or sees how it might in any way contradict her modest perception of herself as “a poor country girl.” Rashad’s performance—tender, resolute, and deeply human—presents us with something we’ve become sadly unaccustomed to in reality: a leader whose strength is rooted in humility.\n\nDirector Daniel Sullivan, who has offered revelatory takes on classics ranging from The Merchant of Venice to The Homecoming, manages to capture the timelessness and the topicality of Shaw’s play without straining to emphasize the latter. That Rashad is an African-American actress playing a famously persecuted woman holds obvious resonance, but Sullivan trusts the text and a superb company to show us how relevant the playwright’s progressive humanism is right now.\n\nSpecifically, Sullivan surrounds his leading lady with experienced performers who infuse the other characters, all but one of them male, with varying degrees of gravitas, arrogance, fecklessness, and fellowship, all of which underscore Joan’s innocence and resolve. The marvelous Patrick Page is among several actors who juggle two roles—first lending his savory basso voice to the military squire Robert de Baudricourt, who reluctantly lets Joan enlist his troops early on, then making a chilling Inquisitor in the trial scene, which Sullivan mines for all its emotional and moral tension.\n\nThe equally estimable John Glover appears as the pompous, ineffectual Archbishop of Rheims; rising star Adam Chanler-Berat, hugely appealing as a romantic lead in last season’s musical Amélie, proves just as effective as the lily-livered Dauphin who becomes King Charles VII. Walter Bobbie and Robert Stanton respectively play Cauchon, the Bishop of Beauvais, and Chaplain de Stogumber, who both perceive Joan as not just a nuisance but a threat.\n\nThe future saint finds a more loyal and sympathetic spirit, and a comrade in armor, in the warrior Dunois, whom the excellent Daniel Sunjata plays with a mix of sensitivity and unforced masculinity that stands in stark contrast to the posturing and patronizing of other male characters. “My heart is full of courage, not of anger,” Joan tells him, and an instant bond is formed—one made all the more striking by the way these very attractive actors manage to connect without a trace of eroticism.\n\nDunois cannot save Joan, any more than she can save herself from the fate sealed for her by men claiming to represent the country and God she has served so completely. “Forgive us, Joan: we are not yet good enough for you,” Dunois remarks, in an epilogue that allows her to learn of her eventual coronation, centuries after her death. Ulimately, though, this forthright Saint Joan doesn’t condemn its heroine’s oppressors as much as the enduring power structures they represent; Joan’s story promotes action and advocacy over bitterness or rage, and in this sense she still has quite a lot to teach us.\n\nSaint Joan opened April 25, 2018, at the Samuel J. Friedman Theatre and runs through June 10. Tickets and information: manhattantheatreclub.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://nystagereview.com/2018/04/25/saint-joan-shaws-other-fair-lady-grounded-and-soaring/"
}
