{
  "showId": "saint-joan-2018",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "http://variety.com/2018/legit/reviews/saint-joan-review-broadway-condola-rashad-1202785638/",
  "playbillVerdictUrl": "http://variety.com/2018/legit/reviews/saint-joan-review-broadway-condola-rashad-1202785638/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The actress steps into a starring role and takes her place with the great Joans of the past.\n\n\"There is something about the girl,\" say several characters over the course of George Bernard Shaw's \"Saint Joan,\" now receiving a smart, stylish and engaging Broadway revival by the Manhattan Theatre Club. They're referring, of course, to Joan of Arc, the self-possessed country maid of Lorraine, on a mission to save France in the 15th century and fulfill her holy destiny.\n\nBut they could also be talking about the actress who portrays her. Playing a part that is as daunting as it is dazzling, Condola Rashad steps into the starring role in a blaze of glory and claims it as her own. Rashad's depiction of the wide-eyed, visionary youth of fierce determination, unwavering faith and beguiling innocence — not to mention a beatific smile that radiates to the balcony — makes you a believer, too\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nAs a lone girl against a phalanx of men of privilege and power — including a self-centered king of dubious lineage, righteous prelates and feudal one-percenters — Shaw's play is being revived at a moment of parallel relevance, when women and teenagers are feeling equally emboldened in their causes.\n\nBut in this 1923 play, written three years after Joan received sainthood, Shaw never goes for the didactic slam-dunk, even when the angels are on his side. Instead he revels in the complexity of issues, motives and agendas in a dialectic that's weighty even as it crackles with wit.\n\nIn a handsome production — Scott Park designed the imposing, giant pipe-organ of a set which Justin Townsend lights with infinite tones of hope and foreboding — Dan Sullivan deftly directs his first-class, deep-bench cast with subtle shadings of doubt and wonder.\n\nPatrick Page performs an impressive two-fer, first as the imperious Baudricourt, who first succumbs to Joan's verve; then as a world-weary Inquisitor who has sympathy for the maid even as he seals her fate at the stake. John Glover's archbishop also finds power in understatement as he struggles with his faith and charity. The actor returns in the play's fanciful dream-epilogue as a gentleman from the future, giving the play the sweep of historical perspective and bringing Joan into modern times.\n\nAdam Chandler-Berat, as the Dauphin, is no good-time-Charlie, giving a hard edge to his royal impetuousness yet still yearning for affirmation with a childlike need. As the Earl of Warwick, Jack Davenport cuts through all the formal posturing to the unvarnished and disturbing truths of politics and power.\n\nBut it is Walter Bobbie, the noted Broadway director (\"Chicago\"), who shows off his acting chops here as Monseigneur Cauchon, who brings a sterling clarity and dimension to a man trying to find his footing in the shifting sands of faith, nationalism and individualism. Under the spell of Rashad's divinely human Joan, it's understandable that he finds there are no easy answers — or prayers — when the voices of history comes calling.",
  "isFullReview": true,
  "textWordCount": 521,
  "archivePath": "data/archives/reviews/saint-joan-2018/variety--frank-rizzo_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:09:15.440Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 521,
  "tierReason": "Full review text"
}