{
  "showId": "saint-joan-2018",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "http://www.vulture.com/2018/04/theater-review-saint-joan-with-armor-but-not-much-heat.html",
  "playbillVerdictUrl": "http://www.vulture.com/2018/04/theater-review-saint-joan-with-armor-but-not-much-heat.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nCondola Rashad in Saint Joan.\n Photo: Joan Marcus\n \n \n \n What is it that keeps artists coming back to the story of Joan of Arc, and why do they keep making a royal mess of it? The material is certainly captivating: Lone young woman — champion of faith and courage, victorious in battle and glorious in martyrdom — faces down the establishment, saves her country, dies bravely and achieves immortality by an age where a lot of us are sleeping through 9 a.m. lecture courses and pretending we enjoy the taste of keg beer. It’s strong stuff, but it’s also deceptively tricky: What does the myth of a zealous Christian nationalist have to say to us today? Is Joan actually a feminist hero, much as we’d like her to be? Theater artists who set out to resurrect the saint often seem to do so with the facile understanding of her story as an inspirational one. And that’s “inspirational” — to borrow from David Foster Wallace’s beautiful essay “How Tracy Austin Broke My Heart” — in “its ad-cliché sense, one basically equivalent to heartwarming, or feel-good, or even (God forbid) triumphant.” It’s a sentimental, flattening approach that renders Joan dead in the water before she ever reaches the fire, and it’s the interpretation that’s currently on stage in Daniel Sullivan’s positively inert revival of George Bernard Shaw’s Saint Joan at MTC’s Samuel J. Friedman Theatre.\n\nShaw’s a tricky playwright — cantankerous and proudly verbose — but he’s also a ferocious wit. Despite the weight of its literally canonized subject matter, his Saint Joan is two-thirds comedy, one-third fiery courtroom drama, and I’ve seen more than one production of it that earns its length — sometimes over three hours; here, two hours and 45 minutes — by virtue of its inexhaustible vitality (in 2012, Bedlam brought the sprawling play gloriously to life using only four actors). But if your first experience of Shaw or his Joan is Sullivan’s tepid production and its disappointingly soft starring turn by Condola Rashad, you could be forgiven for writing this vigorous play and its fascinating playwright off as a collective bore.\n\nThe trouble starts before anyone even sets foot on stage. Scott Pask’s set design — which resembles the innards of a massive golden pipe organ and is clearly inspired by the bells in which this Joan hears the voices of her saints — immediately tells us we’re in for something Epic. Shaw’s play begins with a comic debate about eggs between a French captain and his steward. Joan, whom the steward calls “the Maid” and blames for the inability of the captain’s hens to lay, is still just an enthusiastic 17-year-old farm girl. When she appears, she’s all bouncy, generous excitement, a kind of sharp, persistent Pollyanna who wants the captain to give her a horse so that she can go to war and save France. The scene, like those that follow, is bright, fast, and witty — not a self-conscious chapter of a historical saga but a sly piece of social comedy. But Pask’s set, heavy and gleaming, gives us the end of the story, not its beginning. It traps Joan inside the gilded cage of her saintliness from the start, making it as difficult for her to move and breathe as the clunky suits of full plate armor with which costume designer Jane Greenwood loads down the actors.\n\nWhy Greenwood and Sullivan have decided that Saint Joan needs to be layered with shining armor and cumbersome technicolor medieval robes, I have no idea. Like the set, the costumes feel self-serious, and in their bright, primary-colored tidiness, they also feel a bit silly, only a few degrees removed from the Danny Kaye comedy The Court Jester. (As with Carousel a few blocks away, Saint Joan’s is apparently a premodern world without dirt.) The choice to go period accurate — or at least period pretty — also seems like a hat on a hat. Shaw’s characters tell us who and what they are as soon as we meet them: “What am I? Am I Robert, squire of Baudricourt and captain of this castle of Vaucouleurs, or am I a cowboy?”; “You see, I am an archbishop, and an archbishop is a sort of idol.” This kind of exposition frees a director up to make visual choices beyond the literal, but Sullivan and his designers have chosen to go down the most unimaginative road.\n\nMost grating of all is Bill Frisell’s original music, a variety of treacly piano melodies that, especially near the show’s ending, combine with Christopher Ash’s sparkly projection design to push Saint Joan into maximum mawkishness. This aesthetic schmaltz might in fact be the production’s only real emotional extreme, for Sullivan has somehow managed to anesthetize the majority of play’s action. Saint Joan, for all its energy and intelligence, is overwritten: Shaw restates his arguments and doesn’t kill his darlings — in a series of notes before his play, he even gets snippy about the suggestion that cutting would improve it. A production can make this excess verbiage work, but only by lighting a fire under it, by turning Shaw’s arguments into zinging pitched battles, powered by both by a sense of urgency in the actors’ performances and an underlying joy in the language itself. Here, scenes coast where they should roller-coast, snooze where they should crackle, and actors are constantly dropping punch lines. (That some of these jokes do get scattered laughs is a testament to the strength of the writing.) And at the center, the sometimes-exquisite Condola Rashad is turning in a surprisingly edgeless performance.\n\nRashad was sneaky-brilliant in last year’s A Doll’s House Part 2, as a young woman whose conventional desires, floaty voice, and soft, unblinking smile belied something iron-willed about her, perhaps even a tiny bit touched. That sense of backbone, and of rapt intensity, would seem to make her a perfect candidate for Joan, and I believe that in another production, she could find her fire. But the dreamy softness that served her well in A Doll’s House Part 2 has followed her here, and it’s dragging down the show. What distinguishes Shaw’s Joan is her boundless energy and her sharp sense of humor. She really is a 17-year-old, naïve and stubborn and immensely excited. When de Baudricourt, the captain she’s come to convince in the play’s opening, responds to her sunny, exalted certainty of purpose with, “Well, I am damned!”, Joan quips brightly, “No, squire: God is very merciful.” She’s quick, and her head isn’t so much in the clouds that she doesn’t know a joke when she hears one. But Rashad apparently doesn’t, or Sullivan isn’t helping her find them. She plays Joan sweet and straight, and when her big moments come — two speeches of blazing defiance that should bring down the roof of the theater — she plants her feet and gets serious, but she only achieves about a quarter of the wallop these passages are capable of packing.\n\nAs for the rest of the ensemble, Sullivan is tying cinder blocks to their feet. They often have to deliver huge chunks of vehement argument while seated — you can actually see their bodies twitching, begging to get involved — and the lackluster staging often seems to obey a rule that, whenever one person is talking, no one else can move. During a scene in which Joan quarrels with John Glover’s incredulous Archbishop of Rheims, I actually watched Daniel Sunjata’s Dunois — one of Joan’s most ardent, concerned friends — stare blankly into the middle distance as she spoke. It’s the most basic acting misdemeanor — switch off while you wait to talk again — and it’s shocking that Sullivan has allowed such lifelessness to become the signature of his production.\n\nThere are a few notable exceptions. Patrick Page, who does double duty as Robert de Baudricourt and the Inquisitor who ultimately sends Joan to the stake, has a good ear for the text and is especially effective in his second role (I even had to check the program to make sure it was him, so distinctly does he draw the two characters). His Inquisitor is a deep-voiced, unflappable, utterly chilling bureaucrat — an executioner in the guise of a forgiving father figure. He’s got to deliver one of the show’s longest speeches, and more so than any other actor, he holds our attention and guides us powerfully through the meticulously crafted argument. Jack Davenport is also a standout as the Earl of Warwick, the English politico who has no patience for religious cant and has to dance carefully through a debate about Joan’s fate with Peter Cauchon, the Bishop of Beauvais. Both men want the same thing — the troublesome girl’s death — but the cynical Warwick has to placate Cauchon’s desire to frame the dirty business as a righteous mercy killing. Davenport drips with polite skepticism as he winds his way through the circuitous scene, which might as well occur over whiskey and cigars in a London gentleman’s club. The fact that he’s actually British doesn’t hurt: It’s not that Saint Joan needs to be performed in its author’s accent, but it does have British cadences to it, and Davenport is one of the few that picks up the play’s brisk native rhythm.\n\nSaint Joan climaxes with its protagonist’s trial, specifically with the moment when she tears up the recantation that was manipulated out of her and goes boldly to the stake. Frustrated as I was by this production’s persistent flatness, I was shocked when a group of audience members started to cheer. As Rashad’s Joan faced down the inquisitors with newfound fervor — “His ways are not your ways. He wills that I go through the fire to His bosom; for I am His child, and you are not fit that I should live among you.” — someone in the crowd even jubilantly shouted “Say it!!” Again, I couldn’t help thinking that language this powerful is capable of finding its mark even through the haze. But I thought something else too, and it was this: Are people cheering specifically for Joan’s faith, for her unwavering commitment to a God that they recognize and share? I don’t know, but I think that some might have been. Sullivan’s ad-cliché-inspirational production certainly enables such a response, but I challenge the notion that faith in Christ is actually what Saint Joan is about, or that it’s what keeps artists returning to her story. For me, Joan is a figure like Don Quixote, immortal precisely because she was always doomed. Shaw’s play is about not heavenly triumph but human hypocrisy — how we crush the dreamer under our heel and then memorialize her. That, at least, is a point still sharp as Joan’s sword and vivid as the fire that consumed her.\n\nShow \n \n \n Comment\n \n\n Theater Review: Saint Joan, With Armor But Not Much Heat\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1856,
  "archivePath": "data/archives/reviews/saint-joan-2018/vulture--sara-holdren_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:14:24.397Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1856,
  "tierReason": "Full review text"
}