{
  "showId": "finding-neverland-2015",
  "outletId": "ap",
  "outlet": "Associated Press",
  "criticName": "Mark Kennedy",
  "url": "http://abcnews.go.com/Entertainment/wireStory/review-bways-finding-neverland-finds-groove-30350053",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "British playwright James Graham's story is part Edwardian melodrama, part love story, part origin story, part valentine to invention and part send-up of the theater itself. There's nothing wrong with that, it's just that each has its own tone. Sometimes Graham is deadly earnest, sometimes he's sly and often he's just trying too hard at both. 'Finding Neverland' awkwardly juggles parental death and divorce and puts them in a Disney show that Disney long ago stopped making...When the show is working on all cylinders, it's absolutely thrilling...The music and lyrics...lean on soaring pop melodies and lilting Irish folk. Some hit -- 'When Your Feet Don't Touch the Ground' -- and some don't -- 'All That Matters'...A decision seems to have been made to paper over any gaps in the show's coherence by backing up a truckload of pixie dust and pumping it into the theater. It also desperately wants you to cry with a series of false endings that will have you exhausted. 'Finding Neverland' has some great performances but never finds its groove.",
  "bwwScore": 6,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-FINDING-NEVERLAND-Opens-on-Broadway-Updating-LIVE-20150415",
  "showScoreExcerpt": "\"Exuberant, quirky and somewhat conflicted about what it wants to be...It's a celebration of imagination that labors hard for a consistent tone and often leaves you feeling manipulated...Part Edwardian melodrama, part love story, part origin story, part valentine to invention and part send-up of the theater itself. There's nothing wrong with that, it's just that each has its own tone. Sometimes Graham is deadly earnest, sometimes he's sly and often he's just trying too hard at both.\"\n\nRead more"
}