{
  "showId": "finding-neverland-2015",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "http://www.hollywoodreporter.com/review/matthew-morrison-finding-neverland-theater-789037?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+thr%2Fnews+%28The+Hollywood+Reporter+-+Top+Stories%29",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "web-search",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "Bombastic and exhausting, the show confuses childishness with an affinity for the child inside...good luck to it, if only this family-friendly musical...didn't work so strenuously for its meager ounce or two of charm...the show does have a heart-stopping death scene that's both moving and visually spectacular in its bewitching stagecraft and its elegant knitting together of imagery and theme. But the two hours-plus leading up to that moment, more often than not, are a chore...On the plus side, the expected patchwork signs of a Frankenstein's monster are not apparent. The show is fairly much of a piece, even if there's scant cohesion to the new score by Take That frontman Gary Barlow and Brit songwriter Eliot Kennedy, which weaves cloying platitudes into numbers that run from generic pop to bad theatrical pastiche...At the core of the show are sensitive, naturalistic performances from Morrison and Kelly, two accomplished musical-theater actors who sketch their characters' mutual yearnings and sorrows in delicate strokes, at times finding sincerity even in the most hackneyed lyrics...there's nonetheless no convincing argument here that a Finding Neverland musical was ever an artistically valid idea.",
  "bwwScore": 4,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-FINDING-NEVERLAND-Opens-on-Broadway-Updating-LIVE-20150415",
  "showScoreExcerpt": "\"Bombastic and exhausting, the show confuses childishness with an affinity for the child inside, at times recalling \"Wicked\" in its busily assaultive hyperactivity, but without that show's catchy songs or engaging central character dynamic...A rare blemish on the track record of gifted director Diane Paulus, the show does have a heart-stopping death scene that's both moving and visually spectacularBut the two hours-plus leading up to that moment, more often than not, are a chore.\"\n\nRead more",
  "publishDate": "April 15, 2015"
}