{
  "showId": "finding-neverland-2015",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "http://variety.com/2014/legit/reviews/theater-review-finding-neverland-musical-1201282806/",
  "publishDate": null,
  "fullText": "Sometimes wan and sometimes wonderful, this Broadway-bound new musical produced by Harvey Weinstein will need more theatrical magic if it wants to get audiences hooked.\n\nThe new play that J.M. Barrie is struggling to write — which would eventually become \"Peter Pan\" — in the Broadway-bound tuner \"Finding Neverland\" doesn't come alive until he finds his villain in Captain Hook. The same can be said for the sometimes wan but sometimes wonderful new musical that is premiering at the American Repertory Theater in Cambridge, Mass. Until that moment, the family-friendly tuner, produced by A.R.T. by special arrangement with movie mogul Harvey Weinstein (who will make the show his first major theatrical project as lead producer when the production moves to Broadway) and based on Miramax's 2004 film of the same name, is well-sung, occasionally charming and nicely staged — but bland. \"Finding Neverland\" still needs to find itself.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n How Brandi Carlile’s Girls Just Wanna Weekend Became the World’s Warmest Music Festival: It's Not Just the Tropical Temperatures \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Brandi Carlile and Sam Smith: A Conversation About Bravura Voices, Fashion as Queer Armor and Having a Nonbinary Headliner for Carlile's Girls Just Wanna Weekend\n\nIt takes the soaring song that closes the first act — showcasing topliner Jeremy Jordan (\"Smash\"), who plays the introverted Scottish playwright with sweet affection and a dash of sexiness — to give the production a much needed lift as the protagonist finds his inner strength. It's his \"Let It Go\" moment as he confronts his demons, as personified by Hook (Michael McGrath, who also plays Barrie's producer Charles Frohman with vinegary relish).\n\nBut aside from such a designated setpiece, you know something is missing when the servants in the show — performing some eccentrically playful choreography by Mia Michaels — are having the most fun onstage.\n\nMuch work has been done since the musical opened in 2012 in Leicester, England, with the addition of a new creative team including helmer Diane Paulus (who reimagined \"Pippin\" for its current Broadway revival), new book writer James Graham (National Theater's \"This House\") and new score by Brit pop songwriters Gary Barlow (of '90s boy band Take That) and Eliot Kennedy. But much more work still needs to be done before this show can fly.\n\nWhile some of the tunes have an easygoing, big-note pop appeal — including the title song, which was previewed on the Tony Awards by Jennifer Hudson (no, she's not in the show) — others fall in the category of serviceable.\n\nThe story centers on Barrie and his writer's block — not the easiest thing for audiences to identify with at the top of a show — and how he finds inspiration and his true self with a beautiful widow (Laura Michelle Kelly) and her rambunctious boys (Alex Dreier, Hayden Signoretti, Sawyer Nunes) — especially one named Peter (Aiden Gemme), who at first resists Barrie's urging to embrace his kid imagination.\n\nBut the boy's quick turnaround in Graham's straightforward narrative robs the first act of potential interest and some character individuality. Absent that conflict, a dash of drama is provided by the widow's imperious mother (Carolee Carmello), wary of Barrie's attention to the family and of his shallow wife (Jeanna DeWaal).\n\nUnderstandably, much of the messiness of the real-life story has been cleaned up, simplified or sentimentalized, but many of the sharp edges and a lot of the verve have been lost, too. The first act lags until the end, despite a few appearances by Barrie's theatrical troupe of tropes and a sequence in which the kids let loose — egged on by Barrie — at a dinner party.\n\nThe second act has more oomph as Barrie's new play heads toward its 1904 opening night, and the widow falls ill. Though there is no soaring in the show (a strategic error, since Broadway alum \"Peter and the Starcatcher\" did the no-fly zone to greater effect), the widow's exit to Neverland is a mesmerizing piece of stagecraft with an \"air sculpture\" by Daniel Wurtzel.\n\nBut nothing in the production is quite as delightful as Tinkerbell's pre-show appearance. “Finding Neverland” will need more of that kind of theatrical magic if it wants to get audiences hooked.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"The new play that J.M. Barrie is struggling to write — which would eventually become “Peter Pan” doesn’t come alive until he finds his villain in Captain Hook. The same can be said for the sometimes wan but sometimes wonderful new musical that is premiering at the American Repertory Theater in Cambridge, Mass. Until that moment, the family-friendly tuner, is well-sung, occasionally charming and nicely staged — but bland. “Finding Neverland” still needs to find itself.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright",
    "playbill-verdict"
  ],
  "playbillVerdictUrl": "http://variety.com/2014/legit/reviews/theater-review-finding-neverland-musical-1201282806/",
  "textWordCount": 699,
  "archivePath": "data/archives/reviews/finding-neverland-2015/variety--frank-rizzo_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:13:15.048Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 699,
  "tierReason": "Full review text"
}