{
  "showId": "baby-its-you-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2011/legit/reviews/baby-it-s-you-1117945046/",
  "publishDate": "April 27, 2011",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Despite boasting a catalog of timeless Burt Bacharach-Hal David songs and the rags-to-riches story of girl group the Shirelles, this jukebox musical feels disappointingly generic.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Despite boasting a catalog of timeless Burt Bacharach-Hal David songs and the rags-to-riches story of girl group the Shirelles, this jukebox musical feels disappointingly generic.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (25 words)",
  "textWordCount": 475,
  "archivePath": "data/archives/reviews/baby-its-you-2011/variety--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T09:27:42.601Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wordCount": 475,
  "tierReason": "showNotMentioned — wrong content scraped",
  "wrongFullText": "Dedicated journalists in Diyarbakir, Turkey's Kurdish stronghold, risk their lives to expose injustice during the turbulent early 1990s in heartfelt drama \"Press.\"\n\nDedicated journalists in Diyarbakir, Turkey’s Kurdish stronghold, risk their lives to expose injustice during the turbulent early 1990s in heartfelt drama “Press.” An involving treatment of hot button issues, this feature debut from multihyphenate Sedat Yilmaz nabbed a special jury kudo and the critics’ prize at the Istanbul fest. Although the story might seem naive to Western eyes, a free press still remains under threat in Turkey, where 30 journalists were murdered between 1992 and 1994, along with 17 newspaper distributors and vendors. Further fest travel is assured, particularly to human rights events.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘The Shitheads’ Review: Dave Franco and O’Shea Jackson Jr. Are Losers on a Mission in a Broad Comedy Tinged with Viciousness \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Take Me Home' Review: Sundance Award-Winner Paints an Intimate Portrait of a Family in Crisis\n\nSet in a period when armed clashes between the followers of the PKK (Kurdistan Workers’ Party) and the Turkish state reached a peak, the action centers on the closely-knit team of the leftist publication “Free Agenda.” There’s coolly rational editor Hasan (Kadim Yasar); intrepid reporters Faysal (Tayfur Aydin), Alisan (Engin Emre Deger), Kadir (Sezgin Cengiz) and Lokman (Bilal Bulut); secretary — and lone female — Songul (Asiye Dincsoy); and resourceful Kurdish office boy Firhat (utterly engaging non-pro Aram Dildar), whose transformation from shy rookie to seasoned journalist provides the central narrative arc.\n\nAfter publishing a story linking the military and a shadowy organization responsible for murders, kidnappings and drug transports, Free Agenda staffers must contend with anonymous threats, beatings, police search and seizure, lawsuits and, most chillingly, assassinations. Yet despite near overwhelming setbacks, they courageously and ingeniously continue their work — and the work of getting the paper to its readers.\n\nIn a country where the commercial cinema is notable for melodramatic excess, Yilmaz proves a dab hand at visual story telling, making an impression with his helming restraint, and effectively building tension through framing and editing, lending small, lethal acts of violence a disturbing intensity. Near-wordless sequences, such as a nighttime pursuit through the deserted streets, an early morning attack on the newspaper office, and street urchins delivering the paper to vendors after the local distributor succumbs to external pressure also set pulses racing.\n\nAlthough burdened by some overly earnest speeches about the nature and function of journalism, Yilmaz’s screenplay nevertheless captures the camaraderie of the newsroom, incorporating welcome humor, salty language and sharp repartee. While Firhat is the most developed character, the rest of the cast (all established theater thesps) manages to add depth to one-note roles.\n\nColor-desaturated HD lensing by Demir Gokdemir creates a strong sense of place, while art director Nevin Dogan makes visceral the office’s shift from functioning workplace to makeshift fortress. Yilmaz provides the pacey cutting."
}
