{
  "showId": "mamma-mia",
  "outletId": "new-york-magazinevulture-jackson-mchenry",
  "outlet": "New York Magazine/Vulture (Jackson McHenry)",
  "criticName": "Unknown",
  "url": "https://www.vulture.com/article/theater-review-mamma-mia-broadway-revival-abba.html",
  "playbillVerdictUrl": "https://www.vulture.com/article/theater-review-mamma-mia-broadway-revival-abba.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nThe history book on the shelf is always repeating itself.\n                  Photo: Joan Marcus/all rights reserved\n              \n            \n              \n        Two and a half decades after its sun-soaked pop fantasy arrived in England, Mamma Mia! lives on in an eternal end of history — specifically, the 1990s. The boomers get older, the world grows unstable (remember, this show premiered on Broadway in October 2001). But Mamma Mia! does not change. When you head into the Winter Garden Theatre this summer, Donna Sheridan, the expat hotel manager whose daughter has decided to invite her three possible fathers to her wedding, is still blithely refusing to learn what the internet is. She is still someone who was cavorting around in the 1970s with her girl group. There are still perky young men in wetsuits to flirt with and brooding old flames who followed those rising late-20th-century market tides from the counterculture into banking, architecture, and travel writing. But if the show’s universe refuses to age, that doesn’t mean the musical itself can’t tarnish. The title still carries that big old exclamation point, but the fantasy is more than a little long in the tooth. Maybe it should be styled with a question mark, or just an ellipsis. Mamma mia … they sure do sing a bunch of ABBA songs.\n\nThe air of “eh, fine enough” is not much of a surprise given that this is not a fresh revival but instead the Mamma Mia! that has been on tour around the country. The show is simply looping back around to Broadway, and it’s a relatively safe bet — in this case, intended to fill the cavernous Winter Garden — at a moment when several new musicals have flopped. We’ve seen a similar dynamic with the cheaply made revival of The Wiz, and we’ll see it again later this fall with a Halloween engagement of Beetlejuice. In the case of Mamma Mia!, you’re getting a replica of the production that was on Broadway from 2001 through 2015, directed by Phyllida Lloyd and now with some visible cost cutting. Those white taverna walls, built to be packed into trucks and carted from city to city, look far too weightless to be made of stone, and there’s more of a plasticky sheen to the jumpsuits donned by Donna and the Dynamos than I remember. I spent a lot of the time pondering the gibberish text on the little rowboat haphazardly toted back and forth onto the side of the stage: What does WΔTΣRLOO actually mean in Greek?\n\nThe reduced power level applies to the casting, too. Mamma Mia! should theoretically function as a star vehicle considering the plot is delightful nonsense meant to be outshone by the songs and performances, whether by force of belting or pure charisma. Everyone onstage here can outsing their counterparts in the movie (at the very least, everyone’s far above the level of Pierce Brosnan). But the film has the energy of people who can’t believe they’re getting away with a scam, whereas this cast, seemingly hemmed in by careful brand management, comes across as competent and dutiful, not the vibe you want from characters who are on eternal vacation. Jalynn Steele is a notable standout as the rich friend, Tanya, having fun with her character’s harsh bob, and Victor Wallace makes for a very earnest ex-lover as Sam. The younger actors flounder the most: There’s no spark between Sophie (Amy Weaver) and Sky (Grant Reynolds), upon whose wedding the plot hangs. It’s possible that, raised on an island like Miranda in the Tempest, she had simply never seen another man before him.\n\nIt can be difficult to embrace Mamma Mia!’s escapism when you keep bumping up against thoughts of economics, but to give the show credit, it can still deliver some confectionery thrill, even on a budget. Buried within that tangled tale of Donna’s three exes, there’s something rare about a show that centers on a middle-aged woman’s sexuality without much chiding about her free youth. And those ABBA songs have a thunderous synth-y and Pavlovian force, especially when heavily amplified: The entr’acte launches into the opening piano riff of the title song with the volume of a cannonade. And I’ll happily admit the triumphal heartbreaker “The Winner Takes It All,” positioned as the show’s 11-o’clockish scorcher, will always make me coo with delight, even if Christine Sherrill as Donna doesn’t go for the full Carolee Carmello wail (or, for that matter, Agnetha Fältskog’s). Those songs are exemplars of the chart-topping fluff the Swedes somehow specialize in (see also, Avicii, Zara Larsson, and the father of another musical, Max Martin), but they do present a sneakily tricky dramatic challenge. You don’t want to play them entirely straight, and you can feel the audience quickly getting bored when “One of Us” is drearily requisitioned to describe a couple’s fight. But you also don’t want to wink too obviously; too much mugging about how the lyrics of “Chiquitita” are goofy is also tiresome. Mamma Mia! has to exist in some heightened guilt-free plane where the silliness of the music is its own dramatic justification.\n\nThe show’s most fundamental dramatic impulse, really, is about insisting that it’s possible to stop time. You don’t need to think about the real world; come with us on vacation. Don’t worry about your daughter’s wedding; we’ll find a way to prevent it from happening. Your old loves are still viable. Your old clothes fit. Your old friends are ready to drop everything to hang out. You don’t have to think about tomorrow. The show achieves that alchemy, finally, when the plot ceases and everyone comes out for the double encore, continuing to carry on through those ’70s hits in those ’70s jumpsuits, just because the audience is happy to stand up and keep cheering and singing along. The aughts will never happen if you stay with us forever on the beach. The clock will stop, and we will give you, instead, a man after midnight.\n\nMamma Mia! is at the Winter Garden Theatre through February 1, 2026.\n\nShow \n      \n    \n    Comment\n  \n\n\n\n      Revisiting Mamma Mia!, Where the 21st Century Never Arrives\n\n\n\n    \n      \n        \n  \n\n\n      \n      \n      \n        \n  \n\n\n      \n    \n\n  \n  \n\n\n\n  \n\n\n\n        Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1041,
  "archivePath": "data/archives/reviews/mamma-mia/new-york-magazinevulture-jackson-mchenry--unknown_2026-02-01.html",
  "textFetchedAt": "2026-02-01T14:55:50.689Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251222104446",
  "archiveOrgUrl": "http://web.archive.org/web/20251222104446/https://www.vulture.com/article/theater-review-mamma-mia-broadway-revival-abba.html"
}