{
  "showId": "the-glass-menagerie-2013",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "http://newyorktheater.me/2013/09/26/the-glass-menagerie-on-broadway-review-zachary-quinto-cherry-jones-bring-tennessee-williams-home/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "Like many great stage actresses, Cherry Jones has a magic in person that doesn't translate well. It seems fitting that this performance, and this production, will really exist only in memory - but there it will lodge.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-GLASS-MENAGERIE-Opens-on-Broadway-Updating-LIVE-20130926",
  "contentTier": "complete",
  "fullText": "When we first see the Wingfield family together in the splendid production of “The Glass Menagerie” that has now opened on Broadway, Zachary Quinto is sitting at the dinner table holding his hands behind his back, as if in a straitjacket; all that’s missing is the gag — a precise physical representation of how his character Tom feels in the stifling, impoverished household of his family in St. Louis in the 1930’s. Celia Keenan-Bolger sits with her back terribly straight, her hands primly in her lap, as if under the watchful eye of an ever-reprimanding schoolmaster, which is surely how her character Laura feels. And Cherry Jones gestures as if she is conducting an orchestra, the broad sweep of her arms showing a strong woman in command of her family. Only later does the thought occur: Her Amanda is using her hands this way to maintain her balance, to keep from falling down. Even without Tennessee Williams’ words, this seventh production on Broadway of his first masterpiece brings home “the saddest play I’ve ever written,” as he called it; “it is full of pain. It’s painful for me to see it.” Under the direction of John Tiffany, who won a Tony for directing “Once The Musical,” the playwright’s heartbreak becomes visual and physical. Williams’ play is produced far too frequently to say that any one production is the best ever, and there’s a danger in doing so (as we saw in the enthusiastic critical reception for Matilda); raising expectations too high can result in disappointment. So I won’t make extravagant claims for the production that comes out of the American Repertory Theater of Cambridge, Massachusetts; after all, I wasn’t even around to see the original one in 1945 with the legendary Laurette Taylor that one critic said offered “some of the finest acting to be seen in many a day.” The last time I saw “The Glass Menagerie” on the stage was just three years ago, and, oddly, I saw it twice in one week, one an over-praised production at the Roundabout, and then a little-noticed and spectacular staged reading as part of the marathon Tenn99 festival at the Labyrinth Theater. The Roundabout version, which originated at the Long Wharf in New Haven, featured a memorable performance by Judith Ivey that seems similar to the interpretation by Cherry Jones – Amanda is not a faded, high-strung Southern belle frivolous to the point of delusion . She is rather a strong-willed woman who is adapting to unfortunate circumstances, determined to protect her family, and trying to regain in some small way what has been lost. I suppose I’ve also seen Lauras as affecting as Celia Bolger-Keenan, actresses who have made themselves seem more awkward and ill-proportioned. But I can’t recall any stage production of Tennessee Williams’ story where everybody and everything worked together so well — every detail seems just right. Bob Crowley’s set plays a magic trick with the furniture (I won’t spoil this) and presents an almost-abstract fire escape that recedes into the horizon — emphasizing how ordinary the Wingfield family has become, just another family with a fire escape. Natasha Katz’s lighting design makes clear this is a “memory play,” emerging in shimmering spots of light from the darkness of Tom’s recollection — and his guilt, and obsession, and affection. Zachary Quinto, who is best known for playing Spock in the new Star Trek movies, is a revelation as Tom, although those of us who saw him in the Signature revival of “Angels in America” probably shouldn’t be surprised. Tom is the obvious stand-in for the playwright, and Quinto has chosen to make the character more obviously like the author, nailing Williams’ lackadaisical Southern accent. Quinto also literally moves backward when taking us into the household of his youth, and to the day when, on his mother’s urging, he invites to his home a co-worker at the warehouse. Jim O’Connor is a former Big Man on Campus at the same high school Laura attended, and, while he is meant to be a normal person, he is also a symbol – as Tom explains in one of monologues, “he is the long-delayed but always expected something that we live for.” Brian J. Smith is the least-known to theatergoers in the four-member cast (He plays Lt. Matthew Scott in the TV series Stargate Universe.) But he holds his own, managing to turn the symbol of normalcy into a credible character, a well-meaning man who has, in his own way, lost the glory that was his past, but, unlike Amanda, doesn’t dwell on it. All four actors recently said that they didn’t like “The Glass Menagerie” when they first read it in school. It is possible that the play shares something with its star. Like many great stage actresses, Cherry Jones has a magic in person that doesn’t translate well. It seems fitting that this performance, and this production, will really exist only in memory – but there it will lodge. The Glass Menagerie At the Booth Theater By Tennessee Williams; directed by John Tiffany; movement by Steven Hoggett; sets and costumes by Bob Crowley; lighting by Natasha Katz; production stage manager, Steven Zweigbaum; Cast: Cherry Jones (Amanda), Zachary Quinto (Tom), Celia Keenan-Bolger (Laura) and Brian J. Smith (the Gentleman Caller). Running time: 2 hours 30 minutes including an intermission. The Glass Menagerie is scheduled to run through January 5, 2014 Extended through February 23, 2014 Broadway Cast of Glass Menagerie Didn’t Like The PlayAugust 20, 2013In \"Broadway\" Zachary Quinto on Screen Acting Vs. Stage ActingAugust 20, 2013In \"New York Theater\" The Funny Side of Gay Persecution. Cicely Tyson Trumps James Earl Jones. Zachary Quinto Returns. Week in NY TheaterOctober 19, 2015In \"New York Theater\"",
  "isFullReview": true,
  "textWordCount": 954,
  "archivePath": "data/archives/reviews/the-glass-menagerie-2013/nyt-theater--jonathan-mandell_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:59:59.547Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 954,
  "tierReason": "Full review text"
}