{
  "showId": "job-2024",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/2024/07/30/broadway-review-job-is-a-stimulating-psychological-thriller-on-toll-tech-takes/",
  "playbillVerdictUrl": "https://www.nydailynews.com/2024/07/30/broadway-review-job-is-a-stimulating-psychological-thriller-on-toll-tech-takes/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Broadway — heck, the entire American theater — has set itself up as the mortal enemy of phones, viewing those powerful and addictive little devices as detested rivals from the loathsome outside world to be stomped out and shut down. On pain of their owner's humiliation from fellow patrons or, if Patti LuPone or her acolytes are performing, from the stage. Of course, Broadway still mostly is run by Boomers who don't understand that we all now live mostly on the internet.\n\nThat, at least, would be the POV, LOL, of a character named Jane, a stressed out millennial who arrives one day at the office of a 60-something therapist named Loyd, and points a gun at his head.\n\nSticking a weapon in the face of your shrink at the start of your required session might not get you a clean bill of mental health, which is what this woman seeks in order to return to her job at an unnamed West Coast company that sounds very much like Facebook or Google. But it sure is a zesty way to start \"Job,\" the stimulating and daring new thriller from Max Wolf Friedlich that has transferred to the Helen Hayes Theatre with Peter Friedman (best known for playing Logan Roy's consigliere on \"Succession\") and Sydney Lemmon (who happens to be the granddaughter of Jack).\n\nStructurally, the play, directed by Michael Herwitz, is something of a throwback, recalling works like David Mamet's \"Oleanna,\" both in the level of dramatic tension on display and the searing focus on the inability of an older man and a younger woman not just to understand each other's needs but even to speak the same language.\n\nAnd like that play, \"Job\" initially stacks the deck against the young woman who appears unbalanced, stressed, outraged, overwhelmed with stimuli, immobilized by her worries about her own subconscious racism, and generally not unlike some of the women one sees ranting on Twitter about all the inequities of the world, often posted by a third party who wants to humiliate them.\n\n\"Honestly,\" she says, oblivious to any narcissism, \"on days like today I just wish I could be in the ER where there are no choices at all.\"\n\nFriedman, meanwhile, plays a far gentler character who is lucid, kind and just trying to help, if only this Jane will let him.\n\nBut the strength of \"Job,\" even if you question some of its contrivances and you see some of its twists coming, is how the play actually addresses some of the salient questions of the moment, typically ignored by the theater and not just the huge gap in active thinking and linguistic expression between older men and younger women, a yawning chasm about to influence the race for the White House.\n\n\"Why are Boomers so upset about using technology when they're the ones getting rich off of it?\" Jane asks. \"Instead of being happy with having all the money, all the power, Boomers spend their time being mad that 16-year-old girls are using filters on Instagram to feel prettier. Like why're you offended that we feel insecure? We're protecting ourselves from the thoughts your shampoo commercials made us think!\"\n\nTouche, Jane. And the genuinely scary Lemmon, who dives deep into Jane's fragile psyche, manages both to articulate her telling observations without shying away from the manifestation of her neuroses. No mean acting feat, that.\n\nFriedman, playing a subterranean old fox, has to fight to keep up, but this is precisely the kind of role that you'd expect from a great actor who just spent years on a hit TV show and now wants to challenge himself by doing the opposite on a stage where there is nothing filmed out of sequence and no escaping the stimulations of a present-tense partner.\n\nYou're better not knowing what Jane actually does for a living. It's a late reveal; suffice to say it involves a very odious and very necessary kind of gatekeeper, of the kind that would do a number on anyone's head. And I'll say no more about Loyd; there's plenty you won't be sure of, even when you are back out on the street, releasing endorphins into your phone.\n\nHerwitz's production uses plenty of screeches and light flashes, some of which work better than others. And he doesn't entirely nail the ending; even ambivalence still requires more structural finality. But \"Job\" is a very provocative and genuinely disrupting 85 minutes with acute observational powers; you won't be bored for a millisecond. And in an era of ascendant moralizing in plays and musicals, its cynicism is refreshing.",
  "isFullReview": true,
  "textWordCount": 764,
  "archivePath": "data/archives/reviews/job-2024/nydailynews--chris-jones_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:42:07.854Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "Insufficient text in archive: 0 chars"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240801074335",
  "archiveOrgUrl": "http://web.archive.org/web/20240801074335/https://www.nydailynews.com/2024/07/30/broadway-review-job-is-a-stimulating-psychological-thriller-on-toll-tech-takes/",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 764,
  "tierReason": "Full review text"
}