{
  "showId": "job-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2024/07/30/job-therapy-can-be-dangerous/",
  "publishDate": "2024-07-30T21:26:40",
  "fullText": "When a play begins with one character pointing a gun at another, it’s bound to get your attention.\n\nThat’s certainly the case with Max Wolf Friedlich’s Job, newly transferred to Broadway after a hit Off-Broadway run. Theater veteran Peter Friedman and Sydney Lemmon (Jack’s granddaughter, recently seen in HBO’s Succession) star in this charged two-hander about a fateful encounter between a therapist and his new patient.\n\nIt’s an arresting opening, to be sure, effectively signaling that the playwright seems intent on keeping the audience in suspense throughout the 80-minute one-act which feels simultaneously underdeveloped and attenuated. The story revolves around Loyd (Friedman), an aging, earring-wearing hippieish shrink who designs crafts in his spare time, and Jane (Lemmon), a young woman seeing him for the first time.\n\nJane is not there to deal with garden-variety neuroses. She’s there because the company for which she works is forcing her to be evaluated after a workplace meltdown that went viral on the internet. She works in “User Care” for a social media company, which basically means that she must screen its content for disturbing material, of which there is apparently plenty. “I had a bad day,” she explains in deadpan fashion to Loyd while he watches the video of her epic meltdown on her phone (we only hear her screaming).\n\nSince the session began with him being held at gunpoint, Loyd is not surprisingly skittish as it continues, at one point jumping out of his chair and screaming in terror as she absentmindedly reaches into her tote bag. And Jane proves less than enthusiastic about having to be there, commenting, “I’m not sure therapy aligns with how I deal with things.”\n\nWe’re kept constantly disoriented throughout the play, with the therapy session periodically interrupted by bizarre sound and lighting effects that signal, well, it’s hard to say. Perhaps Jane’s disturbed state of mind, perhaps that things aren’t quite what they seem, or perhaps that the playwright is aiming more for shock value than coherence. Certainly, the proceedings don’t smack of realism, with Loyd telling his new patient details about tragic events from his life in a way no therapist would. But then again, if he didn’t, the shocking plot twist toward the end wouldn’t make sense.\n\nThat climactic revelation ultimately proves the play’s raison d’etre, and it’s neither convincing nor well earned. Even worse, Friedlich hedges his bets with a deliberately ambiguous climax that smacks less of, say, Pinter, than a writer unsure as to how to end his play.\n\nNot that the 80 minutes — let’s be generous by ignoring the fact that in real life the session would have ended in 45 — aren’t reasonably compelling. The playwright reveals a gift for sharp dialogue, with the tension frequently broken by some very funny lines. Director Michael Herwitz has staged the talky proceedings for maximum visceral effect, keeping us on edge throughout, and the two performers deliver riveting performances (even if Lemmon occasionally has trouble making herself heard in this larger theater).\n\nFor all the effective stagecraft on display, however, Job (even the title, which many people will assume refers to the Old Testament book, is deliberately confusing) mainly smacks of gimmickry. It’s a psychological thriller that relies too heavily on cheap thrills.\n\nJob opened July 30, 2024, at the Helen Hayes Theater and runs through September 29. Tickets and information: jobtheplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2024/07/30/job-therapy-can-be-dangerous/"
}
