{
  "showId": "lempicka-2024",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani",
  "url": "https://www.broadwaynews.com/the-broadway-review-lempicka-is-a-seductive-unpolished-musical-about-a-groundbreaking-polish-painter/",
  "publishDate": "April 15, 2024",
  "fullText": "Co-writers Carson Kreitzer and Matt Gould color outside the traditional lines, but are backed by enough talent to render a captivating portrait. Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “Lempicka.” Musicalizing the formative years of an icon is easy fodder for Broadway aspirants. Most often it involves a character that’s easy to root for who embarks on a journey with a clear moral arc. “Lempicka” enlists a more nuanced form, the Künstlerroman, a narrative about an artist's maturation. The new musical paints the life of Polish art deco pioneer Tamara de Lempicka (portrayed here by Eden Espinosa). Co-writers Carson Kreitzer and Matt Gould’s voluptuous new musical weaves together grandiose ideals about what it means to be an artist, what it means to be a woman and what it means to be at war with intimacies about queer love and female ambition. Ultimately, they scrape together a delicious, delirious portrait of this largely unknown juggernaut. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": false,
  "dtliExcerpt": "Ultimately, they scrape together a delicious, delirious portrait of this largely unknown juggernaut.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/lempicka/",
  "needsScoring": true,
  "textWordCount": 186,
  "archivePath": "data/archives/reviews/lempicka-2024/broadway-news--brittani_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:28:41.456Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 186 (min: 300)"
  ]
}