{
  "showId": "lempicka-2024",
  "outletId": "nytimes-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.nytimes.com/2024/04/14/theater/lempicka-review-chavkin-espinosa.html",
  "publishDate": null,
  "fullText": "Having dismissed her work as merely decorative, a fierce Italian gives harsh advice to an ambitious young painter: “You need to be a monster,” he brays. “Or a machine.”\n\nThe painter, Tamara de Lempicka, didn’t take the advice in real life because it was never given. But “Lempicka,” the new Broadway musical about her, which opened on Sunday at the Longacre Theater, certainly did, and then some. It’s a monster and a machine.\n\nA machine because it argues, with streamlined efficiency, that in her groundbreaking portraits of the 1920s and ’30s, Lempicka forever changed the representation of women in art, and thus changed women themselves. The volumetric flesh, aerodynamic curves and warhead breasts that so titillated Jazz Age Paris became, the show suggests, today’s template for glamazonian feminism.\n\nAs for “monster,” well, efficiency is not always pretty. Among the values compromised in the grinding of the musical’s gears are subtlety, complexity and historical precision. Yes, that fierce Italian existed; he was Filippo Marinetti, the founder of Futurism, and later a fascist. But the scene in which Lempicka studies art with him is, like many others, made up.\n\nDoes that matter in a musical that admits it is “inspired” by life, not faithful to it? Are there perhaps greater values than truth in play?\n\nBecause yes, another reason the show is a “monster” is that it’s a jolly big sing, with superior belting from several excellent practitioners of the craft. As Lempicka, Eden Espinosa blows thrillingly through nearly a dozen songs by Matt Gould (music) and Carson Kreitzer (lyrics). She has excellent company in Amber Iman as Lempicka’s lover Rafaela and Beth Leavel as a dying baroness who sits for a portrait. For good measure, Natalie Joy Johnson, as the cabaret star Suzy Solidor, contributes a barnburner to herald the opening of her lesbian hangout. Naturally the song is called “Women” — and it’s a nice change that a musical about them gives them pride of place.\n\nBut if there’s no denying the realness of the vocal power, and the sleekness of Rachel Chavkin’s staging on deconstructed Art Deco sets by Riccardo Hernández, the story (by Kreitzer and Gould) too often feels incredible in the wrong sense of the word. It’s not just that Marinetti (George Abud, excellent) is so weirdly central, or that Rafaela is a composite, or that in real life Solidor was a Nazi collaborator and Lempicka the baroness’s betrayer, not her portraitist. (Lempicka began her affair with the baron, played by Nathaniel Stampley, years before he was widowed.) It’s that the condensing, rejiggering and flat-out fudging of the plot create a contextual blur that obscures the main character.\n\nIf you look from enough of a distance, you at least get the right outline. The show’s Lempicka, like the real one, was born in Poland, and in 1916 married Tadeusz Lempicki (Andrew Samonsky) in St. Petersburg. The Russian Revolution sent them and their daughter (Zoe Glick) packing to Paris, where Lempicka resumed painting to pay the rent. Soon she accumulated lovers and patrons of both sexes, including the baron, who in 1933 would become her second husband. In 1939, with Germany threatening France, the couple — both Jewish — fled to the United States; we last see Lempicka washed up in Los Angeles in 1975.\n\nIt was a big life, filling the frame like her subjects. But the uncanny smoothness exemplified by the paintings — “Never let them see your brushstrokes,” she says — is not a successful stage technique. Too often history gets the airbrush here, inviting the same criticism that Marinetti lobbed at Lempicka: decorative. Chavkin depicts the Russian Revolution, and later the progress of fascism across Europe, too prettily, with big flags, shouted slogans, choreography resembling salutes and goose-steps (by Raja Feather Kelly) and flashing red lights (by Bradley King) that add up to an anemic “Les Miz.” If it borders on camp, the louche posing of the Paris demimonde crosses that border, substantial as sequins.\n\nThe artistic process is handled better. In one trenchant scene, Lempicka, impoverished in Paris, is so hungry she eats the pastries she’s painting. But instead of valorizing her romantic voraciousness as well, the musical is overeager to make her unconventionality palatable. “I had the great good fortune to love not once, but twice,” she says early on. “And I had the great misfortune to love them both at the same time.”\n\nThat there is little if any historical truth in that characterization is not ultimately the problem. The painter Georges Seurat in “Sunday in the Park With George” — a show referenced in the first lines of the script — is largely fictionalized too, a cad to his mistress and generally unlikable. “Lempicka” doesn’t have the craft, especially in the mis-accented, often vague lyrics, to make its title character a relatable modern woman, nor the boldness to let her be awful and great. Perhaps if it were less of a machine she could be more of a monster.\n\nLempickaAt the Longacre Theater, Manhattan; lempickamusical.com. Running time: 2 hours 30 minutes.\n\nJesse Green is the chief theater critic for The Times. He writes reviews of Broadway, Off Broadway, Off Off Broadway, regional and sometimes international productions.\n\nShare full article140Related ContentAdvertisement",
  "isFullReview": true,
  "dtliExcerpt": "“Lempicka doesn’t have the craft...to make its title character a relatable modern woman\"\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 870,
  "archivePath": "data/archives/reviews/lempicka-2024/nytimes-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:23:44.587Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_read_more_prompt",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251205055934",
  "archiveOrgUrl": "http://web.archive.org/web/20251205055934/https://www.nytimes.com/2024/04/14/theater/lempicka-review-chavkin-espinosa.html"
}