{
  "showId": "lempicka-2024",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/Lempicka.html",
  "publishDate": null,
  "fullText": "Lempicka. Book, lyrics, and original concept by Carson Kreitzer. Book and music by Matt Gould.. Directed by Rachel Chavkin. Choreography by Raja Feather Kelly. Set design by Riccardo Hernández. Costume design by Paloma Young. Lighting design by Bradley King. Sound design by Peter Hylenski and Justin Stasiw. Projection design by Peter Nigrini. Hair and wig design by Leah J. Loukas. Makeup design by Kirk Cambridge-Del Pesche. Creative consultant Peter Duchan. Music supervision and arrangements by Remy Kurs. Music director Charity Wicks. Orchestrations by Cian McCarthy. Music contractor Kristy Norter.\nCast: Eden Espinosa, Amber Iman, Andrew Samonsky, George Abud, Natalie Joy Johnson, Zoe Glick, Nathaniel Stampley, Mariand Torres, Alex Aquilino, Lauren Blackman, Stephen Brower, Kyle Brown, Holli' Conway, Veronica Fiaoni, Abby Matsusaka, Michael Milkanin, Jimin Moon, Mary Page Nance, Khori Michelle Petinaud, Julio Rey, Ximone Rose, Nicholas Ward, and Beth Leavel.\nTheater:  Longacre Theatre, 220 West 48th Street (between Broadway and 8th Avenue)\nTickets: Telecharge.com\n\nLempicka (book by Carson Kreitzer and Matt Gould, lyrics by Kreitzer, and music by Gould) uses a bioplay format to tell the story of its subject, the Art Deco portrait artist Tamara de Lempicka, played at full tilt by Eden Espinosa, a belter's belter if there ever was one.\n\nThe focus is mostly on the period of Lempicka's greatest success as an artist, at least in terms of name recognition and popularity, during the years between World War I and II. That is when she lived in Paris, having fled from her home in Russia at the time of the Revolution, along with her aristocrat husband Tadeusz Lempicki (Andrew Samonsky, in great singing voice and a welcome addition even in an unfortunately underwritten role) and their daughter Kizette (Zoe Glick).\n\nAs is the case with most bioplays, the script takes poetic license with the facts. What we are presented with is a portrait of the artist as a stand-in for women's empowerment. Lempicka's story unfolds via herky-jerky segments, loosely connected by a series of mostly emo-pop songs tethered with mostly narrative lyrics and mostly blasted out to the audience by the show's star, musicians, and sound designers Peter Hylenski and Justin Stasiw.\n\nYou'll never doubt for a moment that Espinosa's Lempicka is the central character (she may vaguely remind you of Evita, though without the lust for political power), but the show's best numbers are offered up by two other characters. One is the artist's muse, model and lover, Rafaela (Amber Iman, showing genuine star power when given half a chance). The other is a woman known as the Baroness (Beth Leavel, who only gets one song to perform but who turns it into the evening's heartfelt near-showstopper).\n\nGradually, Lempicka stops resisting her attraction to Rafaela, and, even though Tadeusz doesn't care that much (he has lovers of his own), she balks at being seen in public with Rafaela, who is, after all, a known prostitute, fearing it will hurt her career catering to wealthy clientele who pay her handsomely for painting their portraits. Over time, Lempicka happily bathes in the glow of the reflected image she has created for herself. As she tells her often-painted but generally neglected daughter, \"we will show the world only what we want them to see.\"\n\nAlas, the same can be said of director Rachel Chavkin, best known for working wonders with Natasha, Pierre & The Great Comet of 1812 and Hadestown. Here, less successfully, she tries to distract us with a constantly fast-paced light-and-sound display, which includes Raja Feather Kelly's frenetic choreography with lots of leaping, thrusting of arms, and precision movements. But she cannot overcome the fact that she is working with a cliché-ridden show about an artist who is undoubtedly interesting but who is painted only in slashes and slathers of color that prevent us from seeing her as an actual human being.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 636,
  "archivePath": "data/archives/reviews/lempicka-2024/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:35:11.459Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}