{
  "showId": "lempicka-2024",
  "outletId": "timeout-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.timeout.com/newyork/theater/lempicka-broadway-musical-review",
  "publishDate": null,
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Matthew Murphy and Evan Zimmerman | LempickaLempickaTheater, MusicalsSunday April 14 2024ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\nTamara de Lempicka is best known for the Art Deco portraits she painted in the 1920s and early 1930s: sculptural, imposingly sexy fusions of Cubism and Mannerism—her women’s conical breasts often press out from under luscious folds of bright fabric—that still present an enticing idealization of cosmopolitan life. In many of her works, the main figures’ heads are slightly bent to the spectator’s left, as though the paintings could not contain their subjects’ full size. And that, to less pleasing effect, is the feeling one gets from the messy new musical Lempicka, a portrait of the artist that tries to cram her into too small a frame, without the benefit of strong composition.\n\nLempicka’s story, which spanned most of the 20th century, offers no dearth of drama. As a Polish-Jewish teenager summering in Russia, she married an aristocrat, Tadeusz Lempicki, then saved him from the Bolsheviks at considerable personal cost. She embraced the louche life in Paris, rising to artistic prominence while taking multiple lovers of both sexes. (“I live life in the margins of society,” she reportedly said. “And the rules of normal society don’t apply in the margins.”) But in the late 1930s, with the Nazis on the march, she was forced to flee again, this time to America—with a rich and titled new husband—where she spent most of her remaining four decades in cultural obscurity.\n\nLempicka | Photograph: Courtesy Matthew Murphy and Evan Zimmerman\n\nThe most persuasive depiction of Lempicka the musical gives us is, ironically, in its framing device. Now an elderly baroness living in California, she sits on a park bench, dabbing at an easel, and strikes an imperious attitude toward her past: “History’s a bitch but so am I.” Eden Espinosa, in the title role, is at her best in these bookend scenes; she has a burnished steeliness whose luster she doesn’t match elsewhere. Espinosa unleashes her powerful voice throughout the show in bursts of sound that are impressive (if sometimes a little under pitch). But she’s less successful at conveying the glamour, sophistication and erotic appeal—”princes fought to light my cigarette,” the character brags—that are essential to Lempicka’s persona.\n\nAt least partly, that’s the fault of the writing. Conceiver-librettist Carson Kreitzer and her co-lyricist, composer Matt Gould, don’t seem to know what to do with the more predatory and opportunistic aspects of Lempicka’s personality, so they try to square her into a sentimental bisexual romantic triangle. “Have you ever loved someone, more than life itself?” she tells us at the start. “I had the great good fortune to love not once but twice in this life. And I had the great misfortune to love them both at the same time.” But the show does not deliver on this premise. Lempicka’s relationship with Tadeusz (Andrew Samonsky, handsome in face and voice), who becomes a grumpy layabout in Paris, never seems nearly as passionate as the one the show has created for her with Rafaela (Amber Iman), a sex worker loosely modeled on a loose model seen in several of Lempicka’s paintings.\n\nLempicka | Photograph: Courtesy Matthew Murphy\n\nIt’s not hard to see why Lempicka would tilt in that direction: Radiating charisma and singing in rapturous runs, Iman wipes the rest of the show off the stage. (Even the tedious Tadeusz comes briefly to life in a duet he shares with her at a gallery.) But the whole musical seems distracted by Rafaela. Seduced by the doomed romance it invents between Lempicka and this composite character, it puts Lempicka’s bisexuality at the center of the story—while making her seem rather drab and bourgeois in contrast to her lover and the rest of the underground lesbian scene in Paris, as led by Suzy Solidor (Natalie Joy Johnson, squeezing the juice)—and then tries to make the repression of Solidor’s club by fascists into a message-y dramatic moment. (The real-life Solidor was a Nazi collaborator.)\n\nAt a certain point, it doesn’t feel like Lempicka’s story anymore; moreover, it doesn’t feel like the show even knows what story it is telling. Like many biomusicals, it tries to cram too much in, and it winds up exploding all over the place. Director Rachel Chavkin has given the production an attractive look—Riccardo Hernández’s nifty set is an industrial rollercoaster of stairs and curves—but Lempicka’s coherence ends there. The score careens wildly from British-megamusical earnestness to modern dance-pop clamor and back again; when it strains for dramatic build, it often just makes the singers sound screamy. Paloma Young’s costumes for the main characters are beautiful, but the chorus dancers are corseted in weird Jean-Paul Gautier knockoffs (sometimes topped with silly colored berets) as they flit through Raja Feather Kelly’s inconsequential choreography.\n\nThe result is a musical that sometimes embraces campiness and sometimes falls flat into camp, especially when it skirts melodrama: When kohl-eyed chorus boys, repurposed as brownshirts, violently raid Solidor’s queer bar—and then the show cuts to a wild-eyed Beth Leavel (as one of Lempicka's patrons) belting “It’s the end of time!!” straight at the audience—I challenge you not to giggle. And where in time are we supposed to be, exactly? By this point in the show, Lempicka seems to have abandoned history entirely: Why is the futurist Italian painter Filippo Marinetti (an emphatic George Abud) leading what appears to be a police raid in Paris in the 1930s? It doesn’t help that another musical in town right now, Cabaret, depicts queerness and fascism with a great deal more depth.\n\nAt the end of the show, when some of Lempicka’s works descend from the ceiling, they seem to reveal more about the artist than we’ve seen all night. They have what the musical lacks: a clear and compelling aesthetic.\n\nLempicka. Longacre Theatre (Broadway). Book by Carson Kreitzer. Music by Matt Gould. Lyrics by Kreitzer and Gould. Directed by Rachel Chavkin. With Eden Espinosa, Amber Iman, Andrew Samonsky, George Abud, Beth Leavel, Natalie Joy Johnson, Nathaniel Stampley, Zoe Glick. Running time: 2hrs 35mins. One intermission.\n\nFollow Adam Feldman on X: @FeldmanAdamFollow Time Out Theater on X: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nLempicka | Photograph: Courtesy Matthew Murphy\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "dtliExcerpt": "\"They have what the musical lacks: a clear and compelling aesthetic.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1347,
  "archivePath": "data/archives/reviews/lempicka-2024/timeout-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:39:30.235Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}