{
  "showId": "smash-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2025/04/10/smash-marilyn-we-hardly-knew-ye/",
  "publishDate": "2025-04-10T22:30:28",
  "fullText": "Twelve Broadway attractions open during this cruel theatrical month of April, so here’s the short report on Smash, which premiered Thursday at the Imperial: Energetically performed by an excellent company, the capably designed and directed show proves to be a busy, cold, facetious and ultimately rueful backstage musical comedy involving some people making a Broadway musical about Marilyn Monroe.\n\nShould Smash sound familiar, it started back in 2012 as a same-named NBC series about some people making a Broadway musical about Marilyn Monr – okay, let’s skip this show’s origins and how it differs from Theresa Rebeck’s two-season TV drama. A dozen songs crafted for the series by composer Marc Shaiman and lyricist Scott Wittman of Hairspray distinction are recycled in this Broadway iteration of Smash. To frame these numbers, Bob Martin (The Drowsy Chaperone) and Rick Elice (Jersey Boys) have concocted a plot that’s original enough, aside from a premise that it regards some people making a Broadway musical about Mari – sorry, the writers plug their script with a plethora of running gags, and it’s contagious. Anyway, the songs comprise the score for Bombshell, a musical-in-process ticking away at the center of the Smash storyline. They are delivered in various rehearsal or performance modes as Bombshell is being readied for its opening night.\n\nEverything is going beautifully as Smash begins. In the midst of rehearsals, Tracy (Krysta Rodriguez) and Jerry (John Behlmann), the co-writers of Bombshell and Nigel (Brooks Ashmanskas), the show’s director, are pleased with their festive concept for the musical. “This is a celebration,” Nigel asserts. “This show will not end with Marilyn lying in her bed naked and dead and wrapped in a white satin sheet.” Everybody is shown enjoying a mutual lovefest with their adorable star Ivy Lynn (Robyn Hurder), who is perfectly charming until she takes up with a ruinous acting coach. A grim apparition in black, Susan (Kristine Nielsen, wickedly patterned after Monroe’s Method acting coach Paula Strasberg) coaches Ivy. Under her baleful influence Ivy becomes anxious, neurotic and weirdly like the legend she portrays.Ivy’s increasingly nasty diva in extremis behavior and Susan’s interference poison the backstage comradery, wreck relationships and affect the show. Two guesses how Bombshell ends.\n\nWritten farcically as a quasi-realistic cartoon, the showbiz shenanigans of Smash are meant to amuse, of course, but the unhappy complications of the script soon prove obvious and tiresome. A satirical plot thread mocking the taste of young, clueless influencers gets repetitious. Witnessing darling Ivy twist into a doped-out bitch is sad and doubly so since this crucial plot device dishonors Monroe’s legacy. Those clever, usually upbeat Bombshell numbers are brightly orchestrated by Doug Besterman. A fatal disconnect is how these songs reflect an old Hollywood saga rather than illustrate the “here and now” story and its characters, whose interpretation of Bombshell material is colored only indirectly by their emotions.\n\nAlthough Smash is not so hot as light entertainment, its script and score are at least professionally executed and the leading actors, capably supported by an attractive ensemble, all but knock themselves out striving to put over this dubious endeavor. An ever-droll Brooks Ashmanskas incites laughter as the beleaguered director. Sleek Krysta Rodriguez is a dynamic force as a harried songwriter. Both pros make the snappy most of their wisecracks. Robyn Hurder sings and dances delightfully as Ivy and coolly depicts Monroe being ugly. Kristine Nielsen plays the harmful acting coach as humorously as possible.\n\nSmash is staged nimbly by Susan Stroman, whose production rolls along with cheerful ease. Joshua Bergasse’s agile choreography at times kids old-school Broadway hoofing. With its action switching between rehearsal rooms, backstage, and a piano bar, the script does not require grand visuals from designer Beowulf Boritt, whose nice, airy scenery smoothly changes. Ken Billington’s lighting design provides glamour whenever it’s required. Speaking of which, let’s note that the best and brightest five minutes of Smash can be seen during a swift, satiny “Let Me Be Your Star” opening number when it delivers a glorious swirl of smoke, searchlights and Marilyn Monroe looking a vision in that floating white frock.\n\nSmash opened April 10, 2025 at the Imperial Theatre. Tickets and information: smashbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars"
}
