{
  "showId": "smash-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Roma Torre",
  "url": "https://nystagereview.com/2025/04/10/smash-marilyn-musical-neither-smash-nor-bomb/",
  "publishDate": "2025-04-10T22:31:54",
  "fullText": "Full disclosure: I was not a big fan of the TV show when it aired over a decade ago, but what I do remember is that it was basically a soap opera that centered on a rivalry between two actresses vying to star in a Broadway musical about Marilyn Monroe called Bombshell. The music was impressive and the performances – Broadway caliber. At the time, fans were hoping to see a theatrical adaptation; and after all these years, it’s finally here but it’s not really the same show. There’s still a lot of really good elements but despite resurrecting the main characters along with some of the songs, it’s a different story now and the sum of its parts do not make a smashing whole.\n\nImagine your favorite story is reproduced in a different medium. The characters in this new incarnation don’t seem like the same people you knew so well and their relationships are very different. That’s basically what happened to Smash. Same names but different characterizations.\n\nI can’t blame the creators for making significant alterations to the story. A TV series is a very different animal from a stage musical but it’s likely to be jarring and perhaps a big disappointment. Fans who were engrossed by the central conflict pitting veteran Ivy Lynn and novice Karen (in this version, she doesn’t have a last name) against one another are going to find that the dynamic has changed quite a bit. Ivy is the much bigger star now and Karen is no longer much of a threat.\n\nThe book by the great Broadway veterans Bob Martin and Rick Elice pretty much abandoned the rivalry and created new characters with different conflicts. It’s more farcical now and somewhat non-sensical with head-scratching plot twists that seem to come out of nowhere.\n\nBefore we get to all that, the main appeal of Smash has always been the drop-dead performances and there should be no disappointment on that front. Robyn Hurder as Ivy is a perfect match for the role. She looks terrific in Alejo Vietti’s retro costumes which must have been a blast to create. Her opening number, “Let Me Be Your Star” establishes the central conceit where life imitates art and vice versa in this new meta universe.\n\nAnd speaking of life imitating art…Karen has a relatively minor role to play in the new storyline. She’s a perpetual understudy who never gets a chance to shine. Caroline Bowman in the role is a major talent. So impressive in fact, seeing Karen constantly get passed up makes you wish the writers had restored the old plotline and given her a bigger role to play. At least she gets a few chances to knock us out. The best is a dynamite number “They Just Keep Moving the Line” in which she pours her heart out about always being passed up. It’s the show’s loss that she doesn’t get more to do.\n\nThe songs by composer Marc Shaiman and co-lyricist Scott Wittman are never less than pleasing, and some are far more than that, like the lovely “Second Hand White Baby Grand’, a reflective tune about Marilyn’s childhood devotion to an old piano. It’s sung by Krysta Rodriguez as Bombshell’s co-writer, Tracy, who came up with the song after she and her writing partner/husband Jerry (John Behlmann) decided that Bombshell should be a “musical comedy with depth.” Their inspiration is a book penned by a method acting teacher who once worked with Marilyn. And that’s where everything goes sideways.\n\nIvy borrows the book and finds it so enlightening, she invites the author, Susan Proctor (Kristine Nielsen), to join the production as her acting coach. Susan, dressed all in black as if in perpetual mourning, turns out to be a whacko who encourages Ivy to embrace the “Method” by “becoming” Marilyn and adopting all her diva qualities. Ivy instantly alienates herself from the company and suddenly transforms into a first-class bitch. Nielsen, who always finds inventively kooky ways to sell a character, is burdened with much of the comic relief in the show and while she’s plenty funny at first, the shtick becomes tiresome after a while.\n\nShall I go on? Yet more bizarre twists with a new character named Chloe. Bella Coppola delivers a sterling performance as the show’s assistant director who knows the show front and back. And so when Ivy fails to show up for dress rehearsal, Chloe is the one who is tapped to take over. Karen is passed up once again following an unfortunate case of food poisoning.\n\nThere’s also a subplot involving social media influencers going viral over who should be the star: Ivy or the heavier set Chloe… which then leads to a debate over fat-shaming. Inexplicably, Karen isn’t even considered this time.\n\nIt’s overstuffed with silliness like that, and Susan Stroman, who usually has some clever tricks up her sleeve, isn’t able to rein this one in. Her direction wants Smash to be a smash with lots of show-stopping numbers featuring over-amped singers fit for American Idol. But it feels more like a parody of an old-fashioned musical that loses its way with every nutty idea thrown into the mix.  And that’s unfortunate considering the A-list roster of talent involved in this production. Take the splendid choreography by Joshua Bergasse’s: impressive enough but it too gets lost amid all the wackiness.\n\nWith it all, there is one element that stands out almost to the point of salvaging the entire production and that’s Brooks Ashmanskas as Nigel, Bombshell’s gay director. It’s a character type he often plays but he outdoes himself here, thanks in part to some sharp writing. Funny doesn’t even begin to describe the performance. He’s a master at spinning a comic line into gold. Even the way he says the word “yes” produces spasms of laughter.\n\nThere’s a line in Smash in which someone says “No one wants to go to a musical and hear people talking.” Actually we kinda do, as long as it’s Brooks Ashmanskas who’s doing all the talking.\n\nSmash opened April 10, 2025 at the Imperial Theatre. Tickets and information: smashbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
