{
  "showId": "here-lies-love",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2023/07/20/here-lies-love-its-a-vibe/",
  "publishDate": "2023-07-20T20:56:37",
  "fullText": "There’s a moment in Here Lies Love—the David Byrne–Fatboy Slim disco musical chronicling the rise and fall of famed Filipina former first lady Imelda Marcos—when you inevitably find yourself dancing right along with the infamous politician. You might be jumping up and down; you might just be swaying your shoulders or tapping your toes. But at some point, you realize that dammit! You’ve fallen under her spell.\n\n“Talk a bit, a little dance, Champagne on ice,” sings Imelda (played by Arielle Jacobs with just the right blend of style, sophistication, and edge) solicitously. “An hour or two—relationship— We’re friends for life!” This is how she charmed and captivated not only the public but also world leaders such as Mao Zedong, aka Chairman Mao, and President Ronald Reagan—a strategic alliance, as he helped her, her husband, and their entourage flee the Philippines in 1986 after the People Power Revolution.\n\nDon’t be alarmed when you start to sympathize with the so-called Muse of Manila. That’s the genius of Here Lies Love, which premiered in a much more intimate production at the Public Theater in 2013. The Alex Timbers-directed extravaganza—and who knows extravaganzas better than Timbers, a Tony winner for the deliriously over-the-top Moulin Rouge—is meant to mesmerize at every turn, from the minute you enter the radically reworked Broadway Theatre, which now recalls a ready-to-rave industrial-style multilevel movable nightclub thanks to David Korins’ massive redesign. Peter Nigrini’s psychedelic projections, which frequently morph into historical photos of Imelda, surround you on all sides.\n\nSo yes, when young Imelda, “a simple country girl who has a dream,” walks out in her sweet Swiss dot white dress, she easily wins our hearts in the beautifully melodic title song. “No clothes, no bed, no jewelry/ Sometimes I had no shoes,” she sings, and that’s the only reference the musical makes to shoes. (Byrne notes that most of the lyrics come from original sources.) We meet her super-charismatic onetime sweetheart—peep the photobooth pics on the digital screens!—and future political foe Ninoy Aquino (scene-stealer Conrad Ricamora, who made a splash in the last summer’s gay romcom Fire Island) in the bouncy “Child of the Philippines.” His ooh-ooh backup singers wear buttoned-up white shirts, black ties, and dark black glasses, just like Aquino—a wonderful touch by costume designer Clint Ramos, also one of the lead producers. Even future despot Ferdinand Marcos (Jose Llana, like Ricamora, reprising his Public Theater role)—who weds Imelda after an 11-day whirlwind romance—makes a good first impression. He’s savvy enough to know he needs her to win his bid for the presidency; he refers to the two of them as “the king and the queen of hearts” in the anthem-style song “A Perfect Hand.”\n\nBut Here Lies Love is no snow job: By no means does it celebrate Imelda’s excess, which came at the expense of the public; immediately following “Dancing Together,” which takes us to one of her favorite former haunts, Studio 54—lamé and sequins and feathers, oh my!—Aquino steps up to slam “the parties and extravagance,” and rallies the crowd to “rise up.” Eventually, he’s imprisoned for seven years; after a period of exile in America, he returns to his home country and is shot at the airport. His funeral procession, the stirring “Just Ask the Flowers,” is led by his mother, Aurora (Filipina superstar, and HLL producer, Lea Salonga, in the role through Aug. 13). Imelda’s response—which she begins while Aurora is frozen, her thumb and index finger forming an L, meaning laban, or fight—couldn’t be more self-indulgent: “Why Don’t You Love Me?,” is sung Evita-style, on a balcony, while wearing a stunning white terno (one of her signature butterfly-sleeved gowns).\n\nThe show is absolutely an indictment of the autocratic Marcos administration—which, during nearly a decade of martial law, silenced the free press, dissolved Congress and the supreme court, and incarcerated 70,000, tortured 35,000, and killed 3,200. It’s also a cautionary tale: Her son, Ferdinand “Bongbong” Marcos Jr., is the current president of the Philippines. When DJ Moses Villarama makes that announcement, you can hear the crowd collectively sigh.\n\nA note about seating: You have a choice of standing on the dance floor, which means you’ll be moving around throughout the 90-minute show; sitting alongside or just above the floor; or sitting in traditional theater-style mezzanine seats. If you really want to immerse yourself in Imelda’s world, go for the floor. You might find yourself shaking hands with the candidates on the campaign trail, joining in a line dance, or even holding up your own laban sign.\n\nHere Lies Love opened July 20, 2023, at the Broadway Theatre: Tickets and information: herelieslovebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
