{
  "showId": "water-for-elephants-2024",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=7KPM5E",
  "publishDate": null,
  "fullText": "Early on in Water for Elephants, Gregg Edelman, playing a grizzled veteran of the big top, wanders into a circus tent and muses. \"Man, this place... The sawdust, the smells... it's old but it's new.\" That's a good description of the show at the Imperial, which spins a formulaic story and a score that is more efficient than memorable into a gripping, innovatively staged musical. Director Jessica Stone, supervising a crack creative team from the theatre and circus worlds, produces a fast-moving narrative that, shuffling between the 1930s and the turn of this century, hums with suspense even when you know where it's going. Time after time, Water for Elephants asks the audience to engage its collective imagination, with exciting results. Indeed, the production is filled with sequences that, by all rights, should be altogether unstageable. Jacob Jankowski (Grant Gustin, of television's The Flash), fleeing a family tragedy, jumps from a ladder onto the roof of a moving railroad car, the latter represented by a rolling scaffold unit. Once inside, he faces a gang of surly circus roustabouts; the Depression is on, and hungry interlopers aren't welcome. Even as Jacob holds his ground, however, another rolling unit comes onstage, along with a small connecting and, suddenly, a fully populated train has assembled itself in open view. It's a bare-bones effect, stunning in its impact. It's also a thesis statement of sorts for a show that creates its best effects via the power of suggestion. Many of the most captivating moments involve puppets designed to represent circus animals. The star of a \"liberty\" horse act is represented by a sleekly maned head attached to the acrobat Antoine Boissereau. When the animal becomes lame and must be put down, Boissereau flies up, performing an aerial silks act; as the fatal trigger is pulled, he plunges precipitously, nearly crashing to the floor. Similarly, Rosie, the elephant on whom much of the story turns, is seen first as a disembodied trunk, then four legs (each landing with a powerful thud), and -- finally -- as a trunk-to-tail creation that earns a gasp from the house. A climactic stampede is rendered as a series of tableaux, each one a freeze-frame image of chaos and terror. Stone has seen to it that both the spectacle and squalor of circus life are rendered with a minimum of fuss and a maximum of imagination. This is all to the good, because Rick Elice's slickly constructed book, taken from Sara Gruen's blockbuster novel, consists of borrowed goods. Jacob, who has veterinary training but no license, is hired to tend the animals; he instantly falls for Marlena (Isabelle McCalla), a star performer unhappily married to August (Paul Alexander Nolan), the neurotic, sadistic owner/ringmaster. The triangular tension is only magnified when Rosie, purchased from another, failing, circus, becomes the headline attraction and Jacob proves to be crucial in managing the elephant's care. (She responds only to commands in Polish, which he happens to speak.) It's the stuff of a thousand B movies -- the plot bears a superficial resemblance to the Henry Fonda big-top vehicle Chad Hanna -- although, as in the novel, the older Jacob (Edelman) narrates, leaving us on edge about how it will all play out. The often-attractive score, by the members of the PigPen Theatre Company, draws on classic American styles, including country, jazz, and folk. (One detects a touch of Randy Newman from time to time and even a hint of Joni Mitchell.) Possibly because it is the work of many hands, however, it never finds a consistent point of view, and the lyrics are of variable quality. There's a poetic longing in one character's assessment of the circus as \"just a way to get from nowhere to nowhere,\" but other songs feel repetitious and redundant, working a single image or idea to the point of exhaustion. Still, the numbers are precision-tooled to carry the story, a technique that feels increasingly rare these days. \"The Road Don't Make You Young\" unfolds as a lengthy introductory sequence that shows Jacob being seduced by the allure of the circus community. The overtly upbeat \"Zostán\" celebrates Rosie's success while highlighting Jacob and Marlena's growing attraction -- a fact noted by various colleagues, including August, who is publicly humiliated when Rosie rebuffs his offer of a treat. \"Go Home\" kicks off a nightmarish sequence that re-enacts the death of Jacob's parents, his emotional conflicts, and his fears for the future. Stone works especially well with the choreographers Jesse Robb and Shana Carroll, the latter of whom also designed the circus acts embedded in the action. In \"The Road Don't Make You Young,\" both sledgehammers and dancers are tossed around with equal vigor, creating an atmosphere of rough exhilaration. \"Go Home\" blends a niftily staged car crash, a tense chase, and aerial ring performances into a disorienting sequence that redefines the old notion of the dream ballet. The cynical \"The Lion Has Got No Teeth\" rattles with sinuous energy as August and his performers strive to sell Jacob on the essential dishonesty of circus entertainment. The handsome, big-voiced Gustin and the attractive, accomplished McCalla (hiding a certain coiled tension behind her professional performer's smile), make a fine pair of guilty lovers. McCalla is especially good as Marlena, who married August on an impulse and now tells herself she can manage his outbursts. The dominant figure, however, is Nolan's August, a ticking bomb of resentments and unappeasable needs that keep everyone on pins and needles. Stealing each of his scenes with the skill of a trained pickpocket is Edelman, looking on ruefully as his younger self runs headlong into danger. (The robust, affable actor, looking like he wandered in from an A. R. Gurney play, in no way resembles the tragic rest-home internee envisioned by Gruen but he makes excellent company, anyway.) Keeping things lively is a gallery of supporting performances, including Stan Brown as a boozing, dying roustabout; Joe De Paul as a bellicose clown; Wade McCollum as August's all-too-malleable henchman, and Sara Gettelfinger as the wisecracking, but good-hearted, dancer who is indispensable to entertainments like this. (Let's call it the Joan Blondell role and be done with it.) Takeshi Kata's scenic design is an inventive kit of parts, often involving rigging effects, repeatedly put to surprising use; watch out for that flying platform that figures in a harrowing multiple murder sequence. Bradley King's lighting facilitates dozens of snap transitions while lending extra allure to the dance numbers. David Bengali's projections consist of lovely, understated sky vistas that complete each scenic look. If David Israel Reynoso's costumes are a bit vague about when the latter-day scenes take place, he dresses the circus performers with plenty of spangled, tawdry glamor. Walter Trarbach's sound design is admirably clear; he also provides three rings' worth of effects including train whistles, crashing glass for a speakeasy raid, and, of course, plenty of animal noises. Extra kudos go to the gloriously designed puppets of Ray Wetmore, JR Goodman, and Camille Labarre. In particular, Rosie is a heartbreaker. It now seems clear that Stone, who previously guided audiences through the hairpin emotional turns of Kimberly Akimbo, is a director of musicals to contend with. Here, she amplifies her florid material without blowing it out of proportion, giving us a continuously engaging evening without overselling its significance. After a lengthy run of musicals that strain to make a statement, Water for Elephants provides a much-needed infusion of fun. If you've ever had the slightest desire to run away with the circus, this may be the moment to pounce. --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1278,
  "archivePath": "data/archives/reviews/water-for-elephants-2024/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:48:10.465Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}