{
  "showId": "water-for-elephants-2024",
  "outletId": "time-out-new-york",
  "outlet": "TIME OUT NEW YORK",
  "criticName": "Adam",
  "url": "https://www.timeout.com/newyork/theater/water-for-elephants-broadway-musical-review-circus",
  "publishDate": "March 21, 2024",
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Matthew Murphy | Water for ElephantsReview\n\n4 out of 5 starsTheater, MusicalsRecommendedThursday March 21 2024ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\nStep right up, come one, come all, ladies and gentlemen, boys and girls, step right up to the greatest—well, okay, not the greatest show on Broadway, but a dang fine show nonetheless. Although Water for Elephants is set at a circus, and includes several moments of thrilling spectacle, what makes it so appealing is its modesty, not glitz. Like the story’s one-ring Benzini Brothers Circus, a scrappy company touring the country in the early years of the Depression, this original musical knows it’s not the ritziest show on the circuit. But what it lacks in size, it makes up for in wonder, and it’s pretty wonderful at making things up.\n\nWater for Elephants has a book by Rick Elice, who wrote the delightful stage version of Peter and the Starcatcher, and songs by the seven-man collective PigPen Theatre Co., which specializes in dark-edged musical story theater. This team knows how to craft magic moments out of spare parts, and so does director Jessica Stone, who steered Kimberly Akimbo to Broadway last season. Together—and with a mighty hand from circus expert Shana Carroll, of the Montreal cirque troupe the 7 Fingers—they have found the right tone for this adaptation of Sara Gruen’s 2006 romance novel, which operates on the level of a fairy tale.\n\nThe plot is basic. The impoverished Jake Jankowski (The Flash's Grant Gustin), a sensitive and floppy-haired fellow, is forced by family tragedy to drop out of his Ivy League veterinary school. With nothing to lose, he hops a passing train and winds up joining a traveling circus—“nowhere on wheels,” as someone describes it—run by its cruel ringmaster, August (the intense and golden-voiced Paul Alexander Nolan); things get complicated when he falls in love with August’s lovely wife and star attraction, Marlena (Isabelle McCalla). As in the similar Moulin Rouge!, there’s an elephant involved: “One beautiful, one bestial / One strong, one celestial,” August sings of Marlena's animal act. (Somewhere, Stephen Sondheim is chuckling.) And as in several other recent Broadway musicals, the whole story is narrated by an older version of our hero (Gregg Edelman) decades later.\n\nWater for Elephants | Photograph: Courtesy Matthew Murphy\n\nThe stakes of this familiar romantic triangle are not, in and of themselves, enough to anchor a big tent. But the creators of Water for Elephants find other ways to ground the show, and to let it fly. The score, which mines several veins of Americana, is skillfully crafted. (August, bragging about fooling the rubes with harmless lions: “Our lies are our pride / And our pride’s in our lies / And the lions in our pride have got no teeth!”) And Stone’s staging embraces overt theatricality as an invitation to imagination. Takeshi Kata's set evokes a train with style and minimal fuss. Animals are sometimes rendered as hand puppets, sometimes as shadows; one performer dons fur to cavort as an orangutan, and several team up to embody the elephant, Rosie. A slow-motion depiction of a car crash is simple and strikingly beautiful.\n\nWhere Water for Elephants soars, though, is in the real-life physical talents on display. Carroll shares choreography credit with Jesse Robb, and they seamlessly integrate circus artistry into the show’s other movement. Members of the ensemble perform impressive aerial routines on ropes, silks, hoops and straps, and show off a dazzling variety of skills: acrobatics, tumbling, balancing, juggling, Cyr Wheel. Although the principal actors sing well and flesh out their roles commendably—McCalla is particularly good in her second-act decision song, “What Do You Do?”—they are effectively the sideshow here. The main attraction is the pull of the circus itself.\n\nWater for Elephants. Imperial Theatre (Broadway). Book by Rick Elice. Music and lyrics by PigPen Theatre Co. Directed by Jessica Stone. With Grant Gustin, Isabelle McCalla, Paul Alexander Nolan, Gregg Edelman, Stan Brown, Joe De Paul, Sara Gettelfinger, Wade McCollum. Running time: 2hrs 40mins. One intermission.\n\nFollow Adam Feldman on X: @FeldmanAdamFollow Time Out Theater on X: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nWater for Elephants | Photograph: Courtesy Matthew Murphy\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "dtliExcerpt": "Step right up, come one, come all, ladies and gentlemen, boys and girls, step right up to the greatest—well, okay, not the greatest show on Broadway, but a dang fine show nonetheless.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 1006,
  "archivePath": "data/archives/reviews/water-for-elephants-2024/time-out-new-york--adam_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:41:23.956Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}