{
  "showId": "all-my-sons-2019",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Alexis Soloski",
  "url": "http://www.theguardian.com/stage/2019/apr/22/all-my-sons-review-annette-bening-and-tracy-letts-power-sturdy-revival",
  "playbillVerdictUrl": "http://www.theguardian.com/stage/2019/apr/22/all-my-sons-review-annette-bening-and-tracy-letts-power-sturdy-revival",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "Tracy Letts and Annette Bening in All My Sons. Photograph: Joan MarcusView image in fullscreenTracy Letts and Annette Bening in All My Sons. Photograph: Joan Marcus This article is more than 6 years oldReviewAll My Sons review – Annette Bening and Tracy Letts power sturdy revivalThis article is more than 6 years oldThe American Airlines Theatre, New York\n\nThrilling, note perfect performances elevate yet another staging of Arthur Miller’s transgressive tragedy\n\nA play about the rancid heart of the American dream, Arthur Miller’s early tragedy, All My Sons, is rebirthed on Broadway, looking like it never left. Thrillingly acted – with performances that threaten, tantalizingly, to go over the top, but stop just short – Jack O’Brien’s production for the Roundabout is a vigorous anatomy lesson, a show about how guilt and transgression can rot a family from the inside, spoiling everything they touch.\n\nRead moreJoe Keller (Tracy Letts), the mid-century Midas, is first glimpsed relaxing in the backyard of a middle American house. (The photorealistic set, with its trailing wisteria and individually bladed Astroturf, is by Douglas W Schmidt with deceptively warm lighting by Natasha Katz.) He runs a small plant and during the war, that plant knowingly shipped 21 cracked cylinder heads that made 21 planes crash. Joe has been exonerated, but Joe’s former partner, Steve Deever has been convicted and imprisoned. Five years later, Joe’s son, Chris (Benjamin Walker), has sent for Steve’s daughter, Ann (Francesca Carpanini). Ann was once engaged to Larry, Chris’s older brother, missing in action and presumed dead by everyone except his mother, Kate (Annette Bening). Chris plans to marry Ann, though he hasn’t yet told his mother. Or Ann.\n\nIt seems almost unbelievable that Miller could write this play, which bluntly contradicts myths of American integrity and exceptionalism, so soon after the end of the second world war. A propulsive tragedy, it shows Miller’s great promise and also some of his hang-ups, like his cocksure morality and his problems with writing women. (We hear a lot about Ann’s legs and her figure, but almost nothing about the content of her character. The idea that she would unhesitatingly transfer her affections from one brother to the other is taken as a given.) There’s some creakiness, too. The debts to Ibsen are big and owing and characters are always shooing each other into or away from the house.\n\nBut the first-class cast, which includes Hampton Fluker as Ann’s aggrieved brother, George, and Michael Hayden and Chinasa Ogbuagu as the Kellers’ neighbors, go a long way toward oiling those creaks. Letts is giving a master class in an inner, cringing weakness camouflaged by shows of strength. His performance is big, brash even, but never without nuance. In Bening’s gorgeously calibrated Kate, guilt manifests differently, in fragile optimism and occasional flashes of anger. Walker, a charismatic and handsome actor, who often finds himself in flops, again proves his leading man bona fides and his rendering of Chris’s collapse is devastating. (He also has one shirtless scene, which would seem to be a contractual obligation for him.) Carpanini is given less to play, but she does it sturdily and cannily.\n\nAs superbly acted as All My Sons is – and it is – there’s something slightly cynical about it. This is a prestige play with a prestige cast, but at least in O’Brien’s production, there’s nothing particularly urgent about it, nothing that asks us to draw the lines, not especially long, between the play’s moment and our own, when the Mueller report is poised to be a bestseller and questions of guilt and responsibility would seem to resonate. Gregory Mosher, the revival’s original director, had wanted to cast African American actors as the Deevers, which might have pushed the play toward a conversation about how America sees and doesn’t see race. But the estate declined and Mosher quit. O’Brien’s casting, lightly colorblind rather than color-conscious, keeps the play firmly located in period, a move director’s theater haters will applaud, but one that seals off this excellent production, ensuring that the sins of the past don’t reverberate into the present. Sitting comfortably in our seats, even sniffling into our programs, we are not All My Sons’ children.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 717,
  "archivePath": "data/archives/reviews/all-my-sons-2019/guardian--alexis-soloski_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:43:32.301Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "duplicateTextOf": "guardian--adrian-horton.json",
  "contentTier": "complete",
  "wordCount": 717,
  "tierReason": "Full review text",
  "bwwExcerpt": "Aplay about the rancid heart of the American dream, Arthur Miller's early tragedy, All My Sons, is rebirthed on Broadway, looking like it never left. Thrillingly acted - with performances that threaten, tantalizingly, to go over the top, but stop just short - Jack O'Brien's production for the Roundabout is a vigorous anatomy lesson, a show about how guilt and transgression can rot a family from the inside, spoiling everything they touch.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Annette-Bening-And-Tracy-Letts-Star-In-ALL-MY-SONS-What-Did-The-Critics-Think-20190422"
}
