{
  "showId": "all-my-sons-2019",
  "outletId": "newsday",
  "outlet": "Newsday (Barbara Schuler)",
  "criticName": "Barbara Schuler",
  "url": "https://www.newsday.com/entertainment/theater/all-my-sons-annette-bening-k05770",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/all-my-sons-annette-bening-1.30097036",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "previousUrl": "http://www.newsday.com/entertainment/theater/all-my-sons-annette-bening-1.30097036",
  "urlDiscoveredAt": "2026-02-04T02:45:38.166Z",
  "urlDiscoveryMethod": "google-serp",
  "fullText": "Tracy Letts and Annette Bening star in the latest Broadway revival of Arthur Miller's \"All My Sons.\" Credit: Joan Marcus\n\nWHERE American Airlines Theatre, 227 W. 42nd St.\n\nINFO Tickets, from $59, roundabouttheatre.org, 212-719-1300\n\nBOTTOM LINE A solid production of Arthur Miller’s devastating--and still relevant--play set in the aftermath of World War II.\n\nWhen Arthur Miller's \"All My Sons\" came out in 1947, the American dream in trouble was his own. His first play was a major flop and he’d determined another failure would send him looking for a new career.\n\nFortunately for the world, this second play, an indictment of that dream and the capitalistic greed associated with it, was a major success, and the gripping revival now at Roundabout's American Airlines Theatre solidifies its relevance more than 70 years later.\n\nSet in the aftermath of World War II, it's a complex and devastating story about the collateral damage inflicted on the Keller family: Joe, a successful businessman and loving husband and father; his wife Kate, hanging on to hopes their MIA son Larry would return after three years; and their youngest son Chris, who wants to marry Ann, the woman once engaged to his brother. Joe's factory had shipped defective airplane parts causing the death of 21 flyers, and Joe blamed his partner Steve, a character not seen in the play because he's in prison. Major complication: Steve is Ann's father.\n\nThis play is done a lot — What community theater hasn’t trotted it out at least once? — so audiences generally know the story. But this cast breathes so much life into Miller’s characters it feels like you’re watching for the first time. Tracy Letts is compelling as Joe, a man who hides well his heavy guilt. As Kate, Annette Bening is a poignant mix of strength and despair, fighting off a grief she refuses to acknowledge. But it’s Benjamin Walker as the tortured son Chris who most commands attention whenever he’s on stage, so apparent is the fury he's brewing.\n\nVisually the show is traditional but striking. Scenic designer Douglas W. Schmidt's realistic Midwest neighborhood is centered on the Keller's backyard, lush with grass and greenery. Lighting by Natasha Katz is effective, especially the opening thunderstorm, an ominous portent of impending disaster as it splinters the tree Kate's planted to honor Larry.\n\nGet the latest on celebs, TV and more.\n\nBy clicking Sign up, you agree to our privacy policy.\n\nThis production's had its own intrigue when original director Gregory Mosher dropped out over disagreements about colorblind casting. Jack O’Brien took over and apparently worked out the issues, as several parts are played by black actors, a choice that in no way interferes with the power of the production. This story of complicity and misguided family values ends tragically, but not before Joe Keller begs forgiveness, finally understanding he must take responsibility. Thinking of the lost flyers, he wails, \"They were all my sons.\" Sadly, as is often the case, it was too little, too late.\n\nThe Newsday app makes it easier to access content without having to log in.\n\nUnlimited Digital AccessOnly 25¢for 6 months",
  "isFullReview": true,
  "textWordCount": 520,
  "archivePath": "data/archives/reviews/all-my-sons-2019/newsday--barbara-schuler_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:45:38.169Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 520,
  "tierReason": "Full review text"
}