{
  "showId": "all-my-sons-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2019/04/22/all-my-sons-arthur-millers-family-secrets-tragedy-in-a-plus-revival/",
  "publishDate": "2019-04-22T20:54:55",
  "fullText": "The moment when Joe Keller speaks the three words that lend Arthur Miller’s All My Sons its title is, in this reviewer’s opinion, one of the most devastating in American dramatic literature. That’s if it’s not the downright most devastating. Because the 1947 All My Sons is, also in this reviewer’s opinion, Miller’s best play (peace to Death of a Salesmen, The Crucible, The Price partisans), I have seen All My Sons as often as I can and have never heard the three little words spoken without feeling as if they’ve been a deliberate unpulled punch in my gut.\n\nThe Sonny Liston-sized wallop happened again when Tracy Letts, playing Joe in the current revival, uttered his “all my sons.” He is saying the killer phrase in a Jack O’Brien-directed production that’s as close to perfect as it can be for any lover of Miller—and for any believer in the potential of theater to get to you where you live.\n\nIn a season where straight plays—often relegated to second-class Broadway status—have been in unusual number, this All My Sons goes a far way, or further, to reminding audiences what perceptive, inspired, engaged playwriting is. If anyone is leaving the Roundabout’s American Airlines with a blithe ho-hum, I’ll turn in my critic’s spurs. If anyone is exiting the auditorium having seen the drama for the first time and wondering what all the fuss over Miller is about, I’m here to recommend a psychotherapist expert in healing emotional blockage.\n\nTo remind those who’ve forgotten or those who don’t know, Joe Keller (Tracy Letts) is an airplane parts manufacturer whose pilot son Larry has been missing in World War II action but is still expected to return by his mother (and Joe’s insistent wife) Kate (Annette Bening). Kate is the only one in the family holding on to hope. Son Chris (Benjamin Walker) has accepted the still unconfirmed facts and is intent on marrying Larry’s girlfriend and onetime next-door neighbor, Anne Deever (Francesca Carpanini). In the meanwhile, Anne has her reasons for believing Larry will never come home.\n\nThough the occasion for All My Sons is a family get-together to which Chris has invited Anne with the aim of proposing marriage, the disturbing issue that emerges is Joe’s connection to deficient airplane parts his imprisoned ex-partner (and Anne’s father) okayed some years earlier, supposedly behind Joe’s back. Airplanes crashed and men lost lives as a result of the unfortunately shipped parts.\n\nThough assumed to have been dealt with and, if not forgotten, at least laid to rest—along with the deceased pilots—the family secret that’s not so secret in the Kellers’ neighborhood comes out with genuinely shocking repercussions, especially when Anne’s brother George (Hampton Fluker), once Chris’ best friend, arrives to force the truth of the damning incident.\n\nMiIler brings everything up through any number of beautifully crafted confrontations, some of them involving Dr. Jim Bayliss (Michael Hayden) and his wife Sue (Chinasa Ogbuagu)—they now own the former Deever home—and neighbors on the other side, cheerful Lydia Lubey (Jenni Barber) and hubby Frank (Nehal Joshi), an enthusiastic astrologer busy preparing charts to convince Kate that Larry has to have survived.\n\n(Douglas W. Schmidt designed the commodious Keller home and the only visible side of the Bayliss home. Natasha Katz is the lighting designer, John Gromada the sound designer. Together they cook up a prologue storm both figuratively and literally an indication of the theatrical storm to follow.)\n\nIn director O’Brien’s cast, they’re all flawless—the lead actors worthy of praise that could go on for many column inches. Letts’ Joe, as initially comfortable as the guy-next-door name he carries, slowly comes apart from the weight of the past he’s been denying. It’s a frightening metamorphosis. Bening’s Kate—how welcome she is back on a New York City stage—shows all the signs of a woman trying to keep herself and her family together while attempting to believe in something that deep down she has to know isn’t so.\n\nWalker’s strapping Chris wants to convince himself, against his mother’s wishes, that Anne can and should be his. At the same time he’s in the throes of reining in suspicions about his father. Carpanini’s Anne is a young woman coming into her own and increasingly ready to get her proper due. (Incidentally, Jane Greenwood outfits them—and everyone else in the ensemble—with the right, home-y 1947 fashions.)\n\nAs with all classic plays—this one ranks as just that—new revelations pop out with every look. Among the epiphanies for me this time are the number of amusing lines that Miller—often thought to have too much on his mind to be funny—includes in the opening sequence. During it, Joe and neighbors are sitting in the Keller yard to establish the seemingly average-Joe (pun intended) atmosphere on the verge of changing for the worse.\n\nAlso striking me for perhaps the first time, when maybe it should have been glaring before, is how closely Miller hews to his frequent fathers-and-sons theme. Perhaps it’s clearer now after my having seen Miller’s first play, the rarely performed No Villain, in London a few years back. In that early work, a son (clearly Miller’s autobiographical version of himself) joins the 1930s men striking his father’s factory, while his older brother continues toiling there. No need to go into Willy Loman’s relationship with his sons, one of whom is privy to Willy’s extramarital-affair secret.\n\nMiller goes after the theme with apparent compulsion, while the women—the mothers, the wives—fend for their husbands and themselves as effectively as they can. With this production, I noticed something perhaps I also should have noticed previously: In both All My Sons and Death of a Salesman, the wife has the last word and in just about the same dire situation.\n\nAm I saying that Miller repeats himself? I am, and as this new take proves, it’s a good—no, superb—thing he does.\n\nAll My Sons opened April 22, 2019, at the American Airlines Theatre and runs through June 30. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://nystagereview.com/2019/04/22/all-my-sons-arthur-millers-family-secrets-tragedy-in-a-plus-revival/",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "In a season where straight plays-often relegated to second-class Broadway status-have been in unusual number, this All My Sons goes a far way, or further, to reminding audiences what perceptive, inspired, engaged playwriting is. If anyone is leaving the Roundabout's American Airlines with a blithe ho-hum, I'll turn in my critic's spurs. If anyone is exiting the auditorium having seen the drama for the first time and wondering what all the fuss over Miller is about, I'm here to recommend a psychotherapist expert in healing emotional blockage.",
  "bwwScore": 10,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Annette-Bening-And-Tracy-Letts-Star-In-ALL-MY-SONS-What-Did-The-Critics-Think-20190422"
}
