{
  "showId": "all-my-sons-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2019/04/22/all-my-sons-arthur-millers-still-shattering-backyard-tragedy/",
  "publishDate": "2019-04-22T20:49:06",
  "fullText": "Capitalism, lies, betrayal, crime, corruption, and cover-ups—just another day on Capitol Hill? Or the issues bubbling beneath the surface of Arthur Miller’s surprisingly vital 72-year-old drama All My Sons, now in a stirring Jack O’Brien–directed Roundabout Theatre revival on Broadway?\n\nThe tidily (some might say even too tidily) structured, Ibsen-esque play—Miller’s second to reach Broadway, and his first success—begins innocuously enough: with 61-year-old Midwestern businessman Joe Keller (Tony-winning actor and playwright Tracy Letts) reading the paper and gabbing about the weather with his neighbors, the astrology-obsessed Frank (Nehal Joshi) and the disillusioned Dr. Bayliss (Michael Hayden). Despite the previous night’s storm, the yard looks welcoming and serene, framed with casual wicker furniture and a cozy wisteria-covered pergola (Douglas W. Schmidt designed the beautifully detailed set). But near the back porch, a blown-over apple tree bows, dripping in symbolism, a portent of the upheaval to come.\n\n“So much for that, thank God,” says Kate Keller (four-time Oscar nominee Annette Bening, in her first Broadway appearance since her 1987 Tony-nominated turn in Coastal Disturbances), gazing at the busted branches that had served as a tribute to her three-years-missing World War II pilot son Larry. “Everybody was in such a hurry to bury him. I said not to plant it yet.” Kate refuses to believe Larry is dead. His war veteran brother, the idealistic, headstrong Chris (Benjamin Walker, of Bloody Bloody Andrew Jackson and American Psycho fame), is more pragmatic—“I’ve been thinking, y’know? Maybe we ought to put our minds to forgetting him?”—perhaps because he’s about to propose to Larry’s old sweetheart Ann (Francesca Carpanini), the daughter of Joe’s former business partner.\n\nLittle by little, the past creeps into the present: Ann’s father is in prison because during the war, his and Joe’s factory produced faulty parts for military fighter jets—cracked cylinder heads that caused 21 P-40s to crash (a detail imbued with a newfound contemporary resonance given the recent Boeing 737 MAX accidents). Joe, meanwhile, was exonerated, and has built up his business—and his bank account—“bigger than ever,” he brags. Yet not everyone believes he was blameless. Ann’s brother, George (Hampton Fluker), steamrolls in during Act 2, intent on exposing Joe’s complicity and dragging his sister away from the murderous, money-grubbing Keller men.\n\nKate is also trying to engineer Ann’s departure, but via guilt, insults, and scheming—you know, standard mother-in-law maneuvers. “The night he gets into your bed, his heart will dry up,” she informs Ann. “You’re going in the morning, and you’re going alone. That’s your life, that’s your lonely life.” (Bening has a brilliantly icy way with her character’s innumerable insults. Another breezy zinger to Ann: “You gained a little weight, didn’t you, darling?”)\n\nAs for how this production judges Joe, it’s hard to ignore that Letts bears an eerie resemblance to capitalist warmonger and former Vice President Dick Cheney. Yet even as Joe is careening toward his inevitable fall, he never loses our sympathy. It seems selfish to want to see Letts do more and more stage roles when he could be writing more plays like August: Osage County and Mary Page Marlowe. But he’s so spectacular in All My Sons—even in the simple, speechless act of reading a letter—that you can’t help but imagine him (and Bening) in, oh, say…Death of a Salesman. Hey, a theatergoer can dream.\n\nAll My Sons opened April 22, 2019, at the American Airlines Theatre and runs through June 30. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
