{
  "showId": "the-price-2017",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Alexis Soloski",
  "url": "https://www.nytimes.com/2017/03/16/theater/review-the-price-mark-ruffalo-arthur-miller.html?_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "Sympathetically directed and ardently acted, there's much to enjoy in this Roundabout Theater Company revival, which opened Thursday night at the American Airlines Theater. Yet it shows 'The Price' as a smaller, more stolid work than it wants to be - still just a little out of style.",
  "bwwScore": 8,
  "contentTier": "needs-rescrape",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Arthur-Millers-THE-PRICE-Opens-on-Broadway-Updating-Live-20170316",
  "fullText": "https://www.nytimes.com/2017/03/16/theater/review-the-price-mark-ruffalo-arthur-miller.htmlShare full article3434Advertisement\n\nArthur Miller’s “The Price,” from 1968, is a tragedy disguised as a rummage sale. It plucks the slipcovers off the autobiographical material that Miller worked over for so much of his career — what sons owe to fathers, what brothers owe to each other, what the world owes to men of reasonable integrity. Women might owe things, too, but that was rarely Miller’s concern.\n\nSympathetically directed and ardently acted, there’s much to enjoy in this Roundabout Theater Company revival, which opened Thursday night at the American Airlines Theater. Yet it shows “The Price” as a smaller, more stolid work than it wants to be — still just a little out of style.\n\nAs the play opens, Victor Franz (Mark Ruffalo), a policeman 28 years on the beat, arrives at the attic of a Manhattan brownstone mounded with dusty furniture. Chests jostle with tables; sofas and wardrobes tumble together. Victor winds up an old phonograph and puts on a novelty record of people laughing. He also laughs. Why not? It’s either that or sneeze.\n\nWith the building about to be demolished, Victor has come to sort out his dead parents’ effects. His father, once a ritzy businessman, went bankrupt in the 1929 crash. His mother died soon after. While his older brother finished medical school, Victor dropped out of college to support his father.\n\nNow all that remains of his patrimony is enough hefty wood and tatty brocade to churn the stomachs of every Design Within Reach customer in the first three rows. Victor’s disenchanted wife, Esther (Jessica Hecht), doesn’t want a stick of it (“Oh dear God” is her tipsy response). So he has hired a used-furniture dealer to appraise it.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 308,
  "archivePath": "data/archives/reviews/the-price-2017/nytimes--alexis-soloski_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:34:16.345Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203857",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203857/https://www.nytimes.com/2017/03/16/theater/review-the-price-mark-ruffalo-arthur-miller.html?_r=0",
  "wordCount": 308,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T11:36:18.182Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text cuts off mid-article with a technical error message about retrieving content and enabling JavaScript, making it impossible to determine the critic's verdict.; openai: The text is incomplete and includes navigation instructions and error messages, not a full review.; gemini: The review text is incomplete and contains an error message indicating that the article content could not be retrieved.",
  "promptVersion": "5.2.0",
  "showScoreExcerpt": "\"Sympathetically directed and ardently acted, there’s much to enjoy in this Roundabout Theater Company revival...Yet it shows 'The Price' as a smaller, more stolid work than it wants to be — still just a little out of style...Mr. Kinney’s quieter, more faithful style emphasizes the fine roles for actors but doesn’t make a strong case for the play itself...If the debate is involving, it’s not especially consequential.\"\n\nRead more",
  "duplicateTextOf": "nytimes--chris-jones.json"
}
