{
  "showId": "the-price-2017",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2017/legit/reviews/the-price-review-mark-ruffalo-broadway-1202009477/",
  "publishDate": "March 17, 2017",
  "fullText": "Arthur Miller is back on Broadway with “The Price,” a rarely-revived play written in the 1960s, with strong references to the 1930s, that still reverberates with meaning for the 2010s. Let’s just say that the dramatic themes and human conflicts are timeless. Terry Kinney, a founding member of Steppenwolf Theater, directs a superlative cast consisting of Mark Ruffalo, Tony Shalhoub, Jessica Hecht, and Danny DeVito, who make this revival a treasured experience.\n\nConsider, for a moment, the near-universality of the dramatic situation: A feared and venerated patriarch has died and his two long-estranged sons must divvy up the family assets they intend to sell to a second-hand furniture dealer. The brothers meet in the overstuffed attic of their father’s Manhattan brownstone to determine the value of their material possessions — and the figurative prices they put on the choices they each made during their lives.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n James Bond to Batman: Oscar Winner Chris Corbould Breaks Down the Art of Practical Spectacle at International Film Festival of India \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Famke Janssen on Returning to the Netherlands for 'Amsterdam Empire' and Advice for Future Bond Villains and X-Men\n\nDerek McLane’s set design invites a close look. Under its wooden eaves, the attic houses the contents of a 10-room house that once knew better times. There are tables and table lamps and too many straight-backed chairs to count. There are armoires and cabinets and a nice selection of overstuffed armchairs, not to mention the eye-catching harp in the middle of it all. Outside the invisible walls of the set, unseen workmen (audible enough, in the soundscape by Rob Milburn & Michael Bodeen) are tearing down other homes in the neighborhood, clearing the way for higher and haughtier residential buildings to come.\n\nVictor Franz, the younger brother who is first to arrive, is played by Ruffalo wearing his character’s hypersensitive feelings pinned to his skin. A New York police sergeant nearing retirement, Victor is initially drawn to objects that remind him of happy moments — the oar to his scull, his fencing gear, the novelty “laughing record” he plays on the old Victrola.\n\nVictor’s wife, Esther (Hecht, giving another supremely relatable performance), arrives next, ever-so-slightly-drunk from a session with her analyst. She makes no claims on the family furnishings, but she uses their time alone to needle Victor about the importance of driving a hard bargain with Gregory Solomon, the octogenarian furniture dealer — who finally arrives in the extremely welcome person of DeVito.\n\nMiller wrote Solomon as a half-wise, half-comic figure. DeVito, who holds the audience in the palm of his hand, tends to favor the comic side, making an extended meal out of an egg-eating visual gag. But he also draws on down-to-earth Jewish wisdom to keep family hostilities from boiling over and spoiling the financial negotiations. “With used furniture you cannot be emotional,” he wisely advises, although whenever he’s called, it’s always an emotional crisis. “It’s either a divorce or somebody died.”\n\nAs Solomon carefully sizes up the furnishings, delivering a running critique of every object, we get a vivid picture of a once-proud, once-comfortable family (they even had a live-in chauffeur) who lost it all in the stock market crash of 1929 and the subsequent Depression. This is a recurring theme with Miller, who uses it to connect one family’s trauma with the collective suffering of a nation that foolishly insists on defining success by money and possessions.\n\nRuffalo and DeVito clearly get a kick out of the buying and selling rituals of Victor and Solomon. There is warmth in their tones and mutual respect in their exchange of confidences — which lasts right up until the time that Solomon names a money figure and Victor accepts it.\n\nAt which moment, older brother Walter arrives in the person of Tony Shalhoub — and the play really begins.\n\nWalter’s stunning camel’s hair coat (costumer Sarah J. Holden found this beauty) says a lot about Walter, a successful doctor who nickel-and-dimed his impoverished father and refused to give Victor a loan so he could finish college. Shalhoub is a wonderfully subtle actor, and the half-smile he wears is both a protection and a threat. Under Kinney’s measured direction, the recriminations really heat up in the galvanic second act, when kind Esther and adorable Solomon fade into the shadows and let the brothers fight their old quarrels until one or both of them falls over.\n\nLike certain politicians who shall remain nameless, Walter divides people into winners and losers, the winners, like himself, being those who ignore their filial duties, follow their dreams, and make a lot of money to buy a lot of things. The losers, like Victor, are those who give up their ambitions and sacrifice themselves for another person — or an individual conviction or even a group ideology. As the brothers fight over their clashing ethical codes, the question of values — of their life choices, of their loyalties, of their stuff — keeps shifting back and forth. Just like those circular debates between those same nameless politicians.",
  "isFullReview": true,
  "dtliExcerpt": "Danny DeVito and Mark Ruffalo anchor a solid revival of Arthur Miller's family drama that examines the cost of the choices we make.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Danny DeVito and Mark Ruffalo anchor a solid revival of Arthur Miller's family drama that examines the cost of the choices we make.",
  "contentTier": "complete",
  "contentTierReason": "Short text (23 words)",
  "textQuality": "full",
  "previousUrl": "https://variety.com/2017/legit/reviews/the-price-review-broadway-revival-1202005506/",
  "urlDiscoveredAt": "2026-02-04T00:57:58.269Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 839,
  "archivePath": "data/archives/reviews/the-price-2017/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:57:58.275Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251204224539",
  "archiveOrgUrl": "http://web.archive.org/web/20251204224539/https://variety.com/2017/legit/reviews/the-price-review-mark-ruffalo-broadway-1202009477/",
  "wordCount": 839,
  "tierReason": "Full review text"
}