{
  "showId": "how-i-learned-to-drive-2022",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "https://newyorktheater.me/2022/04/19/how-i-learned-to-drive-broadway-review/",
  "playbillVerdictUrl": "https://newyorktheater.me/2022/04/19/how-i-learned-to-drive-broadway-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "This is a play about child abuse. Strip away the humor, the artful metaphors, the theatrical craftsmanship and the empathy, and “How I Learned to Drive” is the story of a pedophile, alcoholic and would-be pornographer named Peck (portrayed by David Morse), who starts grooming his niece (Mary-Louise Parker) for sex from the age of 11. But what’s remarkable about Paula Vogel’s Pulitzer Prize winning play is precisely that the craftsmanship and especially the empathy draw us in, creating a theatrical filter that allows us to take in this disturbing story, and encourages us to try to understand it. In this first Broadway production of “How I Learned to Drive,” running at MTC’s Samuel J. Friedman Theatre through May 29, Morse and Parker are reuniting twenty-five years after they originated their roles Off-Broadway. Parker portrays a character we know only as Li’l Bit, who as a middle-aged adult is narrating her complicated childhood relationship with her Uncle Peck, stepping in to scenes with him at various ages from 11 to 17, told out of chronological order. Parker wins our sympathies right away, not because she’s a victim, but because she’s sharp and funny. “I was sixteen or so before I realized that pedophilia did not mean people who loved to bicycle.” Not every actress could get away with such a line, much less land a laugh with it. But if her character is letting us know in a cheeky way about her innocence, she is also self-aware (and non-ideological) enough throughout her story to explore with us the ways she feels she was complicit. Parker’s reprised performance does the heavy lifting in a play that is rightly, and smartly, a memory play told from the woman’s point of view. But it is the male character that offers the greater challenge. The playwright does what she can to establish Peck as a human being rather than a monster, but it is David Morse’s memorable performance that makes the character credible. Indeed, his performance — gentle, earnest, likable, and thus all the more unsettling — is what I still remember from the production I saw at the Vineyard Theater in 1997. (Was that really 25 years ago?!) The actor again delivers. In one striking scene, in a visit back home in South Carolina, he’s teaching his (unseen) young cousin Bobby how to fish for pompano; “they’re a very shy, mercurial fish. Takes patience, and psychology.” If that isn’t blatant enough, there’s a suggestion at the end of the scene that L’il Bit is not the only relative in his sights. And yet, in Morse’s hands, Peck’s motives seem at least mixed. He comes off as genuinely caring. Oddly, I hadn’t remembered the three-member “Greek chorus” in the play. Johanna Day (who was also in the original production), Alyssa May Gold and Chris Myers announce the title of every scene – which are all borrowed from a driver’s manual (e.g. “Shifting forward from first to second gear.”) These titles drive home the central metaphor in the play, which is also its organizing principle: Uncle Peck teaching L’il Bit how to drive a car. The play begins and ends, and is threaded throughout, with scenes of them in the front seat, often paired with physical encounters. The three chorus members also portray individual family members, classmates and ancillary characters. Some of their scenes are confusing; some are funny; many are uncomfortable. Together, they offer a picture of a complicit environment. Sometimes this is direct: In one monologue, Day as Peck’s wife Mary (the sister of L’il Bit’s mother) says “I’m not a fool. I know what’s going on” and blames it on her niece: “She’s a sly one….she’s twisted Peck around her little finger.” Myers portrays a waiter at a resort inn whom Peck bribes to serve the underage L’il Bit alcohol, in order to get her drunk. Interspersed with this scene, Day as L’il Bit’s mother offers a humorous if troubling monologue “A mother’s guide to social drinking,” (“As a last resort, when going out for an evening on the town, be sure to wear a skin-tight girdle, so tight that only a surgical knife or acetylene torch can get it off you–so that if you do pass out in the arms of your escort, he’ll end up with rubber burns on his fingers before he can steal your virtue.”) When they portray the family members together for meals, invariably making fun of L’il Bit for being full-breasted, or just for being female, these scenes establish what the narrator calls “my cracker background,” and paint Peck as the one family member who treats her with respect. “How I Learned to Drive” is not just a play about seduction and complicity; it is itself a kind of seduction, which charms us, and then makes us feel complicit. The charm in this production is carefully calibrated. Director Mark Brokaw, who also helmed the original production, keeps the staging simple and discreet; their encounters are often at a distance, mimed…until they’re not. There is also a minimalist set. Despite the high-profile return of the play’s two original stars, I’m not sure how well this low-key production of this difficult, lyrical 25-year-old play will stand out in the midst of this busy “Broadway is back ” end-of-season month of flashier shows. But at a time when the Republican members of the Senate Judiciary Committee were trying to paint a well-respected Supreme Court nominee as soft on child pornographers, I couldn’t help imagining how they would react to “How I Learned to Drive,” and am delighted it’s finally on Broadway. How I Learned to DriveMTC’s Samuel J. Friedman Theatre through May 29, 2022 Running time: 100 minutes with no intermissionTickets: $79 to $299Written by Paula VogelDirected by Mark BrokawScenic Design by Rachel Hauck; Costume Design by Dede Ayite; Lighting Design by Mark McCullough; Original music and sound Design by David Van Tieghem; Video Design by Lucy Mackinnon, music direction and vocal arrangements by Stephen Oremus, dialect coach Deborah HechtCast: Mary-Louise Parker, David Morse, Johanna Day, Alyssa May Gold and Chris Myers. Spring 2020 Broadway Preview: Familiar Stars, Familiar Stories, With A Few CurveballsJanuary 3, 2020In \"Broadway\" Tony Nominations Delayed. Broadway Reviews: Funny Girl, For Colored Girls…, Hangmen, How I Learned to Drive. #Stageworthy NewsApril 25, 2022In \"New York Theater\" 15 Favorite New York Stage Performances in 2022December 14, 2022In \"New York Theater\"",
  "isFullReview": true,
  "textWordCount": 1064,
  "archivePath": "data/archives/reviews/how-i-learned-to-drive-2022/nyt-theater--jonathan-mandell_2026-02-04.html",
  "textFetchedAt": "2026-02-04T15:52:17.784Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 1064,
  "tierReason": "Full review text",
  "bwwExcerpt": "Parker's reprised performance does the heavy lifting in a play that is rightly, and smartly, a memory play told from the woman's point of view. But it is the male character that offers the greater challenge. The playwright does what she can to establish Peck as a human being rather than a monster, but it is David Morse's memorable performance that makes the character credible. Indeed, his performance - gentle, earnest, likable, and thus all the more unsettling - is what I still remember from the production I saw at the Vineyard Theater in 1997. (Was that really 25 years ago?!)",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-HOW-I-LEARNED-TO-DRIVE-Opens-On-Broadway-20220419"
}
