{
  "showId": "how-i-learned-to-drive-2022",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Helen Shaw",
  "url": "https://www.vulture.com/article/theater-review-how-i-learned-to-drive-broadway.html",
  "playbillVerdictUrl": "https://www.vulture.com/article/theater-review-how-i-learned-to-drive-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "I realize that doesn't make it sound like a fun 100 minutes in the theater. And Brokaw's production does show a few cracks: The glowing screens (designed by Rachel Hauck) are unhandsome; David Van Tieghem's sound design does not always amplify the actors sufficiently. But the chance to see these performers doing such incandescent work should shoulder all such concerns aside. See it for Parker, see it for Morse. Drive is also - and I'm sorry this is such an uncool way to put it - the truth. We have been surrounded in recent months by variously hysterical and inaccurate claims from politicians and blowhards about what counts as child endangerment. Vogel, with all her postmodern tricks, is offering a straight-forward account of how these things happen. A girl is in peril, and although the people around her all sense it, they actively push her further into harm.",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-HOW-I-LEARNED-TO-DRIVE-Opens-On-Broadway-20220419",
  "showScoreExcerpt": "\"Twenty-five years ago, Mary-Louise Parker played Li’l Bit, David Morse played Uncle Peck, and Mark Brokaw directed. Now all three are back for Broadway. Strange things happen when nostalgia gets wrapped up in the production, which is itself a cautionary tale about letting atmosphere (the night, the heat, the past) drug the senses. 'Drive' moves backward in time, revisiting earlier and earlier encounters: What we can just bear to look at when Li’l Bit is 17 gets more awful as she becomes 15, then 13, then 11.\"\n\nRead more",
  "fullText": null,
  "isFullReview": false,
  "textWordCount": 118,
  "archivePath": "data/archives/reviews/how-i-learned-to-drive-2022/vulture--helen-shaw_2026-02-06.html",
  "textFetchedAt": "2026-02-06T16:11:17.078Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text",
    "has_footer_text",
    "shorter_than_excerpt"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 118 (min: 300)",
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "This email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy to receive email correspondence from us. There was an error. Please try again later. There was an error please try again later. Does not meet password requirements Password must be at least 12 characters. This email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy to receive email correspondence from us. You can log in with the Vox Media account you created on We’ve sent an email with instructions for setting a new password. Sign in with your new password below.",
  "contentTier": "excerpt",
  "_showNotMentionedDiscoveryAttempted": true
}
