{
  "showId": "the-importance-of-being-earnest-2011",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "http://www.hollywoodreporter.com/review/importance-earnest-theater-review-71658?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+thr%2Ffilm+%28The+Hollywood+Reporter+-+Movies%29",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Bedford unleashes a limitless arsenal of variations on dry disapproval and can do wonders with a pause or vocal fluctuation of a half-octave or so. Mulling whether Jack is worth adding to her list of eligible bachelors, Lady Bracknell's grilling of him is comedy at its most sublime. But then, Bedford's every line in this entertaining revival is a jewel.",
  "bwwScore": 9,
  "contentTier": "complete",
  "fullText": "While the insouciant brilliance of Oscar Wilde’s 1895 play, subtitled A Trivial Comedy for Serious People, can make it appear indestructible, anyone who ever sat through a production with actors unequal to the task can testify that’s not quite true.\n\nHowever, when performed with the playful brio of such an accomplished cast, it’s ageless. Wilde skewers intellectual pretentiousness, societal hypocrisy and class-conscious ambition with an epigrammatic fusillade that makes this still one of the funniest plays in the English language.\n\nBedford also directed the handsomely upholstered production, first staged at the 2009 Stratford Shakespeare Festival. It comes to Broadway via Roundabout Theatre Company with several new cast members, among them two dab hands at clever comedy, Dana Ivey and Paxton Whitehead.\n\nAs Jack Worthing, David Furr walks the perfect blurry line between rakishness and sincerity, even if the rhythms are a little halting in the lengthy opening scene between Jack and his friend Algernon Moncrieff. Having proven himself a talent to watch playing brooding young men in Brighton Beach Memoirs and Billy Elliot, Santino Fontana initially seems an imperfect fit for preening peacock Algy.\n\nWith their fabricated alter egos facilitating convenient double lives, the two men provide fodder for Wilde’s wry observation of a world of deception. Paradoxically, the more their ruses become entangled, the more Fontana hits his stride.\n\n“It must go like a pistol shot,” Wilde observed of this play, and for the rest of the action, it does. The challenge is to make the dazzling language come alive as spontaneous talk, which is a key strength of Bedford’s production.\n\nHe coaxes especially delectable characterizations out of Jack and Algy’s respective sweethearts, Gwendolen (Sara Topham) and Cecily (Charlotte Parry). Like Victorian Kardashians, these gloriously anti-intellectual creations are proudly superficial — one citified and affected, the other more sheltered, though no less prone to irrational passions. Bouncing from instant sisterhood to fuming rivalry then back again, their interplay is a hoot.\n\nDitto the more cautious flirtation between Whitehead’s droll cleric and Ivey’s starchy Miss Prism, Cecily’s governess. The daffy girlishness that overcomes Miss Prism around the Reverend makes the revelation of her carelessness years earlier with a baby inadvertently left in a handbag quite credible. That absurd subplot of course provides the play’s most delicious contrivance and prompts Lady Bracknell’s most indignant double-take.\n\nArbiter of decorous behavior in a world of ever-encroaching impropriety, Lady B. is a fearsome gorgon who has very firm ideas about the prospective spouses of her daughter Gwendolen and nephew Algy. Indeed, a woman with firmer ideas about anything would be hard to find.\n\nIn bejeweled battleship gray for her first scene and imperious red for her second, Lady Bracknell’s elaborate hats look as if they might take flight at any moment. But there’s nothing campy about Bedford’s regally anchored performance. He requires merely an arching of the eyebrows or a tilt of the head to convince us he’s a woman who came to marriage with neither fortune nor rank but encountered no obstacle in elevating herself to the pinnacle of society – at least in her own estimation.\n\nBedford unleashes a limitless arsenal of variations on dry disapproval and can do wonders with a pause or vocal fluctuation of a half-octave or so. Mulling whether Jack is worth adding to her list of eligible bachelors, Lady Bracknell’s grilling of him is comedy at its most sublime. But then, Bedford’s every line in this entertaining revival is a jewel.\n\nVenue: American Airlines Theatre, New York (Through March 6)\n Cast: Brian Bedford, Dana Ivey, Paxton Whitehead, Santino Fontana, David Furr, Tim MacDonald, Paul O’Brien, Charlotte Parry, Sara Topham, Amanda Leigh Cobb\n Playwright: Oscar Wilde\n Director: Brian Bedford\n Set and costume designer: Desmond Heeley\n Lighting designer: Duane Schuler\n Music: Berthold Carriere\n Sound designer: Drew Levy\n Presented by Roundabout Theatre Company\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice.\n\nThe gowns, the goods and the gossip of Hollywood. Delivered weekly.\n\nBy providing your information, you agree to our\n Terms of Service\n and our\n Privacy Policy. We use vendors that may also process your information to help\n provide our services.\n\nYou’re signed up for the Loose Threads Newsletter\n\nSave on The Definitive Voice of Entertainment News",
  "isFullReview": true,
  "textWordCount": 799,
  "archivePath": "data/archives/reviews/the-importance-of-being-earnest-2011/hollywood-reporter--david-rooney_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:19:42.101Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 799,
  "tierReason": "Full review text",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-IMPORTANCE-OF-BEING-EARNEST-20110113"
}
