{
  "showId": "the-importance-of-being-earnest-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://www.variety.com/review/VE1117944292/",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Bedford may be the star of this vehicle, but he's shrewd enough to surround himself with sturdy backup, none cleverer at their jobs than Dana Ivey and Paxton Whitehead, a dynamite comic duo as the lovesick tutor Miss Prism and the obtuse vicar, the Reverend Canon Chasuble. As the arbiter of all matters of good taste, even the uncompromising Lady Bracknell would agree that, from top to bottom, this is one fine cast.",
  "bwwScore": 9,
  "contentTier": "complete",
  "fullText": "It's Brian Bedford's party, so let's give the old dear the rousing chorus of \"For He's a Jolly Good Fellow\" that he's earned as director and showpiece of \"The Importance of Being Earnest.\"\n\nIt’s Brian Bedford‘s party, so let’s give the old dear the rousing chorus of “For He’s a Jolly Good Fellow” that he’s earned as director and showpiece of the Roundabout’s revival of Oscar Wilde’s scathingly witty 1895 comedy of manners, “The Importance of Being Earnest.” All foot traffic stops, as it should, whenever Bedford is commanding center stage with the imperial presentation of Lady Bracknell he originated in 2009 at the Stratford Shakespeare Festival. But the thesp’s lifetime commitment to the classics (27 seasons at Stratford alone) also accounts for the technically assured craftsmanship underpinning this lavishly mounted crowdpleaser.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Chicago Fire,’ ‘Med’ and ‘P.D.’ Set Crossover Episodes on NBC in March \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Chicago P.D.' Stars Jesse Lee Soffer and Tracy Spiridakos Set to Return for Crossover\n\n“Earnest” is no fun if you don’t get a taste of the narrow, rigidly stratified, and virtually impregnable class structure of fin de siecle English society that roused Wilde’s furious contempt and inspired his brilliant satiric comedies. The elaborate tiered sets and sumptuous costumes by master designer Desmond Heeley provide a visual context, with grandly scaled drawing rooms and conservatories furnished in the suffocating luxury demanded by the privileged members of upper-class Victorian society. The conceptual design is all terribly tongue-in-cheek, but it’s also very pretty.\n\nWilde is deliciously disdainful of those fashionable young blades Algernon Moncrieff (Santino Fontana) and John Worthing (David Furr) who have each invented fictional characters (a sick friend for Algie and a reprobate brother for Jack) so they can escape their London social responsibilities.\n\nAs punishment for evading their moral responsibility to marry, they both fall in love with girls who trivialize the institution of marriage even more than they do — by refusing to marry anyone who isn’t named Earnest. Charmed by such female vapidity, Algie claims the virginal Cecily Cardew (saved from being insipid by Charlotte Parry’s forthright delivery), while Jack sets his cap for perky Gwendolen, who draws eyes like a magnet, as much for a vivacious perf from Sara Topham (who originated the role at Stratford) as for her breathtaking lavender and lace gown.\n\nBut Gwendolen happens to be the daughter of Lady Bracknell, the very embodiment of censorious Victorian society, and her hand will not be won without the most intense moral scrutiny from this dragon.\n\nAnd what a divine dragon she is, in the capacious red brocade gown and fine feathered hat that define and enhance Bedford’s precision tooled performance. Although he does surprisingly little with the signature line of dialogue (“A handbag?”) that other actresses have feasted on, his contempt is withering when Lady Bracknell learns that the infant Jack was abandoned “in the cloakroom of Victoria Station.” The mere contemplation of such a grave social indiscretion causes Bedford to crinkle his nose and purse his lips in a moue of distaste that would freeze the blood of any unsuitable swain.\n\nAlgernon’s artistic affectations, like his fat-striped sports jackets and childish love of mischief make him an obvious figure of fun. At the same time, Wilde entrusts him with choice examples of his paradoxical witticisms and incisive aphorisms. Taking a page from the Matthew Broderick book of comedy, Fontana plays this lovable scamp with crisp diction and more twinkle than a Christmas tree.\n\nFurr is a properly upright Jack Worthing, a bit too judgmental about his friend’s shenanigans, but standing up bravely to Lady Bracknell’s scornful contempt for his genealogy. He also delivers a heartfelt rendering of Wilde’s immortal utterance on the wits and wags of his day: “I am sick to death of cleverness. Everybody is clever nowadays. … I wish to goodness we had a few fools left.”\n\nBedford may be the star of this vehicle, but he’s shrewd enough to surround himself with sturdy backup, none cleverer at their jobs than Dana Ivey and Paxton Whitehead, a dynamite comic duo as the lovesick tutor Miss Prism and the obtuse vicar, the Reverend Canon Chasuble.\n\nAs the arbiter of all matters of good taste, even the uncompromising Lady Bracknell would agree that, from top to bottom, this is one fine cast.",
  "isFullReview": true,
  "textWordCount": 715,
  "archivePath": "data/archives/reviews/the-importance-of-being-earnest-2011/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:20:09.047Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 715,
  "tierReason": "Full review text"
}