{
  "showId": "a-bronx-tale-2007",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Unknown",
  "url": "http://variety.com/2016/legit/reviews/a-bronx-tale-review-musical-1201706762/",
  "playbillVerdictUrl": "http://variety.com/2016/legit/reviews/a-bronx-tale-review-musical-1201706762/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "It’s not a stretch to imagine a musical version of \"A Bronx Tale.” The 1993 film adaptation of Chazz Palminteri‘s autobiographical one-man play — about growing up in the '60s in a tough Italian-American neighborhood amid gangsters, romance and a changing racial time — is infused with music. But what may surprise, in the world premiere of the musical adaptation at Paper Mill Playhouse, is the addition of Robert De Niro, who directed and co-starred in the film and here co-directs the stage version with Broadway veteran Jerry Zaks. It’s an odd coupling that results in a show that at times seems to be at odds with itself.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Damon Lindelof Sets Limited Series 'The Chain' at HBO Under New Overall Deal \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Knight of the Seven Kingdoms' Premiere Draws 6.7 Million Viewers in Three Days\n\nThere are moments when you feel the story is about to bust loose musically — you can almost feel choreographer Sergio Trujillo chomping at the bit — but instead there comes a more restrained, intimate and authentic approach. Missing, however, are more moments of unrestrained joy and the heightened reality of musicals. While there are several pleasant ballads and some fun uptempo songs, the score, by Alan Menken and Glenn Slater, lacks killer numbers for these mean (if somewhat romanticized) streets.\n\nPalminteri smartly adapts his own material here, making judicious choices in retelling his story through the warm haze of a memory play (with lamppost lighting by Howell Binkley). In it, an adult Calogero (Jason Gotay, very good) looks back to a time when he was torn between two powerful figures in his life: his devoted, bus-driver father Lorenzo (Richard H. Blake) and the charismatic neighborhood crime boss Sonny (Nick Cordero), who befriends the boy when the kid doesn’t snitch to the cops after he witnesses a street killing. “You did a good thing for a bad man,” says the father, but his son doesn’t quite see it that way.\n\nAnd who can blame him? Some terrific set pieces from the film are nicely re-crafted for the stage in musical terms, with the best moments going to Sonny. A wiseguy dice game that seduces Calogero’s younger self (played with confident brio by Joshua Colley) is reimagined as “Roll ‘Em,” followed by the kid’s exuberant “I Like It”; Sonny’s philosophical take on life is now the calculating tune “Nicky Machiavelli”; and the mob boss’s advice about women to his surrogate son — whom he dubs “C” — is a swinging “One of the Great Ones.”\n\nLorenzo is left with less flashy material, such as the sentimental bromides of “Look to Your Heart,” which sets the moral compass but also makes this dad dull. In the film, De Niro invested the character with a deeply-felt ache and determination that haven’t found their stage equivalents here.\n\nThe changing racial nature of the neighborhood gives added tension to the narrative, especially when C falls for Jane (Coco Jones), a self-possessed black girl from school, whose brother and friends get beat up by C’s increasingly dangerous pals.\n\nThe performances are solid overall. Cordero (“Bullets Over Broadway”), fitted in gangster chic (in telling '60s period attire by costumer William Ivey Long), makes an appealing hood, though he lacks the fearsome menace lurking just beneath the cool that Palminteri evoked in the film.\n\nAs C's mother, Lucia Gianetta gets a song reprise, giving her thinly drawn character a little more weight and showing that it takes more than one parent to raise a bambino. A new plot reveal also adds a nice twist to Sonny’s relationship to the family. The ensemble of wiseguys manages to land laughs, too, not to mention the occasional baseball bat in the ribs.\n\nIt all makes for an entertaining, if restrained, coming-of-age tale — but it could use a few more killer numbers to make a lasting impression.",
  "isFullReview": true,
  "textWordCount": 642,
  "archivePath": "data/archives/reviews/a-bronx-tale-2007/variety--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T04:36:51.619Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 642,
  "tierReason": "Full review text",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2016 outside valid range 2004–2009 for show opening 2007"
}