{
  "showId": "a-bronx-tale-2007",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://variety.com/2016/legit/reviews/a-bronx-tale-review-musical-broadway-1201931204/",
  "publishDate": null,
  "fullText": "To the best of our knowledge, “A Bronx Tale,” Chazz Palminteri‘s love letter to the wise guys and tough street kids from his old neighborhood has not been re-imagined as a ballet, but given the popularity of this vintage material, that might very well be in the works. After the 1989 solo show, the 1993 movie directed by Robert De Niro and the 2007 Broadway production staged by Jerry Zaks, where else could this show go but back to Broadway as a musical starring Nick Cordero? Is it a good fit? Not really, but there’s something nicely symmetrical about the material progress. Next up: surely an opera.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Don Lemon Confirmed to Speak at On Air Fest Podcast Conference After His Recent Arrest \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n The 2026 Ambies Podcast Awards Nominations Announced\n\nFrom the opening image, there’s no doubt we’re on the rough side of the Bronx in 1960. Howell Binkley’s spectacular lighting design throws a pulsing red glow across the starkly beautiful but precariously stacked levels of wrought-iron fire escapes designed by Beowulf Boritt in the manner of the great Louis Sullivan.\n\nAlthough the color scheme (red!) and materials (iron!) define this place as a tough neighborhood, there are clear signs of humanizing touches everywhere: a faded Italian flag draped across one fire escape landing; window boxes of cheap but bright flowers; and the piercing call-to-dinner orders from Italian grandmothers all up and down the block.\n\nCredit director Jerry Zaks (and co-director Robert De Niro) with terrific casting. Hudson Loverro is a bundle of energy and street smarts as Young Calogero, the earliest incarnation of the central role. Sturdy and studly Richard H. Blake makes a strong impression as the lad’s poor but honest (and kind of noble) father. And there’s a regular rogue’s gallery of weak but visually well-cast goombahs like Eddie Mush, JoJo the Whale and Crazy Mario.\n\nBut the boy can’t help falling hard for Sonny, the neighborhood Mafia presence embodied to perfection by Nick Cordero. It’s great to see this actor back on his native ground and looking really fine, after being so sadly misused in last season’s “Waitress.” He’s had his share of stage and TV work, but he’s locked into our hearts as Cheech, the bodyguard and inspired play doctor in the Woody Allen and Susan Stroman version of “Bullets Over Broadway.”\n\nAs Sonny, the local mob enforcer, Cordero is his own magnetic force field, irresistible to little Calogero and to his older but still immature self played with heart by Bobby Conte Thornton in his impressive Broadway debut. Insofar as this is a bro show about choosing your own father and reaping the benefits or suffering the consequences of making your own grownup decisions, it doesn’t really matter that the women in the show are weakly drawn and cast accordingly.\n\nAs familiar as the material may be, given all its various iterations, some people could watch it over and over and never get tired of it. But let’s face it, this ill-advised musical version, with an anemic score by Alan Menken and Glenn Slater, isn’t going to send ’em dancing up the aisles.\n\nWhile there are fun things to be found, like those jailbait Doo-Wop Guys singing and snapping a cappella under the streetlight, the music is soggier than overcooked meatballs and the lyrics have absolutely no bite. To continue bashing our heads against the wall, Sergio Trujillo’s choreography is a snooze. Even the great costume designer William Ivey Long falls down on the job. Here he fails to allow for the fact that the people who wore these period outfits thought they looked good in them. Before anyone else tackles this era, they should stop fingering polyester swatches and just feast their eyes on “Grease.”",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "To the best of our knowledge, \"A Bronx Tale,\" Chazz Palminteri's love letter to the wise guys and tough street kids from his old neighborhood has not been re-imagined as a ballet, but given the popularity of this vintage material, that might very well be in the works....",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Credit director Jerry Zaks (and co-director Robert De Niro) with terrific casting...Let’s face it, this ill-advised musical version, with an anemic score by Alan Menken and Glenn Slater, isn’t going to send ’em dancing up the aisles. While there are fun things to be found, like those jailbait Doo-Wop Guys singing and snapping a cappella under the streetlight, the music is soggier than overcooked meatballs and the lyrics have absolutely no bite...Sergio Trujillo’s choreography is a snooze.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright",
    "bww-roundup",
    "playbill-verdict"
  ],
  "playbillVerdictUrl": "http://variety.com/2016/legit/reviews/a-bronx-tale-review-musical-1201706762/"
}