{
  "showId": "good-night-oscar-2023",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/good-night-oscar-play-it-again-sean-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/good-night-oscar-play-it-again-sean-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "A neurotic hypochondriac, possibly suffering from Obsessive Compulsive Disorder and Schizophrenia, and definitely suffering from the weight of his intellect, Levant is a fascinating figure, portrayed by Hayes in a mannered, hand-wringing performance that’s as full of tics as it is charged with pathos. He enters Rachel Hauck’s clever set, which finds the common ground between padded cell and soundstage, and immediately blows the rest of his castmates’ stiff deliveries out of the water. Not to be ",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Sean-Hayes-Stars-In-GOOD-NIGHT-OSCAR-On-Broadway-20230424",
  "fullText": "Ben Rappaport and Sean Hayes | Photo: Joan Marcus\n\nIn a case of life imitating art imitating life, Sean Hayes’ stellar take on the virtuosic, self-destructive pianist Oscar Levant in Good Night, Oscar matches its setup: a captivating presence stuck in a waiting room.\n\nSprung from the psychiatric hospital by the very wife who had him committed, Levant spends most of Doug Wright’s one-act play in the green room of Jack Paar’s late-night show, feening for narcotics to ease his pain before going on live TV, where his angsty, off-the-cuff witticisms are certain to make viewers’ jaws drop and network execs’ ears fume.\n\nA neurotic hypochondriac, possibly suffering from Obsessive Compulsive Disorder and Schizophrenia, and definitely suffering from the weight of his intellect, Levant is a fascinating figure, portrayed by Hayes in a mannered, hand-wringing performance that’s as full of tics as it is charged with pathos. He enters Rachel Hauck’s clever set, which finds the common ground between padded cell and soundstage, and immediately blows the rest of his castmates’ stiff deliveries out of the water.\n\nNot to be too hard on the ensemble who, to their credit, are doing their best with a wooden, unoriginal script and Lisa Peterson’s farcical direction. Again and again, we learn that a star’s entourage might not have their best interests at heart, that talent is burdensome, and fame is a prison, et cetera. And creaky exposition fills us in on the man’s bonafides—though it is nice to learn about this icon of mid-century American culture.\n\nIt’s only when Hayes is left to his own devices, and Levant with his own demons, that the play takes off. We learn that the concert pianist was brought under George Gerswhin’s suffocating wing and laments the cost of that association; in a tragic bit of irony, meeting his hero showed him the limits of his own talent, and trapped him into a career of carrying his former master’s legacy.\n\nHayes wrestles these torments skillfully, but the play doesn’t catch up to his radiance until Levant goes live—on a couch segment with Paar where he’s finally teed up to showcase the lovable insouciance we’ve spent over an hour hearing about, and then in its final moments, when all else falls apart and he faces a piano. That’s when Hayes sits down to perform a stirring rendition of all ten-plus minutes of “Rhapsody in Blue.” It’s an audacious, haunting acting coup, as grand and cathartic a paean to human achievement as the Gerswhin piece itself. Like this production, it proves that a gifted performer can lift the spirit against all odds.\n\nGood Night, Oscar is in performance through August 27, 2023 at the Belasco Theatre on West 44th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 566,
  "archivePath": "data/archives/reviews/good-night-oscar-2023/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:47:16.128Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251116220240",
  "archiveOrgUrl": "http://web.archive.org/web/20251116220240/https://www.theatrely.com/post/good-night-oscar-play-it-again-sean-review",
  "contentTier": "complete",
  "wordCount": 566,
  "tierReason": "Full review text"
}