{
  "showId": "man-and-boy-2011",
  "outletId": "vulture",
  "outlet": "New York Magazine",
  "criticName": "Scott Brown",
  "url": "http://nymag.com/daily/entertainment/2011/10/theater_review_an_overleverage.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Basil lacks his father's diamond-tipped ruthlessness; he's 'soft,' a condition he tells his saucy American girlfriend Carol (Virginia Kull, doing her best as a one-woman exposition service) that his father equates with being 'queer.' This notion is then borne out, rather literally, in a highly entertaining but largely ridiculous game of insinuation and sexual leverage, in which Antonescu lures a potential merger target, Herries (Zach Grenier), to Basil's grungy Village apartment, and convinces his closeted guest that he's among kindred spirits — indeed, that Basil himself might be “un petit pederaste,” if the price is right. This should be appalling, but, as directed by Tricycle Theatre's Maria Aitken, it's mostly just amusing — the best leg of the show, in fact. Grenier and Langella share a fascinating pas de deux, a battle of body language that's a treat to see. As Antonescu's majordomo Sven, the right-hand man who's expert at pretending not to know what the left hand is doing, Michael Siberry proves himself, once again, the Roundabout's secret weapon and sine qua non. (In just three syllables — perhaps the most spectacularly insincere 'I'm sorry' ever uttered on any stage or in any medium — Siberry sums up the mendacity of the entire politico-financial apparatus he serves. When does this guy get his own miscalculated Roundabout revival?)",
  "bwwScore": 5,
  "contentTier": "needs-rescrape",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Joan Marcus/?2011 Joan Marcus\n \n \n \n \n \n \n \n\n \n\n \n \n \n Frank Langella and Adam Driver in the Roundabout’s Man and Boy.\n Photo: Joan Marcus/?2011 Joan Marcus\n \n\n \n \n\n The older the vampire, the longer the fangs: In Man and Boy, the Roundabout’s uneven new revival of an uneven old Terence Rattigan melodrama, Frank Langella, once and future Nosferatu, is given free rein to do what he does best, i.e., seducing and menacing and occasionally sinking his teeth into the puny mortals who surround him, all in tones as dark and deep as aged cordovan. But the monster of charm and guile he plays here, one Gregor Antonescu — a Depression-era financier with a hemoglobin-tinged Carpathian accent and a worldwide house of cards that’s on the brink of collapse — is the real prey. As his empire of “confidence and liquidity” crumbles and the noose tightens, Antonescu hides out in the Greenwich Village bachelor-hovel of his estranged offspring Vassily (Adam Driver), who now calls himself Basil and passes as an Oxford-educated Yank. The father hopes to enlist the son’s (mostly unwitting) support in a last-ditch gambit to save his vast holdings and, with them, the whole dirty, corrupt, indispensable “system” they underpin. Basil’s loyalty is hardly guaranteed: Five years prior, he disowned Antonescu in rather dramatic fashion (a pistol shot was involved), and reinvented himself as the sort of “goddamn Bolshie” who chides Roosevelt for “not going far enough fast enough.” Will blood prove thicker than liquidity?\n\nMan and Boy is at the American Airlines Theatre through November 27.\n\nYour product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 291,
  "archivePath": "data/archives/reviews/man-and-boy-2011/vulture--scott-brown_2026-02-07.html",
  "textFetchedAt": "2026-02-07T08:30:32.279Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 291,
  "tierReason": "Short text (291 words)",
  "rejectedAt": "2026-02-07T11:13:47.006Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be truncated promotional/website content that cuts off mid-review and includes shopping cart notifications and commission disclosures rather than a complete critical assessment; openai: The text primarily provides a plot summary and promotional content without any evaluative opinion or critique of the production.",
  "promptVersion": "5.2.0"
}
