{
  "showId": "cymbeline-2007",
  "outletId": "deadline",
  "outlet": "Deadline",
  "criticName": "Unknown",
  "url": "http://deadline.com/2015/08/a-scintillating-cymbeline-alights-in-central-park-review-1201496973/",
  "playbillVerdictUrl": "http://deadline.com/2015/08/a-scintillating-cymbeline-alights-in-central-park-review-1201496973/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "One of Shakespeare’s least loved plays, Cymbeline is sort of the True Detective Season 2 of the canon: not as good as what came before, too convoluted to sort out and too dense to follow; increasingly preposterous as the story unfolds, and yet. And yet. A production as wonderful as the one that director Daniel Sullivan has assembled for the Delacorte Theatre in Central Park challenges us to suspend overthinking and simply to luxuriate in the charms of an off-center romantic comedy whose twin triumphs of love and forgiveness override logic, and to just enjoy the damned picnic.\n\nThere are no gimmicks here — no Cymbeline of the Wild West or mafiosi helicopters alighting on an island, as some Free Shakespeare In The Park productions have had it. There’s music (enchanting, from If/Then and Next To Normal composer Tom Kitt) and poetry (from, well, you know who). And there are eight seriously terrific performances from four actors who effortlessly, almost dreamily, evoke highlights from my own four decades of Delacorteship.\n\nCymbeline (Patrick Page, who has gone far in erasing our memory of Spider-Man Turn Off The Dark even though, as the Green Goblin, he was the best thing about it) is the King of Britain during the time of the Roman Empire. To his great chagrin, his daughter Imogen (Lily Rabe, as essential to this generation of Delacorte denizens as Meryl Streep and Colleen Dewhurst were to theirs) has fallen in love with and married Posthumus Leonatus (Hamish Linklater, as versatile a classical actor as Kevin Kline and Stacy Keach), who grew up in the court. Equally put out is Imogen’s duplicitous stepmother, the Queen (Kate Burton, bewitchingly witchy), who has been planning all along for Imogen to marry her nitwit son Cloten (Linklater again).\n\nCymbeline banishes Posthumus, who heads to Rome, where he seeks protection from Philario (Page, again) a wealthy family friend. Phil introduces him to the cynical gambler Iachimo (the charmingly evil Raúl Esparza). Hearing of Imogen’s spotless virtue, Iachimo bets Posthumus that she can be seduced and sets off to England to bed her. Rebuffed, he sneaks into her chamber at night and in a scene of almost shocking cruelty, takes in enough of her physicality to convince the devastated Posthumus of his success.\n\nMeanwhile, Imogen’s brothers, whom Cymbeline has long thought dead, have in fact been raised in the wilderness by their loving guardian Belarius (Burton, again, in a Colonel Sanders goatee). Stupid-beyond-belief Cloten comes to a violent end at their otherwise good-natured hands, while Imogen, disguised as a man on her way to meet up with her husband, coincidentally takes refuge with the three men, two of whom are, unknown to her, her brothers, who also feel a rather unnerving attraction to this boy. Are you still with me here?\n\nIf this were all to be drawn out like a serial from Charles Dickens, each chapter a cliff-hanger hooking us til the next, or a Mozart/Da Ponte opera, Cymbeline could be accepted as a crowd-pleasing romance, brain candy. An important subplot involves Cymbeline’s refusal to pay tribute to Caesar, allowing Shakespeare to pump up the show with shoe-brush helmeted Roman legionaires threatening uncivil acts against the recalcitrant subjects.\n\nOf course, the lovers are reunited, the intemperate father sees the error of his ways; all’s well that ends well. They even pay their taxes. Sullivan’s accomplishments are many, chief among them resisting the temptation to italicize what needs no added emphasis. The narrative unfolds with clarity and naturalness — thanks not only to this exceptional cast, but also to an elegant simplicity of design (Riccardo Hernandez did the unfussy set, David Zinn the period-free costumes and David Lander the atmospheric lighting).\n\nPage and Burton bring maturity without pompousness; they seem to be having a great time. Add to that the sexy chemistry between Rabe and Linklater (not always to be presumed when real-life partners play partners onstage) and the seamless interweaving of Kitt’s music to enhance some of the script’s most poetic passages, and you have one very fine night in the Central Park.\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nDeadline is a part of Penske Media Corporation. © 2026 Deadline Hollywood, LLC.",
  "isFullReview": true,
  "textWordCount": 702,
  "archivePath": "data/archives/reviews/cymbeline-2007/deadline--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:59:09.682Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 702,
  "tierReason": "Full review text",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2015 outside valid range 2004–2009 for show opening 2007"
}