{
  "showId": "cymbeline-2007",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/cymbeline-review-enchanting-shakespeare-in-central-park-1.10718833",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/cymbeline-review-enchanting-shakespeare-in-central-park-1.10718833",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Hamish Linklater and Lily Rabe in The Public Theater's Shakespeare in the Park production of Cymbeline, directed by Daniel Sullivan, at the Delacorte Theater in Central Park. Photo Credit: Carol Rosegg\n\nUntil recently, \"Cymbeline\" has been one of Shakespeare's least-performed plays and -- no surprise -- there have been reasons. For starters, it is both tragicomedy and fairy-tale romance. The language is uneven. The tone's a slippery mixture of poignant and preposterous. Characters tend toward the coarse and/or cardboard, and the action, such as it is, includes more than the usual number of implausible disguises and culminates in 20 minutes of late-breaking forgiveness and deathbed confessions.\n\nNow forget you heard that -- or at least put it aside for three enchanting hours in Central Park. The Public Theater's modern-dress production, directed with wit and unexpected substance by Daniel Sullivan, has nine terrific actors switching around 24 sober and silly characters. The style has more than a dash of Lewis Carroll and, with actors generally sitting on chairs facing the stage when not performing, there is a let's-pretend attitude that never loses touch with the need to keep emotions real.\n\nAt the center are Lily Rabe and Hamish Linklater, real-life partners who have become Park favorites in matters of love and conflict. But Raúl Esparza is a sleazoid joy ride as Iachimo, the Italian scoundrel who, in this vision, is also a kind of Sinatra smoothie in Rome, which is now a casino town. Patrick Page doubles as the basso-profundo Cymbeline, King of Britain, and a Roman thug with a godfather huskiness. Kate Burton is a hoot as the evil second wife of the king, a harridan with henna hair belying the wicked elegance of her gown. (David Zinn did the high-concept costumes.)\n\nThen there are Rabe and Linklater, both with long, expressive faces and long bones that can suggest elegance and lyricism, but also endearing awkwardness. Rabe is Imogen, Cymbeline's daughter. She angers him by marrying Posthumus, a commoner, whom he banishes while trying to marry her off again to the awful Cloten, the meanie Queen's son from another husband.\n\nAnd Linklater plays both fellows, back and forth -- Posthumus, poetic and full of trusting ardor, then Cloten, a grandiose goofball and mouth-breather. Rabe's Imogen is innocent and statuesque, but drops the ladylike exterior to growl like a trucker when challenged. And yes, that's Rabe again doing an erotic dance in a black wig and disco-fringe mini.\n\nThe set, by Riccardo Hernandez, emphasizes the show-within-a-show playfulness with a circular patch of green between two golden picture frames and a really good combo behind the scrim. Piles of mismatched furniture are at either side of the stage, a nod, perhaps, to the piles of plots and ideas in Shakespeare's late-career jumble of an oddly worthy play.\n\nWHERE Delacorte Theater, Central Park\n\nINFO free with ticket; publictheater.org.\n\nBOTTOM LINE Enchanting production of Shakespeare's messy tragicomedy\n\nWe're revamping our Comments section. Learn more and share your input.\n\n'El Camino: A Breaking Bad Movie': Massively enjoyable wrap\n \n \n \n \n \n \n \n \n \n \n \n \n \n News 12's Carol Silva says she has stage 4 cancer\n \n \n \n \n \n \n \n \n \n \n Long-time anchor Shepard Smith leaving Fox News\n \n \n \n \n \n \n \n \n \n \n Stern proposes (again), this time on live TV\n \n \n \n \n \n \n \n \n \n \n Rachael Ray was obsessed by which kids TV host?\n \n \n \n \n \n \n \n \n \n \n \n \n \n LI girl, 6, appears on ABC's 'Kids Say the Darndest Things'\n \n \n \n\n \n Didn’t find what you were looking for?\n Try our new Search",
  "isFullReview": true,
  "textWordCount": 559,
  "archivePath": "data/archives/reviews/cymbeline-2007/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:59:46.287Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20191013223730",
  "archiveOrgUrl": "http://web.archive.org/web/20191013223730/https://www.newsday.com/entertainment/theater/cymbeline-review-enchanting-shakespeare-in-central-park-1.10718833",
  "contentTier": "complete",
  "wordCount": 559,
  "tierReason": "Full review text"
}