{
  "showId": "cymbeline-2007",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "http://www.nydailynews.com/entertainment/theater-arts/cymbeline-halfway-park-article-1.2320634",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/theater-arts/cymbeline-halfway-park-article-1.2320634",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "ExpandKate Burton, Lily Rabe, and Hamish Linklater as the queen, Imogen and Posthumus in \"Cymbeline.\"\n\nShakespeare's \"Cymbeline\" is such a convoluted mashup about love and war and much more that getting it even halfway right is something.\n\nThe Public Theater's al fresco take on the late, not-so-great play manages that mean feat by fighting fire with fire: Unruly play? Freewheeling approach!\n\nLed by real-life couple and frequent Delacorte players Lily Rabe and Hamish Linklater, the production includes a pared-down cast doing double, even triple, duty; semi-effective audience participation; a fast and loose Old Blue Eyes moment; and, well, fart jokes.\n\nIt makes for a breezy 90 minutes. Alas, there's another hour and a half to go. And the show loses steam in a big way in the second act. Chalk it up to the overwrought play and conceits that wear thin.\n\nThe action starts with wedded bliss curdling. King Cymbeline (Patrick Page) unties the marriage knot between his daughter Imogen (Rabe) and the commoner Posthumus (Linklater), who's exiled from Britain.\n\nThe devious Queen (Kate Burton) plots against Imogen with a potion. A Roman soldier, Iachimo (Raul Esparza), lies to Posthumus about bedding his wife. There's war between Britain and Italy. And finally, it's all mended bridges and happily ever afters. Yeah, right.\n\nWith freshly excavated pipes from the the Bard's garden found to have cannabis residue, this play may be Exhibit A in suggesting that Shakespeare toked while putting quill to paper.\n\nEither he was high or just lazy. With star-crossed lovers, devious frenemies and other familiar Bill devices popping up, the play is like a Bard's greatest hits reel. Director Daniel Sullivan's production has its own echo effect. He looks to his 1999 run at the Old Globe in San Diego. Like that show, this one features a streamlined cast, giant picture frames on the set, and the scene with Jupiter descending amid a storm has been excised.\n\nThe cast is, of course, new. And doubling roles actually can enhance the work's themes about two-sidedness and duality. Rabe's at her best as the heartbroken Imogen, but she's a bit less dynamic when disguised as the rustic boy. Linklater's aw-shucks, good-guy routine works for Posthumus. His dumb-and-dumber shtick as the doltish — and gassy — Cloten loses its impact.\n\nBurton is aptly nasty as the scheming queen. Close your eyes and listen to her when she plays a rustic and she sounds like Andrea Martin doing Edith Prickley.\n\nEsparza is suitably oily as the scheming Iachimo, who arrives like Frank Sinatra in a shiny blue suit. \"Cup us, till the world go round,\" he sings to Tom Kitt's snazzy, jazzy melody. The words aren't even from \"Cymbeline,\" but from \"Antony and Cleopatra.\"\n\nAt least that's juicy good fun. I wish he'd had an encore to rev up the sleepy second half.",
  "isFullReview": true,
  "textWordCount": 471,
  "archivePath": "data/archives/reviews/cymbeline-2007/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:59:49.239Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20220526083404",
  "archiveOrgUrl": "http://web.archive.org/web/20220526083404/https://www.nydailynews.com/entertainment/theater-arts/cymbeline-halfway-park-article-1.2320634",
  "contentTier": "complete",
  "wordCount": 471,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-04T05:32:09.813Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production at The Public Theater, not a Broadway production.; kimi: This review covers the Public Theater's Shakespeare in the Park production at the Delacorte Theater (described as 'al fresco' and featuring 'Delacorte players'), which is an outdoor off-Broadway venue, not a Broadway theater production.",
  "promptVersion": "5.2.0"
}
