{
  "showId": "cymbeline-2007",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Unknown",
  "url": "http://nypost.com/2015/08/11/lily-rabe-hamish-linklater-headline-a-feel-good-cymbeline/",
  "playbillVerdictUrl": "http://nypost.com/2015/08/11/lily-rabe-hamish-linklater-headline-a-feel-good-cymbeline/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Thanks for contacting us. We've received your submission.\n\nLily Rabe and Hamish Linklater in \"Cymbeline.\" \n Carol Rosegg \n \n \n \n \n \n \n A hodgepodge of plots and mood swings, “Cymbeline” hardly ranks among the Bard’s finest, or even near-finest. But Daniel Sullivan’s production for Shakespeare in the Park is agreeably lighthearted, steered by the likable, real-life couple Lily Rabe and Hamish Linklater. So often do they play the Delacorte that they’re probably on a first-name basis with Central Park’s raccoons.\n\nAs in so many Shakes plays, a key part of the plot involves a man (Linklater’s Posthumus) who questions the fidelity of his wife (Rabe’s Imogen) based on flimsy evidence supplied by a double–crossing friend (Raúl Esparza’s Iachimo). Posthumus believes his buddy rather than his wife and all hell breaks loose before a happy ending wraps together the many plot strands — which include a conniving queen (Kate Burton, not far off from her vice president on TV’s “Scandal”) and long-lost siblings (David Furr and Jacob Ming-Trent).\n\nCymbeline may be the king, but he has little to do here — which is a bummer, because he’s played by Patrick Page, just as good as he was as the Green Goblin in “Spider-Man: Turn Off the Dark.”\n\nSullivan’s big, if not very original, idea is to mix and match the periods and styles. Burton’s queen is in Elizabethan garb, but Esparza — who’s the show’s standout — wears a sleek ’60s-style suit and comes out swinging, singing a Sinatra-ish original tune by Tom Kitt (“Next to Normal”).\n\nNearly all the actors play two roles, notably Linklater, who deftly toggles between upright Posthumus and the cloddish prince Cloten — check out the way he sniffs, then licks, the orange earplugs Imogen wears to sleep.\n\nIt’s all good fun, if not enough to make up for the long and winding road that is the show’s second half. Unlike this summer’s tepid “Tempest,” there are no awful performances, just a steady, feel-good vibe. It’s Shakespeare on cruise control, when you’d want it to ignore the speed limit.​",
  "isFullReview": true,
  "textWordCount": 338,
  "archivePath": "data/archives/reviews/cymbeline-2007/nypost--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:59:52.211Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20220121093130",
  "archiveOrgUrl": "http://web.archive.org/web/20220121093130/https://nypost.com/2015/08/11/lily-rabe-hamish-linklater-headline-a-feel-good-cymbeline/",
  "contentTier": "truncated",
  "wordCount": 338,
  "tierReason": "Missing proper ending or other signals",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2015 outside valid range 2004–2009 for show opening 2007"
}