{
  "showId": "cymbeline-2007",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Unknown",
  "url": "http://variety.com/2015/legit/reviews/new-york-theater-review-cymbeline-at-shakespeare-in-the-park-1201566938/",
  "playbillVerdictUrl": "http://variety.com/2015/legit/reviews/new-york-theater-review-cymbeline-at-shakespeare-in-the-park-1201566938/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "There’s a reason nobody does “Cymbeline” straight. The late Romance is such a dumb play, with such a derivative plot and witless characters, that scholars have earnestly suggested Shakespeare might have written it as a self-parody. Nowadays send-up versions are common, as per the British company Cheek by Jowl, or our homegrown Fiasco Theater. The problem with director Daniel Sullivan’s fresh take on the play for Shakespeare in the Park is that it’s neither here nor there — not outrageous enough to be funny, but not sober enough to be taken seriously.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Damon Lindelof Sets Limited Series 'The Chain' at HBO Under New Overall Deal \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Knight of the Seven Kingdoms' Premiere Draws 6.7 Million Viewers in Three Days\n\nThe set (by Riccardo Hernandez) is the first giveaway that the production has no idea where it’s going. In the center of the stage is a gold frame set inside a much larger gold frame, but no formal tableaux to step into either frame. On either side of the proscenium are towering stacks of rubbish — wooden crates, some labeled with the titles of other plays from the Shakespearean canon, precariously balanced bentwood chairs and assorted busts and statues, with a skeleton off to one side and a chandelier on top. Adding to the chaotic visuals are large two-dimensional images of Napoleon charging into battle and some war machine that could be a tank.\n\nThe costumes (by David Zinn) are no more help in pinning down the historical period, much less the point of the production. The bad-tempered Cymbeline (Patrick Page) looks cruelly regal in a black leather duster that could go clubbing after the show. Kate Burton fares even better as his evil Queen. Being a second wife, she doesn’t get a name, but is amply compensated with a stunning, full-skirted, black-lace gown that’s Elizabethan in shape, if not fabric. The young lovers Princess Imogen and her commoner husband, Posthumus, played with romantic charm and grace by Lily Rabe and Hamish Linklater, are kindly clad in simple, comfortable slip-dresses and blousy shirts that could have passed for rehearsal clothes at the Old Globe.\n\nThe rest of the costumes range from patchwork rags to formal tails and spats. Even in this visual cacophony, Raul Esparza’s gangster-garish electric-blue suit manages to stand out. So does the actor's earnestly evil performance as the dastardly Iachimo, who makes a wager with the gullible Posthumus that he can seduce the virtuous Imogen, and proceeds to fake it with daring if dishonorable élan.\n\nThe tension of this triangular drama keeps the play grounded in some kind of reality zone. The theatrical device of tricking someone into believing his lover has been unfaithful is an old one, frequently used elsewhere by Shakespeare and his peers. But Esparza’s creepy-crawly technique is outstanding, and the devotion of the lovers makes it all quite touching.\n\nElsewhere, the play’s convoluted subplots — involving children stolen from their royal parents, parents scheming on behalf of their idiot children, rash monarchs banishing their disobedient heirs, wayward lovers in disguise and fake deaths from fake poisons, among other overworked gimmicks — are played largely for laughs, but in no consistent comedic style.\n\nAt the end of the show, the company comes together for a wonderfully witty court dance with music by Tom Kitt and choreography by Mimi Lieber. Everyone seems to be cavorting in his or her own fashion, but their individually distinct movements are all carefully composed into a harmonious whole. At last, we see what the director wanted us to see all along in his show. But what a shame the play didn’t open with the dance.",
  "isFullReview": true,
  "textWordCount": 606,
  "archivePath": "data/archives/reviews/cymbeline-2007/variety--unknown_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:32:30.729Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 606,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2015 outside valid range 2004–2009 for show opening 2007"
}