{
  "showId": "doubt",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2024/03/07/doubt-john-patrick-shanleys-prize-winning-play-in-a-blessed-revival/",
  "publishDate": "2024-03-07T20:54:37",
  "fullText": "Let’s hear it for John Patrick Shanley’s Doubt: A Parable, now in revival and once again serving as a powerful theatrical debate about religious certainty and uncertainty. Shanley confronts the audience with an argument that at its conclusion uncompromisingly questions belief as absolute.\n\nHe begins the attack with the very first line of his 2004 drama, for which he received both the Pulitzer Prize and Tony Award. During Mass, Father Flynn (Liev Schreiber in priest’s green and gold vestments), kicks off a sermon by asking gathered parishioners the seemingly mild query, “What do you do when you’re not sure?”\n\nAfter Father Flynn follows with a provocative parable of his own, the scene on David Rockwell’s smart set shifts to the office of Sister Aloysius Beauvier (Amy Ryan), the mother superior at St. Nicholas, a Catholic church and school in the Bronx. She’s interrupted by a visit from Sister James (Zoe Kazan), young and at momentary loose ends.\n\nIn an ensuing discussion about the progress of one or two students, Sister Aloysius establishes herself as the unchallenged authority on anything concerning the school and, most importantly, anything to do with how religion is taught and honored on the premises.\n\nShe is so assertive about her comprehensive convictions that she has no hesitation about advising Sister James, who has a special interest in history, that when teaching impressionable students, it’s not helpful to favor one academic subject over another. The comment is visibly discouraging to Sister James and instantly illustrates Sister Aloysius’ manipulations of those over whom she rules. Indeed, she quickly decides something is surely amiss on hearing from Sister James that Father Flynn has been giving special attention to (never seen) Donald Muller, St. Nicholas’ only Black student.\n\nFurthermore, when she learns that young Muller, an altar boy, has had a private rectory meeting at Father Flynn’s request and that, as Sister James reluctantly reports, the boy had alcohol on his breath when he returned to class, she presumes the worst, this despite Father Flynn’s offering an explanation which, it could be said, comes across as an entirely credible explanation from an honest man.\n\nThe ensuing conflict is Shanley’s clever tactic in a play during which Sister Aloysius is simultaneously the embodiment of certainty and a completely believable figure, while Father Flynn is simultaneously the embodiment of intelligent uncertainty as well as a completely believable figure.\n\nIt does need to be said that with Doubt: A Parable, Shanley isn’t interested in presenting the sides of his debate equally. He’s intent on delving into Catholicism in a manner which impressed as pertinent twenty years ago and remains so today. Simply by assigning the inflexible Sister Aloysius certainty and having the consistently reasonable Father Flynn insist more than once that the Mother Superior stands for a dated approach, Shanley implies he’s unalteringly behind doubt as a significant element of religious assessment.\n\nAs a result, it may be that Father Flynn’s goodness in opposition to Sister Aloysius’ inflexibility is a dramaturgical drawback. Shanley’s Father Flynn is a character about whom he could have allowed doubt: Is Father Flynn guilty as suspected in his feeling for Donald Muller, feelings which might extend so far as (never-mentioned) molestation? Might Shanley have written it so that Sister Aloysius – who is right in so many of her steadfast declarations – could easily seem right about the Donald Muller situation?\n\nThe answer is that he could have but hasn’t. As this production portrays Father Flynn, whatever he does he’s consistently likable and believable. Shanley, when interviewed, has indicated he wants audiences unsure about Father Flynn, but if so, that’s not what’s presented here. He’s so convincing that eventually Sister James, having awakened to life’s harsher realities during the action, is ultimately adamant in her belief about him. And observers are more than likely to take her word for it.\n\nTo give added balance to his work, Shanley also might have disclosed more back story about his focal characters. Why has Sister Aloysius chosen a nun’s life? Does she commit herself to work exclusively because at some time in the past, life lived otherwise was too oppressive? The most Shanley allows Father Flynn, also the school basketball coach, is a single ambiguous hint that he’s homosexual.\n\nThroughout though, Shanley’s plotting is inventive. Determined to confirm her distrust of Father Flynn further, Sister Aloysius organizes a meeting with Donald’s mother, Mrs. Muller (Quincy Tyler Bernstine). But trying to gain the parent as an ally, she encounters a woman worried about her son and pleased to know that in Father Flynn he has a protector getting him through to graduation and public high school advancement.\n\nAssuring the revival’s quality is director Scott Ellis, who elicits top-flight ensemble performances from the cast. Ryan wears Mother Superior’s certainty as if it were an impenetrable suit of armor. (She only recently replaced Tyne Daly.) Schreiber is the good priest throughout, delivering Father Fynn’s sermons and thorough religious maturity in an impeccable Bronx accent. Always reliable Bernstine demonstrates a tough, understanding mother.\n\nPerhaps it’s shamelessly obvious to end a review of this  Doubt: A Parable by declaring it succeeds without a doubt, but, okay, a few doubts aside, that’s still exactly what it does.\n\nDoubt opened March 7, 2024, at the Todd Haimes Theatre and runs through April 21. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
