{
  "showId": "the-skin-of-our-teeth-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2022/04/25/the-skin-of-our-teeth-its-so-extra/",
  "publishDate": "2022-04-25T21:53:13",
  "fullText": "Go big or go home. Thornton Wilder certainly did with his Pulitzer Prize–winning 1942 play The Skin of Our Teeth, which follows a single family through an ice age, flood, and war—centuries upon centuries of epic catastrophes—only to begin the cycle all over again.\n\nDirected by Lileana Blain-Cruz, Lincoln Center Theater’s swing-for-the-fences revival is appropriately grand, starting with Adam Rigg’s sprawling, stunningly detailed sets. And just wait until the dinosaur and woolly mammoth puppets—designed by James Ortiz (The Woodsman)—make their entrances. (It’s a good thing those guys go extinct after Act One, because they’re total scene-stealers.)\n\nThe first act turns the chaos of an impending ice age into a farce: Melodramatic maid/Greek chorus/lifelong pessimist Sabina (Gabby Beans, giving major Eartha Kitt vibes) and her feather duster are working overtime in the velvet-and tapestry-laden Excelsior, N.J., living room of a “typical American family,” as it’s described on the kitschy 1950s-style opening newsreel footage. George Antrobus (James Vincent Meredith) is the inventor of the wheel; his wife, Maggie (Roslyn Ruff), is a model homemaker and mother; daughter Gladys (Paige Gilbert) recites line-perfect poetry; and son Henry (Julian Robertson)… well, for heaven’s sake, just keep the slingshot away from Henry. As if the threat of freezing to death weren’t bad enough, the Antrobus living room is suddenly filled with a group of refugees—Moses, Homer, a group of Muses, and more—seeking warmth, coffee, and sandwiches. “Oh, I see what this part of the play means now! This means refugees,” says Sabina, dropping the servant schtick and reverting to the character of Latasha, aka the actress playing Sabina. “Don’t take this play serious. The world’s not coming to an end. You know it’s not. People exaggerate! That ice-business—why, it was a long, long time ago.”\n\nIncidentally, Latasha has quite a few opinions about this play, and she stops to share them whenever she darn well feels like it. “Oh—why can’t we have plays like we used to have—South Pacific, and Vanya and Sonya and Masha and Spike, and Bootycandy!—good entertainment with a message you can take home with you?” she sighs. The updated theatrical references, and additional judiciously placed contemporary material, are courtesy of Branden Jacobs-Jenkins (whose drama War, directed by Blain-Cruz, played at LCT3 in 2016).\n\nThankfully, the entire planet doesn’t turn into a massive iceberg, so Act Two moves to Atlantic City in the 1920s—naturally. Between the sex in the cabana, the giant slide at the back of the stage, and the dance break, the boardwalk is the place to be. Even Sabina is there, posing as a French-accented beauty queen while secretly scheming to steal George from his wife of 5,000 (yes, 5,000) years. Amid all that chaos and choreography—props to whoever decided to blare Chlöe’s body-positivity anthem “Have Mercy”—a fortune teller (Tony winner Priscilla Lopez, looking gorgeous but in sore need of some amplification) tries to warn our hero of the next impending disaster: torrents of rain. “Antrobus! Take these animals into that boat with you,” she instructs. “All of them—two of each kind.”\n\nThe Skin of Our Teeth is a lot. The time-hopping, the Biblical allusions, the meteorological madness. The newsreels, the play-within-a-play, the abrupt tonal shifts. And it only gets loopier after intermission, when the audience learns that a bunch of the actors have food poisoning (never eat moldy lemon meringue pie, people) and will be replaced by four crew members. But that’s when also the play gets very real, and we find ourselves in the Antrobus home, or what’s left of it anyway. Gladys and Mrs. Antrobus have been living underground, and father and son have been fighting—but not together.\n\nIt’s easy to see that Skin premiered in 1942, in the thick of World War II. Despite all the tragedy Wilder flung at his characters, he created a family that persevered, starting anew after each calamitous event. It’s a work of unyielding optimism in the face of incessant defeat. “Oh, the world’s an awful place,” sighs Sabina, who consoles herself by going to the movies “every now and then.” Her fellow theatergoers can  commiserate.\n\nThe Skin of Our Teeth opened April 25, 2022, at the Vivian Beaumont Theater and runs through May 29. Tickets and information: lct.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
