{
  "showId": "the-skin-of-our-teeth-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2022/04/25/the-skin-of-our-teeth-we-will-survive/",
  "publishDate": "2022-04-25T21:54:59",
  "fullText": "I have seen many fine productions of Thornton Wilder’s The Skin of Our Teeth. But I can say without hesitation that the current revival at Lincoln Center’s Vivian Beaumont Theater, under the direction of Lileana Blain-Cruz, is the most creative, most emotionally connected, and most urgent staging of the 1943 Pulitzer Prize winner I have ever encountered, or hope to encounter.\n\nWritten during World War II’s early days, when an Allied triumph over the Axis was far from certain and may even have been in doubt, Skin went out on a limb to suggest that the triumph of Right was foreordained. Inevitable. Even more significantly, it dared to do so largely through the medium of chaotic comedy, of the sort Olsen and Johnson had brought to Broadway in low vehicles like Hellzapoppin and Sons o’ Fun. Those comics had chorus girls jumping into patrons’ laps, or the repeated plaintive wail “Chloe! Chloe!,” or a man wandering the aisles with a potted tree that kept getting bigger and bigger. In a similar, fourth-wall-breaking way, the stage manager of Skin steps out to announce that five cast members are out with food poisoning, to be replaced with ringers. Another character asks the audience to hand up its chairs for burning, in order to hold back the encroaching glaciers of the new ice age.\n\nMore about those glaciers in a second. The point is that, as an irreverent, rollicking tribute to optimism, The Skin of Our Teeth is always most of the moment when things are looking bleakest in the world and there seems little to laugh about. Thornton Wilder, meet 2022.\n\nEach of the three acts centers on the Antrobus family of Excelsior, N.J.: father George, an inventor (he came up with the wheel and the lever); mother Maggie (a homebody, and the inventor of the apron); spoiled daughter Gladys; and moody son Henry, who gets mad when anyone mentions his real name (Cain) or his role in the death of elder brother Abel. Throw in Lily Sabina the maid, with echoes of Lilith and the Sabine women, and you have not-so-subtle allusions tying the fate of humanity from the Bible to the present day.\n\nAct One, always the most sprightly, has the family battling intense cold (cf. those glaciers down from Canada). The family pets, a dinosaur and a mammoth, are larger-than-life puppets, genetic ancestors of Joey in the Beaumont’s War Horse with the ability to murmur, “I’m cold.” The moment when they’re banished to certain outdoor death, to make room for refugee humans, carries genuine poignance\n\nAct Two shifts to Atlantic City—America’s Sodom and Gomorrah—during the 5,000th annual convention of the Fraternal Order of Humans, which just elected George its president. Sabina has become a beauty pageant contestant, bringing out her Lilith side and threatening George’s marriage. Then an ear-splitting hurricane warning promises, you guessed it, the Flood, and it’s left to the Antrobuses to sail off with two of every creature.\n\nLincoln Center takes its one intermission here, with time to reflect on the excellences thus far: the puppetry for sure, credited to James Ortiz; Adam Rigg’s flashy yet seedy boardwalk setting; spectacular sound effects from Palmer Hefferan; and the sturdy performances by the principals, notably Gabby Beans as Sabina. That part has to carry both acts on her slim shoulders, and in 1943 the larger-than-life diva Tallulah Bankhead triumphed, director Elia Kazan having cast her famously against type. Beans, in her Broadway debut, is an Eartha Kitt rather than a Tallulah: seductive and sensible by turns, a tiger who can turn pussycat at will. I don’t know whether a leading role in a Lincoln Center revival can carry the oomph necessary to be a star-maker, but I have a hunch Beans’ future star status is pretty secure.\n\nStill, the test of the play is Act Three, with its drastic tonal shift to grief. The Antrobus home and the landscape have been razed. A war, likely civil, has just ended; you can practically smell the decay of burning flesh through Yi Zhao’s dramatic, hazy lighting. Father and son have fought on opposite sides, George with the regular army, Henry/Cain with the defeated insurgents, and there must be a reckoning. And here’s where the already fine performances reach their peak. James Vincent Meredith’s George, cluelessly avuncular in Act One, then randy in Act Two, rises to the mournful level of Biblical patriarch as he takes his son’s sins unto himself. The malevolence of Julian Robertson, as Henry, is transformed suddenly into sorrow and shame. Roslyn Ruff’s matriarch, unbowed throughout, becomes downright majestic here, bringing along Paige Gilbert’s now-glowing Gladys, who has given birth and is thus the true holder of the future’s promise. The pageant of the citizenry returning home from the wars, trudging up the burnt hills against the back wall stage right to stage left, is something I will never forget: a tableau of weary defeat, to be sure, but one of indomitability as well. And when Beans’ Sabina begins Act One all over again—in rags this time—we feel the uplift. This is where we, and humanity itself, came in.\n\nBlain-Cruz’s command of all the play’s elements, from physical scope to character intimacy, never falters. (I really look forward to what else she has in store in her Lincoln Center leadership role.) And here I realize, with some surprise, that up to now I have had absolutely no need to mention what to many will be this production’s signal innovation, the entirely non-Caucasian cast of 28.\n\nNot that the multicultural emphasis is meaningless. Of course people of color have had a particularly tough time of it across the entire human comedy, and the redoubtable playwright Branden Jacobs-Jenkins (An Octoroon) has been enlisted to tweak Wilder’s script accordingly. (When great past philosophers are cited, for instance, a quote by Plato has been replaced by a stinging passage from bell hooks.) And of course it’s a cause for celebration that so many actors of color are given such a prominent showcase. That shouldn’t be remarkable, and the hope is that, going forward, it will be routine.\n\nBut what’s fascinating to discover is that the casting approach serves to make The Skin of Our Teeth more universal, rather than more specific or even more parochial. Identification with the Antrobuses proves to be a piece of cake, regardless of race or ethnicity, as long as the roles are played as superbly as they are here. This casting coup serves notice that we are, indeed, one family of man.\n\nThe Skin of Our Teeth opened April 25, 2022, at the Vivian Beaumont Theater and runs through May 29. Tickets and information: lct.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars"
}
