{
  "showId": "the-skin-of-our-teeth-2022",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "https://newyorktheater.me/2022/04/25/the-skin-of-our-teeth-broadway-review/",
  "playbillVerdictUrl": "https://newyorktheater.me/2022/04/25/the-skin-of-our-teeth-broadway-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Director Lileana Blain-Cruz has assembled a terrific design team, most of whom are making spectacular Broadway debuts. These include: Set designer Adam Rigg, who creates a convincing suburban home during an encroaching Ice Age, then the Atlantic City complete with rollercoaster and neon signs (one of which becomes cleverly R-rated) right before The Great Flood, then a burnt out suburban home after the devastating war. Projection designer Hannah Wasileski, who begins each of the three acts with elaborate newsreel like 'News Events of the World' videos that are a fit visual accompaniment to the loopy narration James Ortiz, who designs and directs the life-sized dinosaur and woolly mammoth in Act 1. It would do these extinct species a disservice to call them mere puppets. When the dinosaur slinks into the Antrobus household and says 'It's cold,' your heart will melt. The design helps establish the rich, bizarre juxtapositions of the play, between the everyday and the cosmic, between playfulness and resilience.",
  "bwwScore": 9,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-SKIN-OF-OUR-TEETH-Opens-On-Broadway-20220425",
  "showScoreExcerpt": "The Skin of Our Teeth” is a timely play. It is also an acclaimed play…  But the main reason to see the new Broadway revival of it is because it’s fun. Director Lileana Blain-Cruz has assembled a terrific design team, most of whom are making spectacular Broadway debuts… The design helps establish the rich, bizarre juxtapositions of the play, between the everyday and the cosmic, between playfulness and resilience.\n\nRead more"
}