{
  "showId": "the-skin-of-our-teeth-2022",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Diep Tran",
  "url": "https://www.newyorktheatreguide.com/reviews/the-skin-of-our-teeth-broadway-review",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "The dinosaur earned its entrance applause. Thornton Wilder's play The Skin of Our Teeth, a fantastical tragicomedy about the end of the world, calls for a dinosaur and a woolly mammoth. Typical productions have actors donning animal costumes. But the new Broadway revival of The Skin of Our Teeth goes full Jurassic Park (with the budget to match), with a gigantic brontosaurus, puppeteered by three people, lumbering onto the stage. A two-person-controlled woolly mammoth follows closely behind. These formidable, playful puppets (designed by James Ortiz) inspired gasps of shock and delightful laughter in the audience the night I went. Unfortunately, the dinosaur comes in at the beginning of this three-hour production, and the play struggles in the wake of its long tail.",
  "bwwScore": 6,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-SKIN-OF-OUR-TEETH-Opens-On-Broadway-20220425",
  "fullText": "The dinosaur earned its entrance applause. Thornton Wilder's play The Skin of Our Teeth, a fantastical tragicomedy about the end of the world, calls for a dinosaur and a woolly mammoth. Typical productions have actors donning animal costumes. But the new Broadway revival of The Skin of Our Teeth goes full Jurassic Park (with the budget to match), with a gigantic brontosaurus, puppeteered by three people, lumbering onto the stage. A one-person-controlled woolly mammoth follows closely behind. These formidable, playful puppets (designed by James Ortiz) inspired gasps of shock and delightful laughter in the audience the night I went. Unfortunately, the dinosaur comes in at the beginning of this three-hour production, and the play struggles in the wake of its long tail. At first glance, a revival of The Skin of Our Teeth makes sense. The play is an allegory about an American nuclear family — the Antrobuses of Excelsior, New Jersey — going through multiple extinction-level events: an ice age, an Old Testament-style global flood, and a war. And through it all, the family stays together and survives — it's the end of the world as we know it, and the Antrobuses feel fine. Wilder wrote this three-act play in the years leading up to World War II (it premiered on Broadway in 1942 starring Tallulah Bankhead as the Antrobuses' hysterical, hilarious maid Sabina). Considering the multiple global crises we are collectively going through (climate change, a pandemic, threat of World War III), 2022 feels like the ideal time to revive The Skin of Our Teeth. And when Lileana Blain-Cruz was announced to direct in her Broadway debut, it seemed like an artistic no-brainer. Blain-Cruz is one of Off-Broadway's most in-demand directors for her remarkable ability to take ungainly, ideas-laden, experimental plays and find the beating heart at their center, while grabbing the audiences by the guts. The Skin of Our Teeth is one such play. It's filled with Brechtian fourth-wall breaks, characters from the Bible, and philosophical musings on the nature of existence. Blain-Cruz and Wilder, two different generations of experimental theatre artists, seem like the perfect marriage of work and artist. So it is truly surprising that here, the end of the world seems fairly routine. Blain-Cruz has casted Black actors as the Antrobuses, making The Skin of Our Teeth not just about the resilience of humanity, but particularly the resilience of the Black community. Roslyn Ruff (another experimental theater virtuoso) gives a well-modulated performance as Mrs. Antrobus. She is able to find the sensitive, maternal woman in the broadly drawn housewife archetype, and her comic timing and side-eye are razor-sharp. The glory role in The Skin of Our Teeth belongs to Gabby Beans as Sabina. Her eyes are wide in a state of perpetual surprise, and Beans starts off speaking in a voice I can only describe as campy Eartha Kitt. She then effortlessly modulates both her voice and mannerisms between the stylized Sabina and more realistic moments when she directly addresses the audience as an actress, such as when she remarks, \"I'll say the lines, but I won't think about the play. And I advise you not to think about the play, either.\" Beans is so enjoyable to watch that when she leaves, you keep longing for her to come back. Playwright Brandon Jacobs-Jenkins, who is also a wunderkind of messy plays that break the fourth wall, is credited as contributing \"additional material.\" Those materials are mainly updates to the cultural references, such as a shoutout to August Wilson and a moving tribute in the third act to bell hooks. Watching The Skin of Our Teeth, I keep longing for Jacobs-Jenkins, one of the best playwrights of his generation, to make his Broadway debut in something that better showcases what he's capable of. While this Skin of Our Teeth is sumptuously presented, with three massive sets by Adam Rigg (including an entirely gratuitous but attention-pulling carnival slide in Act II), the spectacle also serves as a crutch and distracts from the urgency in the text. In Act II, set in Atlantic City, Broadway legend Priscilla Lopez plays the Fortune Teller. Her voice is amplified and warped as if she's the voice of God. But the amplification has the unfortunate effect of obscuring what she is actually saying. When the Antrobuses scramble onto a boat as the flood is coming, Lopez shouts, \"Start a new world. Begin again.\" But her words are swallowed up by the chaos around her, and the effect is lost. Even as the alarms sound, the racially diverse ensemble is still dancing, making the message even more muddled. Is the audience supposed to be afraid for them? Or comforted that at least they're meeting their end in style? It's chaos with no coherence. For a play about the end of the world, there's also a surprising lack of tension here. The Skin of Our Teeth shouldn't just feel like the apocalypse; it should also feel like a theatre troupe putting a play together that keeps going haywire, where a strong wind could knock the production off its axis at any moment. And like their characters, the actors must persevere by, well, the skin of their teeth. But in Act One, when the walls of Antrobus's home are meant to crash around them, the set is just lifted cleanly in half. It reads less as things falling apart and more as a planned scene transition. The ground never feels off-kilter; it's too solidly constructed. The Skin of Our Teeth seems to find its footing in Act III, in a quiet moment free from distraction, when Mr. Antrobus (James Vincent Meredith, who struggles with Wilder's stylized dialogue) says to his wife, \"Maggie, we've come a long ways. We've learned. We're learning.\" As this production of The Skin of Our Teeth progresses, hopefully those working on it will learn to trust in the text, and be less reliant on bells, whistles, and dinosaurs. The Skin of Our Teeth is at the Vivian Beaumont Theater through May 29. Get The Skin of Our Teeth tickets on New York Theatre Guide. Photo credit: Julian Robertson, Roslyn Ruff, and Paige Gilbert in The Skin of Our Teeth. (Photo by Julieta Cervantes) Originally published on Sep 29, 202209:12",
  "isFullReview": true,
  "textWordCount": 1039,
  "archivePath": "data/archives/reviews/the-skin-of-our-teeth-2022/nytg--diep-tran_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:06:28.492Z",
  "originalScore": "2/5",
  "originalScoreNormalized": 40,
  "scoreSource": "numeric-stars",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 1039,
  "tierReason": "Full review text"
}