{
  "showId": "the-skin-of-our-teeth-2022",
  "outletId": "observer",
  "outlet": "Observer",
  "criticName": "David Cote",
  "url": "https://observer.com/2022/04/review-director-lileana-blain-cruz-brings-the-skin-of-our-teeth-to-a-modern-audience/",
  "playbillVerdictUrl": "https://observer.com/2022/04/review-director-lileana-blain-cruz-brings-the-skin-of-our-teeth-to-a-modern-audience/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Looking at the big picture, this gorgeous monster of a production brings together two urgent trends in theatrical discourse today: casting reparations by creating Black space in the white canon and also, embracing a sprawling meta-drama that feeds a hunger for stories that are not merely sociological but cosmological. We know that patriarchy, greed, and white supremacy have spawned misery across ages; without pretending they have the solution, theater artists can find deep bass strings of commonality to pluck. For me, The Skin of Our Teeth is a boisterous hymn to humanity, the most moving and inspiring work of the season. Even so, Skin won't be to everyone's taste. There are tonal fumbles in the second act-the French accent laid on a bit thick, Priscilla Lopez's Fortune Teller too wispy, the chaos before the flood overly manic-but I think a certain degree of failure has always been baked into this idiosyncratic classic. Yes, It's long and taxing on the brain, but the exhaustion you feel while leaving has the afterglow of exhilaration. We survived this speeding glacier, this world-drowning deluge of a play; we're spent and dazed; but isn't life a miracle, and aren't you glad for tomorrow?",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-SKIN-OF-OUR-TEETH-Opens-On-Broadway-20220425",
  "showScoreExcerpt": "\"Today, no less than in 1942, we have to take a breath and acknowledge that Wilder is taking big, prophetic swings in the theater: intercutting the sort of family tragedy Arthur Miller had yet to write with miracle plays from five centuries previous, spiced with quotes from the Bible, the Iliad, Aristotle and other philosophers. Coming out of a pandemic, in a politicized theater environment, one cannot understate how refreshing it is to see a play that thinks big about the long arc of world history with Wilder’s blend of whimsy and pessimism.\"\n\nRead more"
}