{
  "showId": "the-skin-of-our-teeth-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Ayanna Prescod",
  "url": "https://variety.com/2022/legit/reviews/the-skin-of-our-teeth-review-broadway-1235240292/",
  "playbillVerdictUrl": "https://variety.com/2022/legit/reviews/the-skin-of-our-teeth-review-broadway-1235240292/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Thornton Wilder's allegorical play \"The Skin of Our Teeth\" is bizarre, abstract and convoluted; it's not to be taken seriously. Or so Sabina (Gabby Beans) tells the audience at Lincoln Center Theater's Broadway revival of the 1942 Pulitzer Prize-winning play by Thornton Wilder. But don't listen to her: There are definitely things to take seriously here, as the themes of this 80-year-old work, courageously but unevenly directed by Lileana Blain-Cruz, remain relevant and vital to be reckoned with by contemporary audiences.\n\nThe play is organized around a mystifying philosophical concept. The follow-up to Wilder's other Pulitzer Prize winner \"Our Town,\" \"The Skin of Our Teeth\" is a three-act lesson on survival and the ability to start anew. In this modern telling with a (nearly) all-Black cast (a rarity for productions of this play), the story follows an immortal family's 5000-year journey through a never-ending cycle of disasters — an ice age, a great flood and a devastating war.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nAcross three acts, the Antrobus family — led by George (James Vincent Meredith) and Maggie (Roslyn Ruff) with their two children Henry (Julian Robertson) and Gladys (Paige Gilbert) and their maid Sabina in tow — navigates three different, stressful moments in a fanciful version of history. As played by Beans, Sabina leads the audience through the difficult text with high-brow comic flair and ample sass, often breaking the fourth wall to remind us she is just as bewildered by this play as we are.\n\n“The Skin of Our Teeth” is filled with loose biblical references, and even the play's title is taken from a line in the Bible (Job 19:20): \"My bone cleaveth to my skin and to my flesh, and I am escaped with the skin of my teeth.\" Remaining on brand — and in the good book — the Antrobus family and their whimsical pet dinosaur and mammoth (monstrously played by puppeteers Jeremy Gallardo, Beau Thom, Alphonso Walker Jr. and Sarin Monae West) are introduced dealing with a Cain and Abel situation in which Henry (formerly named Cain) has murdered his brother, leaving the family to sort out the repercussions while the Ice Age approaches. In Act II, allusions to Sodom, Gomorrah and Noah's ark are transplanted to the boardwalk of Atlantic City for George's election as president of the Fraternal Order of Mammals and his foray into infidelity. In the final act, the Antrobus family is thrust into a violent and chaotic postwar civilization which threatens their very lives. Through it all, the clan must learn how to adapt and survive.\n\nThe events of the play are chaotic, but in this production they connect to the chaos of the here and now in ways that left me bewildered and a little frazzled. The show jolts from one act to the next with little ease. How do we get from Excelsior, New Jersey to Atlantic City and back? One moment Mr. Atrobus is inventing gadgets and taking in refugees, and in the blink of an eye (or at least over the course of an intermission) he's addressing a crowd at a carnival some eons later. Using one family to represent the entirety of humanity feels like Wilder shortchanged his audience in clarity and cohesion. Living through rising temperatures, pollution, a global pandemic and an unjustifiable war in the Ukraine didn’t help me find resonance in the play's nebulous plot or broad philosophical themes.\n\nAt the performance I attended, other audience members, too, could be overheard whispering to each other for help in understanding what was — or wasn't — going on. For many of us, Adam Rigg's opulent dreamscape set and the salted pretzels and rainbow jelly beans given out at intermission were the only sprinkles of sweetness this production offered.\n\nIn the end the family discusses how civilization might rebuild, or if it is even wise to do so. The play closes with Sabina dusting the living room as she had done in the beginning and recites the same dialogue. The circle is complete, burned to the ground by fire, and will soon begin anew. Maybe Wilder is telling us it's impossible to make sense of it all; instead we must try just to live.",
  "isFullReview": true,
  "textWordCount": 722,
  "archivePath": "data/archives/reviews/the-skin-of-our-teeth-2022/variety--ayanna-prescod_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:02:19.212Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 722,
  "tierReason": "Full review text"
}