{
  "showId": "a-christmas-carol-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2022/11/21/a-christmas-carol-jefferson-mays-gift-wraps-charles-dickens-astonishingly-so/",
  "publishDate": "2022-11-21T20:23:57",
  "fullText": "“It’s comin’ on Christmas, they’re cuttin’ down trees,” Joni Mitchell sings in her wonderful “River,” and then goes on observing that “they’re puttin’ up reindeer, singin’ songs of joy and peace.”\n\nShe might just as well have included that they’re reading and rereading aloud A Christmas Carol, Charles Dickens’ classic 1843 novella, the full title of which is A Christmas Carol. In Prose. Being a Ghost Story of Christmas.\n\nSurely, a Yuletide doesn’t go by and hasn’t for something like 180 years when someone or, more likely, someones isn’t/aren’t reciting the tale of miserly Ebenezer Scrooge, who, visited by the ghosts of Christmas Past, Present and Future on Christmas Eve, realizes the cruel error of his ways and for the rest of his long life becomes the very spirit of the season.\n\nWith not too much arm-twisting needed, Dickens himself is undoubtedly called on annually to recount the tale for the multitudes up there in heaven. And every year new voices are certainly raised in celebration of Dickens’s deathless as well as life-enhancing and endearingly sentimental prose.\n\nThis year add Jefferson Mays to the ever-lengthening list. Having prepared his version for some time, he’s now brought it to Broadway – and magnificently.  In the beloved story, Scrooge’s nephew encourages the “wiry” old man to keep Christmas joyfully. In reply, the “wretched” money-lover says, “Keep Christmas in your own way, and let me keep it in mine.”\n\nMays keeps it in his way, doing so with co-adapters Susan Lyons and Michael Arden, production conceivers Arden and scenic designer Dane Laffrey, director Arden, lighting designer Ben Stanton, sound designer Joshua D. Reid, projection designer Lucy Mackinnon, and hair, wig, and makeup designer Cookie Jordan.\n\nWhat the endlessly imaginative group has created is a Christmas present so big it wouldn’t even fit under the storys-tall tree in Rockefeller Center. It requires much more capitalization than something like famous Christmas Carol-presenting Simon Callow standing at a lectern. Which is an observation meant to emphasize that the must-see package may not show up everywhere (or anywhere?) other than large houses where pounds and shillings flow.\n\nSo, even more reason to see Mays’ performance this December (and New Year’s Day), a turn that must rank as highly as any Christmas Carol performances ever offered here.\n\nHardly new to soloing, Mays appeared in this outing at Los Angeles’ Geffen Playhouse in 2020 and took home a best actor award. Even more to the point, he first made himself widely known for his 2003 solo performance in Doug Wright’s I Am My Own Wife, winning the Tony once it had transferred from Playwrights Horizons to Broadway.\n\nAs vital as he has ever been on stage, perhaps more so – he’s here having left The Music Man revival where he played the much less energetic River City mayor – the benevolent Mays goes about his tireless self-made assignment wearing tradition Victorian businessman garb he never changes.\n\nMuch else does change, though, as Mays gads about the stage serving Dickens honorably while speaking as Scrooge, as the three chiding spirits, and as everyone else the old chiseler encounters in revisiting his past, present, and possible future.\n\nMays says he voices 50 characters. He’s all over the place, his timbres amusingly vacillating, as furniture comes and leaves on a rarely halting turntable. The moods through which he ventures seem innumerable, though were anyone inclined to take on the task, they probably could be enumerated and thus add weight to the actor’s enthralling accomplishment.\n\nAdapters Lyons, Arden, and Mays often focus on longer sequences, each worth the attention. The most convivial occurs when the chastened Scrooge accepts his nephew’s invitation to Christmas dinner, sits down at a beautifully appointed table, and joins the cheerful conversation.\n\nThat gleaming table is just one of the many visual treats constantly arriving according to the productions unceasing theatrical magic, (That’s other than the visual and aural treat Mays is throughout.) If there’s a single inspired example – kudos primarily to designer Laffrey? – it’s the representation of a wrought iron fence featuring an open gate to either a cemetery or to the famed pearly ones.\n\nAbove the gate, there’s a wrought iron greeting – in Latin, of all hardly dead languages. It repeats Tiny Tim’s “God bless us, every one.” It’s incentive enough to cause a grateful reviewer to wish a blessing on this miraculous new presentation of Charles Dickens’ A Christmas Carol.\n\nA Christmas Carol opened November 21, 2022, at the Nederlander Theatre and runs through January 1, 2023. Tickets and information: achristmascarollive.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "show-score-playwright"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "showScoreExcerpt": "\"It’s incentive enough to cause a grateful reviewer to wish a blessing on this miraculous new presentation of Charles Dickens’ 'A Christmas Carol'.\"\n\nRead more"
}