{
  "showId": "a-christmas-carol-2022",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/a-christmas-carol-review-jefferson-mays",
  "publishDate": null,
  "fullText": "The splendid production of A Christmas Carol starring Jefferson Mays in a solo tour de force gets off with a bang. Suffice it to say that a rousing theatrical effect does its job. It grabs you by the lapels — actually, the eardrums — and commands your complete attention. This show and the actor playing some 50 roles deserve it. Drawn from Charles Dickens’s 1843 classic about transformation, redemption, and the Christmas spirit (in every sense), the adaptation by Mays, Susan Lyons, and director and co-conceiver Michael Arden tells a familiar story. London miser Ebenezer Scrooge goes from signature greediness to goodwill thanks to visitations by ghosts on Christmas Eve. He’s all the better for it, and so are his employee Bob Cratchit and his family, especially frail Tiny Tim. Odds are you know what’s coming in the next scene if not the next line – like Scrooge’s icy remark about his city’s neediest people and the pluses of decreasing the surplus population. Still, the show makes the time-worn classic feel as fresh and invigorating as a new fall of snow. Reprising his star turn from a 2018 run of the show at the Geffen Theatre in Los Angeles, Mays is a one-man wonder. He plays everybody in the story, including a narrator who pops in and out, men, women, ghosts, kids, and stewed potatoes (yes, as in vegetables – while it sounds as nutty as a fruitcake, the moment works like a charm). He has glinting eyes that can veer from endearing to creepy in an instant, a supple voice that jumps up an octave to play young Ebenezer Scrooge’s heartbroken lost love and back down to play his forgiving nephew, and nimble fingers that mischievously wag to summon rambunctious children. My favorite moment: Mays embodies the ghost of Jacob Marley, Scrooge’s long-dead business partner, with just-from-the-grave, lock-jawed perfection. Other ghosts materialize via other forms of theatrical magic. The 90-minute staging is packed with imagination and how-did-they-do-that surprises that get your mind buzzing with questions: Where did that staircase come from? How did Scrooge show up here when he was just over there? Do I hear murmuring in the theatre? Yes, thanks to sound designer Joshua D. Reid. Mentioning any more details would spoil the fun. Conceived by Arden and Dane Laffrey, who designed the evocative set and costumes, this production is a celebration of storytelling. A Christmas Carol revels in theatricality. It dives directly into this iconic tale’s pitch-black heart. It’s no fluke that at times the only illumination is from a single flame. Like Scrooge, we’re meant to grope our way through the shadows before coming out on the other side. As a result, the final scene, lit by Ben Stanton, is all the more transcendent. It’s easy to get a little humbug: Another holiday season, another take on A Christmas Carol. Like other theatrical versions of the classic, this one ends with the same words credited to Tiny Tim – “God bless us, everyone.” But a production this taut and well-told is its own sort of blessing. A Christmas Carol is at the Nederlander Theatre through January 1. Get tickets to A Christmas Carol at New York Theatre Guide. Photo credit: Jefferson Mays in A Christmas Carol. (Photo courtesy of production) Originally published on Nov 21, 202220:30",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Another holiday season, another take on 'A Christmas Carol.' Like other theatrical versions of the classic, this one ends with the same words credited to Tiny Tim...a production this taut and well-told is its own sort of blessing.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 551,
  "archivePath": "data/archives/reviews/a-christmas-carol-2022/nytg--joe-dziemianowicz_2026-02-04.html",
  "textFetchedAt": "2026-02-04T04:41:36.439Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 551,
  "tierReason": "Full review text"
}