{
  "showId": "significant-other-2017",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2017/03/02/theater/significant-other-review.html",
  "publishDate": "March 2, 2017",
  "fullText": "Mr. Harmon has created a character of such specificity and vulnerability that Jordan becomes both deeply particular and instantly recognizable.",
  "isFullReview": false,
  "dtliExcerpt": "Mr. Harmon has created a character of such specificity and vulnerability that Jordan becomes both deeply particular and instantly recognizable.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "The four central performers chart their characters' fraying ties with a graceful, instinctive grasp of the hierarchies and role playing that occur within such relationships. They're at their most poignantly expressive when they're dancing together (in dwindling numbers) at one another's weddings. (Sam Pinkleton deserves credit as the choreographer.) Mark Wendland's multilevel set nicely evokes the sense of a city of myriad dwelling places, to which people retreat in insulated isolation, whether as pairs or singletons. And John Behlmann and Luke Smith drolly fulfill their purposes as the various men in the central characters' lives. But the play's structure, built around an and-then-there-was-one countdown of weddings, can start to feel like a sustained musical vamp with only slight variations. Though Mr. Glick is very good and, I think, rather brave in following Jordan's path from adorable to irritating, his company does start to pall after a certain point.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mr. Harmon has created a character of such specificity and vulnerability that Jordan becomes both deeply particular and instantly recognizable.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (20 words)",
  "textQuality": "truncated",
  "playbillVerdictUrl": "https://www.nytimes.com/2017/03/02/theater/significant-other-review.html",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews"
  ],
  "bwwScore": 7
}
