{
  "showId": "significant-other-2017",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2015/06/19/theater/review-in-significant-other-a-young-man-pines-as-his-pals-pair-off.html?_r=0",
  "publishDate": null,
  "fullText": "https://www.nytimes.com/2015/06/19/theater/review-in-significant-other-a-young-man-pines-as-his-pals-pair-off.htmlGive this articleGive this articleGive this article12Advertisement\n\nJordan Berman, the hapless but lovable protagonist of Joshua Harmon’s entirely delightful new play, “Significant Other,” seems to see tiers of tulle, sprays of baby’s breath and ill-fitting bridesmaids’ gowns wherever he looks. While Jordan’s romantic life consists of a stalkerish crush on a co-worker that carries little promise of fulfillment, his longtime girlfriends are moving into firm relationships leading to walks down the aisle. Jordan, loyal friend that he is, can only watch in smiling support and increasing loneliness as the bubbling urban life he has led with his friends turns into a series of archived Instagram moments before his watering eyes.\n\nMr. Harmon, the author of the scabrous “Bad Jews,” has fulfilled the promise of that play — and then some — with this tenderly unromantic romantic comedy about a gay man aching for love in the 20-something years, when that ache cuts down to the bone. The play, which opened on Thursday at the Laura Pels Theater in a Roundabout Theater Company production directed with nimble grace by Trip Cullman, is as richly funny as it is ultimately heart-stirring.\n\nWriting with a buoyancy belying the play’s undertow of sadness, Mr. Harmon acutely captures that perilous period in young adulthood when friends from college and work begin paling into mere acquaintances. The besties you chatted with almost every day begin pairing off with other people (some you like, some you don’t) and receding into the distance, not entirely but quite perceptibly. Suddenly there’s only the occasional dinner or text exchange to stir the cooling embers of a once-blazing friendship.\n\nJordan is portrayed with wonderful emotional elasticity by Gideon Glick (seen at the Roundabout Underground in “Speech and Debate”). He ricochets from scenes of giddy gushing about the new guy at work, Will (John Behlmann), whose body he rhapsodizes about after a weekend pool party, to haunted monologues about his fear of ending up alone, bereft of the companionship of the three friends who mean the most to him.\n\n“I actually think it’s pretty simple: find someone to go through it with,” he says to his closest girlfriend, Laura (a nicely dry Lindsay Mendez). She replies that he makes it sound easy, but Jordan demurs: “No, that’s the hardest part. Walking around knowing what the point is, but not being able to live it, and not knowing how to get it, or if I ever even will.”\n\nThe impending marriage of the blowzy, filter-free Kiki, played with a touch of crass by Sas Goldberg, forms the background to the opening scenes. Jordan hasn’t been to a wedding since he was a kid, but he and their mutual friends, Laura and Vanessa (Carra Patterson) will dutifully schlep to Kentucky for Kiki’s, even though none of them are particularly delighted with her choice of man. When Jordan half-jokes that at least he doesn’t verbally abuse her, Laura wryly retorts, “It would be really hard to verbally abuse somebody who talks as much as Kiki.”\n\nSo now there are three unmarried musketeers, but things begin to change when Vanessa, who has been dating a married older man on and off, meets a new guy at Kiki’s wedding. Jordan and Laura playfully pledge that they will wed each other, if need be, joking about choosing an ironic wedding song, although when Laura suggests Whitney Houston, Jordan soberly responds: “Whitney. Is not. Ironic.”\n\nSprinkled throughout the play are scenes of Jordan visiting his beloved grandmother, played with unsentimental grace by Barbara Barrie. (The sleek set, by Mark Wendland, whisks us easily among the play’s diverse locations.) A perceptive and poignant point of connection between Jordan and his grandmother is the unspoken idea that at certain junctures in life, you lose your friends — from marriage, or worse, of course, death. “How’s your social life?” she asks him gently at the beginning of each visit, meaning, they both know, any special guy in your life? But Jordan has little to report.\n\nThe concept of career-oriented young women turning into Bridezillas is not in itself fresh, but Mr. Harmon’s writing is so witty and insightful that even the jokes about bridesmaids’ dresses feel revivified. (In any case, he doesn’t push the wedding-horror tales too far.) The heart of the play is Jordan’s floundering attempts to find the right guy, at which he is comically inept.\n\nHe takes it as a sign of serious hope that Will accepted his friend request on Facebook within 10 minutes — “which means something.” Eventually he works up the courage to ask Will on a movie date, which doesn’t end promisingly, and afterward composes a moony, gee-I-really-like-you email that he reads to his girlfriends, who unanimously and in voices dark with foreboding advise him by no means to send. (Naturally, he does, anyway.)\n\nMr. Glick grounds the comedy in emotional truth. Jordan’s crush on Will may be hopeless — with his looks from an Abercrombie & Fitch shopping bag, Will is the embodiment of the Fire Island-going, gym rat type of gay man whom Jordan (sorry, buddy) could only dream of dating. But who among us has not at some time set our sights on a god, forgetting that they tend to frolic with one another? “I hate being a person,” Jordan says in one of his lowest moments. “I wish I was a rock, you know? Or anything. A salamander. Dental floss. Rain.”\n\nIt’s a funny line, but Mr. Glick invests it with real sadness, a reminder that the burden of wanting love and not having it can make living itself a purgatory. But such is his ebullient charm — and Mr. Harmon’s depiction of his character’s plight — that we in the audience wouldn’t want Jordan to be anyone, or anything, but himself.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Tenderly unromantic romantic comedy about a gay man aching for love in the 20-something years, when that ache cuts down to the bone. The play is directed with nimble grace by Trip Cullman, and is as richly funny as it is ultimately heart-stirring...Writing with a buoyancy belying the play’s undertow of sadness, Mr. Harmon acutely captures that perilous period in young adulthood when friends from college and work begin paling into mere acquaintances.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 961,
  "archivePath": "data/archives/reviews/significant-other-2017/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:12:17.840Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230312220154",
  "archiveOrgUrl": "http://web.archive.org/web/20230312220154/https://www.nytimes.com/2015/06/19/theater/review-in-significant-other-a-young-man-pines-as-his-pals-pair-off.html?_r=0",
  "wordCount": 961,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-07T05:25:41.845Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about an off-Broadway production at the Laura Pels Theater, not the current Broadway run.; kimi: This review covers the 2015 off-Broadway production at the Laura Pels Theater (Roundabout's off-Broadway venue), not the 2017 Broadway transfer at the Booth Theatre.",
  "promptVersion": "5.2.0"
}
