{
  "showId": "patriots-2024",
  "outletId": "am-new-york",
  "outlet": "AM NEW YORK",
  "criticName": "Matt",
  "url": "https://www.amny.com/entertainment/theater/patriots-examines-the-rise-of-putin-and-pals/",
  "publishDate": "April 23, 2024",
  "fullText": "Considering that his track record includes biographical dramas about contemporary historical figures such as Richard Nixon (“Frost/Nixon”) and Queen Elizabeth (“The Queen,” “The Audience,” and “The Crown”), it should come as no surprise that British playwright and screenwriter Peter Morgan would pen the first Broadway play about Vladimir Putin.\n\n“Patriots,” which comes to Broadway following a London debut in a seamless, tech-savvy production by Rupert Goold (“Ink,” “American Psycho”) is an action-packed, engaging saga that follows Putin’s rise to power, going from Deputy Mayor of St. Petersburg, to Prime Minister, to President of Russia following the sudden resignation of Boris Yeltsin on the eve of the new millennium.\n\nThat being said, Putin (Will Keen, intentionally odd, icy and enigmatic) is only a supporting character in “Patriots,” which is primarily about the rise and fall of Boris Berezovsky (Michael Stuhlbarg), an eccentric math prodigy who became an overnight billionaire during Russia’s chaotic 1990s, as state property was privatized following the collapse of the USSR, and who played a key role in Putin’s advancement.\n\nBut while Berezovsky and his business partner, fellow oligarch Roman Abramovich (Luke Thallon), initially believed that the socially-awkward, seemingly compliant Putin would act as their puppet, as recent history shows, Putin instead wielded and consolidated power, causing Berezovsky to flee to London, where he lived until he died in 2013 under questionable circumstances.\n\nAlso depicted is Alexander Litvinenko (Alex Hurt), a Russian security officer who later became a prominent critic of Putin and who died in 2006 of radiation poisoning. Boris Yeltsin (Paul Kynman) also turns up in a cameo.\n\n“Patriots” brings to mind other engaging English dramas about notorious contemporary figures that were also directed by Goold: “Enron,” which observed Jeffrey Skilling and Kenneth Lay in the breakdown of Enron; “Ink,” about the relationship between Rupert Murdoch and newspaper editor Larry Lamb in the 1960s; and “King Charles III,” which imagined a tumultuous future reign of then Prince Charles in the form of a Shakespearian history play. If you liked those plays, there is a pretty good chance you will also like “Patriots.”\n\nBerezovsky is a showcase character role (an over-the-top individual whose hubris and ambition leads to tragedy for him and countless others) and Stuhlbarg, who is making his first Broadway appearance in almost two decades, gives a high-powered, compelling performance.\n\nOf course, do not look to “Patriots” for reliable historical veracity (after all, this is not a documentary) or to gain an understanding of Putin and his most recent and disconcerting actions in the world. As with “The Crown,” “Patriots” is primarily a source of entertainment – and it succeeds in that regard.\n\nBarrymore Theatre, 243 W. 47th St., patriotsbroadway.com.\n\nRead more: Raekwon to Perform at NYC 4/20 Celebration\n\n\t\t\n\t\n\t\n\n\t\n\n\t\t\n\t\t\n\n\t\t\n\t\t\t\tAbout the Author\n \n\t\t\n\n\t\t\n\t\t\n\t\t\t\t\n\t\n\n\t\n\n\t\n\t\n\t\n\n\n\n\nMore in Theater\n\t Review | &#8216;The Baker&#8217;s Wife&#8217; offers an underbaked performance On Broadway: Theatergoing during the holidays with a kid in tow Review | Transparency turns into tragedy in ‘Oedipus’ update New play &#8216;Everything Is Here&#8217; takes a wild, warm look at aging and &#8216;A Streetcar Named Desire&#8217;\n\n\t\t\t\n        \n\n\t\t\n\t\t\t\n            \n\n\n\n\n\n\n\nThings to do in NYC\n\n\t\n\t\t\n\t\t\t \n\t\t\tPost an Event",
  "isFullReview": true,
  "dtliExcerpt": "“Patriots,” which comes to Broadway following a London debut in a seamless, tech-savvy production by Rupert Goold (“Ink,” “American Psycho”) is an action-packed, engaging saga that follows Putin’s rise to power, going from Deputy Mayor of St. Petersburg, to Prime Minister, to President of Russia following the sudden resignation of Boris Yeltsin on the eve of the new millennium.",
  "originalScore": null,
  "assignedScore": 20,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/patriots/",
  "needsScoring": true,
  "textWordCount": 514,
  "archivePath": "data/archives/reviews/patriots-2024/am-new-york--matt_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:30:22.189Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251210021245",
  "archiveOrgUrl": "http://web.archive.org/web/20251210021245/https://www.amny.com/entertainment/theater/patriots-examines-the-rise-of-putin-and-pals/",
  "scoreSource": "extracted-rating",
  "scoreConfidence": "medium",
  "extractedRating": "4/20"
}