{
  "showId": "patriots-2024",
  "outletId": "deadline",
  "outlet": "DEADLINE",
  "criticName": "Greg",
  "url": "https://deadline.com/feature/broadway-show-reviews-spring-2024-1235866317/",
  "publishDate": "April 22, 2024",
  "fullText": "April on Broadway, to mangle a phrase from a showtune classic, is bustin&#8217; out all over with no fewer than 14 new plays and musicals set to open before the April 25 Tony Award eligibility cutoff date. So crowded are the final weeks of the 2023-24 theater season that three days each will see the openings of two shows, a Broadway rarity.\n\nCheck this page to see Deadline&#8217;s takes. Whether you use this page as a guide or as an invitation to argue, drop by often for the latest on Broadway&#8217;s offerings. And there&#8217;ll be plenty of offerings indeed &#8212; here&#8217;s the schedule of April openings: The Outsiders (April 11), Lempicka (April 14), The Wiz (April 17), Suffs (April 18), Stereophonic (April 19), Hell&#8217;s Kitchen (April 20), Cabaret (April 21), Patriots (April 22), The Heart of Rock and Roll (April 22), Mary Jane (April 23), Illinoise (April 24), Uncle Vanya (April 24), Mother Play (April 25), The Great Gatsby (April 25).\n\nBelow is a compendium of our reviews. Keep checking back as the list is updated.\n\n\n\n\t\t\t\n\t\t\tWatch on Deadline\n\nOpening night: April 24; Press Opening: April 26Venue: St. James TheaterDirector/Choreographer: Justin PeckMusic & Lyrics: Sufjan StevensBook: Justin Peck and Jackie Sibblies DruryCast: Yesenia Ayala, Kara Chan, Ben Cook, Gaby Diaz, Jeanette Delgado, Carlos Falu, Christine Flores, Jada German, Zachary Gonder, Rachel Lockhart, Brandt Martinez, Dario Natarelli, Tyrone Reese, Craig Salstein, Ahmad Simmons, Byron Tittle, Ricky Ubeda, and Alejandro Vargas.Running time: 90 min (no intermission)Official synopsis: \"A company of performers brings the original story to life, set to the entirety of Stevens' album with new arrangements by composer, pianist, and frequent Stevens collaborator Timo Andres, ranging in style from DIY folk and indie rock to marching band and ambient electronics, performed live by an 11-member band and three vocalists. Peck and Pulitzer Prize-winning playwright Jackie Sibblies Drury have crafted an original coming-of-age tale that blends dance, theater, live music and storytelling into a breathtakingly emotional journey.&#8221;Deadline's takeaway: The final Broadway production of this crazy busy 2023-24 season is also one of its most exhilarating: Illinoise is a thrilling and absolutely gorgeous dance celebration of singer-songwriter Sufjan Stevens&#8217; 2005 early-career masterpiece LP Illinois, using a large cast of dancer-actors &#8211; and three excellent singers, along with that extra &#8220;e&#8221; at the end of the show title &#8211; to flesh out the loose story that might (or might not) have stayed hidden in the grooves of the concept album all along.\n\nStevens&#8217; recent personal travails &#8211; a year ago, he lost his partner, Evans Richardson, of many years, and last summer was diagnosed with the debilitating Guillain-Barr&eacute; syndrome &#8211; play no direct role in this new stage work, though there are possible suggestions that Richardson is very much a haunting presence in the loose storylines of the dance-musical hybrid.\n\nBut whether or not Illinoise the stage work, or Illinois the album, are or were autobiographical works is perhaps known only to the press-shy Stevens and his closest collaborators, here Justin Peck (director, choreographer, book) and Jackie Sibblies Drury (book). In the end, it&#8217;s irrelevant: Illinoise, along with Hell&#8217;s Kitchen, Suffs, and Stereophonic infuses the final stretch of this Broadway season with a vitality and ingenuity that&#8217;s worth embracing and celebrating.\n\nStevens&#8217; album was a loosely constructed meditation on the state of Illinois, encompassing both historical footnotes and places (&#8220;Jacksonville,&#8221; &#8220;Decatur,&#8221; the hit song &#8220;Chicago&#8221;), personages (Andrew Jackson, John Wayne Gacy, Helen Keller) and the songwriter&#8217;s own personal history (including, in the song &#8220;The Predatory Wasp of the Palisades Is Out to Get Us!,&#8221; Stevens&#8217; most discussed and debated (among fans) reference to his queer sexuality, a question that was put to rest when Stevens came out publicly last year.\n\nThe stage production &#8211; as much ballet as musical, if not more so &#8211; puts sexuality in less equivocal terms that Stevens&#8217; music ever has. While it&#8217;s a fool&#8217;s game to parse the storyline for biography, a recurring theme of several interconnected dance vignettes depicts the very Stevens-like &#8220;Henry&#8221; (Ricky Ubeda, a former So You Think You Can Dance winner here sporting one of the ball caps that resembles Sufjan&#8217;s trademark trucker cap) crushing on a boyhood pal Carl (Ben Cook, fulfilling the long-suspected topic of &#8220;Predatory Wasp&#8221;) and, later, developing a more mature love for Douglas (Ahmad Simmons). The latter relationship, intentionally or not, is resonant of Stevens&#8217; partnership with the late Evans Richardson.\n\nThe musical&#8217;s structure &#8211; a group of young people come together around a campfire to share the stories that make up Stevens&#8217; 2006 album &#8211; allows for both self-contained numbers and loosely connected ones. Among the strongest of the stand-alones comes with &#8220;Jacksonville,&#8221; in which a nattily dressed Black man from a bygone era tap-dances with a young Black woman given to more hip-hop-inspired moves. A sort of pop-rock pas de deux follows, and it&#8217;s perhaps the first stunner of the evening.\n\nOther highlights of the album are present and accounted for &#8211; &#8220;Casimir Pulaski Day,&#8221; the tragic story of a terminally ill girl; &#8220;They Are Night Zombies!! They Are Neighbors!! They Have Come Back from the Dead!! Ahhhh!&#8221;, in which the title creatures are more about undying political legacies than dirt-covered walking dead (though they are that, too); and &#8220;The Man of Metropolis Steals Our Heart,&#8221; in which Superman, in this telling, shares his powers with us earthlings.\n\nPeck's dances are a joy to observe, with sweeping movements sharing space with small gestures that convey Stevens&#8217; storytelling even without being overly literal. Adam Rigg&#8217;s set design &#8211; a mash-up of rural Illinois fields and Chicago-New York urban detritus &#8211; works beautifully with Brandon Stirling Baker&#8217;s lovely lighting design in which hand-held orb-shaped lights work multiple wonders throughout the production&#8217;s fleeting 90 minutes.\n\nOpening night: April 25Venue: The Hayes TheaterDirector: Tina LandauWritten By: Paula VogelCast: Celia Keenan-Bolger, Jessica Lange, Jim ParsonsRunning time: 1 hr 45 min (no intermission)Official synopsis: \"It's 1962, just outside of D.C., and matriarch Phyllis is supervising her teenage children, Carl and Martha, as they move into a new apartment. Phyllis has strong ideas about what her children need to do and be to succeed, and woe be the child who finds their own path. Bolstered by gin and cigarettes, the family endures — or survives — the changing world around them. Blending flares of imaginative theatricality, surreal farce, and deep tenderness, this beautiful rollercoaster ride reveals timeless truths of love, family, and forgiveness.&#8221;Deadline's takeaway: Jessica Lange returns to the Broadway stage with a sensational performance in Paula Vogel&#8217;s The Mother Play (subtitle: A Play In Five Evictions), an autobiographical memory play that brings the queer undertones of The Glass Menagerie into full light. Co-starring Celia Keenan-Bolger and Jim Parsons as gay siblings who crash headlong into the determined expectations of their tyrannical, boozy and forever rigid single mom Phyllis (Lange), Mother Play hits some beats that out-Tennessee even Mr. Williams.\n\nThe dramedy &#8211; much of this wrenching play is genuinely funny, including a running joke about the cockroaches that seem to follow the small family from one crummy apartment to the next &#8211; brings a careful balance to the familial triumvirate: Narrated by Keenan-Bolger&#8217;s Martha (the author stand-in), we get vivid portraits of the individuals as well as their relationships to one another.\n\nSpanning decades (1964 to the early 2000s), Mother Play is at its best when showing the sibling&#8217;s camaraderie and protectiveness as they endeavor to survive, maybe even thrive, under the cruel dominance of mommie dearest. Long periods of estrangement are followed by too-brief rapprochements &#8211; until they aren&#8217;t. Anyone who knows Vogel&#8217;s biography (or her wonderful autobiographical 1992 play The Baltimore Waltz) knows the tragedy that awaits Carl. Few might see Phyllis&#8217; ultimate cruelty coming.\n\nPlayed out on David Zinn&#8217;s fantastically pliable set that morphs into one apartment after another, Mother Play, so insightfully directed by Tina Landau, uses the cramped rooms to suggest both stifling claustrophobia and, when three people dwindle to one, excruciating loneliness. In a roughly 10-minute, wordless solo scene, Lange&#8217;s Phyllis wanders the now empty rooms, busying herself while suffering the inevitable consequences of utter self-involvement. Lange holds the stage for every last second of the scene, doing what might seem impossible: The monster, she shows us, is human after all, and maybe even worthy of the grace Vogel offers.\n\nOpening night: April 24Venue: Vivian Beaumont TheaterDirector: Lila NeugebauerWritten By: Anton Chekhov, new version by Heidi SchreckCast: Steve Carell, William Jackson Harper, Jonathan Hadary, Jayne Houdyshell, Spencer Donovan Jones, Mia Katigbak, Alfred Molina, Alison Pill, Anika Noni Rose.Running time: 2 hr 45 min (including intermission)Official synopsis: \"Sonya and her uncle Vanya have devoted their lives to managing the family farm in isolation, but when her celebrated, ailing father and his charismatic wife move in, their lives are upended. In the heat of the summer, the wrong people fall in love, desires and resentments erupt, and the family is forced to reckon with the ghosts of their unlived lives. &#8220;Deadline's takeaway: Steve Carell makes a solid Broadway debut in a fine, if not overly inspired, new revival of Chekhov&#8217;s Uncle Vanya. Smoothly adapted by What The Constitution Means To Me playwright Heidi Schreck and elegantly directed by Lila Neugebauer (demonstrating once again, after this season&#8217;s excellent Appropriate, a kinetic crossing-guard facility for keeping large-ish casts moving on spacious sets), this Lincoln Center Theater production places Chekhov&#8217;s tale of wasted lives and tenuous optimism amidst a contemporary setting.\n\nCarell plays Vanya, the middle-aged man who has spent an unfulfilling life tending &#8211; along with his niece Sonya (Alison Pill) &#8211; the family farm owned by the well-to-do brother Alexander (Alfred Molina) of Vanya&#8217;s late sister.\n\nWhen the brother-in-law and his beautiful new young wife Elena (Anika Noni Rose) arrive for an extended visit, their presence &#8211; and some news &#8211; upset the entrenched, unsatisfying lives of Vanya, Sonya, Vanya&#8217;s aging mother Maria (Jayne Houdyshell), servant Marina (Mia Katigbak), friend Waffles (Jonathan Hadary)  and the local doctor Astrov (William Jackson Harper) who is loved by Sonya but loves Elena.\n\nVanya, too, loves the lovely, if mercenary, Elena. As confidences are shared, alliances bruised and agendas revealed, the upheaval has everyone questioning &#8211; lamenting, even &#8211; their compromises and disappointments of their lives.\n\nThe cast, particularly Harper as the besotted alcoholic doctor, gets at the heart and soul of Chekov&#8217;s longing worldview, and Schreck&#8217;s decision to move the action from 19th Century Moscow to an indeterminately contemporary America accomplishes what seems to be the primary goal of showcasing both the universality of Chekhov&#8217;s existential angst and his alarm over an ever-worsening environmental situation. Still, some plot specifics don&#8217;t really translate. Being stuck down on the farm just isn&#8217;t what it used to be.\n\nOpening night: April 22Venue: James Earl Jones TheatreDirector: Gordon GreenbergMusic & Lyrics: Huey Lewis and The NewsBook: Jonathan A. Abrams; Story by Tyler Mitchell & AbramsChoreography: Lorin LatarroPrincipal Cast: Corey Cott, McKenzie Kurtz, Josh Breckenridge, F. Michael Haynie, Zoe Jensen, Tamika Lawrence, Raymond J. Lee, John-Michael Lyles, Orville Mendoza, Billy Harrington Tighe and John Dossett.Running time: 2 hr 30 min (including intermission)Official synopsis: &#8220;Set in 1987, The Heart of Rock and Roll centers on a couple of twenty-somethings on the cusp of their futures &#8211; Bobby, a rock and roller who's traded his guitar for the corporate ladder and his boss, Cassandra who's always put the family business first. When they both get a second shot at their dreams, it'll take &#8216;The Power of Love&#8217; and a little help from their friends to figure out what kind of life they really want.&#8221;Deadline's takeaway: For the MTV generation, Huey Lewis was the buddy always up for a good time. Let Michael Jackson innovate, Madonna shock and Cyndi Lauper get the laughs. Huey and his boys in The News were a good hang, with their catchy songs and nice-guy demeanors and clothes just square enough to be hip. Is it any wonder they&#8217;d find their way to a jukebox musical?\n\nDespite a few funny moments and a likable score of Huey&#8217;s hits and album filler (with Curtis Mayfield&#8217;s &#8220;It&#8217;s All Right,&#8221; covered by Lewis in 1985, tossed in as a ringer), The Heart of Rock and Roll is jerry-rigged with a story so silly that only the &#8220;it doesn&#8217;t take itself to seriously&#8221; excuse can save it. In truth, the book, by Jonathan A. Abrams, based on a story he wrote with Tyler Mitchell, should have taken itself much, much more seriously, at least to weed out the the most egregious manipulations (when a long-lost letter from a long-lost dad tumbles out of a much-used guitar case after apparently years of hiding in plain sight, don&#8217;t waste time pondering).\n\nA game cast is led by Corey Cott as a rocker torn between devoting his life to music or a corporate career in a cardboard factory &#8211; the musical sets this up as an actual dilemma. There are some clever sequences &#8211; a dance routine tapped out on bubble wrap, a dream sequence of domestic anti-bliss, with a baby or two or three falling from the skies into waiting arms &#8211;  and a de rigueur love story with a de rigueur smarmy ex-boyfriend villain, but very little holds up to anything beyond its true purpose: to stick together a handful of memorably nostalgic hits with just enough glue to hold audience attention until &#8220;The Power of Love&#8221; or \"Hip to Be Square\" or \"I Want a New Drug\" rolls around. Reachable goal, small accomplishment.\n\nOpening night: April 22Venue: Ethel Barrymore TheatreDirector: Rupert GooldWritten By: Peter MorganPrincipal Cast: Michael Stuhlbarg, Will Keen, Luke Thallon, Stella Baker, Ronald Guttman, Alex HurtRunning time: 2 hr 35 min (including intermission)Official synopsis: \"Set in 1991 after the fall of the Soviet Union, the new Russia belongs to its oligarchs – and no one is more powerful than billionaire Boris Berezovsky. &#8216;If the politicians cannot save Russia,&#8217; he insists, &#8216;then we businessmen must.&#8217; When an eventual successor to President Boris Yeltsin is needed, Berezovsky turns to the little-known deputy mayor of St. Petersburg, Vladimir Putin. But soon Putin's ruthless rise threatens Berezovsky's reign, setting off a confrontation with far-reaching consequences between the two powerful, fatally flawed men.&#8221;Deadline's takeaway: In Patriots, The Crown creator Peter Morgan turns eastward to satisfy his seemingly insatiable curiosity as to the ways of real-world power. Public power, private power, the theories of power and the execution of it &#8211; all fascinate Morgan and, when he&#8217;s in peak form, he turns that obsession into compelling, can&#8217;t-turn-away drama. Patriots, which could very well be viewed as a prequel to Russia&#8217;s criminal invasion of Ukraine, is not peak-form Morgan &#8211; it&#8217;s drama is too static for that, its history too potted &#8211; but give the man credit for drawing back a curtain on a history that could use the sunlight.\n\nStarring a grab-the role-by-the-throat Michael Stuhlbarg as Russian child math-prodigy turned rapacious oligarch Boris Berezovsky and Will Keen as a vampiric Vladimir Putin, Patriots &#8211; directed by Rupert Goold, bringing the declamatory and mixed-media style that he used to greater effect in the Rupert Murdoch bio-play Ink &#8211; details the rise of Russia&#8217;s &#8217;90s-era post-Communist oligarchy, as exemplified by Berezovsky, and how the country&#8217;s new capitalists carried their own seeds of self-destruction right from the start.\n\nIn Berezovsky&#8217;s case, that seed was, not to put too fine a point on it, Putin. The brilliant, greedy Berezovsky, convincing himself that he&#8217;s operating on some level for love of country, installs a young, inconsequential and heretofore failed politico from the hinterlands. No one who is anyone knows Vladimir Putin, which Berezovsky sees as all too perfect: Putin, Berezovsky assures the skeptics, will do just as he&#8217;s told.\n\nOf course, the ruthless Putin wastes little time proving Berezovsky all too wrong. The new president has ambitions of his own &#8211; he, too, fancies himself a patriot &#8211; and by play&#8217;s end has become an outsized Michael Corleone with more than a little polonium up his sleeve.\n\nAs good as Stuhlbarg and Keen are &#8211; and they&#8217;re very good, as are Luke Thallon as oligarch-turned-Putin puppet Roman Abramovic and Alex Hurt as Berezovsky&#8217;s doomed security man &#8211; Patriots never fully conveys the emotional vitality or grand drama &#8211; in short, the Shakespearean &#8211; in the power plays. As history lesson, Patriots is more than worthy. As drama, well, it&#8217;s a history lesson.\n\nOpening night: April 21Venue: August Wilson TheatreDirector: Rebecca FrecknallMusic: John KanderLyrics: Fred EbbBook: Joe Masteroff, based on the play by John Van Druten and stories by Christopher Isherwood.Choreography: Julia ChengPrincipal Cast: Eddie Redmayne, Gayle Rankin, Bebe Neuwirth, Ato Blankson-Wood, Steven Skybell, Henry Gottfried, Natascia DiazRunning time: 2 hr 45 min (including intermission)Official synopsis: \"Willkommen. Bienvenue. Welcome to the Kit Kat Club. Home to an intimate and electrifying new production of Cabaret. Experience this groundbreaking musical like never before. The denizens of the Kit Kat Club have created a decadent sanctuary inside Broadway's August Wilson Theatre, where artists and performers, misfits and outsiders rule the night. Step inside their world. This is Berlin. Relax. Loosen up. Be yourself.&#8221;Deadline's takeaway: From the elaborate (and worth an early arrival) preshow of costumed musicians setting the Weimar mood with klezmer-meets-Brecht/Weill in an August Wilson Theatre reconstructed into a showily decadent in-the-round music hall, Broadway&#8217;s latest Cabaret promises an overwhelming theatrical experience. The promise continues at least through the first appearance of Eddie Redmayne&#8217;s Emcee, crooked and twisted like some slack-stringed marionette.\n\nCabaret, of course, is a musical all but created for reinvention. Ever since Bob Fosse lent his magic to the 1972 film adaptation &#8211; and Liza Minelli let loose with a career-making vocal performance that tossed the Sally-can&#8217;t-sing conceit into the Berlin gutter &#8211; revivalists have attempted to inject ever more decadent trappings, ever more harsh realism and darker foreshadowing of the Hitler-around-the-corner plot. When Natasha Richardson presented a Sally with bruised arms and dead-end prospects back in &#8217;98, the anti-Fosse approach seemed perfected, done and dusted.\n\nBut Rebecca Frecknall and her creative team (most notably scenic and costume designer Tom Scutt) are nowhere near ready to let sleeping Weimar lie. The production flirts with minimalism at some moments &#8211; Gayle Rankin&#8217;s Sally Bowles spends most of the show in what appears to be tattered undergarments and a ratty green fur coat &#8211; only to dazzle with moments of near surreality (as when Redmayne&#8217;s Emcee springs from the floor to sing &#8220;Money,&#8221; dressed as a nightmarish pierrot with skeleton legs).\n\nFor all of Redmayne&#8217;s eccentric posturing and Rankin&#8217;s Courtney Love kinderwhore onslaughts, its the more muted, naturalistic performances of Bebe Neuwirth and Steven Skybell as the unlikely and unlasting lovers Fraulein Schneider and Herr Schultz that carry the emotional heft of this Cabaret. (The less said of Ato Blankson-Wood&#8217;s energy-sucking Clifford Bradshaw, the better).\n\nNone of which is to say that Frecknall&#8217;s vision lacks for striking moments and sneaky gut-punches (one of those decadent Kit Kat Boys seems done up to resemble Party Monster Killer Michael Alig). The stagings of the proto-Nazi anthem &#8220;Tomorrow Belongs To Me&#8221; are suitably chilling, and Redmayne&#8217;s frequent costume changes into ever more sinister Bowie-clown garb (transformation complete when the Thin White Duke finally arrives) are among the many intriguing ideas.\n\nStill, the vision never really coalesces in the way that Daniel Fish managed with that spooky, sexy Oklahoma a few years back. The promise of an overwhelming theatrical event just never quite makes good on itself, certainly not with Rankin&#8217;s teary, intentionally overwrought delivery of the title song. We get it. Sally isn&#8217;t meant to be a big star. I&#8217;d still rather hear Liza.\n\nOpening night: April 20Venue: Shubert TheatreDirector: Michael GreifMusic & Lyrics: Alicia KeysBook: Kristoffer DiazChoreography: Camille A. BrownPrincipal Cast: Maleah Joi Moon, Shoshana Bean, Brandon Victor Dixon, Kecia Lewis, Chris LeeRunning time: 2 hr 30 min (including intermission)Official synopsis: &#8220;Ali is a 17-year-old girl full of fire – searching for freedom, passion and her place in the world. How she finds them is a New York City coming-of-age story you&#8217;ve never felt before&hellip;Rebellious and stifled by an overprotective single mother, Ali is lost until she meets her mentor: a neighbor who opens her heart and mind to the power of the piano.&#8221;Deadline's takeaway: Being privileged to witness the birth of a star is one of the many pleasures to be had in Hell&#8217;s Kitchen, the semi-autobiographical Alicia Keys musical opening on Broadway tonight after a successful Off Broadway run last year. Twenty-one-year old newcomer Maleah Joi Moon, who plays the 17-year-old Ali &#8211; the Keys character &#8211; seems to have arrived on stage as a fully formed Broadway presence, a marvelous singer, dancer and actress who is sure to leave every New York theatergoer hoping that Hollywood doesn&#8217;t swoop in too fast, and that Hell&#8217;s Kitchen is just the beginning of a long career in musical theater.\n\nDirected with energy aplenty by Michael Greif, with thrilling choreography by Camille A. Brown, Hell&#8217;s Kitchen is set in the changing New York of the early 1990s, when the city&#8217;s street life was becoming safer &#8211; for some &#8211; and Rudy Giuliani could still be hailed &#8211; by some &#8211; as the man who would give neighborhoods like the one of the title back to their residents.\n\nAt least, that&#8217;s the hope for parents like Jersey, the protective, still-young single mother of a teenage girl enticed by the vibrant street life of bucket drummers and hip-hop dancers. Ali &#8211; who we know will grow up to be the singer-songwriter of such hits as &#8220;You Don&#8217;t Know My Name,&#8221; \"Fallin',\" \"If I Ain't Got You,\" \"No One,&#8221; and &#8220;Empire State of Mind&#8221; &#8211; craves a life beyond the safety and boredom of the one-bedroom apartment she shares with her mom.\n\nBoredom, of course, is a relative thing. Manhattan Plaza, the real-life Hell&#8217;s Kitchen building in which Ali and Jersey live, offers affordable housing for artists, and is a terrific setting for a musical. In a delightful bit of stagecraft that makes perfect use of Grief&#8217;s direction, scenic design (Robert Brill), lighting (Natasha Katz), projections (Peter Nigrini), sound (Gareth Owen) and, not least, Moon&#8217;s performance, Hell&#8217;s Kitchen introduces us to the world of music surrounding young Ali. As she descends from her upper-floor apartment in an elevator, each level of the building offers up the sounds of its inhabitants, introducing the impressionable teenager to jazz, opera, classical and other genres. By the time she arrives on a street thumping with the beats and movement of hip-hop, she contains musical multitudes.\n\nThe plot is simple: Mother and daughter clash over the girl&#8217;s infatuation with a young man &#8211; man, as opposed to boy, being the operative word for mom &#8211; who plays a bucket drum on the street. To Jersey, young Knuck (Chris Lee) is all too reminiscent of Ali&#8217;s mostly absent piano-playing father Davis (Brandon Victor Dixon). Jersey knows these sweet, sensitive, artistic types can be heartbreakers.\n\nAn oasis amidst the turmoil is Miss Liza Jane (Kecia Lewis), an elderly Black neighbor (hints of Nina Simone and Odetta) who practices piano in the building&#8217;s communal studio and teaches the mixed-race Ali about both music and heritage. In one of the musical&#8217;s most moving sequences, old images and vintage film clips of the Black musical &#8220;patriarchs&#8221; and &#8220;matriarchs&#8221; unspool just behind teacher and student as the lesson takes hold.\n\nWhile the musical&#8217;s second act falters with unnecessary emotional padding and more than a little heart-tugging &#8211; the ailing Miss Liza Jane, well, you&#8217;ll guess early enough &#8211; the cast is so good we&#8217;ll overlook anything.\n\nOpening night: April 19Venue: Golden TheatreDirector: Daniel AukinWritten By: David AdjmiOriginal Songs: Will ButlerCast: Will Brill, Andrew R. Butler, Juliana Canfield, Eli Gelb, Tom Pecinka, Sarah Pidgeon, Chris StackRunning time: 3 hr 5 min (including intermission)Official synopsis: &#8220;Stereophonic mines the agony and the ecstasy of creation as it zooms in on a music studio in 1976. Here, an up-and-coming rock band recording a new album finds itself suddenly on the cusp of superstardom. The ensuing pressures could spark their breakup — or their breakthrough. In Stereophonic, Adjmi invites the audience to immerse themselves—with fly-on-the-wall intimacy—in the powder keg process of a band on the brink of blowing up.&#8221;Deadline's takeaway: Even if you&#8217;d never consider spending one of your three genie wishes to travel, invisibly, back in time to witness the legendarily volcanic creation of that most fabled rock masterpiece known as Fleetwood Mac&#8217;s Rumours, you&#8217;d do well to check out Stereophonic, a masterpiece in its own smaller way.\n\nPlaywright David Adjmi has engineered a moment-in-time tale that perfectly captures its era, a near-documentary portrait of all-too-human heroes and the messy personal dynamics that go into creating not just any old art but art that&#8217;s meant to last, whatever last means in the world of Top 40 hits and rock & roll relationships. With unerring direction by Daniel Aukin and performed by a miraculous cast that so fully embodies Fleetwoo&#8230; I mean, the unnamed band at the heart of Stereophonic, the play is like the answer to a question you never knew you needed answered.\n\nVery obviously based on the 1976 making of Rumours &#8211; creators&#8217; claims to the contrary fall in the &#8216;The Rose wasn&#8217;t about Janis Joplin&#8217; pile &#8211; Stereophonic mines those mythically troubled recording sessions to examine the fraught creation of art, band dynamics when love comes and goes, the male arrogance that permeated every bit of breathable air in a rock world even when women were the nominal stars, and the great toll that fame, fortune and the unquenchable thirst for ever-more success takes on the suspecting and unsuspecting alike.\n\nPlaying out on David Zinn&#8217;s knob-perfect, bifurcated recording studio set, with a large, period-accurate recording consul dominating the engineers&#8217; room closest to the audience and the recording booths visible just beyond sound-proof glass (we hear what&#8217;s going on when the mics are turned on, whether the band wants us to or not), Stereophonic unspools with a v&eacute;rit&eacute; accessibility. The characters, their talents, addictions and relationships are established in swift, observant efficiency. Bass player Reg (Will Brill) and singer-keyboardist Holly (Juliana Canfield) are the British husband and wife, his alcoholism getting the better of both; cocky Peter (Tom Pecinka) and insecure Diana (Sarah Pidgeon) are the American newcomers, lovers for nine years, he boasting a more developed musical talent (and the massive ego to prove it), and she self-critically revealing a nascent genius that foretells fast-rising stardom; and drummer Simon (Chris Stack), British founder of the band who watches proudly and helplessly as his control slips from his grasp under the skyrocketing popularity of the yanks.\n\nIf you need a scorecard: Reg Holly Peter Diana Simon = John Christine Lindsey Stevie Mick.\n\nServing as a sort of greek chorus/audience stand-ins are low-on-the-totem-pole engineers Grover (Eli Gelb) and Charlie (Andrew R. Butler), who survive through their own bluffs, skills and tolerance for inexhaustible abuse. They do what they do very well, and they hold the very large bags of cocaine.\n\nAs weeks drag into months (many, many months), the recording of the band&#8217;s follow-up to a surprisingly successful first album sees tensions and old resentments slow-boil to lid-blowing proportions. There will be tears, break-ups, reconciliations and more break-ups. Not one person, no matter how newly famous, will emerge unscathed.\n\nMaking no small contribution to the power of this play are the few original songs (written by Will Butler, formerly of Arcade Fire) that capture the late-&#8217;70s vibe with uncanny accuracy without merely copycatting. A cast album has been announced, and it&#8217;s more than deserved. Not only do the actors nail the acting, they make for a very credible hit-making band, playing their own instruments and singing their own songs. By the end, these bruised golden gods remain standing, though barely, and certain that, if nothing else, they have a smashing success on their hands. Everyone behind Stereophonic must know the feeling.\n\nOpening night: April 18, 2024Venue: The Music Box TheatreDirector: Leigh SilvermanBook, music & lyrics: Shaina TaubChoreography: Mayte NatalioPrincipal cast: Shaina Taub, Nikki M. James, Jenn Colella, Grace McLean, Hannah Cruz, Kim Blanck, Anastacia McCleskey, Ally Bonino, Tsilala Brock, Nadia Dandashi, Emily SkinnerRunning time: 2 hr 30 min (including intermission)Official synopsis: &#8220;In the seven years leading up to the passage of the Nineteenth Amendment in 1920, an impassioned group of suffragists &#8212; \"Suffs\" as they called themselves &#8212; took to the streets, pioneering protest tactics that transformed the country. They risked their lives as they clashed with the president, the public, and each other. A thrilling story of brilliant, flawed women working against and across generational, racial, and class divides, Suffs boldly explores the victories and failures of a fight for equality that is still far from over.&#8221;Deadline's takeaway: Suffs is enthralling, a smart, funny and beautifully sung musical that brings its chosen moment in history to life just as surely and confidently as Hamilton did for its. That the Suffs era is female-focused &#8212; and so less known, in its details, to the general public than the doings of the Founding Fathers &#8212; makes Shaina Taub&#8217;s creation all the more potent.\n\nThe urgency comes through in every aspect of this thrilling production, from the extraordinary performances to an exquisite set design that places the Suffs of 1913-1920 squarely within a Washington D.C. of stately marble and paneled wood, right where they belong.\n\nTaub, the composer and performer best known to New York theatergoers through her inspired work for Shakespeare in the Park in recent years, here takes a big step in scope and ambition, and handily pulls it off. She&#8217;s populated Suffs with some dozen or so women who, in one way or another, took part in the fight for suffrage, sometimes agreeing with one another, just as often not, but always coming together when history demands.\n\nTaub, director Leigh Silverman and a pitch-perfect cast bring the era to vivid life by alternately focusing on historical sweep and the personal dramas of the (very real) characters. The Suffs plead their case more than once to no less a personage, however craven, than President Woodrow Wilson (Grace McLean, in a terrifically funny performance). But the real drama &#8212; and no small bit of the humor (Suffs is anything but stuffy) &#8212; comes from the clashing personalities of the women who share a goal, if, as it so often seems, little else.\n\nTaub plays Alice Paul, the young firebrand who, along with her devoted friend Lucy Burns (Ally Bonino), are determined to bring change to the Suffrage Movement, long (too long) under the cautious domination of the older Susan B. Anthony-era organizers as personified by the dismissive Carrie Chapman Catt (Jenn Colella). Carrie can&#8217;t let go of a more polite way of achieving change: the lobbying and kowtowing that for decades has gained little but promises.\n\nAlice and her compatriots aren&#8217;t nearly so patient. They want marches, and demonstrations and, in the end, even hunger strikes, tactics that appall the establishment Suffs. But one of the most rewarding aspects of Taub&#8217;s vision for Suffs is in the suggestion of how the newcomers and their elders inspire and influence one another is significant ways. We see this in the bond, however tested, between Alice and Carrie, and in a similarly positioned friendship between the crusading Black journalist Ida B. Wells (Nikki M. James) and her older friend Mary Church Terrell (Anastacia McCleskey). James&#8217; performance of the righteous &#8220;Wait My Turn&#8221; is a musical highlight.\n\nTaub&#8217;s music (along with Mayte Natalio&#8217;s choreography) is an appealing meld of Americana, showtune, and hints of vaudeville and the Blues, all blending into one of the most incisive and pleasing new scores since Kimberly Akimbo. Suffs, though set (mostly) in the distant past, has much to say about the ongoing struggle for equal rights (Hillary Rodham Clinton and Malala Yousafzai are among the producers). History, and Broadway for that matter, deserve no less.\n\nOpening night: April 17, 2024Venue: Marquis TheatreDirector: Schele WilliamsBook: William F. BrownMusic & lyrics: Charlie SmallsAdditional material: Amber RuffinChoreography: JaQuel KnightPrincipal cast: Nichelle Lewis, Wayne Brady, Deborah Cox, Melody A. Betts, Kyle Ramar Freeman, Phillip Johnson Richardson and Avery Wilson.Running time: 2 hr 30 min (including intermission)Official synopsis: &#8220;Based on L. Frank Baum's children's book, \"The Wonderful Wizard of Oz\", The Wiz takes one of the world's most enduring (and enduringly white) American fantasies, and transforms it into an all-Black musical extravaganza for the ages.&#8221;Deadline's takeaway: So much has happened in the land of Oz since The Wiz first eased on down the road to Broadway back in 1975, and the most of that so much was Wicked. Raising the bar on all things Baum, Wicked not only added new storylines, approaches and no small amount of stagecraft dazzle to the universe of witches, wizards and an intruder or four that even a teaser trailer for the upcoming film adaptation can rouse fan excitement to dizzying levels.\n\nThe once groundbreaking Wiz, in other words, is gonna have a tough yellow brick road to hoe to keep up, and the new Broadway revival, opening tonight at the Marquis, only occasionally meets the challenge. A good cast, though apparently encouraged to over-sing at the drop of a house, works hard to make up for the production&#8217;s shortcuts &#8211; painted flats are overused, special effects are few, far between and not particularly special, and director Schele Williams breezes past (or completely ignores) some of the well-worn story&#8217;s most anticipated beats.\n\nThe tornado, for example, barely registers, signified mostly by a swirling chorus of dancers in bland gray, while the Wicked Witch&#8217;s castle is rendered as a pseudo-Hadestown boiler room bathed in red light. Budgetary constraints might play a part in some of the disappointments, but surely the Wicked Witch&#8217;s liquidation could have been accomplished with something more impressive than a standard hydraulic lift, and why there&#8217;s no one to greet Dorothy back in Kansas is anyone&#8217;s guess.\n\nThe production is not without its charms, though. A relatively brief moment in the musical spotlight by Wayne Brady, as The Wiz, has enough charm (and dance moves) to fuel a cyclone, and JaQuel Knight&#8217;s choreography rises way beyond itself in full-ensemble numbers like the Act II opener &#8220;The Emerald City.&#8221; Other highlights: Melody A. Betts, as Eviline, blowing the roof off the Marquis with &#8220;Don&#8217;t Nobody Bring Me No Bad News,&#8221; and a funny Allyson Kaye Daniel as Dorothy&#8217;s good witch greeter.  Best of all, the score, however overstuffed, still shines with at least two evergreens: &#8220;Ease on Down the Road&#8221; and &#8220;Home.&#8221; Some spells don&#8217;t break.\n\nOpening night: April 14, 2024Venue: Longacre TheatreDirector: Rachel ChavkinBook and music: Carson Kreitzer (book, lyrics, and original concept), Matt Gould (book and music)Choreography: Raja Feather KellyCast: Eden Espinosa, Amber Iman, Andrew Samonsky, George Abud, Natalie Joy Johnson, Zoe Glick, Nathaniel Stampley, Beth Leavel.Running time: 2 hr 30 min (including intermission)Official synopsis: &#8220;Spanning decades of political and personal turmoil and told through a thrilling, pop-infused score, Lempicka boldly explores the contradictions of a world in crisis, a woman ahead of her era, and an artist whose time has finally come.&#8221;Deadline's takeaway: For a musical devoted to trumpeting the new and daring, Lempicka can feel decidedly backward-looking. That&#8217;s not a bad thing when those glance-backs include vivid flashes of Art Deco elegance, invigorating &#8217;90s dance pop, big time Evita belting and a dash or two of One Night in Bangkok&#8216;s jaunty decadence.\n\nA pop bio-musical written by Carson Kreitzer and Matt Gould about the groundbreaking Art Deco painter Tamara de Lempicka, Lempicka follows the artist through such 20th Century milestones as the Russian Revolution, two World Wars, the tragic slide of Jazz Age Paree to Nazi-occupied Paris, and, for a few brief moments, a lonely 1970s Los Angeles.\n\nActually, the musical doesn&#8217;t so much follow the artist as latches on for a ride that&#8217;s both thrilling and tiring. Directed by the ever-inventive Rachel Chavkin, with a powerhouse Eden Espinosa (Wicked) in the title role, Lempicka offers up a tempting mix of retro-futurism and just plain retro, with choreography (by Raja Feather Kelly), scenic design (Riccardo Hern&aacute;ndez) and costumes (Paloma Young) that work hard to convey the Zelig-like scope of the artist&#8217;s life. That means we see, along with some sumptuous Deco-heavy visuals, lots of energetic dancing that frequently cribs from the most arresting of &#8220;Vogue&#8221;-era Madonna (fair is fair: Blond Ambition was a Lempicka painting come to life). At its worst, though, the dancing leads the musical through some very cartoony presentations of Soviet Realism and Left Bank bohemianism.\n\nThough the musical&#8217;s book and lyrics remain doggedly by-the-numbers, Chavkin&#8217;s direction (and a good cast that includes Andrew Samonsky, Amber Iman, George Abud, Beth Leavel and Natalie Joy Johnson) keeps Lempicka barreling through the last century&#8217;s wartime horrors, peacetime optimism and an art that grew from both.\n\nOpening night: April 11, 2024Venue: Bernard B. Jacobs TheatreDirector: Danya TaymorBook: Adam Rapp, Justin LevineMusic and lyrics: Jamestown Revival (Jonathan Clay & Zach Chance) and Justin LevineChoreography: Rick Kuperman & Jeff KupermanCast: Brody Grant, Sky Lakota-Lynch, Joshua Boone, Brent Comer, Jason Schmidt, Emma Pittman, Daryl Tofa, Kevin William Paul and Dan Berry, with Jordan Chin, Milena J. Comeau, Barton Cowperthwaite, Tilly Evans-Krueger, Henry Juli&aacute;n Gendron, RJ Higton, Wonza Johnson, Sean Harrison Jones, Maggie Kuntz, Renni Anthony Magee, SarahGrace Mariani, Melody Rose, Josh Strobl, Victor Carrillo Tracey, Trevor Wayne.Running time: 2 hr 30 min (including intermission)Official synopsis: In Tulsa, Oklahoma, 1967, Ponyboy Curtis, his best friend Johnny Cade and their Greaser family of \"outsiders\" battle with their affluent rivals, the Socs. This thrilling new Broadway musical navigates the complexities of self-discovery as the Greasers dream about who they want to become in a world that may never accept them. With a dynamic original score, The Outsiders is a story of friendship, family, belonging&hellip; and the realization that there is still \"lots of good in the world.\"Deadline's takeaway: A fine and catchy score that references pop, early rock & roll, country and showtune balladeering is performed by a terrific young cast in Broadway&#8217;s The Outsiders, opening in a heartfelt production at the Bernard B. Jacobs Theatre.\n\nIf you&#8217;ve read the book or seen the movie, you know the story. The musical&#8217;s book by Adam Rapp with Justin Levine stays close to its origins for better and worse, and the songs by the excellent folk and Americana duo Jamestown Revival, along with Levine, go a long way to fill in plot details and character histories.\n\nStill, even with clever direction by Danya Taymor, The Outsiders never quite outgrows its Young Adult literary origins. Based on the groundbreaking S.E. Hinton novel and Francis Ford Coppola's film adaptation, The Outsiders often comes across as a precocious teen all dressed up for a night on the New York town &#8212; clearly money has been spent on a spare, efficient set, with lots of stacked tires and planks of wood, designed by AMP featuring Tatiana Kahvegian, enhanced by Hana S. Kim&#8217;s cool projections (in one case, literally &#8212; images of Paul Newman in Cool Hand Luke are, if nothing else, an easy time-placer). The full talents of the designers and special effects masters come together in a terrific barn fire scene, and Brian MacDevitt&#8217;s lighting design and Cody Spencer&#8217;s sound meld well with with the choreography, especially during a crowd-pleasing slo-mo, freeze-frame, strobe-lit rumble between the vengeance-seeking cliques.\n\nWhile all the production&#8217;s elements seem to be in place &#8212; the cast, even when its acting chops falter, is, musically, a full-throated and easy-to-like ensemble &#8212; The Outsiders often feels like a musical that wants to hang with the grown-ups while unable to leave behind its adolescent earnestness and self-involvement. A more thoughtfully adult production might invent some credible consequences for a negligent, deadly arson, a fatal stabbing and a train derailment, all of which are presented, true to S.E. Hinton, as temporary glitches in the self-actualization of a 14-year-old boy.\n\nOpening night: March 28, 2024Venue: Nederlander TheatreDirector: Des McAnuffBook: Pete Townshend and Des McAnuffMusic and lyrics: Pete TownshendChoreography: Lorin LatarroCast: Ali Louis Bourzgui, Alison Luff, Adam Jacobs, John Ambrosino, Bobby Conte, Christina Sajous, with Haley Gustafson, Jeremiah Alsop, Ronnie S. Bowman Jr., Mike Cannon, Tyler James Eisenreich, Sheldon Henry, Afra Hines, Aliah James, David Paul Kidder, Tassy Kirbas, Lily Kren, Quinten Kusheba, Reese Levine, Brett Michael Lockley, Nathan Lucrezio, Alexandra Matteo, Mark Mitrano, Reagan Pender, Cecilia Ann Popp, Daniel Quadrino, Olive Ross-Kline, Jenna Nicole Schoen, Dee Tomasetta, and Andrew Tufano.Running time: 2 hr 10 min (including intermission)Deadline&#8217;s takeaway: The Who&#8217;s Tommy is a nonstop surge of electrified energy, a darting pinball of a production that syncs visual panache with 55-year-old songs that sound as vital today as they must have at Woodstock. To read full review, click on show title above.\n\nOpening night: March 21, 2024Venue: Imperial TheatreDirector: Jessica StoneBook: Rick Elice, based on the novel by Sara GruenMusic and lyrics: Pigpen Theatre CompanyCast: Grant Gustin, Isabelle McCalla, Gregg Edelman, Paul Alexander Nolan, Stan Brown, Joe De Paul, Sara Gettelfinger and Wade McCollum, with Brandon Block, Antoine Boissereau, Rachael Boyd, Paul Castree, Ken Wulf Clark, Taylor Colleton, Gabriel Olivera de Paula Costa, Isabella Luisa Diaz, Samantha Gershman, Keaton Hentoff-Killian, Nicolas Jelmoni, Caroline Kane, Harley Ross Beckwith McLeish, Michael Mendez, Samuel Renaud, Marissa Rosen, Alexandra Gaelle Royer, Asa Somers, Charles South, Sean Stack, Matthew Varvar and Michelle WestRunning time: 2 hr 40 min (including intermission)Deadline&#8217;s takeaway: Water for Elephants is a pleasant, visually beguiling show with a cast led by The Flash&#8216;s Grant Gustin in a sweet-voiced Broadway debut that puts some charm into a thin book by Rick Elice that probably veered too close to the novel for its own good. To read full review, click on show title above.\n\nOpening night: March 18, 2024Venue: Circle in the Square Written by: Henrik Ibsen, In A New Version By Amy Herzog Directed by: Sam GoldCast: Jeremy Strong, Michael Imperioli, Victoria Pedretti, Katie Broad, Bill Buell, Caleb Eberhardt, Matthew August Jeffers, David Patrick Kelly, David Mattar Merten, Max Roll, Thomas Jay Ryan, Alan TrongRunning time: 2 hrs (including one pause)Deadline&#8217;s takeaway: Watching Jeremy Strong (Succession) and Michael Imperioli (The Sopranos) go head to head for two hours is a treat, as if the stars of your favorite HBO dramas had crossed over some crazy timeline to show each other what for. To read full review, click on show title above.\n\nOpening night: March 14, 2024Venue: Gerald Schoenfeld TheatreDirectors: Michael Greif and Schele WilliamsBook: Bekah BrunstetterMusic and lyrics: Ingrid MichaelsonCast: Jordan Tyson, Joy Woods, Maryann Plunkett, John Cardoza, Ryan Vasquez, Dorian Harewood, with Andr&eacute;a Burns, Yassmin Alers, Alex Benoit, Chase Del Rey, Hillary Fisher, Jerome Harmann-Hardeman, Dorcas Leung, Happy McPartlin, Juliette Ojeda, Kim Onah, Carson Stewart, Charles E. Wallace, Charlie WebbRunning time: 2 hr 10 min (including intermission)Deadline&#8217;s takeaway: Based on Nicholas Sparks&#8217; 1996 bestseller about a young &#8212; then older, then much older &#8212; couple who survives a lifetime of tribulations (until they don&#8217;t), The Notebook is the theatrical equivalent of Muzak, comforting in its unapologetically manipulative way and unabashed in its disregard for anything approaching the grit of the real world. To read full review, click on show title above.\n\nOpening night: March 7, 2024Venue: Todd Haimes TheatreWritten by: John Patrick ShanleyDirected by: Scott EllisCast: Amy Ryan, Liev Schreiber, Zoe Kazan, Quincy Tyler BernstineRunning time: 90 min (no intermission)Deadline&#8217;s takeaway: That the play holds up as well as it does since its 2004 premiere &#8212; and it really does &#8212; is due in large part to a top-tier cast that the Roundabout Theater Company has assembled, an ensemble that keeps us guessing from beginning to end. To read full review, click on show title above.\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nYou do know that Putin, a career KGB officer, was the director of the FSB, right?\n\nSo who was the schemer? Him or the billionaire who would be forced to London months after Putin became president?\n\nDeadline is a part of Penske Media Corporation. &copy; 2025 Deadline Hollywood, LLC. All Rights Reserved.",
  "isFullReview": true,
  "dtliExcerpt": "As history lesson, Patriots is more than worthy. As drama, well, it’s a history lesson.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "MEH",
  "dtliUrl": "https://didtheylikeit.com/shows/patriots/",
  "needsScoring": true,
  "textWordCount": 7319,
  "archivePath": "data/archives/reviews/patriots-2024/deadline--greg_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:31:19.682Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_read_more_prompt",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250723084520",
  "archiveOrgUrl": "http://web.archive.org/web/20250723084520/https://deadline.com/feature/broadway-show-reviews-spring-2024-1235866317/"
}