{
  "showId": "patriots-2024",
  "outletId": "new-york-times",
  "outlet": "NEW YORK TIMES",
  "criticName": "Jesse",
  "url": "https://www.nytimes.com/2024/04/22/theater/patriots-review-putin-peter-morgan.html",
  "publishDate": "April 22, 2024",
  "fullText": "“In the West you have no idea.”\n\nSo begins Peter Morgan’s play “Patriots,” which opened on Monday at the Ethel Barrymore Theater. The line is spoken by the Russian oligarch Boris Berezovsky, referring to the foods, sights and music that supposedly feed the great Russian soul. These are represented, in Rupert Goold’s entertaining if overcaffeinated production, by boozy singing and balalaikas, sometimes even fur hats.\n\nBut “Patriots” also sets out to demonstrate how little the West knows about the real world of realpolitik: the grudges, enmities and insulted dignities that in the post-Soviet 1990s, with casino capitalism rampant in Russia, created Vladimir Putin.\n\nIf you could ask Berezovsky, though, he’d tell you it was he who created Putin, a tenth-rate provincial nobody he eased into power, first as prime minister and later as president. Berezovsky (Michael Stuhlbarg) calls himself Putin’s “krysha” — literally his roof, figuratively his protector or, as he explains, the “bully on your side.”\n\nSpoken in the weirdly accented English of this production, which originated in London and has been remounted for Broadway with key cast changes and Netflix as a producer, “krysha” sounds confusingly like “creature.” It turns out to be a useful confusion. “Patriots” is a wild story of makers switching places with the made, of Pinocchios devouring Geppettos.\n\nPutin (Will Keen) was and is both: a liar and a manipulator. Berezovsky (Michael Stuhlbarg) was at least the latter — but, well, in the West we have no idea. We meet him in “Patriots” as a 9-year-old math prodigy, an obnoxious “golden child” fixated on winning a Nobel Prize. (That there is no Nobel in mathematics is one of Morgan’s many shortcuts.) The boy’s interests, at least as selected for ironic reference later, are in the predictability of decision making, under rational and even irrational circumstances.\n\nBoth come into play. Through rational choices, the know-it-all becomes a billionaire, ruthlessly plotting to expand his business from cars to television to oil. When his attempts to grease the seemingly ungreasable Putin with money and a Mercedes fail, he switches to peddling power, which works. The chaos of the presidency of Boris Yeltsin — in Paul Kynman’s hilarious performance, a pickled parade balloon — creates massive opportunities for grift and privatization that Berezovsky, with Putin in his pocket, is primed to exploit.\n\nThe scenes in which he creates his creature — and bleeds everyone else with a combination of charm, petulance and ruthlessness — are great fun. Both lead actors are superb, bringing physical, gestural and thus emotional life to characters who might seem, from the outside, to have no insides worth exploring. Stuhlbarg has rounded himself into a big baby, complete with balled fists, squeezed eyes and tantrums. Keen, from the London production, uses a pinched voice to suggest Putin’s pinched soul. Wooden stances become turkey-like preening as he grows uncomfortably comfortable with power.\n\nThat power turns on Berezovsky the minute Putin becomes president. For the rest of the play, as for the rest of his life, Berezovsky plots to bring down the man he made and, for the sake of the motherland, his government as well.\n\nMorgan does not offer a strong point of view on whether Berezovsky was truly patriotic or just infuriated by the wounds to his narcissism and bank account. But after Roman Abramovich, another of his creatures, turns on him too, the on-the-skids oligarch loses his grip on the rationality of decision making. He dies, a probable suicide, in exile.\n\nThat’s no spoiler; it’s the news, dateline London, 2013. But I wouldn’t generally take “Patriots” as a reliable source of information. (The math is mostly mumbo-jumbo.) Like Morgan’s “The Crown,” it’s a bit cheesy, making its sometimes baggy drama (it could reasonably have been half or twice as long) from a highly tendentious selection of facts and a perhaps overliberal imagination.\n\nIn so doing, it provides, also like “The Crown,” the opportunity for some very enjoyable performances, not just from Stuhlbarg and Keen but also from Luke Thallon as an implausibly beamish Abramovich. Just don’t look for interesting women here; they are mostly afterthoughts, arm candy and Bechdel test flunk-outs.\n\nBut then “Patriots” is no better a source for moral news than the other kind. Perhaps no play is. Here, though, Putin is given way more than his due: glamorized as a shy, upstanding mayor corrupted by Berezovsky and his plutocratic ilk. Whereas Berezovsky, who did after all try to bring Putin down, is left in the gutter, with a certain amount of dramaturgical glee. Goold stages his downfall like a rock opera, with strobes, bursts of loud noise (these are often assassination attempts) and weird dancers.\n\nIf not moral clarity, then, “Patriots” at least offers a lesson: There are moments when tyrants are still tyros, when Putins are nobodies — and evil can be redirected or sidelined. Wait too long and you could lose your chance.\n\nThat’s something, “Patriots” suggests, about which the West can no longer afford to “have no idea.”\n\nPatriotsThrough June 23 at the Ethel Barrymore Theater, Manhattan; patriotsbroadway.com. Running time: 2 hours 30 minutes.\n\nJesse Green is the chief theater critic for The Times. He writes reviews of Broadway, Off Broadway, Off Off Broadway, regional and sometimes international productions.\n\n35Share full article3535More on N.Y.C. Theater, Music and Dance Taking on ‘Salome’: For his Met Opera debut, the renowned German director Claus Guth is staging Strauss’s breakthrough opera with a focus on themes of trauma and abuse.\n\n’Real Women Have Curves’:The new musical on Broadway is based on Josefina López’s original play and the 2002 film adaptation that starred America Ferrera.\n\nTrapped in a Cave: Floyd Collins was pinned under a rock while exploring a cave in 1925. That history, recounted in song, is now on Broadway.\n\nNo Power? No Problem: The “Sunset Boulevard” star Nicole Scherzinger briefly entertained the crowd when “a technical malfunction on the sound side” forced the cancellation of a matinee performance.\n\nPushing Sisyphean Beach Balls: Celia Rowlson-Hall’s “Sissy” at the Baryshnikov Arts Center, a dance-theater hybrid featuring Marisa Tomei, pokes at the boundaries between art and life.",
  "isFullReview": true,
  "dtliExcerpt": "“In the West you have no idea.”",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "MEH",
  "dtliUrl": "https://didtheylikeit.com/shows/patriots/",
  "needsScoring": true,
  "textWordCount": 1014,
  "archivePath": "data/archives/reviews/patriots-2024/new-york-times--jesse_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:33:23.003Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250509192252",
  "archiveOrgUrl": "http://web.archive.org/web/20250509192252/https://www.nytimes.com/2024/04/22/theater/patriots-review-putin-peter-morgan.html"
}