{
  "showId": "patriots-2024",
  "outletId": "newyorktheatreguide-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.newyorktheatreguide.com/reviews/patriots-broadway-review-michael-stuhlbarg",
  "publishDate": null,
  "fullText": "Read our review of Patriots on Broadway, an award-winning play from London written by The Crown creator Peter Morgan and starring Michael Stuhlbarg and Will Keen. Patriots, the new play by Peter Morgan and directed by Rupert Goold, runs less on watching billionaire Boris Berezovsky (Michael Stuhlbarg) and Vladimir Putin (Will Keen) jockey for power and more on irony. The show thrums along as Berezovsky, bent on making his mother Russia alert to the infinite possibilities of the world beyond Soviet rule (read: mostly Western capitalism), spreads his money and influence around just enough to exert control over his country's future. These actions include convincing Putin, a former KGB intelligence officer, to accept a tacit alliance with Berezovsky and his government cronies. He eventually becomes the heir apparent to President Boris Yeltsin, and the rest, as they say… It’s a nasty joke when all the punchlines orbit around the absurdity of watching a relatively meek, inexpressive agent of Russia’s intelligence become one of the most frightening and dangerous men currently in power. Morgan’s Wikipedia-esque play does its best to track the perilous tango between oligarchy and politics, but it’s built around the assumption that it’s amusing and ironic that one man who created a monster got chewed up and spit out by it, and the rest of us have to pay. It’s curious that Morgan depicts Putin as a man whose ambitions and cunning stays under wraps, Keen playing him with smaller gestures opposite Stuhlbarg’s heavily gesticulatory performance. But here, rather than a man who’s biding his time to get to a place where he can rule without consequence, Morgan’s Putin really is made by this version of Berezovsky, only intermittently trying to assert his own agency, but basically molded into something that his maker loses control of. It’s an easily digestible version of history, possibly problematic in its vision that Berezovsky, hungry only for power, is the only person with autonomy until the world of his making no longer has a use for him. In the mid-1990s, Russian billionaire Boris Berezovsky uses his influence to change the course of Russian history, as the Berlin Wall fell and gave rise to new opportunities. The former mathematician who studied rational and irrational decision-making has turned to economic and political power-playing. Out of it, he tries to craft a political agent that will do his bidding. That person turns out to be Vladimir Putin. To Patriots’s credit, director Rupert Goold enlivens a mediocre play into a fairly entertaining spectacle of lights and projection. The evening is lit mostly in red and the stage acts as both a (political) platform and, with swivel chairs all around, a pub where songs from the country’s past echo throughout. Goold makes the show bright and shiny, making every dramatic beat into an exclamation point in Russian red. Read more audience reviews of Patriots on Show-Score. Although Peter Morgan’s telling of the rise of Putin and Russian oligarchs feels a bit oversimplified and leaves most characters one- or two-dimensional, Rupert Goold’s electric direction elevates the material to make history feel like a blur of lights and sound. Learn more and get Patriots tickets on New York Theatre Guide. Patriots is at the Barrymore Theatre through June 23. Photo credit: Patriots on Broadway. (Photos by Matthew Murphy) Coming to Broadway for a strictly limited run, Patriots earned widespread critical acclaim and awards in London. Now, see award-winning actors Will Keen and Michael Stuhlbarg spar as feuding Russian leaders in this dramatic political thriller from the creator of The Crown. Patriots on Broadway is playing at Barrymore Theatre. The theatre is located at 243 West 47th Street, New York, 10036. The running time of Patriots on Broadway is 2hr 35min. Incl. 15min intermission. The recommended age for Patriots on Broadway is Ages 14+. Children under 4 are not permitted in the theater.. Book tickets for Patriots on Broadway on New York Theatre Guide. Peter Morgan wrote the Patriots play. No stranger to political thrillers, he created Netflix's The Crown and wrote the plays Frost/Nixon and The Audience and now turns his writing focus to Russia. Patriots is directed by Rupert Goold, a filmmaker and artistic director of London's Almeida Theatre, where the play premiered. Patriots has mature content and is recommended for audiences 14 and older. Please note that children 4 and younger are not permitted in Broadway theatres. Patriots won the 2023 Critics’ Circle Award and received four-star reviews in Observer, Financial Times, and more outlets. The Daily Mail's critic called the play a “dazzling, engrossing, and prescient drama from Peter Morgan — it’s a humdinger.” Originally published on Apr 22, 202417:00",
  "isFullReview": true,
  "dtliExcerpt": "\"It’s an easily digestible version of history\"\n\nRead more",
  "originalScore": null,
  "assignedScore": 75,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 774,
  "archivePath": "data/archives/reviews/patriots-2024/newyorktheatreguide-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:33:38.406Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "designation": "Recommended",
  "scoreSource": "extracted-thumbs-up",
  "scoreConfidence": "low"
}