{
  "showId": "patriots-2024",
  "outletId": "newyorktheater-me",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://newyorktheater.me/2024/04/22/patriots-broadway-review/",
  "publishDate": null,
  "fullText": "Vladimir Putin was working as a taxi driver when he visited one of the richest and most powerful men in Russia to ask for a favor. The previous month, Putin had lost his job as the deputy mayor of St. Petersburg, and he wanted help in getting back into politics. “I am interested in liberalizing Russia. For too long we have defined ourselves as enemies of the West. We need to become close to the West.” That, anyway, is what Will Keen as Vladimir Putin says in “Patriots.” The play by Peter Morgan, the British writer probably best-known for “The Crown,” had a successful run in London, and is now opening at the Barrymore. It is a smart and entertaining historical drama, if an odd fit for Broadway right now. “Patriots” focuses on the man from whom Putin was seeking the favor: Boris Berezovsky, a math prodigy and PhD who shortly after the collapse of the Soviet Union in 1991 became a billionaire businessman and something of a political boss, or at least bossy — the most prominent of the so-called oligarchs, the term used for Russian entrepreneurs who took advantage of the privatization of state-run industries to become both insanely wealthy and frighteningly influential. As portrayed by Michael Stuhlbarg, Boris is an impatient middle-aged wheeler-dealer, barking at subordinates, trying to bribe officials, too busy for his wife and family, but having dalliances with a series of young women a third his age, as he expands his empire of auto dealerships and takes over the state-run television network, barely pausing after being injured by a car bomb meant to assassinate him. He does help Putin gain power, by talking him up to Boris Yeltsin, the President of Russia, with whom he has developed a special connection, mostly through Yeltsin’s daughter. But once Yeltsin appoints Putin president, Berezovsky is outraged when Putin gathers together the oligarchs and announces: “Gentlemen, the party is over.” As Putin elaborates to Berezovsky in one of the many intriguing exchanges: Putin: The meeting was necessary to make clear the way things are going to be, the way things need to be if this country is to survive. A clear separation of business and politics. Boris: Oh, my God… Only a former Head of the Federal Security Services could be this naive! You cannot separate business and politics when the state is bankrupt. You need our money. Without the oligarchs you stand no chance. Putin: I’m not sure I see it that way. I see a country that has fallen into the hands of a handful of self- interested crooks… They both claim to be patriots working for the betterment of their country. They each accuse the other of being bad for Russia. Putin asks Boris why then did he help him gain power. “To do my bidding,” Boris roars.”…To keep your nose down and follow orders.” Boris feels betrayed by Putin – which leads Putin to feel betrayed by Boris, with grave and possibly lethal consequences. “Patriots” is intelligently written, directed efficiently and with a flourish by Rupert Goold, and uniformly well-acted. Stuhlbarg is sometimes over-the-top, but that feels true to the histrionic character he’s portraying. Will Keen certainly stands out in his subtle portrayal of an initially diffident man who grows into his power. (In a pivotal moment, which is staged with help from the scenic and projection designers, he looks at himself in the mirror, searching for the right pose for a newly important man.) The rest of the large cast does a solid job of bringing a gallery of peripheral characters and historical figures to life, including Alex Hurt as Alexander Litvinenko, a long-time security officer who balks at the growing corruption, and pays the price; and Luke Thallon as Putin-favored oligarch Roman Abramovich, who starts out idolizing Boris; becomes Boris’ friend and (like Putin) his creation, and winds up (like Putin) his foe. But “Patriots” ultimately feels like a play for a different time and a different place. It is opening at the crowded end of a busy Broadway season, and if New York theatergoers are going to be offered a play about Russia that involves Vladimir Putin, why a British play about a Russian oligarch whose heyday was in the 1990s, with most of the depicted events having occurred decades ago? We don’t get enough of a background or perspective on what much of the world (including Americans) view as an urgent current moment — Putin’s continuing war on Ukraine. If it’s true, as the play indicates, that Putin began his reign making overtures to the West — we’re told he even wanted Russia to become a member nation of NATO — then what happened? We’re left in the dark. We can guess; try to read between the lines, do some research afterwards on our own. Or if we want a more complete picture from Peter Morgan, we can wait to see if he turns the story into another Netflix series. PatriotsBarrymore Theater through June 23Running time: Two hours and forty minutes, including intermission.Tickets: $49 – $294Written by Peter MorganDirected by Rupert GooldSet designer Miriam Buether, co-costume designers Deborah Andrews and Miriam Buether, lighting designer Jack Knowles, sound designer and composer Adam Cork, movement director Polly Bennett and projection designer Ash J Woodward.Cast: Michael Stuhlbarg as Boris Berezovsky, Will Keen as Vladimir Putin, Luke Thallon as Roman Abramovich, Stella Baker as Marina Litvinenko; Ronald Guttman as Professor Perelman; Alex Hurt as Alexander Litvinenko; Rosie Benton as Anna Berezovsky/Newscaster/Journalist; Jeff Biehl as Teacher/FSB Boss; Peter Bradbury as Alexander Voloshin/Nurse; Camila Canó-Flaviá as Tatiana Yeltsin/Nina Berezovsky/Judge/Lover; Joe Forbrich as FSB Agent/Oligarch/Security; Marianna Gailus as Katya/Pianist/Compromised Newscaster; Paul Kynman as Alexander Korzhakov/Boris Yeltsin/Reporter; Adam Poss as Lawyer/Home Office Spokesman/Newscaster; Nick Rehberger as Assistant/Daniel Kahneman/Russian Captain, Tony Ward as FSB Agent/Oligarch/Security. Understudies are Benjamin Bonenfant and Danielle Chaves. Vladimir ReviewOctober 15, 2024In \"Off-Broadway\" Intractable Woman, A Play About Murdered Russian Journalist Anna PolitkovskayaSeptember 26, 2018In \"New York Theater\" Lin-Manuel Miranda and Eisa Davis get heard. Sara Snook gets her dates. Sadie Sink (and Bushwick Starr) go after Arthur Miller. Stageworthy News of the WeekOctober 21, 2024In \"New York Theater Weekly Summary\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1026,
  "archivePath": "data/archives/reviews/patriots-2024/newyorktheater-me--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:33:29.291Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}