{
  "showId": "patriots-2024",
  "outletId": "pagesonstages-wordpress-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.wordpress.com/2024/05/28/patriots/",
  "publishDate": null,
  "fullText": "I was quite dismayed by the emptiness in the Ethel Barrymore Theatre tonight, where I attended my penultimate 2024 Tony nominated play, Patriots. I found the play thoroughly engaging and intellectually fascinating, and it seems as though the poor attendance might be coming from serious three hour dramas not necessarily being popular with tourists looking for a fun night on Broadway. That being said, I felt the crispness of the writing and profound shifts in character to be highly impressive and worthy of a Broadway house. I appreciate that shows like this are able to exist side by side with some of this season’s sillier offerings—it’s fantastic to see Broadway offering a wide variety of genres and becoming more diverse in content and format. Boris Berezovsky (Michael Stuhlbarg) gave an energetic performance that captured the full spectrum of human frustration. Though he was sometimes creepy and threatening, he also had moments of levity and hilarity which were characteristic of someone with an ego his size. In a way, Stuhlbarg’s mannerisms reminded me of Michael Scott from The Office. He thinks he pulls the strings and turns serious matters into jokes. He has comedic bits (like the opening with all of phones and the act two opening with the fishing trip) and makes full use of his body in ways that are symbolic but unrealistic. The similarity ends with Berezovsky’s hunger for power and personal gain, which make a charming weasel who can get anybody to do anything a lot more dangerous than my favorite head of Dunder Mifflin Scranton. Despite the repeated assertion that Berezovsky wanted to save Russia, it was clear that he was motivated by greed, pride, and revenge. Stuhlbarg’s real prowess as an actor was making us like a character who we would ordinarily dismiss, and I do think the uniqueness of his nuanced portrayal is one of the primary factors helping to sell the show. Vladimir Putin (Will Keen) went through a role reveral with Boris Berezovsky that made him emerge the more frightening figure. Putin (as portrayed in Patriots) started out awkward and noble, honorable in a way. Yet he was motivated by the same power hungry desire for vengeance as Berezovsky, he just played his cards in a different order. Where Berezovsky rewarded loyalty, Putin punished disloyalty. It was not a subtle difference. Despite all my current knowledge of Vladimir Putin, I have to hand it to actor Will Keen for humanizing him just enough for the painful acknowledgment that people are seldom as easy to interpret as characters in a play. Keen showed a side of Putin that once felt pain and knew hardship, the avoidance of which seemed to be a significant motivating factor for his control issues. The lighting (Jack Knowles) and projections (Ash J. Woodward) facilitated the storytelling in ways that made for profoundly beautiful stage pictures. In particular, Woodward’s use of multiple types of projection and projection surfaces kept each moment aesthetically interesting. Though the latency in some of the live feeds was noticeable, the beauty of the asymmetrical layout (helped by scenic designer Miriam Buether) and unapologetic nature of the eclectic blend of stylized projection design was truly unique and visually exciting. The use of mirrors was very creative, and this plus the lighting captured the isolation of each character, even as they sat among others experiencing similar, parallel decision trees. The insight into Berezovsky as a mathematician exploring the infinite was interesting, and I couldn’t help but think about the world’s most famous power hungry menace, Adolph Hitler, starting out as an artist. It was interesting to see Berezovsky go from theoretical and philosophical to maniacal and manipulative. In a way, playwright Peter Morgan wrote this character as a mathematician manipulating an equation to achieve his own desired results—in this case, fortune and fame. Like the mathematician he was in his origin story, Berezovsky was cut off from true human connection. Despite attempts to be likable, he never crossed the threshold into actually being liked. Respected, certainly. But never liked. Except, of course, by an audience that could clearly see his crookedness but enjoyed themselves in spite of it. It’s frightening to think of this as more than a story, but rather a version of actual history based on real people and events. Yet it’s also comforting that a story like this can be openly told in a world where one of its primary villains, Vladimir Putin, is still alive. It is the hallmark of a free society to be able to openly criticize world leaders, and I left the play wanting to know more about what actually happened in Putin’s rise to power. Patriots did what the best theatre does—it inspired curiosity by inspiring that little bit of doubt—maybe I don’t know as much about Russian politics as I should. Maybe some of this is relevant in today’s world. I left the show wanting to learn more, and over the next few weeks I plan to do just that as I continue to contemplate what power is and what it means to truly be a patriot. I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 35,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 860,
  "archivePath": "data/archives/reviews/patriots-2024/pagesonstages-wordpress-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:35:57.492Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "scoreSource": "extracted-strong-negative",
  "scoreConfidence": "medium",
  "extractedPhrase": "avoid"
}