{
  "showId": "patriots-2024",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.theaterscene.net/plays/broadway-plays/patriots/joseph-pisano/",
  "publishDate": null,
  "fullText": "Posted on April 28, 2024 by Joseph Pisano in Broadway, Plays The full company of Peter Morgan’s “Patriots” at the Ethel Barrymore Theatre (Photo credit: Matthew Murphy) After history ended with the fall of the Soviet Union, a nondescript, ex-KGB officer reminded the world that time moves backward, too. When exactly that wolf in wolf’s clothing, Vladimir Putin, decided to hurl Russia towards the 19th century is a question playwright Peter Morgan leaves gullibly opaque in Patriots, a West End import whose most pronounced narrative certainty comes from blaming Putin’s rise to the Russian presidency on the hubris of Boris Berezovsky, an alpha oligarch who failed to check his political puppet for strings. Better known as Queen Elizabeth II’s number one fan, Morgan (Netflix’s The Crown) once again strives to make the past palatable for dramatic consumption, though his effort, this time, comes with indigestible bones. A manic, louche, and extraordinarily brilliant practitioner of post-Soviet casino capitalism from his anything-goes nightclub in Moscow, Berezovsky (Michael Stuhlbarg) realizes things might be getting out of hand when the Russian mafia almost assassinates him. Corruption that benefits Berezovsky is acceptable for his homeland’s freshly minted democracy but not complete lawlessness that deters international investment and lucrative, mutually protective ties with Western governments. Though boyishly positive in outlook, that attitude doesn’t extend to the Jewish Berezovsky’s perception of antisemitism in Russia, which necessitates forming a pragmatic friendship with Tatiana Yeltsin (Camila Canó-Flaviá) to surreptitiously influence her father Boris (Paul Kynman), a “drunken oaf” whose usefulness as the president of Russia has deteriorated with his physical and mental health. Will Keen as Vladimir Putin and Michael Stuhlbarg as Boris Berezovsky in a scene from Peter Morgan’s “Patriots” at the Ethel Barrymore Theatre (Photo credit: Matthew Murphy) Enter Putin (Will Keen, who won an Olivier Award for the role), a try-hard in a cheap suit from Saint Petersburg (formerly Leningrad) who Berezovsky, a mathematical savant with riches derived from correctly predicting human behavior, believes can serve as an effective figurehead while he stabilizes Russian society and leads it into the new millennium from the shadows. To say the least, it’s the worst miscalculation of Berezovsky’s increasingly imperiled life, which, for obvious reasons, the audience comprehends immediately when he says to Putin, “I pride myself on my judgment of character and you, Volodya, are clearly a good man.” The fact that the real Putin is akin to Richard III and not Macbeth turns into a persistent problem for Patriots, as Morgan doggedly attempts to convince us that his fictional Putin is a monster with a conscience. It’s a baffling effort that becomes unintentionally ludicrous when, looking into a full-sized mirror, Putin’s hand shakes at the thought of the murderous misdeeds that secured his implausible accession to the Russian presidency. A gesture that could be easily missed, it unfortunately registers all the way to the far reaches of the rear mezzanine thanks to Ash J Woodward’s crudely gargantuan projection design. At the same time, Morgan’s wafer-thin and, ultimately, contradictory characterization of the burgeoning autocrat–often presented in a state of lurking watchfulness–depends on Keen’s fearsome brow, which is produced by both actorly skill and our collective knowledge that he’s portraying a tyrant whose staggering body count continues to grow without a hint of publicly expressed remorse. Luke Thallon as Roman Abramovich and Michael Stuhlbarg as Boris Berezovsky in a scene from Peter Morgan’s “Patriots” at the Ethel Barrymore Theatre (Photo credit: Matthew Murphy) In contrast, when Berezovsky’s buried moral doubts slip out, there’s less cause to disbelieve them, mostly because he isn’t currently trying to obliterate an entire country. One also accepts that Berezovsky would rue falling prey to Putin’s cunning and perhaps, with an edit, fantasize about having led an alternate life as a stolid, Nobel Prize-winning mathematician. Of course, no such award exists for theorizing about that particular subject (The Fields Medal is the prestigious equivalent), but Morgan isn’t hung up on double checking basic information. He’s too obsessed with crafting pretentious dialogue between Berezovsky and his academic mentor Professor Perelman (Ronald Guttman) about how one’s self-destructive ambition might connect to the infinite. More obnoxiously, Morgan brackets the play with a saccharine lesson that Russians often take joy in life, as if the audience’s only conception of their humanity comes from Rocky IV. Ironically, Morgan’s greatest adversary in being taken too seriously is director Rupert Goold who stages Patriots like a kitschy vaudeville show, with loads of singing, dancing, and inauthenticity, including not a notably visible actor attempting a Russian accent (think David Lean’s Doctor Zhivago). Most of the cast–especially anyone portraying one of the offhandedly inserted female characters–gets lost on Miriam Buether’s garish multipurpose set that evokes Berezovsky’s nightclub, Putin’s Kremlin, a television studio, melancholic memories of a Soviet childhood, and Chukotka, the godforsaken easternmost part of Russia. That’s where Putin sent the upstart oligarch Roman Abramovich (Luke Thallon) to serve as Governor, testing the loyalty of Berezovky’s erstwhile friend before letting him join the country’s powerful inner circle. Will Keen as Vladimir Putin in a scene from Peter Morgan’s “Patriots” at the Ethel Barrymore Theatre (Photo credit: Matthew Murphy) If there’s a compelling reason to see Patriots, it’s Stuhlbarg, a Julliard-trained actor who can elevate flawed material with the best of them. In Patriots, his talent bridges a director and writer who are never in sync, finding meaning in Goold’s absurdity and a recognizable person in Morgan’s pomposity. Actually, the latter frequently has benefited from this type of good fortune. молодец, mate! Patriots (through June 23, 2024) Ethel Barrymore Theatre, 243 West 47th Street, in Manhattan For tickets, call 212-239-6200 or visit http://www.patriotsbroadway.com Running time: two hours and 30 minutes including one intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 948,
  "archivePath": "data/archives/reviews/patriots-2024/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:41:59.877Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}