{
  "showId": "patriots-2024",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Juan A.",
  "url": "https://www.theatrely.com/post/patriots-has-no-flag-to-raise-review",
  "publishDate": "April 22, 2024",
  "fullText": "Michael Stuhlbarg | Photo: Matthew Murphy\n\nPeter Morgan, like a moth to the flame of spirited stateliness, can be relied upon to provide dramatized look behind diplomatic doors in one of two modes: dignified (The Queen, The Audience, the first few seasons of The Crown) and haute-trashy (The Other Boleyn Girl, the last few seasons of The Crown). In Patriots, his latest play, now in performance at the Barrymore Theatre after a London run last year, he’s drawn to the fire of narcissistic politicos but burned by the frost of his unclear intentions.\n\nIt introduces Boris Berezovsky (Michael Stuhlbarg) as a child math whiz quickly outpacing his surroundings in 1955 Moscow – a trait which will follow him through the decades as he becomes a well-connected oligarch, kingmaker and, ultimately, Faust-Icarus figure. The next scene imagines him as performing a variation on Roy Cohn’s “I wish I was an octopus” speech from Angels in America and, in an impressive physical performance, Stuhlbarg charges through in that mode: vicious, vulgar, and avaricious.\n\nThe problem is, dramatically, he has nowhere to go, and neither do we. He sets up Vladimir Putin (Will Keen, in a perfectly balanced scary caricature) in government and is then shocked when his discovery turns his back on him; we’re not. He lures a State Security officer (Alex Hurt) to come work as his bodyguard, promising his wife (Stella Baker) financial security, then doesn’t blink when he’s, of course, killed; neither do we, though this is the only storyline, however unfortunately small, with any semblance of heart. And flashes back to his studies under Professor Perelman (Ronald Guttman) are dull ploys for empathy, retreads of better-told “ah, he once had values!” narratives.\n\nGlimpses of newness shine through when Roman Abramovich (Luke Thallon), another businessman, slowly takes his place, and when Berzovsky, running the state TV channel, fires back at the image-controlling Putin. Neither thread is satisfactorily explored.\n\nRupert Goold directs with a coach’s jingoism, an approach which moves things along quickly, sometimes loudly, and makes the most of Miriam Buether’s set: a palatial office cutting across a long, posh bar and flanked by raised balconies pegged to an imposing brick wall. Though Jack Knowles’ lighting and Adam Cork’s music and sound design similarly turn up the energy, they cannot create a character out of Berezovsky, of whom we learn very little. Lacking detail and focus, Patriots is a character study without much of either.\n\nPatriots is in performance through June 23, 2024 at the Barrymore Theatre on West 47th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "dtliExcerpt": "The problem is, dramatically, he has nowhere to go, and neither do we.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "MEH",
  "dtliUrl": "https://didtheylikeit.com/shows/patriots/",
  "needsScoring": true,
  "textWordCount": 537,
  "archivePath": "data/archives/reviews/patriots-2024/theatrely--juan-a-_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:42:57.165Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee"
}