{
  "showId": "brief-encounter-2010",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "Frank Scheck",
  "url": "https://www.hollywoodreporter.com/movies/movie-reviews/brief-encounter-theater-review-30102/",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Upon entering the theater, you're greeted by ushers in period garb who regale you with comic banter and musical numbers. This immersion continues with the show proper, which ingeniously incorporates old-style film images and projections into which the characters pop in and out. The overall effect is visually dazzling, but the neatest trick is that the technological gimmickry never overwhelms the simple emotionality of the tale.",
  "bwwScore": 9,
  "contentTier": "truncated",
  "fullText": "London’s Kneehigh Theatre has had more than a brief encounter with “Brief Encounter,” its exhilarating multimedia adaptation of the classic David Lean film written by Noel Coward. Originally presented at a converted movie theater in London, the production has made several stops in the U.S., including San Francisco’s ACT, Minneapolis’ Guthrie and Brooklyn’s St. Ann’s Warehouse. It now has returned for a welcome Broadway run being presented by the Roundabout Theatre Company at Studio 54, a vintage theater built during the 1920s that suits this unique show exceedingly well.\n\nDirector-adapter Emma Rice’s production draws not only from the 1945 movie but also from “Still Life,” a one-act play on which it is based. It incorporates several classic Coward songs into the proceedings as well as new numbers based on his poems.\n\nSet during the late 1930s, it centers on the doomed love affair between Laura (Hannah Yelland), a wife and mother whose life has become a series of dull routines; and Alec (Tristan Sturrock), a dashing, married doctor whom she meets when he removes a piece of grit from her eye. As the couple falls hopelessly in love during the course of several meetings at a rundown train station cafe, their situation is ignored by the bustling workers engaged in romantic dalliances of their own.\n\nUpon entering the theater, you’re greeted by ushers in period garb who regale you with comic banter and musical numbers. This immersion continues with the show proper, which ingeniously incorporates old-style film images and projections into which the characters pop in and out. The overall effect is visually dazzling, but the neatest trick is that the technological gimmickry never overwhelms the simple emotionality of the tale.\n\nCleverness abounds, from the use of puppets to portray Laura’s children to the splashes of water provided to accompany the scene of the lovers’ comic attempt at boating. And moments like when the two lovers display their romantic bliss while hanging from chandeliers remain magical.\n\nThe cast remains largely the same as in other incarnations, with the exception of a couple of American performers in minor roles. The two leads remain deeply moving as the guilt-stricken lovers, and the ensemble provides sterling support, especially Joseph Alessi, doubling in the roles of Laura’s distracted husband and a cheer train dispatcher; Annette McLaughlin as the cafe owner; and Dorothy Atkinson as the tea girl who reveals her romantic longing in numbers like”Mad About the Boy.”\n\nVenue: Studio 54, New York (Through Dec. 5)Presented by: Roundabout Theatre Company in association with David Pugh & Dafydd Rogers and CineworldProduction: Kneehigh TheatreCast: Hannah Yelland, Tristan Sturrock, Joseph Alessi, Dorothy Atkinson, Annette McLaughlin, Gabriel Ebert, Edward Jay, Adam Pleeth, Damon DaunnoAdapted by/director: Emma RiceSet/costume designer: Neil MurrayLighting designer: Malcolm RippethProjection designer: Gemma Carrington, Jon DriscollOriginal music: Stu BarkerSound designer: Simon BakerProjection designers: Jon Driscoll, Gemma Carrington",
  "isFullReview": true,
  "textWordCount": 471,
  "archivePath": "data/archives/reviews/brief-encounter-2010/hollywood-reporter--frank-scheck_2026-02-06.html",
  "textFetchedAt": "2026-02-06T04:07:23.028Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "archiveOrgTimestamp": "20101001215209",
  "archiveOrgUrl": "http://web.archive.org/web/20101001215209/http://www.hollywoodreporter.com:80/hr/film-reviews/brief-encounter-theater-review-1004117319.story",
  "wrongFullText": "Advertisement\n\n \n \n\nTop Stories\n\n \n\nBeach Boys film project picked up by Fox\n\n'Jersey Shore' posts series high\n\nIrving Azoff tapped to join Clear Channel board\n\nCAA sells 35% stake to TPG Capital\n\nABC's 'My Generation' Drops 31%\n\n \nMore Top Stories &raquo;\n\n \n\nPhotos\n\nPhoto Galleries &raquo;\n\n \n\nLatest Reviews\n\n \n\nThey're Playing Our Song -- Theater Review\n\nNuremberg -- Film Review\n\nThe Pitmen Painters -- Theater Review\n\nThe Hungry Ghosts -- Film Review\n\nSpeed-Dating -- Film Review\n\nChicogrande -- Film Review\n\nAll the Night Long -- Film Review\n\nMysteries of Lisbon -- Film Review\n\nJerry Lee Lewis -- Concert Review\n\nSara Bareilles -- Concert Review\n\n \nMore Latest Reviews &raquo;\n\n \n Advertisement\n\nHollywood Reporter Home | Film News and Reviews | Entertainment and Technology News | Digital Media and Widgets | Box Office Finance | Music and Entertainment News | World Film News | Subscriptions | Editions | Newsletter | Movie and Entertainment Video | Celebrity and Movie News | About Us | Advertising Opportunities | FAQ | Sitemap | Entertainment News RSS\n\n© 2010 The Hollywood Reporter. All rights reserved. Terms of Use | Privacy Policy",
  "_showNotMentionedDiscoveryAttempted": true,
  "wordCount": 471,
  "tierReason": "Missing proper ending or other signals",
  "previousUrl": "http://www.hollywoodreporter.com/hr/film-reviews/brief-encounter-theater-review-1004117319.story",
  "urlDiscoveredAt": "2026-02-06T04:07:23.037Z",
  "urlDiscoveryMethod": "show-not-mentioned-recovery"
}
