{
  "showId": "hadestown-2019",
  "outletId": "AMNY",
  "outlet": "amNewYork",
  "criticName": "Matt Windman",
  "url": "http://www.amny.com/entertainment/hadestown-review-a-folk-music-take-on-an-ancient-greek-tale-1.11831751",
  "publishDate": "2019-04-17",
  "fullText": "Generally speaking, quasi-operatic concept albums (such as “Jesus Christ Superstar,” “Tommy” and “American Idiot”) tend to have underlying structural problems when they are staged later on as pieces of musical theater, such as one-dimensional characters and minimal narrative. Anais Mitchell, a Vermont-based singer-songwriter and a rising star in contemporary folk music, made such an album with “Hadestown,” basing it on the ancient Greek story of Orpheus and Eurydice. A stage adaptation, now being produced off-Broadway at New York Theatre Workshop, proves to be smart and romantic but dramatically underwhelming. According to the myth (which has been adapted into several operas), soon after the beautiful Eurydice marries Orpheus (a lyre-playing son of Apollo), she dies of a snake bite. Orpheus, undaunted, ventures into the underworld to bring back Eurydice. Hades, god of the underworld, will allow Eurydice to leave under the condition that Orpheus cannot look at Eurydice while they escape. In Mitchell’s hands, the sensitive Orpheus is too focused on playing the guitar to provide for Eurydice’s real world needs, so she independently ventures down to an industrialized underworld. While the lovers sing airy folk-pop, the denizens of the underworld use a livelier New Orleans jazz idiom. Director Rachel Chavkin (who staged the Broadway-bound electro-pop opera “Natasha, Pierre & The Great Comet of 1812”) lends a similarly atmospheric air to “Hadestown,” with the audience sitting around a wooden arena (not unlike a cockfighting pit) and the performers situated either center stage or on the structure’s steps. The deep-voiced and sharp-looking Patrick Page, who plays Hades, has become the go-to guy for any villain role (i.e. “The Lion King,” “Spider-Man,” “The Hunchback of Notre Dame”). The cast (which also includes Nabiyah Be, Damon Daunno and Amber Gray) is excellent and songs are either gently touching or catchy, but “Hadestown” does come off as slow, undercooked and choppy, more reminiscent of a concert than a theatrical work. “Hadestown” plays through July 3 at New York Theatre Workshop. 79 E. 4th St., nytw.org.",
  "isFullReview": false,
  "bwwExcerpt": "y of its mythic antecedents, it's the product of much metamorphosis, and its current manifestation feels lush, vigorous, and formally exciting, not to mention, in certain moments, witchily prescient. Matt Windman, amNY : Directed by Rachel Chavkin (\"Natasha, Pierre & The Great Comet of 1812\"), \"Hadestown\" contains a stunning visual design evoking both a New Orleans barroom scene and a smoldering mechanical underworld, complemented by the motion of turntables, a rollicking band, bold performances and expressive dance choreography. Whereas the previous Off-Broadway production was performed in the round, no impact has been lost in the transition to a traditional proscenium theater. The score - which contains airy folk-pop for the lovers and a livelier jazz idiom for the denizens of the underworld - comes off as distinctive and authentic by Broadway standards. Many of the songs are reflective in nature, which leads to some slow points, especially in Act Two. But, more often than not, \"Hade",
  "originalScore": null,
  "assignedScore": 80,
  "source": "bww-roundup",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:00:57.051Z",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HADESTOWN-Opens-On-Broadway--What-Did-The-Critics-Think-20190417",
  "textStatus": "complete",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.948Z",
  "showScoreExcerpt": "“Proves to be smart and romantic but dramatically underwhelming...In Mitchell’s hands, the sensitive Orpheus is too focused on playing the guitar to provide for Eurydice’s real-world needs, so she independently ventures down to an industrialized underworld...The cast is excellent and songs are either gently touching or catchy, but ‘Hadestown’ does come off as slow, undercooked and choppy, more reminiscent of a concert than a theatrical work.”",
  "textWordCount": 330,
  "textFetchedAt": "2026-01-25T14:25:18.265Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/hadestown-2019/AMNY--matt-windman_2026-01-25.html",
  "textQuality": "full",
  "sourceMethod": "bww-roundup",
  "scoreSource": "sentiment-positive",
  "scoreConfidence": "medium"
}