{
  "showId": "hadestown-2019",
  "outletId": "EW",
  "outlet": "Entertainment Weekly",
  "criticName": null,
  "url": "https://ew.com/hadestown-broadway-review/",
  "publishDate": "2019-04-17",
  "fullText": "​ Page Not Found This is not the page you are looking for. We hope you can go about your business by using our menu or search option. By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Accept All Cookies",
  "isFullReview": false,
  "bwwExcerpt": "ry, which ties together the myths of Orpheus and Eurydice, respectively played by Reeve Carney and Eva Noblezada, and Hades and Persephone, played by Patrick Page and Amber Gray. Jessica Derschowitz, Entertainment Weekly : As far as tales as old as time go, the stories of Greek mythology are pretty high up there, those epic stories of gods and men that have been told for thousands of years and inspired countless adaptations. But there's little that feels old or stately about the way those stories - those old songs, those sad songs - are told in Hadestown, which makes its Broadway bow Thursday with a journey to the underworld that feels like it sprung forth as something entirely new. Christopher Kelly, NJ.com : Still, if this is your first visit to \"Hadestown,\" it's likely to be a satisfying one. Mitchell and director Rachel Chavkin (\"Natasha, Pierre and the Great Comet of 1812\") do an impressive job updating an oft-recounted myth; in this telling, Orpheus (Reeve Carney) falls in love w",
  "originalScore": null,
  "assignedScore": 88,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HADESTOWN-Opens-On-Broadway--What-Did-The-Critics-Think-20190417",
  "textStatus": "partial",
  "textWordCount": 59,
  "archivePath": "data/archives/reviews/hadestown-2019/ew--unknown_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:38:45.877Z",
  "textIssues": [
    "Word count too low: 59 (min: 300)",
    "Show title not found in text"
  ]
}