{
  "showId": "hadestown-2019",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=OSWOND",
  "publishDate": null,
  "fullText": "Eva Noblezada, André De Shields, Reeve Carney. Photo: Matthew Murphy Quite possibly the most exciting new musical of the Broadway season is a trip to Hell and back. (I could say the same about some of its competitors, but in a far-less-positive spirit.) It also takes the nod for most-improved new musical: Not that there was much wrong with it at New York Theatre Workshop in 2016, but, in ushering her production to Broadway (with a stopover at London's National Theatre), director Rachel Chavkin has worked judiciously and well. This current Hadestown benefits from new design ideas, some fresh performers, and a clarified staging. From the moment the great André De Shields, as Hermes - yes, that Hermes -- enters, pulls back his jacket to reveal a silvery vest, and bares a vulpine smile of welcome, it's clear that everyone involved knows where Hadestown is coming from and what it wants to say. This is a crucial point, because Hadestown makes a case for the timelessness of its tale by crossbreeding two violently different sensibilities. It's the myth of Orpheus and Eurydice set to its very own distinctive blues stomp, an ancient Greek legend told in a low-down New Orleans juke joint. \"It's an old song/And we're gonna sing it again,\" goes the mesmerizing opening number, but the melody is a new one, loaded with bent notes, blaring trombones, and a furious, irresistible rhythm. It's a tragic tale, told with a wink and a roll of the shoulders, infused with a melancholy awareness of the gulf between \"the world we dream about/And the one we live in now.\" The events are sad, but the prevailing tone is insouciant; it's a timeless story of love and death turned into a sassy, defiant jazz funeral. It is also very much a musical for our times, set in a world out of joint -- where times are hard, beauty is scarce, and flowers don't bloom on schedule, a place marked by economic inequality, industrial pollution, and xenophobia. The only form of defiance is music: Thus, the gifted Orpheus is convinced that he can create \"a song so beautiful/It brings the world back into tune.\" (Anaïs Mitchell, author of the book, music, and lyrics, gives him a wordless melody so lovely that, for a moment, one thinks it just might do the trick.) He falls hard for the beautiful, bruised Eurydice, a young vagabond whose mind is forever on more practical matters. (\"I don't need gold, don't need silver/Just bread when I'm hungry, fire when I'm cold,\" she insists.) The feeling between them is mutual, but it's a mismatch of sensibilities that will have grave consequences. Neglected by Orpheus, who is obsessively devoted to his writing, Eurydice, eager to gain security, strikes a bargain with Hades, \"the king of silver, king of gold, and everything glittering under the ground,\" as well as the \"king of oil and coal and the riches that flow where those rivers are found.\" This pin-striped fat cat, oozing promises of security, dispatches her to Hadestown, where she joins a line of workers robotically laboring away, like the extras in Fritz Lang's Metropolis. Desperate to win back her love, Orpheus gets permission to enter the underworld and retrieve Eurydice, whose memory of life on earth is fast fading away. He finds her, of course; you probably know the rest. The central genius of Mitchell's conception is that jazz/blues music -- a folk idiom that notes the world's wicked ways with a glint in its eye and a today-we-dance attitude -- is the right choice to revivify this story for a contemporary audience. At the same time, this is no trivialization of a myth that confronts the essential fact of mortality: The ballads, like \"Epic\" (Orpheus' work in progress) and \"Wait for Me\" (in which Orpheus determines to save Eurydice) are infused with a longing as deep as the underworld itself. Mitchell also gives the story a profound immediacy by styling it as a tale of oppressed workers and social divides. Not for nothing has Hades built a wall around his kingdom: \"Who do we call the enemy?/The enemy is poverty/And the wall keeps out the enemy/And we build the wall to keep us free.\" The words feel culled from a MAGA rally somewhere in the Midwest. The cast members have absorbed the music into their blood, perfectly shaping their performances to the contours of a show that is sardonic and sorrowful in equal measure. Tall, floppy-haired, earnest Reeve Carney captures Orpheus' idealism and self-absorption, as well his too-late realization of Eurydice's loss, and he sings with a choir-boy purity. De Shields -- august, authoritative, all too aware how the story ends -- is a most impeccable guide, our personal Virgil (to borrow from another myth). As Persephone, Hades' unhappy spouse, Amber Gray is the last of the red-hot mamas: Dressed in a profusion of ruffles, her hair a mass of poodle curls ensnared in a snood, she slinks around the stage, singing like a canary after a too-long cocktail hour, stealing scenes like a master thief. Eva Noblezada, last seen in Miss Saigon, gives Eurydice a deeply wounded innocence, like a kewpie doll left out in the rain overnight. Saturnine, seductive, and delivering his numbers in a subterranean rumble that makes the late Leonard Cohen sound like a boy soprano in comparison, Patrick Page is the Hades of one's dreams -- or nightmares. Sashaying through the action in bias-cut frocks and feathered turbans are Jewelle Blackman, Yvette Gonzalez-Nacer, and Kay Trinidad as a trio of Fates, providing plenty of attitude and impeccable musical backup. Originally staged in-the-round at New York Theatre Workshop, Hadestown has been most effectively reconfigured for a proscenium house by Chavkin and her design team. Rachel Hauck's multilevel set is marked by grimy walls, utilitarian furnishings, and a curving, wrought-iron staircase leading to a balcony from which Hades observes the foolishness of humans; it's the kind of bar that one stumbles into at three in the morning, when one is desperate and a drink can't be found anywhere else. Bradley King's endlessly inventive lighting constantly transforms the space with saturated uplighting effects on the walls, stark white washes, sinister shadowy effects, and a wall of light behind the door on Hades' balcony. Michael Krass' costumes weave lines of glitter into the men's suits, providing 1940s chic for the ladies and a drop-dead fur for Persephone. The sound design, by Nevin Steinberg and Jessica Paz, aided by the arrangements and orchestrations of Michael Chorney and Todd Sickafoose, provide a first-rate blend of voices and instruments, preserving the intelligibility of the lyrics above all. Mitchell, coming from a nontheatrical background, doesn't aim for perfect rhymes, a choice that might irritate some hardcore musical-theatre fans. But there is plenty of poetry in her lyrics -- for example, when Eurydice wonders, \"Lover, tell me if you can/Who's gonna buy the wedding bands?/Times being what they are/Hard and getting harder all the time\"; or when Persephone, facing another dreary season in Hadestown, sings, \"Gimme morphine in a tin/Gimme a crate of the fruit of the vine/Takes a lot of medicine/To make it through the wintertime\"; or when Hades, wooing Eurydice, croons, \"Hey, little songbird, let me guess/He's some kind of poet, and he's penniless/Give him your hand, he'll give you his hand-to-mouth/He'll write you a poem when the power is out.\" The music is reliably gorgeous throughout, aided by indelible bits of musical staging by David Neumann: the chorus slowly tipping their bar tables in a silent, mournful ballet; a set of low-hanging lighting units sent swinging out into the house; a sizzling shimmy for Persephone that raises the temperature onstage by several degrees; a gentle waltz for her and Hades that is suddenly, shockingly, shot through with deep feeling. Love wins, according to a popular saying these days. Actually, in Hadestown, love comes in second; like all the great Greek myths, it is founded on an awareness of humanity's limits and -- in a final staging coup that suggests the story is never really over -- our need to keep trying until we get it right. As Hermes sings, \"Cos here's the thing/To know how it ends/And still begin/To sing it again/As if it might turn out this time/I learned that from a friend of mine.\" It's a lovely way to end a show that casts a seductive spell in its first note and never lets you go. --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1425,
  "archivePath": "data/archives/reviews/hadestown-2019/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:53:37.725Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}