{
  "showId": "hadestown-2019",
  "outletId": "ny1-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.ny1.com/nyc/all-boroughs/news/2019/04/18/roma-torre-theater-review-hadestown-rachel-chavkin-reeve-carney-eva-noblezada",
  "publishDate": null,
  "fullText": "\"Hadestown\" is no longer an underground hit. In its move up to Broadway, there were so many ways it could have derailed, but at every level, the creative team behind the stunningly visceral production delivered in spades. And while this free-wheeling version of the Orpheus myth may not appeal to everyone, it is a collaborative tour de force.\n\nInspired by the tragic story of Orpheus's great love for Eurydice, Anais Mitchell wrote the book and music as a New Orleans style folk opera. She placed her characters in an apocalyptic setting where cold and hunger rule their lives and, for some, death is the only relief.\n\nHades is the God of the Dead, and here he presides over a thriving but hopeless existence where lost souls are indentured servants are working a factory in a state of perpetual misery.\n\nHades's wife, Persephone, is the Goddess of the Seasons, and as the myth goes, she's allowed to leave the underworld for six months of the year to warm the earth in spring and summer.\n\nOrpheus is a musician whose songs have the power to charm and alter fate, and so when his beloved Eurydice agrees to give up her life, he descends to the underworld to retrieve her.\n\nThe tale's message is all about the power of love over death. But this telling goes further, commenting on current political themes: economic inequality, the environment, and there's even a hauntingly prescient song written nine years ago about Hades's wall.\n\nIt started as a concept album before director Rachel Chavkin worked her own theatrical magic. Known for her Tony-nominated direction of Broadway's \"The Great Comet,\" she's a master at corralling disparate elements into a singular vision.\n\nAnd so, with Mitchell's glorious folk and jazz infused score, Chavkin crafted an exquisitely original production with a dream company featuring terrific choreography and a fabulous cast, including some very feisty Fates, the inimitable Andre De Shields as the all-knowing narrator Hermes, Reeve Carney as the sweet-natured Orpheus, Eva Noblezada's hard-knocks Eurydice, and Broadway's favorite fog-horned villain Patrick Page. Amber Gray's Persephone will bring to mind a young Eartha Kitt, bubbling with attitude and an outrageously infectious sense of abandon.\n\nLove it or not, the theatre gods should be smiling.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 373,
  "archivePath": "data/archives/reviews/hadestown-2019/ny1-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:54:53.933Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250913164018",
  "archiveOrgUrl": "http://web.archive.org/web/20250913164018/https://ny1.com/nyc/all-boroughs/news/2019/04/18/roma-torre-theater-review-hadestown-rachel-chavkin-reeve-carney-eva-noblezada"
}