{
  "showId": "hadestown-2019",
  "outletId": "nytheatreguide",
  "outlet": "New York Theatre Guide",
  "criticName": "Donna Herman",
  "url": "https://www.newyorktheatreguide.com/reviews/review-of-hadestown-on-broadway",
  "publishDate": "April 2019",
  "fullText": "Review of Hadestown on BroadwayDonna HermanApril 21, 2019, 00:00Going to hell has never been as much fun as seeing a performance of Anaïs Mitchell's musical Hadestown, now playing at the Walter Kerr Theatre. And don't let its origins in Greek mythology scare you off because there's a built-in narrator in the form of the god Hermes (André De Shields) whose job was to guide souls into the afterlife. In Hadestown, his first task is to introduce all the characters in a rollicking number \"Road to Hell.\"\n\nMitchell, the talented singer/songwriter who is responsible for the whole shebang, music, lyrics and book, has intertwined the myth of Orpheus (Reeve Carney), son of the God Apollo and muse Calliope and Eurydice (Eva Noblezada), wood nymph; with that of Hades (Patrick Page), god of the underworld and Persephone (Amber Gray), daughter of the god Zeus and goddess of the harvest Demeter.\n\nThe story that unfolds in Hadestown is that Hades falls in lust with Persephone and abducts her to the underworld where they fall in love and marry. Demeter is so distraught she declares that there will be no more growth or harvest until Persephone returns. Zeus brokers a deal whereby Persephone spends 6 months out of the year above ground and 6 months out of the year below, thus creating the seasons. So, Persephone rides a train back and forth between the underworld known as Hadestown where she's the only living soul, and the world above. But Hades keeps shortening her time up above because he misses her. And the earth gets colder.\n\nMeanwhile, Orpheus is trying to write a song that will restore order to the seasons when he runs across Eurydice, with a little help from Hermes and The Fates (Jewelle Blackman, Yvette Gonzalez-Nacer, Kay Trinidad), who is wandering around cold and hungry. She's initially unimpressed until he starts singing. In the only off note in the production, they fall in love (unfortunately no chemistry between the two - Reeve Carney is a little too much of a hesitant milquetoast to be a believable love interest for the determined and charming Eva Noblezada) and marry. Whereupon Orpheus immediately goes back to songwriting and neglects Eurydice.\n\nSo, what's a poor, once again cold and hungry girl to do? Where does she go to get warm? You guessed it, Hadestown. Where Eurydice becomes one of the poor lost souls in the underworld, trapped behind the wall Hades has erected. And explains in the Act One finale \"Why We Build The Wall\" that brings down the house. If I didn't know that Mitchell wrote the score in 2010, I'd swear she wrote it within the last two years.\n\nI won't spoil the second act except to say that it's about Orpheus' trip to Hadestown to find Eurydice to try to rescue her. And that Michael Krass' costumes for the Chorus in the underworld are outstanding, as is the visually stunning dance number choreographed by David Neumann done with headlamps and swinging lights. And if the love story between Orpheus and Eurydice didn't smolder, Patrick Page and Amber Gray set the house on fire as Orpheus and Persephone. Their song \"How Long?\" and the dance that went with it had me melting in my second row seat when I saw both of them crying. Be still my heart.\n\n\"All your favorite Greeks are heading somewhere in Hadestown, the sumptuous, hypnotic and somewhat hyperactive musical that opened on Wednesday night after its own twisty 13-year road to Broadway.\"Jesse Green for New York Times\n\n\"It looks spectacular—thanks to Rachel Hauck's set, which features three turntables in concentric circles, and Bradley King's lighting—but it has a human scale; it feels less like a standard Broadway musical than a concert, a gathering, a happening. (The seven members of the excellent onstage band are called out by name for applause.) And, most important, it has Mitchell's score: a joyful combination of folk, pop, Dixieland and blues that will make you want to rehear it as soon as the lights come up. You'll be singing it again in your head for days.\"Adam Feldman for Time Out New York\n\n\"Yes, composer Anaïs Mitchell's musical retelling of the Orpheus and Eurydice myth, which opened Wednesday on Broadway, sounds pleasant and looks more expensive than it did in 2016 at New York Theatre Workshop. But this classic tale of love — he looks back, she gets trapped in the underworld for all eternity — is still too slick and sterile for us to give a damn about her damnation.\"Johnny Oleksinski for New York Post\n\n\"In \"Road to Hell,\" the exhilarating opening number of the utterly fabulous Hadestown, Hermes, the conductor of souls into the afterlife, invites us to \"Ride that train to the end of the line.\" He's played with seductive authority and knowing humor by the eternally elegant Andre De Shields, outfitted like a superfly pimp in a flashy silver suit, and it's hard to imagine anyone resisting his call. He sells a ticket to a bewitching journey that pays off at every turn.\"David Rooney for Hollywood Reporter\n\n\"Hadestown triggered a lot of buzz when this wholly American show (which came to the stage by way of a concept album) premiered at Off-Broadway's New York Theatre Workshop in 2016. Arriving on Broadway with its earthly delights more or less intact, this perfectly heavenly musical — with book, music and lyrics by Anaïs Mitchell — should stick around for a while.\"Marilyn Stasio for Variety\n\nThis eight-time Tony-winning Best Musical puts a fresh spin on Greek myths, infusing them with jazz and folk music. Struggling to survive, Eurydice agrees to work at Hades's soulless factory, and Orpheus embarks on a dangerous quest to rescue her. Get tickets to the genre-defying Hadestown, which combines disparate histories and music styles into a groundbreaking story.\n\nHadestown is playing at Walter Kerr Theatre . The theatre is located at 219 West 48th Street (between Broadway and 8th Avenue), New York, 10036.\n\nThe running time of Hadestown is 2hr 30min. Incl. 1 intermission.\n\nThe recommended age for Hadestown is Ages 8+. Children under 5 are not permitted in the theater..\n\nBook tickets for Hadestown on New York Theatre Guide.\n\nAnaïs Mitchell wrote both the script and the songs of Hadestown. She had been working on the musical since 2006, when an early version premiered in Vermont, and worked with director Rachel Chavkin to turn that show and its 2010 concept album into a full-fledged musical.\n\nThe songs in Hadestown include \"Wait For Me,\" \"Livin' It Up on Top,\" \"We Raise Our Cups,\" and \"When the Chips Are Down.\" Hadestown is mostly sung-through, so snippets of songs appear throughout the show in place of traditional scenes. Learn about all the songs in Hadestown on Broadway.\n\nHadestown is recommended for children 8 and older. There is no content that would be inappropriate for young children. Please note that children 4 and younger are not permitted in Broadway theatres.\n\nRachel Chavkin is the director of Hadestown and won a 2019 Tony Award for her work. She is also a creative consultant on the musical, as she helped Anaïs Mitchell expand Hadestown from a concept album into a full-fledged musical.\n\nHadestown is primarily based on the Greek myth of Orpheus and Eurydice, but the musical also weaves in the myth of Hades and Persephone. Learn more about the Greek mythology that inspired Hadestown.\n\nHadestown began Broadway performances in March 2019 and won eight Tony Awards that year. The show is now the longest-running production to ever play the Walter Kerr Theatre.\n\nNew York Theatre Guide's four-star Hadestown review reads, \"Going to hell has never been as much fun as seeing a performance of Anaïs Mitchell's musical Hadestown.\" The show has a unique folk and jazz score and tells a timeless romantic tragedy, and it is among the best-reviewed Broadway shows on New York Theatre Guide.\n\nOriginally published on Jan 25, 202219:46\n\n‘Titanique’ sets Broadway transfer with Marla Mindelle\n\n2Carrie Coon and Namir Smallwood lead the creepy-crawly love story 'Bug' on Broadway\n\n3Broadway shows to see based on your favorite book\n\n4The best Broadway and Off-Broadway shows for your parents this holiday season\n\n5Year in review: Top Broadway theatre highlights of 2025\n\n6'Little Bear Ridge Road,' starring Laurie Metcalf, to close on Broadway\n\n7Complete casting set for 'The Balusters' on Broadway\n\n8John Cameron Mitchell to star in ‘Oh, Mary!’ on Broadway\n\n9Julie Benko and more to join 'Ragtime' Broadway cast\n\n10Shoshana Bean to join ‘The Lost Boys’ Broadway cast",
  "isFullReview": true,
  "showScoreExcerpt": "Going to hell has never been as much fun as experiencing this production. The musical makes ancient Greek myths accessible through its narrator character. Herman explains the dual mythological storylines woven together - the tragic romance of Orpheus and Eurydice alongside Hades and Persephone's relationship. The show successfully balances classical themes with contemporary entertainment value.",
  "originalScore": "4 stars",
  "assignedScore": null,
  "source": "webfetch-scraped",
  "textStatus": "complete",
  "textQuality": "full",
  "sourceMethod": "archive",
  "textWordCount": 1415,
  "archivePath": "data/archives/reviews/hadestown-2019/nytheatreguide--donna-herman_2026-01-26.html",
  "textFetchedAt": "2026-01-26T02:57:41.416Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (stealth_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Bright Data not configured (requires Web Unlocker zone setup)"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "archiveOrgTimestamp": "20251216123540",
  "archiveOrgUrl": "http://web.archive.org/web/20251216123540/https://www.newyorktheatreguide.com/reviews/review-of-hadestown-on-broadway"
}