{
  "showId": "hadestown-2019",
  "outletId": "theatermania-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theatermania.com/broadway/reviews/is-hadestown-the-smartest-new-musical-on-broadway_88455.html",
  "publishDate": null,
  "fullText": "One could decorate multiple urns with all the Greek gods currently occupying the stage of the Walter Kerr Theatre, home to the Broadway debut of Anaïs Mitchell's Hadestown. Steeped in ancient mythology and brilliantly staged, Hadestown appears to be the smartest new musical on Broadway — but does that automatically make it a great show? The timeless story on which it is based certainly has potential.\n\nThe son of a muse, Orpheus (Reeve Carney) is a man with a supernatural gift for song, and he wants to share that with Eurydice (Eva Noblezada). She falls in love with him in the summer, but winter comes fast when Persephone (the show-stealing Amber Gray) leaves the Earth's surface to be down below with her husband, Hades (Patrick Page) — the rocky marriage between the deities of vegetation and death explains the recent extremity in the weather. As the days become colder and food becomes scarce, Orpheus continues to strum his guitar. With her prospects for survival dimming, Eurydice does the only thing she can do: She takes a job in Hades's mine. It's a position with eternal job security, provided Orpheus cannot find a way to rescue her.\n\nComposer and book writer Anaïs Mitchell originally created Hadestown as a concept album in 2010. Director Rachel Chavkin helped turn it into a stage musical at New York Theatre Workshop in 2016, and it has since evolved through productions in Edmonton and London. Mitchell's incredible score, a fusion of New Orleans jazz and American folk music, remains the heart of the show, all performed magnificently by this nimble and talented cast.\n\nAs the three fates, Jewelle Blackman, Yvette Gonzalez-Nacer, and Kay Trinidad are particularly impressive, singing in complex harmony while playing instruments and dancing up a storm. Playing the god Hermes, André De Shields conveys an authority that feels as ancient as the Earth, holding the story together with his simple yet powerful narration. Feeling a lot larger than it is, the five-person \"workers\" chorus fills out Chavkin's handsome and inventive staging.\n\nThat staging maintains the resourcefulness of the downtown production while maximizing the potential of a Broadway budget. Taking its cue from the score, Rachel Hauck's multi-tiered set conjures the French Quarter. In a breathtaking scene transition, its stucco walls fall away to reveal the enormity of the Hadestown mine, which seems to go on forever in Bradley King's industrial lighting. King collaborates with costume designer Michael Krass to place lights in the miners' helmets, and with choreographer David Neumann for the number \"Wait for Me,\" which features scoop lights elegantly swinging over the stage and audience. Neumann makes good use of Hauck's rotating stage to suggest the backbreaking mechanical churn of Hadestown. Krass's grimy, somewhat erotic workmen's overalls complete the effect.\n\nSound designers Nevin Steinberg and Jessica Paz contribute to the whirring, mythic world of Hadestown, while ensuring that every one of Mitchell's lyrics is audible. Music director Liam Robinson ably leads the cast in some of the most difficult vocal music currently on Broadway, from the heights of Orpheus's falsetto to Hades's cavernous bass. Hadestown is visually and aurally stunning — which is why I was disappointed that it left no emotional impact on me.\n\nMy inability to invest in the central love story, in particular, might have something to do with the strength of its foil. Despite their rough patch, Hades and Persephone's relationship seems worthwhile — their coupling makes them better individuals, and better gods (Gray and Page have been with the show since its world premiere, and both have emotionally resonant performances to show for it).\n\nNot so with the young lovers. The program tells us of Orpheus's immortal lineage and boundless charm. Carney delivers on the first quality with his savant performance, depicting a man singularly focused on his song. But there's nothing charming about that, especially in Carney's spacey, twitchy portrayal. It's easier to feel something for Noblezada's sympathetic Eurydice, even if it's mostly pity. As she was surrounded by the hardworking and muscle-bound denizens of Hadestown, it seemed like she could do much better than Orpheus, a shiftless dude with a guitar and few marketable skills.\n\nWhile I left this musical tragedy with dry eyes, I wondered if this was not the intention of Hadestown. Certainly, its epic staging and heavy-handed politics smack of Brecht, who was much more interested in teaching his audience than inducing catharsis. But even intellectually, Hadestown is not nearly as satisfying as one might hope.\n\nMuch has been made of Mitchell's prescient vision of Hades as a wall-building tycoon who exploits the fear of outsiders to get his workers to obey. The song \"Why We Build the Wall\" still produces chills (especially as performed by the magnificently malevolent Page), but two years of living in Trumptown has made it feel less insightful than it once did. Mitchell's take on nativist politics is not so much exacting as it is on the nose. Similarly, wouldn't it be nice to chalk climate change up to the 7,000-year itch of an old married couple? With its emphasis on heavy industry and even heavier adolescent sentiment, Hadestown has less to say about today's America than one might think. This is particularly apparent after seeing the new Broadway revival of Oklahoma!, a musical that strikes at the heart of American mythology without invoking a single representative of the pantheon.\n\nStill, if you're looking for a gorgeous, formally challenging, and finely performed show wrapped in the comforting blanket of the classics, you can do no better than Hadestown, a musical fated to be the snob hit of this Broadway season.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 934,
  "archivePath": "data/archives/reviews/hadestown-2019/theatermania-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T02:05:09.175Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20221227195357",
  "archiveOrgUrl": "http://web.archive.org/web/20221227195357/https://www.theatermania.com/broadway/reviews/is-hadestown-the-smartest-new-musical-on-broadway_88455.html"
}