{
  "showId": "hadestown-2019",
  "outletId": "thedailybeast-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.thedailybeast.com/hadestown-the-broadway-musical-that-takes-its-sweet-sounding-time-going-to-hell-and-back?source=articles&via=rss&utm_source=dlvr.it&utm_medium=twitter",
  "publishDate": null,
  "fullText": "Hadestown has so much fun telling, as it puts it, this “sad tale” that even though this retelling of a well-trodden Greek myth feels slight, it also makes for a joyful performance. Anaïs Mitchell’s musical, which opens on Broadway tonight at the Walter Kerr Theatre (to September 1), is delicious to look at and listen to—truly, my new earworm is “Way Down Hadestown”—even if its story is as wan as its central couple.\n\nMuch else, including Bradley King’s notably stunning lighting and an orchestral landscape that embraces folk, jazz, blues, and Americana, is glorious.\n\nIt is directed by Rachel Chavkin, the multi-award winning and nominated director of Natasha, Pierre & The Great Comet of 1812, which Hadestown shares certain artistic echoes with: the richness of the music, the presence of an excellent orchestra of musicians among the actors, the recasting of an intense, serious story into something extravagant and lush.\n\nThe manner and mode of the storytelling is more important than the story itself. In Hadestown that is immediately made clear by the wonderful André De Shields as Hermes, who invites us into this tale with a hearty cry of welcome, echoed to the performers and musicians.\n\nDe Shields, with his clear, commanding voice, is the perfect narrator: he knows how the story goes, but he also knows why we tell the story no matter how sadly it turns out. In a beautiful shiny blue suit, he saunters in a way any human wishes they could saunter, like a swaggering, languid cat. At 73, would we all look as dashing and limber as André De Shields.\n\nThat story he narrates is a version of the story of Orpheus (Reeve Carney) and Eurydice (Eva Noblezada). Hadestown is the factory presided over by Hades (Patrick Page), a world below connected to the world above ground by a train on which occasionally travels Hades’ wife Persephone (Amber Gray) to party and, no pun intended, hellraise.\n\nPersephone is a bawdy lush, staring at us pie-eyed, and screeching and singing all at once in ‘Our Lady of The Underground,’ a good-time party person at a painful loss herself. Page’s Hades is a deep, bass-and-then-some-voiced baddie, who’s not so bad. Apparently he’s just forgotten how to love, and instead is enlisting the residents of Hadestown—made up of the extremely energetic “workers’ chorus”—to build a wall “to keep us free,” as the song goes. Despite the sharp resonance with President Trump’s desired barrier, this was written long before that particular campaign pledge.\n\nChoreographed by David Neumann, Afra Hines, Timothy Hughes, John Krause, Kimberly Marable, and Ahmad Simmons may be the best company of singers and dancers on Broadway right now.\n\nThe company is gathered on a Rachel Hauck-designed set that looks like a distempered mansion with winding stairs, perches, and dugouts. But this one-set-fits-all comes to be confusing, with no differentiation between the world above ground and world below.\n\nWhen it comes time for Orpheus and Eurydice’s epic, perilous journey, it doesn’t feel that perilous and epic, as they are required to walk around in circles on the same bit of stage we have been watching them sing and dance on for the last two hours. Commanding Orpheus not to turn around in such circumstances feels a little absurd; he's going to have to.\n\nAs for the ill-fated young lovers themselves, both Noblezada and Carney are charming performers, but their relationship never takes off enough to care about it. Dull and docile Eurydice and Orpheus are subsumed by the fuss and pizazz around them. They fade into the background in their own story.\n\nThey meet, he magically produces a red flower, and then all too suddenly Eurydice (at least in the plot of Hadestown) is inexplicably making a deal with Hades to consign herself to the underworld.\n\nDelight instead in Carney’s mournful falsetto, as his song of love and connection melts Hades’ hardened heart. Also delight in the Fates—Jewelle Blackman, Yvette Gonzalez-Nacer, and Kay Trinidad—whose perfectly sung harmonies are as sweet-sounding as their presence is menacing to the young couple.\n\nThe music and dancing has a lot of work to do because Hadestown’s main story circles and recircles itself (complete with reprises of songs) like a plane waiting to land, until—with not much stage left to trek—Orpheus makes the worst decision at the worst moment.\n\nThe musical most ill-serves Eurydice: where has she come from, what does she want? How does the spunky, punky independent-seeming woman who arrives in town become quickly so battered down and victim-y?\n\nAs repetitive as the musical becomes, Chavkin’s busy, warm staging and its wonderful music and energy means Hadestown is like listening to an epic song around a roaring fire. As De Shields intimates at the end, when he describes why this particular myth is told and retold, Hadestown is about the art of storytelling—less a tragic love story than a rousing celebration and affirmation of a craft.\n\nGot a tip? Send it to The Daily Beast here.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 827,
  "archivePath": "data/archives/reviews/hadestown-2019/thedailybeast-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T02:06:53.242Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "sourceMethod": "brightdata"
}