{
  "showId": "hadestown-2019",
  "outletId": "thefrontrowcenter-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://thefrontrowcenter.com/2019/04/hadestown-2/",
  "publishDate": null,
  "fullText": "Posted by Donna Herman | Apr 22, 2019 | Reviews\n\nI realize that a trip to hell doesn’t sound like a good night out – but trust me – you want to go to Hadestown.  It’s not a punishment, it’s a reward with great music, incredible voices, some wonderful performances, and a surprising love story.  Based on a couple of Greek myths, it’s a home run, high-toned but accessible, moving, engaging, filled with great music and voices and just plain fun!  I heard one audience member say on the way out “I never thought I’d say it, but this was better than Hamilton!” I’m not sure I’d go quite that far, but I sure enjoyed it! Read my full review here.\n\nHadestown Music, Lyrics & Book by Anaïs Mitchell, Developed with & Directed by Rachel Chavkin, Choreographed by David Neumann\n\nWITH: Reeve Carney (Orpheus); Eva Noblezada (Eurydice); Amber Gray (Persephone); Patrick Page (Hades); André de Shields (Hermes); Jewelle Blackman (Fate); Yvette Gonzalez-Nacer (Fate); Kay Trinidad (Fate); Afra Hines (Workers Chorus); Timothy Hughes (Workers Chorus); John Krause (Workers Chorus); Kimberly Marable (Workers Chorus); Ahmad Simmons (Workers Chorus).\n\nORCHESTRA:  Liam Robinson (Conductor/Piano/Accordion); Dana Lyn (Violin); Marika Hughes (Cello); Michael Chorney (Guitar); Brian Drye (Trombone/Glockenspiel); Robinson Morse (Double Bass); Ben Perowsky (Drums/Percussion); David Lai (Music Coordinator)\n\nScenic Design by Rachel Hauck; Costume Design by Michael Krass; Lighting Design by Bradley King; Sound Design by Nevin Steinberg & Jessica Paz; Arrangements & Orchestrations by Michael Chorney & Todd Sickafoose; Musical Director & Vocal Arrangements by Liam Robinson; Dramaturg, Ken Cerniglia; Casting by Stewart/Whitley; Production Stage Manager, Beverly Jenkins; Paul J. Smith, Stage Manager.  Presented at the Walter Kerr Theatre, 219 West 48th Street, NYC.  For tickets call 877-250-2929 or visit https://www.ticketmaster.com/hadestown-ny-tickets/artist/2580967?awtrc=true, or visit the box office Monday – Saturday: 10AM – 8PM or Sunday: 12PM – 6PM.  Running time is 2 hours and 30 minutes including one 15 minute intermission.\n\nDonna Herman is a native New Yorker and a self-confessed theater addict.  It all started in her childhood, which was spent on movie and television sets and in dark empty theaters while her mother, an actress, and her father, a make-up artist and playwright/screenwriter, worked.  She knew she wanted to be an actress at 4 years old while on location with her father who was working on the movie “West Side Story.”  They were filming the “Officer Krupke” number on the street and Donna was inside the police barricades being helpful and pressing the lever on the coffee urn for the crew.  Meanwhile, the kids from the neighborhood were pressed against the sawhorses looking in.  She knew then she always wanted to be on the inside. But it wasn’t until her 8th birthday when she saw her first Broadway show, “My Fair Lady,” that she fell prey to her addiction.\nDonna went on to act throughout her school career and attended Boston University’s School of Fine Arts Theater Program where she studied Acting and Directing.  After graduation, she returned to NYC and began the life of a struggling actress. She was fortunate enough to originate the role of Chang in John Jesurun’s downtown cult serial classic play “Chang In A Void Moon” which performed a new episode at The Pyramid Club on Avenue A every Monday night for almost a year in the 80’s.  Many downtown notables were in the cast including Steve Buscemi, Black-Eyed Susan, David Cale, Greg Mehrten, and Anna Kohler.\nWhile pursuing acting, Donna made money by working in recording studios and eventually got hired full time to manage Spyro Gyra’s new recording studio when Julian Lennon was recording his first album there.  From there she became the Production Coordinator on the film of his concert tour for his production company.  This led her to a job with the award winning audio post production facility where she stayed for 12 years and was the Controller.  From there she went to Charlex, Inc. an award winning special effects and design company for the advertising industry, where she was the CFO and stayed for 17 years.\nBut her love for the theater has never waned and living in New York, she has always been able to indulge it.  She has even been called to revise her role as Chang occasionally over the years, the latest for episodes 59 to 61 in 2015.  She is now looking to get back to a more creative life and reviewing theater and designing jewelry.\n\nOpening Night Our Criteria Get our reviews by email\n\nJoin our mailing list to receive the latest news and updates from our reviewers.\n\nJoin our mailing list to receive the latest reviews from the Front Row Center. We will email you all of the reviews twice weekly.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 784,
  "archivePath": "data/archives/reviews/hadestown-2019/thefrontrowcenter-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T02:07:27.315Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240619204650",
  "archiveOrgUrl": "http://web.archive.org/web/20240619204650/https://thefrontrowcenter.com/2019/04/hadestown-2/"
}