{
  "showId": "hadestown-2019",
  "outletId": "thewrap-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.thewrap.com/hadestown-broadway-review-anais-mitchell-musical-orpheus-eurydice-trump/",
  "publishDate": null,
  "fullText": "Skip to content\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\t\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\t\t\n\t\t\n\n\t\t\n\t\t\t\n\n\n\t\n\n\t\n\t\t\n\t\t\t\n\t\t\t\tWatching the stirring and visually stunning Act 1 finale of &#8220;Hadestown,&#8221; a folk-blues opera based on the ancient Greek myth of Orpheus and Eurydice, it&#8217;s hard to imagine that singer-songwriter Anaïs Mitchell first presented this song in a concept album nearly a decade ago. After all, Patrick Page&#8217;s king of the Underworld uses his basement-dwelling basso voice to sing a positively Trumpian ode called &#8220;Why We Build the Wall&#8221; that concludes that barriers &#8220;keep us free&#8221; because &#8220;the Wall keeps out the enemy.&#8221;\n\nThat&#8217;s not the only way in which Mitchell&#8217;s new musical, which opened Wednesday at Broadway&#8217;s Walter Kerr Theatre after successful runs Off Broadway and in London, finds a contemporary spin on an ancient story. Although the normal cycle of seasons is out of whack at the top of the show, the cause isn&#8217;t climate change but Hades&#8217; jealousy over the long absence of his spring-bringing wife Persephone (Amber Gray).\n\n&#8220;It&#8217;s an old tale from way back when,&#8221; the sprightly, shimmery-suited André De Shields reminds us as our narrator, Hermes. &#8220;Gonna sing it anyway.&#8221; And there&#8217;s much that Mitchell & Co. unearth about the Greek myth that&#8217;s a delight to explore.\n\nStart with Mitchell&#8217;s supple and often haunting score, a melodic mashup of folk-pop, jazz, blues, ragtime and even a tinge of gospel &#8212; played by an onstage seven-piece band, with occasional accompaniment by the cast.\n\nThe show is also blessed with some memorable performances, especially Page and Amber Gray, who vamps it up as Hades&#8217; estranged Mrs. like a veteran cabaret star. The show also gets a jolt from Jewelle Blackman, Yvette Gonzalez-Nacer and Kay Trinidad as The Fates, a trio of harmonizing goddesses who hover about the action and intervene in the lives of our human heroes.\n\nThose humans prove more problematic, though, particularly Reeve Carney (&#8220;Penny Dreadful,&#8221; &#8220;Spider-Man: Turn Off the Dark&#8221;) as the struggling musician Orpheus, whose songwriting gifts, we keep being told, are &#8220;touched&#8221; by destiny to set the far-too-wintry world back in balance. Carney sings well, but often seems to be straining at the upper limits of his vocal register. And it&#8217;s hard to see what the more practical-minded Eurydice (the strong voiced Eva Noblezada, &#8220;Miss Saigon&#8221;) initially sees in him since his musical precocity remains a shade or two short of effortless.\n\nPart of this imbalance is the nature of the story: While the gods of the underworld are not outright villains, Page&#8217;s Hades and Gray&#8217;s Persephone are a hell of a lot more fun to watch &#8212; the devil always is &#8212; and the show tends to drag whenever it lingers on the more earthbound storyline.\n\nLike its ill-fated hero, the production finds a way to look backward even as it strikes a path forward in its retelling of a familiar story.\n\nRachel Hauck&#8217;s eye-popping set design, Michael Krass&#8217; costumes and Bradley King&#8217;s lighting all suggest a kind of Depression-era New Orleans setting that nonetheless feels of the moment &#8212; or, perhaps, timeless. And as she did with &#8220;Natasha, Pierre & The Great Comet of 1812,&#8221; director Rachel Chavkin creates some mesmerizing stage pictures. (Only the climax, with Orpheus&#8217; final encounter with his beloved Eurydice, seems strangely underplayed.)\n\nChavkin, her production team and cast are working at the top of their form &#8212; and they go a long way to masking some of the show&#8217;s shortcomings. Mitchell is a better composer than a lyricist, alas, and sometimes leans too heavily on De Shields&#8217; narration to advance the plot instead of her occasionally repetitive songs. And the fact remains that there&#8217;s just not much story here &#8212; not nearly enough for a two and a half hour show.\n\nStill, there is something refreshing about a new musical that nods to the past even as it presents stage images and melodies that seem entirely fresh and new. Like Orpheus himself, &#8220;Hadestown&#8221; &#8220;could make you see how the world could be in spite of the way it is.&#8221;",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 658,
  "archivePath": "data/archives/reviews/hadestown-2019/thewrap-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T02:08:04.570Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250709181458",
  "archiveOrgUrl": "http://web.archive.org/web/20250709181458/https://www.thewrap.com/hadestown-broadway-review-anais-mitchell-musical-orpheus-eurydice-trump/"
}