{
  "showId": "hadestown-2019",
  "outletId": "THR",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/hadestown-theater-review-1202512/",
  "publishDate": "2019-04-17",
  "fullText": "Matthew Murphy Share on Facebook Share on X Google Preferred Share to Flipboard Show additional share options Share on LinkedIn Share on Pinterest Share on Reddit Share on Tumblr Share on Whats App Send an Email Print the Article Post a Comment In &#8220;Road to Hell,&#8221; the exhilarating opening number of the utterly fabulous Hadestown , Hermes, the conductor of souls into the afterlife, invites us to &#8220;Ride that train to the end of the line.&#8221; He&#8217;s played with seductive authority and knowing humor by the eternally elegant Andre De Shields, outfitted like a superfly pimp in a flashy silver suit, and it&#8217;s hard to imagine anyone resisting his call. He sells a ticket to a bewitching journey that pays off at every turn. Spun out of a 2010 concept album by singer-songwriter Anais Mitchell and developed together with director Rachel Chavkin as a seamless theatrical experience, this beguiling, virtually sung-through musical is notable for the expressive beauty of its score, the dark imagination of its stage pictures and the clarity of its storytelling. Performed by a first-rate cast and played with spirited feeling by seven onstage musicians, it arrives on Broadway with a furnace-like blast of creativity. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-article-mid-article-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[300,250],[2,2],[300,251],[620,350],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); The Orpheus and Eurydice myth has been a source of inspiration to artists across multiple forms for centuries, in music alone ranging from Monteverdi through Gluck to Offenbach, from Don Shirley to Nick Cave, Arcade Fire and Sara Bareilles. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-dsk-tab-mid-article2-uid1' ) .setTargeting( 'pos', [\"mid\",\"mid-article2\",\"mid-articleX\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article2\") .addSize([[300,250],[300,251],[620,350],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); This version bears passing similarities to the 1959 Marcel Camus film Black Orpheus , which is also being developed as a Broadway musical. While Rio de Janeiro, with its carnival atmosphere and bossa nova sounds, provided a vivid backdrop for that retelling, Mitchell&#8217;s musical finds corresponding textures in the French Quarter decadence of New Orleans, even if the city is never identified. She punctuates her ethereal folk balladry with invigorating bursts of traditional jazz, blues and gospel in a wide-ranging musical palette whose influences extend from country to Kurt Weill. The project&#8217;s earliest roots were as a community theater production in Mitchell&#8217;s home state of Vermont. Following the album release, the singer-songwriter toured with the piece as a folk concert featuring a changing lineup of guest artists before bringing on board Chavkin, the fearlessly innovative director of Natasha, Pierre & the Great Comet of 1812 . The show benefits immeasurably from having been built as a collaborative venture, honed in three pre-Broadway engagements over the past three years — at New York Theatre Workshop, in Edmonton, Canada, and at the National Theatre in London. The messenger of the gods, Hermes, the guide &#8220;with feathers on his feet,&#8221; is an ideal fit for narrator duties, introducing the main characters — gods and mortals — in his toe-tapping opening song and then providing the connective tissue throughout. His Creole-flavored flamboyance is shared by the Fates (Jewelle Blackman, Yvette Gonzalez-Nacer and Kay Trinidad), three scene-stealing queens dressed in flapper chic who rule the destinies of mortals and harmonize like enchantresses, frequently picking up instruments to join the musicians. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-thr-article-mid-articleX-uid2' ) .setTargeting( 'pos', [\"btf\",\"mid-articleX\",\"mid\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-articleX\") .addSize([[300,250],[300,251],[620,350],[320,480],[620,366]]) .setLazyLoadMultiplier(2) .setClsOptimization(\"minsize\") ; }); Mitchell relocates the myth to a time that alludes to the Depression era without getting too specific. In this long winter of hardship, the poor, na&iuml;ve Orpheus (Reeve Carney) takes one look at the more worldly runaway Eurydice (Eva Noblezada) when she blows into town, hungry and cold, and he&#8217;s instantly smitten. In the lovely &#8220;Wedding Song,&#8221; his reckless romantic instincts collide with her more jaded realism as she sings, &#8220;Lover tell me if you&#8217;re able / Who&#8217;s gonna lay the wedding table? / Time&#8217;s being what they are / Dark and getting darker all the time.&#8221; But being the son of a muse, touched by the gift of music (his lyre here ...",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 92,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "urlUpdated": "2026-01-23T05:30:05.863Z",
  "fetchedAt": "2026-01-23T05:29:05.794Z"
}
