{
  "showId": "hadestown-2019",
  "outletId": "towleroad-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.towleroad.com/2019/04/hadestown/",
  "publishDate": null,
  "fullText": "The world on stage at the Walter Kerr Theatre feels a lot like ours — scorched but soulful, a sort of dystopian now. As the first staccato notes of “Road to Hell” flit from an onstage trombone, it's immediately clear that Hadestown, a haunting gut-punch of a new musical that opened on Broadway tonight, breathes the same air we do. This imaginative spin on Orpheus and Eurydice speaks with a bleeding heart to the here and now. It is both the most original and breathtaking musical of the season and a trenchant piece of political art.\n\nThe musical's roots as a 2010 concept album from folk singer-songwriter Anaïs Mitchell, developed for the stage with director Rachel Chavkin, are evident in its stripped-down and compact staging. A semi-circular colonnade encases the stage and seats an onstage band; a wrought-iron balcony lends a New Orleans flavor (scenic design is by Rachel Hauck). Consider it an American take on fallen Roman decadence.\n\nGreed is to blame for the woes of Hadestown, where the seasons have been blighted by Hades unwillingness to share his wife Persephone, the goddess of harvest and fertility, with the world above ground (the pair are played with wry relish by Patrick Page and Amber Gray). This devil is also a rapacious capitalist, who lures a penniless, hungry Eurydice to the underworld with the promise of work and reward. Her love Orpheus, determined to compose a song that will restore natural order, follows behind to rescue her (Eva Noblezada and Reeve Carney play the honey-voiced lovers).\n\nA parable about the havoc wreaked by avarice on the natural world and its inhabitants could hardly seem more pointed. Throw in a pin-stripped megalomaniac leading a call-and-response about building a wall and it's hard to believe Mitchell actually composed the score back in 2010. “We build the wall to keep us free,” sings Hades' somber workforce. “The wall keeps out the enemy.” “Who do we call the enemy/ My children, my children?” Hades asks. “The enemy is poverty,” comes the response. The echoed exchange seems to reverberate right through the floorboards into the earth, and not just because Page sings with a bass more gravely than Leonard Cohen's.\n\nChavkin, a Tony nominee for Natasha, Pierre and the Great Comet of 1812, maintains a tight focus on storytelling (the venerable André De Shields plays Hermes, our narrator). Chavkin's few visual flourishes (one in particular with lighting designer Bradley King) are all the more impactful given the production's overall restraint even as it has grown in proportion (the show originated off-Broadway in 2017 and played London last year).  For all its chilling resonance, Hadestown is also a hoot. Gray's Persephone is among the most wild and out there leading ladies since Oklahoma!'s Ado Annie. And the story offers s glimmer or two of hope to hang our hat on. Orpheus raises a cup of wine to the audience, a toast “to the world we dream about, and the one we live in now.” It's further proof we're witnessing a new dawn for American musicals.\n\nRecent theatre features…All the Questions I Had Watching Glenda Jackson in ‘King Lear' on Broadway: REVIEW‘What the Constitution Means to Me' is the First Must-See Show of the Year: REVIEWTemptations Musical ‘Ain't Too Proud' Makes a Play for Soul on Broadway: REVIEWKelli O'Hara Dazzles in ‘Kiss Me, Kate' on Broadway: REVIEW‘Be More Chill' Is Like an Incel's Answer to ‘Mean Girls': REVIEWThe Most Interesting Part of Broadway's ‘To Kill a Mockingbird' Already Happened Off Stage: REVIEWBroadway's ‘The Cher Show' Is a Feast for Fans and an Assertion of Legacy: REVIEW\n\nFollow Naveen Kumar on Twitter: @Mr_NaveenKumar",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 605,
  "archivePath": "data/archives/reviews/hadestown-2019/towleroad-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T02:09:45.086Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "sourceMethod": "brightdata"
}