{
  "showId": "hadestown-2019",
  "outletId": "vox",
  "outlet": "Vox",
  "criticName": "Constance Grady",
  "url": "https://www.vox.com/culture/2019/4/22/18508067/hadestown-review-broadway-anais-mitchell-rachel-chavkin",
  "publishDate": "2019-04-22",
  "fullText": "menu\nmore-arrow\nno\nyes\nmobile\n\n\n    \n  \n    \n      \n      \n\n    \n\n  \n  \n    \n      \n        \n        \n          \n            Explainers\n            \n              \n            \n          \n          \n        \n\n         \n            \n            \n              \n                \n                  \n                    \n                  \n                    \n                    \n                      \n                        \n                          Israel-Hamas war\n                        \n                      \n                      \n                    \n                    \n                    \n                      \n                        \n                          2024 election\n                        \n                      \n                      \n                    \n                    \n                    \n                      \n                        \n                          Supreme Court\n                        \n                      \n                      \n                    \n                    \n                  \n                    \n                  \n                \n                  \n                    \n                  \n                    \n                    \n                      \n                        \n                          Tax season\n                        \n                      \n                      \n                    \n                    \n                    \n                      \n                        \n                          Winter warming\n                        \n                      \n                      \n                    \n                    \n                    \n                      \n                        \n                          What to watch\n                        \n                      \n                      \n                    \n                    \n                  \n                    \n                  \n                \n                \n                  \n                    All explainers\n                  \n                \n              \n            \n          \n        \n      \n        \n        \n          \n            Crossword\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Video\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Podcasts\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Politics\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Policy\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Culture\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Science\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Technology\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Climate\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Health\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Money\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Life\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Future Perfect\n            \n          \n          \n        \n\n         \n        \n      \n        \n        \n          \n            Newsletters\n            \n          \n          \n        \n\n         \n        \n      \n      ✕\n    \n  \n  \n\n\n\n\n\n\n      \n\n      \n      \n      \n    \n\n      \n    \n    \n\n\n  \n    \n    \n  \n  \n  \n  \n\n  Filed under:\n\nHell is a factory town in Broadway’s terrific new Hadestown.\n\nShare this on Reddit\n    \n  \n\n  \n  \n    \n      \n        \n\n\n\n        Share\n        All sharing options\n      \n    \n  \n    \n  \n  \n    \n      \n        \n          Share\n          All sharing options for:\n          The new Broadway musical Hadestown has all the makings of a huge cult hit\n        \n      \n      \n        \n          \n            \n              \n                \n                  \n\n\n\n\n\n                  Reddit\n                \n              \n            \n          \n            \n              \n                \n                  \n\n\n                  Pocket\n                \n              \n            \n          \n            \n              \n                \n                  \n  \n  \n  \n\n                  Flipboard\n                \n              \n            \n          \n            \n              \n                \n                  \n                  Email\n                \n              \n            \n          \n        \n      \n      \n    \n  \n\n\n\n  \n  \n  \n\n\n  \n    \n  \n    \n    \n      \n        \n  \n\n\n  \n\n\n\n\n\n\n      \n    \n    \n  \n  \n    \n      \n        Amber Gray as Persephone in Hadestown.\n      \n      \n        Matthew Murphy\n      \n    \n  \n\n\n\n      \n\n  \n    \n  \n      \n        Constance Grady\n        is a senior correspondent on the Culture team for Vox, where since 2016 she has covered books, publishing, gender, celebrity analysis, and theater.\n      \n    \n  \n\n\n\n    \n\n\n\n\n\n\n\n\n  Hadestown, the new musical that opened on Broadway April 17, has had one of the most public evolutions of any musical I know of. It started as a song cycle touring around Vermont in 2006, and from there became a star-studded concept album with a cult following. Then it was an off-Broadway show. Then it hit Canada. Then London. Every step of the way, it’s been under public scrutiny.\n\nBut what’s most amazing about it is that every time it’s evolved, Hadestown has only gotten better.\n\nWhen I first fell in love with the show as a concept album in 2010, I knew Anaïs Mitchell’s folk-inflected score was beautiful, and the premise — the myth of Orpheus and Eurydice reimagined as an anti-capitalist parable — was compelling.\n\nBut I wasn’t sure it would work as a theatrical show. The central metaphor of capitalism as death was so abstract, and the mythic characters so much better as archetypes than as psychologically distinct human beings, that I worried literalizing the whole thing by putting it onstage would break everything to pieces.\n\nIn the Broadway production of Hadestown, sumptuously directed by Rachel Chavkin of Natasha, Pierre, & the Great Comet of 1812 fame, the metaphor is a little bit incoherent. The narrative is a little bit shaggy, and some of the characters are a little bit flat. But Hadestown in its final form, revised and workshopped and thoroughly thought through, rises above the sum of its parts.\n\nIt creeps under your skin and stays there so ably that in the theater, you can actually see the cult following develop in real time. When the house lights came up for intermission at the performance I saw, three unconnected people who were not sitting together said “holy crap” in unison. The man in front of me told me that he had seen the show five times already; counting previews, Hadestown had been on Broadway for about three weeks and officially open for just five days. Then the lights came back down, and the audience all turned back to the stage, waiting for the climax where we would all gasp as one at the same moment — because this show is, in the most literal sense of the word, breathtaking.\n\nIn classical mythology, Orpheus is the greatest bard in the world and Eurydice his beloved bride. When Eurydice is killed by a snake bite, the mourning Orpheus travels to the underworld to beg Hades, god of the dead, to return his wife to life. To make his case, Orpheus sings a song so beautiful that Hades’s wife Persephone, the personification of spring, begs her husband to let Eurydice go.\n\nIn Mitchell’s Hadestown, the outlines of the myth are the same — but here, Hadestown isn’t just the underworld. It’s also a factory town, and Hades is both the grim god of death and a malevolent overseer, forcing his tenants to labor unceasingly at building an endless wall around his city. (Lest you think that part is too on the nose for 2019, Hades’s call and response song “Why We Build the Wall” has been part of the show for more than 10 years. Mitchell says any resemblance to Trumpian rhetoric is “purely archetypal.”)\n\nAnd here, Eurydice isn’t bitten by a snake. Instead, she’s lured into Hadestown by the promise of work and food, after the impractical artist Orpheus spends the winter crafting a song and not bringing any money home. “It’s my gut I can’t ignore,” Eurydice sings plaintively. “Orpheus, I’m hungry.”\n\nThis balancing act is the trickiest part of bringing Hadestown to the stage. On an album, Eurydice can simultaneously die and get a factory job, and the listening audience doesn’t have to choose between one side of the metaphor or the other, because we don’t have to watch her do it. We just understand that she’s doing both and let the story keep going. Onstage, though, everything by necessity has to get just a little bit more literal.\n\nThat’s where Rachel Chavkin’s direction comes in. Chavkin has created a theatrical world in which both levels of Mitchell’s metaphor can breathe at once. When Eurydice holds up over her eyes the two silver coins that are her ticket to the underworld, she is recognizably dying. But she’s also getting on the train to a factory town, and she’s doing each at once, right in front of our eyes.\n\nIn that endeavor, Chavkin is helped enormously by her able crew. Rachel Hauck’s scenic design loosely suggests a New Orleans bar for the part of the show that takes place above ground, but her whirling pendulum-swinging lamps and spinning turntables can just as easily create a sense of overwhelming oppression and claustrophobia, like being stuck in a factory or a mine — or in hell. And Michael Krass’s costumes are dancing right on the edge you didn’t know existed between New Orleans jazz chic and the latest in Hellenistic trends. Take a look at the smoke-gray dresses on the three Fates: depending on how you squint, they’re either church lady outfits or they’re gowns that wouldn’t look out of place on a Greek vase.\n\nIt helps, too, that Mitchell has revised her material heavily as she took it from studio to stage. Over the past nine years, her lyrics have gotten less hazily lyrical and pretty, and more character-driven and concrete. While there’s a bit of a tradeoff being made there (I’ll admit to sighing over the loss of this lovely image from Hades and Persephone’s first meeting: “The smell of the flowers she held in her hand, / The pollen that fell from her fingertips, / And suddenly Hades was only a man, / With the taste of nectar on his lips”), that revision means that the story now feels more organic to the characters. These people aren’t making their choices just because they’re archetypal figures in ancient myths and this is what they’ve always done, but because those choices make sense. Suddenly they feel fresh and urgent.\n\nMitchell has also given substantially more emphasis in this version of the show to the B-plot of Hades and Persephone and their tortured marriage, and in this choice, she is most likely driven by the fact that Patrick Page and Amber Gray — who have been part of the show since its 2016 production at the New York Theatre Workshop — are easily the standouts of the cast. As Hades, Page stalks across the stage like a tiger, pitching his velvety bass so low that his voice seems to rumble up from the center of the Earth. And as the smoky-voiced Persephone, hiding deep wells of melancholy under a desperate and drunken smile, Gray doesn’t so much run away with the show as dances off with it, with her torso at a 90-degree angle to her legs.\n\nPage and Gray are ably backed up by the legendary André De Shields, who plays Hermes, the messenger god and the show’s narrator, with ice-cold swagger. As our central lovers, Eva Noblezada (Eurydice) and Reeve Carney (Orpheus) have a tougher row to hoe: Orpheus and Eurydice carry the weight of the metaphor, and as such, they continue to feel a little bit more like flattened-out archetypes than fully fledged characters. Still, Noblezada gives Eurydice a winsome survivor’s pluck, and Carney manages to find a sweet awkwardness in Orpheus that makes that character feel more likable and compelling than he has been in previous versions of this show.\n\nAnd when all of them come together in the climax of the show, the moment that made everyone gasp in unison wasn’t because of some brand new plot twist, an innovation to the myth. It was because of the moment that is at the center of the myth of Orpheus and Eurydice, the moment on their walkout of the underworld that you always knew was coming — somehow now made both inevitable and shocking.\n\n“It’s an old song,” Hermes tells us as the show opens. “It’s a sad song. But we sing it anyway.”\n\nHadestown has now been sung over and over again since 2006. It’s been sung in concert halls across Vermont. It’s been sung in studio for the concept album. It’s been sung off-Broadway, in Canada, and in London. But Mitchell and Chavkin keep singing it anyway.\n\nAnd every time they do, it keeps getting better.\n\nHadestown is now playing on Broadway.\n\n\\r\\n    \\r\\n\",\"cross_community\":false,\"internal_groups\":[],\"image\":{\"ratio\":\"*\",\"original_url\":\"https://cdn.vox-cdn.com/uploads/chorus_image/image/63653965/HADESTOWN_0536_v002.0.jpg\",\"network\":\"unison\",\"bgcolor\":\"white\",\"pinterest_enabled\":false,\"caption\":\"Amber Gray as Persephone in Hadestown.\",\"credit\":\"Matthew Murphy\",\"focal_area\":{\"top_left_x\":1221,\"top_left_y\":362,\"bottom_right_x\":1701,\"bottom_right_y\":842},\"bounds\":[0,0,3000,2000],\"uploaded_size\":{\"width\":3000,\"height\":2000},\"focal_point\":null,\"image_id\":63653965,\"alt_text\":\"A woman in a green dress dances, surrounded by backup dancers in gray.\"},\"hub_image\":{\"ratio\":\"*\",\"original_url\":\"https://cdn.vox-cdn.com/uploads/chorus_image/image/63653965/HADESTOWN_0536_v002.0.jpg\",\"network\":\"unison\",\"bgcolor\":\"white\",\"pinterest_enabled\":false,\"caption\":\"Amber Gray as Persephone in Hadestown.\",\"credit\":\"Matthew Murphy\",\"focal_area\":{\"top_left_x\":1221,\"top_left_y\":362,\"bottom_right_x\":1701,\"bottom_right_y\":842},\"bounds\":[0,0,3000,2000],\"uploaded_size\":{\"width\":3000,\"height\":2000},\"focal_point\":null,\"image_id\":63653965,\"alt_text\":\"A woman in a green dress dances, surrounded by backup dancers in gray.\"},\"lede_image\":{\"ratio\":\"*\",\"original_url\":\"https://cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg\",\"network\":\"unison\",\"bgcolor\":\"white\",\"pinterest_enabled\":false,\"caption\":\"Amber Gray as Persephone in Hadestown.\",\"credit\":\"Matthew Murphy\",\"focal_area\":{\"top_left_x\":1221,\"top_left_y\":362,\"bottom_right_x\":1701,\"bottom_right_y\":842},\"bounds\":[0,0,3000,2000],\"uploaded_size\":{\"width\":3000,\"height\":2000},\"focal_point\":null,\"image_id\":63653966,\"alt_text\":\"A woman in a green dress dances, surrounded by backup dancers in gray.\"},\"group_cover_image\":null,\"picture_standard_lead_image\":{\"ratio\":\"*\",\"original_url\":\"https://cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg\",\"network\":\"unison\",\"bgcolor\":\"white\",\"pinterest_enabled\":false,\"caption\":\"Amber Gray as Persephone in Hadestown.\",\"credit\":\"Matthew Murphy\",\"focal_area\":{\"top_left_x\":1221,\"top_left_y\":362,\"bottom_right_x\":1701,\"bottom_right_y\":842},\"bounds\":[0,0,3000,2000],\"uploaded_size\":{\"width\":3000,\"height\":2000},\"focal_point\":null,\"image_id\":63653966,\"alt_text\":\"A woman in a green dress dances, surrounded by backup dancers in gray.\",\"picture_element\":{\"loading\":\"eager\",\"html\":{},\"alt\":\"A woman in a green dress dances, surrounded by backup dancers in gray.\",\"default\":{\"srcset\":\"https://cdn.vox-cdn.com/thumbor/O_T8QGwakYrSH2wyLiYdJ6xsmVw=/0x0:3000x2000/320x240/filters:focal(1221x362:1701x842)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg 320w, https://cdn.vox-cdn.com/thumbor/7qIBBAIgMgoHnnLxC8Qm24K6pAM=/0x0:3000x2000/620x465/filters:focal(1221x362:1701x842)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg 620w, https://cdn.vox-cdn.com/thumbor/GWU4x6sFPJfQ1A-L4HLiw4sqysk=/0x0:3000x2000/920x690/filters:focal(1221x362:1701x842)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg 920w, https://cdn.vox-cdn.com/thumbor/tMojeRkaVOf9SOVl_uey0tkDpv4=/0x0:3000x2000/1220x915/filters:focal(1221x362:1701x842)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg 1220w, https://cdn.vox-cdn.com/thumbor/whV0oRpr82tQv4I_XtK2qSzUVZk=/0x0:3000x2000/1520x1140/filters:focal(1221x362:1701x842)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg 1520w\",\"webp_srcset\":\"https://cdn.vox-cdn.com/thumbor/-RFeGwOcbuhI4C9IM1QevUhjRTo=/0x0:3000x2000/320x240/filters:focal(1221x362:1701x842):format(webp)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg 320w, https://cdn.vox-cdn.com/thumbor/HbJt39C1b5IYqNFgnv5RM9G6YRc=/0x0:3000x2000/620x465/filters:focal(1221x362:1701x842):format(webp)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg 620w, https://cdn.vox-cdn.com/thumbor/rW3YK7R2GPZqb3rPySOUdZRLXMk=/0x0:3000x2000/920x690/filters:focal(1221x362:1701x842):format(webp)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg 920w, https://cdn.vox-cdn.com/thumbor/nrfbMwEEztZ07eokb8gu_IzHLaQ=/0x0:3000x2000/1220x915/filters:focal(1221x362:1701x842):format(webp)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg 1220w, https://cdn.vox-cdn.com/thumbor/FmHKcCrLkZHhHj8h75qm43dTyZA=/0x0:3000x2000/1520x1140/filters:focal(1221x362:1701x842):format(webp)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg 1520w\",\"media\":null,\"sizes\":\"(min-width: 809px) 485px, (min-width: 600px) 60vw, 100vw\",\"fallback\":\"https://cdn.vox-cdn.com/thumbor/E3xtpqPlmZEgJLW1gtDji9uvh2g=/0x0:3000x2000/1200x900/filters:focal(1221x362:1701x842)/cdn.vox-cdn.com/uploads/chorus_image/image/63653966/HADESTOWN_0536_v002.0.jpg\"},\"art_directed\":[]}},\"image_is_placeholder\":false,\"image_is_hidden\":false,\"network\":\"vox\",\"omits_labels\":false,\"optimizable\":false,\"promo_headline\":\"The new Broadway musical Hadestown has all the makings of a cult hit\",\"recommended_count\":0,\"recs_enabled\":false,\"slug\":\"culture/2019/4/22/18508067/hadestown-review-broadway-anais-mitchell-rachel-chavkin\",\"dek\":\"Hell is a factory town in Broadway’s terrific new Hadestown.\",\"homepage_title\":\"The new Broadway musical Hadestown has all the makings of a cult hit\",\"homepage_description\":\"Hell is a factory town in Broadway’s terrific new Hadestown.\",\"show_homepage_description\":false,\"title_display\":\"The new Broadway musical Hadestown has all the makings of a cult hit\",\"pull_quote\":null,\"voxcreative\":false,\"show_entry_time\":true,\"show_dates\":true,\"paywalled_content\":false,\"paywalled_content_box_logo_url\":\"\",\"paywalled_content_page_logo_url\":\"\",\"paywalled_content_main_url\":\"\",\"article_footer_body\":\"At Vox, we believe that clarity is power, and that power shouldn’t only be available to those who can afford to pay. That’s why we keep our work free. Millions rely on Vox’s clear, high-quality journalism to understand the forces shaping today’s world. Support our mission and help keep Vox free for all by making a financial contribution to Vox today. \\r\\n\",\"article_footer_header\":\"Will you help keep Vox free for all?\",\"use_article_footer\":true,\"article_footer_cta_annual_plans\":\"{\\r\\n  \\\"default_plan\\\": 1,\\r\\n  \\\"plans\\\": [\\r\\n    {\\r\\n      \\\"amount\\\": 50,\\r\\n      \\\"plan_id\\\": 99546\\r\\n    },\\r\\n    {\\r\\n      \\\"amount\\\": 100,\\r\\n      \\\"plan_id\\\": 99547\\r\\n    },\\r\\n    {\\r\\n      \\\"amount\\\": 150,\\r\\n      \\\"plan_id\\\": 99548\\r\\n    },\\r\\n    {\\r\\n      \\\"amount\\\": 200,\\r\\n      \\\"plan_id\\\": 99549\\r\\n    }\\r\\n  ]\\r\\n}\",\"article_footer_cta_button_annual_copy\":\"year\",\"article_footer_cta_button_copy\":\"Yes, I'll give\",\"article_footer_cta_button_monthly_copy\":\"month\",\"article_footer_cta_default_frequency\":\"monthly\",\"article_footer_cta_monthly_plans\":\"{\\r\\n  \\\"default_plan\\\": 0,\\r\\n  \\\"plans\\\": [\\r\\n    {\\r\\n      \\\"amount\\\": 5,\\r\\n      \\\"plan_id\\\": 99543\\r\\n    },\\r\\n    {\\r\\n      \\\"amount\\\": 10,\\r\\n      \\\"plan_id\\\": 99544\\r\\n    },\\r\\n    {\\r\\n      \\\"amount\\\": 25,\\r\\n      \\\"plan_id\\\": 99545\\r\\n    },\\r\\n    {\\r\\n      \\\"amount\\\": 50,\\r\\n      \\\"plan_id\\\": 46947\\r\\n    }\\r\\n  ]\\r\\n}\",\"article_footer_cta_once_plans\":\"{\\r\\n  \\\"default_plan\\\": 0,\\r\\n  \\\"plans\\\": [\\r\\n    {\\r\\n      \\\"amount\\\": 20,\\r\\n      \\\"plan_id\\\": 69278\\r\\n    },\\r\\n    {\\r\\n      \\\"amount\\\": 50,\\r\\n      \\\"plan_id\\\": 48880\\r\\n    },\\r\\n    {\\r\\n      \\\"amount\\\": 100,\\r\\n      \\\"plan_id\\\": 46607\\r\\n    },\\r\\n    {\\r\\n      \\\"amount\\\": 250,\\r\\n      \\\"plan_id\\\": 46946\\r\\n    }\\r\\n  ]\\r\\n}\",\"use_article_footer_cta_read_counter\":true,\"use_article_footer_cta\":true,\"groups\":[{\"base_type\":\"EntryGroup\",\"id\":27608,\"timestamp\":1709581812,\"title\":\"Culture\",\"type\":\"SiteGroup\",\"url\":\"https://www.vox.com/culture\",\"slug\":\"culture\",\"community_logo\":\"\\r\\n\\r\\n    \\r\\n    vox-mark\\r\\n    \\r\\n    \\r\\n    \\r\\n        \\r\\n    \\r\\n\",\"community_name\":\"Vox\",\"community_url\":\"https://www.vox.com/\",\"cross_community\":false,\"entry_count\":11504,\"always_show\":false,\"description\":\"Stay up to date on the latest in television and movie reviews, books, celebrity culture, and more.\\r\\n\",\"disclosure\":\"\",\"cover_image_url\":\"\",\"cover_image\":null,\"title_image_url\":\"\",\"intro_image\":null,\"four_up_see_more_text\":\"View All\",\"primary\":true},{\"base_type\":\"EntryGroup\",\"id\":34780,\"timestamp\":1709244004,\"title\":\"Reviews\",\"type\":\"SiteGroup\",\"url\":\"https://www.vox.com/reviews\",\"slug\":\"reviews\",\"community_logo\":\"\\r\\n\\r\\n    \\r\\n    vox-mark\\r\\n    \\r\\n    \\r\\n    \\r\\n        \\r\\n    \\r\\n\",\"community_name\":\"Vox\",\"community_url\":\"https://www.vox.com/\",\"cross_community\":false,\"entry_count\":1517,\"always_show\":false,\"description\":\"Here are the best TV shows, movies, books, comics, and music to read, watch, and listen to right now.\",\"disclosure\":\"\",\"cover_image_url\":\"\",\"cover_image\":null,\"title_image_url\":\"\",\"intro_image\":null,\"four_up_see_more_text\":\"View All\",\"primary\":false},{\"base_type\":\"EntryGroup\",\"id\":65705,\"timestamp\":1704114011,\"title\":\"Theater\",\"type\":\"SiteGroup\",\"url\":\"https://www.vox.com/theater\",\"slug\":\"theater\",\"community_logo\":\"\\r\\n\\r\\n    \\r\\n    vox-mark\\r\\n    \\r\\n    \\r\\n    \\r\\n        \\r\\n    \\r\\n\",\"community_name\":\"Vox\",\"community_url\":\"https://www.vox.com/\",\"cross_community\":false,\"entry_count\":101,\"always_show\":false,\"description\":\"Vox's coverage of stage shows, from massive Broadway productions to tiny shows at local theaters. \",\"disclosure\":\"\",\"cover_image_url\":\"\",\"cover_image\":null,\"title_image_url\":\"\",\"intro_image\":null,\"four_up_see_more_text\":\"View All\",\"primary\":false}],\"featured_placeable\":false,\"video_placeable\":false,\"disclaimer\":null,\"volume_placement\":\"lede\",\"video_autoplay\":false,\"youtube_url\":\"http://bit.ly/voxyoutube\",\"facebook_video_url\":\"\",\"play_in_modal\":true,\"user_preferences_for_privacy_enabled\":false,\"show_branded_logos\":true}\">\n\n  \n    \n      \n    \n\n    \n      Will you help keep Vox free for all?\n\nAt Vox, we believe that clarity is power, and that power shouldn’t only be available to those who can afford to pay. That’s why we keep our work free. Millions rely on Vox’s clear, high-quality journalism to understand the forces shaping today’s world. Support our mission and help keep Vox free for all by making a financial contribution to Vox today.\n\nWe accept credit card, Apple Pay, and\n              \n              \n                Google Pay. You can also contribute via\n\nCheck your inbox for a welcome email.\n\nOops. Something went wrong. Please enter a valid email and try again.\n\nOops. Something went wrong. Please enter a valid email and try again.",
  "isFullReview": true,
  "showScoreExcerpt": "The show is so strong and enjoyable...Gray dances off with it.",
  "originalScore": null,
  "assignedScore": 84,
  "source": "show-score",
  "textQuality": "full",
  "sourceMethod": "archive",
  "scoreSource": "sentiment-strong-positive",
  "scoreConfidence": "medium",
  "llmScore": {
    "score": 84,
    "confidence": "high",
    "range": {
      "low": 77.5,
      "high": 90.5
    },
    "bucket": "Positive",
    "thumb": "Up",
    "components": {
      "book": 75,
      "music": 88,
      "performances": 83,
      "direction": 89
    },
    "keyPhrases": [
      {
        "quote": "Hadestown in its final form, revised and workshopped and thoroughly thought through, rises above the sum of its parts",
        "sentiment": "positive",
        "strength": 5
      },
      {
        "quote": "this show is, in the most literal sense of the word, breathtaking",
        "sentiment": "positive",
        "strength": 5
      },
      {
        "quote": "And every time they do, it keeps getting better",
        "sentiment": "positive",
        "strength": 4
      }
    ],
    "reasoning": "Claude: Despite acknowledging some flaws (incoherent metaphor, flat characters), the critic is clearly enthusiastic about the production, calling it 'breathtaking' and praising the direction, design, and performances with strong positive language throughout. | GPT-4o-mini: The review expresses strong enthusiasm for the production while acknowledging some narrative incoherence, leading to a solid positive recommendation.",
    "flags": {
      "hasExplicitRecommendation": true,
      "focusedOnPerformances": false,
      "comparesToPrevious": true,
      "mixedSignals": false
    }
  },
  "llmMetadata": {
    "model": "ensemble:claude-sonnet-4-20250514+gpt-4o-mini",
    "scoredAt": "2026-01-29T01:55:33.653Z",
    "promptVersion": "3.0.0",
    "inputTokens": 0,
    "outputTokens": 0
  },
  "ensembleData": {
    "claudeScore": 82,
    "openaiScore": 85,
    "scoreDelta": 3,
    "thumbsMatch": null,
    "expectedThumb": null,
    "needsReview": false,
    "needsReviewReasons": []
  },
  "textStatus": "complete",
  "textWordCount": 2021,
  "archivePath": "data/archives/reviews/hadestown-2019/vox--constance-grady_2026-01-27.html",
  "textFetchedAt": "2026-01-27T02:11:17.237Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "archiveOrgTimestamp": "20240305125752",
  "archiveOrgUrl": "http://web.archive.org/web/20240305125752/https://www.vox.com/culture/2019/4/22/18508067/hadestown-review-broadway-anais-mitchell-rachel-chavkin",
  "rescoreReason": "scored on brief excerpt, now has fullText",
  "previousLlmScore": 82,
  "rescoreCompletedAt": "2026-01-29T01:55:33.653Z"
}
