{
  "showId": "hadestown-2019",
  "outletId": "VULT",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "http://www.vulture.com/2016/05/theater-review-hadestown.html",
  "publishDate": "2019-04-17",
  "fullText": "Save this article to read it later. Find this story in your account’s ‘Saved for Later’ section. When the very first lyric of a sung-through show like Hadestown attempts to rhyme “flames” with “hurricanes,” you know you’re in for a crossover experience. And though I doubt that the songwriter Anaïs Mitchell did it deliberately, as if to signal “We’re not in Oklahoma! anymore,” it would have made sense if she had. Certainly, the scenic design — an egg-shaped amphitheater snuggled within New York Theatre Workshop’s usual space — offers that useful information straight up. I say “useful” because in the case of Hadestown the likelihood of enjoyment may depend on your willingness to accept that what you are watching is not in fact a musical but more of an illustrated pop concert, if a very pretty one. On the other hand, if you go in hoping for a story told through song, the traditional province of musical theater, you will be very much disappointed. The songs are sung and the story is told, but rarely are the two things one. The story is the classic one of Orpheus and Eurydice, transplanted from Mount Olympus to a mythical New Orleans, with girl-group Fates and recitative narration from a blues-singing Hermes. Crucially, this version is told from Eurydice’s point of view rather than Orpheus’s: It’s a distinctly feminist reading. (Hadestown might well be subtitled The Eurydice Mixtape.) Orpheus (Damon Daunno) is still a swoony romantic, but now he’s more of a feckless dreamer, and Eurydice (Nabiyah Be) is on to him: EURYDICE: A singer? Is that what you are? ORPHEUS: Well, I also play the lyre. EURYDICE: A liar, and a player too! I’ve met too many men like you. The sass tips us off that Eurydice will be more active in her fate than she is traditionally. Indeed, she does not descend to Hell as the result of a random snakebite but because Orpheus’s inability to care for her (she’s cold and hungry) makes death seem almost erotically attractive. At least Hades (Patrick Page, doing a subterranean Trump) will keep her warm. Unfortunately, Hades already has a wife, Persephone, so there are marital problems to deal with. But this already implies a lot of drama, when in fact Hadestown is presentational both in story and execution. With few exceptions, Mitchell’s potpourri of songs — blues, stomps, Dixieland, and other southern vernacular varieties — describe moods or announce feelings in bald pop terms rather than enact conflict or extend emotion. The exceptions, including a song for Hades and Persephone called “How Long,” suggest that this is a dramaturgical choice. No surprise, therefore, that Hadestown was directed by “and developed with” Rachel Chavkin, whose work on Natasha, Pierre & the Great Comet of 1812 and Preludes, among other newfangled musicals based on old material, has carved her a niche in no-fourth-wall, novelty stagings. I’m afraid this one has many of the clichés of that style without enough of the content; in Hadestown, the facts of the case take up little more than five or ten minutes of the two-hour running time. To fill the rest, the actors haven’t much to do besides sing and overact while Chavkin keeps them physically busy with enthusiastic hokum, aimless movement (David Neumann is the choreographer), and prop management. We are at all times kept strangely aware of the whereabouts of microphones and cords. Luckily the singing is generally excellent; the six-person band, under the music direction of Liam Robinson, is always so. As Persephone, Amber Gray, always vivid, gets closest to creating a character out of vocal inflections. (With his terrifying basso rumble, Page creates something — I’m not sure what it is.) The performative emphasis is further underlined by Bradley King’s rock-concert lighting, often in pretty shades of Prince purple. And though Rachel Hauck’s scenic design consists of little more than the tiered environment itself, it has the excellent effect of making the audience part of the picture and thus part of an old tradition of storytelling. You would think that would be enough, but when almost everything is narrated, the lack of variety — of mood, of mode, even of tempo — dulls emotion and smothers the pulse. It’s only near the end, when Orpheus, having snuck into Hades, has won the right to bring Eurydice back to earth, that the music and staging come together and real dramatic tension arises. Will he climb his way through the banks of audience without checking to see if she is still behind him? And what will happen if he violates the agreement he made with Hades and does look back? The creators of self-consciously new musicals seem to feel that they face a similar problem, forced to face front at all times. But I wish Hadestown had looked back a bit more. It might have discovered in the intelligence of past examples structural solutions to storytelling problems, rather than merely stylistic ones. On the other hand, maybe a tiny-scale stadium show is what they wanted, in which case they knew perfectly well what they were doing. If you attend with those expectations, you’ll come out happy, rhymes be damned and humming the architecture. Hadestown is at New York Theatre Workshop through July 3.",
  "isFullReview": false,
  "bwwExcerpt": "blend of steampunk, \"Westworld\" and Bourbon St. anarchy, this dystopian tuner has its origins in a 2010 concept album, a folk opera of sorts, by the remarkable singer-songwriter Ana&iuml;s Mitchell. Sara Holdren, Vulture : Hadestown has arrived on Broadway. Like so many of its mythic antecedents, it's the product of much metamorphosis, and its current manifestation feels lush, vigorous, and formally exciting, not to mention, in certain moments, witchily prescient. Matt Windman, amNY : Directed by Rachel Chavkin (\"Natasha, Pierre & The Great Comet of 1812\"), \"Hadestown\" contains a stunning visual design evoking both a New Orleans barroom scene and a smoldering mechanical underworld, complemented by the motion of turntables, a rollicking band, bold performances and expressive dance choreography. Whereas the previous Off-Broadway production was performed in the round, no impact has been lost in the transition to a traditional proscenium theater. The score - which contains airy folk-pop f",
  "originalScore": null,
  "assignedScore": 90,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HADESTOWN-Opens-On-Broadway--What-Did-The-Critics-Think-20190417",
  "textStatus": "complete",
  "textWordCount": 876,
  "archivePath": "data/archives/reviews/hadestown-2019/VULT--sara-holdren_2026-01-25.html",
  "textFetchedAt": "2026-01-25T14:25:08.897Z",
  "textIssues": [
    "Word count too low: 15 (min: 300)",
    "Show title not found in text"
  ],
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.947Z",
  "showScoreExcerpt": "“The likelihood of enjoyment may depend on your willingness to accept that what you are watching is not in fact a musical but more of an illustrated pop concert, if a very pretty one. On the other hand, if you go in hoping for a story told through song, the traditional province of musical theater, you will be very much disappointed...Luckily the singing is generally excellent...When almost everything is narrated, the lack of variety dulls emotion and smothers the pulse.\"",
  "textFetchMethod": "playwright-stealth",
  "textQuality": "full",
  "sourceMethod": "bww-roundup"
}
