{
  "showId": "hadestown-2019",
  "outletId": "washingtonpost-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.washingtonpost.com/entertainment/theater_dance/hadestown-arrives-on-broadway-and-well-it-all-goes-to-you-know-where/2019/04/17/ed83afa8-6112-11e9-9ff2-abc984dc9eec_story.html",
  "publishDate": null,
  "fullText": "This article was published more than 4 years ago\n\nDemocracy Dies in DarknessEva Noblezada, André De Shields and Reeve Carney in “Hadestown” on Broadway. (Matthew Murphy)Comment on this storyCommentGift ArticleShareNEW YORK — Hell, it seems, has a wall, too.\n\n“We build the wall to keep us free,” sing the denizens of the underworld, in “Hadestown,” the lugubrious new Broadway musical that takes us to hell and back, via a jazz and blues-fueled account of the Greek myth of Orpheus and Eurydice.\n\nGet the full experience.Choose your planArrowRightThe dark lord of Hadestown, played by Patrick Page in a full-length leather coat and voice so deep it could summon a school of sperm whales, leads the ensemble in “Why We Build the Wall,” a number with a peculiar topical resonance. Its placement at the end of Act 1 of director Rachel Chavkin’s hyper-stylized production ties into no other dis­cern­ible political thread, and how much the song by composer-lyricist Anaïs Mitchell is intended as allegory remains opaque.\n\nThen again, in a season thus far of disappointing musicals, the mysteries encompassing this earnestly humorless show, which marked its official opening Wednesday at the Walter Kerr Theatre, hardly seem worth unraveling. The embellishing of the myth, through an assembly line of sound-alike songs and mechanistic dance sequences, rambles on for 2½ hours and, only occasionally, with any inspirational joy, or heart.\n\nIf you’re not familiar with the story of Orpheus: He loses Eurydice on their wedding day and then, in proof of his extraordinary love, travels to Hades to lead her back to life — only to lose her again, after he defies the instruction not to gaze upon her until they have reached safety. It is recounted by Mitchell as a postmillennial love story between struggling artist Orpheus (Reeve Carney) and free-spirited Eurydice (Eva Noblezada), who seems to meet Orpheus on her college gap year, or something. Other gods, such as Hermes, embodied by André De Shields as the evening’s narrator, and Persephone (Amber Gray), the earthy wife of Page’s Hades, offer up moral support for the lovers, as a girl-group trio of Fates (Jewelle Blackman, Yvette Gonzalez-Nacer and Kay Trinidad) does what girl-group trios tend to do in contemporary musicals: provide running ironic commentary.\n\nChavkin, who supervised the creation of the stunning mise en scene for Broadway’s “Natasha, Pierre and the Great Comet of 1812,” reminds audiences in the Walter Kerr of her   remarkable eye. In concert with set designer Rachel Hauck and costume designer Michael Krass, she devises a kinetic stagescape of turntables within turntables and massive moving, yes, walls. At the show’s few memorably emotional musical moments, such as Orpheus’s plaintive refrain in “Wait for Me,” the elements of the production converge harmoniously. Carney — who played Peter Parker (opposite Page’s Green Goblin) in Broadway’s ill-fated “Spider-Man: Turn off the Dark” — applies an ethereal tenor to Orpheus’s songs. And Noblezada, Kim in the recent Broadway revival of “Miss Saigon,” is a sweet presence with formidable pipes.\n\nYet “Hadestown” never fulfills that essential mandate — revealing why a jazzy adaptation of Orpheus and Eurydice’s story should merit all this muscular stomping around. The murky circumstances of Eurydice’s acceptance of Hades’s bargain — he appears to offer her coins in return for her soul — do not lend much emotional weight to Orpheus’s pivotal mission. (In the myth, she’s poisoned by a snake.) The plot, as a result, comes across as an accessory to the production’s style rather than the other way around. It’s not a winning formula.\n\nWith the lackluster roster of new musicals Broadway has assembled this season — including a leaden “Pretty Woman,” a hyperactive “Be More Chill” and now a design-heavy “Hadestown” — it is only the daffy “The Prom” that has managed to provide engaging entertainment. Still to come over the next two weeks are stage versions of the movie comedies “Tootsie” and “Beetlejuice.” As an ascent from hell might augur, let us hope that the only place we can go from here is up.\n\nHadestown, book, music and lyrics by Anaïs Mitchell. Directed by Rachel Chavkin. Choreography, David Neumann; costumes, Michael Krass; lighting, Bradley King; sound, Nevin Steinberg and Jessica Paz; music direction, Liam Robinson. About 2½ hours. $49-$209. At Walter Kerr Theatre, 219 W. 48th St., New York. 877-250-2929. ticketmaster.com.\n\nI watch plays for a living. The most dramatic moments aren’t always onstage.\n\nA radical new Broadway ‘Oklahoma!’ says it’s not such a beautiful mornin’ in America\n\nThis revival of ‘Grand Hotel’ offers only cold comfort",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 751,
  "archivePath": "data/archives/reviews/hadestown-2019/washingtonpost-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T02:12:01.606Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 329 chars"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20221017130232",
  "archiveOrgUrl": "http://web.archive.org/web/20221017130232/https://www.washingtonpost.com/entertainment/theater_dance/hadestown-arrives-on-broadway-and-well-it-all-goes-to-you-know-where/2019/04/17/ed83afa8-6112-11e9-9ff2-abc984dc9eec_story.html"
}