{
  "showId": "maybe-happy-ending-2024",
  "outletId": "culturesauce-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://culturesauce.com/2024/11/12/maybe-happy-ending-broadway-review/",
  "publishDate": null,
  "fullText": "Helen J. Shen and Darren Criss in 'Maybe Happy Ending' (Photo: Matthew Murphy & Evan Zimmerman) Once in a blue moon, a new show comes along that takes Broadway utterly by surprise and shakes up how we view the whole Musical Theater genre. Resolutely old-fashioned but impressively modern, Maybe Happy Ending is a sui generis original that is as understated in its storytelling as it is cutting-edge in its design. Collaborators Will Aronson and Hue Park have crafted a sci-fi love story of barebones simplicity. Two robots, designed as carers for humans have long since abandoned them to a residential complex in Seoul, Korea, and slowly inch toward a collaborative partnership that has all the markings of romance. Darren Criss, a Glee alum who was a replacement star in recent revivals of Hedwig and the Angry Inch and How to Succeed in Business Without Really Trying, plays a fussbudgety helperbot named Oliver who spends his days in a tiny cell-like room with a plant named HwaBoon and a collection of vinyl jazz records left to him by his owner. Criss, whose hair and face have the glossy plastic sheen of a Ken doll (hair by Criag Franklin Miller, makeup by Suki Tsujimoto), moves with stiff-limbed precision and longs for the day when he’s collected enough stray coins to seek out his beloved human, James (Marcus Choi), on faraway Jeju Island. But his plans are accelerated when he meets his neighbor Claire (button-cute Helen J Shen), another abandoned bot who, like Oliver, faces obsolescence since replacement parts for their models are no longer available. Together, they plan to hit the road – Oliver to reconnect with James and Claire to deepen her ties to Oliver (and possibly seek out the fireflies she remembers so fondly from her days working in the countryside). You will probably see where the plot is heading long before the characters do, and there’s a cartoonish quaintness to the story that threatens to sink into twee (In a first for a prop, HwaBoon even gets a head shot and bio in the Playbill, with regional-theatre credits like Understudy Beanstalk in Into the Woods). But Criss and Shen don’t need a soldering iron to produce onstage sparks, and their wide-eyed chemistry together goes a long way to sell this future-set fable. So does director Michael Arden’s eye-poppingly high-tech production, which turns the entire stage of the Belasco Theatre into a glorified computer monitor, where windows pop up to mark chapters in the story and play video memories from the robots’ databases. More impressively, giant downstage flats open up to reveal hollowed-out squares for Oliver and Claire’s individual dwelling units, as well as for James’s old home, a hotel where the duo stops on their journey, and even an open field. Dane Laffrey, working with co-video designer George Reeve, has created one of the most impressive set designs in recent memory, using horizontal and vertical spaces as well as projections and stage-wrapping LED screens to move the characters around the entirety of the stage area like pieces on a 3D chessboard. The technical achievement never overpowers the story, perhaps because Aronson’s jazzy, liltingly melodic score is so far from sonic bombast or the center-stage belting we’ve come to expect from many new musicals. His songs recall the work of mid-career Burt Bacharach, with their sophisticated deployment of syncopated rhythms, irregular phrases, and shifting meters. He even introduces an old-school crooner named Gil Brentley (Dez Duron), whose Sinatra-like romanticism roots itself into Oliver’s consciousness with the persistence of a radio-friendly earworm. Aronson has a fondness for repeating a melodic line – including a five-note motif that plays repeatedly like a doorbell chime – but shifting how the accompanying chords progress to produce a different emotional effect. The result can be devastating, as in the late-show title song, a plaintive duet where Criss and Shen’s sweet, pure voices blend effortlessly to produce a showstopper marked by bittersweet sentiment rather than rafter-shaking high notes. Maybe Happy Ending is a beguiling show whose power sneaks up on you unawares, suggesting a technological future where human virtues may survive even the possible supremacy of machines. In fact, it may be robots like Oliver and Claire, inventing the language of love for themselves, that end up teaching us how to carry on in the world. Read my full review in the January issue of U.K.-based Musicals magazine. MAYBE HAPPY ENDINGBelasco Theatre, BroadwayRunning time: 1 hour, 45 minutes (no intermission)Tickets on sale through May 25, 2025 Best theater of 2024, from ‘Maybe Happy Ending’ to ‘Oh, Mary!’December 19, 2024In \"Theater\" Broadway review: ‘American Buffalo’ with Sam Rockwell and Laurence FishburneApril 15, 2022In \"Theater\" The Tony Awards should launch a new category: Best Playbill bio, with Megan Hilty as this year’s front runnerApril 28, 2025In \"Theater\" Δ /* <![CDATA[ */ document.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() ); /* ]]> */",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 815,
  "archivePath": "data/archives/reviews/maybe-happy-ending-2024/culturesauce-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:27:05.307Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}