{
  "showId": "maybe-happy-ending-2024",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=-8NUWVM",
  "publishDate": null,
  "fullText": "Darren Criss. Photo: Matthew Murphy and Evan Zimmerman. It tells you something about this theatre season that possibly the most touching relationship on a Broadway stage just now is between two machines. In Maybe Happy Ending, composers/librettists Will Aronson and Hue Park have imagined a futuristic Seoul where humans employ \"helper bots,\" digital humanoid servants/companions who handle various chores like cleaning, handling the mail, and mixing martinis. They fall somewhere between faithful servants and literate house pets, and such is their value that when they outlive their usefulness, their owners retire them to apartment complexes where they dwell until their software or battery capacity fails, causing them to power down forever. Darren Criss, creating his first original character in a Broadway show, is Oliver, who has spent twelve years waiting for James, his owner, to retrieve him. In the meantime, he happily surveys the city's skyline from his window, tends to his plant HwaBoon, and enjoys the monthly jazz magazine that arrives in the mail. Having absorbed James' musical tastes, Oliver is particularly devoted to Gil Brentley, a 1950s-era crooner, who pops up onstage occasionally, his ballads parsing the joys and pains of love that helperbots supposedly can't feel. (As played by Dez Duron, Gil looks and sounds freshly emerged from the Village Vanguard circa 1952.) Oliver's pleasant routine is interrupted by a knock on the door from Claire (Helen J. Shen, making their Broadway debut), his next-door neighbor, who needs help recharging. (Her gear isn't working correctly.) Oliver is not at all pleased to have his routine interrupted but soon she drops by daily, and a friendship of sorts is formed. Claire is considerably more wised up about relationships with humans, and she has a pretty good idea why Oliver has been living alone for so long. On impulse, she offers to take him to the island where James supposedly now lives. Their road trip -- which includes an amusing overnight stay in a no-tell motel -- ends in disillusionment thanks to a couple of flashbacks revealing how entangled helper bots can become in their owners' personal lives. But there's also the question of Oliver and Claire's growing dependency... It's best not to look too closely at the book, which fudges the question of helper bots' inner lives. But thanks to an astonishingly inventive production design and two committed performances, Maybe Happy Ending speaks directly to the isolation and technological displacement we experience today. Tucked away in their tiny cells, searching for reliable Wi-Fi, and wondering how much they can feel, Oliver and Claire don't seem all that different from us. With his baby duckling movements and studied cheerfulness, Criss makes Oliver a perfect little fussbudget, unshakable in his conviction that the world still holds a place for him. (His devotion to HwaBoon only underscores the poignancy of his situation.) Claire, who knows better, gently intimating that time is running out for them both, is beautifully rendered by Shen, who grasps that, in this case, understatement -- a quality not often prized in Broadway musicals -- is everything here. The score is a kind of two-part invention: Numbers such as \"World Within My Room\" (which depicts Oliver's unchanging daily routine), \"The Way That It Has to Be\" (Claire's calm acceptance of her eventual obsolescence), and \"The Rainy Day We Met\" (in which they amuse themselves, inventing a romantic backstory that never happened) benefit from lengthy, attractive musical lines and lyrics that, while not flashy, are economical, pointed, and perfectly rhymed. Offering a potent counterpoint are Gil's numbers, perfect synthetics of the bluesy ballads once churned out by Johnny Hartman and Mel Torme. Aronson's exquisite orchestrations often carry an undertone of jazz piano, providing a stylistic link. It's unusual, and welcome, to find new musical theatre writing supported by so much craft. The book is extremely challenging material for musical theatre, the sort of thing that might make for a novella by Kazuo Ishiguro or, perhaps, Haruki Murakami, and one major reason it works is the highly imaginative production design. Dane Laffrey's scenic concept involves a complex arrangement of wagons and black irising panels lined in LED tape, creating a constantly shifting environment that ranges between intimate two-shots and spectacular full-stage looks. Creeping across the scenic surfaces, seemingly at the speed of thought, are video projections by George Reeve (with additional contributions by Laffrey). One minute, the actors are in a tiny space, framed in black; a minute later, they are surrounded by a lovely landscape filled with fireflies; the visual surprises never stop. Readers of LSA will be especially interested in seeing Maybe Happy Ending for its graceful melding of all its design elements. Michael Arden's aesthetically unified, elegantly handled production also benefits from Marcus Choi as James and his son, who has special reason to resent Oliver. Clint Ramos' costumes cleverly push current fashion trends a few additional steps to create believably futuristic looks. Ben Stanton's lighting catches the show's changing moods like a tuning fork, especially in sequences suggesting the passage of time. Peter Hylenski's sound design is blessedly transparent, one of his finest recent achievements. For all its successes, Maybe Happy Ending runs into trouble in its final passages when Oliver and Claire, having faced the future, must figure out what they mean to each other. The book's vagueness about their emotional capacities returns to haunt the authors, who struggle to provide a satisfying windup. It's also the point where the show's single note of whimsical romantic regret begins to cloy. The curtain falls on an unexpected gesture by Oliver that helps restore the show's balance; still, it remains a fragile thing, delicate to the touch, and probably not for fans of Broadway's blowsier, high-belting entertainments. Still, originality like this doesn't come along every day. This kooky, melancholy robot romance provides the fresh blast of talent every theatre season needs. --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 992,
  "archivePath": "data/archives/reviews/maybe-happy-ending-2024/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:29:56.774Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}