{
  "showId": "maybe-happy-ending-2024",
  "outletId": "nypost-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nypost.com/2024/11/12/entertainment/maybe-happy-ending-review-romantic-robot-musical-is-glorious-on-broadway-really/",
  "publishDate": null,
  "fullText": "One hour and 45 minutes, with no intermission. <br>At the Belasco Theatre, 111 W. 44th St.\n\nThe sublime start of “Maybe Happy Ending” is the closest I have ever come to experiencing a Pixar movie on Broadway.\n\nOliver, a lonely robot played by Darren Criss, goes through his usual daily routine — over and over and over again.\n\nWith a wide grin in a small studio apartment, he tends to his plant, HwaBoon, receives deliveries through a mail shoot and patiently waits for his owner, James, to come get him.\n\nWeeks and months pass, seasons change and the HelperBot does the same chores on repeat.\n\nThen comes a shattering message: “Twelve years later.”\n\nOliver is still there in his 300-square-foot, comfortably appointed cell. James is nowhere in sight.\n\nAs my eyes welled up — and it was still only the first number — the devastating opening of “Up” immediately sprang to mind, as did Andy giving away his cherished childhood friends in “Toy Story 3.”\n\n“Maybe Happy Ending,” like Pixar at its very best, nourishes the soul in a way few Broadway shows even attempt to do.\n\nThe blissful, boundlessly creative gift of a musical from South Korea, which opened Monday night at the Belasco Theatre, has no bulldozing ballads to cue the waterworks. There are no kitschy dance transitions to soothe our overworked brains.\n\nThe thoughtful score by Will Aronson with lyrics like firing neurons by Hue Park is sprightly and innocent — reminiscent of the pastoral soundtracks of Hayao Miyazaki’s animated films, such as &#8220;Spirited Away&#8221; or &#8220;Howl&#8217;s Moving Castle.&#8221;\n\nInstead of predictable bombast, the tender musical’s many heartbreaking and uplifting moments sneak up on us and provide an increasingly rare sensation for a genre that has become formulaic and derivative: surprise.\n\nNobody will think to bring tissues to the singing android show, but you would be well advised to stock up.\n\nAfter all, you’re at a robo rom-com.\n\nOliver&#8217;s dozen years solo ends full-stop when a fellow machine named Claire (Helen J Shen) knocks on his door begging to use his charger. Without that plug, she stops functioning — like the Tin Man when he rusts.\n\nClaire is a HelperBot 5; Oliver is a 3. Long in the bluetooth, he chides her about how the 3s are more sturdily built than the younger, glitchier models. The sad truth is that they’re both obsolete and abandoned.\n\nSoon, Claire is stopping by every day to borrow the cord. Oliver’s Scroogey annoyance turns into expectation and eventually he&#8217;s standing puppy-like by the entryway.\n\nThe spark plugs fly on Dane Laffrey’s set that’s both brutalist and comfy.\n\nThen, as soon as we&#8217;ve wrapped our heads around “Maybe Happy Ending” as a two-hander, two-room, automaton love story, the digital duo embarks on a funny road trip.\n\nClaire accompanies Oliver on a risky journey to seek out James (Marcus Choi) at his new home on an island 100 miles away.\n\nThey&#8217;re not supposed to leave their facility, so they both adopt fake identities. Their efforts to pretend to be humans at a hotel meant for, um, spicy late-night dalliances are hysterical.\n\nOf course, coming face to face with the person who consigned them to the scrap heap could bring on an existential crisis.\n\nAnd so the second half of the show confronts the challenges that the advent of artificial intelligence could someday pose for, well, artificial intelligence: Am I a being or an object? Do my needs and desires matter? Do I have the capacity to love?\n\nThat&#8217;s a lot of complex questions to ponder, but &#8220;Maybe Happy Ending&#8221; is never less than extraordinarily charming as it asks them.\n\nThis big swing of a musical wouldn’t work without the perfectly tuned performances of Criss and Shen. These roles could easily be twee and irksome — they are anything but.\n\nCriss’ Oliver is a smiley mix of J. Pierrepont Finch from “How to Succeed” and Pee-Wee Herman with a bit of earnest boy next door. He’s a bucket of bolts with a heart of gold.\n\nAs his crush, Shen imparts a sit-com sensibility to her newer, more naturally behaving Claire. Quippy and forthright, she’s the realist of the pair, save for a passion for fireflies. Shen is as incandescent as that summertime staple.\n\nTheir flirtation is helped along by silky-voiced Dez Duron as an omnipresent Frank Sinatra-like crooner named Gil Brentley. He hacks into their hard drives as he sings tunes akin to “Fly Me to the Moon” that bring the battery-powered courtship down to earth.\n\nWelding comedy, romance and science fiction, string quartets and bourbon-inflected jazz, holograms and furnished living rooms is director Michael Arden, who has simply outdone himself here.\n\nThe director, who gets better with every show, treats these otherwise disparate elements like essential apps on one harmonious device. Nothing upstages anything else. Most shows are lucky to have a single breathtaking moment. At the Belasco, you lose count.\n\nArden, who also did splendid work in “Parade” and “A Christmas Carol,” had an unenviable task with “Maybe Happy Ending”: Singing robots, they’re just like us!\n\nAnd yet he’s succeeded brilliantly. He’s brought Wall-E to Broadway.\n\nI’ve criticized Broadway many times over the years for being too robotic.\n\nThis time, however, it’s high praise.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 872,
  "archivePath": "data/archives/reviews/maybe-happy-ending-2024/nypost-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:33:21.403Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Insufficient text: 0 chars"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250902105829",
  "archiveOrgUrl": "http://web.archive.org/web/20250902105829/https://nypost.com/2024/11/12/entertainment/maybe-happy-ending-review-romantic-robot-musical-is-glorious-on-broadway-really/"
}