{
  "showId": "maybe-happy-ending-2024",
  "outletId": "thewrap",
  "outlet": "TheWrap",
  "criticName": "Robert Hofler",
  "url": "https://www.thewrap.com/maybe-happy-ending-broadway-review-darren-criss/",
  "publishDate": "November 12, 2024",
  "fullText": "Is Broadway ready for a quiet musical? The timing is perfect. Recently, a mini-war broke out on Broadway when an actor in “The Roommate,” Patti LuPone, asked that something be done about the loud music seeping into her theater from the walls of the theater that’s home to “Hell’s Kitchen.” That’s when an actor in “Hell’s Kitchen,” Kecia Lewis, charged LuPone with a “micro-aggression” due to her use of the word &#8216;loud.' The problem is, all Broadway musicals are too loud.\n\nUntil now. “Maybe Happy Ending” opens Tuesday at the Belasco Theatre, and it is downright peaceful, as well as charming and beautiful and poignant. The irony of over-amplification is that while one can be swept away by the sheer sound, if not bludgeoned, that loudness makes it often impossible to decipher lyrics. The lyrics by Hue Park and Will Aronson for “Maybe Happy Ending” are both simple and very smart, and adding to their allure is that they’re written for two characters that are not people.\n\nOliver (Darren Criss) and Claire (Helen J Shen) are robots, servants of sorts, who have been retired to what is called “the Helperbot Yards outside of Seoul, Korea.” Park and Aronson also wrote the book, and a wonderful touch is how Oliver and Claire meet. It’s just how Mimi and Rodolfo meet in “La Bohème,” only set sometime in the future: Mimi’s candle has gone out and she needs a flame from Rodolfo’s stove to relight it; Claire’s body is about to stop functioning, and she knocks on Oliver’s door because she needs recharging.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-MAYBE-HAPPY-ENDING-Starring-Darren-Criss-and-Helen-J-Shen-20241112",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-23T22:04:25.275Z"
}