{
  "showId": "maybe-happy-ending-2024",
  "outletId": "VARIETY",
  "outlet": "Variety",
  "criticName": "Christian Lewis",
  "url": "https://variety.com/2024/legit/reviews/maybe-happy-ending-review-darren-criss-broadway-musical-1236207518/",
  "publishDate": "2024-11-12",
  "fullText": "Home Legit Reviews Nov 12, 2024 11:00am PT ‘Maybe Happy Ending’ Review: Broadway’s Deeply Moving Robot Musical, Starring Darren Criss, Teaches Us How to Be Human By Christian Lewis Plus Icon Christian Lewis Latest &#8216;Chess&#8217; Review: Lea Michele Reigns as Queen of This Uneven Broadway Revival 2 months ago &#8216;Just in Time&#8217; Review: Jonathan Groff Plays Bobby Darin in a Lackluster Bio-Jukebox on Broadway 9 months ago &#8216;Pirates! The Penzance Musical&#8217; Review: David Hyde Pierce and Jinkx Monsoon Lead a Rollicking, Riotous Reimagination of Gilbert and Sullivan on Broadway 9 months ago See All Matthew Murphy and Evan Zimmerman Are we human, or are we&hellip; robots? &#8220; Maybe Happy Ending ,&#8221; a Korean musical now making its Broadway debut, asks this exact question — or in some ways, asks the inverse. It examines what it means to be human, what makes us human, and what it is that separates us from robots — but instead of doing this from a human angle, it takes the robot perspective. The musical by Will Aronson and Hue Park is set in a near-future Seoul, and concerns Oliver ( Darren Criss of \"Glee\" and \"The Assassination of Gianni Versace: American Crime Story\") and Claire ( Helen J Shen in her Broadway debut), two human-like robot \"HelperBots\" who have now been \"retired.\" Just like an old iPhone, they are doomed to planned obsolescence, abandoned by former owners and left to toil in the \"HelperBot Yards,\" a sort of robot purgatory. They meet when Claire has to borrow a charger (her cable is faulty and her battery life is shrinking; sound familiar?) and they form an unexpected bond. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-variety-article-mid-article-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[300,250],[2,2],[300,251],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); Related Stories &#039;Euphoria&#039; Season 3 Trailer: Zendaya, Sydney Sweeney and Jacob Elordi Return as Rue Battles Drug Dealers, Cassie Becomes a Cam Girl and More",
  "originalScore": null,
  "assignedScore": 85,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:04:06.568Z",
  "urlUpdated": "2026-01-23T05:35:52.589Z"
}