{
  "showId": "king-lear-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2019/04/04/king-lear-glenda-jackson-rants-raves-and-rules/",
  "publishDate": "2019-04-04T19:55:04",
  "fullText": "Any Shakespeare originalists worried whether a woman playing Lear—the playwright’s, and perhaps all of theater’s, ultimate father figure—will alter the structure of the epic drama can rest easy. In Sam Gold’s production, now at Broadway’s Cort Theatre, as soon as she enters, Glenda Jackson is every inch the king.\n\nIt certainly helps that she’s outfitted in so-called men’s clothing (a very tailored Ann Roth–designed suit), but the costume almost doesn’t matter. When she speaks—“Give me the map there,” she orders, preparing to divvy up the kingdom between eldest daughter Goneril (Elizabeth Marvel), middle daughter Regan (Aisling O’Sullivan), and youngest daughter Cordelia (Ruth Wilson)—she radiates authority. She’s not a woman playing a man; she’s simply a royal. Also, she played the part in London a few years ago, so she’s darn well proved herself by now.\n\nIf you’re there to see Jackson, you won’t be disappointed. Her performance is a study in detail: Notice her perfect posture in the opening court scene—every gesture measured, down to the finger. Then, near the end, as Lear starts to fade away, she’s slouched down and hunched over, not walking but shuffling; it’s the “crawl toward death” that Lear mentions when we first meet him. (Or, as Jackson says it, “cr-r-r-r-r-awl”—rolling the r with relish.)\n\nThe rest of Gold’s production lacks that kind of laser focus. The time period is murky; let’s just say it’s after the invention of duct tape, which features prominently in one scene. But there are definite allusions to a certain possibly certifiable current president. Gilded walls…a decorative lion statue…it’s very Trump Tower, no? And an often throwaway line by Gloucester (Tony winner Jayne Houdyshell), the play’s other deluded dad—“’Tis the times’ plague, when madmen lead the blind”—is delivered with a surprising heavy-handedness. Then there’s the onstage eveningwear-clad string quartet, which pops up at the most inopportune times, almost drowning out moments like the Lear-Goneril-Regan fight with Philip Glass music. (That’s the titanic outburst where he calls them “unnatural hags,” and vows revenge: “I will do such things—/ What they are, yet I know not: but they shall be/ The terrors of the earth.”) Also, the Edmund-Edgar-Gloucester subplot loses its oomph: As the illegitimate Edmund, Pedro Pascal doesn’t quite land the Bard’s big baseness-bastardy-base-base monologue, and, resultingly, never wins us over; as his brother, Edgar, Sean Carvajal seems to connect only when he’s speaking with Houdyshell as their father, Gloucester. As for the sons’ deadly duel—the use of guns robs that scene of any excitement.\n\nOne very clever bit of casting: Wilson, fresh from her Golden Globe–winning stint on Showtime’s The Affair, appears as both The Fool and Cordelia—the only two characters willing to speak their minds to the king—and she couldn’t be better. Her Cordelia, who refuses to falsely flatter her father and is promptly disowned, is a model of restraint. And I’ve never seen a Lear and a Fool more connected.\n\nBut the show’s secret weapon might be stage vet John Douglas Thompson, who plays the oft-underappreciated Kent. Incensed after Cordelia’s perceived betrayal, Lear banishes Kent; but good old Kent, sensing Lear might be starting to lose his marbles, disguises himself as a servant so he can stay in the king’s orbit. Whenever this King Lear lags, Thompson gives it a jolt with his mere presence. And his Act 2, Scene 2 attack on one of Goneril’s snotty servants—an insult-laden rant filled with some of Shakespeare’s sickest burns—is almost worth the price of admission. Go for Glenda, but stay to hear Thompson and his “eater of broken meats” speech.\n\nKing Lear opened April 4, 2019, at the Cort Theatre and runs through June 9. Tickets and information: kinglearonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
