{
  "showId": "the-kite-runner-2022",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Naveen Kumar",
  "url": "https://www.vulture.com/2022/07/theater-review-kite-runner-broadway-hayes.html",
  "playbillVerdictUrl": "https://www.vulture.com/2022/07/theater-review-kite-runner-broadway-hayes.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nFrom The Kite Runner, at the Hayes.\n Photo: Joan Marcus\n \n \n \n Sad stories make good books, at least according to an aspiring English teacher in The Kite Runner, Khaled Hosseini’s mega-successful debut novel. But for good books to make good plays typically requires substantial overhaul. If words on the page don’t turn into action, they may never lift off the gravel, much less soar.\n\nThere is no shortage of words in the adaptation of the 2003 best seller at the Helen Hayes Theater. Playwright Matthew Spangler has taken large passages from Hosseini’s book, including word-for-word dialogue and lots of first-person narration. But Hosseini’s storytelling excels in the thrill of its incidents and discoveries rather than its prose. So much of the action is spelled out verbatim here that The Kite Runner is more of a vivid recitation than fully realized drama.\n\n“I became what I am today at the age of 12,” both play and novel begin, introducing a fictional memoir reflecting on boyhood sins and their lifelong echoes. The narrator Amir, now married and living in San Francisco, receives a cryptic call from a family confidant back in his native Afghanistan: “There is a way to be good again,” the elder insists.\n\nBut what does it feel like to be bad? An audience wants to recognize what’s at stake from the outset. Why does Amir need to recall and relive his darkest days? What is the alternative? In the novel, a two-page opening chapter summoning the residue of Amir’s past misdeeds — vague guilt and an air of wistfulness thick as Bay Area fog — may be sufficient to fling readers back to the beginning of a decades-spanning saga. But a spring-loaded drama ought to demonstrate the wounds of his regret upfront.\n\nOnstage, Amir (Amir Arison) narrates and participates in his recollections, in both flashbacks and recent events, challenging him to shift between playing an adult and the 12-year-old version of himself. He rewinds to his adolescence in 1970s Kabul, encompassing the sweep of history — the monarchy’s fall, the Soviet invasion, the rise of the Taliban — in a personal account of his failure to protect his best friend, Hassan (Eric Sirakian), from an awful incident of abuse. Motherless sons with a thing for John Wayne, the boys are inseparable despite their division across contentious ethic lines; Amir is a wealthy Pashtun, while Hassan is Hazara and in service to Amir’s family. Appropriately enough, Amir hopes to become a writer, his nose buried in books to the disappointment of his father (Faran Tahir). Hassan is recklessly loyal and excels at running down Amir’s kite as it flits to the ground.\n\nAmir, we learn, has tormented himself since that moment of paralysis in the face of danger. It’s a reflexive, self-flagellating impulse that runs throughout the story, including a redemption arc that unfurls in the overburdened second act. A man riddled with guilt over his passivity rather than some grievous action makes for a slippery protagonist. The already privileged son has managed to frame somebody’s else’s tragedy as his own. That, more than his inaction, is hard to forgive, and it holds Amir at arm’s length from audience sympathies. The effect might be different if Hosseini had broader, keen observations to make about the nature of fate or remorse or displacement. But The Kite Runner is not Hamlet.\n\nCollapsing the distance between present-day narrator Amir and the boy he was doesn’t help. Arison makes a valiant effort, with remarkable endurance and commitment, in a role that demands more shape-shifting than one performance can hold. One moment he’s stooped forward, childlike with a lilting accent, chasing a young Hassan through stony streets. The next he’s back to describing action. Often, he has to get the emotional fallout of the plot’s revelations — which arrive at breakneck speed and often feel overwrought — into his narration. It’s an impossible set of maneuvers to sustain.\n\nThose incidents tumble out and trip over each other in a rush to include the novel’s every twist and turn. Tonal dissonance abounds, as when a near-death confrontation in a refugee caravan cuts directly to Kool & the Gang’s “Celebration” on the speakers as Amir and his father are granted asylum in 1980s America. The emotional climaxes mostly buckle beneath their own weight, save for a moment of prayer that Arison imbues with a delicate vulnerability.\n\nThe production, directed by Giles Croft and previously produced on the West End in 2016, is simple and uncluttered. The straightforward, almost minimal staging is a decent solution; an attempt to make the action jump between continents and decades with set changes might make for a real slog. An unfurled rug and rickety cityscape by designer Barney George, and painterly projections by William Simpson, efficiently effect those shifts in locale, and on-stage tabla artist Salar Nader lends intermittent pulse and rhythm. But Spangler has not conceived The Kite Runner to function theatrically, and the production cannot overcome the foundational shortfall. It conjures just enough imagery and atmosphere to curtail audience imagination but not nearly enough to make up for the loss, so we’re fully dependent on Amir’s play-by-play. Hearing his description of a kite tournament far above the treetops — while watching Arison pretend to hold a string — doesn’t beat what you might see if you read it yourself.\n\nThe context that propelled The Kite Runner to sell millions of copies nearly two decades ago has shifted, too. Though there is still a distressing lack of stories featuring characters who are refugees, Middle Eastern, or Muslim on stage, humanizing Afghan people when they were villainized in the years directly following 9/11 may have felt more provocative, radical, and even reparative to American readers than this staging does today. But the subsequent U.S. bombing of Afghanistan, and irrevocable entanglement with its fraught future, is something of a coda to Hosseini’s novel. Maybe there’s a compelling line to be drawn between this fable of fathers and sons and the pratfalls of paternalism. As it is, The Kite Runner seems content enough to leaf through a sad book for the sake of familiarity and easy sentiment.\n\nThe Kite Runner is at the Hayes Theater.\n\nComments\n \n Leave a Comment\n \n\n On Broadway, The Kite Runner Barely Escapes the Printed Page\n\n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.\n\nEditor’s Picks\n \n \n \n \n \n \n \n \n exhibit a\n \n 2024 Is Now the ‘Lock Him Up’ Election\n 2024 Is Now the ‘Lock Him Up’ Election\n \n \n \n \n \n \n \n \n \n \n games\n \n The Big Sports Gambling Scandal Might Have Already Happened\n The Big Sports Gambling Scandal Might Have Already Happened\n \n \n \n \n \n \n \n \n \n \n the national interest\n \n Why No Amount of Evidence Will Make Republicans Admit Trump’s Guilt\n Why Republicans Will Never Admit Trump’s Guilt\n \n \n \n \n \n\n \n\n \n \n \n \n Most Popular\n \n\n \n \n \n \n The Binge Purge\n \n \n \n \n \n \n Vanderpump Rules Reunion Recap: Grody to the Max\n \n \n \n \n \n \n The Tragic Zero\n \n \n \n \n \n \n The Affair of the Lightning-Bolt Necklace\n \n \n \n \n \n \n It’s the End of Top Chef As We Know It\n \n \n \n \n\n \n \n \n \n The Binge Purge\n \n \n \n \n \n \n Vanderpump Rules Reunion Recap: Grody to the Max\n \n \n \n \n \n \n The Tragic Zero\n \n \n \n \n \n \n The Affair of the Lightning-Bolt Necklace\n \n \n \n \n \n \n Drew Barrymore Is Figuring It Out Live\n \n \n \n \n\n \n\n \n Sign In to Comment\n \n \n\n \n \n \n\n \n \n\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n\n \n \n Email\n \n \n\n \n \n You\\'ll receive the next newsletter in your inbox.\n \n \n *Sorry, there was a problem signing you up.\n\nThis site is protected by reCAPTCHA and the Google\n Privacy Policy and\n Terms of Service apply.",
  "isFullReview": true,
  "textWordCount": 1224,
  "archivePath": "data/archives/reviews/the-kite-runner-2022/vulture--naveen-kumar_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:33:38.374Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230609154004",
  "archiveOrgUrl": "http://web.archive.org/web/20230609154004/https://www.vulture.com/2022/07/theater-review-kite-runner-broadway-hayes.html",
  "duplicateTextOf": "vulture--helen-shaw.json",
  "contentTier": "complete",
  "wordCount": 1224,
  "tierReason": "Full review text"
}