{
  "showId": "pictures-from-home-2023",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Lipton",
  "url": "https://cititour.com/NYC_Broadway/Pictures-from-Home/1126",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Pictures-from-Home/1126",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Despite their herculean efforts, though, “Pictures from Home” works better as a play to discuss over dinner than a fully engrossing viewer experience. Even as the story’s philosophical queries arise -- sometimes with little warning— it too often feels just like you’re eavesdropping on your neighbors’ banal conversations. Moreover, much of the play is reminiscent of watching someone else’s home movies, which we all know is less fascinating for the viewer than the taker. (And to be clear, you are sometimes doing that literally, as the Sultans’ actual home movies and photographs are projected on the back wall of Michael Yeargan’s uninspiring set.)",
  "bwwScore": 5,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PICTURES-FROM-HOME-Opes-On-Broadway-Starring-Nathan-Lane-Danny-Burstein-Zo-Wanamaker-20230209",
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $65\n Buy Tickets\n\nCititour.com Review\n In “Pictures From Home,” now at Studio 54 under Bartlett Sher’s solid direction, Sharr White’s examines the late, award-winning photographer Larry Sultan’s multi-year project – during which he took thousands of photographs of his aging parents. In doing so, he dares to ask the audience a number of big questions. Does an image truly belong to the photographer or its subject? What does it mean to be a “man”? Can we really ever know our parents? There is a lot of food for thought.\n\nLuckily, one couldn’t ask for better waiters to serve it than the incomparable Nathan Lane (in a must-see turn, complete with his trademark comic timing, as Sultan’s often surly dad Irv), the wonderful Zoe Wanamaker (in fine form as Sultan’s feisty mom Jean) and the reliable Danny Burstein (affecting and oddly convincing as the child-like Sultan, who is actually in his 30s during much of the play). \n\nDespite their herculean efforts, though, “Pictures from Home” works better as a play to discuss over dinner than a fully engrossing viewer experience. Even as the story’s philosophical queries arise -- sometimes with little warning— it too often feels just like you’re eavesdropping on your neighbors’ banal conversations. \nMoreover, much of the play is reminiscent of watching someone else’s home movies, which we all know is less fascinating for the viewer than the taker. (And to be clear, you are sometimes doing that literally, as the Sultans’ actual home movies and photographs are projected on the back wall of Michael Yeargan’s uninspiring set.) \n\nWorse, for all its big ideas, the play turns out to be a small-stakes affair. Despite spending weekend after weekend away from his wife and young children, Larry’s marriage is never remotely in jeopardy. And he’s so doted on his by parents, even as his actions frustrate, anger and confuse them, one knows Larry will never be completely banished from his childhood home. \nAs for the unmoored, retired salesman Irv – a minor variation on Willy Loman (a role I still want Lane to play) -- and Jean, the successful real-estate mogul who loves her work but resents the fact that she’s become the family breadwinner -- they’re instantly recognizable to most of us. They bicker, they belittle, they even seem poised to kill each other at times. But this is no “Who’s Afraid of Virginia Woolf?” We know no real harm, physical or psychological, will be done to either of them. \n\nMoreover, when Sultan finally reveals the reason that he’s so devoted to the project – an answer that seems appropriate for a 12-year-old but not a grown man – the rules over his visitations only slightly change, even after Irv and Jean relocate to Palm Desert and the project seemingly concludes.\n\nIndeed, what ultimately comes into sharp focus is how these three people have entered, willingly or not, into a triangle of codependence. That’s a picture that White draws clearly but seems to have eluded the Sultans themselves.\n By Brian Scott Lipton\n\nVisit the Sitehttps://picturesfromhomebroadway.com/Open/Close DatesOpening 2/9/2023Closing 4/30/2023\nTheatre Info\nStudio 54254 West 54th StreetNew York, NY 10019 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 572,
  "archivePath": "data/archives/reviews/pictures-from-home-2023/cititour--brian-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:38:43.554Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 572,
  "tierReason": "Full review text"
}