{
  "showId": "pictures-from-home-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2023/02/09/pictures-from-home-family-drama-not-fully-developed/",
  "publishDate": "2023-02-09T21:54:48",
  "fullText": "In 1992 photographer Larry Sultan published Pictures From Home, a collection, with accompanying comments, involving his parents, Irving and Jean. It was his idea to create a sociological study of the family from his own up-close-and-very personal experience. He’d been assiduously pursuing the project for almost a decade.\n\nHe believed that photographs of Irving and Jean – he appears in none of them – would transcend mere snapshots and imply more about the complex dynamics of the contemporary family unit. Recording the immediate, he’d delve more deeply into an expansive look at family mythology. The result has  been highly regarded ever since, his intentions understood and respected.\n\nIt would be interesting to know what photographer Sultan, who died in 2009, would make of Sharr White’s Pictures From Home, a stage adaptation of the book, complete with projections (by 59 Productions) of Sultan’s photographs and various Sultan home movies of Irv, Jean and the three Sultan sons when much younger.\n\nPlaywright White (The True, The Other Place) sees the intermissionless work as a live, in-person explanation and explication of Sultan’s volume that the photographer himself (Danny Burstein) as well as Irving (Nathan Lane) and Jean (Zoë Wanamaker) are giving the audience.\n\nThroughout it, Larry reiterates the motive for the project. The word “project” is so often reiterated that eventually it acquires the weight of lead bricks dropped all over the set that Michael Yeargan has modeled on the elder Sultans’ San Fernando Valley home with its sloped high ceiling, green-and-white floral-patterned upholstery and glass doors leading to a garden.\n\nUnfortunately, although Sharr honors Sultan’s long-defined reason for sometimes catching Irv and Jean off-guard and sometimes posing them, what he eventually conveys – this cannot be his intention – is something quite a bit removed from what he thinks he’s telling us.\n\nYes, intermittently he captures and displays the truth of a marriage’s ups-and-downs –and the love that genuinely binds it — but for almost all the duration, he more closely presents an amalgamation of Death of a Salesman spun as Death of a West Coast Salesman and an update of the early Don Ameche-Frances Langford radio-then-television sitcom, The Bickersons.\n\nThis transpires as Irv and Jean argue increasingly until the yelling becomes numbing. Nonetheless, the badgering is almost a calming relief when compared to Irv and Larry having at each other. Irv, once a successful Schick Razor Company salesman covering a wide swath of California, was suddenly dismissed and hasn’t worked in years. He’s become extremely frustrated at doing little else than tending to his partially viewed garden.\n\nFor his part, Larry keeps after his father to understand the import of a nebulous enterprise. He’s relentless for so long that the vaunted project begins to lose any seeming value. Rather, it takes on the shape of a son’s narrow-minded attack on his dad. Watching the forays during Larry’s usually twice-monthly visits, spectators can’t be blamed for thinking they aren’t so much watching an artist pursuing a goal as getting a lengthy peek at a son doggedly acting out a rampaging Oedipal Complex.\n\nNot too long after Pictures From Home gets underway, it turns boring and then abusive to the patrons. Then, if this is the California answer to Arthur Miller’s classic drama, it becomes a piece to which much attention need not be paid.\n\nThe modicum of attention that might be paid is due to venerable actors Lane, Burstein and Wanamaker. (Lane is top-billed, but Burstein gets the last and therefore most prominent of the separate curtain bows.) Dominating as each can be, they’re hampered by Sharr’s script and Sher’s acquiescing direction.\n\nLane consistently harangues. Burstein consistently hounds. While both are strong doing the Sharr-Sher bidding, the sound of one note repeating takes over. Wanamaker — who on entrance might make ticket buyers remember Estelle Getty — comes off best, as hot real estate broker Jean, serving as a calming influence on her husband and son.\n\nIntermittently, some attention-pulling incidents emerge. In an early home movie moment, Irv is caught teaching Larry how to jump with the help of a hula hoop prop. The jumping-through-a-hoop metaphor was surely not intended at the time, yet it’s there to be appreciated.\n\nFunnily enough (or perhaps not funnily enough), Larry’s pressuring Irv to jump through a truly metaphorical hoop occurs on several occasions, not the least of which when Larry prods a resisting Irv to pose uncomfortably at an easel, as if giving one of his instructive lectures to an aspiring Schick razor force.\n\nOn Sultan’s cue, Sharr does hit one or two attention-hopeful turns at the final minutes. Nice try – even moving try – but too late to redeem the proceeding stretches. Sultan’s Pictures From Home retains the upper hand on Sharr’s Pictures From Home.\n\nPictures from Home opened February 9, 2023 at Studio 54 and runs through April 30. Tickets and information: picturesfromhomebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2023/02/09/pictures-from-home-family-drama-not-fully-developed/",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
