{
  "showId": "pictures-from-home-2023",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/pictures-from-home-broadway-review-nathan-lane-danny-burstein-zoe-wanamaker",
  "publishDate": null,
  "fullText": "Read our four-star review of Sharr White's Pictures From Home starring Nathan Lane, Danny Burstein, and Zoë Wanamaker, playing at Studio 54 on Broadway. “I’m exploring.” That’s what the acclaimed photographer Larry Sultan tells his parents in Pictures From Home, a surprisingly touching new play based on his 1992 photo memoir of the same name. It’s 1982. Larry (Danny Burstein), a married father of two who lives in San Francisco, is explaining plans for his new art “project” to his mom and dad, Jean and Irving (Zoë Wanamaker and Nathan Lane), in their southern California home. Larry’s exploration will ultimately take ten long years to complete. They’ll be part of it every step of the way. During that decade, Larry obsessively combs through 30 years of the family’s vintage home movies and snaps countless candids and meticulously arranged pictures of his parents. His bottomless curiosity about Irv and Jean turns the aging couple’s lives inside out. “What I’m doing,” says Larry, “is looking for the life beyond the frame.” Playwright Sharr White (The Other Place) finds similar narrative inspiration for this rich drama about the marvels and mysteries of an ordinary family. (It’s a selective portrait – Larry’s two brothers are mentioned in passing, and that’s it.) White looks beyond content in Sultan’s book to imagine inevitable behind-the-scenes small- and large-scale dramas drummed up by Larry’s posing and probing. Art isn’t easy – just ask these accommodating parents with lives of their own. From the jump, it’s obvious White isn’t taking a realistic route. Larry periodically breaks the fourth wall (as do his parents) and summons an invisible projectionist to roll homemade family films and cue up pictures, as if he’s giving a photography lecture back at California College of the Arts. Scene-setting text projections – “Terminal A,” “The Silent Treatment,” “Departures” – pop up in the unbroken 105-minute production as the action shifts in time and location. Under Bartlett Sher’s assured direction, all three actors deftly capture the play’s shifting tones. Burstein shines as Larry, an artist whose work may not always be in his parents’ best interests. Wanamaker’s Jean is happily resigned to her life, but she’s nobody’s fool. Irv, a salesman-turned-executive unceremoniously pushed into retirement, emerges as a fascinating figure. Credit Lane’s depiction that toggles back and forth from funny to poignant in a flash. A striking aspect of Sher’s production is that the actors aren’t lookalikes for the people they’re playing. Lane and Burstein are nearly the same age. It’s a play about memories, after all, so there’s distance between how people are seen and how they really are. Early on, Larry claims the story “isn’t about me, it’s about them.” Irv drolly responds, “Larry may say it’s about us, but trust me. It’s about him.” Perhaps the casting lends wiggle room. If you’ve ever had questions or concerns about your parents, perhaps it’s about you, too. Irv calls the project an \"investigation,\" questioning whether Larry’s staged pictures reveal anything authentic and wondering why he’s spending so much time away from his own family. The play considers that Larry’s motive wasn’t just about exploring. It was also about exploding myths and images suggesting a storybook life. As in any play about a family, White covers expected territory about generational divides, legacies, mortality, and finally, love. Eventually, a clear picture develops about what was driving Larry’s parent-focused project. It was to “stop time,” he says. “I want you to live forever.” But even beyond the frame, time ticks on. Pictures From Home is at Studio 54. Get Pictures From Home tickets on New York Theatre Guide. Photo credit: Danny Burstein, Zoë Wanamaker, and Nathan Lane in Pictures From Home. (Photo by Julieta Cervantes) Originally published on Feb 9, 202322:00",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "“As in any play about a family, White covers expected territory about generational divides, legacies, mortality, and finally, love.”\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 622,
  "archivePath": "data/archives/reviews/pictures-from-home-2023/nytg--joe-dziemianowicz_2026-02-04.html",
  "textFetchedAt": "2026-02-04T16:59:00.032Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 622,
  "tierReason": "Full review text"
}