{
  "showId": "the-sound-inside-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2019/10/17/the-sound-inside-adam-rapps-potent-nod-to-great-literature/",
  "publishDate": "2019-10-17T21:45:49",
  "fullText": "Saying that Adam Rapp’s The Sound Inside has an unusual meta-literary quality may seem off-putting, but it’s meant to be a compliment, a heartfelt encouragement aimed at anyone eager to attend a play with subtly deep rewards.\n\nBella Lee Baird (Mary-Louise Parker) is a Yale creative-writing professor who’s published one novel that was well reviewed almost everywhere but in the New York Times Book Review. Hardly bitter about that response from a “peer” writer-reviewer—as wise novelists are about that sort of thing—she remains apparently inspirational to her students and certainly to freshman Christopher Corbit Dunn (Will Hochman).\n\nChristopher shows up at her office one day without having made an appointment. Requiring one is Bella’s policy, but she allows him to stay and patiently listens to his angry criticisms of school rules. Her interest is heightened when he announces he’s writing a novel and she likes the sound of it.\n\nOver subsequent visits for which he eventually does contact her in advance, he keeps her up to date on what he’s writing. His protagonist—at first identified as X but then as Christopher—is a Yale student who, traveling to Manhattan to see Caryl Churchill’s Cloud Nine in revival, joins a slightly older man on the trip, and the action leads to dire repercussions that won’t be revealed here.\n\nIn time, Bella, who comes across as a loner, and Christopher, who comes across as a loner of a different stripe, begin having meals together. A relationship grows, but something that might occur to observers as about to happen doesn’t. Be happily advised that this is not a drama about an older woman having an affair with a student that meets a sorry end. Phew!\n\nRapp has something quite different in mind for a piece that Bella narrates. As she reports the increasing teacher-student bond, she also announces that a severe pain she unexpectedly suffered at one mealtime is shortly diagnosed as (somewhat of a spoiler looming) an advanced cancer for which there is no particularly promising prognosis. That prognosis gives 53-year-old Bella the idea (another spoiler on the way) that suicide is her best recourse, one that requires a second person to complete—that participant being Christopher.\n\nDisclosing all the above, Bella continues telling her tale, including in graphic detail a one-night stand she has after receiving the bad news. Nevertheless, she gives pride of place to Christopher’s novel, which he calls “To Lie Face Down on a Field of Snow,” a title that has a disturbing foreshadowing effect. Both Bella and Christopher read aloud from what she decides is, at 100 pages, the student’s novella, a novella she admires.\n\nIndeed, the talk of novels and novellas, not to mention the first-person narrative, gives The Sound Inside its richly literary quality. It’s almost as if the play is somehow both more and less than a play. To some extent, playwright-novelist Rapp’s work suggests that it might initially have emerged as, like Christopher’s, a novella. The presence of Christopher’s excerpts are part of the meta-literary sense clinging to The Sound Inside.\n\nMoreover, Christopher’s novella isn’t the lone literary work discussed during The Sound Inside. Bella summarizes the plot of her novel, Billy Baird Runs Through a Wall. In it the title character—whose name is a spin on Bella Baird, just as Christopher uses his name—attempts to follow through on the title’s promise.\n\nWait, there’s more! It could be that with Bella’s title Rapp is alluding to Marcel Aymé’s 1943 short story Le passe-muraille (translated as The Man Who Walked Through Walls). As French author Aymé (1902-67) pens it, the man does succeed in walking through walls, whereas Bella’s Billy Baird doesn’t.\n\nIt’s unlikely that many spectators at Rapp’s play will be aware of the (possible) Aymé reference, but still there’s a novel-within-novel, a hall-of-mirrors aspect to The Sound Inside that’s hard to miss. The result is not so much that a play is being performed but that a novel (novella? short story?) has been adapted for the stage and that wonderful stage actor Parker has been recruited to give it the full three-dimensional-character treatment.\n\nIn costumer David Hyman’s casual clothes, Parker brings Rapp to life with a lovely looseness. She conveys Bella’s love of books, a devotion that overrides her interest in daily life. She underlines Bella’s dedication to teaching and to students who show talent. She gets across Bella’s taking the world wherein she lives with a mature acceptance—with an ability to dismiss its vicissitudes in favor of the interior life great literature provides. (Rapp’s title may have something to do with that.)\n\nFurthermore, Hochman, making his Broadway bow, plays opposite her with a fervor matching her appealing equability. And director David Cromer—with set designer Alexander Woodward, sound designer Daniel Kluger and, most prominently, lighting designer Heather Gilbert—facilitates with alluring ease.\n\n(N.B.: The Sound Inside isn’t the only recent play about a creative-writing teacher at Yale. Theresa Rebeck’s Seminar is another. It may even be that one of these days a third playwright will remember that Robert Penn Warren taught a beloved creative writing seminar at Yale and produce a play about that.)\n\nThe Sound Inside arrives at a time when literature is under siege, when the dumbed-down frame of mind is in ascendant. Rapp is to be thanked for an indisputably probing play that pays homage to the still potent aspiration to greatness.\n\nThe Sound Inside opened October 17, 2019, at Studio 54 and runs through January 12, 2020. Tickets and information: soundinsidebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
