{
  "showId": "the-sound-inside-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2019/10/17/the-sound-inside-mary-louise-parker-spins-an-intriguing-literary-yarn/",
  "publishDate": "2019-10-17T21:46:12",
  "fullText": "Theatergoers who don’t mind leaning forward in their seats and paying rapt attention to ideas, thoughts, and intricately sculpted language are in for a magical evening at Studio 54, where Adam Rapp’s The Sound Inside is holding the stage.\n\nThe play starts and ends with Mary Louise Parker delivering something of an inner monologue, neither loud nor flashy but piercingly human. Parker, who has been gracing the local boards for 30 years now, is one of those actors of whom it can be said that when they are good—as with unforgettable performances in How I Learned to Drive and Proof—they are very good. Here, Parker is very good indeed.\n\nThe highly accomplished veteran is accompanied by an astonishing newcomer by the name of Will Hochman, who turns out to be a perfect match. (You might have caught him downtown, briefly, in the 2016 CSC adaptation of Dead Poet’s Society.) Parker has far more to do and say throughout the evening, but no matter; Hochman is central to the piece, and the pair indeed make magic.\n\nAll of this is courtesy of the text they are given, a marvel of a play that consistently challenges us to listen and wonder and think. Rapp, author of numerous plays and novels, makes an auspicious Broadway debut with The Sound Inside, which originated with this production in July 2018 at the Williamstown Theatre Festival.\n\nThere’s one additional magician on hand: Director David Cromer, who has helmed such diverse fare as the Barrow Street Our Town, the Tony Award-winning Band’s Visit, and more. Cromer works with such a masterful but invisible hand here that you might well gasp when the two actors, in the middle of a discussion, stand and switch sides of a table. Cromer offers further directorial touches—or mere, unobtrusive hints of such—as the brisk 90-minute evening approaches its climax.\n\nBella Lee Baird is an English professor at Yale on the far side of 50, with one unsuccessful novel and several short stories to her credit but little more. (She describes herself as “four or five degrees beyond mediocre, the equivalent of a collectible plate mounted to a wall.”) Bella teaches in a vacuum until confronted, one fall day, by Christopher Dunn, an unconventional freshman from Vermont who is every bit as much of a literary introvert as Bella.\n\nIs Christopher real? Or is the boy—and the novel that he is fitfully writing, with noticeable parallels to Bella’s 20-year-old debut novel—merely a character in a second novel that Bella, suddenly diagnosed with “a stomach riddled with a constellation of tumors,” is feverishly rushing to finish? Rapp’s writing—and the performances by Parker and Hochman—teases us into a state of pristine unclarity.\n\nWhich leaves us listening so carefully that we almost ration our breathing. Bella’s writerly creed, and her advice to her generally nonresponsive students, is “listen to the sound inside.” And “the sound inside” is, indeed, descriptive of The Sound Inside. Bella is a teacher of communication—that is, English—incapable of any sort of communication with anyone.\n\nUntil the similarly disconnected Christopher comes along. Even then, they don’t communicate through conversation; rather in what seem to be inner (inside) monologues. You’ll note that the small talk—from both of them—is littered with what sounds like novelistic prose. (“I’m essentially a walking Social Security number with a coveted Ivy League professorship and a handful of moth-bitten sweaters,” Bella says casually.) This brings them together, against the world; but they are not actually together. They are overwhelmed by their individual sound inside, and somewhat reassured to find someone with whom they can communicate—or, at least, talk with and at.\n\nSet designer Alexander Woodward, lighting designer Heather Gilbert, and production designer Aaron Rhyne all contribute mightily to Cromer’s production, often making it seem like we are listening to an interior monologue on a bare stage except when we gradually sense we are not.\n\nAll in all, it’s a magical evening from Rapp, Cromer, and the altogether mesmerizing Parker and Hochman. Theatergoers who are not averse to listening and thinking should head over to 54th Street to hear The Sound Inside.\n\nThe Sound Inside opened October 17, 2019, at Studio 54 and runs through January 12, 2020. Tickets and information: soundinsidebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial"
}
