{
  "showId": "the-sound-inside-2019",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2019/10/17/theater/the-sound-inside-review.html",
  "publishDate": "October 18, 2019",
  "fullText": "https://www.nytimes.com/2019/10/17/theater/the-sound-inside-review.htmlShare full article25Advertisement\n\nThe urge to move small shows to Broadway should generally be resisted. Whether musicals or plays, most transfers from 199-seat houses feel dinky in palaces accommodating 900, and the frantic efforts made by creative teams to fill the void too often wind up highlighting it instead.\n\nThere are, of course, exceptions, including “The Band’s Visit,” which won the Tony Award for best musical last year. That show’s director, David Cromer, a minimalist to begin with, didn’t inflate the material for Broadway; he battened it down, as if for a storm. Urging the audience to come closer instead of forcing the show to grow bigger, he made you enter its world through the smallest possible door.\n\nThe surprise — and joy — is that the world can seem so vast when approached that way. Or at least it does in Cromer’s flawless production of “The Sound Inside,” a play by Adam Rapp that opened at Studio 54 on Thursday. When I saw its world premiere at the Williamstown Theater Festival in 2018, it was already a gripping small-scale mystery, and a spectacular showcase for its star, Mary-Louise Parker. Now, having been put through Cromer’s less-is-everything makeover, it’s even more resonant on Broadway: a tragedy about fiction, both the kind we read and the kind we live.\n\nThe makeover — a subtle one, naturally — begins with the script. I had to read both versions to see what Rapp had done to tighten the screws without visibly altering the story or the running time: 90 uninterrupted minutes of tension. “The Sound Inside” is still, self-consciously, a yarn, which makes sense because it’s about writers: the kind of people who in weaving stories are often in danger of unraveling themselves.\n\nThat’s literal here. Bella Lee Baird (Parker) is a 50-ish creative writing professor at Yale who has just received a diagnosis of stage 2 cancer. Addressing the audience directly as if reading a novel-in-progress aloud, she describes — and in the process aestheticizes — her unorthodox treatment decisions. These eventually come to involve Christopher Dunn, a freshman in a course of hers called Reading Fiction for Craft.\n\nChristopher (Will Hochman) is a misfit at Yale: He won’t use email or drink fancy coffee. He may be a misfit everywhere else, too, with his bursts of rudeness, floods of invective and obsessive interest in “Crime and Punishment.” But he is nevertheless, in Bella’s judgment, a prodigy. As he shares with her the pages of his own novel-in-progress, about a Yale freshman named Christopher who does something very bad, the two grow closer.\n\nBy the time their stories (and fictions) start to merge, the pleasure of fine in-the-moment writing is hopelessly jumbled with dread about what happens next. Even having seen the play before, I was in constant doubt as to its outcome. A piece of advice Bella gives Christopher helps to explain Rapp’s technique here: “If your protagonist is leading you then you’ll likely stay ahead of your reader.” Certainly Rapp, a longtime master of foreboding, stays well ahead of us, as Bella and Christopher seem to have stayed ahead of him.\n\nRapp’s revisions emphasize those gaps. Lines that tended to explain behavior or to suggest the possibility of such explanations have been cut. (Christopher’s father, described as a schizophrenic in the earlier version is now just “a complete mystery.”) Lines that were giveaways as to the characters’ emotional states are now refocused. (Bella no longer calls Christopher’s prose “gorgeous” but “beautifully restrained.”) Lovely, extraneous selections from other writers’ works have been trimmed in favor of tantalizing selections from Bella’s.\n\nOffering a character’s artistry to an audience is always a gamble, but Rapp doubles down on it; Bella, being the author of two “slim volumes” of stories and one “underappreciated” novel, also speaks in stylish and witty prose. Describing a sexual encounter, she says that the man “moves over and into me like some soft rectangular machine that pushes smaller objects toward their inevitable path on an assembly line.”\n\nThat this never becomes twee is miraculous, but Rapp keeps switching up his approach, sometimes having Bella and Christopher alternate in telling the story and other times having them enact it together in scenes. The specificity of the performances also helps prevent the cultivated tone from cloying. Parker, never better in her 30-year stage career, has dug even deeper into Bella, treating each line as if it were an archaeological site; she builds her performance on artifacts, not theories.\n\nAnd Hochman, who was still pecking his way toward the tricky role at Williamstown, has found it. What can read on the page as a character back-formed from plot necessity, and what therefore seemed like a collection of tics onstage, is now fully connected. Believable both as an 18-year-old and an artist, Hochman — and this is saying a lot — is a worthy partner to Parker onstage.\n\nBut it takes a third character — Cromer’s staging, a living presence in itself — to make “The Sound Inside” so riveting. I don’t know what other director would have dared to provide so little visual information in a two-person show; it is even sparer, more subliminal, on Broadway than it was at Williamstown.\n\nOn the other hand, a lack of visual information is a form of visual information; once you adjust to it, the dark created by the designers — Alexander Woodward (sets), Heather Gilbert (lights), Aaron Rhyne (projections) — becomes exceptionally expressive. Between black and jet black there’s room for a lot of drama.\n\nCromer has likewise forsworn, as a writer steers around clichés, any emotional underlining of the kind you typically get from costumes (David Hyman), sound (Daniel Kluger) and overacting. His principle seems to be that of fiction itself: to force an engagement between the author’s imagination and the reader’s. When you enter a story, especially one that is basically a mystery, you should do so almost naked, with as little information as possible.\n\nPerhaps it shouldn’t surprise us that the result is almost erotic in its withholding. Rapp tips us off to this by having the manuscript of Christopher’s novella bear an epigraph from “Crime and Punishment”: “We sometimes encounter people, even perfect strangers, who begin to interest us at first sight, somehow suddenly, all at once, before a word is spoken.”\n\n“The Sound Inside” interests us at first, bleak sight. It keeps our interest not only on its narrowest terms, as a play about writing, but in its larger implications. What we know about other people, what we know about ourselves, are stories that won’t stay still. As we write our lives, like a good novel, our lives keep out-writing us.\n\nTickets Through Jan. 12, 2020, at Studio 54, Manhattan; 212-2390-6200, lct.org. Running time: 1 hour 30 minutes.\n\nJesse Green is the co-chief theater critic. Before joining The Times in 2017, he was the theater critic for New York magazine and a contributing editor. He is the author of a novel, “O Beautiful,” and a memoir, “The Velveteen Father.”",
  "isFullReview": true,
  "dtliExcerpt": "In Adam Rapp's new play, Mary-Louise Parker gives a performance of such quiet intensity that you lean forward to catch every word, every breath.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "The surprise - and joy - is that the world can seem so vast when approached that way. Or at least it does in Cromer's flawless production of 'The Sound Inside,' a play by Adam Rapp that opened at Studio 54 on Thursday. When I saw its world premiere at the Williamstown Theater Festival in 2018, it was already a gripping small-scale mystery, and a spectacular showcase for its star, Mary-Louise Parker. Now, having been put through Cromer's less-is-everything makeover, it's even more resonant on Broadway: a tragedy about fiction, both the kind we read and the kind we live.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "In Adam Rapp's new play, Mary-Louise Parker gives a performance of such quiet intensity that you lean forward to catch every word, every breath.",
  "contentTier": "complete",
  "contentTierReason": "Short text (24 words)",
  "textQuality": "partial",
  "previousUrl": "https://www.nytimes.com/2019/10/18/theater/the-sound-inside-review.html",
  "urlDiscoveredAt": "2026-02-04T01:50:15.774Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1170,
  "archivePath": "data/archives/reviews/the-sound-inside-2019/nytimes--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T19:32:36.398Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251028184413",
  "archiveOrgUrl": "http://web.archive.org/web/20251028184413/https://www.nytimes.com/2019/10/17/theater/the-sound-inside-review.html",
  "wordCount": 1170,
  "tierReason": "Full review text",
  "playbillVerdictUrl": "https://www.nytimes.com/2019/10/17/theater/the-sound-inside-review.html",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews"
  ],
  "bwwScore": 8
}
