{
  "showId": "the-sound-inside-2019",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2019/10/theater-review-the-sound-inside-with-mary-louise-parker.html",
  "publishDate": "October 17, 2019",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nMary-Louise Parker and Will Hochman in The Sound Inside.\n Photo: Jeremy Daniel\n \n \n \n There’s nothing wrong with The Sound Inside’s pedigree. It stars Mary-Louise Parker, whose strange air of iced-over agitation can be so magnetic onstage; it’s directed by David Cromer, who knows his way around a new text. It comes to Broadway from Williamstown, where it was fed and watered carefully, and playwright Adam Rapp has done high-wire acts before: the lovely Red Light Winter and an old favorite of mine, Nocturne, in which a heartbroken young man talks us through his long experience with grief.\n\nRapp — often a television writer — started as a novelist, and you can hear that mode calling to him through his plays, whether he’s using direct address or characters who wax poetic. But the impulse to explore nondramatic text has gotten clotted in The Sound Inside: There’s too much self-consciousness, too much writing about writing. “That sounds like writing,” the two characters will caution each other when something sounds too processed — in this incredibly processed-seeming play. And Lord knows it’s dangerous to have your characters talking about technique. “It’s very powerful,” one person says to the other about a bit of story in the show we are presently watching. Are we here to listen to the playwright give himself compliments? What an odd use of time.\n\nThe main compliment-giver is Bella Baird (Parker), a professor at Yale, who first appears isolated in a spotlight, introducing herself by drawing attention to how badly she’s introducing herself. She would never tell her students to explain a character in such detail, she assures us, before telling us about her eating habits (steak once a month), her loneliness, her publishing history, and her late-diagnosed, fast-blooming cancer. Slowly, a set creeps forward out of the murk — Heather Gilbert’s lighting design is a series of near blacknesses — and we see Baird flash back to meeting Christopher Dunn (Will Hochman), a needy creative-writing student who has come by during her office hours.\n\nThe characters and, indeed, the play itself make a fetish of books. At one point, Bella tells us she is sleeping with a typescript on her pillow, waking to embrace it in the morning. Christopher is such an awkward guy that he doesn’t take his backpack off during their first meeting, perching forward uncomfortably on his seat, but he sometimes opens his hands in front of him in a graceful little gesture: He is always thinking about the sensation of opening a book. The play is similarly obsessed with narration. Bella speaks to us as frequently as she speaks to Christopher, so, for instance, while they’re discussing his aversion to email, she turns to us to say, “He smiles. He suddenly looks impossibly young, like an oversized 14-year-old.” Parker’s voice — her great treasure as a performer — manages to sound both dryly amused and on the brink of some great revelation. But despite her gifts, this sort of story-theater method tends to sap the energy of a play. It becomes doubly soporific in this production, which is already plunged into unrelenting, sleepy dimness.\n\nThe world has conditioned us to find the scenario frightening: A boy shows up to insist that his female professor pay attention to him, bend the rules for him, admire him. Yet Bella is, perversely, intrigued because Christopher has said something provocative about Crime and Punishment. Most teachers would have long since pushed a panic button, but Bella encourages Christopher to tell her the plot of his new novel (giving us still more stretches of narrative), even after he has reeled off a list of suicidal authors, and she’s flattered when he turns to the audience to relate the events of her novel (thus, a third nested story).\n\nThe tale Bella is telling about herself and the story Christopher is writing in his novel do eventually knot together. Her cancer leads her to desperation, and she asks terrible things of him, puts burdens on his shoulders that would crush any stranger. Only because they’re such literarily determined characters — as opposed to people — do Bella and Christopher continue to have so much to say to each other. Rapp needs them to behave strangely, even inhumanly, so he can unspool one more heavily foreshadowed development that braids them together forever.\n\nIt’s lucky, then, that the production has Mary-Louise Parker. She’s quite odd as Bella, nervy but glacially unresponsive to her own end-of-life terror and blessedly able to convey the sensation of a thought happening in real time. She chooses to work the vein of the character’s self-absorption, so we watch her turn inward, then inward again — a kind of implosion in real time. Her Bella sometimes so surprises herself with a turn of phrase that Cromer has her write it down on a little notepad, which is a welcome note of humor: They show us how a writer’s narcissism can be a buffer against death itself. There will certainly be an audience for The Sound Inside because it’s clever, if airless, and because it compliments itself and its audience by talking about writing in terms of surprise (which it contains) and menace (ditto). For those of us left alienated by its self-regard, at least there’s always something to read.\n\nThe Sound Inside is at the Roundabout at Studio 54 through January 12.\n\nShow \n \n \n Leave a Comment\n \n\n Theater Review: The Sound Inside Keeps Looking at Itself\n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "dtliExcerpt": "Mary-Louise Parker gives a performance of such precision and intelligence that she makes even the play's most questionable moments feel inevitable.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mary-Louise Parker gives a performance of such precision and intelligence that she makes even the play's most questionable moments feel inevitable.",
  "contentTier": "complete",
  "contentTierReason": "Short text (21 words)",
  "textQuality": "full",
  "previousUrl": "https://www.vulture.com/2019/10/theater-review-the-sound-inside.html",
  "urlDiscoveredAt": "2026-02-04T01:52:29.670Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 929,
  "archivePath": "data/archives/reviews/the-sound-inside-2019/vulture--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:52:29.684Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250721234202",
  "archiveOrgUrl": "http://web.archive.org/web/20250721234202/https://www.vulture.com/2019/10/theater-review-the-sound-inside-with-mary-louise-parker.html",
  "wordCount": 929,
  "tierReason": "Full review text"
}