{
  "showId": "funny-girl-2022",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/entertainment/broadway/ny-broadway-funny-girl-review-beanie-feldstein-20220425-pydgl7irlzdffdncsr2yiz5n7q-story.html",
  "playbillVerdictUrl": "https://www.nydailynews.com/entertainment/broadway/ny-broadway-funny-girl-review-beanie-feldstein-20220425-pydgl7irlzdffdncsr2yiz5n7q-story.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "ExpandAutoplayImage 1 of 18Sarah Paulson attends the Broadway opening night of \"Funny Girl\" at the August Wilson Theatre on Sunday, April 24, 2022, in New York. (Greg Allen/Greg Allen/Invision/AP)\n\nShe had ‘em at “Hello, Gorgeous.”\n\nTo say that the Broadway crowd at “Funny Girl” on opening weekend was pulling for Beanie Feldstein as Fanny Brice is a bit like saying Barbra Streisand has a forceful personality. It hardly scratches the surface of what transpired.\n\nIf the audience at the August Wilson Theatre could have carried Feldstein on its shoulders toward all the right notes and timbres and morphed her vocal sound into something that sent Streisand adorers into bitter fits of jealousy, they surely would have sold their souls to do so. Those purist old haters are going to hate, the mezzanine seemed to be saying, but Beanie not only belongs to us, she represents us.\n\nBeanie Feldstein as Fanny Brice and Ramin Karimloo as Nick Arnstein in \"Funny Girl.\" (Matthew Murphy)\n\nThat palpable affection and identification, which is often wrongly discounted when it comes to the economic prospects of Broadway musicals, truly was something to experience. And it’s indicative, I think, of a bright future for this Michael Mayer revival. It won’t need great reviews. It has Beanie and her fans. And thanks to the wily hand of Harvey Fierstein, the book has been cleverly retrofitted. Certainly, it doesn’t creak like the last time I saw this musical with original book by Isobel Lennart, lyrics by Bob Merrill and music by the incomparable Jule Styne.\n\nWatching the performance of this 28-year-old actress actually feels like a living referendum on what now makes a great lead performance in a classic musical comedy. Feldstein struggles mightily with the internal vocal demands of numbers like “Don’t Rain on My Parade” and “People,” her voice coming and going. She has, though, figured out how to sustain the crucial final note, which is, for some, what matters most. She throws back her head, summons up every inch of her heart and soul and lets fly on, like, “pa-RAAADE.” Boom. Its amalgam of theatricality and raw determination inspires forgiveness.\n\nKurt Csolak, left, Beanie Feldstein as Fanny Brice, Justin Prescott in \"Funny Girl.\" (Matthew Murphy)\n\nAll of Feldstein’s chips are in the middle of the table at every moment and who does not enjoy seeing that in a Broadway theater on a Saturday night, surrounded by people who need people?\n\nFierstein has edged this “Funny Girl” book revision away from the narrative of a rising-star heroine who makes poor choices when it comes to her choice of beau in Nick Arnstein (Ramin Karimloo, trying to find a way into the show) and who ignores the cute guy Eddie (Jared Grimes), who would have really loved her. Instead, Fierstein and Mayer have wisely decided to make this more a story of a young woman with no filter, a woman whose musical-comedy talent is lived in every moment of her life and who simply cannot help but be herself.\n\nLeslie Flesner, left, Afra Hines, Beanie Feldstein as Fanny Brice, Ramin Karimloo as Nick Arnstein in \"Funny Girl.\" (Matthew Murphy)\n\nAs such, they built their clutch of supporting Brooklyn women, led by the crackling Jane Lynch as Momma Brice, as a proto-feminist support system, an idea that Mayer and choreographer Ellenore Scott (tap is choreographed by Ayodele Casel, showcasing Grimes’ top-drawer skills) carry over into the protective dance numbers executed by a generous ensemble.\n\nAs strange as it may sound, the orchestra plays a similar role. Musical director Michael Rafter hits an intense pace and volume from the rise of the baton, as if everyone in the pit wanted to carry along Feldstein as if she were bouncing happily on a wave of thrilling Styne sound.\n\nOf course, the original “Funny Girl” rested on the fictional premise that Streisand was not conventionally beautiful, a coded way of exploring Jewish identity. In fact, Streisand was merely a more intense form of luminescence. In this case, Feldstein’s appearance does demonstrably contrast sharply with the ensemble that surrounds her, which the show uses in deft ways to build up this message of Fanny Brice as an everywoman, a proxy for everyone who was ever told they didn’t look right to get the gig or the guy. The title has been repurposed, or amplified.\n\nThat said, the show didn’t make clear decisions about to what to do with the sexual subtext, partly because it wants to downplay the dated, sexist narrative of Nick’s sensual affections unlocking Fanny’s talents. In this version, he’s just a loser, or a guy on his way to being a loser. Whatever Fanny needed, this revival is saying, she had the whole time. No Nick needed. No Eddie. It makes parts of Act Two a bit redundant, but you see the timely logic of the choice.\n\nFeldstein can only do so much as a Broadway star with what she has to offer at this point. Everyone will be able to see that; opinions will vary as to how much it matters.",
  "isFullReview": true,
  "textWordCount": 842,
  "archivePath": "data/archives/reviews/funny-girl-2022/nydailynews--chris-jones_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:42:27.707Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230525055245",
  "archiveOrgUrl": "http://web.archive.org/web/20230525055245/https://www.nydailynews.com/entertainment/broadway/ny-broadway-funny-girl-review-beanie-feldstein-20220425-pydgl7irlzdffdncsr2yiz5n7q-story.html",
  "contentTier": "complete",
  "wordCount": 842,
  "tierReason": "Full review text"
}