{
  "showId": "funny-girl-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2022/04/24/funny-girl-fanny-is-funny-but-funny-is-flat/",
  "publishDate": "2022-04-24T21:53:52",
  "fullText": "In bringing back Funny Girl, Beanie Feldstein and director Michael Mayer seem admirably determined to make us forget both Barbra Streisand and the 1968 film of her 1964 Broadway hit. (Streisand turns 80 today on opening night, as it happens, which may not be the surest way to put her out of mind.)\n\nGranted, Feldstein is a less than stellar singer. She’s a careful singer, which is to say, a dutifully trained one who’s straining not to flub, hoping we’ll tolerate the lack of brio needed to sell the likes of “People” and “The Music That Makes Me Dance.” Well, Fanny Brice, the now-largely-forgotten subject of this musical bio, was no belter either. When she took on a ballad she got by with sincerity, and when Feldstein taps into the emotion of Jule Styne’s melodies and Bob Merrill’s lyrics, she does just fine.\n\nTaking their cue from the real Fanny as well as the title, Feldstein and Mayer lean into their subject’s long suit, her comedy skill. They push Brice’s mugging, self-deprecating ad libs, and Yiddische inflections further than Streisand ever did. And since Feldstein is a gifted comedian (as we learned from the movie Booksmart), much of the humor lands. She unabashedly makes use of her plus size, while ignoring that her punim is hardly as crooked as dialogue and lyrics suggest. Just as a Cyrano needs no nose to prompt his inner torment—thank you, Peter Dinklage and James McAvoy—I daresay a Fanny Brice can use anything at her disposal to underline her outsider status, as she famously puts it, “a bagel on a plate of onion rolls.”\n\nFeldstein wrings some new twists on the big Ziegfeld number in act one, “His Love Makes Me Beautiful.” She still puts the pregnancy pillow under the wedding gown, but tosses in some more gags that add to the fun. Later, in “Rat-a-Tat-Tat” (not used in the movie, so it’s fresh), her gleeful stereotyping of “Private Schvartz from Rockavay” may push the boundaries of 2022 taste criteria, but is exactly in tune with the pre-Depression theatrical era, and shows us, for that moment, exactly why Brice was such a beloved, successful attraction.\n\nBut that’s pretty much all to be said for the production, which goes all-in on a Ziegfeld Follies episodic quality and rhythm that, however diverting, shortchanges its story.\n\nIsobel Lennart’s original libretto was always derivative and thin, but at least it possesses a coherent central premise. Confident on stage, Fanny offstage is so insecure as to be instantly dazzled by her first “ruffled shirt,” gambler Nick Arnstein (Ramin Karimloo, who has no trouble dazzling anyone, in or out of shirt). Inadvertently she smothers the guy, such that he elects to turn to crime in order to forge his own stake in life. He gets caught, goes to prison, and finally turns his back on the prison that is her love. Bloodied but unbowed, she survives. Essentially it’s a knockoff of Lennart’s Ruth Etting biopic Love Me or Leave Me, with Nicky doing both the loving and the leaving. But as a spine on which to hang the numbers and set pieces, it’s serviceable enough.\n\nUnsatisfied with mere serviceability, fans have long dreamed of someone’s “fixing” the book. But Harvey Fierstein’s revision, tinkering with lines in Act One and including somewhat heavier alterations in Act Two, doesn’t amount to a fix. Indeed, the through-line gets ever more lost in Mayer’s attempt to throw everything at the audience in a louder-faster-funnier cavalcade, out of the evident hope we’ll be constantly diverted and not notice there’s precious little going on.\n\nDavid Zinn’s set is dominated by a giant brick cylinder—a turret, really, with non-practical windows; you’d not be surprised to see Rapunzel’s hair fall from it. It sits menacingly and distractingly stage center, periodically opening to reveal this scene or that dance but with no visual connection to the rest of the stage space. Ellenore Scott’s choreography is exuberant, lit within an inch of its life by Kevin Adams, who makes sure we don’t miss a seam of Susan Hilferty’s eye-popping (and, to my eye, period-respectful) costumes. But it’s all in-your-face, lacking variety and nuance. Along the way, interest in the central character and her story dries up. Minor characters have to keep reminding us what Fanny and Nick are doing, or how much time has elapsed.\n\nThe principals are ill-served by songs and scenes framed like vaudeville turns. Karimloo and Feldstein are light on romantic chemistry anyway, and shoving slapstick into “You Are Woman, I Am Man” further diminishes it. (Performers’ bios often operate on the tedious assumption that stars behave offstage exactly as they behave on.) A jazzy interpolated number out of the Styne-Merrill trunk, “Temporary Arrangement,” has Nick and some chorus boys dancing out his frustrations, redundantly and not credibly. Jane Lynch (Mama Brice) and her poker playing cronies, played by Toni DiBuono and Debra Cardona, have been directed to blast their punch lines face front, grinning the while, so droll quips (whether Lennart’s or Fierstein’s) don’t get the laughs they deserve.\n\nJared Grimes is in a particularly unhappy situation as Eddie Ryan, Fanny’s early mentor. The effort to expand his role amounts to one scene in which, in less than two minutes, he proposes dating Fanny, she shoots him down, and they decide to remain Just Friends. Grimes’ tap prowess is shown off in a couple of marvelous turns (tap choreography credited to Ayodele Casel), evoking the spirit of the great John W. Bubbles, a Brice contemporary. This Eddie should be a Ziegfeld headliner too, but he just goes back to being Fanny’s sounding board and exposition provider, sneering periodically at Nick in a lame attempt at character conflict. If anyone was out to “fix” Funny Girl, they might have started with Eddie.\n\nBut at all comes down to Fanny Brice, who deserves better, just as the audience deserves to know her better. She was one strong lady, as all stars must be, not a wilting cutie-poo. From the outset she’s built up as a hopeful who’s already paid a lot of dues, in stock and amateur contests. Yet no sooner does she get through telling us she thinks she’s “The Greatest Star,” than she stumbles into her debut at Tom Keeney’s (Martin Moran) crummy Brooklyn burlesque house with paralyzing stage fright. It’s a witless cliché, and a counterproductive one. If Fanny sailed onto those boards with total confidence in selling “Cornet Man,” we might start to believe she’s the unique talent who could impress a Ziegfeld (Peter Francis James). And thereafter we might buy that she’ll let nothing stand in her way, and that she’s the sort of iron lady capable of berating her husband for missing her opening night. Feldstein fights “the cutes” throughout her performance, but she can’t do it alone.\n\nThis doesn’t seem the work of the Michael Mayer who so carefully shaped every cast member and moment into a seamless Spring Awakening ensemble. It rather reflects the Mayer of the 2011 On a Clear Day You Can See Forever revival, another problematic mid-’60s musical whose hoped-for redemption was undone by a cluttered staging, and a production idea insufficiently thought through.\n\nFunny Girl opened April 24, 2022, at the August Wilson Theatre. Tickets and information: funnygirlonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
