{
  "showId": "funny-girl-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2022/04/24/funny-girl-beanie-feldstein-easy-peasy-proves-shes-a-funny-girl/",
  "publishDate": "2022-04-24T21:54:07",
  "fullText": "Paging all musical comedy fans. Have I got news for you! It turns out that after all the running off at the mouth about the much-publicized Funny Girl revival, Barbra Streisand isn’t the only one who can shake up a Broadway auditorium playing Fanny Brice. Beanie Feldstein also has the abundant charisma and the chutzpah.\n\nBut because comparisons are thought odious, I’ll avoid them. And not because I didn’t see Streisand nail the role. I did—more than once, including one performance where she walked through the part, as she was often reputed to do. Moreover, I even listened to Brice herself as radio’s Baby Snooks.\n\nSo, for the length of this review, I’m plunking down in Feldstein’s corner. She strides on stage with full confidence to sit at a dressing table where Brice is about to reflect on her life. In no time flat, she’s back in Brooklyn as the young Great White Way wannabe. She‘s already convinced her name should be in lights, and in a tearing hurry it is—in the Ziegfeld Follies, no less.\n\nFeldstein remains in tight control—director Michael Mayer certainly helps greatly—as Brice is romanced by Nick Arnstein (Ramin Karimloo) and spends the rest of the several years this tuner covers (approximately 1910-1921) raising daughter Francis Arnstein and dealing with the on-again-mostly-off-again luck her businessman-gambler hubby faces.\n\nA large spoonful of a talent, Feldstein just about has under her belt (pun on singing style intended) the comedy, the drama, and, most important, the Jule Styne-Bob Merrill score conducted by Michael Rafter. She’s mastered the slick Ellenore Scott choreography whenever it kicks up its heels. Yes, she just about does have it all in hand. As the run extends, she’s certain to eliminate the “just about” part.\n\nIf she’s now using her appealing raisin-pudding face to up the ante on Fanny’s 36 expressions, she’ll likely tame the occasional mugging and return to the 36 looks lyricist Merrill assigns her. She already has down pat Brice’s frustration with and anxiety about Nick.\n\nNo question Feldstein has the voice. She nails “I’m the Greatest Star” as well as “Don’t Rain on My Parade” (two versions of the same emotional fortitude). There’s also fragility to her vocals, which she handles slyly. For this revisal (Harvey Fierstein fidgeting with the original Isobel Lennart script), she brings touching emotion to the interpolated “You’re a Funny Girl,” which Styne and Merrill added to the Funny Girl flick. Her version of “People”—keeping in mind that comparisons are odious—is admirably touching.\n\nAs the focus on any Funny Girl return will be Fanny’s impersonator, it’s also necessary to stress that Mayer’s production is strong in all its toplined players. Karimloo has no trouble looking the woman-wooer and wow-er. With just the right tincture of playboy sleaze, he sings accordingly. He and Feldstein guarantee that “You Are Woman, I Am Man” is the laff riot it’s intended to be. Karimloo is also handed “Temporary Arrangement,” a ditty cut from the original production, which has the unfortunate look of a temporary arrangement.\n\nJane Lynch as Fanny’s supportive mother Rose pulls off her turns with completely winning efficiency—as do her poker-playing yente pals Mrs. Strakosh (Toni Dibuono) and Mrs. Meeker (Debra Cardona). Never mind that the tall, lean Lynch and the short, plump Feldstein don’t exacttly resemble a likely mother-daughter combo. As Brice’s tap-dancing pal Eddie Ryan, Jared Grimes uses his fleet feet to steal more than one scene. Peter Francis James is suave and flinty as Ziegfeld.\n\nMusical partisans know well that there’s a high craft level easily attained when Broadway experts go to work. No exception here. Along with Susan Hilferty’s fab period costumes come Kevin Adams’ frequently proscenium-clinging traveling lights, Brian Ronan’s immaculate sound, and the Campbell Young Associates wigs.\n\nIt may be that due to the lack of depth at the August Wilson Theatre stage, set designer David Zinn doesn’t have the opportunity to meet the grandiosity Florenz Ziegfeld always promised. Nevertheless, he does much, much more than his level best.\n\nThere’s no shame in Funny Girl not attaining full classic musical-comedy status. Original producer Ray Stark mounted it as a vehicle in honor of his wife’s famous mother. His wife? Francis Arnstein Stark. So, In light of entertainment value offered—and despite a second-act drama dip—it’s an acceptable version of most musical bios. (Remember: The trouble caused by a gambling playboy was established in Show Boat, in which innocent Magnolia Hawks meets, marries, and becomes estranged from gambler Gaylord Ravenal.)\n\nDuring the Funny Girl first act, there’s an unfortunate lapse. The extravaganza “His Love Makes Me Beautiful” is introduced as a ballad by a tenor (Daniel Beeman), but it’s really the set-up for a sight gag. Fair enough that director Mayer and choreographer Scott want to build on the fun, but the resulting ensemble routine is bumpily flat.\n\nThe Act Two “Rat-Tat-Tat-Tat dance, which Styne and Merrill surely saw as a World War I response, is OK and gives Feldstein another opportunity to cavort with comic flair. (Incidentally, Brice was in the 1910 and 1911 Follies and not again until 1921.)\n\nOkay, though Funny Girl has its share of soft spots, not to say torn spots, it can boast about its new star, if not yet superstar. Throughout the two acts music is often heard as underscoring. Prominently recurring is the twice repeated four-note Nicky Arnstein motif: “Nicky Arnstein, Nicky Arnstein.”  As of this revival, those notes might have exiting customers happily thinking “Beanie Feldstein, Beanie Feldstein.”\n\nFunny Girl opened April 24, 2022, at the August Wilson Theatre. Tickets and information: funnygirlonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
