{
  "showId": "the-cherry-orchard-2016",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2016/10/theater-review-the-cherry-orchard.html",
  "publishDate": "October 17, 2016",
  "fullText": "Things you buy through our links may earn New York a commission.\n\nPhoto: Joan Marcus\n \n \n \n Part of what keeps great plays great, age after age, is that they have so much in them: so much psychology, amusement, conflict, philosophy, politics, emotion, and linguistic pleasure. What keeps them alive is a related phenomenon: No amount of unpacking ever unpacks them. The greater they are the more they outstrip the ability of any one production to demonstrate that greatness; they are always tantalizing, rarely definitive. That has certainly been the case with The Cherry Orchard, Chekhov’s final play, from 1904, which in terms of dramatic technique — keeping all those balls, and 12 major characters, in the air at once — is not only a masterpiece but a paragon and a trap. It feels so complete and fully imagined in précis that you’d think it would just walk itself onstage and say Here I am. But as the ambitious and tentative Roundabout revival that opens tonight demonstrates, its vastness can just as well leave the drama seeming staticky and intermittent, a weak signal from a brilliant, distant source.\n\nNo one, of course, sets out to under-serve Chekhov. The problem, even with serious interpretive artists at the helm, is that all hands must be seeking to serve in the same way. Here that does not appear to be the case. The adaptation, by Stephen Karam, author of The Humans and other terrific plays, is clean and mostly neutral, with an occasional bit of contemporary vernacular deliberately jarring the ear. (One character says “Get out!” where fustier translations offer something like “Think of that!”) I say deliberately because the staging by Simon Godwin, an associate director at London’s National Theatre now making his New York debut, also underlines the modernity of Chekhov’s themes, even if it does so more academically and importunately. The play is performed, for instance, on an awkward platform (designed by Scott Pask) that resembles a cross-sectional stump of a cherry tree; a spinney of Calder-like mobiles suspended in midair suggests the canopy of blossoms. Michael Krass’s costumes, of period design in Act I, look almost flappery in Act II and are contemporary by Act IV. Also contemporary is the music by Nico Muhly, even when presented diegetically as the accompaniment to the masked dance in Act III.\n\nNothing wrong with any of these choices individually — and Muhly’s music, especially, is lovely. Together, though, these reminders of modernity are not only pushy but a distraction from the crucial social context of the story, in which a family of faded Russian aristocracy loses its estate due to little more than fecklessness. Diane Lane, as the forlorn landowner Ranevskaya, looks gorgeous in her formfitting maroon knit dress in Act IV, but a woman who can dress that way is living a different life than Ranevskaya’s. The changing relationship of the serving class to the gentry is similarly garbled. I’m all for colorblind casting, but Godwin’s choice to have many of the servants and poorer characters played by black actors is not so much colorblind as confusingly symbolic. When, in one of the play’s trademark ironies, the Ranevskys’ orchard is sold at auction to a man whose father and grandfather were serfs on the estate, the fact that it’s Harold Perrineau, a black actor, exulting over the “twist of fate” is undoubtedly powerful, yet this suggests a comparison that doesn’t actually scan. Likewise, in bucolic Act II, where Chekhov has a drunken tramp declaim from old Russian poetry as he crosses the property, Karam and Godwin instead have him utter a few lines of “something from across the ocean”: Emma Lazarus’s “The New Colossus.” (“Give me your tired, your poor … ”) This is startling theatrically but suggests a kind of sentimentality that Chekhov went out of his way to undercut. He called The Cherry Orchard a comedy.\n\nAnd so, among many other things, it is. But just because a play is great enough to contain contrasting ideas doesn’t mean it’s made of Velcro. You can’t just throw anything at it and have it stick. That includes performance styles; the large Roundabout cast often does well enough giving sharp physical life to individual characters: Joel Grey’s ancient servant, Firs, muttering and tottering; Susannah Flood’s dizzy, self-conscious delicacy as the maid Dunyasha; Tina Benko’s eccentric chaperone, Charlotta, with her sideways gait as if shuffling off to Buffalo. But, lacking a coherent group style, the ensemble nature of the play feels ragged, as if drastically under-rehearsed. (The Moscow Art Theatre premiere, directed by Stanislavsky, rehearsed for months, and still Chekhov hated it.) The actors, who also include Tavi Gevinson, John Glover, Kyle Beltran, Chuck Cooper, and Celia Keenan-Bolger, are in twelve different vaudevilles instead of one basically naturalistic play. The result feels more like an engaging gloss of The Cherry Orchard than the thing itself.\n\nOften enough, Chekhov comes through anyway. There is no missing his portrait of the wasting of the idle class, nor its source in the curse of slaveholding, conceived as a kind of moral hemophilia. Though some set pieces (the party scene, the magic tricks) work only fitfully, others, such as the fizzle of a long awaited marriage proposal, still pack their fully tragic punch. No one gets off the hook here, not even the poor, who either aspire to the same wasteful lives they observe among the rich or are deluded (Chekhov seems to believe) about the possibility of radical change in human nature. Finally that’s what’s most modern about The Cherry Orchard, and why a production need not waste so much time modernizing it: that happiness and unhappiness are shown to feed on each other, forever insatiably. Chekhov was, after all, a diagnostician. As he has the play’s most foolish character say wisely at one point: “When a lot of remedies are suggested for a disease, that means it cannot be cured.”\n\nThe Cherry Orchard is at the American Airlines Theatre through December 4.\n\n+Comments\n \n \n Leave a Comment\n \n\n Theater Review: The Cherry Orchard\n\n \n\n \n \n\n Things you buy through our links may earn New York a commission.\n\nEditor’s Picks\n \n \n \n \n \n \n \n \n just asking questions\n \n What Could a Chinese Spy Balloon Over the U.S. Do, Exactly?\n What Could a Chinese Spy Balloon Over the U.S. Do, Exactly?\n \n \n \n \n \n \n \n \n \n \n spring fashion\n \n The Woman Who Became McQueen\n The Woman Who Became McQueen\n \n \n \n \n \n \n \n \n \n \n problem solving\n \n The New Rules\n The New Rules\n \n \n \n \n \n\n \n\n \n \n \n \n Most Popular\n \n\n \n \n \n \n Ashton Kutcher on Danny Masterson’s Trial: ‘Ultimately, I Can’t Know’\n \n \n \n \n \n \n What the Great Netflix Password Crackdown Means for You\n \n \n \n \n \n \n The Worst Snubs in Rock and Roll Hall of Fame History (So Far)\n \n \n \n \n \n \n The 6 Best New Movies and TV Shows to Watch This Weekend\n \n \n \n \n \n \n Melinda Dillon, A Christmas Story’s Mom, Dead at 83\n \n \n \n \n\n \n \n \n \n What the Great Netflix Password Crackdown Means for You\n \n \n \n \n \n \n The Worst Snubs in Rock and Roll Hall of Fame History (So Far)\n \n \n \n \n \n \n Ashton Kutcher on Danny Masterson’s Trial: ‘Ultimately, I Can’t Know’\n \n \n \n \n \n \n The Documentary World’s Identity Crisis\n \n \n \n \n \n \n The 6 Best New Movies and TV Shows to Watch This Weekend\n \n \n \n \n\n \n\n \n Sign In to Comment\n \n \n\n \n \n \n\n \n \n\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n\n \n \n Email\n \n \n\n \n \n You\\'ll receive the next newsletter in your inbox.\n \n \n *Sorry, there was a problem signing you up.\n\nThis site is protected by reCAPTCHA and the Google\n Privacy Policy and\n Terms of Service apply.",
  "isFullReview": true,
  "dtliExcerpt": "This Cherry Orchard, directed by Simon Godwin, is beautifully acted and intelligently conceived, but it's also oddly muted — as if the famous last sound of the play, the distant thwack of an ax against wood, had already fallen.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This Cherry Orchard, directed by Simon Godwin, is beautifully acted and intelligently conceived, but it's also oddly muted — as if the famous last sound of the play, the distant thwack of an ax against wood, had already fallen.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "duplicateOf": "vulture--unknown.json",
  "playbillVerdictUrl": "http://www.vulture.com/2016/10/theater-review-the-cherry-orchard.html",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "textWordCount": 1204,
  "archivePath": "data/archives/reviews/the-cherry-orchard-2016/vulture--jesse-green_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:31:39.217Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230204092057",
  "archiveOrgUrl": "http://web.archive.org/web/20230204092057/https://www.vulture.com/2016/10/theater-review-the-cherry-orchard.html",
  "duplicateTextOf": "vulture--unknown.json",
  "wordCount": 1204,
  "tierReason": "Full review text"
}