{
  "showId": "gary-a-sequel-to-titus-andronicus-2019",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Joe Dziemianowicz",
  "url": "http://nypost.com/2019/04/21/gary-review-nathan-lanes-titus-sequel-is-a-stinker/",
  "playbillVerdictUrl": "http://nypost.com/2019/04/21/gary-review-nathan-lanes-titus-sequel-is-a-stinker/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Nathan Lane in \"Gary: A Sequel to Titus Andronicus.\" \n Julieta Cervantes \n \n \n \n \n \n \n It’s got fart gags galore, but “Gary” isn’t a gas — it’s more like hot air.\n\nSubtitled “A Sequel to Titus Andronicus,” the labored comedy that opened Sunday night picks up where Shakespeare’s gory tragedy of murder, rape, mutilation and cannibalism leaves off. Along the way, it lets three of the funniest actors in the business — Nathan Lane, Kristine Nielsen and Julie White — twist in the wind.\n\nPlaywright Taylor Mac, a downtown favorite with a refreshingly unique perspective, begins with a rock-solid idea that soon crumbles: After terrible leaders leave carnage in their wakes, the ones left to deal with the mess — and the body parts — are the little people.\n\nTwo such nobodies, based on cameo-size characters from the Bard’s play, are Gary, a street clown who’s just been promoted to cleanup duty, and Janice, a weary maid who’s learned to keep her head down. Both have been charged to clean the gilded banquet room in time for the inauguration of the new emperor, but they’ll need more than Windex: The hall is a bloody mess, stacked floor to ceiling with (playfully stylized) corpses, whose guts and bowels must be suctioned out.\n\nOut come the flatulence jokes — and Gary’s quip about “not living your best life.”\n\nMany messy bits later, the two are joined by Carol, a midwife who’s consumed by guilt for not doing more to save a newborn from murder. Conscience-stricken, the three survivors decide to fight tragedy with art: They devise a spectacle that features a kickline of male corpses whose private parts wag in unison. Top that, Rockettes! If only it were as hilarious as it wants to be.\n\nDirector George C. Wolfe cranks the cast’s volume to 11. Perhaps he suspects that if the lines, rhymed and otherwise, are loud enough, the audience won’t notice the actors aren’t saying much. We notice. We also realize that the movement and music credited, respectively, to Bill Irwin and Danny Elfman are nearly undetectable.\n\nAll three stars get credit for taking on an out-there challenge, even if they resort to their go-to tricks: Lane bellows as Gary, Nielsen doubles down on her signature double takes as Janice and White works her trusty frantic and plaintive reflexes as Carol. They’re sometimes funny, but not enough.\n\nIt’s been said that comedy is tragedy plus time. “Gary,” a comedy, alas, is just tragic.",
  "isFullReview": true,
  "textWordCount": 408,
  "archivePath": "data/archives/reviews/gary-a-sequel-to-titus-andronicus-2019/nypost--joe-dziemianowicz_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:36:46.959Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250818111249",
  "archiveOrgUrl": "http://web.archive.org/web/20250818111249/https://nypost.com/2019/04/21/gary-review-nathan-lanes-titus-sequel-is-a-stinker/",
  "contentTier": "complete",
  "wordCount": 408,
  "tierReason": "Full review text"
}