{
  "showId": "gary-a-sequel-to-titus-andronicus-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2019/04/21/gary-a-sequel-to-titus-andronicus-cleaning-up-and-moving-on-after-disaster/",
  "publishDate": "2019-04-21T19:49:16",
  "fullText": "Things have gone terribly wrong in this country, but at least we don’t have ballrooms full of corpses (yet).\n\nThat’s more than you can say for the ancient Rome inhabited by Gary, Janice, and Carol, the players in Taylor Mac’s Gary: A Sequel to Titus Andronicus, which opened tonight at the Booth Theatre in all its bloody, flatulent, funny, and unexpectedly optimistic splendor.\n\nTitus Andronicus is Shakespeare’s most gruesome, and perhaps oddest, tragedy. A Roman tale of revenge, betrayal, rape, dismemberment, and infanticidal, Sweeney-style cannibalism-by-pie, it includes no fewer than 14 deaths, all of them grisly. Mac’s sequel picks up after Shakespeare final, gruesome banquet, and it focuses on three bit players from the Bard’s play, a clown promoted to maid, a maid, and a midwife. It’s their job to get things back in order.\n\nThe show opens with Carol, the midwife, popping out through the act curtain and addressing the audience. She’s sets up this sequel, a thing that, she says, “hides inside an ending.” She’s also prodigiously spouting blood and played by the inimitable Julie White, so we have a pretty good idea that what we’re in for will be both viscera-soaked and quite funny. Then Gary, walks on with a mop, a bucket, and a Restoration-comedy tower of hair. Yes, this will be funny.\n\nThen, with great fanfare, the curtain rises. On more bodies than you can imagine. In a play featuring three comic dynamos—Kristine Nielsen rounds out the cast as Janice, an old hand at Roman housekeeping—and a script by the quicksilver Mr. Mac, Santo Loquasto’s scenic design might be the standout performer. It is outrageous, disgusting, opulent, and hilarious. In the wake of the murderous rampage, there are dead Romans everywhere, and, we’re told by Nielsen’s Janice, she has moved them for storage and processing into a ballroom. (“Ya think this is my first massacre,” she asks Gary, dismissively. “Ya think I sat around idle on the Ides of March?)\n\nLoquasto has built puppet corpses, what look like burlap sacks shaped like humans. They’re dressed in togas, codpieces, various Roman garb. Their penises are all quite noticeably visible, flopping to and fro. They’re blood-stained, and they’re stacked to the ceiling of the grand ballroom that surrounds them. There’s a Rube Goldberg apparatus above them, a covered area to the side where the women and children are stored more discreetly, and a gurney with various medieval-looking apparatus for processing the bodies. It’s both shocking and delightful.\n\nIn front of that heap (and occasionally atop it), Gary and Janice go about their business. Gary comes from a line of clowns, but he’s seized the opportunity to become a maid as a chance to move up in the world. Janice is resigned to her station in life, and wants to do it well. Gary’s real goal is to become a fool, to use his comedy not just to entertain but to speak truths to power. He gets increasingly caught up in that idea, and decides he wants to stage what he calls a Fooling, which will be an artistic coup, if not a military one. (“I just invented a genre,” he proclaims. “You’re welcome.”)\n\nMac’s script is hilarious, and director George C. Wolfe has assembled for his cast three of the stage’s great comic performers. Lane is in his daffily insiprational mode, and the gifted Nielsen is a mugging, bug-eyed worker bee, channeling Marty Feldman. White is, as ever, droll and deadpan.\n\nBut there’s profundity hidden inside this high comedy. Gary’s performance, his insistence that it’s the only way to move forward, is ultimately the serious point of this very funny show: That the only way to survive horrors is to turn them into art, that comedy must come from tragedy. A few weeks ago, The New York Times Magazine profiled Mac, and he explained that the play is very much a response to a series of tragedies, including the election and his mother’s death. “We are living in a revenge tragedy that’s trying to be a comedy that isn’t succeeding,” he told his interlocutor.\n\nIn Gary, his characters succeed. Gary pulls off his Fooling. White’s midwife, Carol, who appears halfway through Gary’s machinations, still alive among the mound of bodies, finds and saves the baby that she believes she’d left to die back in the original play. (Why had she done that? It’s complicated.) Life goes on. One hopes that’s as true offstage as on.\n\nGary, A Sequel to Titus Andronicus, opened April 21, 2019, at the Booth Theatre and runs through June 16. Tickets and information: garyonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
