{
  "showId": "gutenberg",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "https://newyorktheater.me/2023/10/12/gutenberg-the-musical-broadway-review/",
  "playbillVerdictUrl": "https://newyorktheater.me/2023/10/12/gutenberg-the-musical-broadway-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "“Gutenberg! The Musical!” is deliberately bad – that’s the central joke of it – but much of what’s bad about it isn’t deliberate. The score is largely unmemorable. The premise makes little sense. There are some funny lines, but no more than an hour’s worth of laughs in a two-person vaudeville routine that goes on for two hours, becoming tedious. There is also one joke that is almost shockingl y unfunny. Written many years ago for a comedy club by Anthony King and Scott Brown, the duo who went on to adapt “Beetlejuice” for the stage, ”Gutenberg” has made it to Broadway for an obvious reason: It enables the marketing coup of reuniting Josh Gad and Andrew Rannells twelve years after their star-making turns as a mismatched pair of naive Mormon missionaries in the original Broadway cast of “The Book of Mormon.” In “Gutenberg! the Musical!” they portray Bud and Doug, childhood friends from Nutley, N.J. whom we are meant to see as lovable losers. The two have written a (bad) musical about the inventor of the printing press, Johan Gutenberg. They are performing the show as an audition for potential backers, in the hopes of taking the show to Broadway. What they’ve written features a large cast of characters, but they are supposedly too broke to hire actors, so instead they spent three days at the local FedEx Kinkos printing up dozens of hats with labels for each character. The characters don’t have names, only descriptions, like Monk, Drunk # 1, Drunk # 2, Daughter, Rats – except for Gutenberg himself, and his love interest, Helvetica (which is funny because it’s a font.). Bud and Doug don the various hats to perform the many roles, singing their songs accompanied by “New Jersey’s premier wedding band, The Middlesex Six” – although they can only afford to hire half of them. A problem with the premise, of course, is that the show actually is on Broadway, with a Tony-level creative and design team and a budget that could clearly afford to hire the other three members of the Middlesex Six. They get around this inconvenient truth by having Bud and Doug explain that they have scraped together all their money (including a sudden inheritance from an uncle who died hangliding) to rent the Broadway theater for a single night, inviting Broadway producers to attend. Johan Gutenberg does not strike me as an inherently ludicrous subject for a work of theater. His invention, after all, affected the course of history. But we’re meant to understand that Bud and Doug’s ambitions are greater than their intelligence or talent, and their show about this historical figure is not just inaccurate, but dopey: Gutenberg is a wine presser in the town of Schlimmer, where everybody is illiterate, causing many problems, such as when a child dies because his parents thought the jar labeled jelly beans contained medicine. The villain of the story is a monk, who a la Dr. No (or, more likely, Dr. Evil) strokes a vicious cat he’s named Satan, and doesn’t want the townsfolk to learn to read because he wants to be the only one who can say what’s in the Bible… Let me stop here, because the show signals in numerous ways how much the (totally fictitious) plot of “Gutenberg” is besides the point, in much the way that the supposed plot in “The Play That Goes Wrong” doesn’t matter at all. It’s just an excuse for gags – although the physical comedy in “Gutenberg” is child’s play compared to the meticulously engineered mayhem of the “Goes Wrong” British franchise. Bud and Doug introduce each scene of “Gutenberg” with an exaggerated flourish that’s meant to be comically amateurish. They also take breaks to go “off-script,” reminiscing about their friendship, sharing their hopes and dreams. Indeed, the most memorable song follows an anecdote that Doug tells about how his mother wanted him to be a doctor, but he told her he wanted to follow his dreams. “That’s not a job, Doug” his mother replied. “You gotta put food on the table and you can’t eat dreams!” So, Bud and Doug sing “We eat dreams” and lead the audience in the choral response “we eat them too.” Some of the one-liners do land. I especially liked the series of hilariously spot-on definitions (e.g. “A metaphor is when you say one thing, and mean something else, but you’re not lying.” and “A motif is when you use the same music over and over again, but it’s not lazy.”) There is also a pile-up of knowing jokes/semi-commentary about the theater that any theatergoer will get. Their previous efforts at musicals, for example, were “Stephen King! The Musical,” a prequel to “Phantom of the Opera” explaining how he got the boat down there, and a third “achingly autobiographical” — none of which went anywhere: “If your new musical isn’t already a movie or a book or a fairy tale told from the lady’s point-of-view, people will not sell their cars to see it.” But one insider shtick gave me pause: Doug: Every important musical has to tackle at least one incredibly serious issue.Bud: Like racismDoug: HomophobiaBud: Or a man with half a faceDoug: Our show is set in Germany. So our serious issue is antisemitism.Bud: History tells us that Germans do not like Jews. Doug: Not all Germans. Most of them. Bud: And these days it seems like it’s not just Germans. Doug: That hatred is in this show.Bud: It has to be.Doug: Because it makes our show important. A recurring character in the show is then a flower girl who at one point sings: I’ve got daffodils and some roses too But you can’t have one because you’re a Jew And, later, more simply: “I hate Jews.” If “Gutenberg! The Musical!” were written with any nuance, we might be able to see this tone deaf (and poorly timed) riff on antisemitism as a pointed glimpse into Bud and Doug’s limitations. But the show with the two exclamation points in the title is meant only to make you laugh, and so the limitation has to be attributed to the duo who actually created it, Anthony King and Scott Brown, childhood friends from Durham, North Carolina — not Nutley, New Jersey, where their stand-ins live. Putting down New Jersey is a standard stand-up comic’s go-to motif, but it’s lazy. Gutenberg the MusicalJames Earl Jones Theater through January 28, 2024Running time: Two hours and 15 minutes including an intermission.Tickets: $58-$318Book, music and lyrics by Anthony King and Scott BrownDirected by Alex TimbersScenic Design by Scott Pask; Costume Design by Emily Rebholz; Lighting Design by Jeff Croiter; Sound Design by M.L. Dogg and Cody Spencer; Hair Design by Tommy Kurzman;Cast: Josh Gad as Bud, Andrew Rannells as Doug Merrily and Gutenberg open on Broadway. Sondheim’s Here We Are extends. #Stageworthy News of the WeekOctober 16, 2023In \"New York Theater Weekly Summary\" Poll: Best Broadway* Cast Recording of 2024?December 5, 2024In \"album\" Broadway Week 2024: 2 for 1 Tickets.January 10, 2024In \"Broadway\"",
  "isFullReview": true,
  "textWordCount": 1173,
  "archivePath": "data/archives/reviews/gutenberg/nyt-theater--jonathan-mandell_2026-02-01.html",
  "textFetchedAt": "2026-02-01T18:23:39.455Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}