{
  "showId": "all-the-way-2014",
  "outletId": "nbcnews",
  "outlet": "NBC",
  "criticName": "Unknown",
  "url": "http://www.nbcnewyork.com/entertainment/the-scene/cranston-alltheway-review-248571221.html%20%20",
  "playbillVerdictUrl": "http://www.nbcnewyork.com/entertainment/the-scene/cranston-alltheway-review-248571221.html%20%20",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "“Breaking Bad” star Bryan Cranston gives Lyndon B. Johnson the Broadway treatment in the new show “All the Way”, which just opened at the Neil Simon Theatre. It’s a safe bet crowds descending on the Neil Simon Theatre for “All the Way” aren’t there because of an abiding curiosity about Lyndon Baines Johnson. They’re coming to see the Broadway debut of Bryan Cranston, who until months ago was Walter White, teacher-turned-druglord on AMC’s “Breaking Bad.” Written by Robert Schenkkan, the playwright and sometimes-actor who won a Pulitzer for “The Kentucky Cycle,” the historical bio about the nation’s 36th president just opened after a sold-out run at the American Repertory Theater outside Boston. With a title harkening back to the campaign slogan for his 1964 presidential run, “All the Way” tracks LBJ’s first term in office, from the earliest minutes of his accidental presidency to a hard-won landslide election one year later. In between, for three sometimes-tedious hours, we get a history lesson about the maneuvering required to enact the Civil Rights Act of 1964. The play opens with the president on board Air Force One flying back to Washington from Dallas just after JFK’s assassination. It’s no small thrill seeing Cranston in the oversized chief executive’s chair, a chintzy blue airplane blanket seeming somehow insufficient for the lap of an actor, not to say a leader, of stature. What follows is the nitty gritty of politicking, a view of congressmen on the business end of “The Johnson treatment.” There was a way things were going to be in this new Great Society, and the message was delivered by an imposing man with a fierce personality. With Cranston in the Oval Office, even that old standby villain J. Edgar Hoover (a smarmy Michael McKean) is no match for LBJ’s cajoling. “All the Way” replays the battles of the Freedom Summer, many neatly drawn between North and South or black and white. But there’s so much procedural material rehashed in the cluttered drama it can feel as if you were being smacked upside the head with a Robert Caro volume. (Caro, the Johnson biographer, declined a request from Cranston to meet as he prepared the role, the actor has said.) Cranston carves a unique portrait of the towering 6-foot-3 Texan—the actor wears 2-inch lifts to achieve a similar height—employing a thrust jaw and flailing hands to convey the leader’s mannerisms. Pants belted halfway up his waist, Cranston may look like Walter White ca. “Breaking Bad” Season 1, but the paranoia, conniving and cunning are decidedly late-stage Heisenberg. Take one exchange with Hubert Humphrey (Robert Petkoff), in which the political duo are discussing the Mississippi Freedom Democrats, who are abandoning the president: “I’m so bad? Then join Barry’s little Nazi party!” Johnson insists, referencing his opponent, Barry Goldwater. “Just a little respect. Love. Is that too much to ask for?” You can practically hear Walter White arguing that he’s doing it all for family. It’s enormous fun to watch Cranston wobbling between arrogance and self-loathing. On the supporting side, so many actors do double or triple duty that it’s easy to lose track. Among them, Petkoff’s loyal and gradually disillusioned Humphrey stands out, as does Brandon J. Dirden’s underplayed Martin Luther King Jr. Betsy Aidem’s Lady Bird is relegated to the background and depicted as self-effacing and loyal. Director Bill Rauch, of the Oregon Shakespeare Festival (where Schenkkan’s “All the Way” sequel, “The Great Society,” will premiere this summer) energizes the material when he can, often with unexpected juxtapositions. Searchers dig for the body of a Neshoba County, Miss., civil rights worker, even as Robert McNamara (James Eckhouse, from “Beverly Hills 90210”) delicately informs his boss about an attack on U.S. forces in North Vietnam. “All the Way” probably isn’t a play that would make it to Broadway without an enormous draw as the lead—the real threat to LBJ’s campaign here is the proselytizing. It’s a story for diehard politicos, students of the civil rights movement or those who enjoy the social capital of saying they’ve seen one of the top TV actors of our generation in a drama that lets him flex serious muscle. “All the Way,” through June 29 at the Neil Simon Theatre, 250 W. 52nd St. Tickets: $52-$142. Call 800-745-3000, or visit Ticketmaster.com. Follow Robert Kahn on Twitter@RobertKahn Sign up to receive breaking news alerts in your inbox.",
  "isFullReview": true,
  "textWordCount": 729,
  "archivePath": "data/archives/reviews/all-the-way-2014/nbcnews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:04:05.718Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 729,
  "tierReason": "Full review text"
}