{
  "showId": "all-the-way-2014",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/all-the-way-review-bryan-cranston-a-fascinating-lyndon-b-johnson-1.7295856",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/all-the-way-review-bryan-cranston-a-fascinating-lyndon-b-johnson-1.7295856",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Please log back in to enjoy your subscription. Thank you for being part of the Newsday family.\n\nForgot your password? We can help go here.\n\nBryan Cranston in \"All the Way,\" a new Broadway production surrounding President Lyndon B. Johnson, after an assassin’s bullet catapults him into the presidency. Credit: Evgenia Eliseeva\n\nTwenty-four actors portray many historical characters in \"All the Way,\" but let's not pretend. There really is only one who matters in Robert Schenkkan's ambitious and didactic three-hour drama about 11 months in the presidency of Lyndon Baines Johnson.\n\nAnd that one, Bryan Cranston, matters a lot.\n\nThere is something courageous and very smart about the three-time Emmy winner's decision to make his Broadway debut in a big ensemble vehicle so far away from Walter White, beloved and complex meth cooker in \"Breaking Bad.\" And yet, for all the villains and heroes and sprawling ideals in the play, which began at the Oregon Shakespeare Festival without Cranston, this feels like a fascinating one-man show in a high school history pamphlet.\n\nIn 1992, Schenkkan won the Pulitzer Prize but little Broadway love with \"The Kentucky Cycle,\" an engrossing six-hour saga about 200 years in the history of a piece of land. He is thinking no smaller in this extremely detailed, yet oddly simple-minded, story about presidential horse-trading with Congress to pass the 1964 Civil Rights Act before his election.\n\nJohnson, who became our 36th president after the Kennedy assassination, is a larger-than-life character who, at least in Cranston's nonstop performance, lets us watch the decision-making processes of a self-dramatizing show-boater who clearly gets a charge out of backroom politics and himself.\n\nPhysically, this is not a natural match. To indicate Johnson's hulking six-feet four, Cranston stoops as if he were a tall man and hollows out his chest in a way that suggests he could also play a good Nixon. He sits with his legs very wide apart, leans back on his spine and talks Texas folksy and shrewd about his fellow \"Am-urkins\" and how he's \"gonna out-Roooosevelt Roooosevelt\" with his war on poverty.\n\nDirector Bill Rauch moves all the different people with the famous long-ago names briskly on a tidy set with congressional benches and scene-establishing projections. The other characters -- including Michael McKean's J. Edgar Hoover and Brandon J. Dirden's Martin Luther King Jr. -- are meant to be more realistic yet feel more flat. Schenkkan also tosses out just the first names of people that modern audiences may not remember and turns Hubert Humphrey into a stooge.\n\nThrough it all, Cranston's LBJ feels a bit like a caricature, but one that's compelling and fun to watch. And every time the president made a big point at a recent preview, the audience clapped as if the actor were a tenor singing a high C. We suspect the unflashy Walter White would not have approved.\n\nWHERE Neil Simon Theatre, 250 W. 52nd St.\n\nINFO $66.75-$151.75; 877-250- 2929; allthewaybroadway.com.\n\nBOTTOM LINE Fascinating Cranston, didactic drama.\n\nLI 'Bachelorette' contestant remains on show\n \n \n \n \n \n \n \n \n \n LI's starring role in Nicole Kidman-Hugh Grant HBO series\n \n \n \n \n \n \n \n \n \n 'Rebecca': Netflix's version is flat, superficial\n \n \n \n \n \n \n \n \n \n E! programming to celebrate Kim Kardashian birthday\n \n \n \n \n \n \n \n \n \n 'The West Wing' cast reunites again, this time for a book\n \n \n \n \n \n \n \n \n \n 'Conners,' 'black-ish' return with pandemic-themed episodes\n \n \n \n \n Didn’t find what you were looking for?\n Try our new Search",
  "isFullReview": true,
  "textWordCount": 552,
  "archivePath": "data/archives/reviews/all-the-way-2014/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:05:17.410Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20201021225749",
  "archiveOrgUrl": "http://web.archive.org/web/20201021225749/https://www.newsday.com/entertainment/theater/all-the-way-review-bryan-cranston-a-fascinating-lyndon-b-johnson-1.7295856",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 552,
  "tierReason": "Full review text"
}