{
  "showId": "all-the-way-2014",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Unknown",
  "url": "http://www.thewrap.com/all-the-way-theater-review-bryan-cranston-lbj-broadway",
  "playbillVerdictUrl": "http://www.thewrap.com/all-the-way-theater-review-bryan-cranston-lbj-broadway",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "Robert Schenkkan‘s new play, “All the Way,” offers much more in the way of soap opera than even “August: Osage County,” which clocked in only a few minutes longer on Broadway.\n\nThere’s a homosexual scandal (Walter Jenkins), a philandering civil-rights leader (Martin Luther King Jr.), infighting among the minorities (NAACP and SNCC), a racist upstart challenger (George Wallace), the beginnings of a secret war (Vietnam) and, in place of that drugged-out matriarch Violet Weston, there’s a deeply flawed, vulgar, funny and great president (Lyndon Baines Johnson). There’s also Bryan Cranston, who’s on stage for many of the 170 minutes of “All the Way,” which opened Thursday at the Neil Simon Theatre after a run in Cambridge, Mass., last fall.\n\nCranston doesn’t look or act much like the real LBJ (at least the one most of us saw on TV), and that’s one of the more intriguing aspects of Bill Rauch’s direction. Except for a dead-on Lady Bird Johnson (Betsy Aidem) and George Wallace (Rob Campbell), the cast avoids the Madame Tussauds approach to acting that has taken over biopics (and rarely fails to win actors their Oscars).\n\nSee video: New ‘Godzilla’ Trailer: Bryan Cranston is Scared Sh–less, and So Are We\n\nRauch keeps the focus on telling a complicated story as nimbly as possible, dispensing with the extreme makeup and mannerisms that would only get in the way as Brandon J. Dirden’s MLK, Christopher Gurr’s Strom Thurmond, Richard Poe’s Everett Dirksen, William Jackson Harper’s Stokely Carmichael, Robert Petkoff’s Hubert Humphrey, Michael McKean‘s J. Edgar Hoover and Cranston’s LBJ do battle with each other in 1964.\n\nIn fact, the laconic McKean bears a closer resemblance to the late president than the wily, high-strung Cranston. And that’s what Cranston delivers big time: a wily, high-strung and very comic LBJ, as if Rip Torn had returned to deliver his measly thug from “Sweet Bird of Youth” with a bit of Walter Brennan thrown in to sweeten the humor.\n\nSince much of what Cranston says is delivered directly to the audience, it sometimes appears as if he’s auditioning to be a stand-up comic. And because he often scores, the play’s huge helping of politics goes down as easily as gravy over pork chops.\n\nCranston doesn’t miss a laugh and he milks more than a few. His LBJ describes politics as war when he tries to deliver civil-rights legislation on the eve of his election (and loses the South to the Republicans in the process). Strangely enough, in the first act of “All the Way,” it is McKean’s Hoover who plays hardball with minimal effort when he prevents his premature retirement by hinting at the president’s sexual and business indiscretions.\n\nThere’s nothing minimal about LBJ’s efforts, or Cranston’s, in the second act when he tries to prevent the South’s delegates from walking out en masse at the Democratic Convention. Surprisingly, the first real presidential bite that draws blood is when LBJ attacks Lady Bird. Then Humphrey, Hoover and Jenkins (a nicely understated Christopher Liam Moore), his loyal assistant who gets caught making it in a locker room with some ex-army man.\n\nAlso read: Anthony Hopkins to Bryan Cranston: ‘Breaking Bad’ Performance Was ‘the Best Acting I Have Seen — Ever’\n\nIn essence, “All the Way” is the CliffsNotes version of Robert A. Caro. It’s just one play, after all, not multiple books. Schenkkan keeps his story moving, rarely lets it get bogged down in exposition and juggles multiple stories with a craftsman’s finesse. He stoops a bit at the end when he tries to build suspense about the outcome of the Johnson/Goldwater race, hammering us with poll numbers from the South — as if the 1964 election were ever in doubt.\n\nSchenkkan obviously admires LBJ’s accomplishment with civil rights. Perhaps he admires him too much.\n\nHis LBJ tells us that Goldwater will get down in the gutter with his campaign. In fact, it was the real LBJ who built the trench that led to that new, deeper gutter. If Schenkkan wanted to show us what politics as war really looks like, he would have included LBJ’s notorious daisy/mushroom cloud ad against Goldwater in “All the Way.”\n\nThat piece of TV character assassination paved the way for all the Willie Horton and Swift Boat atrocities that have poisoned American politics ever since. It was the work not of a warrior but a real killer.",
  "isFullReview": true,
  "textWordCount": 728,
  "archivePath": "data/archives/reviews/all-the-way-2014/thewrap--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:07:45.878Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 383 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20200304102809",
  "archiveOrgUrl": "http://web.archive.org/web/20200304102809/https://www.thewrap.com/all-the-way-theater-review-bryan-cranston-lbj-broadway/",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 728,
  "tierReason": "Full review text",
  "bwwExcerpt": "Cranston doesn't look or act much like the real LBJ (at least the one most of us saw on TV), and that's one of the more intriguing aspects of Bill Rauch's direction. Except for a dead-on Lady Bird Johnson (Betsy Aidem) and George Wallace (Rob Campbell), the cast avoids the Madame Tussauds approach to acting that has taken over biopics (and rarely fails to win actors their Oscars). Rauch keeps the focus on telling a complicated story as nimbly as possible, dispensing with the extreme makeup and mannerisms that would only get in the way as Brandon J. Dirden's MLK, Christopher Gurr's Strom Thurmond, Richard Poe's Everett Dirksen, William Jackson Harper's Stokely Carmichael, Robert Petkoff's Hubert Humphrey, Michael McKean's J. Edgar Hoover and Cranston's LBJ do battle with each other in 1964.",
  "bwwScore": 8
}
