{
  "showId": "carousel-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2018/04/12/carousel-rodgers-hammerstein-jessie-mueller-renee-fleming-sommers/",
  "publishDate": "2018-04-12T19:00:41",
  "fullText": "Being immersed in the theater for most of my life, I forget that not everybody is familiar with the bittersweet joys of Carousel, one among the several enduring musicals created by Richard Rodgers and Oscar Hammerstein II. During a preview performance of the latest Broadway revival of Carousel, which opened tonight, widespread murmurs of surprise erupted amid the audience in reaction to unexpected turns in the plot for this poignant romance between a carnival barker and a factory girl.\n\nSubsequent sounds of sniffles and rustling tissues at the Imperial Theatre were not so astonishing. Ever since its premiere 73 years ago, Carousel has remained a true-blue tearjerker in the most honorable sense of the term. The artful simplicity of Hammerstein’s heartfelt text and the lyrical loveliness of Rodgers’ music for Carousel rarely fail to tap into wellsprings of emotion. It is a supreme example of Broadway musical storytelling from its Golden Age.\n\nBringing great works back to Broadway is never easy. Even the finest vintage musicals can be damaged by directorial misguidance, as witnessed by such sad occasions as the revivals of Porgy and Bess in 2012 and Guys and Dolls in 2009. Then again, old-timers will recall how Nicholas Hytner’s striking production of Carousel for Lincoln Center Theater back in 1994 discovered fresh wonders within the musical (as well as launched Audra McDonald as a rising star).\n\nThe latest rendition of Carousel is scarcely so revelatory. It is smudged visually. Yet, as briskly staged by veteran director Jack O’Brien, this production for the greater part proves satisfying. It is beautifully sung, exuberantly danced and ardently performed.\n\nAs far as the work itself is concerned, O’Brien has wisely trimmed a few sludgy passages out of the script and excised “Geraniums in the Winder” and “There’s Nothin’ So Bad for a Woman,” two minor numbers from the clambake sequence that nobody is likely to miss and which tightens up the show’s long second act. The trickiest part of the musical, which gave Rodgers and Hammerstein problems during the show’s out-of-town tryout, relates to the later scenes when Billy, the protagonist, arrives in the afterlife.\n\nO’Brien and Justin Peck, the choreographer, provide the audience with a taste of these mystical doings during the first seconds of the show’s musical prelude: Suppliants kneeling in prayer materialize in front of a giant bulls-eye moon. This brief vision then dissolves into the traditional opening scene as a carnival and merry-go-round burst forth into festive swing as Billy encounters Julie, the mill worker who soon becomes his wife. Thereafter, as the story set in late 19th-century New England proceeds, fatal decisions that Billy will make are silently observed by a gentleman dressed in a white suit, who eventually is revealed in the scenes “up there” as the Starkeeper who guides Billy towards redemption.\n\nGiving the audience hints of what’s to come is a smart touch, although “up there,” with its swirling white fog, smattering of stars, and denizens clad in sackcloth-and-glitter shmatas, looks none too appealing. Designed by the eminent Santo Loquasto, whose artistry serves O’Brien’s concepts, the show’s settings are frankly theatrical, with two-dimensional trees, transportable rock outcroppings, and flat seascapes ornamented by toy sailboats. Unnaturally illuminated by Brian MacDevitt, maybe such artificial environs are meant to suggest the illusory nature of our world, but whatever they are, they sure ain’t pretty. Casting aside those nasty angel’s garments, the nice period clothes otherwise designed by Ann Roth help to brighten the surroundings.\n\nWhile the visuals are dubious, this Carousel sounds terrific, with fresh, windswept orchestrations crafted by Jonathan Tunick and an assembly of fine voices to sing classic numbers such as “You’ll Never Walk Alone” and “June is Bustin’ Out All Over.” The ensemble vigorously swirls through the frequently circular rotations of Peck’s jaunty choreography that naturally flows through the production.\n\nThe leading actors provide confident, well-sung performances. A sturdy Joshua Henry brings to his imposing Billy a resonant baritone voice and expressive acting skills that culminate in his splendid delivery of the challenging “Soliloquy” as Billy ponders future fatherhood. Sincere and steadfast as Julie, a loving soul who understands Billy better than he does himself, Jessie Mueller offers a quietly touching “What’s the Use of Wond’rin?” Their odd chemistry as a couple reveals how Billy is absorbed almost entirely with himself and how the selfless Julie accepts it simply as the way he happens to be.\n\nDelightful is the only way to describe Lindsay Mendez’s high-spirited depiction of Carrie, Julie’s closest chum, who weds a self-assured sardine magnate-in-the-making capably played and handsomely sung by Alexander Gemignani. Their voices intertwine charmingly on the cozy “When the Children Are Asleep,” which perfectly offers the sort of homely interlude that Hammerstein used to say always made him cry.\n\nRenée Fleming’s cheerful musicality as Nettie Fowler, Margaret Colin’s acrid presence as the carousel owner, and a kindly John Douglas Thompson as the well-dressed Starkeeper, contribute other pleasures to the heavenly stage magic conjured up by Rodgers & Hammerstein at their matchless finest.\n\nHow wonderful it must be for anyone to take a spin on Carousel for the very first time.\n\nCarousel opened April 15, 2018, at Imperial Theatre and runs through September 16. Tickets and information: carouselbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-roundup"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "The latest rendition of Carousel is scarcely so revelatory. It is smudged visually. Yet, as briskly staged by veteran director Jack O'Brien, this production for the greater part proves satisfying. It is beautifully sung, exuberantly danced and ardently performed.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Critics-Weigh-In-on-CAROUSEL-on-Broadway-Starring-Jessie-Mueller-and-Joshua-Henry-20180412"
}
