{
  "showId": "bronx-bombers-2014",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "http://www.ew.com/ew/article/0,,20784296,00.html",
  "playbillVerdictUrl": "http://www.ew.com/ew/article/0,,20784296,00.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "Bronx Bombers’ Broadway premiere has one thing going for it: great timing. While New York Yankee fans count down the days to the start of spring training (pitchers and catchers report to Tampa in eight days) and opening day (just 60 days until the home opener against the Baltimore Orioles!), the Yankee faithful can spend two hours in midtown Manhattan reminiscing about the club’s storied history for about the price of a single-game field-level seat. Peanuts and Cracker Jack sold separately. But just about any CenterStage, Yankees on Deck, or Yankees Magazine show on New York’s local YES Network provides more insight and drama into the 27-time World Series champion team than Bronx Bombers  and for a lot less dough.\n\nThis marks the third sports-themed work from producers Fran Kirmser and Tony Ponturo and playwright Eric Simonson. In 2010, with Lombardi, they tackled longtime Green Bay Packers coach and Super Bowl trophy namesake Vince Lombardi (in association with the National Football League). In 2012, they switched to basketball and the friendship between Magic Johnson and Larry Bird in Magic/Bird (the NBA was above the title there).\n\nNow, Major League Baseball is on board for this contrived drama that bounces between decades, at one point bringing the likes of Mickey Mantle (Bill Dawes), Joe DiMaggio (Chris Henry Coffey), and Lou Gehrig (John Wernke) to a dinner table with Derek Jeter (Christopher Jackson) and Elston Howard (Francois Battiste). The hosts are lovable, backward-aphorism-spouting Yogi Berra (Peter Scolari, so authentically hunched over that one hopes he has a chiropractor in his contract) and his wife, Carmen (Tracy Shayne), who’s there because Yogi presumably can’t be trusted to bake a potato by himself. ''The Yankees are in trouble!'' laments Yogi moments before Babe Ruth (C.J. Wilson) appears to him in a vision.\n\nThe ''trouble'' is the subject of the entire first act: fallout from a June 17, 1977, in-game brawl between hot-headed manager Billy Martin (a too-young Keith Nobbs) and superstar right-fielder Reggie Jackson (Battiste)  a rabble-rouser who dubbed himself ''the straw that stirs the drink.'' Berra is troubled, worried that Martin will get fired. But why is MVP-catcher Thurman Munson (Dawes, rockin' a '70s-tastic mustache) in on the meeting? And why do we mysteriously jump to the final game at the old Yankee Stadium by the end of the show? The whole thing feels longer than a Yankees-Red Sox game.\n\nOver his three Broadway plays, Simonson’s efforts become more diluted and the stories more far-fetched. Lombardi focused on one man; Magic/Bird took on two. Here, he’s dealing with a whole franchise. (What’s next  a hockey play that puts the entire NHL on ice?) Worse, the manufactured plot doesn’t even begin to approach believability: Forget the fact the second act imagines Yankees past and present at a mashed-potato banquet together. You can’t tell me that the irreproachably polite Derek Jeter doesn’t remove his baseball cap if he’s at Yogi Berra’s dining room table.\n\nIn his defense, Simonson doesn’t have a heck of a lot to work with. There’s no footage or photos  no visual backstory that could fill in the blanks for viewers who aren’t completely steeped in 90-plus years of Yankee history. MLB should be able to supply more than a few pinstriped uniforms with the interlocking NY logo. Not that a few video clips would turn Bronx Bombers into a hit. It’s just a bomb  and not the kind that made Babe Ruth famous. D\n\n(Tickets: Telecharge.com or 212-239-6200)",
  "isFullReview": true,
  "textWordCount": 582,
  "archivePath": "data/archives/reviews/bronx-bombers-2014/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:29:16.391Z",
  "originalScore": "D",
  "originalScoreNormalized": 35,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140317010426",
  "archiveOrgUrl": "http://web.archive.org/web/20140317010426/http://www.ew.com/ew/article/0,,20784296,00.html",
  "contentTier": "complete",
  "wordCount": 582,
  "tierReason": "Full review text",
  "bwwExcerpt": "Over his three Broadway plays, Simonson's efforts become more diluted and the stories more far-fetched. Lombardi focused on one man; Magic/Bird took on two. Here, he's dealing with a whole franchise. (What's next - a hockey play that puts the entire NHL on ice?) Worse, the manufactured plot doesn't even begin to approach believability... In his defense, Simonson doesn't have a heck of a lot to work with. There's no footage or photos - no visual backstory that could fill in the blanks for viewers who aren't completely steeped in 90-plus years of Yankee history. MLB should be able to supply more than a few pinstriped uniforms with the interlocking NY logo. Not that a few video clips would turn Bronx Bombers into a hit. It's just a bomb - and not the kind that made Babe Ruth famous. D",
  "bwwScore": 4
}
