{
  "showId": "bronx-bombers-2014",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "http://www.hollywoodreporter.com/review/bronx-bombers-theater-review-677901",
  "publishDate": null,
  "fullText": "Issue 2 REP Bronx Bombers - P 2014\n\nThat an unknown actor playing the late baseball great Mickey Mantle scores cheers merely by striding onstage gives a good clue about the target audience of Eric Simonson's new play celebrating the Yankees. The third in a series of sports-themed Broadway productions that are as much promotional as dramatic—the Yankees and Major League Baseball are among the presenters–Bronx Bombers offers little for those who are not already ardent fans of the venerable sports franchise.\n\nThe play's forgettable first half largely concerns a 1977 hotel room meeting engineered by the team's then coach Yogi Berra (Peter Scolari) to arrange a truce between the feuding Reggie Jackson (Francois Battiste) and coach Billy Martin (Keith Nobbs). Also present to help broker peace is the team's beloved captain Thurman Munson (Bill Dawes), who would be killed in a plane crash two years later. With the mild humor mostly revolving around the colorful personalities of the participants and such minor episodes as Jackson's insisting on ordering a huge assortment of fruit from room service, the lengthy scene mainly serves as a preamble for the meatier Act 2.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Lifestyle\n \n \n \n \n\n \n \n \n \n 'Moulin Rouge' to End Broadway Run in July \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Business\n \n \n \n \n\n \n \n \n \n Broadway Box Office: 'Mamma Mia!' Bids Farewell With $1.8 Million Final Tally\n\nThat, at least, displays some imagination with its fantasy of an elaborate dinner party hosted by Berra and his loving wife Carmen (Tracy Shayne, Scolari's real-life spouse) attended by a procession of Yankee greats past and present. Such pin-striped legends as Mantle (Dawes), Lou Gehrig (John Wernke), Elston Howard (Battiste), Joe DiMaggio (Chris Henry Coffey) and Derek Jeter (Christopher Jackson) dutifully make appearances, each displaying their trademark traits.\n\nMantle is hard-drinking and gregarious: Howard, the team's first African-American player, is soft-spoken and dignified; Gehrig is courtly and old-fashioned, dramatically showing signs of the fatal disease that would bear his name; Ruth, wearing a fur coat, is loud and boisterous, eating and drinking with abandon; DiMaggio, the only one to wear a sharply tailored suit instead of his uniform, is reserved and stuffy; and Jeter is dutifully detrimental to the legends who have preceded him.\n\nAside from a few minor disputes between these players of different eras, nothing particularly dramatic takes place here either. But playwright/director Simonson has written some funny lines, such as when Gehrig, overhearing a conversation, confusedly asks, \"World War II?\" and Ruth bemusedly saying to Elston that \"you must be with the black Yankees.\"\n\nNot surprisingly, far too much predictable humor is mined from Berra's trademark \"Yogi-isms,\" whether actual or made-up. \"I may be nostalgic but I don't like to live in the past,\" he comments at one point, while later saying of his home, \"It's a big house but all it's got in it are rooms.\"\n\nSimonson's staging includes some impressive touches, as the cloud of stage fog and bursts of deafening thunder heralding Ruth's appearances. And scenic designer Beowulf Boritt has nicely transformed the theater into a replica of the famous old Yankee Stadium.\n\nThe effective cast of last year's original off-Broadway production is largely intact, with the exception of Scolari, who's touching and funny as the ever-awkward Berra. And the moving final scene, set in the Yankees locker room on the day of the final game at the original stadium, will surely strike a chord with nostalgists. But Bronx Bombers is ultimately too lightweight to score a theatrical home run.\n\nVenue: Circle in the Square, New York (runs indefinitely)\n\nCast: Peter Scolari, Francoise Battiste, Chris Henry Coffey, Bill Dawes, Christopher Jackson, Keith Nobbs, Tracy Shayne, John Wernke, C. J. Wilson\n\nPlaywright-director: Eric Simonson\n\nCostume designer: David C. Woolard\n\nMusic and sound designer: Lindsay Jones\n\nPresented by Fran Kirmser, Tony Ponturo, Quinvita and Primary Stages in association with The New York Yankees and Major League Baseball Properties",
  "isFullReview": true,
  "bwwExcerpt": "The third in a series of sports-themed Broadway productions that are as much promotional as dramatic-the Yankees and Major League Baseball are among the presenters--Bronx Bombers offers little for those who are not already ardent fans of the venerable sports franchise...The effective cast of last ye...",
  "bwwRoundupUrl": null,
  "bwwThumb": null,
  "showScoreExcerpt": null,
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "playbill-verdict"
  ],
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/bronx-bombers-theater-review-677901",
  "duplicateOf": "hollywood-reporter--unknown.json",
  "textWordCount": 636,
  "archivePath": "data/archives/reviews/bronx-bombers-2014/hollywood-reporter--david-rooney_2026-02-07.html",
  "textFetchedAt": "2026-02-07T12:14:20.714Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "wordCount": 636,
  "tierReason": "Full review text",
  "duplicateTextOf": "hollywood-reporter--unknown.json"
}