{
  "showId": "bronx-bombers-2014",
  "outletId": "new-york-1",
  "outlet": "New York 1",
  "criticName": "Unknown",
  "url": "http://www.ny1.com/content/lifestyles/theater_reviews/203218/ny1-theater-review---bronx-bombers-",
  "playbillVerdictUrl": "http://www.ny1.com/content/lifestyles/theater_reviews/203218/ny1-theater-review---bronx-bombers-",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Time Warner Cable video customers:Sign in with your TWC ID to access our video clips.\n\nWatch our news channel live stream\n\nTo view our videos, you need to\n enable JavaScript. Learn how.\n install Adobe Flash 9 or above. Install now.\n \n \n Then come back here and refresh the page.\n\nThe New York Yankees take centerstage on Broadway in a new play called \"Bronx Bombers.\" NY1's Roma Torre filed the following review.\n\nIt's obviously about the Yankees, but that's no reason for non-fans of the team to sit this one out. No, there are other reasons to do that. It's just not a very good play.\n\nIt's populated by a who's who of Yankee greats past and present, and at the center of it all is the inimitable Yogi Berra. The famed Yankees catcher is a natural for stage depiction with his trademark yogi-isms and stooped gait. And Peter Scolari's wonderful portrayal is a home run.\n\nBut Eric Simonson's play is a disjointed work divided into four disparate scenes. The first scene, the only one that qualifies as drama, features a notorious episode in Yankee history. In 1977, manager Billy Martin and slugger Reggie Jackson had it out in a Fenway Park dugout, and it was all caught on camera. As the scene unfolds, Yogi Berra, then the coach, tries to diffuse tensions by inviting Martin and Jackson to a hotel room along with team captain Thurman Munson to hash it out.\n\nScene two introduces Yogi's enthusiastic wife, Carmen, but little happens.\n\nAfter intermission, fans will have a field day with scene three, a dream sequence detailing a dinner hosted by the Berras with guests Lou Gehrig, Joe DiMaggio, Elston Howard, Mickey Mantle, Derek Jeter and, of course, The Babe himself. Despite an attempt to humanize them all, they might as well have halos circling their heads.\n\nScene four takes place on the final game of the hallowed Yankee Stadium.\n\nPerformances are quite good. In dual roles, Francois Battiste playing Reggie Jackson and Elston Howard, and Bill Dawes as Thurman Munson and Mickey Mantle, are standouts, but it's those iconic pinstripes that steal the show.\n\n\"Bronx Bombers\" is a work that defies dramatic critique. It's red meat for hardcore fans, and as a sentimental tribute, it scores. But theatrically speaking, it strikes out.\n\nReproduction in whole or in part without permission is prohibited.\n\n© 1999-2014 Time Warner Cable Enterprises LLC. All Rights Reserved.\n\nWeb design and web development by Tipit.",
  "isFullReview": true,
  "textWordCount": 408,
  "archivePath": "data/archives/reviews/bronx-bombers-2014/new-york-1--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:30:12.853Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "404 - Page not found"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140328180746",
  "archiveOrgUrl": "http://web.archive.org/web/20140328180746/http://www.ny1.com/content/lifestyles/theater_reviews/203218/ny1-theater-review---bronx-bombers-",
  "contentTier": "complete",
  "wordCount": 408,
  "tierReason": "Full review text"
}