{
  "showId": "bronx-bombers-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2014/02/07/theater/bronx-bombers-at-circle-in-the-square.html?_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Strange though it may sound, this pinstriped pantheon sits down to dine together in a dream sequence from 'Bronx Bombers,' an affectionate celebration of Yankee greatness (with a smidgen of Yankee angst) written and directed by Eric Simonson...The drama inherent in clashing egos gives 'Bronx Bombers' some natural juice in the early innings, but the suspense about whether Martin will be axed - and Berra will agree to replace him - more or less gets benched in the play's second act.",
  "bwwScore": 7,
  "contentTier": "needs-rescrape",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-BRONX-BOMBERS-Opens-on-Broadway-Updating-LIVE-20140206",
  "fullText": "https://www.nytimes.com/2014/02/07/theater/bronx-bombers-at-circle-in-the-square.htmlShare full articleAdvertisement\n\nTalk about your fantasy baseball team. Babe Ruth and Lou Gehrig, for starters. Plus Mickey Mantle and Joe DiMaggio. Add the catcher Elston Howard, the first black player on the New York Yankees roster, and throw in the team’s current captain, Derek Jeter.\n\nStrange though it may sound, this pinstriped pantheon sits down to dine together in a dream sequence from “Bronx Bombers,” an affectionate celebration of Yankee greatness (with a smidgen of Yankee angst) written and directed by Eric Simonson. The play, which opened at the Circle in the Square on Thursday night, is the third in Mr. Simonson’s series of rah-rah dramas about famous sports figures to be presented on Broadway, following “Lombardi” and “Magic/Bird,” two similarly workmanlike plays about legendary names from the worlds of football and basketball.\n\nWith both the Yankees and Major League Baseball Properties among its presenters, you can be sure that Mr. Simonson’s play, which pivots on the Yankees’ tumultuous 1977 season and stars Peter Scolari as a harried Yogi Berra, will not throw too many spitballs or even inside fastballs in the direction of the sport. At one point during that dream dinner, someone refers to fears that fans would not return after a certain calamity. The reference is to Sept. 11, not the drug scandal that has tarnished baseball in recent years. (Guess who’s not coming to dinner? Alex Rodriguez.)\n\nThe first scene is set in a Boston hotel room, where Berra is holding a private meeting in an attempt to tamp down the animosities that flared during the previous day’s loss to the Yankees’ longtime rivals, the Red Sox. The manager Billy Martin and the outfielder Reggie Jackson almost came to blows in the dugout after Martin pulled Jackson from a game, believing he hadn’t hustled to a short ball.\n\nBerra has invited the antagonists to air their beefs, and corralled the team captain, Thurman Munson (a cool Bill Dawes), to act as his co-referee. Martin, played with haywire energy by Keith Nobbs, enters in full fume, his anger inflamed by the fear that the Yankees owner, George Steinbrenner, will give him the shove — an outcome that has the volatile Martin breaking down in tears. His devotion to the team is expressed in words that will moisten the eyes of rabid fans: “There’s no better feeling in the world than when I put on the pinstripes.”\n\nBerra spritzes the room with similar sentiments, imploring Jackson to make nice by evoking fabled lineups of the past. “That’s what the Yankees are more than anything else,” Berra says. “A team. Always have been, and you and Billy and Thurman and all the other guys got to find a way to become that team.”\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 479,
  "archivePath": "data/archives/reviews/bronx-bombers-2014/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T15:08:33.192Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250414012101",
  "archiveOrgUrl": "http://web.archive.org/web/20250414012101/https://www.nytimes.com/2014/02/07/theater/bronx-bombers-at-circle-in-the-square.html?_r=0",
  "wordCount": 479,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T15:13:58.187Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text cuts off mid-sentence and ends with a JavaScript error message about retrieving article content, making it impossible to determine the critic's verdict.; openai: The text includes navigation issues and a request to enable JavaScript, indicating it is not a complete review.; gemini: The review text is incomplete and contains an error message indicating that the article content could not be retrieved.",
  "promptVersion": "5.2.0"
}
