{
  "showId": "bloody-bloody-andrew-jackson-2010",
  "outletId": "newyorker",
  "outlet": "The New Yorker",
  "criticName": "Uncredited",
  "url": "http://www.newyorker.com/arts/events/theatre/bloody-bloody-andrew-jackson-jacobs-theatre",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "While today’s lack of historical sensitivity is part of the point here, the dim background illumination of Native Americans at the end is a wan homage to the multitudes killed. This production suggests that it might be best not to think too hard about such things; better to have a blast and revel in the glory of the coolest guy at the party.",
  "bwwScore": 4,
  "contentTier": "truncated",
  "fullText": "This ultra-cheeky ode to the complicated and, yes, bloody Presidency of Andrew Jackson, written and directed by Alex Timbers, with a haunting pop score by Michael Friedman, hasn’t changed much in its transfer to Broadway’s Bernard B. Jacobs Theatre, tricked out in twinkly red lights, chandeliers, and taxidermy. The sophomoric sass factor has been turned up a notch (if that’s possible), new political jokes have been added, and historical falsities have been modified, if not entirely rectified. The persuasive Benjamin Walker plays Jackson as a petulant man-boy suffering from abandonment issues, which drive him to kill, and then lead a populist campaign. A chorus of cheerfully clueless, self-obsessed groupies and nemeses (Emily Young and Ben Steinfeld are standouts) join the wheelchair-bound library-nerd Storyteller (Kristine Nielsen) in bolstering the shrewdly drawn celebrity-watch atmosphere. While today’s lack of historical sensitivity is part of the point here, the dim background illumination of Native Americans at the end is a wan homage to the multitudes killed. This production suggests that it might be best not to think too hard about such things; better to have a blast and revel in the glory of the coolest guy at the party.\n\nDate: \n Previews begin September 20, opens October 13\n\nMore news, politics, culture, business, and technology:\n\nRegistration on or use of this site constitutes acceptance of our User Agreement (Revised January 7, 2009) and Privacy Policy (Revised January 7, 2009). The New Yorker © 2010\n Condé Nast Digital. All rights reserved. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast Digital.",
  "isFullReview": true,
  "textWordCount": 270,
  "archivePath": "data/archives/reviews/bloody-bloody-andrew-jackson-2010/newyorker--uncredited_2026-02-05.html",
  "textFetchedAt": "2026-02-05T01:37:51.193Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20101028054651",
  "archiveOrgUrl": "http://web.archive.org/web/20101028054651/http://www.newyorker.com:80/arts/events/theatre/bloody-bloody-andrew-jackson-jacobs-theatre",
  "textIssues": [
    "Word count too low: 270 (min: 300)"
  ],
  "wordCount": 270,
  "tierReason": "Short text (270 words)"
}