{
  "showId": "bloody-bloody-andrew-jackson-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2010/legit/reviews/bloody-bloody-andrew-jackson-1118025501/",
  "publishDate": "October 14, 2010",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "This irreverent biomusical about America's seventh president is a sugar rush of anachronistic attitude and infectious energy that should connect with younger theatergoers seeking something fresh.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This irreverent biomusical about America's seventh president is a sugar rush of anachronistic attitude and infectious energy that should connect with younger theatergoers seeking something fresh.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 389,
  "archivePath": "data/archives/reviews/bloody-bloody-andrew-jackson-2010/variety--david-rooney_2026-02-06.html",
  "textFetchedAt": "2026-02-06T05:08:13.542Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Momentum Pictures has pre-bought U.K. rights to Steve McQueen’s second directorial effort, “Shame,” and Jason Statham starrer “Safe.”\n\nThe acquisition of “Shame,” which launched to buyers last month at the Toronto Film Festival, was in the cards given the first-look deal for Blighty rights the distrib signed in 2008 with Iain Canning and Emile Sherman’s See-Saw Films, which is producing the pic.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Timothée Chalamet Getting American Cinematheque Retrospective \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Timothée Chalamet Makes Oscars History With 'Marty Supreme' as Youngest Man With Three Acting Noms\n\nMomentum, a subsidiary of Canada’s Alliance Films, will distribute helmer-scribe Boaz Yakin’s “Safe” in Blighty, while Alliance takes Canadian rights and sister company Aurum has Spanish rights for the pic.\n\n“Shame,” which reunites McQueen with Michael Fassbender following 2008’s Cannes Camera d’Or winner “Hunger,” is sold internationally by HanWay Films.\n\nLondon- and Sydney-based See-Saw, which most recently produced Toronto and Telluride buzz title “The King’s Speech,” will co-finance the pic with Blighty’s Film4. Story, penned by Abi Morgan, sees Fassbender play a thirtysomething man who is unable to manage his sex life.\n\nA $30 million action pic, “Safe” is the first feature fully financed by sales outfit IM Global.\n\nIt began shooting last week in Pennsylvania and Gotham.\n\nPic, which follows a former elite agent who rescues a kidnapped Chinese girl, is produced through IM Global’s production arm Automatik Entertainment, a joint venture with Alliance Communications. Lawrence Bender Prods. and Trigger Street Prods. will also produce alongside the banner.\n\nFollowing the flurry of activity in Toronto and with AFM less than a month away, Momentum senior acquisitions worldwide exec Robert Walak said the pre-sales market is still alive and kicking.\n\n“I think people are realizing that they need product for the end of 2011 and 2012,” he added.\n\nDistrib has U.K. rights to Hammer Films’ “The Woman in Black,” which is lensing, and is putting financing into IM Global’s Barry Levinson eco-thriller “The Bay” and Eran Creevy’s “Welcome to the Punch.”\n\nBoth pics are produced via the Automatik banner.\n\n“Increasingly we’ve been getting involved at earlier stages,” Walak said. “If you have the right property for the U.K., you can see how quickly product goes. U.K. prices just get driven up, but now we’re also looking at where we can step in and co-finance before festivals in addition to buying for our distribution slate.”"
}