{
  "showId": "company-2006",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "http://www.nydailynews.com/entertainment/theater-arts/found-theater-review-article-1.1973820",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/theater-arts/found-theater-review-article-1.1973820",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": null,
  "isFullReview": false,
  "textWordCount": 235,
  "archivePath": "data/archives/reviews/company-2006/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:23:19.416Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20210513035733",
  "archiveOrgUrl": "http://web.archive.org/web/20210513035733/https://www.nydailynews.com/entertainment/theater-arts/found-theater-review-article-1.1973820",
  "textIssues": [
    "Word count too low: 238 (min: 300)",
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "From left, Daniel Everidge, Barrett Wilbert Weed and Nick Blaemire in ‘Found’ (Kevin Thomas Garcia) New musicals not based on movies are rare. And ones with the originality and infectious exuberance of \"Found\" are even more uncommon.\n\nThe show is based on the Found magazines and books by Davy Rothbart, who saw discarded letters, to-do lists and other scraps of paper littering streets as windows into people's lives. These fragmented, out-of-context messages are cleverly woven into a sweetly compelling musical about discovering one's place in the world.\n\nThe book by Hunter Bell and Lee Overtree, who also directs, traces the rise of Found (an angry note to a suspected cheater sparked it), its attempts to grow into a TV show and fallout from that expansion. Eli Bolin's lively and lovely songs — a moody mix of acoustic-driven ballads and tunes with jazzier edges — keep the action humming. David Korins' evocative set, forged from tossed-away notes, makes an ideal setting.\n\nEveryone in the ensemble gets a shot to stand out — and does. Nick Blaemire anchors the production as Davy with just the right mix of heart and quirkiness. Betsy Morgan and Barrett Wilbert Weed are especially winning as women in Davy's life.\n\nThe show's conceit does get stretched. Sometimes its tight focus slackens and the show becomes like a revue threaded together by a theme. Even so, \"Found\" is a surprising and satisfying find.",
  "contentTier": "needs-rescrape"
}