{
  "showId": "company-2006",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Juan A. Ramirez",
  "url": "https://www.theatrely.com/post/a-hopeless-bachelorette-in-excellent-company-review",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "A miscast Bobbie aside, there is very little to complain about in this excellent production of one of Sondheim's most dynamic works, created at a time when the writer-composer was transitioning from the Golden Age that raised him into the postmodern theatre he helped create. The gender swap is ingeniously, thoughtfully implemented and, after a year in isolation, the story's ruminations on the necessity for aloneness, and the importance of connection hit harder than ever. I'll drink to that.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Stephen-Sondheims-COMPANY-Opens-On-Broadway--See-What-the-Critics-Are-Saying-20211209",
  "contentTier": "complete",
  "fullText": "Katrina Lenk as Bobbie | Photo: Matthew Murphy\n\nThe 50th anniversary production of Company is not golden, as such anniversaries are, but rather an incandescent neon under Marianne Elliott’s ingenious direction. Though, thanks to the pandemic, it actually opens 51 years after the original landmark production. This lush, expensive-looking production arrives on Broadway following an acclaimed West End revival which swapped its perennially single protagonist from Bobby to Bobbie, creating an array of fascinating changes to its gender dynamics.\n\nAs near-perfect as the work is, with beloved music and lyrics by Stephen Sondheim and a sharp book by George Furth, the truth is that there was always somewhat of a nagging question mark around its lead. Famously a plot-less musical, it is rather a meandering thesis on the failures of contemporary, compulsory heterosexuality, centered around an unmarried Manhattanite who spends their 35th birthday observing their “good and crazy people, my married friends” from the untethered comfort of casual dating and keeping busy. (There is a reason gay men have held so tightly to the material). The change is a welcome one, and the pressure to marry is made doubly insistent by an ominous ticking meant to represent Bobbie’s biological clock.\n\nThe unfortunate news is that, though the character of Bobbie might have been resolved, her underwhelming portrayal by Katrina Lenk leaves a major gap in an otherwise practically flawless production. An incredibly capable actor, with a well-deserved Tony for her work in The Band’s Visit, Lenk simply cannot sing the part. On the acting front, her take on the character veers too hard into aloofness, and it’s hard to see why any of her friends and lovers would stick around. There are glimmers of this detachment being the result of birthday nervousness, but they are not fleshed out enough to make them more than quick flashes of introspection. It’s a tough role that demands an unenviable combination of life-of-the-party geniality and escalating existential anxiety—not to mention powerhouse vocals to bring home “Being Alive”—and Lenk’s best efforts are not enough.\n\nThis oversight generously hands the titular role to the rest of the cast, who are uniformly fantastic. Jennifer Simard nearly steals the show as Sarah, portraying her as a tightly-wound human fitness tracker, mistrustful of her and her husband’s ability to stick to the prescribed script of marital bliss. In the production’s second most impactful gender reversal, Matt Doyle’s Jamie knocks the pattering “Getting Married Today” out of the park—a ball of gay anxiety unraveling at the prospect of losing his freedom. Christopher Fitzgerald’s take on the also-reversed “David” as a square frat bro who accidentally hits Bobbie’s vape pen too hard is fabulous, with his signature quirk.\n\nAs Bobbie’s main side pieces, Bobby Conte, Claybourne Elder and Manu Narayan carve great characterizations into “You Could Drive a Person Crazy,” a barbershop trio about their disappointment in their shared lover’s inability to commit. Conte’s “Another Hundred People” is ingeniously staged to become a slick commentary on the meat market of dating apps, with the cast scrambling about, faces lit up by their phones, through Liam Steel’s choreography.\n\nPatti LuPone, the only holdover from the production’s London debut, reliably nails Joanne’s dry wit, though her character is slightly defanged and less present than in most productions. No longer a bitter alcoholic, her “Ladies Who Lunch,” while still a show-stopper, is less a climactic diatribe than a drunken outburst. Though Sondheim updated a few of the show’s lines (to varying success), LuPone’s character puzzlingly still references Ann Miller, and refers to sex as “making it.\n\nBunny Christie’s scenic design sees Manhattan dating not so much as a rat race, but as a rat maze, with Bobbie wiggling through the thresholds and trap doors which connect the moving sets that make up her circle’s individual apartments. Neil Austin’s excellent lighting, heavy on neon, often lights Bobbie’s friends as a spectral chorus of the ghastly possibility of a life murdered by marriage.\n\nA miscast Bobbie aside, there is very little to complain about in this excellent production of one of Sondheim’s most dynamic works, created at a time when the writer-composer was transitioning from the Golden Age that raised him into the postmodern theatre he helped create. The gender swap is ingeniously, thoughtfully implemented and, after a year in isolation, the story’s ruminations on the necessity for aloneness, and the importance of connection hit harder than ever. I’ll drink to that.Company is now in performance at the Bernard B. Jacobs Theatre. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 857,
  "archivePath": "data/archives/reviews/company-2006/theatrely--juan-a--ramirez_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:23:37.493Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251109165139",
  "archiveOrgUrl": "http://web.archive.org/web/20251109165139/https://www.theatrely.com/post/a-hopeless-bachelorette-in-excellent-company-review",
  "wordCount": 857,
  "tierReason": "Full review text"
}