{
  "showId": "company-2006",
  "outletId": "timeout",
  "outlet": "Time Out",
  "criticName": "Unknown",
  "url": "http://www.timeout.com/newyork/theater/found",
  "playbillVerdictUrl": "http://www.timeout.com/newyork/theater/found",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Photograph: Kevin Thomas Garcia\n\nPhotograph: Kevin Thomas Garcia\n\nPhotograph: Kevin Thomas Garcia\n\nPhotograph: Kevin Thomas Garcia\n\nPhotograph: Kevin Thomas Garcia\n\nPhotograph: Kevin Thomas Garcia\n\nPhotograph: Kevin Thomas Garcia\n\nFound. Atlantic Theater Company (Off Broadway). Book by Hunter Bell and Lee Overtree. Music by Eli Bolin. Directed by Overtree. With Nick Blaemire, Barrett Wilbert Weed. Running time: 2hrs 15mins. One intermission.\n\nBroadway dork-stud Nick Blaemire (Godspell) plays a directionless young man whose life is changed by a note he finds on his windshield, in a new musical by Eli Bolin, Lee Overtree and the cuddly Hunter Bell ([title of show]). Overtree directs a cast of ten that also includes Orville Mendoza and downtown cabaret sensation Molly Pope.\n\nFound: Theater review by Adam Feldman\n\nThe endearing new musical Found is literally scrappy: It’s organized around messages found on real-life notes, signs and other misplaced or discarded missives, as collected by Davy Rothbart in a magazine he has published sporadically since 2001. These scribbles offer glimpses into other people’s minds—funny, angry, weird, poignant—and have been organized into a paper trail for the plot of Found to follow. Nick Blaemire, sweet and bouncy as a gum ball, plays a fictionalized version of Davy; Barrett Wilbert Weed (in excellent voice) and Daniel Everidge are the decent-hearted roommates who help him follow his dream, and Betsy Morgan is the producer who tempts him to Hollywood. Six tip-top actors, including Community’s Danny Pudi and the limber Andrew Call, play dozens of side characters and bump up the energy with choreography, by Monica Bill Barnes, that adorably evokes real people dancing.\n\nMore than half of Found’s 28 songs feature lyrics taken straight from the salvaged scrawls and set to eclectic, pop-flavored music by the talented Eli Bolin—imagine a modern Hair with a lot more songs like “Frank Mills”—while the book, by Hunter Bell and director Lee Overtree, offers a follow-your-crooked-smile message that will be familiar to fans of Bell’s similar Broadway metamusical, [title of show]. “I wanna do something that I love and do it with people that I love,” sings Davy, and who could object to that? This, perhaps, is the show’s soft spot: Especially in contrast with the spiky objets trouvés of Davy’s magazine, the dialogue and plot can seem a bit pat, and too eager, especially in the first act, to ensure that the heroes seem nice. More jaggedness around the edges might give added dimension to the many right notes that Found already hits.—Theater review by Adam Feldman\n\nTHE BOTTOM LINE Lost messages help people find themselves in this winsomely quirky musical.",
  "isFullReview": true,
  "textWordCount": 428,
  "archivePath": "data/archives/reviews/company-2006/timeout--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:23:26.830Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20141016162647",
  "archiveOrgUrl": "http://web.archive.org/web/20141016162647/http://www.timeout.com:80/newyork/theater/found",
  "contentTier": "complete",
  "wordCount": 428,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T01:25:35.459Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This is a review of 'Found' at Atlantic Theater Company (Off Broadway), not a Broadway show review; openai: The review is about an Off-Broadway production at the Atlantic Theater Company, not the current Broadway run.; gemini: This is a review of the Off-Broadway production at the Atlantic Theater Company, not a Broadway production.; kimi: The review explicitly identifies the production as playing at Atlantic Theater Company (Off Broadway), not a current Broadway run.",
  "promptVersion": "5.2.0",
  "wrongProduction": true
}
