{
  "showId": "the-new-one-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/11/11/the-new-one-and-papa-makes-three-with-nonstop-laughter/",
  "publishDate": "2018-11-11T21:30:32",
  "fullText": "Mike Birbiglia, an altogether average looking fellow with a brightly sunny face, comes out and talks. And talks and talks and talks, about marriage, cats, couches and—most prominently—the effect on a man of offspring. Or the lack thereof, for as long as he can dodge the issue.\n\nThe fellow just keeps talking, yes; but he grabs us at the beginning and holds our attention and good cheer throughout. Nonstop laughter of the finest kind, which is to say that rather than encountering diminishing returns, the laughs get bigger and warmer. He winds up after 85 minutes, leaving this viewer thoroughly and fully enchanted but wanting more. Much more.\n\nBirbiglia has become prominent as a comedian over the last decade, bringing along a strong fan base. (The New One premiered in New York at the Cherry Lane in July, with the entire run sold out within hours of going on sale.) He is best known for his earlier autobiographical stand-up play, Sleepwalk with Me, which opened off-Broadway in 2008 under the sponsorship of Nathan Lane, of all people. And which was adapted into a non-fiction best-seller in 2010 and became a successful film in 2012.\n\nThat said, the fellow is entirely new to this viewer. He walked on stage and from his first line (“I want to tell you a story but first I wanna tell you about my couch”), delivered in a warm-and-friendly-but-awkward manner, I was a convert. As soon as I finish this fortnight’s playgoing crush, I shall eagerly seek out Sleepwalk with Me.\n\nIn The New One, we find a 40-year-old stand-up comedian who spends most of the year touring. Back home is his wife, a poet named Jen whom he sheepishly admits that he calls “Clo”—which, the way he does it, garners even more laughs. Jen and brother Joe (who is billed as associate producer) try to convince Mike that fatherhood will altogether change his life. Mike wholeheartedly agrees with this, thus vociferously resisting the notion.\n\nBut we know what happens, or else there wouldn’t be a play. Would there? Birbiglia, in the tradition of look-at-me-and-only-me actors, loses the argument—if you will—but wins the war. Oona Birbiglia (b. 2015) slowly but completely wins her father over. And now, as he ends the evening, “I’m seeing the world through baby’s eyes.”\n\nSeth Barrish serves as director, although Birbiglia seems to be directing himself (which, admittedly, is precisely how it should appear). Jennifer Hope Stein, mother of Oona, receives credit for “additional writing.” She can also take credit for making a loving father out of her stubbornly unwilling spouse. (If he thinks fatherhood was a treacherous step, wait until he starts battling through the elementary school application game.)\n\nThe set—a “bare-stage” rendition of the Cort, complete with inner false proscenium pillars which carefully replicate the existing proscenium—is from Beowulf Boritt. The always resourceful designer also sees fit to present us with a bravura coup de théatre which exec. producer Ira Glass (of radio’s This American Life) has personally requested that the critics refrain from discussing. And ruin a spectacular moment for future audiences? Definitely not.\n\nThis week on Broadway, each and every reference to “the new one” no doubt referred to a gargantuan animatronic ape. Now we can wipe that out with Birbiglia’s The New One. Not as big and spectacular as King Kong, needless to say, but gargantuanuously more entertaining.\n\nThe New One opened November 11, 2018, at the Cort Theatre and runs through January 20, 2019. Tickets and information: thenewone.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
