{
  "showId": "the-new-one-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2018/11/11/the-new-one-public-radio-onstage-exactly-as-exciting-as-it-sounds/",
  "publishDate": "2018-11-11T21:29:26",
  "fullText": "“Comedian, storyteller, director, and actor Mike Birbiglia,” says a blurb from the comedian, storyteller, director, and actor on his show’s Playbill.com listing, “tries not to tell people anything about his new show because the less you know about the show the more you will enjoy it.”\n\nIt is my unfortunate duty to burst his bubble and tell you a bit about his new show, which opened tonight at the Cort Theatre. It’s an evening of storytelling about his life, his marriage, and the birth of his first child, a daughter named an Oona. The performance is frequently funny, it contains a few astute observations, and Birbiglia proves himself pleasant company for the time you’ll spend with him. (It’s listed as 80 minutes, but it’s much more than that.) What The New One is not, however, is a play.\n\nLike, not at all.\n\nIt’s a limitation which need not necessarily be an obstacle to the success of something playing in a Broadway theater. Springsteen on Broadway is not a play, really. Stand-ups do Broadway gigs. So do divas, putting on a concert. But all of those, or at least the successful ones, have a reason to be presented in a space typically thought of as a playhouse. In one way or another, they belong onstage. And it’s not at all clear that The New One meets that standard. It’s entertaining, to a certain point, but it’s not dramatic. And, other than one, brief moment—one that its producers have asked reviewing press not to reveal—it’s not in any way theatrical.\n\nIt’s an evening of a storyteller storytelling while schepping a stool around a stage like Elaine Stritch—if Elaine Stritch had never sang or dance or drank.\n\nAlso, if Elaine Stritch wasn’t a pain in the ass. Birbiglia seems like a genuinely nice guy. His manner is flat, a little reserved, wry. He comes across as midwestern, although he’s from Massachusetts. A successful comic, he’s comfortable on stage and with his material. He can control his crowd, riffing comfortably with latecomers, texters, someone in the balcony recording video on her phone.\n\nBut this all serves to make him, well, boring. He does mildly surreal observational comedy — and does it well—while telling a larger story that is entirely banal: He liked his life without kids; his wife wanted to have a kid; they needed some medical help to make it happen; now he has a kid, and he kinda likes it.\n\nBirbiglia is a regular contributor to This American Life, and Ira Glass is listed as The New One’s executive producer. And what this performance is is a The American Life piece: An intelligent observer recounting a common life experience but adding wry commentary.\n\nThis piece would be a pleasant few minutes on the radio. Apparently it was well-received off-Broadway at the Cherry Lane over the summer. Designer Beowulf Boritt has created an elegantly simple set (and provides the single theatrical moment that I’m not supposed to talk about). The director Seth Barrish, a frequent Birbiglia collaborator, does nothing (beyond that stool, and that mum’s-the-word moment) to interfere with the writer and star doing his thing. (Would that he had.)\n\nSometimes the radio belongs on the radio.\n\nThe New One opened November 11, 2018, at the Cort Theatre and runs through January 20, 2019. Tickets and information: thenewone.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial"
}
