{
  "showId": "the-new-one-2018",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2018/11/11/theater/the-new-one-review-mike-birbiglia.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2018/11/11/theater/the-new-one-review-mike-birbiglia.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "Mr. Birbiglia - who came to national attention with the stage and film versions of \"Sleepwalk With Me,\" an autobiographical account of his dangerous nights with a sleep disorder - seems not only to occupy but also to absorb and transmute every inch of the Cort's naked stage. (Appropriately, there's more to Beowulf Boritt's bare set than first meets the eye.) He achieves this partly by pacing, pacing as he talks, in ever-widening circles and diagonals and loop-de-loops.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Do-The-Critics-Think-of-Mike-Birbiglias-THE-NEW-ONE-Updating-Live-20181111",
  "fullText": "https://www.nytimes.com/2018/11/11/theater/the-new-one-review-mike-birbiglia.htmlShare full article8Advertisement\n\nIf Mike Birbiglia were a piece of furniture, he would surely be a well-worn, deeply stained, slightly squishy couch, much like the one he describes at the beginning of “The New One,” his winning Broadway debut at the Cort Theater. That may not sound like a flattering comparison.\n\nBut Mr. Birbiglia has great respect and affection for this kind of sofa, and so should you. As he explains in this one-man show, which opened on Sunday night under the seamless direction of Seth Barrish, a couch is “a deceptively simple piece of technology.”\n\nIt is, to be precise, “a bed that hugs you.” And in delivering that deceptively simple classification, Mr. Birbiglia’s voice becomes a low, wraparound, pleasure-drenched caress.\n\nThis somnolent sound makes you feel both relaxed and attentive, drowsy and giddy. And somehow an expensive night with a lone comedian starts to feel like a better bargain than bingeing and chilling at home.\n\n[Read two Mike Birbiglia essays from The Times.]\n\nIn an age in which starry stand-up is instantly accessible to anyone with a Netflix subscription, dropping big bucks to see a low-key, self-effacing comedian in person might seem like a waste. Such an attitude doesn’t account, though, for the paradoxically lazy energy that Mr. Birbilgia emanates — a seductive force of physics that can be felt only partly when he’s onscreen.\n\nMr. Birbiglia — who came to national attention with the stage and film versions of “Sleepwalk With Me,” an autobiographical account of his dangerous nights with a sleep disorder — seems not only to occupy but also to absorb and transmute every inch of the Cort’s naked stage. (Appropriately, there’s more to Beowulf Boritt’s bare set than first meets the eye.) He achieves this partly by pacing, pacing as he talks, in ever-widening circles and diagonals and loop-de-loops.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 329,
  "archivePath": "data/archives/reviews/the-new-one-2018/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:32:02.389Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250724133634",
  "archiveOrgUrl": "http://web.archive.org/web/20250724133634/https://www.nytimes.com/2018/11/11/theater/the-new-one-review-mike-birbiglia.html",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "needs-rescrape",
  "wordCount": 329,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T05:46:41.688Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The text cuts off mid-review with an error message about retrieving article content and JavaScript settings, making it impossible to determine the critic's final verdict.; openai: The text includes navigation instructions and an error message about retrieving content, indicating it is not a complete review.",
  "promptVersion": "5.2.0"
}
