{
  "showId": "dead-outlaw-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2025/04/27/dead-outlaw-macabre-morbid-and-wickedly-smart/",
  "publishDate": "2025-04-27T21:32:05",
  "fullText": "Dead Outlaw is a Broadway musical for people who don’t like Broadway musicals. A major awards-winning success at the Minetta Lane Theater a year ago, Dead Outlaw has now moved uptown to Broadway. Geographically, anyway: Opening on Sunday at the Longacre Theatre, the musical’s raucous sounds and sardonic sensibilities remain far off the beaten Broadway track.\n\nInventively telling a weird but true only-in-America story, driven hard and fast by a banging rockabilly score, the musical is not intended for the entertainment of kids, teens or adults of a conservative nature. Viewers should take both words in the show’s title literally regarding its topic and the musical treatment of said topic and be prepared to laugh like crazy.\n\nA deceptively gentle C&W-style tune opens the musical, which soon explodes into “Dead,” a catchy and rowdy theme song that reminds the audience that life is short and everybody dies, name-checking among others, Balzac, Tupac, Anne Frank, “and so are you!”  For starters, the 100-minute musical yarn relates with upbeat tunes and many an F-bomb the luckless times of Elmer McCurdy, a nasty drunk and bumbling would-be criminal. It is no spoiler to note Elmer’s harum-scarum life ends at age 30 in 1911.\n\nAfter that, Elmer’s existence continues over the next 60+ years as his unclaimed corpse passes between owners, crisscrosses America as a carnival attraction, appears in movies and, well, let’s tell no more about his post-mortem career. Except to mention that Thomas Noguchi, the longtime Los Angeles medical examiner known as “coroner to the stars,” pops up as a character who croons through a Vegas-type lounge lizard-y number about the celebrated stiffs who have graced his autopsy table.\n\nMacabre subject? Morbid humor? Dubious taste? You bet, crafted with wicked smarts and performed with admirable artistry. Eight versatile actors sharply depict more than sixty people, while a five-musician onstage band storms out a foot-stomping all-American score that mixes up country music, rock ‘n’ roll, and echoes of other twentieth century genres. Credited with the wacky notion for Dead Outlaw—and as co-writer with Erik Della Penna for its windswept array of regional music and lyrics—is David Yazbeck, the songwriter for exceptional musicals such as The Band’s Visit. The musical’s mordant book is by Itamar Moses, an ace writer whose work ranges from the brainy comedy Bach at Leipzig to HBO’s Boardwalk Empire. These seasoned collaborators treat their bizarre saga with degrees of wit ranging from sophisticated to silly to even somewhat sick.\n\nTheir musical theater deviltry is abetted by director David Cromer, whose fine hand is evident in his production’s stark looks and swift staging. Strange as it may seem in a musical, perhaps this show’s funniest sequence involves a minute or so of dead silence during which nothing at all happens; it’s a typically brilliant bit from the director who notably put a working kitchen with breakfast into the third act of Our Town. Cromer’s staging gleams with graceful bits of dancing choreographed by Ani Taj.\n\nAn unusual musical like Dead Outlaw demands an unusual setting. Designer Arnulfo Maldonado provides a movable unit that is a weathered railroad boxcar on the outside but houses inside a warm garage-type place where the band slams out its gutbucket tunes and contributes vocal harmonies as needed. Punctuated with black-outs by lighting designer Heather Gilbert, who usually maintains a dusky atmosphere, the musical is fluently arranged as a string of comical episodes annotated by a narrator given rascally charm by Jeb Brown. Thanks visually to designer Sarah Laux’s costumes, bunches of people are fleetingly depicted over the decades by Eddie Cooper, Dashiell Eaves, Ken Marks and Trent Saunders. Playing others in passing, Thom Sesma and Julia Knitel also realize key figures; Sesma lends Noguchi a jaunty matter-of-factness; Knitel imbues a wistful quality into the nice woman who loves Elmer and later she is touching in a different way as a gawky schoolgirl who confides her troubles to his mummy.\n\nAs for the deceased but scarcely departed hero, Andrew Durand shoots up his living Elmer with febrile vocals and a hair-trigger Jekyll/Hyde personality. Rigid and mute in a stand-up coffin, Durand assumes a glassy composure that drolly contrasts against what transpires around him. Deadpan humor gets no deader than Durand’s performance.\n\nThe final attraction of the 2024-2025 Broadway season, Dead Outlaw will remind theatergoers of Operation Mincemeat, the new British musical that likewise spins humorously around a corpse. Both based more or less in fact, they are odd shows performed by small ensembles evoking dozens of characters. The British musical may offer the stronger dramatic arc, but the American shaggy dog comicality of the Dead Outlaw story is strangely appealing.\n\nDead Outlaw opened April 27, 2025 at the Longacre Theatre. Tickets and information: deadoutlawmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "nyc-theatre"
  ],
  "originalScore": "4/5 stars",
  "nycTheatreExcerpt": "Macabre subject? Morbid humor? Dubious taste? You bet, crafted with wicked smarts and performed with admirable artistry. Eight versatile actors sharply depict more than sixty people, while a five-musician onstage band storms out a foot-stomping all-American score that mixes up country music, rock n' roll, and echoes of other twentieth century genres."
}
