{
  "showId": "dead-outlaw-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2025/04/27/dead-outlaw-rip-roarin-musical-hits-the-bulls-eye/",
  "publishDate": "2025-04-27T21:34:36",
  "fullText": "Dead Outlaw is a brash, macabre, drolly snarlin’, and altogether darlin’ new musical.\n\n“The sky is black but filled with diamonds,” goes the opening number, the hero atop a train hurtling through the plains of Oklahoma in a gently lovely ballad that in a way counters the opening number of that other musical set in Oklahoma. “Oh, What a Beautiful Ev’ning,” they could call this new song. At the tail end, a lone train whistle blows across the prairie; the sweet-voiced leading man lets out a brusque expletive; and the band erupts into a violently brash country-rock diatribe in song: “Your mama’s dead, your daddy’s dead, your brother’s dead—and so are you.” On it goes, adding “Abe Lincoln’s dead” and continuing with Frank James (i.e. brother of Jesse), Dillinger, Balzac, Tupac, Babe Ruth, Custer (of that well-known last stand), and even Bert Convy. All dead. “And so are you.”\n\nWith a rambunctious score by David Yazbek and Erik Della Penna, an exceedingly strange-but-true book by Itamar Moses, and keenly insightful direction by David Cromer, Dead Outlaw was an award-winning hit when produced off-Broadway by Audible last spring. Yazbek, Moses, and Cromer were responsible for The Band’s Visit, the equally unconventional 2017 musical that similarly traversed the off-Broadway to Broadway route, amassing not one or four but 10 Tony Awards.\n\n[ ]\n\nThe action follows the life and death—in roughly two equal sections—of one Elmer McCurdy (1880-1911). A small-town lad, he wandered the American Midwest with a hair-trigger temper all too easily inflamed by alcohol. McCurdy embarked on a series of bank robberies, apparently not too successfully, and was soon mowed down by law enforcement. That’s where the musical—which till then has been wild, funny and loud—transforms into something more. For the corpse of McCurdy was embalmed, for preservation, and toured across the continent for decades as a side show attraction. In 1976, and this (like the rest of it) is true, a prop man preparing a location shoot for the TV series The Six Million Dollar Man stumbled over the remains of McCurdy’s remains. This leads to an autopsy by Los Angeles’ real-life celebrity “coroner to the stars,” Thomas Noguchi, and the eventual unspooling of the whole gruesome affair.\n\nAll of which seems to be prime Yazbek, one of our most accomplished and least formulaic Broadway songwriters. Ever on the lookout for the unconventional, he came across the little-known saga of McCurdy and  conceived the notion of spinning it into—well, Dead Outlaw. Consider his various musicals: The Band’s Visit, Women on the Verge of a Nervous Breakdown, Dirty Rotten Scoundrels. You won’t find stylistic consistency within a particular score or sometimes even a single song. His palette ranges from gentle beauties to explosive attacks and back again, with occasional musical comedy-style ditties mixed in. The only thing you can count on from him are wisely witty, frequently rude lyrics which always pay off. He shares credit on the show with rock songwriter/guitarist Della Penna, whom he presumably brought in for some of the more high-octane rock/guitar sections. (While the downtown cast and band remain almost virtually intact, Della Penna—who was like a man afire on the guitars—is no longer personally serving up the songs.)\n\nThe cast of eight—all but one of whom fill multiple roles—remains stellar. Andrew Durand (of Shucked, War Horse, Yank!, and other entertainments) heads the cast as the titular desperado, and it is quite a performance. Behind that mostly ever-present scowl lie sweetness, violence, and a burlesque-type vulgarity. The demands of the plot call for him to spend almost half the 100-minute running time playing dead; not sitting immobilized in the shadows like Floyd Collins, that other historical lad presently on Broadway, but standing—dead—in a harsh spotlight’s glare. Durand manages to remain thoroughly and expressively immobile, except when he isn’t.\n\n(If Yazbek’s Dead Outlaw sounds like a farcical counterpart Adam Guettel’s Floyd Collins—both deal with anonymous heroes who find fame and death, bolstered by a cynical media—the similarity is wholly coincidental. Or is it? Long before either wrote for the theater, Guettel and Yazbek were friends and bandmates. The original production of Floyd Collins ran a mere three weeks in New York, finding belated success starting with a regional theatre tour. When the producers of that production offered Guettel the opportunity to write The Full Monty, he urged them to hire Yazbek instead.)\n\nJeb Brown serves as bandleader, narrator and co-star, stepping into the story as necessary including as Durand’s bankrobbing partner, Walter Jarrett. Brown is one of those actors who have been around for years—he started, at 10 years old, as one of those “no-necked monsters” in the 1974 Liz Ashley Cat on the Hot Tin Roof—but he here steps commandingly into the spotlight. Eddie Cooper, Dashiell Eaves, Ken Marks, Trent Saunders, and Thom Sesma all shine in their various featured spots. Sesma does especially well, stepping out of the shadows and into the spotlight with a bravura (and altogether strange) song-and-dance rendering of the L.A. coroner’s song, “Up to the Stars.” (Yazbek can’t help but throw in mentions of Marilyn, Elvis, Natalie Wood, and Sharon Tate.) Standing out from the rest is the striking Julia Knitel, who plays McCurdy’s Oklahoma girlfriend and, later, a bobby-soxer besotted with Elmer’s corpse. (It’s that kind of a musical.) She does a lovely job with “A Stranger,” sung over the outlaw’s corpse; while her other solo (“Millicent’s Song”), crooned to the corpse, is, well, unique. Knitel, a replacement Carole King in Beautiful, is a performer to watch.\n\nCromer, whose recent efforts include Good Night, and Good Luck and Prayer for the French Republic, has moved his production uptown almost intact, the major difference being one of space: Arnulfo Maldonado’s decidedly unusual set—dominated by a large cube of a bandstand—formerly took up much of the stage, affording compressed playing areas on the sides and the roof. That cube has been replicated at the Longacre—the guitar-fueled six-piece band, under the direction of Rebekah Bruce at the keys, remains of central importance to the proceedings—but there is now sufficient space for the actors, the director, choreographer Ani Taj, and lighting wizard Heather Gilbert. The original claustrophobic nature called for by the material remains, but everyone (including the audience) now has a sense of breathing space.\n\nLoping into the Longacre at the tail end of this up-and-down season, here’s an iconoclastically anarchic romp that blasts its way through traditional showmaking to create an original new musical that’s adventurous, unconventional, consistently entertaining, and an altogether rip-roarin’ bull’s-eye.\n\nDead Outlaw opened April 27, 2025 at the Longacre Theatre. Tickets and information: deadoutlawmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "The cast of eight—all but one of whom fill multiple roles—remains stellar. Andrew Durand (of Shucked, War Horse, Yank!, and other entertainments) heads the cast as the titular desperado, and it is quite a performance. Behind that mostly ever-present scowl lie sweetness, violence, and a burlesque-type vulgarity. The demands of the plot call for him to spend almost half the 100-minute running time playing dead; not sitting immobilized in the shadows like Floyd Collins, that other historical lad presently on Broadway, but standing—dead—in a harsh spotlight’s glare. Durand manages to remain thoroughly and expressively immobile, except when he isn’t.",
  "bwwScore": 10
}
