{
  "showId": "the-threepenny-opera-2006",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2006/legit/reviews/the-threepenny-opera-1200513847/",
  "publishDate": "April 20, 2006",
  "fullText": "Aug 31, 2006 2:01pm PT \n\n \n\n \n \n \n\n \n\n \n Platform\n \n \n\n \n\n The audience was already prepared for the worst, fully aware that a play based on a novel by Michel Houellebecq was being staged by the equally notorious Calixto Bieito. It probably caused more alarm to discover \"Platform\" is not a tawdry peep show but a deeply serious piece of philosophical discourse.\n\nIt starts with the kind of sexually explicit image rarely seen on a stage, yet there were no walkouts on opening night of this, the final play in the 2006 Edinburgh Intl. Festival. The audience was already prepared for the worst, fully aware that a play based on a novel by Michel Houellebecq was being staged by the equally notorious Calixto Bieito. They greeted the notices warning of “extreme and sexually explicit video images” with little surprise, let alone shock. It probably caused more alarm to discover “Platform” is not a tawdry peep show but a deeply serious piece of philosophical discourse.\n\nAll the same, a first-date play it is not. The opening few minutes consist of actor Juan Echanove sitting with his back to the audience in a transparent booth, feeding coins into a video machine while watching a hardcore porn film. Nothing is left to the imagination — which is Bieito’s point. There’s nothing erotic about these graphic images; they are cold, mechanical and repetitive — an empty place of refuge for Echanove’s Michel and the other lonely sex tourists drinking in a Thailand bar.\n\nEven the striking figure of Belen Fabra, naked apart from her high heels, is unerotic. Dreamy and vacant-looking, she wanders the stage behind the main action, climbing across the central scaffolding section, singing at the outsize tiger-skin piano and covering herself in yogurt as if she’d been ejaculated over. Largely silent, she represents the voiceless victims of the sex industry, a body for hire without character or personality. It’s significant that it is she who defaces the row of porno screens mid- performance.\n\nHouellebecq’s story is about Michel, a civil servant who ankles his job at the French Ministry of Culture to set up an agency specializing in third-world sex tourism with Valerie (Marta Domingo), a sexually open young woman working in the travel trade. The novel contrasts Michel’s cynicism and misanthropy with his realization that he’s falling in love with Valerie: Suddenly some kind of redemption seems possible in his miserable life.\n\nThat possibility is snatched away, however, when Valerie is killed by a terrorist bomb, offering further opportunity for Michel to ponder the culture clash between decadent west and fundamentalist east, much of which he does in depressingly racist terms.\n\nThe book manages to be both entertaining and confrontational, the author never making it clear where the views of his characters coincide with his own, while forwarding a worldview that refuses to pander to the liberal consensus.\n\nIt’s this discursive aspect of the book that Bieito responds to most directly, presenting “Platform” more as a dramatic poem than a full-fledged drama. He tells the same basic story, but lets the characters describe the action rather than act it out. This gives them room to sit around on Alfons Flores’ piano-bar set and philosophize at length.\n\nFor an English-speaking aud, that means a lot of time spent reading the translation instead of watching the stage, though Bieito does vent his theatrical imagination with a revolving set and a series of bizarre songs including a version of “Surfin’ U.S.A.” set against an obscene backdrop.\n\nMore typically, it is a sober study of one man’s journey from alienation to love and back again. For all his character’s cynicism, Echanove manages to make Michel more attractive than the other overweight barflies, even if he can’t shake off his existential despair.\n\nThe play might have benefited from a more substantial role for the cool and elegant Domingo as Valerie, which would have lent more emotional weight to her role in Michel’s life. But as a vision of early 21st-century moral emptiness, it remains an absorbing and unsettling experience.",
  "isFullReview": true,
  "dtliExcerpt": "This handsome revival of Bertolt Brecht and Kurt Weill's caustic musical fable boasts a first-rate cast and some striking design elements, but it never quite achieves the theatrical snap that might make audiences forget they're watching a canonical work being dutifully revived.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This handsome revival of Bertolt Brecht and Kurt Weill's caustic musical fable boasts a first-rate cast and some striking design elements, but it never quite achieves the theatrical snap that might make audiences forget they're watching a canonical work being dutifully revived.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 669,
  "archivePath": "data/archives/reviews/the-threepenny-opera-2006/variety--charles-isherwood_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:56:22.749Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 669,
  "tierReason": "Full review text"
}