{
  "showId": "the-lyons-2012",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "http://theater.nytimes.com/2012/04/24/theater/reviews/the-lyons-with-linda-lavin-at-the-cort-theater.html?adxnnl=1&ref=theater&adxnnlx=1335281201-3TBN6uVBrLvqyLJiPtPdyg&gwh=A51120CE459186D8026E3FBFBE17B3EF",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Sure, from a distance the title characters of “The Lyons,” the Nicky Silver play that opened on Monday night at the Cort Theater in a production starring the fabulous Linda Lavin, are hilarious as they kick the ego out of one another. But look at them close — no, closer — and you’re likely to find an intimate mirror of your own frightened self. Welcome to Broadway at last, Mr. Silver. And might I add that that this cozy-but-nasty family portrait is just the right vehicle to bring you here?",
  "bwwScore": 8,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LYONS-Updating-Live-20120423",
  "fullText": "https://www.nytimes.com/2012/04/24/theater/reviews/the-lyons-with-linda-lavin-at-the-cort-theater.htmlShare full articleAdvertisement\n\nOh, they’re just awful people, those Lyons. They’re whiny, denigrating, vicious, self-centered, recriminatory — the sort of blood kin who can’t cling to one another without drawing blood. And they’re a family that you will really, really want to spend time with. Honestly. And not just for (you should excuse the expression) the pleasure of their company.\n\nSure, from a distance the title characters of “The Lyons,” the Nicky Silver play that opened on Monday night at the Cort Theater in a production starring the fabulous Linda Lavin, are hilarious as they kick the ego out of one another. But look at them close — no, closer — and you’re likely to find an intimate mirror of your own frightened self.\n\nWelcome to Broadway at last, Mr. Silver. And might I add that that this cozy-but-nasty family portrait is just the right vehicle to bring you here?\n\nA prolific creator of dark and defiantly eccentric comedies since the early 1990s (“Raised in Captivity,” “The Food Chain”), Mr. Silver has had productions mounted all over Manhattan, with varying success. But while he contributed to the book of the unfortunate 2002 revival of “The Boys From Syracuse,” his own plays seemed a little too special (read: creepy) for commercial Broadway.\n\nYet if you stood in the Cort Theater lobby and listened to the laughter that rises in close and regular waves, you could easily pretend that the time was the 1960s, and that you had just dropped in on the latest hit by Neil Simon, directed by Mike Nichols. That’s because the laughter you hear there is cadenced, as if in some sort of call-and-response ritual. It’s the sound of New Yorkers reveling in target-hitting one-liners fired in high exasperation by urban neurotics.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 318,
  "archivePath": "data/archives/reviews/the-lyons-2012/nytimes--ben-brantley_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:12:25.622Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 318,
  "tierReason": "Full review text"
}