{
  "showId": "evita-2012",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2019/11/15/theater/evita-city-center-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2019/11/15/theater/evita-city-center-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "If you lived in New York in the years after “Evita” arrived on Broadway in 1979, or for that matter in Argentina at any time since 1949, you know the dress: a white strapless ball gown, fairy-dusted with spangles, fitted like a bandage at the bodice and billowing into a parade float below. The Dior original that Eva Perón wore to the theater and the version of it that Patti LuPone wore to sing “Don’t Cry for Me, Argentina” in the show have each, in their way, come to signify brutal glamour, in governance as in musicals.\n\nThat dress — reinterpreted by the Argentine designer Alejo Vietti — has been lifted out of its various contexts to become the central image of the director Sammi Cannold’s smart yet unpersuasive production of “Evita,” which opened on Wednesday as the annual gala production for New York City Center. When you enter the theater, it is hanging from the flies, glittering but baleful, like a carapace or an iron maiden.\n\nIf that seems about right as a concept, it’s a touch academic as entertainment, a pattern that Cannold’s staging maintains throughout. “Evita” is already a “concept” musical, derived from a 1976 concept album by Andrew Lloyd Webber and Tim Rice and originally realized on Broadway by a director, Harold Prince, whose take was deliberately chilly. Luckily, the performances of his stars — LuPone and, as a narrator figure called Che, Mandy Patinkin — were instinctively emotional, and the clash of temperatures was thrilling.\n\nBut Cannold’s interpretation, based in part on work she did for her undergraduate thesis at Stanford, is even more analytical than Prince’s. Aside from separating the dress from the woman, she has separated the woman from herself: Eva is played from age 15 through 20 by Maia Reficco and as an adult by Solea Pfeiffer. Even after the girl turns into the woman, in the middle of the song “Buenos Aires,” she hovers over the rest of the action as a caution.\n\nMaia Reficco as Young Eva in the production.Credit...Sara Krulwich/The New York TimesThe result, as it must be for 2019, is a more ambivalent, feminist reading of Argentina’s first lady, lay saint and lightning rod. But it’s also, for much of its two hours, more muddled and less engaging. When we see, for instance, how middle-aged men use an obviously teenage Eva sexually as she sleeps her way from poverty in the sticks to glory in the capital, we are properly repulsed and yet confused about the message. If she’s the men’s victim how is she also, in deliberately bedding them with no long-term interest, their victimizer?\n\nThough it’s sensible to posit that Eva could be both, the libretto — which is unchanged except for the interpolation of the song “You Must Love Me” from the 1996 movie — doesn’t give Cannold enough to support and develop the idea. It also leaves her with a problem that comes to feel like a hangover, as young Eva has little to do for most of the show but wander around with her valise like a refugee from “Les Miz.”\n\n“Evita” is already overloaded with symbols. Most of its characters are abstractions, and so are most of its conflicts. Eva’s chief antagonist isn’t her husband, the quasi-fascist Juan Perón (Enrique Acevedo), but Che (Jason Gotay), a generalized man of the people and freelance cynic. The plot unrolls like a military campaign seen from above on a strategy map, with the ensemble divided into armies representing the haughty rich, the cutthroat military and the impoverished descamisados.\n\nCannold’s production, with its additional symbolic superstructure and shaky use of the stage, is often too fragmented to produce the effects the show’s creators intended. I am not really endorsing those effects; deliberately or not, they give moral status to characters who don’t deserve it, just by letting them sing. Cannold undercuts that, forcing us to confront our complicity in enjoying them as entertainment. But of course, in the process they become less entertaining.\n\nAs Eva, Pfeiffer — an Eliza in “Hamilton” who also made a splash in the Encores! Off-Center production of “Songs for a New World” — bears the brunt of this problem. She looks and sounds smashing throughout, but fully comes into her own only in the second half, when a concrete if interior conflict — Eva’s health — emerges. Acevedo is vocally lustrous but dramatically inert as the underwritten Perón.\n\nIt’s left to Gotay to hold things together, which he does with a beautifully sung, consistently wry performance. But Cannold deploys him haphazardly onstage, like a mouse in a maze; whenever he builds up a righteous rage, he’s forced to scuttle away.\n\nJason Gotay, left, as Che and Solea Pfeiffer as Eva.Credit...Sara Krulwich/The New York TimesIn its historical hugeness and skimpy script, “Evita” will always require such trade-offs. Lloyd Webber gives you his most inventive, supple music, unsingable though much of it may be, then cleverly reprises it before finally ramming it into your ear. Rice occasionally interrupts his mis-accented, mixed-metaphor lyrics with hooks so pointed they rip your skin. The overall idea of beatifying while beating up on Evita is likewise fatally compromised.\n\nSo it’s encouraging that Cannold’s approach, however equivocal, works even as well as it does. Part of that is its physical and sonic beauty: not just Vietti’s costumes but also Jason Sherwood’s white-flower bier of a set, Bradley King’s ardent lighting and the orchestra, under the direction of Kristen Blodgette, playing Lloyd Webber’s revised orchestration for the 2012 Broadway revival. Hiring a predominantly Latino cast is another decision that pays off.\n\nWhether we need an “Evita” that helps to humanize a woman who enabled a dictator is a matter of taste. For me, I’ll just say that the gorgeous dress is now more impressive on a hanger than it ever was when worn.\n\nTickets Through Nov. 24 at New York City Center, Manhattan; 212-581-1212, nycitycenter.org. Running time: 2 hours.\n\nJesse Green is the co-chief theater critic. Before joining The Times in 2017, he was the theater critic for New York magazine and a contributing editor. He is the author of a novel, “O Beautiful,” and a memoir, “The Velveteen Father.”",
  "isFullReview": true,
  "textWordCount": 1031,
  "archivePath": "data/archives/reviews/evita-2012/nytimes--jesse-green_2026-02-07.html",
  "textFetchedAt": "2026-02-07T13:36:16.056Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 1031,
  "tierReason": "Full review text"
}