{
  "showId": "evita-2012",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2012/legit/reviews/evita-1117972614/",
  "publishDate": "April 5, 2012",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Elena Roger brings a fierce passion to the role of Eva Perón that transcends her vocal limitations, while Ricky Martin proves a charismatic if lightweight Don Juan in this handsomely mounted revival.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Elena Roger brings a fierce passion to the role of Eva Perón that transcends her vocal limitations, while Ricky Martin proves a charismatic if lightweight Don Juan in this handsomely mounted revival.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 572,
  "archivePath": "data/archives/reviews/evita-2012/variety--marilyn-stasio_2026-02-06.html",
  "textFetchedAt": "2026-02-06T05:06:47.883Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Q: I work for a high level production executive in the NY office of a studio. I’ve been there a year and a half and it has become clear that there is no room to grow. I like my boss but would like to start moving out of the assistant seat.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Lucasfilm Replacing Kathleen Kennedy With Dave Filoni, Lynwen Brennan as New 'Star Wars' Bosses \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Rian Johnson Says He Was Not ‘Spooked’ by Toxic ‘Star Wars’ Fans After Kathleen Kennedy Cites ‘Last Jedi’ Backlash as to Why He Never Directed Another Entry\n\nHow do I approach a job search? What’s the protocol, do I tell her first? I feel I’ve been successful in the position and am not in a rush to leave but would like to explore options. How would you advise I position myself for an upward move rather than a lateral one?\n\nYour advice is most appreciated.\n\nA: Hi Jessica: You are very smart to take a cautious approach in looking for another job. As an executive assistant to a production exec, you must be quite busy the entire time you are in the office. So your time is precious and ethically you don’t want to be spending a lot of the office time looking for your next job opportunity. And…your own job security is of the utmost importance. So one must be discreet. You can begin by checking out the trades… Variety, of course, as well as VarietyCareers.com… as well as the studio job sites on line, to begin to get the landscape of the types of positions in which you are interested. If there is a potential to move up within the company then it may be wise to let your boss know that you are interested in expanding your job responsibilities and would like to be able to do that where you currently are. This depends on your relationship with your boss, of course. Some bosses are very much supporters of promoting people internally to keep them in the family, so to speak. It would seem to me that the assistant position is oftentimes the springboard to that next level. If indeed the company is too small to support that, it still may be advantageous to let your boss know of your ambition. After all, if you weren’t doing a good job, you wouldn’t be working for him or her. But still, you need to be the judge of how you think they will react to your ambition – because of the networking opportunity you could have through your boss, if you could create that advocate role in your current boss, that would serve you well as you move forward in your career. If you can be honest with your boss, and assure him or her that you would stay until he or she found a replacement, then you could use them to help you in your job search. Again, that would depend upon their personality and inclination to help you. So there are a lot of variables. You can also take a handful of close friends and business acquaintances into your confidence. For example, if any of your friends are at a studio or production company in which you have an interest, you can inquire about any potential job openings. But know that you must keep this to only a few individuals.\n\nThis should give you a good start in beginning your search.",
  "_showNotMentionedDiscoveryAttempted": true
}
