{
  "showId": "evita-2012",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2012/legit/reviews/evita-1117947260/",
  "publishDate": "April 5, 2012",
  "fullText": "Someone should tell the three residents of \"Small Apartments\" to stop trying to be so funny, since their efforts are pitched at such intensity, it scares away the laughter.\n\nSomeone should tell the three residents of “Small Apartments” to stop trying to be so funny, since their efforts are pitched at such intensity, it scares away the laughter. Adapted from the 2000 winner of Canada’s Three-Day Novel Contest, by author Chris Millis, director Jonas Akerlund’s unrelenting quirkathon assembles a promising cast, winds them up like so many tin toys and then sits back to observe the awful racket they make when marching to the beat of their own drums. The self-satisfied result evidently aspires to cult status, which could happen if the right distrib embraces its garishly outre sensibility.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Damon Lindelof Sets Limited Series 'The Chain' at HBO Under New Overall Deal \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Knight of the Seven Kingdoms' Premiere Draws 6.7 Million Viewers in Three Days\n\nA tubby, bald lad named Franklin Franklin (“Little Britain‘s” Matt Lucas) stands in his underwear playing an oversize alphorn, while his neighbors bang on the wall begging for quiet. His squalid one-room studio is nearly empty except for a day-glo refrigerator, a shrine made of Swiss postcards, and an unattended corpse (Peter Stormare).\n\n“Small Apartments” is the kind of movie for people who, instead of covering their noses, will wonder by what amusing circumstances the body could possibly have gotten there, willing to be strung along for an hour to find out. Broadly speaking, in the realm of black comedy, a dead landlord isn’t so much a liability as a happy ending, which makes for an odd sort of suspense (“Rear Window” in reverse?) as Franklin clumsily tries to cover his tracks.\n\nOn the exterior, the building looks like a typical gone-to-seed Southern California apartment complex, but inside, the rooms have been art-directed to extreme, with fluorescent colors that lend an extra kick to the many varieties of squalor on display. Franklin lives between two weirdos: a punk-rock wannabe (Johnny Knoxville) and a nosy old curmudgeon (James Caan). Across the way lives a trampy teenager (Juno Temple) whom Franklin spies on.\n\nAfter a handful of small performances, Lucas is long overdue to play a lead on the bigscreen. Spending most of the movie wearing dirty briefs and bad wigs, the “Little Britain” star (and “Bridesmaids” roommate) gleefully surrenders his dignity as the not-all-there Franklin, never more so than in the flashback that explains how the slumlord wound up dead. By the time the reveal occurs, auds have already witnessed Franklin dragging the body back to his own garage, where he stages an outrageously implausible suicide scene.\n\nPopulated by such cartoonish personalities, the film’s challenge is making you care. Though Akerlund seems to be thumbing his nose at decorum with every step, he discreetly sneaks a measure of poignancy into the mix with the arrival of Billy Crystal, playing a fire investigator who reads far more into the situation than his police colleagues do. Until this point, the film has been nothing but tangents and wild hairs; once the Crystal character’s detective instincts kick in, however, the pic’s wildflower eccentricities fashion themselves into something resembling a bouquet.\n\nConsidering the source, “Small Apartments” was never going to be much more than an opportunity for brazen irreverence, and Millis, adapting his own novel, provides Akerlund no shortage of gonzo details with which to work. Encountering so many quirks crammed under one roof is enough to drive most people crazy, so there’s a genuine sense of relief when Millis manages to explain how all of these outlandish details relate.\n\nThe pic’s superficial disorder aside, Akerlund demonstrates a mad sort of control over all aspects of the production, from the hyper-saturated color scheme to Knoxville’s leopard-print underpants. Even walking into the film blind, it takes only moments to recognize that it was directed by the same man who made “Spun,” with its similar appetite for all things tacky. To be sure, his sensibility is an acquired taste, like the dill pickles and Moxie soda on which its man-child main character survives.",
  "isFullReview": true,
  "dtliExcerpt": "Elena Roger, reprising her Olivier Award-winning performance from the West End revival, brings a ferocious intensity to Eva Peron that's both thrilling and exhausting to watch.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Elena Roger, reprising her Olivier Award-winning performance from the West End revival, brings a ferocious intensity to Eva Peron that's both thrilling and exhausting to watch.",
  "contentTier": "complete",
  "contentTierReason": "Short text (26 words)",
  "rejectedAt": "2026-02-03T15:56:30.875Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or quote, not a complete review with an evaluative verdict; openai: The review focuses on Elena Roger's performance from the West End revival, not the current Broadway production.",
  "promptVersion": "5.2.0",
  "textWordCount": 683,
  "archivePath": "data/archives/reviews/evita-2012/variety--marilyn-stasio_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:54:25.330Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 683,
  "tierReason": "Full review text"
}