{
  "showId": "all-my-sons-2008",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "http://variety.com/2019/legit/reviews/all-my-sons-review-annette-bening-broadway-1203194663/",
  "playbillVerdictUrl": "http://variety.com/2019/legit/reviews/all-my-sons-review-annette-bening-broadway-1203194663/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Bening leads a stellar cast that brings this early Arthur Miller play to harrowing life in a revealing revival.\n\nDon't be fooled by the placid backyard setting, neighborly small talk and father-son joviality at the start of the Roundabout Theatre Company's blistering revival of Arthur Miller's \"All My Sons\" starring Annette Bening and Tracy Letts. There are plenty of secrets, resentments and disillusionments ahead, poised to rip this sunny Middle Americana facade to shreds.\n\nThe 1947 play that was Miller's first big success (and his warm-up to \"Death of a Salesman\") can sometimes feel like an Ibsen/Odets homage, with its heavy hand on symbols, speechifying and mechanical plotting. But it still packs a wallop all its own, especially in this wonderfully cast, honestly staged and beautifully presented production. It even makes you rethink one of the lead characters in a way that makes the play's ending even more harrowing.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Susan Lucci on Her New Memoir, Return to Acting With Keanu Reeves and Advice for Diane Warren After 17th Oscar Nom \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Jamie Lee Curtis Slams ICE as an 'Abhorrence' and Says It's Being Used as a 'Distraction So That We Don't Pay Attention to the Epstein Files'\n\nIt's the kind of play that always feels relevant — when are works decrying greed and corruption not relevant? — but Miller's tale of ethical malfeasance, moral bankruptcy and enabling behavior — not to mention faulty airplane parts, eerily echoed in today's headlines — has an especially deep sting now.\n\nDirector Jack O'Brien, who came aboard after Gregory Mosher left the production over a casting clash with the Miller estate, staged a production for PBS 32 years ago starring James Whitmore and Michael Learned. Here he returns to the material with leading actors who bring nuanced lives and layers to these familial archetypes: the devoted father, the protective mother, the dutiful son. But the deceits and illusions in this expedient post-WWII America are barely holding them all together, and soon enough all of them will be struck down as furiously as the play's foreshadowing winds.\n\nJoe Heller (Letts) is a factory owner whose partner was sent to prison when he was found responsible for shipping defective airplane parts that led to fatal crashes and the deaths of servicemen during the war. Since then, life has returned to at least the motions of normalcy for the exonerated Joe as he exchanges banal quips with neighbors and his war veteran son Chris (Benjamin Walker), who has now joined his father in running the repurposed factory.\n\nBut life has not moved on for Kate (Bening), who still lives in the crosshairs of anxious hope and lingering doubts, three years after their other son Larry, an Air Force pilot, was reported missing in action. When Ann (Francesca Carpanini), the daughter of Joe's imprisoned partner and Larry's intended, comes to visit, it's a mystery to all except Chris, who hopes to marry her. But to accept that union, Kate would have to acknowledge Larry's death — and much more. The whole cast makes their characters as well as the play's melodramatic turns not only credible, but enthralling.\n\nIn Douglas W. Schmidt's picture-perfect, mid-century backyard set, Letts looks like the vision of comfort and calm, but small cracks in his character soon appear: an odd unease here, a flash of anger there, a growing coldness that suggest all is not as it seems. It's a stealth performance that draws you in with its naturalism before revealing another self.\n\nHe's not the only character with a troubling duality. One look at Bening's pale, haggard face and you see at first a mother in perpetual pre-mourning. But look again and see that there's more to this wife and mother: a survivor. As the family's master manipulator, her frail physical and mental states here are tools for her own purposes, and Bening is unsparing in a stunning performance that evokes shudders.\n\nChris' wartime experiences left him a changed man, but one who still clings, however tenuously, to his ideals and hopes for the future. Walker brings a genuineness to this sometimes too-good-to-be-true character, making Chris' private revelations, as someone who has hidden scars of his own, all the more affecting.\n\nCarpanini elevates the ingenue in Ann, giving her strength, determination and purpose that makes her a credible match for this family — as well as her own. Hampton Fluker — as Ann's brother George, whose arrival begins the tragedy's descent — is terrific as he journeys from rage to doubt to neediness, before ending in heartbreaking emptiness.\n\nMichael Hayden, Chinasa Ogbuagu, Jenni Barber and Nehal Joshi all do well in their roles as enabling neighbors, underscoring Miller's revelation of a dark, disturbing strata that stretches beyond one family, into a neighborhood and out into the country.",
  "isFullReview": true,
  "textWordCount": 795,
  "archivePath": "data/archives/reviews/all-my-sons-2008/variety--frank-rizzo_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:29:34.560Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 795,
  "tierReason": "Full review text"
}