{
  "showId": "our-town-2024",
  "outletId": "new-york-theatre-guide",
  "outlet": "New York Theatre Guide",
  "criticName": "Austin Fimmano",
  "url": "https://www.newyorktheatreguide.com/reviews/our-town-broadway-review-jim-parsons-zoey-deutch-katie-holmes",
  "publishDate": "October 10, 2024",
  "fullText": "'Our Town' review — a starry revival of a timeless classicRead our review of Our Town on Broadway, a revival of Thornton Wilder's classic play starring Jim Parsons, Zoey Deutch, Katie Holmes, Ephraim Sykes, and more.Austin FimmanoOctober 10, 2024, 00:00The newest revival of Our Town, written by Thornton Wilder in 1938, brings small-town USA back to Broadway in a big way. With a star-studded cast featuring actors of all races, ages, and abilities, the fictional town of Grover’s Corners, New Hampshire, comes to life in an evocative way. Tony Award-winning director Kenny Leon's vision for the play is to emphasize how human trials and tribulations are universal, no matter the time period or walk of life. Jim Parsons, in the iconic role of the Stage Manager, is the heart of this production in more ways than one. In a production with minimal props, Parsons sets the scene with tenderness. He manages to be both nonchalant and intensely sentimental about his beloved Grover’s Corners, a feeling many people who grew up in a small town could relate to. Unfortunately, a lack of chemistry between the two other main characters, young lovers George Gibbs (Ephraim Sykes) and Emily Webb (Zoey Deutch), keeps the production from achieving a certain pathos overall. In the director’s note, Leon recalls getting the rights to bring Our Town to Broadway a few years ago, during a time when the return of live theatre was still a big “if.” That sense of uncertainty is mirrored beautifully in the final act of the play, which packs more of an emotional punch than the first two acts manage. Once something is taken away from us, we realize all the ways we could have been more present, more appreciative, and not take anything for granted. In a way, this production of Our Town is a triumph over that feeling of hopelessness — live theatre returned and continues to thrive — but it also has an important message, asking us to experience every day of our lives to the fullest. Our Town summary Director Kenny Leon’s revival of the Pulitzer Prize-winning Our Town is the first to grace Broadway stages in over 20 years. Written in 1938, the play is set in a tiny New Hampshire town called Grover’s Corners beginning in 1901. With a small turn-of-the-century Americana town come the usual tropes: the local milkman, the folksy town cop, the local drunk, and the high school sweethearts. Guided by the Stage Manager, we follow along as teenagers George Gibbs and Emily Webb fall in love, get married after their high school graduation, and continue the generations of Grover’s Corners like their parents before them. What to expect at Our Town Leon’s Our Town is a streamlined version, running approximately 100 unbroken minutes; the three acts of the play flow into one another with no intermission. While Act I concerns \"Daily Life\" and Act II is about \"Love and Marriage,\" Act III naturally talks about \"Death.\" The play gets heavy from here on out, with characters sitting behind their own tombstones. (Some audience members are also seated on stage nearby.) The poignant message delivered in Act III may not be easy for all theatregoers, as it deals with untimely death and losing relatives. But confronting audiences with such inevitabilities of life and asking us to reckon with them is part of why this play has endured on stage for nearly a century. What audiences are saying about Our Town At the time of publication, Our Town has an 81% rating on the audience review site Show-Score. In mostly positive reviews, many viewers praised the performances of the cast and the show’s universal message. “Stunning and emotional performances from the entire cast. Story felt so relevant and timeless.” -Show-Score user Niad03 “It moves a bit more swiftly than other productions and even [has] nice moments of humor.” -Show-Score user DARTheatreLover “Jim Parsons puts on a clinic. Wonderful company! Bravo to the cast and creative team.” -Show-Score user Dennis 4273 Who should see Our Town With so many stars in the cast, anyone might be able to catch their favorite celebrity on stage, be it Jim Parsons, Katie Holmes, Zoey Deutch, or a host of seasoned Broadway stars. Theatregoers who love revivals of Broadway classics can’t miss this latest production of Our Town for the 21st century. Anyone who has seen Kenny Leon’s past productions — from the Tony-winning Purlie Victorious and Topdog/Underdog on Broadway to Much Ado About Nothing for Shakespeare in the Park — would enjoy seeing his latest work. Learn more about Our Town on Broadway A revival both for fans and for newcomers, this production of Our Town has something for all audiences to enjoy. Learn more and get Our Town tickets on New York Theatre Guide. Our Town is at the Barrymore Theatre through January 19. Photo credit: Our Town on Broadway. (Photos by Daniel Rader)Originally published on Oct 10, 202423:00",
  "isFullReview": true,
  "dtliExcerpt": null,
  "bwwExcerpt": null,
  "showScoreExcerpt": "In a way, this production of Our Town is a triumph over that feeling of hopelessness — live theatre returned and continues to thrive — but it also has an important message, asking us to experience every day of our lives to the fullest.",
  "originalScore": null,
  "assignedScore": 88,
  "source": "show-score",
  "textStatus": "complete",
  "textWordCount": 822,
  "archivePath": "data/archives/reviews/our-town-2024/new-york-theatre-guide--austin-fimmano_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:16:19.683Z"
}