{
  "showId": "our-town-2024",
  "outletId": "pagesonstages-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.com/2024/11/23/our-town/",
  "publishDate": null,
  "fullText": "Kenny Leon’s new Broadway, staging of Thornton Wilder’s widely-produced classic Our Town embraces the theme of showing people something they cannot see. Staged with no props, minimal costume changes, and a highly functional monochromatic set, this version does not seek to expand upon or innovatively reimagined Wilder’s work, but rather to faithfully codify this play’s timeless, universal nature as part of the theatre canon, reminding audiences of how much a play can do without the elaborate design and technological elements 2024’s audiences have come to expect. This show is beautiful and moving on its own merits— without anything flashy at all. What those in the industry, call “flash and trash“ (making an unnecessary spectacle) is often used to cover up bad writing. Let’s not forget that theatre is entertainment, and over-the-top magical moments are great tools for helping audiences forget weak writing, or purposeless plot points. It was bold of Kenny Leon to stage Our Town in this barebones way because, truth be told, the spoken words don’t quite hold up as well as the overarching concepts do. Wilder’s script is deliberately vague, with many sentences that trail off into nothingness. The characters are rather one dimensional, and the stage manager (Jim Parsons), was devoid of characteristics other than an aversion to marriage. For his part, Parsons disappointed in that he was too similar to other characters he’s played. I couldn’t stop thinking of him as Sheldon from The Big Bang Theory getting excited about trains and demanding precision in every aspect of his life. Aesthetically, Beowulf Boritt’s scenic design shines with the beautiful, floating lantern lights and monochromatic paneling that hid windows, furniture, and a hauntingly, beautiful graveyard, kept behind the façade until the third act. The scenic painting made it impossible to see what parts of the façade could open, and all of the chairs and tables matched, creating a feeling of being here, but also not here. Between worlds, the stage manager interrupted normal life just as it began to feel compelling, as though he had studied these moments many times before and the ending of these stories and conversations was a foregone conclusion. If it all ends in death, as is posited in act three, is there meaning? Is there a point to the cyclical existence where everything blends together and one town could be any town and every town? Does the precise placement of every storefront and residence matter in the grand scheme of things? I’d like to be hopeful, but I think Kenny Leon’s crafting of this retelling posits a tacit, “no. “ No, our specifics, don’t matter to humanity. But they matter to us, for the time that we are here, and I’d argue that spending a couple hours of our lives watching Our Town and thinking about how small we are might be emboldening in some way. Have courage! Live! At the end, your failures won’t stop the world. Embrace your time here. Be you while you can before you return to the dirt. I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 512,
  "archivePath": "data/archives/reviews/our-town-2024/pagesonstages-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:26:27.326Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}