{
  "showId": "our-town-2024",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/OurTown24.html",
  "publishDate": null,
  "fullText": "Theatre Review by Howard Miller - October 10, 2024\n\nOur Town by Thornton Wilder. Directed by  Kenny Leon. Scenic design by Beowulf Boritt. Costume design by Dede Ayite. Lighting design by Allen Lee Hughes. Sound design by Justin Ellington. Hair, wig, and makeup design by J. Jared Janas. Vocal coach Kate Wilson.\nCast: Jim Parsons, Billy Eugene Jones, Sky Smith, John McGinty, Michelle Wilson, Katie Holmes, Ephraim Sykes, Safiya Kaijya Harris, Hagan Oliveras, Zoey Deutch, Shyla Lefner, Richard Thomas, Heather Ayers, Bryonha Marie, Willa Bost, Donald Webber Jr., Julie Halston, Bill Timoney, Doron JéPaul, Anthony Michael Lopez, Bobby Daye, Kevyn Morrow, Ephie Aardema Sarnak, Noah Pyzik, Ricardo Vázquez, and Greg Wood.\nTheater: Ethel Barrymore Theatre, 243 West 47th Street (Between Broadway and 8th Avenue)\nTickets: Telecharge.com\n\nThe play paints a portrait of the life and times of the residents of the fictional town of Grover's Corners, New Hampshire, covering the period between 1901 and 1913. Act I (\"Daily Life\") acquaints us with the many characters and gives us a glimpse of their day-to-day routines, much of it carried out in pantomime and all of it taking place within a minimally designed performance space (the dark-hued set is by Beowulf Boritt, while the evocative lantern lighting is by Allen Lee Hughes). It is foundational introductory material that is pretty much rushed through in the script, but here it is even more so as both the Stage Manager and the director seem impatient to get to the good stuff in Act II (\"Love and Marriage\") and Act III (\"Death and Eternity\").\n\nOur Town effectively captures the life of small town USA, or at least a sort of mythic version of it. On the whole, it avoids falling into a sea of sentimentality through the use of Wilder's great invention of the Stage Manager, who speaks directly to the audience when not directly manipulating the stage business. Jim Parsons (sporting a handsome beard) is particularly skilled at embodying a peevish impatience that cuts through any possible mawkishness.\n\nThrough this fourth wall-shattering setup, we are invited to simultaneously view the characters as the residents of Grover's Corners and as performers in the story the Stage Manager is relating to us. Herein lies a trap: how to balance our belief in the characters with our awareness of the metatheatrical setup.\n\nThose who can, do. In this production, the standout is Ephraim Sykes as George. Sykes, a Tony nominee for his performance as David Ruffin in Ain't Too Proud, beautifully embodies both the innocent teenager we meet in the beginning, and, later, the sweetly charming love interest and then husband of Emily (Zoey Deutch, whose approach is a more modern proto-feminist one). Other cast members who are quite effective in pulling off the requisite double duty are Katie Holmes and Richard Thomas as Emily's parents, and Billy Eugene Jones and Michelle Wilson as George's parents. And working miracles is a delightful Julie Halston, who shows what you can do with even a small part, in this case, as a gossipy neighbor and an enthusiastic wedding guest.\n\nStill, many of the roles are sketchily drawn to begin with, and outside of the main ones (i.e. George's family and Emily's family), too many in the company come off as interchangeable extras.\n\nThis is one problem that lends to the unevenness of this production. A bigger one lies in Kenny Leon's decision to bring in a contemporary perspective that is in conflict with the underlying \"truth\" of the place and time in which Our Town takes place.\n\nIt is hard to believe, for instance, that Grover's Corners, New Hampshire, in the earliest years of the twentieth century would be as racially diverse and as free of prejudice as this version is. It is hard to believe that an entire community would be adept enough at signing in order to be able to communicate respectfully with Howie Newsome, the milkman, played by deaf actor John McGinty. It is similarly hard to understand the use of religious Jewish, Muslim and Christian melodies (during what is otherwise a powerful opening) in a town in which we are specifically told of the locations of various Protestant and Catholic churches, with nary a synagogue or mosque mentioned.\n\nThere are, to be sure, some very affecting moments: the delicate courtship of George and Emily and the gentle landing and contemplative mood that comes in the third act cemetery scenes. But whatever Our Town is, it is not a universal story. It offers up a slice of one specific version of one segment of America, and it offers it up with a great deal of love and care, just as it is. And that should be enough.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 781,
  "archivePath": "data/archives/reviews/our-town-2024/talkinbroadway-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:28:07.466Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "sourceMethod": "brightdata"
}