{
  "showId": "our-town-2024",
  "outletId": "theaterlife-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://theaterlife.com/our-town-3/",
  "publishDate": null,
  "fullText": "October 25, 2024: The minute I walked in the door at the Ethel Barrymore Theatre to see director Kenny Leon’s much-lauded revival of Thornton Wilder’s beloved 1938 classic, Our Town, I could sense that something was off. October 25, 2024: The minute I walked in the door at the Ethel Barrymore Theatre to see director Kenny Leon’s much-lauded revival of Thornton Wilder’s beloved 1938 classic, Our Town, I could sense that something was off. Beowulf Boritt’s lovely set, visible on the curtainless stage, shows a huge wall of wooden planks, with a door set into it up center. Overhead hangs an exquisite mobile of lantern-like amber instruments (atmospheric lighting by Allen Lee Hughes), like a galaxy of stars in the firmament. Striking, yes, but, as anyone familiar with the play knows, Wilder, influenced by traditional Chinese theater, insisted there be no scenery, only whatever spare furnishings are needed for seating and the like. Typically, the show is set against a brick wall, with sawhorses used to create tables. As becomes clear, the set and lights, however attractive, prove less effective than the simpler approach asked for by the playwright. For example, when Emily and George talk to each other from their windows, Wilder has them do it while standing high up on ladders; here, they open small windows high on the rear wall to converse, a far more literal approach. In the cemetery scene, traditional performances arrange rows of chairs on the stage floor for the buried townsfolk. In this production, they’re arranged across a multi-tiered platform placed upstage for just this scene. An added feature is the two small seating areas at either side for onstage audience members. Then the cast enters (many from the aisles, as during the play proper), singing the Hebrew prayer, “Shema Israel,” which morphs into Muslim and Christian themes in an arrangement by Abraham Jam called “Braided Prayer.” Jewish and Muslim music? Our Town is a play whose narrator, the Stage Manager (Jim Parsons, Mother Play), clearly notes all the religious denominations present in Grover’s Corners, the fictional, idyllic New Hampshire town where the play is set at the turn of the 20th century; although ecumenical in spirit, he never once mentions any non-Protestant or Catholic place or form of worship. Grover’s Corner was not New York City. Obviously, regardless of logic or historical accuracy, Leon seeks to emphasize a universal theme of man’s spiritual unity in Grover’s Corners, also demonstrated in his interracial casting, despite Wilder’s failure to mention any races other than white. It’s a choice that, anachronistic as it is, serves to remind us that things in America were not always thus, and, in fact, still aren’t (the Black population in New Hampshire now is about 10%). Just as in my own production of Our Town at Brooklyn College in 1996, the Gibbs family of Dr. Gibbs (Billy Eugene Jones), Mrs. Gibbs (Michelle Wilson), and Rebecca Gibbs (Safiya Kaijya Harris) is African American, while the Webb family of Mr. Webb (Richard Thomas), Mrs. Webb (Katie Holmes), Emily (Zoey Deutch), and Wally (Hagan Oliveras) is white. Such a choice, more acceptable today than in the 1930s—and perhaps even expected in this age of colorblind casting—doesn’t necessarily extend to things like the costumes, designed by Dede Ayite. These are represented by a puzzlingly eclectic mélange of clothes from throughout the 20th century. They’re presumably aimed at capturing the timelessness of Wilder’s subject matter, made so evident in those expository, Wikipedia-like speeches about the town delivered in Act One. But the play’s timelessness is made far more apparent by replicating the extremely explicit world of 1901-1913 Grover’s Corners crafted in Wilder’s immortal poetic prose. His words want us to recognize how things were at a specific time and place, based on which we can ponder the larger thoughts expressed in the Stage Manager’s monologues. So, amid the several garments very loosely suggestive of early 20th-century garb, we get—to cite just a few—a tank-top undershirt for the muscularly pumped-up George Gibbs (Ephraim Sykes) when visiting the Webb house on the morning of his wedding; a flared miniskirt showing off the graceful gams of Emily (Zoey Deutch); and, among other questionable choices, a navy-blue ensemble of sleeveless, close-fitting shirt and skintight shorts for newsboy Howie Newsom (John McGinty). Most egregious of Leon’s directorial decisions is having the Stage Manager serve almost like a dedicated station master determined to keep the trains running on time. Parsons, speeding up his familiar sing-song Texas lilt, moves the action along as if he needed to get us out of the theater so we could make it home on time. At an hour and 40 minutes, this must be the fastest Our Town on record. When Acts One and Two end, the Stage Manager simply announces the fact (omitting Wilder’s mention of an intermission), and we chug immediately into the following scene. In a rare nod to Wilder’s wishes, all hand props are mimed, so I wouldn’t have been surprised to see Parsons sneaking peeks at an imaginary pocket watch. Since Wilder has a stage direction directing the Stage Manager, hearing a train’s whistle, do just that, maybe Parsons did it and I simply missed it. This fleet pacing infects much of the acting, robbing many speeches and conversations of the kind of down-home, cracker barrel honesty required. Everyone seems more intent on performing than being, and the dialogue often sounds more rhetorical than natural. Despite a cast including highly regarded actors, not one managed to touch any of my emotional buttons. The well-loved talents of one my favorite comic actresses, Julie Halston, playing the minor role of Mrs. Soames to the max, are duly noted by Leon’s finding ways—watch that special on her in the cemetery—to highlight her stylishly coiffured, blonde presence. These, however, only draw attention to their obviousness. Of all the performances, Jim Parsons’s is the biggest letdown, lacking in relaxed gravitas, kindness, believable practical and philosophical wisdom, and folksy, humorous sincerity. Zoey Deutch’s rendering of Emily’s big speech about clocks ticking is no better than many of those I’ve heard over the years from student actresses. Richard Thomas and Katie Holmes, polished as they are, fail to capture the everyday reality of Mr. and Mrs. Gibbs. Similarly, the Gibbs family—Michelle Wilson, Billy Eugene Jones, Ephraim Sykes, and Safiya Kaijya Harris—is more actorish than convincing. Kenny Leon’s directorial intrusions and innovations include making Howie Newsome deaf and having multiple characters communicate with him in ASL. He also has the local historian, Professor Willard (Shyla Lefner), described by Wilder as “a rural savant, pince-nez on a wide satin ribbon,” played with little conviction as a fashionably dressed, modern woman. And when the Congregational Church choir sings under the command of the demanding, alcoholic Simon Stimson (Donald Webber, Jr.), they do so with the harmonic perfection of the Mormon Tabernacle Choir. Regardless, Wilder’s brilliant playwriting shines through, reaffirming my widely held conviction that this is America’s greatest play. The scene at the cemetery, even if not as well-acted as I would have hoped, is masterfully crafted and moving, even if not as deeply as is possible. And while the acting remains ordinary and the scenic design rubs against Wilder’s grain, you can’t deny the show’s inherent appeal, or Leon’s ability to fetch attention. This production may not be my vision of Our Town, but from what I’ve heard, it may very well be yours. Our TownEthel Barrymore Theatre243 W. 47th Street, NYCThrough January 19, 2024Photography: Daniel Radar",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1247,
  "archivePath": "data/archives/reviews/our-town-2024/theaterlife-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:28:15.614Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}