{
  "showId": "our-town-2024",
  "outletId": "thefrontrowcenter-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://thefrontrowcenter.com/2024/10/our-town/",
  "publishDate": null,
  "fullText": "Posted by Stanford Friedman | Oct 16, 2024 | Reviews\n\nEphraim Sykes, Richard Thomas and Zoey Deutch in OUR TOWN. Photo: Daniel Rader\n\nVery few works in the English language can credibly be described as timeless, but none is more deserving of the term than Thornton Wilder’s 1938 lesson on life, Our Town. It is a play about many things, indeed it is a play about everything, but the movement of time itself is this Pulitzer-winning drama’s top concern, calling out our failure to appreciate life as it speeds by, and our stubborn inability to cope when the book of days inevitably slams shut.\n\nWilder wrote with such clarity, authority and wisdom that his words refuse to grow stale. They resist the need for scenery and deep characterization, making Our Town an actor-proof work that is as effective at the smallest of community theaters as it is on Broadway. Given its universal themes, the play is also resistant to reinterpretation, but in this new and densely populated staging at the Barrymore Theatre, director Kenny Leon gives it his best shot.\n\nTime and place are unmoored in Our Town and Leon lands his 28 member multiracial cast down in a 1901 version of Grover’s Corners, New Hampshire that is futuristic in its inclusiveness; a world that is a wish, where interracial romance is de rigueur and every citizen is fluent in sign language. There is also musicality. As the cast assembles, Abraham Jam’s  “Braided Prayer” is played. It is a spiritual melody that weaves together Muslim, Jewish and Christian invocations, bringing Hebrew to New Hampshire. The song sets a tone that does not especially sync with the rest of the evening, though it strikes a chord whenever the play reaches back into the biblical realm, as when we are reminded, “Babylon once had two million people in it, and all we know about ’em is the names of the kings and some copies of wheat contracts.”\n\nOur narrator, the omniscient and no-nonsense Stage Manager, is portrayed by Jim Parsons. Though lacking the proper gravitas for the role (especially if compared to prior Broadway runs featuring a 78-year-old Paul Newman in 2003 and the ageless Spalding Gray in 1989), Wilder’s turn of phrase steers Parsons through deep waters, inducing tears as he observes, “This is the way we were: in our growing up and in our marrying and in our living and in our dying.”\n\nLove is more an ideal than a passion in Our Town so if Zoey Deutch as Emily and Ephraim Sykes as George lack a certain spark it only serves to underscore how emotions can be taken for granted until it is too late to act upon them. Circling around the young couple, the capable supporting cast includes Julie Halston, displaying her always keen sense of humor in the chatty role of Mrs. Soames, a fine Donald Webber, Jr. as the troubled choir director, Simon Stimson, Richard Thomas, deep in his wheelhouse as the folksy and smart father of Emily, and John McGinty, a deaf actor who adds a hundred shades of complexity to the usually thankless role of Howie Newsome, the milkman. Meanwhile, the romance between George’s parents (Billy Eugene Jones and Michelle Wilson) is never less than touching and very nearly crushing when, late in the play, the widower doctor lays flowers at his wife’s grave, as she looks on from beyond.\n\nThe design team is on point with the masterful scenic designer Beowulf Boritt teaming with lighting designer Allen Lee Hughes to create a stunning cloud of floating, softly glowing lanterns that stretch from the town cemetery, up and past the proscenium and out into the house where they hang over the audience like the ghosts of ancestors. There are so many townsfolk to look at and so many ideas to linger over here, but the ultimate irony of this production is that it feels rushed. Hurrying to get three acts into 105 minutes, Leon&#8217;s pacing is often breathless and time, despite what Wilder tries to teach us, zooms past in a flurry.\n\nOur Town &#8211; By Thornton Wilder, directed by Kenny Leon\n\nWITH: Jim Parsons (Stage Manager), Zoey Deutch (Emily Webb), Katie Holmes (Mrs. Webb), Billy Eugene Jones (Dr. Gibbs), Ephraim Sykes (George Gibbs), Richard Thomas (Mr. Webb), Michelle Wilson (Mrs. Gibbs), Julie Halston (Mrs. Soames), Donald Webber, Jr. (Simon Stimson), Ephie Aardema Sarnak, Heather Ayers, Willa Bost, Bobby Daye, Safiya Kaijya Harris, Doron JéPaul, Shyla Lefner, Anthony Michael Lopez, John McGinty, Bryonha Marie, Kevyn Morrow, Hagan Oliveras, Noah Pyzik, Sky Smith, Bill Timoney, Ricardo Vázquez, Matthew Elijah Webb, Greg Wood and Nimene Sierra Wureh.\n\nScenic design by Beowulf Boritt, costume design by Dede Ayite, lighting design by Allen Lee Hughes, sound design by Justin Ellington, hair, wig & makeup design by J. Jared Janas. The Barrymore Theatre, 243 West 47th St., 212-239-6200, OurTownBroadway.com. Through January 19. Running time: 1 hour, 45 minutes\n\nWith an MLS in Library Science from Rutgers and an MFA in Creative Writing from Columbia, Stan’s published works range from the technical to the abstract. He has written cover stories and reportage for Library Journal, obituaries for The Times of London, over 200 cookbook reviews for Publishers Weekly, and dozens of TV and theater reviews for New York Press. Prior to his current career, he worked a variety of theatrical odd jobs ranging from clerk at the Drama Book Shop to a roving Renaissance festival bloodletter to Special Effects Technician for the original Off-Broadway production of Little Shop of Horrors. Follow him on Twitter: @BroadwayCrit and Show-Score.\n\nOpening Night Our Criteria Get our reviews by email\n\nJoin our mailing list to receive the latest news and updates from our reviewers.\n\nJoin our mailing list to receive the latest reviews from the Front Row Center. We will email you all of the reviews twice weekly.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 974,
  "archivePath": "data/archives/reviews/our-town-2024/thefrontrowcenter-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:35:16.525Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241211112835",
  "archiveOrgUrl": "http://web.archive.org/web/20241211112835/https://thefrontrowcenter.com/2024/10/our-town/"
}