{
  "showId": "les-miserables-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2014/03/24/theater/les-miserables-returns-to-broadway.html?smid=tw-nytimesTheater&seid=auto&_r=0",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/03/24/theater/les-miserables-returns-to-broadway.html?smid=tw-nytimesTheater&seid=auto&_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "fullText": "While I was watching the new revival of “Les Misérables,” it occurred to me that this beloved stage adaptation of Victor Hugo’s novel may have helped pave the way for the pop singing contests that have proliferated across the globe in this century.\n\nMuch like those televised competitions — “American Idol” and “The Voice” being the national brand leaders — “Les Misérables” presents audiences with a stage full of singers who, one by one, have a chance to step into the spotlight (in this case a very smoke-suffused one) and astonish us with the mighty heft and range of their voices. The through-sung score, by Claude-Michel Schönberg and Alain Boublil (the English lyrics are by Herbert Kretzmer), boasts a passel of throat-searing numbers that build to rousing climaxes. Theatergoers at the reviewed performance cheered as if they were indeed at a sing-off featuring fresh-faced young performers singing pop favorites with all the dazzling flourishes they could muster.\n\nAs pretty much everyone by now knows, the musical dramatizes the elaborate tale of an unfortunate French guy who stole a loaf of bread and lived to regret it. The production that opened at the Imperial Theater on Sunday night, returning the show to Broadway to capitalize on the popularity of the recent movie version, gives it an update of sorts. The original London staging by John Caird and Trevor Nunn, with its famous turntable set, has been set aside in favor of a new one, directed by Laurence Connor and James Powell, with nothing spinning around except maybe the drunken revelers at the tavern. (A short-lived revival that came to Broadway in 2006, just three years after the long-running original closed, was a facsimile of that production.)\n\nWhat’s that French saying? Plus ça change, plus c’est la même chose. “Les Misérables” does not provide a director much leeway to tinker with its firmly typed good-guy bad-guy characters and its heaving, melodramatic plot. Casting and matters of crowd control are of paramount importance.\n\nTrue, the sets by Matt Kinley, augmented by his “image design” drawn from the paintings of Hugo himself, seem aimed squarely at mimicking aspects of the cinematic experience. There are several atmospheric video sequences projected onto a screen at the back of the set, for example, so that we can follow Jean Valjean (Ramin Karimloo) as he slogs through the Paris sewers with the wounded young Marius (Andy Mientus) on his back. Mr. Kinley’s design also features lots of distressed-looking wood sprouting beyond the proscenium to encompass the boxes that flank the stage.\n\nScenic tweaking aside, and an orchestra shrunk to 20 from 27, this “Les Miz” will offend none of the musical’s fans with any directorial innovations, and will give them a chance to assess how a new generation of performers meets the challenges of the score. The big winners, happily, were the actors playing the dominating roles of hero and villain: Mr. Karimloo as the bread stealer, single father, long-sufferer and future saint; and Will Swenson as Javert, dogged pursuer of said hero and general scourge to all noble causes and pure hearts.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 539,
  "archivePath": "data/archives/reviews/les-miserables-2014/nytimes--unknown_2026-02-07.html",
  "textFetchedAt": "2026-02-07T13:51:15.979Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203934",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203934/https://www.nytimes.com/2014/03/24/theater/les-miserables-returns-to-broadway.html?smid=tw-nytimesTheater&seid=auto&_r=0",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 539,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T11:09:57.968Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text cuts off mid-sentence and ends with an error message about enabling JavaScript and verifying access, indicating this is incomplete/corrupted web content rather than a complete review.; openai: The text ends with a message indicating trouble retrieving the article content, suggesting it is incomplete or an error page.",
  "promptVersion": "5.2.0",
  "bwwExcerpt": "\"...this \"Les Miz\" will offend none of the musical's fans with any directorial innovations, and will give them a chance to assess how a new generation of performers meets the challenges of the score. The big winners, happily, were the actors playing the dominating roles of hero and villain: Mr. Kari...",
  "duplicateTextOf": "nytimes--charles-isherwood.json"
}