{
  "showId": "hamilton-2015",
  "outletId": "as-her-world-turns",
  "outlet": "As Her World Turns",
  "criticName": "Erica Meyer",
  "url": "http://www.asherworldturns.com/winter-2015-16-nyc-theater-guide/",
  "publishDate": "January 7, 2016",
  "fullText": "Theater is one of my favorite things, so even though this is a travel blog I can’t help but occasionally veer off-topic to review the plethora of shows I see. Such is the nature of this post. In December I saw ten shows in NYC (five on Broadway, five off-Broadway) and I’d love to tell you all about them. In chronological order, here we go… Important Hats of the Twentieth Century by Nick Jones (off-Broadway) This farce of epic proportions is a hysterical journey from beginning to end; it induces belly laughs and chortles in frequent intervals. Basic premise: two dueling fashion designers in the 1930s are eager to out-design the other. When one of them gets his hands on a piece of headgear that allows time travel, he jumps to 1998 to steal such fashion gems as skater jeans and hoodies and bring them back to the 1930s. Carson Elrod and Matthew Saldivar lead a cast of nimble ensemble members taking on multiple roles as they tell an epoch tale (pun intended) that runs the gamut from cavemen to Elizabethan royalty to hipsters. Director Moritz von Stuelpnagel earns kudos for pacing such whirlwind action. Worth noting: it’s written by Nick Jones, a playwright I’ve much admired since catching a stellar production of Trevor in LA last spring. Jones is also a writer on Orange is the New Black and penned the play Veritas at Lincoln Center last year. He is on my radar and I look forward to his future work. A View from the Bridge by Arthur Miller (Broadway) This lauded production is a UK transplant helmed by Belgian director Ivo van Hove, who is known for his minimalist staging. His sparse style works its magic on this Arthur Miller classic, stripping down the play to just its text with no props or set dressings. The action takes place in what looks like a boxing ring. There are no distractions of actors playing pretend over a dinner table or seaside docks; they simply face each other and deliver their lines, which heightens each moment of tension as patriarch Eddie Carbone becomes increasingly suffocating towards the niece he’s raised since birth. His inappropriate feelings and jealous rage boils to the surface as the niece enters a relationship with a cousin visiting from Italy. Mark Strong delivers a memorable turn as Eddie; the rest of the cast members more than hold their own. Hint: spring for the on-stage seating. If you’re under the age of 35, become a LincTix member and get those ringside seats for $30. Daddy Long Legs by Paul Gordon & John Caird (off-Broadway, live webcast) This was a theater first — producer Ken Davenport is known for taking risks (remember when he crowd-funded the Godspell revival years ago, before crowd-funding was even a thing?) and he takes a big one here: he paid to broadcast this off-Broadway musical LIVE for free without any commercials. It was an experiment to see what kind of audience would watch and perhaps, in the future, pay to subscribe for the right to stream similar theatrical events. And the result? Quite the world-wide audience tuned in. Ken has analyzed the data, as he does so well in his regular blog posts, to show how the numbers played out. He doesn’t anticipate a huge bump in the show’s box office because so many people who viewed the broadcast live outside the New York City area, but by making this show accessible it should help cast album sales and increase its odds of regional productions. I watched the whole thing because I was curious — would it be a quality broadcast in terms of directing? (They did a simple multi-cam set-up with maybe three cameras and, in general, cut to whomever was singing — it wasn’t fancy direction but it worked, and I’m sure was more budget-friendly than an elaborate multi-cam production.) Would there be technical hiccups? (Nope; the live broadcast began just a few minutes after its projected 8pm start time and I had no issues streaming it.) Extras: they rolled bonus interview footage with the cast and creative team during intermission, and ended the evening with a Q&A after curtain call. It was a fully produced evening of theater for FREE. Now for the only downside, and it’s a big one: I really did not like the show itself. It chronicles an epistolary romance between a teenage girl and the young gentleman who offers to pay for her schooling on the condition that she write him regular letters (which he will not return) and that his identity remain anonymous. And of her own accord, she calls him Daddy (Long Legs). What…? The whole time the teenage girl thinks that her benefactor is very old when he’s really only a few years her senior. But that doesn’t make it any less creepy. I hate that this is a story in which the male figure has all the power and the female figure is in a subservient position. I found the music forgettable (it all sounds so similar, like the same few songs are on repeat) and that was a bummer. But I saved myself a trip to New York and it cost me nothing. So it’s hard to complain, and I want to stress how neat I think it is that Ken Davenport took a gamble on this broadcast. I look forward to seeing how things develop from here now that Daddy Long Legs has set the bar. Steve by Mark Gerrard (off-Broadway) This show was a total treat. I bought a ticket knowing very little about it other than it earned rave reviews, which was good enough for me. The tagline reads, “When midlife crisis meets Marie’s Crisis,” referring to a musical theater bar in the West Village. It’s about five friends — two gay couples and their lesbian friend, who is dying of cancer. There is tension between the two couples because of a recently discovered infidelity. The performance is a mixture of book scenes and cabaret performances — in fact, when I took my seat five minutes before show time, there was already a pre-show song set in progress — and there are constant references to musical theater that made me so, so happy. But don’t let the lightness of show tunes lull you into thinking this will be a happy-go-lucky show — there are moments of intense anger, fragility, and tenderness. It features the best death bed scene I’ve ever witnessed in the theater; I’m getting weepy just thinking about it now. And the number of laugh-out-loud moments are too numerous to count. This show was such a surprise delight that I immediately called a good friend upon leaving the theater to tell him he just HAD to see it before it closed. I am so grateful I took a chance on this one; I hope it has a future elsewhere after this run, perhaps regionally? Invisible Thread by Griffin Matthews and Matt Gould (off-Broadway) This show got rave reviews at its out-of-town run at ART in Cambridge (under its former title, Witness Uganda) and I made note to see it in New York. It’s about a young man who volunteers in Uganda and the becomes so invested in helping out the local teenagers there that he and his boyfriend back home begin a charity to pay for these kids’ educations. They are both theater artists so this show was originally born out of a benefit concert to raise money for the kids and has morphed into a full-on musical documentary following their journey. Its music is vibrant and there are a handful of numbers I will eagerly download should they receive funding to produce a cast album; the audience burst into applause mid-song on one occasion. But the story itself is missing something. I wonder what the show would be like if they had started from scratch to tell a story about these kids without trying to mirror what happened in real life? I have the same issue when other art forms (movies, books, etc.) do this, too — cling to the details of a real-life event when there is probably a more compelling way to get across the same message through dramatic license instead of telling the story beat-for-beat the way it actually unfolded. That said, these guys have put together a show they should be proud of. As someone who has been to Uganda, it was depicted very realistically on-stage, right down to the orange-pink color of the bright dirt there. I also appreciate that this creative team wrote a social issue musical as a way to promote a charity and actually help people. Fun fact: I bought my Hamilton ticket last June and was counting down the days ’til December 19th. I was supposed to see it off-Broadway at The Public last January but had to give up my ticket since I ended up being in LA for work! But 11 months later I finally saw Hamilton. Hamilton by Lin-Manuel Miranda (Broadway) What can I say that hasn’t already been said about this lauded new musical, perhaps the best this art form has seen in decades? (Check out this article for a very humorous account written by someone who has just seen Hamilton for the first time.) It lives up to the hype. It is indeed brilliant. Even though I’ve been listening to the cast album non-stop since it was released in late September, and the album contains 98% of the show, there are still lots of fun visual surprises that blew me away. Composer, lyricist, and star Lin-Manuel Miranda seamlessly blends musical theater and hip hop in a wholly original way as he examines the legacy of America’s founding fathers and highlights parallels of the late 1700s and our world today. Hamilton reclaims America’s origin story as a victory for the immigrants who started our nation, a point driven home by the casting of Latino and African American actors as our founding fathers. The fact that this non-traditional casting is barely noticeable amidst the overwhelming genius of Hamilton speaks volumes. The show’s final number asks, “Who Lives, Who Dies, Who Tells Our Story?” This story belongs to the people on that stage and any other interpretation seems downright un-American. Hamilton is as epic as Les Mis and as relevant as a Jay Z album. It is nothing less than revolutionary (no pun intended). Mother Courage by Bertolt Brecht, with new music by Duncan Sheik (off-Broadway) Oh boy. The amount of drama surrounding this current production and its departing lead actress has become louder than the buzz I’m sure the creative team was hoping for when they set out to stage a new interpretation of this classic Brecht play. Mother Courage is typically set during World War II featuring a Caucasian cast (Meryl Streep and Olympia Dukakis have famously played the role) but this incarnation is set in the present-day Congo featuring an African American cast. Tony winner Tonya Pinkins takes on the titular role of a woman who will do anything for survival, even at the expense of sacrificing her own children to protect the cart of goods she pushes around to earn an income. Duncan Sheik (Spring Awakening) is credited for writing new music, though I fear his contribution to the project has been exaggerated since this show is about 5% music and 95% book scenes (note that about 60 minutes of material has been trimmed from the original Brecht play). Brechtian elements, which remind the audience to be actively aware that they are watching a play instead of passively getting caught up in the naturalism of scenes, are on full display — Tonya Pinkins greets the crowd in character a few minutes before show officially begins as she haggles with audience members to sell the cheap plastic watches lining the interior of her jacket. Actors play multiple roles, there are musical elements / songs to break up the action, characters break the fourth wall, an off-stage announcer moves plot along, actors physically enter the audience space to disrupt that barrier at times. But unfortunately, it did not amount to very much for me, and I found myself unmoved and even bored throughout the production. What a let down after seeing Hamilton earlier that afternoon! The show is still in previews so I knew it was a gamble, however the names involved — Brecht, Pinkins, Sheik — persuaded me to check it out. But it turns out that backstage drama has been brewing for weeks, and it all hit the fan just before New Years. Tonya Pinkins will depart the production on Jan. 3rd prior to the scheduled opening (which has since been pushed back to a date TBA) and they will recast a new leading actress. Tonya prepared a statement which her lawyer advised her not to release, but the following day it was supposedly leaked without her consent. It’s very much worth a read, especially if you are connected to the theater world — Tonya questions the right of a white creative team to tell a story about a black female without incorporating her input as a black woman (though upon reading more about the situation it sounds like the director did bend over to accommodate her views). Based on her statement and a response from the director — who’s also the artistic director of the producing theater, Classic Stage Company — it sounds like they started from a similar place but their perspectives diverged throughout rehearsals, ultimately leading to very different views on the character of Mother Courage and her role in this piece. Both statements are worth a read and thankfully don’t get too ugly given the understandably tense circumstances. Kudos to Tonya for elucidating a perspective that needs to be heard. (Update – this link contains relevant reactions from cast member Michael Potts regarding his observations from the rehearsal process.) King Charles III by Mike Bartlett (Broadway) This play is both original and classic in a way that blows my mind. The tag line is “A Future History Play” because it takes place following the death of the current Queen of England. It’s about Prince Charles stepping up to be King, and the challenges he grapples with — can he walk the line between honoring the tradition of his role while also using his power to do something meaningful? Other characters include Camilla, William, Kate, and Harry — we see how they both support Charles and then stab him in the back as he sorts out how to be an effective King. But I haven’t even told you the best part yet: this play is written in iambic pentameter, and never has Shakespeare felt so relevant. You know when you read Shakespeare, and it all sounds so… unrealistic? The grab for power and (literal) backstabbing? Well this play takes those themes and translates them to the 21st century monarch, with a little less bloodshed and death (though the play does begin with a funeral). You might imagine that the use of iambic pentameter would start off clever and then lose its charm, but the opposite happens — this speech pattern adds weight to the characters’ lines which feels increasingly fitting as the intensity rises. The Color Purple book by Marsha Norman, music & lyrics by Brenda Russell, Allee Willis, Stephen Bray (Broadway) Just like with Hamilton, I splurged on a full-price ticket to this show, which is something I rarely do — I am the queen of theater discounts. But I could not miss the chance to see this powerful story given a first class Broadway revival under the direction of John Doyle, starring the enormously talented and buzzed about Cynthia Erivo from the UK, as well as Oscar winner Jennifer Hudson. It’s the third time I’ve seen this musical since it premiered a decade ago — I saw the national tour starring Fantastia, and then a small-scale, intimate production at Celebration Theater in LA. And both times I walked out blown away by the power of Celie’s story. I’ve not read the Alice Walker novel, nor seen the Spielberg-directed film, but holy cow does this story pack a powerful emotional wallop. Listen to the laundry list of horrors bestowed upon Celie: she is sexually abused by her stepfather, her babies are given away without her consent, she is sold into marriage by a man who abuses her in every way, her beloved sister is sent off to Africa and Celie is left to believe she has died, and all the while everyone around her tells Celie how ugly she is. She cannot catch a break. Even lounge singer Shug Avery notes, “God’s taking his sweet time getting to you” during one of her visits; Celie notes that if God were a black woman this world would be a very different place. But emboldened by the fierce determination of the strong black women around her, Celie rises up and puts her husband in his place. She reconnects with her sister and finds her now-grown children. She starts her own tailor business and begins a relationship with Shug (Jennifer Hudson). And she sings, “I don’t need you to love me… I am beautiful, yes I’m beautiful, and I am here.” It’s among the most powerful stories I’ve ever seen on stage, and if you’re not ugly crying by the end of the show, then you have no soul. Noises Off by Michael Frayn (Broadway) This is a very funny play that, like The Color Purple, I have now seen a total of three different incarnations over the past decade — it is wildly funny, and has proven popular with regional theaters. I was tempted to skip this Roundabout revival but the exciting cast announcement persuaded me to buy a ticket — Andrea Martin, Megan Hilty, Rob McClure, Jeremy Shamos, Tracee Chimo, Kate Jennings Grant. Unfortunately, I saw an early preview the day after Christmas and Andrea Martin was out for a previously scheduled engagement. But the show is in good shape this early in the run considering the amount of pratfalls and remarkable physical precision required for every scene. It’s a backstage comedy about a play within a play — we watch actors rehearse a scene during their final dress rehearsal as the director (who is placed in the actual audience) stops and starts them to clarify blocking and prop movement, etc. We (the audience) learn how the scene is supposed to go, so when the actors majorly screw everything up during the first performance, we understand the nuances of what went wrong. Then there is backstage drama of actors hooking up and jealous exes, and the stage manager who is pregnant with the director’s baby even though he’s sleeping with the bimbo supporting actress. I don’t know if I’m doing the plot justice because it’s borderline too complex to describe here, but it really pays off when you see it in person. In fact, if you hear of it playing at a theater near you, I promise it will be a very enjoyable evening. This particular production is still tightening things up and I am sure it will be better by the time they open (and I bet Andrea Martin adds a lot). I’m glad I got to preview it. Marjorie Prime by Jordan Harrison (off-Broadway) Easily among the best plays I saw this year, and I was moved to do something I’ve never done before — purchase a copy of the play on my way out of the theater because I loved it so much. It takes place around the year 2060 (at which point young people supposedly don’t know who Beyonce is, which I find more unbelievable than the futuristic concept of ‘prime’ I’m about to explain). An elderly woman named Marjorie has dementia and her family acquires the latest technology to improve her final years — a ‘prime’, which is a robot-type figure who takes on the identity of a lost loved one. In this case it’s Walter Prime, made in the likeness of Marjorie’s deceased husband. Over conversations with Marjorie (and her daughter and son-in-law) the prime learns to accurately be just like Walter. The quality of Marjorie’s life improves as she now has a companion who shares her memories and interacts with her every day. Marjorie’s daughter is skeptical and a little creeped out, but admits that it’s good for her mom. In the next scene, we find out that Marjorie has died, and now a prime version of her has been created to help her daughter cope with the loss of her mom. In the final scene, the daughter has died, and her prime is now living with her husband as he navigates losing a spouse. The play is a meditation on the struggle of loss, and how we keep people alive in our memory after they leave us. If you’ve experienced the death of a loved one this play will really hit home. The actors (especially the daughter and son-in-law) are on the verge of tears most of the play, as the dialogue and reality of the situation — conversing with a prime of the recently deceased — is such an extraordinary thing. I will remember this play for a long time.",
  "showScoreExcerpt": "\"What can I say that hasn't already been said about this lauded new musical, perhaps the best this art form has seen in decades? It lives up to the hype. It is indeed brilliant...Composer, lyricist, and star Lin-Manuel Miranda seamlessly blends musical theater and hip hop in a wholly original way...'Hamilton' is as epic as 'Les Mis' and as relevant as a Jay Z album. It is nothing less than revolutionary.\"",
  "originalScore": null,
  "assignedScore": 79,
  "source": "show-score",
  "sourceUrl": "https://www.show-score.com/broadway-shows/hamilton",
  "sourceMethod": "playwright",
  "scoreSource": "sentiment-strong-positive",
  "scoreConfidence": "medium",
  "llmScore": {
    "score": 79,
    "confidence": "medium",
    "range": {
      "low": 74,
      "high": 84
    },
    "bucket": "Positive",
    "thumb": "Up",
    "components": {
      "book": null,
      "music": null,
      "performances": null,
      "direction": null
    },
    "keyPhrases": [],
    "reasoning": "[ensemble-majority] | 2/3 models agree: Positive | Claude: This is a multi-show review with varied reactions - strong enthusiasm for some shows like 'Steve' and 'Important Hats', mixed feelings on others like 'Invisible Thread', and dislike for 'Daddy Long Legs'. The overall tone suggests selective recommendations rather than a clear positive or negative stance. | GPT-4o: The critic expresses strong enthusiasm for 'Steve', describing it as a 'total treat' and a 'surprise delight', and even urges a friend to see it. This indicates a strong positive recommendation. | Gemini: The review expresses appreciation for the show's music, realism, and social impact, but also notes that the story is \"missing something.\" This suggests a positive but not enthusiastic recommendation.",
    "flags": {
      "hasExplicitRecommendation": false,
      "focusedOnPerformances": false,
      "comparesToPrevious": false,
      "mixedSignals": false
    }
  },
  "llmMetadata": {
    "model": "ensemble:claude-sonnet-4-20250514+gpt-4o+gemini-2.0-flash",
    "scoredAt": "2026-02-01T23:58:42.981Z",
    "promptVersion": "5.1.0",
    "inputTokens": 0,
    "outputTokens": 0,
    "previousScore": 77,
    "previousVersion": "3.0.0"
  },
  "ensembleData": {
    "claudeScore": 62,
    "openaiScore": 82,
    "geminiScore": 75,
    "claudeBucket": "Mixed",
    "openaiBucket": "Positive",
    "geminiBucket": "Positive",
    "scoreDelta": 20,
    "thumbsMatch": null,
    "expectedThumb": null,
    "needsReview": false,
    "needsReviewReasons": [],
    "ensembleSource": "ensemble-majority",
    "modelAgreement": "2/3 models agree: Positive"
  },
  "archivePath": "data/archives/reviews/hamilton-2015/as-her-world-turns--erica-meyer_2026-01-26.html",
  "textFetchedAt": "2026-01-26T22:25:11.731Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "rescoreReason": "scored on brief excerpt, now has fullText",
  "previousLlmScore": 97,
  "rescoreCompletedAt": "2026-01-29T01:55:56.721Z",
  "contentTier": "complete",
  "wordCount": 3552
}
