{
  "showId": "hamilton-2015",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.ew.com/article/2015/08/06/hamilton-ew-stage-review",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n'Hamilton': EW stage review\n\nBy\n Leah Greenblatt\n \n\n\n\n\n\n\n \n\nLeah Greenblatt\n\n\n\n\n \n\n\n \n\n \nLeah Greenblatt is the former critic at large for movies, books, music, and theater at Entertainment Weekly. She left EW in 2023.\n\n\n\nEW's editorial guidelines\n\n\n\nAugust 6, 2015 12:00 p.m. ET\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nREACT\n\n\n\n\n   \n\n\n\n\n   \n\n\n\n\n   \n\n\n\n\n   \n\n\n\n\n   \n\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\n\n \n Credit: Joan Marcus\n\n What even the most patriotic American knows about Alexander Hamilton can probably be scrawled across his face on the 10-dollar bill, and how much we care about his backstory could be inscribed on a dime. He created the country’s first regulated banking system and established tariffs to fund the national debt, you say? Scintillating!\n\nIn fact, though, his life was the stuff dramaturgy dreams are made of, full of tragedy and intrigue, and Hamilton’s Tony-winning star/lyricist/composer Lin-Manuel Miranda (In the Heights) has turned a Founding Father’s largely forgotten narrative into one of the most joyful, kinetic, and extravagantly original musicals ever imagined for the stage.\n\nDrawing from Ron Chernow’s bestselling 2004 doorstop of a biography, Miranda tells what is essentially a classic immigrant tale: Born out of wedlock in the West Indies and orphaned by his teens, Hamilton arrived in the nascent United States in 1772 and swiftly became a rising star on George Washington’s military staff. So far, so junior-high history class, at least on paper. But nearly every moment here is told via song — dense, syntactically dazzling compositions forged from the snap-crackle cadences of pop, hip-hop and spoken word — and delivered by an electric cast whose mixed ethnicity feels less colorblind than color-defying.\n\nMiranda is Puerto Rican, and Hamilton’s friendly-rival-turned-assasin Aaron Burr is played by the outstanding black actor and Broadway veteran Leslie Odom Jr. Both Burr and George Washington (Christopher Jackson) have their heads clean-shaven, while Thomas Jefferson (Daveed Diggs) pairs his velvet britches with a buoyant halo of corkscrew curls. An argument at a Cabinet meeting about states’ rights plays out as a ratatat battle rap; “Ten Duel Commandments” pays clever tribute to The Notorious B.I.G.’s classic coke-slinging anthem “Ten Crack Commandments,” and references to contemporary slang and pop culture are slipped in slyly throughout, though their inclusion — and the occasional fourth-wall-breaking wink — never feels smug or disruptive.\n\nShowstoppers come on fast and furious; if there’s any complaint, it’s that some songs move too quickly to catch their nuances and appreciate Miranda’s heady, high-velocity rhyme schemes. But several numbers, including “It’s Quiet Uptown” and “The World Was Wide Enough” aren’t afraid to slow the story down for moments of hushed sincerity, and despite its happy anachronisms, Hamilton is still faithful to the larger scope of history. Miranda has one character acknowledge in a few witty words early on that the Founding Mothers hardly held equal status in public life, and they don’t here either.\n\nStill, the show provides a number of strong solo moments for female cast members, and Phillipa Soo and Renée Elise Goldsberry, as Hamilton’s wife and sister-in-law, respectively, bring both fierceness and fragility to keenly drawn supporting roles. Jonathan Groff appears for only a few brief minutes altogether, but his cameo may be the most indelible (and the most fun): Smothered in jewels and brocade and preening like an inbred Persian cat, he plays a fantastically camp King George, flouncing on and off stage to deliver supremely bitchy dispatches from England.\n\nAside from a series of lazy-Susan-like circles laid into the stage floor, the set is relatively simple, just bricks and scaffolding and the occasional piece of furniture or small prop to suggest a scene change. Some two dozen ensemble actors — clad in costumes that range from second-skin jodhpurs to full satin court dress — are what draw the eye, pulsing and swaying through propulsive choreography and often playing Greek chorus to the stars’ unfurling dramas.\n\nMiranda’s singular gift for storytelling and wordplay makes even the Federalist Papers sound sexy, but the play’s intrigue come mostly from its potent stew of friendship and romance and outsize ambition; it’s as if House of Cards were folded into a sort of Days of Our Colonial Lives fever dream, then filtered through the minds of Tupac and Sondheim. It’s that strange and that spectacular, and you’d be crazy to miss it. A",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 696,
  "archivePath": "data/archives/reviews/hamilton-2015/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:49:09.204Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "sourceMethod": "scrapingbee"
}