{
  "showId": "hamilton-2015",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "Frank Scheck",
  "url": "http://www.hollywoodreporter.com/review/lin-manuel-mirandas-hamilton-theater-774361",
  "publishDate": "February 17, 2015",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "There's rarely been a history lesson as entertaining as Lin-Manuel Miranda's new hip hop-infused musical about Alexander Hamilton, or, as the opening number puts it, \"The ten-dollar founding father without a father.\" Based on Ron Chernow's best-selling biography, Hamilton brings American history to musical-theater life in a style akin to the classic 1776, only with a hipper, more multi-cultural attitude. Currently enjoying a virtually sold-out off-Broadway premiere engagement at the Public Theater, where its run has already been extended twice before the official opening, the show seems inevitably destined for a Broadway transfer.Miranda, previously responsible for the 2008 Tony Award-winning musical In the Heights, is clearly enamored of his subject. In addition to writing the book, music and lyrics for the nearly three-hour show, he also plays the title role. And while he's had the audacity to cast Hispanic and black actors as the Founding Fathers commonly referred to as \"old dead white men,\" Miranda's work is remarkably faithful to the historical facts, imparting great amounts of information in such rollicking fashion that high school history teachers will find themselves profoundly grateful for the assist.",
  "showScoreExcerpt": "\"Having already become a cultural phenomenon in its off-Broadway premiere run earlier this year at the Public Theater, 'Hamilton' — written by and starring Lin-Manuel Miranda, who previously made a name for himself on Broadway with 'In the Heights' — seems a shoo-in for smash hit status and a slew of awards attention...The musical is a triumph.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HAMILTON-Opens-on-Broadway-Updating-LIVE-20150806",
  "dtliThumb": "Up"
}
