{
  "showId": "hamilton-2015",
  "outletId": "huffingtonpost-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.huffingtonpost.com/steven-suskin/aisle-view-smiling-man-on_b_7952484.html",
  "publishDate": null,
  "fullText": "Daveed Diggs, Okieriete Onaodowan, Anthony Ramos and Lin Manuel Miranda in Hamilton. Photo: Joan Marcus \"I am not throwing away my shot,\" leading man Lin-Manuel Miranda sings again and again and again over the course of Hamilton, the new instant-megahit musical with music, lyrics and book by the same Lin-Manuel Miranda. Miranda doesn't waste his shot, for sure, and scores an absolute bull's-eye. Hamilton is not just an excellent and rousing musical; it brings something new to the musical theatre, and does it so very compellingly that superlatives are in order. I--and I expect just about all my critical colleagues--would tell you to stop reading right now and get yer tickets, except there aren't likely many to be had for the next year or three. Alexander Hamilton was heretofore best known as the fellow etched in green on the ten-dollar bill; one of two major Founding Fathers--the other being Benjamin Franklin--who didn't get to become president; and the patriot who was killed by the then-sitting vice president of the United States, in a duel on a bluff overlooking the Hudson River. (To quote Miranda's Hamilton: \"Everything is legal in New Jersey.\") The playwright fills in the blanks, showing us an orphan bastard immigrant from the West Indies who underwent Dickensian hardship; emigrated to the colonies just in time for the Revolutionary War; and became General Washington's \"right hand man.\" He went on to help formulate the U. S. Constitution and--as President Washington's Secretary of the Treasury--devise the financial structure of the new nation. Miranda--perhaps to avoid tarring his hero, by association--does not bother to tell us that Hamilton also founded the New York Post. The magic of Hamilton comes from the manner of Miranda's storytelling. While the action remains in the proper era (which is roughly 1776-1804), the street-talking characters are not so much founding fathers but founding brothers with up-to-the-minute attitude. (Hamilton from Nevis and the Marquis de Lafayette from France, leading the Continental Army at the decisive Battle of Yorktown, stop to jointly exclaim: \"Immigrants! We get the job done!!\") As one might expect from the author of In the Heights, the new show incorporates a considerable amount of street rhythm and rap. While this was the musical base of In the Heights, Miranda herein displays that he is a top-level musical theatre writer. He utilizes rap for a purpose; it turns out that rapid-paced streams of verbiage are the perfect way to cram tons of necessary exposition into the show, rather than making us sit through speech after speech and book scene after book scene. This is faster, funnier, and far more effective. The music ranges from tuneful to exquisite (as in, particularly, \"Helpless\" and \"Satisfied\" for the two leading ladies, and the lullaby \"Dear Theodosia\"), so no harm done. What's more, Miranda demonstrates with numbers like King George's \"You'll Be Back\" and the explosively sinuous \"Room Where It Happens\" that he is an accomplished musical comedy writer, and no mistake. Hamilton catapults Miranda to the head of the class. While breaking new ground in the melding of theatre and contemporary music, Miranda has also managed to focus the national political spotlight on Broadway, and that's quite an accomplishment. He is abetted by excellent work from close collaborators Thomas Kail (director), Andy Blankenbuehler (choreography), Alex Lacamoire (orchestrations and musical direction) and designers David Korins, Paul Tazewell and Howell Binkley, all of whom make keen contributions to what is an instant classic. Daveed Diggs as Thomas Jefferson in Hamilton. Photo: Joan Marcus The supporting players are exceptional without exception. Anthony Ramos, Daveed Diggs and Okieriete Onaodowan--as Hamilton's Revolutionary buddies in the first act, and as his beloved son and two enemies (and future presidents) in the second--offer perfect performances, as does Christopher Jackson as Washington. (Diggs, though, stands out among them, with a marvelous Jefferson.) Hamilton, and Miranda, could hardly find better women in his life than Phillipa Soo (Natasha of The Great Comet) and Renée Elise Goldsberry (of Broadway's Good People and TV's \"Good Wife\"); both offer a stunning display of dramatic singing. Jonathan Groff (Spring Awakening and \"Glee\") is wonderfully droll as King George, who occasionally wanders on to offer malevolent discourse to his colonists (\"when push comes to shove, I will send a fully armed battalion to remind you of my love\"). Groff, who played more than half of the Hamilton run at the Public Theater, is the only major replacement; patrons who saw the show during the first five weeks downtown had the added treat of seeing Brian d'Arcy James in the role until he left for the new musical at the St. James. Sharing the spotlight with Miranda is Leslie Odom, Jr. as Aaron Burr. Odom, who made a powerful Broadway debut in Leap of Faith and appeared on TV's \"Smash,\" is Iago to Miranda's Othello; the author has seen fit, even, to give his villain material as strong as what he has written for himself. Hamilton--the character--is the center of attention, but Odom's Burr is the musical's sparkplug. \"Talk less, smile more,\" he counsels the young Hamilton early on, \"don't let them know what you're against or what you're for.\" Which is in some ways the model for the modern reactionary politician. The luckiest person involved, it seems, is Ron Chernow, author of the 2004 biography \"Alexander Hamilton.\" The book was a best-seller, which was its own reward, but Miranda happened to pick up a copy and latch on to it. Chernow suddenly has a Broadway hit and a major bonanza that he couldn't have reasonably expected. For that matter, Miranda's new musical is likely to make Alexander Hamilton more famous--to the public at large--than Presidents Adams and Jefferson combined. There's talk in Washington of displacing A. Ham. from the $10 greenback; even so, the man seems to have a considerably wider smile this morning. As for Miranda, I don't recall anyone writing music, lyrics & book and starring in a hit musical since George M. Cohan last gave his regards to Herald Square. Miranda's demonstration of talent, skill and savvy earn him a well-deserved gold star, and a goldmine too. Phillipa Soo and Lin-Manuel Miranda in Hamilton. Photo: Joan Marcus .Hamilton, with music, lyrics and book by Lin-Manuel Miranda, opened August 6, 2015 at the Richard Rodgers Theatre FAIR, FEARLESS REPORTINGSINCE 2005 By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1087,
  "archivePath": "data/archives/reviews/hamilton-2015/huffingtonpost-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:50:29.448Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}