{
  "showId": "hamilton-2015",
  "outletId": "nypost-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://nypost.com/2015/08/06/hamilton-isnt-quite-revolutionary/",
  "publishDate": null,
  "fullText": "Daveed Diggs (from left), Okieriete Onaodowan, Anthony Ramos and Lin-Manuel Miranda in \"Hamilton.\"\t\t\t\t\t\t\n\t\t\t\t\t\t\tJoan Marcus\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\tAt last, bipartisanship! “Hamilton” may be the only thing the Obamas and Cheneys ever agree on.\n\nBut then, there’s a lot of love for this energetic telling of the story of Alexander Hamilton, architect of the Treasury and founder of this newspaper, among other things. Its Public Theater run this spring was beyond sold out, and the show opened on Broadway Thursday night with a $30 million-plus advance. That’s a lot of Hams.\n\nLin-Manuel Miranda’s “In the Heights” may have been a hit — but his “Hamilton” is a phenomenon.\n\nMiranda, who wrote the score and book and plays the title role, deftly melds hip-hop, R&B, ’60s pop and traditional show tunes. Thomas Kail’s direction and Andy Blankenbuehler’s choreography is inventive and kinetic, suggesting the story is always in motion on the bilevel wooden set.\n\nBut “revolutionary” the show is not. Truly radical art is divisive, and under its brash exterior, “Hamilton” is warmly reassuring — a love letter to a land of opportunity where “The 10-dollar founding father without a father/Got a lot farther by working a lot harder/By being a lot smarter/By being a self-starter.”\n\nThis is all in the opening song, by the way, which is as heavily expository as most of the first act. In it we follow Hamilton’s involvement in the Revolutionary War and his lifelong connection with Aaron Burr (the charismatic Leslie Odom Jr.), who finally kills him in a duel.\n\nJust as important is Hamilton’s relationship with the Schuyler sisters: Eliza, whom he married, and the older Angelica, his soul mate. Phillipa Soo and Renée Elise Goldsberry, respectively, are sublime, and do heartbreaking justice to songs drawing from TLC-type hooks and R&B-styled soul-baring.\n\n“Hamilton” shines brightest when it gets into the characters’ heads and hearts, especially concerning our hero’s personal life — though those are the scenes in which Miranda’s limitations as an actor are obvious.\n\nLess effective is the history-with-a-capital-H stuff. Turning political debate into a rap battle is clever, but overall, Hamilton’s big-picture importance is diluted — what did that guy do, exactly?\n\nMore shrewd is Jonathan Groff’s slyly funny recurring turn as King George. Looking like an overgrown teenager in regal red and a crown, the British monarch taunts the young country: “You’re on your own./Awesome. Wow./Do you have a clue what happens now?”\n\nWell, America turned out to have a long, successful run. So, no doubt, will “Hamilton.”",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 414,
  "archivePath": "data/archives/reviews/hamilton-2015/nypost-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:54:07.426Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250505112047",
  "archiveOrgUrl": "http://web.archive.org/web/20250505112047/https://nypost.com/2015/08/06/hamilton-isnt-quite-revolutionary/"
}