{
  "showId": "hamilton-2015",
  "outletId": "nytimes-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2015/08/07/theater/review-hamilton-young-rebels-changing-history-and-theater.html?ref=theater&_r=0",
  "publishDate": null,
  "fullText": "https://www.nytimes.com/2015/08/07/theater/review-hamilton-young-rebels-changing-history-and-theater.html324Advertisement\n\nAt this point, it would be almost a relief to report that “Hamilton” — the musical that opened at the Richard Rodgers Theater on Thursday night — has shrunk beneath the bloat of its hype. Since it was first staged at the Public Theater this year, this brave new show about America’s founding fathers has been given the kind of worshipful press usually reserved for the appearances of once-in-a-lifetime comets or the births of little royal celebrities.\n\nDuring the past several months, while it was being pumped up and trimmed down for its move from the East Village to Broadway, Lin-Manuel Miranda’s rap-driven portrait of the rise and fall of Alexander Hamilton (this country’s first secretary of the Treasury) has been the stuff of encomiums in both fashion magazines and op-ed columns. A friend of mine recently said that there were three subjects she never wanted to see in a newspaper again: Caitlyn Jenner, the Harper Lee novel “Go Set a Watchman” and “Hamilton.”\n\nEven I, one of the many critics who enthused about “Hamilton” in February like a born-again convert in a revival tent, was beginning to think, “Enough already.” Then I saw the show at the Richard Rodgers.\n\nWhat’s the story behind a show that’s become a Broadway must-see with no marquee names, no special effects and almost no white actors? Erik Piepenburg explains, in six snapshots, why “Hamilton” has become such a big deal.\n\nI am loath to tell people to mortgage their houses and lease their children to acquire tickets to a hit Broadway show. But “Hamilton,” directed by Thomas Kail and starring Mr. Miranda, might just about be worth it — at least to anyone who wants proof that the American musical is not only surviving but also evolving in ways that should allow it to thrive and transmogrify in years to come.\n\nA show about young rebels grabbing and shaping the future of an unformed country, “Hamilton” is making its own resonant history by changing the language of musicals. And it does so by insisting that the forms of song most frequently heard on pop radio stations in recent years — rap, hip-hop, R&B ballads — have both the narrative force and the emotional interiority to propel a hefty musical about long-dead white men whose solemn faces glower from the green bills in our wallets.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "CRITIC'S PICK\n\"Yes, it really is that good...I am loath to tell people to mortgage their houses and lease their children to acquire tickets to a hit Broadway show. But 'Hamilton,' directed by Thomas Kail and starring Mr. Miranda, might just about be worth it — at least to anyone who wants proof that the American musical is not only surviving but also evolving in ways that should allow it to thrive and transmogrify in years to come.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 416,
  "archivePath": "data/archives/reviews/hamilton-2015/nytimes-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:36:41.915Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250119032443",
  "archiveOrgUrl": "http://web.archive.org/web/20250119032443/https://www.nytimes.com/2015/08/07/theater/review-hamilton-young-rebels-changing-history-and-theater.html?ref=theater&_r=0"
}