{
  "showId": "hamilton-2015",
  "outletId": "thr",
  "outlet": "The Hollywood Reporter",
  "criticName": "Frank Scheck",
  "url": "http://www.hollywoodreporter.com/review/lin-manuel-mirandas-hamilton-theater-813145",
  "publishDate": "August 6th, 2015",
  "fullText": "6:00 PM PDT 8/6/2015\n\nby\n\n\nTHR Staff\n \n\n\nFACEBOOK\n\n\n\n\nTWITTER\n\n\n\n\nEMAIL ME\n\n\n\n\nYOUTUBE\n\nForty-six years ago, a musical about the Founding Fathers entitled 1776 opened on Broadway at the 46th Street Theatre, going on to win the Tony Award for best musical and run for several years. History now repeats itself with another musical about the Founding Fathers, playing at the same theater (now renamed the Richard Rodgers) and seemingly destined for perhaps even greater success. Having already become a cultural phenomenon in its off-Broadway premiere run earlier this year at the Public Theater, Hamilton — written by and starring Lin-Manuel Miranda, who previously made a name for himself on Broadway with In the Heights — seems a shoo-in for smash-hit status and a slew of awardnoms.\n\nOf course, this musical differs from its 1969 predecessor in significant ways. Inspired by Ron Chernow's best-selling biography of Alexander Hamilton, it recounts its complex tale in a far hipper, multicultural manner, featuring a largely hip-hop, rap-heavy musical score and a cast mostly composed of Hispanic and black actors. The almost entirely sung-through show is remarkably faithful to the historical facts, packing an immense amount of detail into its sprawling narrative. But it does so in such riotously entertaining fashion that it never feels like a history lesson, although it surely delivers one.\n\nRead more 'Hamilton': Lin-Manuel Miranda, Questlove, Black Thought on the Runaway Broadway Hit, Its Political Relevance and Super-Fan Barack Obama\n\nHamilton traces the details of the extraordinary life of \"the ten-dollar founding father without a father\" (let's hope that this lyric doesn't become dated anytime soon, although it's apparently fated to be), from his illegitimate birth in the West Indies as \"a bastard, orphan, son of a whore and a Scotsman\" to his death in a duel at the hands of his political arch rival Aaron Burr.\n\nIn between we see him serving as a chief aide to General George Washington during the Revolutionary War; becoming the primary author of the landmark Federalist Papers; assuming the role of the first Treasury secretary; and being involved in what would be the country's first national political sex scandal. In Hamilton's story, there's a treasure trove of juicy material, and Miranda, who wrote the book, music and lyrics, mines it assiduously.\n\nLargely unaltered from its original production save for one important cast change, the lyrically dense show makes an even greater impact on the large Broadway stage, which provides ample room for its large ensemble. The performers have only gotten better, with Miranda in the title role (Javier Munoz fills in for some performances) delivering a commanding star turn that is as charismatic as it is emotionally affecting. But there's also terrific work from Leslie Odom Jr. as the scheming Burr, stopping the show with the rousing number \"The Room Where It Happens\"; Christopher Jackson, stolid and dignified as Washington; and Daveed Diggs, boisterously playing both the flamboyant Marquis de Lafayette (his declaration, \"Immigrants &hellip;we get the job done!\" scores big laughs) and the haughty Jefferson.\n\nRead more 'Hamilton': Lin-Manuel Miranda Repeatedly Rewards Lottery Hopefuls With Unique Pre-Shows\n\nNo less impressive are the female performers, with moving turns by Phillipa Soo as Hamilton's loyal wife, Eliza; Renee Elise Goldsberry as her sister, who's more than a little in love with her brother-in-law; and Jasmine Cephas Jones as the married woman whose affair with Hamilton would precipitate his political downfall.\n\nSince Brian D'Arcy James has decamped to the hit Broadway musical Something Rotten!, the show-stealing role of King George has been assumed by Jonathan Groff (Spring Awakening, HBO's Looking). While the talented actor at first seems a bit young to play the foppish monarch, he's enormously fun in his brief appearances, fully milking such melodically rich numbers as \"You'll Be Back\" for all their sardonic humor.\n\nDespite its two-hour, 45-minute running time, the show moves at a breathless pace, with Thomas Kail's fluid staging and Andy Blankenbuehler's dynamic choreography making vital contributions. On a purely technical level, the production is impeccable, from David Korin's wood scaffolding set design to Paul Tazewell's handsome period costumes to Howell Binkley's precise lighting, which highlights every key emotional moment.\n\nThe musical is a triumph, one that has already been seen and lauded by presidents past (Bill Clinton), present (Barack Obama) and possibly future (Hillary Clinton) — not to mention, in an illustration of its ability to bridge political differences, former Vice President Dick Cheney. Already playing to sold-out houses and consistently ranking among the top Broadway grossers, Hamilton stands poised for a lengthy run. More to the point, it signals its immensely talented creator and star as a game-changing figure in musical theater.\n\nCast: Lin-Manuel Miranda, Phillipa Soo, Leslie Odom, Jr., Renee Elise Goldsberry, Christopher Jackson, Daveed Diggs, Okieriete Onaodowan, Anthony Ramos, Jasmine Cephas Jones, Jonathan Groff\nDirector: Thomas Kail\nBook, music & lyrics: Lin-Manuel Miranda\nChoreographer: Andy Blankenbuehler\nSet designer: David Korins\nCostume designer: Paul Tazewell\nLighting designer: Howell Binkley\nSound designer: Nevin Steinberg\nPresented by Jeffrey Seller, Sander Jacobs, Jill Furman, the Public Theater",
  "isFullReview": true,
  "showScoreExcerpt": "\"Having already become a cultural phenomenon in its off-Broadway premiere run earlier this year at the Public Theater, 'Hamilton' — written by and starring Lin-Manuel Miranda, who previously made a name for himself on Broadway with 'In the Heights' — seems a shoo-in for smash hit status and a slew of awards attention...The musical is a triumph.\"",
  "showScoreUrl": "https://www.show-score.com/broadway-shows/hamilton",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 837,
  "archivePath": "data/archives/reviews/hamilton-2015/thr--frank-scheck_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:29:09.660Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20210416183341",
  "archiveOrgUrl": "http://web.archive.org/web/20210416183341/https://www.hollywoodreporter.com/review/lin-manuel-mirandas-hamilton-theater-813145"
}