{
  "showId": "hamilton-2015",
  "outletId": "VARIETY",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2015/legit/reviews/hamilton-review-broadway-1201557679/",
  "publishDate": "2015-08-06",
  "fullText": "Home Legit Reviews Aug 6, 2015 6:00pm PT Broadway Review: &#8216;Hamilton&#8217; By Marilyn Stasio Plus Icon Marilyn Stasio Theater Critic Latest &#8216;Bob Fosse&#8217;s Dancin&#8221; Review: A Rapturous Broadway Homage to a Great Choreographer 3 years ago ‘Pictures From Home’ Review: Nathan Lane Leads Well-Acted but Dull Broadway Play 3 years ago ‘The Collaboration’ Review: Paul Bettany and Jeremy Pope Play Art-World Icons on Broadway 3 years ago See All Joan Marcus &#8220; Hamilton &#8221; was a sensation in a 299-seat house at the Public Theater, where the blazing inventiveness of Lin-Manuel Miranda &#8216;s hip-hop musical tribute to one of our illustrious Founding Fathers played right into the downtown vibe. But this innovative show is shaping up to be just as much of a phenomenon uptown, playing in a Broadway house with four times the seating capacity, and to a more traditional but no less enthusiastic audience. That universal appeal to crossover audiences is one unmistakable sign of a groundbreaking show. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-variety-article-mid-article-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[300,250],[2,2],[300,251],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); Whatever technical adjustments might have been necessary to move the production into a larger space are not evident from an audience&#8217;s perspective. The wonderful dancing chorus seems to have more room to perform its leaps and bounds, and the individual characters have always been larger than life in the first place. In fact, Leslie Odom Jr. seems even more invested in the difficult character of Aaron Burr, really sinking his teeth into the frustration and yearning that this troubled character reveals in &#8220;The Room Where It Happens.&#8221; And Christopher Jackson&#8217;s manly General Washington is even more moving when he acknowledges, in &#8220;One Last Time,&#8221; that his days as the nation&#8217;s leader are indeed over. Related Stories Blackpink’s Jisoo, Gong Yoo, Song Hye-kyo Lead Netflix Korea 2026 Slate",
  "isFullReview": true,
  "showScoreExcerpt": "\"This innovative show is shaping up to be just as much of a phenomenon uptown, playing in a Broadway house with four times the seating capacity, and to a more traditional but no less enthusiastic audience. That universal appeal to crossover audiences is one unmistakable sign of a groundbreaking show...Like any true landmark, 'Hamilton' stands up to repeated viewings. After six months, the show’s initial impact hasn’t dulled a bit; in fact, the qualities that made it so extraordinary the first time around are all the more striking.\"",
  "originalScore": null,
  "assignedScore": 95,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "urlUpdated": "2026-01-23T05:30:06.055Z",
  "fetchedAt": "2026-01-23T05:41:38.466Z"
}
