{
  "showId": "hamilton-2015",
  "outletId": "VULT",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2015/08/hamilton-broadway-review.html",
  "publishDate": "2015-08-06",
  "fullText": null,
  "isFullReview": false,
  "bwwExcerpt": "casting could not be better and the company now wears a multiplicity of roles like second skins. The standout besides Miranda as his own leading man, is Odom, every bit his match as the complex Burr. Jesse Green, Vulture : A second look...suggests that something even more significant is going on. The breakthrough isn't so much the incorporation of those contemporary genres; after all, Miranda already did that, throwing in Latin music to boot, in the charming In the Heights. But Hamilton not only incorporates newish-to-Broadway song forms; it requires and advances them, in the process opening up new territory for exploitation. It's the musical theater, not just American history, that gets refurbished. And perhaps popular music, too...I noticed only a few textual changes since it opened downtown, all smart. The role of the villain, Aaron Burr, has been carefully streamlined...The paradoxical result is that Leslie Odom Jr.'s already excellent performance is even more thrilling...I still w",
  "showScoreExcerpt": "\"A second look suggests that something even more significant is going on. The breakthrough isn’t so much the incorporation of those contemporary genres; after all, Miranda already did that, throwing in Latin music to boot, in the charming 'In the Heights.' But 'Hamilton' not only incorporates newish-to-Broadway song forms; it requires and advances them, in the process opening up new territory for exploitation. It’s the musical theater, not just American history, that gets refurbished. And perhaps popular music, too. Call it Miranda’s manifest destiny, though one dreads the caravans of poor imitators that will surely trail behind.\"",
  "originalScore": null,
  "assignedScore": 95,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-HAMILTON-Opens-on-Broadway-20150806",
  "textStatus": "missing"
}
