{
  "showId": "the-prom-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2018/11/15/the-prom-bringing-red-and-blue-together-with-song-and-dance/",
  "publishDate": "2018-11-15T21:25:41",
  "fullText": "“We’re liberal Democrats from Broadway!” a character named Trent Oliver announces to the denizens of a small Midwestern town early in the The Prom. Specifically, Trent and the three buddies who have traveled with him to fictional Edgewater, Indiana are middle-aged actors seeking to revive their sagging careers by protesting on behalf of a teenage lesbian.\n\nThe satirical possibilities are numerous, but since this is a musical comedy directed and choreographed by Casey Nicholaw—also currently represented on Broadway by established hits The Book of Mormon, Aladdin and Mean Girls—we trust that they will be handled with minimal cynicism and an emphasis on exuberant showmanship. And they are.\n\nIndeed, it’s hard to imagine a show fueled by more extravagant good will than Prom, which Nicholaw put together with old friends and collaborators Chad Beguelin, Bob Martin and Matthew Sklar, with Martin and Beguelin co-writing the book and the latter crafting lyrics for Sklar’s music. They devised the show in part as a vehicle for a group of veteran performers whose  talents are well-known among theater fans, including Brooks Ashmanskas, Beth Leavel and Christopher Sieber.\n\nSieber is cast as the pompous but (like the other thespian characters) well-meaning Trent, a Juilliard graduate working as a cater-waiter when we first meet him. Leavel and Ashmankas respectively play two-time Tony Award-winning diva Dee Dee Allen and Drama Desk Award winner Barry Glickman, the stars of Eleanor! The Eleanor Roosevelt Musical, which as Prom kicks off is celebrating its opening night—also its closing, thanks to poor advance sales and a terminally scathing review.\n\nThe problem, Dee Dee and Barry are told by their press rep, is that “nobody likes a narcissist.” So with Trent and another pal named Angie—an experienced chorine wittily played by Angie Schworer, an experienced chorine—they hatch a plan to reverse their fortunes and win the media over the way celebrities do nowadays, by adopting a cause.\n\nA quick Twitter search by Angie leads the quartet to Edgewater, where a high-school prom has been canceled by the PTA because a female student wanted to take her girlfriend. The student, a quiet, thoughtful 17-year-old named Emma—played with winning, moving understatement by Caitlin Kinnunen—is as wary of publicity as the actors are desperate for it; predictably, though, a bond is formed, and a small town flamboyantly disrupted as the invaders determine to change hearts and minds, and get lots of attention in the process.\n\nBeguelin and Martin have a swell time and deliver their best, funniest lines sending up the egotism and cluelessness of the visiting troupers, and their assumptions about middle America. In “It’s Not About Me,” one of a couple of showcases for Leavel’s still-mighty belt and sly comedic chops, Dee Dee sings to Emma that while she’s “far too busy to Google” what the acronym L.G.B.T.Q. stands for, “I’m no stranger to slander…The Post once said I was/Too old to play Eva Peron/Eva Peron!”\n\nAshmanskas, a duly treasured character actor who also gets to own or co-own the spotlight in a few numbers, revels in the openly gay Barry’s naughty antics; after the actors crash a PTA meeting, he yells at an appalled parent, “I’m Jewish, too!” (Barry also reveals a more tender side, growing particularly close to Emma—who has forged a different, more complicated connection with another principal character, younger and female, sweetly played by Isabelle McCalla.)\n\nSmartly, Prom‘s writers are gentler with the local townsfolk, who are represented not only by an uptight, homophobic  PTA mom, given a suitably brittle edge by Courtenay Collins, but by the open-minded, big-hearted school principal, who happens to be black, played with convincing warmth by Michael Potts.\n\nWe learn that Edgewater is under economic duress, a noteworthy factor that is nonetheless mentioned rather abruptly, then dropped. Mixing social commentary into a musical this giddy and frothy in texture isn’t an easy job, and while Prom doesn’t exactly proselytize, there are moments when its observations feel awkward or simplistic. A song titled “Love Thy Neighbor” begins with Trent, whom Siebert makes lovable and charismatic despite himself, lecturing the town youth on various acts considered sinful, in an effort to change their attitudes towards homosexuality.\n\nHappily, “Neighbor” evolves into the kind of high-spirited, effervescent production number that is Nicholaw’s strong suit, numbers which are in generous supply throughout Prom. The abundance of young ensemble characters in the musical provides a platform for some  of his most thrillingly energetic and athletic choreography, and Sklar delivers a few bouncy tunes to further propel Nicholaw and his inexhaustible dancers.\n\nScott Pask’s fanciful, functional set design—which makes Edgewater just as scrumptious-looking as New York, only less fussy—and Anne Roth and Matthew Pachtman’s contemporary, colorful costuming reinforce our sense of being in a world not unlike our own, but a little brighter and easier to laugh at, or with. The Prom may not change your life, but the possibility of progress it celebrates, and the buoyant respite it offers from naysaying and gloom, are not unsubstantial things these days.\n\nThe Prom opened November 15, 2018, at the Longacre Theatre, and runs through August 11, 2019. Tickets and information: theprommusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2018/11/15/the-prom-bringing-red-and-blue-together-with-song-and-dance/"
}
