{
  "showId": "purpose-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2025/03/17/purpose-the-painful-legacy-of-dreams-deferred/",
  "publishDate": "2025-03-17T22:58:06",
  "fullText": "Of our current crop of prolific playwrights, Branden Jacobs-Jenkins must rank as the most formally unpredictable, as well as, perhaps, the most audacious. Blessed with a commission from Steppenwolf Theater Co. of Chicago, he forgoes past experiments with history’s intersection with the supernatural (Appropriate), racial shape-shifting (Neighbors), and satirical allegory (Everybody), to unveil Purpose. It’s a powerfully naturalistic family drama right in the Steppenwolf wheelhouse, one whose jumping-off point – here comes the audacity – directly evokes the real-life travails of civil rights icon Rev. Jesse Jackson and his progeny. Jacobs-Jenkins is a risk-taker, no question. And he sure can write.\n\nThe action is a day in the life of the weary Rev. Solomon Jasper (Harry Lennix), whose past connections with the likes of Dr. King and Nelson Mandela are proudly displayed on his mansion’s walls. Although Rev. Jackson is name-checked to hint that they’re different men, both are plagued with the same familial disgrace: an elder son “Junior” (Glenn Davis), fallen from grace into a lengthy prison term on corruption charges. Today’s gathering, in fact, is in honor of his release, tied to the belated birthday celebration for matriarch Claudine (LaTanya Richardson Jackson).\n\nBut storm clouds are brewing. Daughter-in-law Morgan (Alana Arenas) is days away from serving her term on a related tax-evasion conviction, and she is decidedly Not Happy. Meanwhile, younger son Nazareth (Jon Michael Hill) – the “weird one” who spends his solitary days photographing Canadian lakes – unaccountably pops up with the bubbly Aziza (Kara Young) on his arm. There’s a first time for everything, think the hopeful parents. Will Naz if not Junior right himself? Can the Jaspers get back on track?\n\nWell, no. Jacobs-Jenkins’s theme, a universal one, is wrapped up in his title. How do we figure out what we are meant to do in this life, and even once it’s identified, how can we achieve it?\n\nTime has passed Rev. Jasper by. Aged out of relevance, with the vigorous civil rights movement a thing of history, he sees his legacy in ashes, with one son a convicted felon and the other a divinity school dropout. This lion in winter retreats to the passions and pursuits of an earlier day, notably beekeeping (a dramatically interesting choice, as it turns out). Lennix is a marvel in this role, fires banked but still burning. Though he almost never raises his voice, we never question his authority, however disillusioned he’s become.\n\nThe Jasper sons’ search for purpose is even more explicit, though their roles are much more challenging and, to my mind, unevenly handled. With no end of redemption schemes, each of which his father disdains or shoots down, hapless Junior must whipsaw from enthusiasm to despair and back again. Yet too often, Davis seems caught in a middle ground of muddled confusion. As for Naz, Hill handles his assignment of narrator/amanuensis with relish, winning our affection and getting his laughs. Yet there’s got to be a part of him that is unknowable, to us as much as to his family members, and the actor visibly struggles to grab hold of that transcendence through several difficult monologues.\n\nThe women, however, are all unqualified successes. Richardson is simply terrific as the family’s indomitable engine, who cannot control her men or events as she once did but by God, she will never stop trying. The comic energy Young brought to her Tony-winning turn in Purlie Victorious is still in evidence, along with a groundedness that leavens her character’s pandemic-created search for meaning through motherhood, of which Naz is an ambivalent ally. I find most intriguing the smaller but pivotal role of Morgan, long-disaffected fifth wheel on the Jasper wagon. Gliding across the stage behind shades, Arenas keeps us wondering “is she out of it?” until the climactic act one dinner table scene, when Jacobs-Jenkins gives her the ammo to blast the family’s half-truths out of the water. Her purpose, simply to be a good mother, has been derailed, and one who’s been painted as the heavy suddenly takes on the aura of victim.\n\nDirector Phylicia Rashad deftly manages the highs and lows of act one right up through that dinner table fiasco. In the more ruminative act two, as the characters’ sense of purpose is set fully adrift, the pacing and emphases seem less in control, though that may be due to a couple of underdeveloped plot points involving Morgan and Aziza.\n\nAny reservations aside, there’s a buzz running through the Hayes Theater throughout the almost three hours of Purpose, an unmistakable signal of the engagement we crave from live performance. The haunted Jaspers may not rise to the level of the haunted Tyrones of Long Day’s Journey Into Night. But they certainly earn a place beside the haunted Westons of August: Osage County, the previous Steppenwolf import to offer this much excitement and empathy.\n\nPurpose opened March 17, 2025 at the Helen Hayes Theater and runs through August 31. Tickets and information: purposeonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2025/03/17/purpose-the-painful-legacy-of-dreams-deferred/"
}
