{
  "showId": "purpose-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2025/03/17/purpose-tough-new-branden-jacobs-jenkins-tragicomedy-loses-sight-of-purpose/",
  "publishDate": "2025-03-17T22:57:01",
  "fullText": "Branden Jacobs-Jenkins writes funny. His latest play, Purpose, just in from Chicago and its Steppenwolf development, starts with Nazareth “Naz” Jasper (Jon Michael Hill, last seen locally in the acclaimed Pass Over) delivering a monologue that skirts the limits of “enough-already” but is saved by a series of quips, every one increasingly endearing him to the audience.\n\nJacobs-Jenkins also writes serious but by play’s end may not be as effective as he is with his sense of humor. The first but hardly the last funny line he speaks within a minute or so from his voluminous get-go is about a good female friend: “She needed my sperm. [laugh, brief pause] But more of that later.” The second comment tops the first, neatly eliciting a second laugh.\n\nThe drawback is that the successful, prolific, much-admired Jacobs-Jenkins is apparently compelled to establish his talent through tragedy more than comedy and so goes about Purpose as perhaps a bookend to his most recent Appropriate, the first one about an accomplished white family eating itself up from within, the new one about an accomplished, even famous Black family devouring itself from within.\n\nThe internecine cannibalism occurs over the second half of one day and the first half of the next, thereby honoring Aristotle’s unities dictum. But Jacobs-Jenkins packs so much fury into the twenty-four or so hours that Aristotle himself might have advised, “Calm down, the unities don’t include excess.”\n\nSo, what gallops along at such a madcap pace? After a long absence during which he established himself as a first-rate nature photographer, Naz is home for his mother’s delayed birthday party. Also at home is older brother Solomon “Junior” Jasper (Glenn Davis, last seen here in Downstate), just out of a 24-month prison stay for embezzling and now intent on righting himself with his parents.\n\nThe wayward family’s mother, Claudine Jasper (LaTanya Richarson Jackson), is a semi-retired lawyer whose mission seems to be bonding the family together against interrupting forces. The father, Solomon “Sonny” Jackson (Harry Lennix), is a world-renowned preacher. (It’s  hard not to see Jesse Jackson and son Jesse Jackson Jr. as handy Jacobs-Jenkins inspirations).  Over the years Sonny looks to have transformed the word of God into his own stiflingly tyrannical words.\n\nSwept into the two-act vortex is outsider Aziza Houston (Kara Young, last year’s supporting actress Tony winner for Purlie Victorious), the friend taking advantage of the son’s sperm. Only when she’s on the premises does she learn that she’s actually under the venerated Solomon Jasper’s roof.\n\nThe other interloper is Morgan Jasper (Alana Arenas), Junior’s irate wife, bent on estranging herself from him and from the life of crime into which he’s entangled her. She’s due for a prison stay herself and worried about the well-being of the two children she refused to bring to the menacing Solomon household.\n\nWith all the suspects gathered, Claudine—and Jacobs-Jenkins, of course—invites them to the dinner table so’s to trigger (yes, there is a firearm) the whirligig troubles that eventually comprise the mind-blowing activity that both explodes and implodes.\n\nThe results afflict everyone, many if not most of them beginning or ending with Solomon’s iron grip over the family, with Aziza dragged into the fray. The patriarch resents both his sons: Naz turned his back on becoming the celebrated next generation preacher; Junior went bad and is deemed unworthy of redemption.\n\nOn it goes, for a while making sense of the family’s accumulating dysfunctions and crescendoing toward a delicately plotted finale. But Jacobs-Jenkins doesn’t know when to stop. He continues piling on nasty disturbances and ugly revelations so that he haphazardly risks audience resistance.\n\nIt’s as if the playwright is worried he won’t be taken seriously unless he fires off as many theatrical cannons as he can. Adding to the dramatic trouble when he’s fired them all, he decides to have the family neatly resolve the despairing differences. It’s a gearshift ultimately unconvincing. No details on this, except to say that throughout the two acts—the second prolonged beyond credibility—Solomon hasn’t been drawn as someone in any way readily malleable.\n\nDirector Phylicia Rashad does well, keeping matters flowing on a Todd Rosenthal set that tells all that’s needed to know about the Jasper family’s up-scale home. She keeps the actors—in Dede Ayite’s costumes—at the crest of their abilities. With the accelerating hijinx their characters are up to, they have myriad challenges to meet and do, bless ‘em.\n\nTo Jacobs-Jenkins credit, he introduces a meaningful discussion just before the last black-out. It has to do with the options for choosing a path through life, a decision Naz has already solved for himself. His advice is so intelligent, so satisfying—and so smoothly instructive for audiences to hear—that he suddenly positions himself as the preacher his father had hoped he’d become.\n\nThe resolution does register as appropriate, whereas so much preceding it isn’t. Okay, in a way it is decidedly appropriate, which is to say that even as Jacobs-Jenkins goes off the deep end with Purpose, he’d already accomplished the same achievement in his preceding Appropriate, another hardy plunge off the pier’s end.  He’s such a talented playwright, though, gathering an impressive resumé that there’s no reason he won’t rein in his excessive urges in the future.\n\nPurpose opened March 17, 2025 at the Helen Hayes Theater and runs through August 31. Tickets and information: purposeonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
