{
  "showId": "the-anarchist-2012",
  "outletId": "vulture",
  "outlet": "New York Magazine",
  "criticName": "Scott Brown",
  "url": "http://www.vulture.com/2012/12/theater-review-the-anarchist.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "David Mamet's austerity program isn't working. Despite a careerlong crusade to streamline theater by sandblasting away its airy effeminacies (like acting and emoting), his latest, The Anarchist, still feels strangely gassy, even at a Spanxed 80 minutes. This despite the best efforts of the author—who’s also the director—to dehydrate a life-and-death battle of wills into a stylized white paper.",
  "bwwScore": 6,
  "contentTier": "complete",
  "fullText": "Search\n \n\n \n \n \n\n \n\n \n \n\n \n\n \n \n \n\n \n \n\n \n \n \n \n \n \n \n \n \n \n \n\n \n\n \n \n \n \n\n \n \n \n \n Patti LuPone and Debra Winger in Mamet's The Anarchist.\n \n \n \n \n \n Photo:\n \n Joan Marcus\n \n \n \n\n \n\n \n David Mamet's austerity program isn't working. Despite a career-long crusade to streamline theater by sandblasting away its airy effeminacies (like acting and emoting), his latest, The Anarchist, still feels strangely gassy, even at a Spanxed 80 minutes. This despite the best efforts of the author—who's also the director—to dehydrate a life-and-death battle of wills into a stylized white paper.\n\nShall we dispense with the setup? We shall. Our duellists are two steely-eyed, late-middle-aged women: a notorious prisoner, Cathy (Patti LuPone, restrained to the point of partial paralysis), and her longtime warden Ann (Debra Winger, world-weary to the point of near-unconciousness). The question is parole. The circumstances: murder, terror, Algeria, and some murky Weather Undergroundish subversion. The time period: unspecified, unclear, possibly the present. (A young, anticolonial lefty-insurgent fighting the French in Algeria could be in her seventies now.) The questions: Shall the State prevail? Shall the Self? Shall the pathetic fancies of youth (faith in collectivism, faith in resistance) be reborn as the pathetic fancies of dotage (faith in God, faith in redemption)? And shall we keep using the word \"shall\"? We shall. 'Cause \"shall\" sounds so much more, I dunno, dialectical than boring old \"will.\" Mamet still believes in characters, but barely. He's most interested in them as agents of basic argumentation; they're up there to deposit the black-and-white Go stones of his logical grid. What those stones spell out, at the end of the night, is a deep anger no less fierce and consuming than his mid-period \"fuck\"-offs. It's the fury of a mind divided against itself: Mamet, like most American conservatives (and most Americans, period), is both a libertarian and an authoritarian, and the paradox is vexing and thrilling for him. But it is a forensic rather than a dramatic anger, and LuPone and Winger are quite obviously suffocating up there. (Winger, in the more poker-faced role, seems especially recessed and saturnine, qualities Mamet seems to admire in his actresses.) Circling each other on a nearly vacant yet strangely cluttered stage, they cling to the grim-stitutional, Stasi-chic furnishings like life rafts: I'm not sure how the blocking is supposed to work, but when there's no furniture involved, a certain dead-armed strandedness obtains. Here's a particularly passionate moment from Cathy: \"Do you know. What it's like. To vacillate. Between the desire to please ... or to be reticent, and fear your reserve will be misinterpreted as sullenness. When your freedom is at stake? Your very freedom?\" What the fuck? you may wonder, what happened to the fucking Mametspeak? Perchance you're still thinking of early Mamet, red in tooth and claw. The newer, older Mamet writes like a semiretired autodidact who subsists on a literary diet of Austrian economic treatises and relaxes by solving crossword puzzles aloud in places where he'll be overheard. He's put his pen on a primal diet—all lean meats of incentive and objective, thesis and antithesis. Yet we can't help but feel that something extremely simple is being said in the most luxuriantly gnomic academese available.It's tough to stuff to animate, and Mamet, as a director, is famously just-the-facts-ma'am with his actors. But these two actresses, both of whom blossom on subtext and supertext, clearly needed more than The Words to bring this single, extended scene to life. Something's supposed to be bubbling between these two: A strange, recurrent digression on \"forbidden\" lesbianism is both puzzling and ancient-seeming. (Mamet's identity politics still seem to be Xeroxed from the late seventies.) This, like everything else, is swiftly intellectualized, denuded of humanity, and stacked neatly. You hear the relief in LuPone's voice every time she gets a merely human moment: This is one of the plays where \"I need a cigarette\" gets a huge laugh, because cripes, we do. I'm not objecting to a play that feels like work. I'm only objecting to work with no play in it.\n\nShare on Facebook\n \n \n \n \n\n Tweet this Story\n \n \n\n \n\n \n\n \n \n\n \n \n\n \n \n Most Viewed Stories\n \n \n \n \n \n \n \n Emily Blunt Vetoed Sicario Nude Scene: ‘My Tits ... Didn’t Agree With It’\n\nWhat’s New on Netflix: October 2015\n\nSee How Well the Cast of Wet Hot American Summer Has Aged\n\nThe 5 Biggest Tech Myths Perpetuated by TV Shows and Movies, According to Experts\n\nJohn Oliver ‘Couldn’t Give Less of a Sh*t’ About Donald Trump and the U.S. Election Right Now\n\nSouth Asian Actors Are All Over TV This Year\n\nThe Leftovers’ New Season Is Some of the Most Interesting Television in Ages\n\nHarry Potter Fans in London Are Trying to Give Freedom to an Encased Dobby\n\nMovie Distributor A24 Has an Admirable Ethos, But It Won’t Change Hollywood\n\nRage Against the Machine Bassist: I Apologize for Inspiring Limp Bizkit\n\nStarring Daniel Wu and Aramis Knight.\n\nCosby has admitted to giving women quaaludes.\n\nIncluding a former Mrs. America.\n\n\"I was taken in by two lovely drag queens.\"\n\nHere's what's new on Hulu this month.\n\nNashville clearly overestimates how much we care whether Aunt Bev lives or dies.\n\nAll the clunky stuff is foreplay, of course.\n\nBut, you know, his hair is delightful.\n\nEven if you didn't like season one.\n\nThis is what his imagination really looks like!\n\nShe'll host and serve as the musical entertainment for the 41st season premiere.\n\nI thought Gretchen was the worst, but then we met Jonathan.\n\nWaking up sucks, especially if you're an ex-superhero.",
  "isFullReview": true,
  "textWordCount": 894,
  "archivePath": "data/archives/reviews/the-anarchist-2012/vulture--scott-brown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:22:40.956Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20151001165834",
  "archiveOrgUrl": "http://web.archive.org/web/20151001165834/http://www.vulture.com/2012/12/theater-review-the-anarchist.html",
  "wordCount": 894,
  "tierReason": "Full review text"
}