{
  "showId": "the-humans-2016",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "http://dougmarino.blogspot.com/2015/12/the-humans.html",
  "publishDate": null,
  "fullText": "The wonderfully talented writer, Stephen Karam, has penned yet another potent work now on stage at Roundabout's Laura Pels Theater. The Humans is a bare bones expose of the titular condition translated to us via the Blake Family. Erik Burke (Reed Birney) and Deidre Blake (Jane Houdyshell) are the staunchly middle class parents who raised their kids and go to church. They seem to be finding the dream slipping away day by day. Aimee Blake (Cassie Beck) and Brigid Blake (Sara Steele) are their two daughters who seemingly have done better than their parents' generation - college for both and Aimee being a lawyer in Philadelphia. Brigid is, however, a struggling composer just out of school with a mountain of student loan debt. Brigid is hosting Thanksgiving in her newly obtained apartment in Chinatown - a byproduct of her and her boyfriend Richard Saad (Arian Moayed) deciding to move in together to save money on the way to seeing if they can make it as a couple. Mother Blake is, of course, not happy about this arrangement. You're supposed to get married first. Accompanying them is Erik's Mother (Lauren Klein) who is completely taken by Alzheimer's. She's in a wheelchair and is really much out of it. We learn they really can't afford to put her anywhere for care which makes the disease even more sad for all involved. As Brigid over-compensates and leads the conversation and tour of her city and neighborhood, we learn more and more about each family member. Aimee has ulcerative colitis and may be losing her job as a lawyer. Mom and Dad have worked for the same places with little wage increases over the past few decades. Brigid is still learning how to \"live\" with her new boyfriend - what they share, what they say, and what they don't. It's really a slice-of-life type of a play with the family's dirty laundry being exposed here and there. Funny, poignant, and sad. Mr. Birney and Ms. Houdyshell might just be the finest actors on the stage today. Neither one seems to be able to utter an insincere or unintentional word. Ms. Steele is annoying and endearing all at the same time. It's a family, warts and all. It's a dumpy New York City apartment Chinatown, warts and all. It's Thanksgiving, warts and all. We do learn that Dad has something to tell everyone. I assumed it was the big C. But it's a twist that you will not expect. Like many families who don't really talk to each other and ignore most of the not-so-nice things - the Burke's are no different. The play progresses with light bulbs burning out until we end is total darkness. A darkness I liken to the lost nature of the entire family and families in general - all bubbly and sparkly on the outside, not so much on the inside.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"The wonderfully talented writer, Stephen Karam, has penned yet another potent work...'The Humans' is a bare bones expose of the titular condition translated to us via the Blake Family...Funny, poignant, and sad. Mr. Birney and Ms. Houdyshell might just be the finest actors on the stage today. Neither one seems to be able to utter an insincere or unintentional word.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 481,
  "archivePath": "data/archives/reviews/the-humans-2016/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:37:15.439Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 481,
  "tierReason": "Full review text"
}