{
  "showId": "cost-of-living-2022",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Maya Phillips",
  "url": "https://www.nytimes.com/2022/10/03/theater/cost-of-living-review.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup",
    "show-score-playwright"
  ],
  "bwwExcerpt": "This play left me breathless, and I'm not just using a manner of speech. As I made my way through the crowd of people exiting the theater, I took hard, shallow breaths, knowing that one deep inhale could set off a downpour of tears. This production either broke or mended something in me; I felt - brilliantly, painfully, cathartically - near the point of physical exhaustion.",
  "bwwScore": 10,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-COST-OF-LIVING-Opens-On-Broadway-20221003",
  "fullText": "How do we connect with people? How do we care for them? And what does it all cost, both fiscally and emotionally? These are just a few of the questions Martyna Majok poses in her wrenching 2018 Pulitzer Prize-winning play, “Cost of Living,” which opened on Monday night at the Samuel J. Friedman Theater in Manhattan.\n\nAfter debuting at the Williamstown Theater Festival in 2016, “Cost of Living” ran Off Broadway in 2017 in a Manhattan Theater Club production at New York City Center. Now Majok is making her Broadway debut, arriving with an impressive inventory of awards and praise for her poignant, socially conscious work, which includes “Sanctuary City” (2021) and “Ironbound” (2016).\n\nIn her Pulitzer Award citation, the committee wrote that Majok “invites audiences to examine diverse perceptions of privilege and human connection.” She does this whether exploring the worlds of undocumented immigrants or working-class New Jerseyans holding on by a thread.\n\nAs “Cost of Living” begins, Eddie is certainly looking for connection — and redemption, and a way out from under the specter of loneliness since his wife’s death. On this particular night, he says, he’s been stood up for a date with his dead wife, Ani. He sits on a stool center stage at a bar, a shelf of bottles adorned with multicolored string lights floating behind him.\n\nWhat Eddie (an affable David Zayas), a 40-something unemployed truck driver from Bayonne, N.J., leaves out in this impromptu bar eulogy to his wife are the tough times: his years of alcoholism and then a separation.\n\nFrom here the play, tenderly directed by Jo Bonney, jumps back in time, when Eddie and Ani are separated. It’s a few months after a devastating accident left Ani (Katy Sullivan) a quadriplegic and double amputee. Eddie wants to help with her home care; Ani, resentful and depressed, wants to be left alone.\n\nNot too far south of Bayonne, in Princeton, Jess (Kara Young) is struggling to stay above the poverty line. A recent alum of the Ivy League school, she’s nevertheless interviewing for a job as an aide to John (Gregg Mozgala), a grad student with cerebral palsy. Jess is direct but guarded when it comes to her life, and John is pretentious and calculating, though he gets Jess to open up with his knavish charm.\n\nThe play’s scenes alternate between the two stories of these caregivers, with a turntable set that rotates from Ani’s criminally beige living room and bathroom to John’s upscale, modern apartment with towering windows and a gray-tiled, sit-in shower stall. (The polished scenic design is by Wilson Chin.) Bonney’s deft negotiation of these separate settings and stories is just one of the ways “Cost of Living” impressively teeters between two main axes — the body, and the economy of its care — without toppling over.\n\nThere’s a satisfying parallelism to the dynamics between the two pairs — the chemistry, the witty repartee, the heartbreak one character offers, intentionally or unintentionally, to another. Each twosome exists in their separate bubbles of Jersey life until they finally intersect. And yet Majok’s sharp writing is never predictable; even when she seems to be leading us down the path to a conventional love story, she pivots and offers an unexpected development — like a wife who sends texts from beyond the grave or a romantic invitation that turns out to be a slick power play.\n\nBonney’s direction adds an extra layer of cohesion to the story: subtle connections that bridge the worlds, like Eddie and Jess each walking separately to the same gentle patter of rainfall on a stormy day (sound design by Rob Kaplowitz).\n\nEach of the four cast members performs with a three-dimensional pop of life. Eddie’s insistent affection and optimism is comically at odds with Ani’s dry deadpan. Sullivan’s fiery Ani speaks in a kind of poetry of insults and expletives. Young’s Jess is bright, brusque and uncompromising, even when her life is going sideways. And Mozgala portrays John as someone who is slippery, coy and clever, with a shadiness beneath.\n\nMajok’s script insists on the casting of diverse and disabled actors, helping to deepen an affecting work that readily breaks your heart, drags you through hurt and then kisses you on the forehead, sending you off with a laugh.\n\nThis play left me breathless, and I’m not just using a manner of speech. As I made my way through the crowd of people exiting the theater, I took hard, shallow breaths, knowing that one deep inhale could set off a downpour of tears. This production either broke or mended something in me; I felt — brilliantly, painfully, cathartically — near the point of physical exhaustion.\n\nIt seems as if the tears, the chuckles, the full body ache of feeling is the currency of an outstanding work of art. We give nearly two hours of attention, and great theater offers us empathy and humanity in return: riches of which even the world’s wealthiest can only dream.\n\nCost of LivingThrough Oct. 30 at the Samuel J. Friedman Theater, Manhattan; manhattantheatreclub.com. Running time: 1 hour 40 minutes.\n\nMaya Phillips is a critic at large. She is the author of the poetry collection “Erou” and “NERD: Adventures in Fandom From This Universe to the Multiverse,” forthcoming from Atria Books.",
  "isFullReview": true,
  "textWordCount": 879,
  "archivePath": "data/archives/reviews/cost-of-living-2022/nytimes--maya-phillips_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:12:14.678Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 879,
  "tierReason": "Full review text",
  "showScoreExcerpt": "\"This production either broke or mended something in me...We give nearly two hours of attention, and great theater offers us empathy and humanity in return: riches of which even the world’s wealthiest can only dream.\"\n\nRead more"
}
