{
  "showId": "cost-of-living-2022",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Joey Sims",
  "url": "https://www.theatrely.com/post/cost-of-living-considers-love-and-mutual-care-review",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Beyond its intriguing mess of motivations, Majok's quiet, deeply moving play also probes at a deeper question: Who is truly being cared for? Majok is the rare brand of playwright who can take such a broad, potentially soppy theme and probe it with wit and subtlety. Aided here by Jo Bonney's elegant direction and an excellent cast, Majok's 2018 Pulitzer Prize winner is mostly sublime on Broadway, save for a few missteps.",
  "bwwScore": 8,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-COST-OF-LIVING-Opens-On-Broadway-20221003",
  "fullText": "David Zayas and Katy Sullivan | Photo: Jeremy Daniel\n\nWhy do we care for one another?\n\nSome do it for a living. Jess (Kara Young) has gigs at two different bars, but is still struggling to make ends meet. So she applies as a home aide for John (Gregg Mozgala), a Harvard graduate student with cerebral palsy.\n\n“It’d be a very…meaningful experience,” she sputters as John presses on why she wants the gig, then drops the pretense and states baldly: “The money.”\n\nFor Eddie (David Zayas), care is something more meaningful. He has returned home to provide his wife Ani (Katy Sullivan) with day-to-day support following an accident in which she lost both lower legs. Offering himself to her is evidently something profound for Eddie, who will not be easily turned down.\n\nYet in Martyna Majok’s delicate and precise Cost of Living, which opens tonight at the Samuel J. Friedman Theatre in a Manhattan Theatre Club production, the whys and hows of mutual care are never straightforward. Jess is offering care as a service, yes–but also clearly craves an outlet for all the love she has to give. Eddie, meanwhile, is seeking to atone. His return to Ani follows a three months absence immediately following the injury. (The two were separating at the time.)\n\nBeyond its intriguing mess of motivations, Majok's quiet, deeply moving play also probes at a deeper question: Who is truly being cared for? Majok is the rare brand of playwright who can take such a broad, potentially soppy theme and probe it with wit and subtlety. Aided here by Jo Bonney’s elegant direction and an excellent cast, Majok’s 2018 Pulitzer Prize winner is mostly sublime on Broadway, save for a few missteps.\n\nThe theme of mutual care is especially potent in the dynamic between Eddie and Ani. Beginning from his absorbing opening monologue, Majok paints Eddie, who is a recovering alcoholic, as a mournful figure haunted by a fair few regrets. Though he practically forces his care onto Ani (and in one harrowing scene, does rescue her in a literal sense), it is soon evident that she’s providing equal comfort to him. That sounds potentially mawkish but, as in all her work, Majok’s writing eschews any trace of sentimentality.\n\nThese scenes also feature the play’s strongest performer in Zayas, who is doing astonishing work. Zayas suggests both deep pain and an intense longing for connection, again without a trace of sentiment. Opposite him, Sullivan is also terrific. She has a tougher assignment with Ani, a sharp, caustic presence who rarely allows a trace of vulnerability. As she and Eddie slowly fall back in love, she lets traces of tenderness ease back in, with all the precision that Majok’s text demands.\n\nThe play’s parallel story between Jess and John can be tougher to swallow, however. Young is terrific as Jess, bringing the same livewire energy she lent Lynn Nottage’s Clyde’s last season, albeit on a lower register. Though she is living on the edge, Jess still allows herself a joyful brand of hope, and that brightness contrasts amusingly with John’s stuck-up severity.\n\nBut even given Jess’ hopeful nature, it is tough to believe she would convince herself an evening appointment with John might be a date. Young and Mozgala do not find any kind of sexual tension together, and though the two are meant to both be in their mid-20s, Mozgala has grown a bit old for the role since originating it in 2016.\n\nIt is also unclear why, exactly, John teases Jess with flirtation quite so cruelly. This is where class tensions come into play in Majok’s text, and John’s entitlement seems chiefly to blame (his actual date is a PhD student, someone more ‘of his station’). But within such a humane and careful text, the cruelty feels just a bit too random. Of course it is true that, sometimes, people are simply just cruel to one another–but the play perhaps owes us a little more nuance on this turn than it provides.\n\nCost of Living concludes by bringing Eddie and Jess together, in a manner that manages to be both surprising and richly satisfying. It’s a gorgeous final scene, one which ties the play’s themes of connection and mutual care together with wonderful clarity.\n\nIf the ending also leaves a slight bitter aftertaste, that is only because it sees the play’s two able-bodied characters finding long-sought mutual care only after the two disabled characters have been removed from the picture.\n\nWhile that misstep deserves some reflection, it is not Majok’s intent, and ultimately does not undo the power of this sensitive and wrenching work.\n\nCost of Living is now in performance at the Samuel J. Friedman Theatre on West 47th Street in New York City through October 30, 2022. For tickets and more information, visit here.\n\nJoey Sims has written at The Brooklyn Rail, TheaterMania, American Theatre Magazine, Culturebot, Exeunt NYC, New York Theatre Guide, No Proscenium, Broadway’s Best Shows, and Extended Play. He was previously Social Media Editor at Exeunt, and a freelance web producer at TodayTix Group. Joey is an alumnus of the Eugene O’Neill Theater Center’s National Critics Institute, and a script reader for The O’Neill and New Dramatists. He runs a theater substack called Transitions.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 915,
  "archivePath": "data/archives/reviews/cost-of-living-2022/theatrely--joey-sims_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:27:16.112Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251011134250",
  "archiveOrgUrl": "http://web.archive.org/web/20251011134250/https://www.theatrely.com/post/cost-of-living-considers-love-and-mutual-care-review",
  "wordCount": 915,
  "tierReason": "Full review text"
}