{
  "showId": "cost-of-living-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://variety.com/2017/legit/reviews/cost-of-living-review-play-1202458260/",
  "playbillVerdictUrl": "http://variety.com/2017/legit/reviews/cost-of-living-review-play-1202458260/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Jun 8, 2017 4:00am PT \n\n \n\n \n \n \n\n \n\n \n Off Broadway Review: ‘Cost of Living’\n\n“Cost of Living” is a bittersweet play by Martyna Majok about people who need other people to survive — some of them quite literally. It’s also about people who absolutely refuse all help, even if their lives — again, literally — depend on it. Katy Sullivan (what a find!) quivers with suppressed feelings as a transfemoral amputee who would destroy anyone who dared to love her. Far from a pity-party, the play (now running at Manhattan Theater Club) demonstrates that people with physical disabilities can be just as thoughtless, selfish and mean as everyone else.\n\nOn the face of it, it would seem that the neediest characters in this play are John, a young academic with cerebral palsy played by Gregg Mozgala, and Ani, the red-headed, hot-tempered amputee played by Sullivan. But as things turn out, their caregivers Eddie (Victor Williams) and Jess (Jolly Abraham) are no less needy and would appear to need carers of their own.\n\nThe play is partially set in Bayonne, New Jersey, where worker bees like Eddie and Jess are likely to live in the real world. As played with infinite understanding and honest compassion by Williams, Eddie was a trucker who drove a big rig before his wife died and he lost heart. His opening monologue, told to a stranger in a bar, is a painfully beautiful prose poem. (“We’re all of us, in motels, on the road to somewhere we ain’t at yet and that makes us feel feelings. Roads are dark and America’s long.”)\n\nThese days, Eddie’s a home caregiver working for Ani, a prickly client who hates her caregiver for providing life-sustaining help — and hates herself even more for needing his help. Sullivan, a record-holding Paralympic athlete in track and field, is a riveting performer with a load of attitude that she imparts to Ani and dumps on Eddie. She’s funny, she’s cruel, she’s cute, she’s spiteful, she could drive a person crazy.\n\nThe other client in this play also inflicts emotional damage on his caregiver, but in a different way. Mozgala, the actor playing John, has cerebral palsy and his character gets around in a wheelchair. John is a graduate student at Princeton and lives alone in a very nice apartment. It’s obvious that he’s a rich guy, a smart guy, who thinks a lot of himself. He gets the funniest line in this dark-and-light play when he stops Jess from using the phrase “differently abled” because it’s “retarded.”\n\nJohn’s caregiver, Jess (Abraham), is desperate for this job. She already works as a cocktail waitress at several bars, but this job promises regular pay. In her anxiety to pass the interview, she’s tongue-tied and clumsy. A word of kindness would put her at ease, but John is so haughty and condescending, he makes her even more self-conscious — and angry, although she doesn’t dare show it.\n\nWilson Chin’s fluid set design takes us from one home to the other without a hitch. It’s a good visual match for Jo Bonney’s carefully calibrated direction, which allows for smooth transitions in the shifting relationships between clients and caregivers.\n\nIn the beginning, it’s the bathroom business that makes them all so awkward with each other. But in his overbearing way, John efficiently teaches Jess how to get him in and out of the shower, and the next time we see them, he and Jess both seem to be enjoying their shaving ritual.\n\nNot so Ani, who seems to take cruel satisfaction in making Eddie uncomfortable. But in a powerful (and beautifully directed) scene with Ani in the bathtub and Eddie kneeling on the floor to bathe her, all her pent-up rage gives way to deeper feelings. And boy, does she resist! Sullivan gleefully guides Ani from savage insult to insult, daring Eddie to hit her or drown her or … something.\n\nJohn, on the other hand, isn’t deliberately unkind. He’s just thoughtless and selfish and too full of himself to think of the impact his intellectual game-playing has on Jess. In fact, he treats her with the dispassionate disinterest that caregivers are often accused of showing their helpless clients.\n\nBy toppling old prejudices, Majok forces us to revisit our easy assumptions about people who really don’t want to be called “differently abled” and caregivers who could use a little love themselves.",
  "isFullReview": true,
  "textWordCount": 730,
  "archivePath": "data/archives/reviews/cost-of-living-2022/variety--marilyn-stasio_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:46:00.367Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 730,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2017 outside valid range 2019–2024 for show opening 2022"
}