{
  "showId": "newsies-the-musical-2012",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Chris Wiegand",
  "url": "https://www.theguardian.com/stage/2022/dec/08/newsies-review-disney-musical-industrial-relations-troubadour-wembley-park-theatre",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2022/dec/08/newsies-review-disney-musical-industrial-relations-troubadour-wembley-park-theatre",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Moves to mirror the wisecracks … (from left) Mukeni Nel, Joshua Denyer and Mark Samaras in Newsies. Photograph: Johan PerssonView image in fullscreenMoves to mirror the wisecracks … (from left) Mukeni Nel, Joshua Denyer and Mark Samaras in Newsies. Photograph: Johan Persson This article is more than 3 years oldReviewNewsies review – ‘tis the season for Disney musical about industrial relationsThis article is more than 3 years oldTroubadour Wembley Park theatre, LondonThis show about young New York paper-sellers has stirring anthems and screwball energy, even if it lacks emotional and political depth\n\nNewspaper hawkers, or “newsies”, belong to a bygone age but the issues in this US musical about their 1899 strike are today’s headlines. Quandaries of industrial action, the struggle for unionisation and crises of homelessness and child exploitation feature in the story, based on a 1992 film flop starring a teenage Christian Bale.\n\nIn the musical – which reaches the UK 10 years after Broadway – we find Joseph Pulitzer, publisher of the New York World, callously delighting in a “genius” plan to increase profits by raising the price newsies pay for the papers they sell. (The plot muddies history as the hike came during a boom in circulation due to the Spanish-American war so was eased by increased sales for hawkers.) The trim to newsies’ earnings is neatly contemplated from his barber’s chair but as Pulitzer, Cameron Blakely is given little more than a panto villain to play.\n\nHis adversary is Jack Kelly, charismatically played by Michael Ahomka-Lindsay, who leads an army of hard-knock orphans with a Miss Hannigan-esque warden nemesis. This being a Disney musical there’s cute little Les (played tonight by Oliver Gordon), who says the darnedest things, but aside from his brother Davey (Ryan Kopel) and amiable Crutchie (Matthew Duckett) the newsboys are thinly drawn. A cadre of newsgirls later storm the stage, none given a substantial role.\n\nView image in fullscreenThe Newsies cast with Michael Ahomka-Lindsay, on the right in the back row, as Jack Kelly. Photograph: Johan PerssonAn energetic ensemble charges in and out of the audience, swings on giant lightbulbs and covers a stage floor smudged with newsprint and dominated by designer Morgan Large’s scaffold set combining New York fire escapes and washing lines strewn with long johns. The film’s sepia palette is swapped for an inkier design with sparing splashes of colour in the costumes by Natalie Pryce.\n\nDirector Matt Cole builds a Jerome Robbins-style choreography from clenched fists and delicate jetés, stamped feet and dizzying pirouettes. It creates a sense of collective action, and the flashier moves mirror their wisecracks, but these occasionally acrobatic routines are oddly unemotional. There is a handful of soaring anthems (stirring music by Alan Menken, generic motivational lyrics by Jack Feldman, brassy punch from Nigel Lilley’s orchestra) and strong solos by Moya Angela and by Bronté Barbé as a rookie reporter who falls for Kelly. Barbé’s screwball energy matches Harvey Fierstein’s snappy book, which could have deepened their romance.\n\nThe complexities of the newsies’ struggle may feel under-explored for adults, but as a primer on unionisation in our winter of discontent it’s a refreshing proposition for younger audiences. And the victory of comradeship against corporate self-interest fits the season of goodwill.\n\nAt Troubadour Wembley Park theatre, London, until 16 April",
  "isFullReview": true,
  "textWordCount": 546,
  "archivePath": "data/archives/reviews/newsies-the-musical-2012/guardian--chris-wiegand_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:32:11.143Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 546,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2022 outside valid range 2009–2015 for show opening 2012"
}