{
  "showId": "newsies-the-musical-2012",
  "outletId": "theatre-weekly",
  "outlet": "Theatre Weekly (Greg Stewart)",
  "criticName": "Greg Stewart",
  "url": "https://theatreweekly.com/review-disneys-newsies-at-troubadour-wembley-park-theatre/",
  "playbillVerdictUrl": "https://theatreweekly.com/review-disneys-newsies-at-troubadour-wembley-park-theatre/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "<img decoding=\"async\" class=\"alignleft size-medium wp-image-1167\" title=\"Five Star Review from Theatre Weekly\" src=\"https://eghcszbxego.exactdn.com/wp-content/uploads/2015/10/New-5star-350x71.png?strip=all\" alt=\"Five Star Review from Theatre Weekly\" width=\"350\" height=\"71\" srcset=\"https://eghcszbxego.exactdn.com/wp-content/uploads/2015/10/New-5star-350x71.png?strip=all 350w, https://eghcszbxego.exactdn.com/wp-content/uploads/2015/10/New-5star.png?strip=all 372w, https://eghcszbxego.exactdn.com/wp-content/uploads/2015/10/New-5star.png?strip=all&w=74 74w, https://eghcszbxego.exactdn.com/wp-content/uploads/2015/10/New-5star.png?strip=all&w=148 148w, https://eghcszbxego.exactdn.com/wp-content/uploads/2015/10/New-5star.png?strip=all&w=223 223w, https://eghcszbxego.exactdn.com/wp-content/uploads/2015/10/New-5star.png?strip=all&w=297 297w\" sizes=\"(max-width: 350px) 100vw, 350px\" data-eio=\"l\" />It’s not unusual for a flop to find a new legion of fans somewhere further down the line. The original early nineties film version of Disney’s Newsies was a financial failure for the studio, but grew a dedicated following in the years to come. When the musical opened on Broadway, it was an immediate hit, but it’s been a long old wait for the Newsies to make it across to this side of the Atlantic, but it’s finally here for a run at Troubadour Wembley Park Theatre and making headlines as it goes. Both the musical, and the film on which it is based, were inspired by the real-life newsboys strikes of 1899. At the time, newspapers (or ‘papes’) were sold on the streets by young children, mostly orphans sleeping on the streets, because the only alternative was the city’s overcrowded and rat infested refuge. When Joseph Pulitzer, here played by Cameron Blakely, increased the wholesale price for the newsies, they formed a union and went on strike. In this version, it falls to the group’s de facto leader, Jack Kelly and his new friend Davey (Ryan Kopel) to organise newsies from all of New York’s boroughs to take action. The story by Harvey Fierstein is one that resonates today and is unapologetic in doing so, by coincidence it’s a transport workers strike that inspires the newsies to take action. But it’s also a story of the power wielded by the fourth estate, and no matter whether it’s a street urchin or a Duke (and Duchess), the newspapers, and media more generally, drive the narrative and set public perception. It’s perhaps ironic then that one of the world’s biggest media giants are behind the show, but with this much Disney magic on display no-one is going to be complaining. The London version is slightly different to the Broadway one, most notably that we have a thrust stage creating a more immersive feel. The vast space of the Wembley Park theatre is fully utilised, and there are newsies everywhere you look; above, below, beside – look under your seat and there’s every chance there’s a newsie there too. Newsies is a spectacle pure and simple; the awe-inspiring choreography from director Matt Cole is mesmerisingly balletic with a touch of grit. The cast dance on the stage, in the aisles and hanging from the lights – it’s a glorious sight to behold; on opening night there were two standing ovations in just one number. Alan Menken’s music is everything you would expect from a soaring Disney score, and Jack Feldman’s lyrics give everything a bit of edge, it feels like a rallying cry and a call to arms. Morgan Large’s set design creates exactly the right feel for turn of the century ‘Noo Yoik’, with a central pillar of scaffolding being accompanied by set pieces that seem to appear from every angle. It’s a massive cast of over 40 performers that bring this show to life, their energetic and athletic performances are flawless. Moya Angela plays the owner of a theatre where Jack regularly takes refuge, it’s a small part but Angela delivers it beautifully. Playing Jack’s love interest – Katherine Plumber – is the incredibly talented Bronté Barbé who has the audience enchanted with the solo number ‘Watch What Happens’. Leading the cast as Jack Kelly, Michael Ahomka-Lindsay delivers an outstanding performance that leaves the audience breathless. From the opening number, ‘Santa Fe’, to the more rousing ‘Seize The Day’ Ahomka-Lindsay nails it every time, and when it comes to the big speeches to rally the troops, you can feel the heart that goes behind it. A feast for the senses from start to finish, Newsies represents the very best of theatre; immersing its audience in the story and going all out to create an unforgettable show that is truly spectacular. Hold the front page, because London’s most revolutionary musical is an undeniable hit.",
  "isFullReview": true,
  "textWordCount": 690,
  "archivePath": "data/archives/reviews/newsies-the-musical-2012/theatre-weekly-greg-stewart--greg-stewart_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:33:07.306Z",
  "originalScore": "5/5",
  "originalScoreNormalized": 100,
  "scoreSource": "numeric-stars",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 690,
  "tierReason": "Full review text"
}
