{
  "showId": "a-time-to-kill-2013",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2013/10/21/theater/reviews/a-time-to-kill-opens-on-broadway.html",
  "playbillVerdictUrl": "http://www.nytimes.com/2013/10/21/theater/reviews/a-time-to-kill-opens-on-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The ceiling fans keep twirling away up there on the stage of the John Golden Theater on Broadway, as if to dispel all the heat and tension gathering in the courtroom where much of “A Time to Kill,” a stage adaptation of the John Grisham novel, takes place. But the producers might have saved a little on the electricity bill.\n\nI am just getting to that, your honor.\n\nAs I was about to say, this workmanlike version of Mr. Grisham’s book never succeeds in generating much steam as it moves through a tale of rape, murder and justice — the vigilante kind and the legal kind — amid the racial divisions in the deep South of the 1980s.\n\nAdapted by Rupert Holmes, whose career has embraced pop songwriting, prose fiction, plays and musicals (notably “The Mystery of Edwin Drood”), and directed by Ethan McSweeny, this efficient but hardly pulse-racing night at the theater features some terrific actors, but it doesn’t give any of them much red meat to chew on. If you’re a Grisham obsessive with a C-note burning a hole in your pocket — not to mention two-and-a-half hours of time to slay — by all means, come on down, y’all! But in a Broadway season quickly beginning to gather its own steam, this mechanical legal procedural cannot, I’m afraid, even outdo the competition in constant rotation on TV.\n\nSince it is gushingly billed, on the title page of the Playbill, as being “based on the classic best seller by John Grisham,” perhaps I will skip through the plot mechanics only briefly. We all know the plot of classic best sellers like “War and Peace,” right?\n\nObjection! Unnecessary sarcasm, your honor.\n\nSustained. The reviewer will try to refrain from similar tactics, please.\n\nAnyway, the grim path leading to the courtroom in small-town Clanton, Miss., where the drama ultimately culminates, begins when a couple of drugged-up white good old boys — played by Lee Sellars (the one with the nice mullet) and Dashiell Eaves (the other one) — rape and nearly lynch the 10-year-old daughter of Carl Lee Hailey (John Douglas Thompson), who is black.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 379,
  "archivePath": "data/archives/reviews/a-time-to-kill-2013/nytimes--unknown_2026-02-03.html",
  "textFetchedAt": "2026-02-03T22:32:15.411Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250427085807",
  "archiveOrgUrl": "http://web.archive.org/web/20250427085807/https://www.nytimes.com/2013/10/21/theater/reviews/a-time-to-kill-opens-on-broadway.html",
  "contentTier": "complete",
  "wordCount": 379,
  "tierReason": "Full review text"
}