{
  "showId": "a-time-to-kill-2013",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Unknown",
  "url": "http://www.vulture.com/2013/10/theater-review-a-time-to-kill.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+thr%2Fvulture+(The+Hollywood+Reporter+-+Vulture+Inbound)",
  "playbillVerdictUrl": "http://www.vulture.com/2013/10/theater-review-a-time-to-kill.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+thr%2Fvulture+(The+Hollywood+Reporter+-+Vulture+Inbound)",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Please read our updated Privacy Notice and Terms of Use, effective on December 19, 2019.\n\nFred Dalton Thompson, John Douglas Thompson and Sebastian Arcelus in A Time to Kill.\n Photo: Carol Rosegg\n \n \n \n A ceiling fan slowly rotates, stirring soupy Delta miasma. Our hero enters, eating grits. Fred Dalton Thompson appears out of the swampy murk, singing “Swanee” and covered in Spanish moss. OK, that last bit ain’t necessarily so, but you get the general picture. The stage adaptation of A Time to Kill is based on John Grisham’s first novel, which, next to the breakneck legal thrillers that would follow it, presents as grounded and anthropological. But the story still bears the mark of Grisham, whose gift for the vivid refuses any submission to subtlety. It’s the early eighties in small-town Mississippi, and two racist rednecks (Lee Sellars and Dashiell Eaves) brutally rape and nearly murder a 10-year-old black girl. Her father, Carl Lee Hailey (John Douglas Thompson) fears the perps will walk or do light time, institutional racism being what it is - so he methodically guns them down outside the courtroom of one Judge Noose (Fred Dalton Thompson, shorn cue-bald but otherwise quite reliably Thompsonian). Maybe he could’ve selected a courtroom belonging to a less ominously named judge, sure—but that’d be such a pussyfooting Turow move. Carl Lee is a Grisham man.\n\nSo is Carl Lee’s preselected counsel, Jake Brigance (Sebastian Arcelus), a white liberal “street lawyer” with a history of doing right by black clients. (Almost all the white characters you meet have a history of doing right by black folk, it turns out, and this becomes one of the show’s weaknesses.) Less sympathetic, obviously, is the bloviating district attorney (Patrick Page, doing his most incurable country ham), who’s angling for the death penalty with one eye on the governor’s mansion. Meanwhile, Carl Lee’s wife Gwen (Tonya Pinkins, mostly squandered in a small, handwringing role) just wants her husband home in one piece; with a capital crime hanging over him and the Klan on the march, that outcome is far from certain. The novel is rangy by Grisham standards, with intriguing detours into the world of the jury, but the stage story—retooled and reduced by adapter Rupert Holmes (The Mystery of Edwin Drood)—plays it a bit safer, sticking closely to Jake as he gradually exhausts his limited legal maneuvers (his client’s already admitted to the execution) and turns instead to an emotional appeal: Would the jury really sentence a father to death for avenging his daughter? Would it change anything if father and daughter were white, and the attackers black?\n\nThese are interesting questions indeed—when is procedural justice unequal to actual justice? When, if ever, is vigilantism justified? If society itself is outrageously skewed, can a one angry man be faulted for putting his thumb on scale?—and it’s a shame the play has so little interest in them. Instead, director Ethan McSweeny treats us to burning crosses (but only one barely glimpsed Klansman), projected footage of bloody Southern sunsets and pointy hoods, a turntable courtroom to shake up the speechifyin’, and bluesy musical underscoring so twangily on-the-nose, you’ll be transported straight to half-off-riblets-night at Applebee’s.\n\nMcSweeny does possess a fine touch with actors, especially actors grappling with talky, tendentious scripts. (His excellent The Best Man proved that.) With performers on the level of John Douglas Thompson and Page, you can be guaranteed a certain complement of gripping exchanges and stirring orations. And McSweeny and Arcelus have built a delicately layered, lived-in performance into Jake, even though there’s not too terribly much for him to push back against in the script department. Which feels like a missed opportunity: Jake may be a “street lawyer,” but he’s also part of the white Establishment, and Carl Lee knows it when he selects him over the proffered NAACP counsel. But Carl Lee, after a strong start in Act One by Thompson, gradually vanishes as a character as the play marches on; he’s just the man in the dock. Meanwhile, Jake gets distracted with Klan briefcase bombs and arson attacks (movieish stuff that plays awkwardly here), not to mention his toothsome law clerk (Ashley Williams, merrily making the most of an extraneous part). The thornier, less soluble aspects of race tension don’t get much of a hearing: This is righteous white people vs. somewhat-less-righteous white people, with cartoon Klansman tastefully concealed offstage. The play’s a series of battles that don’t quite add up to a war, possibly because the real enemy—Monolithic Whiteness—doesn’t make an honest appearance. The show’s less strenuously riveting moments, as opposed to the drowsy-making courtroom speeches, are also its best. I especially enjoyed the elliptical, only half-intelligible conversations between Jake and his mentor, disbarred, sleepily devious Lucien Wilbanks (Tom Skerritt), a progressive sot who enjoys regular regressions into Margaritaville. Skerritt is so relaxed, you can barely understand his cottony mouthfuls of dialogue, but he’s a loose, disarming present in a highly staged, totally controlled environment. In A Time to Kill, every familiar beat arrives right on time—but Skerritt’s always just a little late. I appreciated the spontaneity, intentional or not.\n\nA Time to Kill is at the John Golden Theater.",
  "isFullReview": true,
  "textWordCount": 861,
  "archivePath": "data/archives/reviews/a-time-to-kill-2013/vulture--unknown_2026-02-03.html",
  "textFetchedAt": "2026-02-03T22:32:51.239Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20200303043150",
  "archiveOrgUrl": "http://web.archive.org/web/20200303043150/https://www.vulture.com/2013/10/theater-review-a-time-to-kill.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+thr%2Fvulture+(The+Hollywood+Reporter+-+Vulture+Inbound)",
  "contentTier": "complete",
  "wordCount": 861,
  "tierReason": "Full review text"
}