{
  "showId": "present-laughter-2017",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Unknown",
  "url": "https://www.nytimes.com/2017/04/05/theater/review-kevin-kline-serves-ham-in-soignee-silk-in-present-laughter.html?_r=0",
  "publishDate": null,
  "fullText": "https://www.nytimes.com/2017/04/05/theater/review-kevin-kline-serves-ham-in-soignee-silk-in-present-laughter.htmlShare full article5454Advertisement\n\nIt’s high time we were reminded again of what a great physical comedian Kevin Kline is. Playing an aging matinee idol in the bouncy new revival of Noël Coward’s “Present Laughter,” Mr. Kline blissfully plies the witty athleticism and derring-do that won him two Tony Awards (“On the 20th Century,” “The Pirates of Penzance”) and an Oscar (“A Fish Called Wanda”) in his youth.\n\nIn the uneven but enjoyable production, which opened on Wednesday at the St. James Theater, directed by Moritz von Stuelpnagel, Mr. Kline makes his entrance in a state of soigné disarray. His character, the stage star Garry Essendine, is suffering yet another stormy morning-after.\n\nAs he descends the staircase from his bedroom, Garry somehow manages to drape his leg over the banister. Seconds later, his dressing gown catches on the newel at the bottom. It seems the entire world, including his own lavishly appointed apartment, is out to get Garry Essendine.\n\nYet this man’s clumsiness is grace itself. And he wears his air of aggrieved martyrdom as if it were a new pocket square from Charvet.\n\nWe are in the presence of a singular anatomy, one that combines the calculated haplessness of Charlie Chaplin and the swashbuckling brio of Douglas Fairbanks.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "“An uneven but enjoyable production…Let us give thanks for what Mr. Kline, embodying the capricious god of his own theatrical universe, has wrought. It is hard not to wish that the heavy farcical high jinks that surround him were on his high level…The staging by Mr. von Stuelpnagel brings out the more boisterous aspects of Coward’s comedy, occasionally to hilarious, but just as often labored, ends. And the pace needs to be picked up throughout.”\n\nRead more",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 232,
  "archivePath": "data/archives/reviews/present-laughter-2017/nytimes--unknown_2026-02-07.html",
  "textFetchedAt": "2026-02-07T09:24:51.418Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250427102233",
  "archiveOrgUrl": "http://web.archive.org/web/20250427102233/https://www.nytimes.com/2017/04/05/theater/review-kevin-kline-serves-ham-in-soignee-silk-in-present-laughter.html?_r=0",
  "textIssues": [
    "Word count too low: 232 (min: 300)"
  ],
  "duplicateTextOf": "nytimes--ben-brantley.json",
  "wordCount": 232,
  "tierReason": "Short text (232 words)",
  "rejectedAt": "2026-02-07T11:19:31.217Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The text cuts off mid-review with an error message about retrieving article content and enabling JavaScript, making it impossible to determine the critic's final verdict.; openai: The text is a mix of navigation instructions and a partial review, indicating a technical issue with accessing the full content.",
  "promptVersion": "5.2.0"
}
