{
  "showId": "romeo-and-juliet-2013",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Unknown",
  "url": "http://theater.nytimes.com/2013/09/20/theater/reviews/orlando-bloom-and-condola-rashad-in-romeo-and-juliet.html?pagewanted=all&_r=0",
  "playbillVerdictUrl": "http://theater.nytimes.com/2013/09/20/theater/reviews/orlando-bloom-and-condola-rashad-in-romeo-and-juliet.html?pagewanted=all&_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Mr. Bloom, in a first-rate Broadway debut, and the gifted Ms. Rashad exude a too-fine-for-this-world purity that makes their characters' love feel sacred...Yet, while the production features stunning columns of flame as part of its eclectic mise-en-scène, it never acquires the fiery, all-consuming urgency that 'Romeo and Juliet' should deliver...Good as she is in the early scenes, Ms. Rashad doesn't yet have the vocal heft and variety to take Juliet into the echoing halls of tragedy...On the other hand, Mr. Bloom, famous for being handsomely heroic in the 'Lord of the Rings' and 'Pirates of the Caribbean' franchises, keeps surprising. For once, we have a Romeo who evolves substantively, from a posturing youth in love with love to a man who discovers the startling revelation of real love, with a last-act descent into bilious, bitter anger that verges on madness.",
  "bwwScore": 5,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ROMEO-AND-JULIET-Opens-on-Broadway-All-the-Reviews-20130920",
  "fullText": "https://www.nytimes.com/2013/09/20/theater/reviews/orlando-bloom-and-condola-rashad-in-romeo-and-juliet.htmlShare full articleAdvertisement\n\nA sense of divine justice seizes us whenever two of the world’s prettiest people find each other. This was true when Taylor met Burton, when Brad met Angelina, when Paris met Helen, or even when Narcissus met his reflection. We just can’t help sighing over the glory of separate souls wrapped in the luxury of shared beauty. Then there’s that other part of us that thinks, both fearfully and hopefully, “It can’t last.”\n\nSuch thoughts are inevitably stirred by David Leveaux’s lopsided production of “Romeo and Juliet,” which opened on Thursday night at the Richard Rodgers Theater, with the equally exquisite-looking Orlando Bloom and Condola Rashad in the title roles. When these doomed lovers first set eyes on each other, it’s so obvious that they’re a matched set — and that they know it — that the whole world seems to stand still in deference.\n\nThough the kiss they subsequently share is long and deep, it doesn’t feel like the product of teenage lust. The chemistry is less erotic than aesthetic. This doesn’t mean that the connection isn’t real, and it’s hard not to feel protective of porcelain figurines that are destined to fall and shatter. That one of them is white and the other black may underscore the division between their families, yet it registers as irrelevant when they’re together.\n\nAs a director, Mr. Leveaux has always believed in the power of loveliness. This is the man who gave us a “Fiddler on the Roof” (2004) that looked as if it had been styled for a Russian Vogue shoot. With “Romeo and Juliet,” his trust in appearances is not entirely misplaced. Mr. Bloom, in a first-rate Broadway debut, and the gifted Ms. Rashad exude a too-fine-for-this-world purity that makes their characters’ love feel sacred. It seems right that they should speak in some of Shakespeare’s most gossamer-spun poetry, which they do with beguiling effortlessness.\n\nYet, while the production features stunning columns of flame as part of its eclectic mise-en-scène, it never acquires the fiery, all-consuming urgency that “Romeo and Juliet” should deliver. Cut to a fast 2 hours and 20 minutes, this version may well leave you glowing and misty-eyed at the conclusion of its first half, which ends shortly after a genuinely luminous balcony scene. But the tragic events that follow pass in such an anticlimactic blur that when our hero and heroine finally off themselves, it’s hard to feel bereft.",
  "isFullReview": true,
  "textWordCount": 406,
  "archivePath": "data/archives/reviews/romeo-and-juliet-2013/nytimes--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:44:36.601Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 406,
  "tierReason": "Full review text"
}