{
  "showId": "hughie-2016",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Jesse Dorris",
  "url": "https://www.theguardian.com/stage/2016/feb/25/hughie-review-forrest-whitaker-plays-low-stakes-eugene-oneill-play",
  "publishDate": "February 26, 2016",
  "fullText": "Gambling men: Frank Wood and Forest Whitaker in Hughie. Photograph: Marc BrennerView image in fullscreenGambling men: Frank Wood and Forest Whitaker in Hughie. Photograph: Marc Brenner This article is more than 9 years oldReviewHughie review – Forest Whitaker plays for low stakes in slight O'Neill playThis article is more than 9 years oldBooth Theater, New YorkThe actor does not entirely inhabit the part of Erie, a melancholy gambler, in this lavish Michael Grandage production of a minor Eugene O’Neill work\n\nWhat small bliss to hear the brisk and melancholy argot of Eugene O’Neill’s Hughie, a slender one-act play now revived on Broadway. When Erie Smith (Forest Whitaker) enters a dusty hotel lobby at some ungodly hour of the morning, his talk brims over with saps and suckers, wise guys and sports, dolls and frails, punks and bangtails.\n\nErie is a minor hustler, a petty gambler, an occasional gangster’s errand boy. He says that he has always been a lucky guy, but a lucky guy would have found better accommodation than this tumbledown dump just off the main stem. Yet this is where Erie has camped for 15 years, in part because of his close friendship with Hughie, the night clerk, a working stiff who listened eagerly to Erie’s stories and helped to romanticise his marginal life.\n\nNow Hughie has passed on and with him, Erie’s luck. Just returned from an epic drunk, Erie attempts to make a comrade of the new night clerk, Charles Hughes (a nearly silent Frank Wood), who would rather be left to his chair and his melancholy thoughts.\n\nApparently, the language and the characters had appeal enough to attract the Tony-winning director Michael Grandage and the film actor Whitaker. The production is gorgeous, of course (you would expect something else from Grandage?), with a strikingly dilapidated set from Christopher Oram and elegant ghostly lighting from Neil Austin. Yet there’s only so much they can do with the cards dealt to them.\n\nUnusually for an O’Neill play and perhaps even more unusual for a play about a gambler, the dramatic stakes are perilously low. It just doesn’t seem to matter much if Erie charms the clerk and turns around his luck or merely trudges to his room more alone than before. A minor work, written in the early 1940s, the script, which runs less than an hour, seems like more of a preparatory sketch than a fully realised work.\n\nA lot of the problem is that Whitaker never fully inhabits Erie and may have been miscast in the first place. Erie has a carapace of wariness and cynicism protecting his naive heart, yet Whitaker can only play the heart beneath. He’s an effortlessly likable actor (though this can be used to perverse effect, as in The Last King of Scotland) and his attempts to suggest Erie’s scepticism and despondency are never exactly credible. That’s there in the subtext, sure, but an actor has to play the text, too. (Wood, who has much less to say and do, seems far more comfortable.)\n\nWhitaker has yet to make Erie his own, but as a resolutely method actor, it’s possible he simply needs a few more weeks to acquaint himself with the role and the world, to slide into Erie’s shabbily suited skin, and find a way for all those wonderful words to sound at home.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "dtliExcerpt": "Whitaker brings a weary gravitas to Erie, a small-time hustler who buttonholes the night clerk at a seedy Times Square hotel with tales of his friendship with the previous clerk, Hughie.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Whitaker brings a weary gravitas to Erie, a small-time hustler who buttonholes the night clerk at a seedy Times Square hotel with tales of his friendship with the previous clerk, Hughie.",
  "contentTier": "complete",
  "contentTierReason": "Short text (31 words)",
  "rejectedAt": "2026-02-03T16:48:50.048Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or plot summary with no critical evaluation or recommendation about the show; openai: The text is a brief character description without any evaluative content or opinion on the show.; gemini: This is a plot summary with no evaluation. It describes the character and setting but offers no opinion on the quality of the show.",
  "promptVersion": "5.2.0",
  "previousUrl": "https://www.theguardian.com/stage/2016/feb/26/hughie-review-forest-whitaker-eugene-oneill-broadway",
  "urlDiscoveredAt": "2026-02-04T03:27:15.820Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 574,
  "archivePath": "data/archives/reviews/hughie-2016/guardian--jesse-dorris_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:27:15.823Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "wordCount": 574,
  "tierReason": "Full review text"
}