{
  "showId": "hughie-2016",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "http://www.nydailynews.com/entertainment/theater-arts/forest-whitaker-underwhelms-eugene-o-neill-hughie-article-1.2542759",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/theater-arts/forest-whitaker-underwhelms-eugene-o-neill-hughie-article-1.2542759",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Forest Whitaker, right, and Frank Wood in \"Hughie.\" This \"Hughie\" is hooey.\n\nIt's not that Forest Whitaker's acting is bad in this high-profile revival. It's that this likeable Oscar winner is not doing any discernible acting to speak of.\n\nThe production marks Whitaker's debut on Broadway and the fourth trip to the Great White Way for Eugene O'Neill's one-act, set in 1920s New York.\n\nWhitaker, known for emotionally vibrant performances in \"The Crying Game\" and \"The Last King of Scotland,\" is simply reciting his lines rather than embodying Erie Smith, the small-time gambler trying to get back on a winning streak.\n\nWhitaker offers was no connection or depth.\n\nThat's a shame, since there's plenty to play as Erie, who's down on his luck and living on illusions. During a mostly one-side conversation with an overnight hotel clerk (Frank Wood), Erie talks of things revealing his insecurity, anger, boastfulness and more.\n\nWhitaker was one-note as he jawboned about women and wagers and, mostly, missing Hughie, the former desk clerk he believed was his lucky charm. Hughie's desperate for a new talisman. But Wood plays the clerk in a brusque and slightly menacing fashion, which just feels off.\n\nTo his credit, Whitaker, a movie star and director who's been away from the theater since college, managed to be word-perfect last Saturday night. He didn't need prompting from a stagehand hidden in a downstage water cooler — as he did during other recent performances.\n\nDirector Michael Grandage, a Tony winner for \"Red,\" comes up short with a production that lacks high points. The show just ticks along for its 60 minutes, occasionally underscored by Adam Cork's moody music.\n\nChristopher Oram's scenic design is an unqualified success. His vision of a hotel lobby communicates a clear sense of a place that's seen better days. If you tire of Whitaker's disconnected talk, gaze at the faded tin ceiling or the broken elevator. They're subtle signs of former glory.\n\nAn hourlong play at Broadway prices — $149 top price — is automatically a dubious proposition. As such, it simply must deliver the goods.\n\nBut Whitaker doesn't, so \"Hughie\" craps out.",
  "isFullReview": true,
  "textWordCount": 354,
  "archivePath": "data/archives/reviews/hughie-2016/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:27:19.338Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20200929015507",
  "archiveOrgUrl": "http://web.archive.org/web/20200929015507/https://www.nydailynews.com/entertainment/theater-arts/forest-whitaker-underwhelms-eugene-o-neill-hughie-article-1.2542759",
  "contentTier": "complete",
  "wordCount": 354,
  "tierReason": "Full review text"
}