{
  "showId": "hughie-2016",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2016/legit/reviews/hughie-review-forest-whitaker-1201883694/",
  "publishDate": "October 13, 2016",
  "fullText": "Feb 25, 2016 6:00pm PT \n\n \n\n \n \n \n\n \n\n \n Broadway Review: ‘Hughie’ Starring Forest Whitaker\n\nForest Whitaker is blessed with an air of warmth and decency that shines through in film roles like the one he played in “The Butler.” Michael Grandage, for lauded his stagings of “Red” and “The Cripple of Inishmaan,” has directed him with considerable sensitivity as Erie, the forlorn gambler in Eugene O’Neill’s “Hughie.” Erie feels abandoned after the death of the hotel clerk who was his only friend and lucky mascot. But Whitaker’s warmth can also be a hindrance, as it is when the star, making his Broadway debut here, must also convince us that in better days he was a confident and happy-go-lucky sporting man.\n\nErie Smith (Whitaker) is cut from the same cloth as Hickey Hickman, the brassy salesman who preaches salvation to the stewbums at Harry Hope’s Saloon in “The Iceman Cometh.” But the only audience for Erie’s self-deluding pipedream about his comeback as a Broadway tinhorn is Charlie Hughes (Frank Wood), the dour night clerk at a fleabag hotel in Times Square.\n\nIn Christopher Oram’s astonishing set design, the eerie hotel where Charlie mans the front desk in moody silence looks more like a lunatic asylum than a safe haven from the hurly-burly of Broadway in the summer of 1928. The empty lobby is two stories high, with towering glass windows and doors at the entrance, a massive reception desk, a stunning birdcage elevator, and a broad staircase leading to the darkened upper floors. Under Neil Austin’s crepuscular lighting, the place looks like a cross between the Hotel Cortez in “American Horror Story” and the Haunted House at Disneyland.\n\nA patina of grime contributes to the old hotel’s gloomy air of being stranded in time. But now and then sound designer Adam Cork pipes in sounds from the outside world — a discordant symphony of horns, whistles, sirens and screams that captures the hard-pumping heart of the city. The atmosphere is so thick with depression, it’s no wonder Erie puts off going to his room. It’s the perfect graveyard for the death of a man’s dreams.\n\nLike the once grand hotel, Whitaker’s washed-up gambling man has seen better days. At one time, when his shabby suit and battered fedora were fresh and new, the outfit must have looked snazzy. But it’s as worn-out and tired as he is, and no longer up to the pretense of being flash.\n\nThere’s not really much of an arc to this one-hour play, which is essentially an extended monologue from a man who is running — and talking — for his life. Erie owes money to the loan sharks who literally collect an arm and a leg from deadbeats, and he needs a safe hideout. And although he eventually admits that he’s in trouble and “moanin’ low,” he’s not asking for a handout, or even sympathy from the sullen night clerk.\n\nWhat Erie wants is his luck back, a need made palpable in Whitaker’s heartfelt performance. His late friend, Hughie, was also his good-luck charm, and since he died, Erie’s luck has dried up. As he sees it, his only hope is to find a replacement. But the new guy is deaf, dumb and blind to the pathos of Erie’s grief for his friend.\n\nWood’s immobile face and poker-stiff spine are strong indications that Charlie is not only aware of Erie’s desperate need, but also determined to resist it. Both actors have their best moments during this tug of wills. Wood makes Charlie’s silence seem both menacing and merciless, while Whitaker lays bare Erie’s terror of being alone with himself in this empty hotel in this cruel city.\n\nThere’s no denying the suffering humanity that O’Neill saw in poor Erie. But Whitaker’s hangdog vulnerability makes it tough to believe in Erie’s better days — and besides, there’s no pretending that “Hughie” is much more than a warm-up for “Iceman,” a far more devastating study of life as living death.",
  "isFullReview": true,
  "dtliExcerpt": "Whitaker brings a touching vulnerability to Erie Smith, the small-time gambler and big-time dreamer at the center of O'Neill's meditation on loneliness and the human need for connection.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Whitaker brings a touching vulnerability to Erie Smith, the small-time gambler and big-time dreamer at the center of O'Neill's meditation on loneliness and the human need for connection.",
  "contentTier": "complete",
  "contentTierReason": "Short text (28 words)",
  "rejectedAt": "2026-02-03T16:53:35.655Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or quote from a review, not a complete review that can be properly scored for recommendation strength.; openai: The text provided is about a performance by Whitaker in a play by O'Neill, which does not match the target show.",
  "promptVersion": "5.2.0",
  "playbillVerdictUrl": "http://variety.com/2016/legit/reviews/hughie-review-forest-whitaker-broadway-1201713997/",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "textWordCount": 660,
  "archivePath": "data/archives/reviews/hughie-2016/variety--charles-isherwood_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:09:31.165Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 660,
  "tierReason": "Full review text"
}