{
  "showId": "hughie-2016",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2016/02/theater-review-hughie.html",
  "publishDate": "February 26, 2016",
  "fullText": "Whitaker brings his trademark intensity to the role of Erie Smith, the small-time hustler who desperately needs someone to listen to his stories, even if that someone is just a night clerk who barely pays attention.",
  "isFullReview": false,
  "dtliExcerpt": "Whitaker brings his trademark intensity to the role of Erie Smith, the small-time hustler who desperately needs someone to listen to his stories, even if that someone is just a night clerk who barely pays attention.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Whitaker is a fine film actor who has brought method intensity and authenticity to a variety of highly dramatic characters, from Charlie Parker to Idi Amin. But the method technique isn't a good match for Hughie, even if Al Pacino made a success of Erie on Broadway in 1996. The role requires not just the deep dive into personality that the Method suggests but the huckster tricks and verbal animation of a true stage animal. (The original Broadway Erie, in 1964, was Jason Robards.) Whitaker is so interiorized he seems catatonic, with peculiar diction, a strange accent ('dolls' is rendered as 'dawls'), and a way of chopping up sentences that suggests he has only a tentative grip on the lines. He moves well, which is to say idiosyncratically, with a rolling gait and a charadeslike intensity of hand movement that might well make the characterization visible if it weren't so inaudible. Even so, you spend a lot of the time looking at Wood, a theatrical creature through and through, doing much more with much less.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-HUGHIE-Opens-on-Broadway-Updating-LIVE-20160225",
  "showScoreExcerpt": "Whitaker brings his trademark intensity to the role of Erie Smith, the small-time hustler who desperately needs someone to listen to his stories, even if that someone is just a night clerk who barely pays attention.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (36 words)",
  "rejectedAt": "2026-02-03T16:50:02.615Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single descriptive sentence about a performance, not a complete review with critical evaluation or recommendation; openai: The text provided is a brief character description and does not contain evaluative content or a verdict about the show.",
  "promptVersion": "5.2.0",
  "playbillVerdictUrl": "http://www.vulture.com/2016/02/theater-reviews-pericles.html",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 5
}
