{
  "showId": "a-dolls-house-part-2-2017",
  "outletId": "broadwaynews",
  "outlet": "Broadway News (Charles Isherwood)",
  "criticName": "Charles Isherwood",
  "url": "http://broadway.news/2017/04/27/review/a-dolls-house-part-2-review/",
  "playbillVerdictUrl": "http://broadway.news/2017/04/27/review/a-dolls-house-part-2-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright"
  ],
  "fullText": "The frenetic Broadway spring comes to a thrilling conclusion with the lightning-bolt opening of Lucas Hnath’s “A Doll’s House, Part 2,” a new play so endlessly stimulating that it could give audiences fodder for heated conversation until the fall season is in full swing.\n\nThe commercial theater, or for that matter the non-commercial theater, does not regularly present us with new plays of ideas — let alone comedies of ideas. Hnath’s play fairly sets your head spinning with its knotty perspectives. Each scene in this whiplash-inducing (in a good way) play flashes forth a new revelation to absorb and process, although it has only four characters — and, yes, they are all essentially holdovers from the 1879 Ibsen play that Hnath is both honoring and interrogating.\n\nIbsen’s famous, once infamous, drama, about a doting but irresponsible housewife who discovers, to her disorientation, that she is an individual with a mind and a soul to explore, has never been known as a laugh-generator. Hnath’s title, on the other hand, suggests a one-note gag, a higher-brow “Saturday Night Live”-style sketch sending up a revered classic.\n\nBut while he takes some welcome pleasure in playing up the novelty of the premise — “A Doll’s House, Part 2” is often mordantly funny, and the language is contemporary — Hnath’s play is fundamentally, and profoundly, serious: an exploration of our responsibilities to ourselves and to others; a dissection of the existential problems of marriage and intimacy; and a moving examination of the hard price that must be paid for self-fulfillment, today as much as back in the 19th century.\n\nStill, for all its intellectual richness, this is not a dreary “they-loved-it-in-London?” evening at the theater that will have you furtively checking your (proverbial) watch. With a sterling cast led by Laurie Metcalf, playing Ibsen’s door-slammer Nora Helmer some years after the echo of that calamitous act has died down, the production is as much an engrossing entertainment as it is a theatrical treatise that stirs the heart even as it invigorates the mind.\n\nThe play begins, wittily, with Nora knocking on the same door through which she departed so dramatically. Fifteen years have passed, and Nora has established herself as a novelist, writing incendiary books about women much like herself, seeking to free themselves from the confines of marriage and the rigid social order of 19th-century Norway. But because her books have caused other women to hang up their aprons and head for the hills, Nora finds herself in legal jeopardy.\n\nShe has been writing under a pseudonym, but her real identity has been discovered. Nora assumed that her husband, Torvald (Chris Cooper), had legally divorced her after she left. He never did. And so, as a technically married woman, Nora has been breaking the law by signing contracts, banking money, having lovers — all forbidden to espoused women in ye olde Norway. She urgently needs Torvald to make their divorce legal, and thus save herself and her reputation.\n\nHenry James once described Ibsen’s plays as being fundamentally about “the individual caught in the fact.” Hnath pursues the theme, writing here about the new facts and new emotional traps that might have ensnared Nora after she left. The urge toward self-fulfillment and independence — noble ideals, to be sure — may come at a painful price for both those who seek them and those who might be seen as the collaterally damaged.\n\nThe play, directed with his usual intelligence and incisiveness by Sam Gold, proceeds as a series of taut, sometimes volatile moral debates, staged on a clean white set (by Miriam Buether) with just a few chairs — the better to leave room for the play’s abundant ideas to breathe.\n\nNora first tries to cajole her former nanny, Anne Marie (Jayne Houdyshell, priceless as ever), into helping her win over Torvald to her plan. But Anne Marie, who had to help raise Nora’s children after she left, proves a recalcitrant ally, for all her sympathy. She has witnessed firsthand the grave toll Nora’s departure took on her family, and in a testy, moving moment, she fires back when Nora attempts to suggest that Anne Marie, too, left her child and husband behind to take care of Nora’s. Unlike the comparatively well-heeled Nora, Anne Marie had no choice but to take the job that came to her.\n\nAlthough Nora holds fast to her belief that wedlock is a tool of oppression promulgated by a society intent on the subjugation of women (“Marriage is cruel and it destroys women’s lives,” she bluntly tells Anne Marie), through the play’s other characters Hnath upends easy assumptions about the character and her actions. He searches out and dissects the subtler nuances beneath the symbolism.\n\nWhen Nora meets the wary, stunned Torvald, played with an affecting sense of simmering inner turmoil by Cooper, he deflects her grandstanding by revealing how she had been manipulative and selfish when they were married: It takes two people to create a dysfunctional relationship, after all. Having had years to reflect on the past, he points the finger of blame back at Nora, saying, “The moment that you brought the problem to light you walked out the door.” Score one for Torvald.\n\nNora’s encounter with her daughter Emmy, played by the simply magnificent Condola Rashad, turns out to be just as charged with complicated feeling. With her bright eyes beaming confidence, Rashad creates a portrait of an intuitively smart young woman who is not the wounded and regretful daughter one might have expected. Emmy confesses to Nora, with no rancor, that in fact her mother’s leaving may have ushered her into maturity because it gave her an early acquaintance with “difficult truths about life.”\n\nAnd Emmy defends with a bright lucidity her own sturdy idea that marriage is an institution whose merits are inseparable from its constrictions: “It’s the fact that we’re bound together, that it’s difficult to leave, that actually makes people stick around and try,” she says, envisioning a bleak future where “everyone is leaving each other.” (Sound familiar?) Score one for Emmy.\n\nBut Hnath’s play is by no means a rebuke to the image of Nora as an inspiring image of a woman’s right to shape her own destiny. When it comes to moral reasoning and ethical logic, his Nora gives as good as she gets. Metcalf here delivers what is easily her finest Broadway performance to date — and she has never been less than terrific. Keeping a firm focus on the character’s fortitude and intelligence, she seasons the performance with wryly funny moments of blank-faced surprise, as Nora is brought up against the truth that she isn’t in possession of the only valid view of her own actions — or anyone else’s.\n\n“A Doll’s House, Part 2” moves gently to a surprising, moving conclusion. Nora and Torvald still firmly hold to their beliefs in the rightness of their actions, but must acknowledge that the problem of living has defeated them. Then as now, to seek fulfillment of the self is impossible without the mirror of other people, in whom we can sometimes see ourselves more clearly than we can alone. Hnath’s play is far too complex to be boiled down to a single apothegm. But it reminded me, at least, that if it sometimes seems impossible to live with people — those ever-changeable, maddening creatures we may want to embrace one minute and kick in the shins the next — it’s absolutely impossible to live without them. █",
  "isFullReview": true,
  "textWordCount": 1248,
  "archivePath": "data/archives/reviews/a-dolls-house-part-2-2017/broadwaynews--charles-isherwood_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:14:14.749Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.goto: net::ERR_NAME_NOT_RESOLVED at http://broadway.news/2017/04/27/review/a-dolls-house-part-2-review/\nCall log:\n  - navigating to \"http://broadway.news/2017/04/27/review/a-dolls-house-part-2-review/\", waiting until \"domcontentloaded\"\n"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20170519044921",
  "archiveOrgUrl": "http://web.archive.org/web/20170519044921/http://broadway.news:80/2017/04/27/review/a-dolls-house-part-2-review/",
  "contentTier": "complete",
  "wordCount": 1248,
  "tierReason": "Full review text",
  "showScoreExcerpt": "\"So endlessly stimulating that it could give audiences fodder for heated conversation until the fall season is in full swing...Hnath’s play fairly sets your head spinning with its knotty perspectives...With a sterling cast led by Metcalf, the production is as much an engrossing entertainment as it is a theatrical treatise that stirs the heart even as it invigorates the mind...Metcalf here delivers what is easily her finest Broadway performance to date—and she has never been less than terrific.\"\n\nRead more"
}