{
  "showId": "a-dolls-house-part-2-2017",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Alexis Soloski",
  "url": "https://www.theguardian.com/stage/2017/apr/27/a-dolls-house-part-2-review-sophisticated-sequel-offers-vibrancy-and-wit",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2017/apr/27/a-dolls-house-part-2-review-sophisticated-sequel-offers-vibrancy-and-wit",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "‘... less a conventional sequel than a thought experiment inspired by the original’ ... Laurie Metcalfe in A Doll’s House Part 2 Photograph: PRView image in fullscreen‘... less a conventional sequel than a thought experiment inspired by the original’ ... Laurie Metcalfe in A Doll’s House Part 2 Photograph: PR This article is more than 8 years oldReviewA Doll’s House, Part 2 review – sophisticated sequel offers vibrancy and witThis article is more than 8 years oldGolden Theater, New York\n\nLaurie Metcalf gives a thrilling performance in a speculative follow-up to Henrik Ibsen’s defining 1879 masterwork\n\nThere are sofa plays and dinner table plays. Plays about beds and bathtubs, armchairs and kitchen sinks. Henrik Ibsen’s A Doll’s House, the 1879 masterwork and shocker, is a drama about a door. So is Lucas Hnath’s A Doll’s House Part 2, a brisk and brainy sequel, directed by Sam Gold, which has entered Broadway at the close of the season.\n\nA Doll’s House ends with Nora Helmer walking out her front door, leaving behind her husband, young children and cardboard marriage in order to fulfill her duty to herself. George Bernard Shaw described her parting gesture as the “slam heard round the world.”\n\nRead moreA Doll’s House, Part 2, begins with that same door, now black and 10ft tall, but it trades the climactic slam for a resolute knock. Those rapping knuckles? They belong to Nora (Laurie Metcalf), who has returned to the home of Torvald, her former husband, after a 15-year absence.\n\nHnath’s play is less a conventional sequel than a thought experiment inspired by the original. Luckily, Hnath, whose formally inventive plays include Isaac’s Eye and The Christians, is no mean thinker. His scenes, typically structured as two-character conversations between Nora and Torvald (Chris Cooper), Nora and her daughter (Condola Rashad), Nora and her former nanny (Jayne Houdyshell), read as answers to an interior FAQ: what would bring Nora back? How would those she’s left behind receive her? Has she achieved emancipation? At what cost?\n\nProvocatively, the play functions as both homage and riposte, casting a critical eye on Nora’s choices and trying to wrestle with their consequences. The play can even be read as a forceful critique of self-actualization, one that shows the selfishness of the to-thine-own-self approach. Though Hnath revives, Ibsen’s denunciation of bourgeois marriage, he doesn’t necessarily support its door-slamming alternative. Torvald questions whether the braver thing might have been to stay. Emmy, newly engaged, even argues for marriage’s benefits. “Don’t make my wants about your wants,” she tells her mother.\n\nPerhaps this make the play sound rather dry and intellectual. It isn’t. Hnath writes fast, vibrant dialogue – much of it in a salty, modern vernacular – and while Gold inserts a few postmodern touches, he mostly pushes the actors onstage and has them talk things over with hustle and vigor. The performers are excellent, particularly Metcalf, an actress who vibrates with emotive intensity – a bipedal tuning fork – and can switch from warmth to cruelty at the turn of a heel. Her first entrance is a gripping concatenation of anticipation, anxiety, pleasure, nostalgia, and probably some other things, too.\n\nShe’s a thrilling performer and she nearly makes you forget than the play succeeds far better as a vivid and playful philosophical exercise than as a character-driven drama. (Ibsen managed both, but that’s a high bar.) Yes, Hnath offers a morsel of plot – documents and blackmail attempts, just as in the original – but most audience nails will go unbitten.\n\nThis shouldn’t put ticket buyers off. The play’s sophisticated arguments about what we owe to ourselves and to each other, about how liberation can become illiberal are welcome mat enough. Step in.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 635,
  "archivePath": "data/archives/reviews/a-dolls-house-part-2-2017/guardian--alexis-soloski_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:15:12.491Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 635,
  "tierReason": "Full review text"
}