{
  "showId": "a-dolls-house-part-2-2017",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2017/08/28/theater/a-dolls-house-part-2-julie-white-stephen-mckinley-henderson.html?smid=tw-nytimesarts&mtrref=undefined",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "Like most critics, I thought \"A Doll's House, Part 2,\" the what-if sequel to Ibsen by Lucas Hnath, was already great when it opened in April. But a play's true greatness may hinge on how well it absorbs, or reshapes itself around, the succession of casts that enact it. That was going to be a high bar in this case. The entire original foursome - Laurie Metcalf, Chris Cooper, Jayne Houdyshell and Condola Rashad - was nominated for Tony Awards; deservedly, Ms. Metcalf won. Still, the new cast in pl",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-The-Critics-Check-In-with-the-New-Stars-of-A-DOLLS-HOUSE-PART-2-20170828",
  "contentTier": "complete",
  "fullText": "https://www.nytimes.com/2017/08/28/theater/a-dolls-house-part-2-julie-white-stephen-mckinley-henderson.htmlShare full articleAdvertisement\n\nLike most critics, I thought “A Doll’s House, Part 2,” the what-if sequel to Ibsen by Lucas Hnath, was already great when it opened in April. But a play’s true greatness may hinge on how well it absorbs, or reshapes itself around, the succession of casts that enact it.\n\nThat was going to be a high bar in this case. The entire original foursome — Laurie Metcalf, Chris Cooper, Jayne Houdyshell and Condola Rashad — was nominated for Tony Awards; deservedly, Ms. Metcalf won. Still, the new cast in place since July 25 pretty much seals the deal on the play’s extraordinary merits.\n\nLet’s call them collectively “A Doll’s House, Part 2.1”: Julie White as Nora, the runaway wife who returns on an urgent mission 15 years after slamming the door; Stephen McKinley Henderson as Torvald, the husband she jilted; Erin Wilhelmi as Emmy, their 19-year-old daughter, on the verge of her own marriage; and Ms. Houdyshell, the only holdover from the original cast, as Anne Marie, the weary nanny who knows them all better than they know themselves.\n\nThe new actors advance Mr. Hnath’s whirling arguments about love and ownership with as much ease as the original cast, and even greater humor. Ms. White, with her perma-sparkle and slight Texas accent, is a more nervous and ingratiating Nora than was the swaggering Ms. Metcalf; she wrings laughs everywhere she can, even from the flip of her skirt as she finishes her arias. By suggesting Nora’s need to deflect tension, this has the effect of making her a more vulnerable creature. With the original cast, you feared she might eat Torvald whole. With this one, you worry whether she will ever get out of the house again.\n\nThat useful tension is also the result of Mr. Henderson’s immense gravitas. Though only two years older than Mr. Cooper, he reads much older; the director, Sam Gold, has restaged the action to keep him stolidly seated much of the time, like a monument. In that physical contrast — Ms. White is a reed — you immediately understand how scary he must have seemed to the younger Nora, and why she might have felt she had no recourse but leaving. Mr. Henderson, too often confined to sidekick roles, here holds the stage completely on the strength of Torvald’s bitter anger. He’s superb.\n\nThe changes in the play’s central relationship are nicely recapitulated in Ms. Wilhelmi’s performance as the daughter with a mission of her own; echoing her mother as played by Ms. White, she is more instinctive and apparently guileless in her manipulation than was Ms. Rashad, who echoed Ms. Metcalf’s businesslike brutality. As for Ms. Houdyshell, she seems to have enriched both the sweet and sour of her characterization through a process of marination in the more evenly matched conflict around her.\n\nThe result of all these macro- and micro-tunings is a production that feels even more thrillerlike in its swiftness. Though it takes on very serious themes — about marriage, of course, but also about the distortions of identity that come from trying to behave honorably in a dishonorable society — “A Doll’s House, Part 2” remains a triumph of ambivalent feminist comedy. It’s the kind of play you hope won’t end: not after 90 minutes nor even after five months.\n\nA Doll’s House, Part 2Golden Theater",
  "isFullReview": true,
  "textWordCount": 559,
  "archivePath": "data/archives/reviews/a-dolls-house-part-2-2017/nytimes--jesse-green_2026-02-05.html",
  "textFetchedAt": "2026-02-05T01:07:08.345Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "misattributedFullText": true,
  "extractedByline": "Laurie Metca",
  "expectedCritic": "Jesse Green",
  "wordCount": 559,
  "tierReason": "Full review text"
}