{
  "showId": "a-dolls-house-part-2-2017",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://variety.com/2017/legit/reviews/a-dolls-house-part-2-review-laurie-metcalf-1202401480/",
  "playbillVerdictUrl": "http://variety.com/2017/legit/reviews/a-dolls-house-part-2-review-laurie-metcalf-1202401480/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "So, did Godot ever show up? Were George and Martha able to save their marriage? And whatever happened to Nora after she slammed the door? In “A Doll’s House, Part 2,” Lucas Hnath pulls off the dramatic parlor trick of bringing back Ibsen’s iconic heroine — in the incomparable person of Laurie Metcalf — to answer that question 15 years later. Despite the modern idiom that Hnath slings around with gleeful humor, it’s amazing how women’s lives haven’t changed.\n\nIt’s the very end of the 19th century when Nora Helmer (Metcalf, at her merry revels) returns to Norway to take care of some unfinished business with her former husband, Torvald, played by Chris Cooper, who really gets under the skin of this broken man. The family housekeeper, Anne Marie, irrepressibly funny in the hands of Jayne Houdyshell, is astonished to see how prosperous her onetime mistress looks, in the stunning outfit and matching feathered hat designed for her by David Zinn.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Tomb Raider' Star Martin Bobb-Semple Signs With CAA (EXCLUSIVE) \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Robin Hood' Showrunner John Glenn Signs With Range Media Partners (EXCLUSIVE)\n\nHelmer Sam Gold knows his players and right from this first scene pairs them in a series of close encounters that feel like fierce, if friendly wrestling matches. What did Ann Marie expect, Nora wants to know — a famished and diseased wretch? “I think there’s something in our time and place and culture,” Nora says, “that teaches us to expect and even want for women who leave their families to be punished.” Hnath’s dialogue, slangy and vulgar and brightly idiomatic, is full of zingers.\n\nNora certainly confounds Anne Marie’s unkind expectation. She’s making a lucrative living, thank you very much, as the author of popular women’s books about “the way the world is towards women, and the ways in which the world is wrong.” She is, in fact, a controversial author, outspoken in her belief that marriage is a pointless custom that stifles both parties. In the show’s piece de resistance, Metcalf delivers a dazzling lecture on the subject. “In the future, 20 – 30 years from now, marriage will be a thing of the past. People will have many spouses in a life, even many spouses as one.”\n\nMetcalf is amazing, uncovering so many facets to Nora — her intelligence, her wit, her pluck, her courage — while retaining the humor to laugh at her idiocies. But by now, we’re starting to suspect that this isn’t really a play, but a very funny and quite biting manifesto that Nora could just as easily deliver to an auditorium of avid students in women’s studies.\n\nThere is the hope, of course, that Hnath will put Nora’s futuristic views into some dramatic context, which makes us perk up when this wayward wife and mother meets her daughter, Emmy. Condola Rashad, who is quite a beauty, gives a lovely, restrained performance. (“Very grown up. Very adult. Very impressive,” Nora says.) But Nora’s daughter is no match fo her mother, and the discord between them remains coolly intellectual. “You don’t know what I’m trying to do for you,” Nora says, with some urgency. “the kind of world I’m trying to make for you.”\n\nTorvald — so stern and righteous, so assured of his manly rights in Ibsen’s play — would seem a more formidable opponent. And Cooper certainly has the presence to assert himself as the proud man he once was. But Torvald still loves Nora, and despite having some good weaponry at hand, his obvious pain has drained his spirit.\n\nNora wins every verbal battle, as she will go on to win future conflicts with the society she intends to change. But would it depress her to know that, many, many years in the future, we still haven’t passed the Equal Rights Amendment?",
  "isFullReview": true,
  "textWordCount": 634,
  "archivePath": "data/archives/reviews/a-dolls-house-part-2-2017/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T17:05:53.432Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 634,
  "tierReason": "Full review text"
}