{
  "showId": "a-dolls-house-part-2-2017",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "http://www.vulture.com/2017/04/theater-reopening-that-door-with-a-dolls-house-part-2.html",
  "publishDate": null,
  "fullText": "|\n \n \n Dismiss\n \n \n \n\n \n \n \n \n\n \n\n \n Things you buy through our links may earn Vox Media a commission.\n\nLaurie Metcalf and Condola Rashad in A Doll’s House, Part 2.\n Photo: Brigitte Lacombe\n \n \n \n Naturally it begins with a knock on the door. How else could a play called A Doll’s House, Part 2 start, when Part 1, the 1879 Ibsen classic, ended with that same door slamming? In the original, Nora Helmer, wife and mother and mischievous little squirrel, leaves her family (and shocks the world) in hopes of remaking herself as a coherent person outside the strangling orthodoxies of church, law, and men. In Lucas Hnath’s thrilling imaginary sequel, opening tonight on Broadway, she has achieved just that. She returns to her home, 15 years after escaping it, a wealthy author whose books, written under a pseudonym, urge what we might now call free love, or at any rate the abolition of marriage. The only problem, as we soon learn, is that she herself remains married. The divorce that husband Torvald was supposed to procure was not, for some reason, procured. As such, all contracts and investments she has made in the interim are void; Norwegian law at the time did not allow a married woman to transact business. Unless she can get Torvald to do the right thing, she is now worse off than the doll she once was: She’s a nonentity. And possibly a criminal one.\n\nAh, but what is the right thing? As directed by the inerrant Sam Gold, Hnath’s play is at its core a public forum on questions of marriage that still bedevil us. Is wedlock ownership? May one love only once? How can people expect to stay together when they are always, individually, changing? Even as you are sucked into the pleasures of the drama that fleshes out these questions, the physical production locks you into a larger framework. Thus Miriam Buether’s spare set, though it adequately sketches the hall of the Helmer home, functions largely as a kind of dais from which Nora especially — but also Torvald, their daughter, Emmy, and Emmy’s old nanny Anne Marie — expound one side or another of the debate. Sometimes they even come downstage onto a built-out thrust and declaim as if in a presidential “town meeting.” Projected titles between scenes act as bullet points, pulling you briefly out of the action and reminding you of the agenda.\n\nNot that the 90 intermissionless minutes pass didactically. Though he is deeply interested in argument — his marvelous play The Christians was mostly a dispute about faith — Hnath provides enough ingenious structure to allow A Doll’s House, Part 2 to function quite smoothly as an often hilarious puzzle drama. Each move made by one of the characters boxes the others into a different corner, so while you are thinking about what marriage means today you are also thinking about how Nora (Laurie Metcalf) will get what she wants without ruining Torvald (Chris Cooper), alienating Anne Marie (Jayne Houdyshell), or crushing Emmy (Condola Rashad) as she plans her own marriage. Still, unlike other classic sequels, including the 1982 musical A Doll’s Life, which also imagined Nora after the door slam, Hnath’s play does not steal most of its energy from the original. For one thing, though the costumes (by David Zinn) are period, the language he assigns to the characters is contemporary, the anachronism being a major source of humor. (“Oh well, shit, Nora, shit!” cries Anne Marie.) Especially in the mouth of Emmy, herself Nora-like in her squirrely intelligence, the self-assured yet up-speak cadences demonstrate that the issues a smart, well-off 19-year-old girl faced then are closer to the ones she would still face today than we might like to think.\n\nRashad’s witty performance drives that home; she’d make a great Elle Woods, including the Harvard law degree. And if Cooper, whose role as the unwoke Conventional Man is naturally the hardest to theatricalize, does not quite shine until the end, he provides excellent support throughout (which is more than Torvald did). But it’s Metcalf and Houdyshell who are giving the master class here, never more so than in their tête-à-tête scenes of mutual passive-aggression. So many lines that in the script seem to barely convey information, or are indicated by nothing but three cryptic dots, play between them as full-throated drama; you may wonder whether they are making up a play on top of Hnath’s. But no, it’s just extraordinarily detailed, in-the-moment acting. Houdyshell’s version is less varnished, as befits a character whose life choices were not even as varied as Nora’s; she gave up raising her only child when she was hired to nanny Nora herself. Metcalf is a wonder of swaggering alertness, alive not only to the actors around her but also to her own performance. You can actually see her hearing what she’s saying, and adjusting as she goes along. This self-awareness is properly Nora’s, and Metcalf’s skill allows a character who starts out as a brilliant playwriting notion to turn very deeply moving, as she finally begins, not for the first time, to see the consequences of her own failings, not just her husband’s.\n\nI have suppressed the impulse to interrogate the logic of the story too carefully; though it makes an unusually strong case for the road it takes, surely there are potholes. But this is not the point. Hnath is not using the preexisting characters and their backstory (let alone the real woman — a friend — on whom Ibsen based the tale) as ways of avoiding having to create something original; rather, they are springboards to something very new indeed. The march of progress, halting as it is, has allowed a male playwright in 2017 to write a work that the inhabitants of A Doll’s House (Part 1) in 1879 could never have imagined: a great feminist comedy. By that I mean a stand-alone work that glories in the self-interest and correctability of all women — and all men.\n\nA Doll’s House, Part 2 is at the Golden Theatre through July 23.\n\nThis is my last column as the theater critic for New York Magazine and Vulture. How nice that I get to end my tenure, after some 435 reviews, with exactly the kind of play I have most enjoyed seeing and writing about. Theater serves many functions (for those who can afford it): to educate, to uplift, to remind, to console. The occasional mindless distraction, short of Jekyll & Hyde, is also welcome. But the best works, though they may be divisive, unite, if not in opinion then in shared experience. I sometimes feel when I take my seat at the theater that I am strapping into the gondola of a sideshow loop-de-loop with a thousand, or a hundred, or just ten of my temporary earthly neighbors. We scream together, sometimes pant from laughing, occasionally cry in proximity. Thanks, neighbors, for sharing the ride.\n\nShow \n \n \n Leave a Comment\n \n\n Theater: Reopening That Door With A Doll’s House, Part 2\n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"As directed by the inerrant Sam Gold, Hnath’s play is at its core a public forum on questions of marriage that still bedevil us...Hnath provides enough ingenious structure to allow 'A Doll’s House, Part 2' to function quite smoothly as an often hilarious puzzle drama...Hnath is not using the preexisting characters and their backstory as ways of avoiding having to create something original; rather, they are springboards to something very new indeed...A great feminist comedy.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 1178,
  "archivePath": "data/archives/reviews/a-dolls-house-part-2-2017/vulture--jesse-green_2026-02-06.html",
  "textFetchedAt": "2026-02-06T02:18:54.631Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250708143125",
  "archiveOrgUrl": "http://web.archive.org/web/20250708143125/https://www.vulture.com/2017/04/theater-reopening-that-door-with-a-dolls-house-part-2.html",
  "wordCount": 1178,
  "tierReason": "Full review text"
}