{
  "showId": "death-of-a-salesman-2026",
  "outletId": "broadwaynews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://broadwaynews.com/2022/10/09/director-miranda-cromwell-breathes-stunning-black-life-into-death-of-a-salesman/",
  "publishDate": null,
  "fullText": "For over 73 years, “Death of a Salesman” has gotten away with its foreboding title. Ironically, no play in the theater canon better asserts its characters’ aliveness. Sure, Willy Loman’s demons loom. The show’s opening scene details the weary-of-travel traveling salesman’s pesky tendencies to dri... For over 73 years, “Death of a Salesman” has gotten away with its foreboding title. Ironically, no play in the theater canon better asserts its characters’ aliveness. Sure, Willy Loman’s demons loom. The show’s opening scene details the weary-of-travel traveling salesman’s pesky tendencies to drive recklessly, contradict himself and ramble into the void. But bad habits and hysteria are hardly death sentences. It’s not until Willy’s wife, Linda, tells the couple’s two sons, Biff and Happy, that their father is courting eternity, that we truly tap into what is at stake here: suicide. Still, not for one minute during the 190 of the current revival at the Hudson Theatre — where so much of Willy’s achingly complicated life is on display — did I feel nervous about his death. Over time, a lot has been made of the universality of “Death of a Salesman” and how this story — which in most major productions has centered on a white family in the 1940s — retains contemporary relevance across race, gender and time. The current Broadway staging, in which dark-skinned Black actors have been cast as the Lomans, proves the opposite to be true. While as written, Arthur Miller’s “Death of a Salesman” can claim ubiquitousness, director Miranda Cromwell’s production — which stars Wendell Pierce as Willy, Sharon D Clarke as Linda, Khris Davis as Biff and McKinley Belcher III as Happy — is a pointed investigation of Black survival. Scenes that call for a Loman to interact with someone outside the family (mostly portrayed by white actors) tilt in the face of racial discrimination: Willy being infantilized by his much younger white boss, Biff being ushered to the back of a restaurant by a white server, or even Happy’s boasts of sexually “ruining” the young wives of executive managers. Not a lick of Miller’s script has been altered, and yet, we’re given reams of new subtext about the anxiety, trauma, stress and stakes at hand. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 382,
  "archivePath": "data/archives/reviews/death-of-a-salesman-2026/broadwaynews-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:15:32.481Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}