{
  "showId": "death-of-a-salesman-2026",
  "outletId": "exeuntnyc-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://exeuntnyc.com/reviews/review-death-of-a-salesman-at-the-hudson-theatre/",
  "publishDate": null,
  "fullText": "A familiar play is rendered new again in Miranda Cromwell’s revival. Juliet Hindell reviews. “Death of a Salesman” at the Hudson Theatre (Photo: Joan Marcus) In this production of Death of a Salesman, that transfers from London and is now playing on Broadway, the familiar drama of the washed-out middle-aged man is given a new slant with the family at the center of the drama cast as Black. This 1949 play about a man confronting his failures and the failures of his family is also rendered new again through electrifying performances and inventive staging. Wendell Pierce as Willy Loman, the eponymous struggling salesman “riding on a smile and shoeshine”, imbues the character with a robust desperation rather than forlorn despair. Here, Willy Loman is fired up, his mental state a mania that is pushing him to the inevitable end. Sharon D Clarke also injects a new strength in Linda, Willy’s wife. Clarke’s Linda is fierce and fiery, determined to shelter her husband from the mental decline that is his fate even while he dismisses her. She closes the play with a spellbinding song that left the audience in tears. Under Miranda Cromwell’s assured direction, the production, unexpectedly, also wrings laughs. The ghost of Willy’s brother Ben is a vision in a white tuxedo, bedazzled shoes and diamond rings, costume design by Sarita Fellows and Anna Fleischle. As played by André De Shields with sly delivery, the character becomes almost as funny as he is sinister. The puffs of smoke and musical cues that herald his every entrance come over as corny and obvious, though. Several lighthearted interludes of dance also relieve the tension brewing to the climatic end. One directorial slip is the decision to have the sons Biff and Happy fall into absurd slow motion movement when Willy is once again overcome with mania. But the actors playing the sons are excellent. McKinley Belcher III brings a rare charisma to the overlooked younger son, Happy. Khris Davis, as Biff, comes into his own in the final act when he lets rip in an emotionally searing performance. The emphasis on Biff’s sporting prowess and the assumption it will lead to a bright future at a good university are just as relevant to today’s hothouse college admissions race. The fraught relationship between the father and sons and their mutual unrealistic expectations of each other are also timeless themes. The set (designed by Anna Fleischle) deftly supports the transition between the past and the present with only textually important elements such as the family’s hot water heater included in detail. An empty door frame is repeatedly used for significant entrances as it moves closer to the audience with the actor. Other scenic items hang over head and are lowered and raised as needed perhaps underlining how the past is blurring with the present for Willy. Sharply defined lighting creates angled “rooms” against the black backdrop in Jen Schriever’s lighting design. The transformational casting brings an added racial tension to the play at times. For example, when the white boss expects Willy to pick up something he has dropped it is but one moment among several others that drew gasps of outrage from the audience. However, the betrayal at the heart of the drama has not stood the test of time. Biff’s discovery of his father’s adultery seems to have lost its impact in an era of tell-all celebrity culture, ubiquitous explicit content, and oversharing. But the disillusionment between father and sons and the fragility of the American dream ring true as ever. Juliet Hindell first went to the theatre to see “A Midsummer Night’s Dream” when she was four. She’s calculated that she has since seen that play more than 2 dozen times, once in Japanese. A Brit, Juliet has made her home in London, Paris, Washington D.C., Tokyo, Hong Kong, Charlotte NC and now New York. A journalist, Juliet wavers between new writing and musicals as her favorite forms of theatre, and of course Shakespeare. Read more articles by Juliet Hindell",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 670,
  "archivePath": "data/archives/reviews/death-of-a-salesman-2026/exeuntnyc-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:16:40.584Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}