{
  "showId": "death-of-a-salesman-2026",
  "outletId": "stagebuddy-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://stagebuddy.com/theater/theater-review/death-of-a-salesman",
  "publishDate": null,
  "fullText": "The word revival suggests a renewal or improvement of something. So each time there's a Broadway revival, the director tries to change something to encourage ticket sales. The recent hit \"The Music Man” offered star power with Hugh Jackman and Sutton Foster while leaving the music and book pretty much intact.\n\nThe newest version of Arthur Miller’s “Death of a Salesman,” now at the Hudson Theatre, features a Black cast as the Loman family. Although I was concerned that the play would be changed dramatically to focus on race, my fears were quickly dispelled. The play is still moving and engrossing and the main themes remain the same. However, there are subtle changes, mostly within the original script.\n\nA traveling salesman who is always on the road, Willie (Wendell Pierce) is 63 when the story begins. He is unable to deal with the reality that he’s been a failure. His long-suffering wife Linda (the marvelous Sharon D. Clarke) feels that it’s just exhaustion because he’s still on the road. Instead of slowing down, Willie has to keep working because he is no longer drawing a salary.\n\nUnable to deal with his failing career, he retreats to the past, often speaking aloud to his successful brother Ben (Andre De Shields.) He revisits pleasant scenes from his family life when his sons still adored him.\n\nWillie is a blustering braggart who always claimed to be something that he wasn’t, but we realize that he said it so often that he had come to believe his lies. In the span of one conversation, Willie says things are fine, bragging that he made $200 in commissions and then confesses that he can barely make ends meet. As finances and relationships with his older son Biff worsen, Willie’s psyche begins to crumble. He begins to relive the stressful times, especially when Biff caught him  with a woman in his hotel room.\n\nAs Willie, Wendell Pierce is so passionate that it’s hard not to care about him even when he’s blustery and misguided. He’s pathetic but Pierce imbues him with energy and  emotion. A large powerful man, he could almost be threatening, especially when he shuts his wife up so his sons can speak.\n\nAlthough I’ve seen several versions of the play, this is the first time I recall Linda being such a strong character. Sharon Clark (“Caroline, or Change”) brings strength to the role when often Linda can be seen as a background character. As Biff, Khris Davis adds warmth and sensitivity, especially interacting with his mother. De Shields plays Ben, resplendent in a white suit with ‘diamonds’ glittering on his fingers. He glides through his scenes and is reminiscent of the character he played in Hadestown. Ben represents the road not taken.\n\nThe racial themes are subtle but powerful. Willie's boss is an imperious young white man. The scene has changed slightly. Originally Howard looks for his lighter and Willie picks it up and hands it to him. In the new version, Howard drops his lighter and waits for Willie to pick it up and light his cigarette for him. It is inevitable that the audience sees the color difference between the white boss and Black worker.\n\nIn his fantasy world, Willie tries to hide the woman he’s been seeing from his son who has come to Boston unexpectedly. Ushering her into the bathroom, he says “I think there's a law in Massachusetts about it, so don’t come out.” Although the line was in the original script, the audience can now view it as a caution about a mixed race relationship.\n\nRace adds another dimension to this new version of the “Death of A Salesman,” a subtext while enhancing the bigger message. Willie tries to play the game, by trying to figure out what the secret to success is but fails tragically. He thinks popularity and “being well-liked” are the keys.\n\nArthur Miller’s classic character, based in part on his own Jewish uncle salesman, represents Everyman and now with the revival it represents the Black Everyman as well.\n\nHudson Theatre\n141 W.44th Street\nNew York, NY",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 682,
  "archivePath": "data/archives/reviews/death-of-a-salesman-2026/stagebuddy-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:20:54.480Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251114143731",
  "archiveOrgUrl": "http://web.archive.org/web/20251114143731/https://stagebuddy.com/theater/theater-review/death-of-a-salesman"
}