{
  "showId": "death-of-a-salesman-2026",
  "outletId": "thefrontrowcenter-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://thefrontrowcenter.com/2022/10/death-of-a-salesman-2/",
  "publishDate": null,
  "fullText": "Posted by Sarah Downs | Oct 28, 2022 | Reviews\n\nDeath of a Salesman on Broadway is epic  Economically staged on an other-wordly skeletal set of suspended furniture, windows and door frames, dramatically lit in strong shadow, the production is compelling in its visual simplicity and emotional depth.  Towering above all other elements, however, is Wendell Pierce as Willy Loman.\n\nPierce gives a gigantic performance.  From loudest bombast to tiniest whisper, he plays every emotional color, digging into Willy’s soul, mining it for every nugget of character – and each of them is pure gold.  His is a deeply rooted, authentic and ultimately devastating portrayal of a man whose world is falling apart. As his wife Linda, Sharon D. Clarke is a perfect foil.  She is the balm soothing his anxiety.  Clarke moves and speaks with dignity, warmth and beauty.  When she fiercely defends Willy to her sons, you feel it in your bones.\n\nWilly is trapped in his own preconceptions.  Obsessed with his son Biff (Khris Davis) and the future Willy has projected for him, a future Biff also anticipated before his relationship with his father came apart, Willy cannot let go of fantasy.  Davis builds his character as the favored son at a slow burn, from awkward reunion to devastating denouement.  He comes into focus as the evening progresses peeling back the layers of vulnerability.  Davis enjoys an easy chemistry with McKinley Belcher III as Biff&#8217;s brother Hap.  Hap for “Happy” really should be Hap for hapless.  Belcher bounces with the youth he has not been able to leave behind, stuck in time as he continually tries to please his father or at least catch a moment of his attention.  Favoring Biff over Hap, Willy sets both of his sons up for failure.\n\nThe magnificent André de Shields weaves his own magic throughout the piece, appearing as the phantom of Willy&#8217;s uncle Ben in Willy&#8217;s imagination.  Dazzling in bright white suit and sparkling shoes, a diamond ring on every finger, Ben is like a cool cat Angelic Master of Ceremonies, the fantasy of wealth just out of reach.\n\nWilly admires Ben’s renegade road to success, and yet Willy cannot himself look laterally for work opportunities.  His neighbor and friend Charley (an excellent Delaney Williams) offers him a job, but no, Willy is a company man, convinced that loyalty actually means something to the powers that be.  Blake deLong is excellent as Willy’s slippery boss Howard.  DeLong’s energy is precise and straightforward as a self-centered, smooth operator who just wants to be rid of a problem employee.  The image of a young man lording it over an older man hits next level uncomfortable when the young man is white and the older man is black.  In 1949.\n\nDirector Miranda Cromwell trusts the material and her actors, and as a result the text resonates equally for a black American family as a white one, telling a universally relevant human story.  The difference of context adds something essential to the canon of work that explores the existential grief of the invisible working man, without sacrificing the integrity of the original play.  The audience can imagine what effect the racial context on Loman’s career has been, but the play itself does not broadcast to us what those thoughts should be.  When you sit back at the final moment, the tide of emotion washing over you leaves you breathless.  This is why we go to the theater.\n\nDeath of a Salesman, by Arthur Miller, directed by Miranda Cromwell.\n\nWith:  Wendell Pierce, Sharon D. Clarke, Khris Davis, McKinley Belcher III, Blake DeLong, Andre de Shields, Lynn Hawley, Grace Porter, Stephen Stocking, Chelsea Lee Williams, Delaney Williams, Melvin Abston, Jerome Preston Bates, Brandon E. Burton, Mat Hostetler, Maya Jackson, David Rosenberg, Lisa Strum, Chris Thorn, and Shona Tucker.\n\nScenic and costume Design by Anna Fleischle , co-costume design by Sarita Fellows, lighting design by Jen Schrievero, sound design Mikaal Sulaiman, wig design by Nikiya Mathis.  TaNisha Fordham, Associate Director.  Femi Temowo, Composer.\n\nPresented by the Young Vic  at The Hudson Theatre (139-141 West 44th St.), October 9, 2022 through January 15, 2023.  For schedule and tickets click HERE or go to:  www.thehudsonbroadway.com.  Run time:  3 hours with one 15 minute intermission.\n\nSarah Downs is a writer and performer who escaped the suburbs of Boston to pursue a career in the arts. In her theatrical incarnation she has worked both in New York and regional theater, and performed with local opera companies. She has sung arias to the stars, musical theater in barns and torch songs in cabaret. Sarah also toured the U.S. as Marian in The Music Man, and toured the U.S. and Canada as Marie Osmond’s understudy in the national tour of The Sound of Music. In recent years Sarah has focused more on writing, including articles on feminism and politics. She is President of the Professional Women Singers Association and on the board of the Women In the Arts and Media Coalition. Sarah holds an B.A. from Harvard University.\n\nOpening Night Our Criteria Get our reviews by email\n\nJoin our mailing list to receive the latest news and updates from our reviewers.\n\nJoin our mailing list to receive the latest reviews from the Front Row Center. We will email you all of the reviews twice weekly.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 883,
  "archivePath": "data/archives/reviews/death-of-a-salesman-2026/thefrontrowcenter-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:24:02.203Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240414113844",
  "archiveOrgUrl": "http://web.archive.org/web/20240414113844/https://thefrontrowcenter.com/2022/10/death-of-a-salesman-2/"
}