{
  "showId": "high-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://www.variety.com/review/VE1117945043",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "For a while, the generational and cultural clash between this self-destructive throwaway child and the big-hearted nun are genuinely engaging. But while Sister Jamison is a colorful character, she's too limited in dimension to make serious demands on Turner. The other two characters are even more insubstantial...Even against that big night sky, a star needs some incentive to shine.",
  "bwwScore": 3,
  "contentTier": "complete",
  "fullText": "Kathleen Turner is bigger -- and far, far better -- than \"High,\" a trashy melodrama by Matthew Lombardo.\n\nKathleen Turner is bigger — and far, far better — than “High,” a trashy melodrama by Matthew Lombardo that profits from the star’s liking for the kind of earthy, strong-minded women so often and easily patronized as “broads with balls.” Here, it’s a dirty-talking, no-nonsense nun whose expert counseling skills are severely stretched when she takes on a gay teenaged junkie and street hustler facing jail time. Turner does her best to bring warmth and intelligence to the brass-knuckled nun, but this troubled saint remains a flimsy character in a hollow play.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Bruno Mars Named Record Store Day Ambassador for 2026; Sets Exclusive RSD Compilation LP, Plus Advance Listening Parties for New Album \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Spotify Is Raising U.S. Subscription Prices in the Next Month\n\nThe dubious reality of this contrived drama is compounded by the artificiality of the setting. In David Gallo’s design, the church-run clinic offices are sketchily represented by two free-standing white doors that open into the vaguely defined study where Sister Jamison Connelly (Turner) does her counseling. The enveloping cyclorama of a star-filled sky — a symbol of Sister Jamison’s spiritual aspirations — is peaceful to look at, but with no recognizable planets or constellations depicted in that vault of sky, it registers mainly as pretty wallpaper.\n\nUnlike other religiously themed plays like “Doubt” and “Agnes of God,” “High” does not revolve around a substantial issue like pedophile priests or miraculous stigmata. On the contrary, Sister Jamison and her superior, Father Michael Delpapp (the amiable Stephen Kunken), butt heads on a manufactured conflict over whether they should be treating a hard case like Cody Randall (a showy debut from Evan Jonigkeit) in the first place.\n\nFather insists on it, for not-bad reasons that are later made clear. But Sister Jamison’s fierce bureaucratic arguments against it (“Why not send him to a state-run facility?”) are preposterous, coming from someone who would be expected to welcome the challenge of rescuing a lost lamb.\n\nOnce she caves, Sister Jamison discovers that Cody is every bit as hopeless as she’d feared.\n\nJonigkeit doesn’t hold much back in his portrayal of this sullen, stupid kid with the battered body (ugly bruises courtesy of makeup specialist Joe Rossi) and mean disposition. But for (again, not bad) reasons that will eventually come out, Sister Jamison is moved to save both his ass and his soul.\n\nFor a while, the generational and cultural clash between this self-destructive throwaway child and the big-hearted nun are genuinely engaging.\n\nUnder Rob Ruggiero’s direction, Jonigkeit carefully paces out the revelations about Cody’s abusive background, while Turner applies her perfect comic timing to Sister Jamison’s outrageous habit of mouthing off. “I did all that shit in the ’70s,” she says, airily dismissing Cody’s boastful account of his drug history.\n\nBut while Sister Jamison is a colorful character, she’s too limited in dimension to make serious demands on Turner. The other two characters are even more insubstantial.\n\nTo state the obvious, the kid is just a kid. And when he takes off his clothes and attempts to rape the nun, Turner’s assertion that she could “beat the fuck” out of him if he ever tried a trick like that again is undeniably (and regrettably) all too true. And for all Kunken’s artful bickering, Father Michael doesn’t really have a legitimate quarrel with Sister Jamison.\n\nEven against that big night sky, a star needs some incentive to shine.",
  "isFullReview": true,
  "textWordCount": 585,
  "archivePath": "data/archives/reviews/high-2011/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:21:04.149Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 585,
  "tierReason": "Full review text"
}