{
  "showId": "moulin-rouge-2019",
  "outletId": "amny-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.amny.com/entertainment/moulin-rouge-review-1.34264501",
  "publishDate": null,
  "fullText": "&#8216;Moulin Rouge!&#8217; plays an open run at the Al Hirschfeld Theatre. 302 W. 45th St., moulinrougemusical.com.\n\nIt was only a matter of time before “Moulin Rouge!” — Baz Luhrmann’s hyperactive and overstuffed 2001 movie, which was famously built upon bits and pieces of 19th century operatic tragedy and 20th-century pop standards — came to Broadway.\n\nDespite an ornate and environmental visual design depicting a turn-of-the-century Parisian nightclub, first-rate leading actors (including Tony winner Karen Olivo, Aaron Tveit and Danny Burstein) and an updated/upgraded jukebox of hit singles to play around with, “Moulin Rouge!” is not unlike earlier botched, inherently problematic attempts at bringing visually distinct movie musicals to the stage. Think “The Wizard of Oz” and “Singin’ in the Rain.”\n\nUpon its original film release, “Moulin Rouge!” was both praised and panned for Luhrmann’s frenetic, fast and loose style of filmmaking, which evoked contemporary music videos. Sure, the songs were enjoyable, and Nicole Kidman and Ewan McGregor had undeniable sex appeal. But more than anything else, “Moulin Rouge!” was a dizzying and dazzling roller coaster ride, making moviegoers feel as if they too were drunk on absinthe and surrounded by green fairies singing “The Sound of Music.”\n\nOnstage, “Moulin Rouge!” (directed by Alex Timbers, whose greatest successes have been lower-key, inventive projects like “Peter and the Starcatcher” and “Bloody Bloody Andrew Jackson”) is clumsy, overcooked and pointless.\n\nRather than glide effortlessly, “Moulin Rouge!”, using a leaden new book by playwright John Logan, remains fixed in a kind of stop-and-start mode. The show&#8217;s momentum is halted by flat, long-winded scenes of dialogue, often with minor characters debating bohemian ideals. The bump-and-grind dance choreography (by Sonya Tayeh) is surprisingly garish and tacky.\n\nIn a way, “Moulin Rouge!” is like a sanitized rehash of the 1966 musical “Cabaret” — which also has a master of ceremonies, an erotic ambience and a tragic romance between a struggling writer and a nightclub diva — but without the daring politics or well-crafted original score.\n\nThe pop songs that have been added for the stage version — including “Single Ladies,” “Firework,” “Sympathy for the Devil” and “Bad Romance,” which now join “Lady Marmalade,” “Your Song,” “Roxanne” and “Nature Boy” — do not generate sufficient excitement to make the stage adaptation worthwhile.\n\nUnlike the film, which unexpectedly swept you into its jukebox concept, the stage “Moulin Rouge!” is similar to all the other silly and self-conscious jukebox musicals that populate Broadway. Not a single song is vital to its storytelling and any of them could have been replaced or discarded.\n\nOlivo, who boldly declared several years ago that she was leaving the theater but has apparently returned, is assertive but lacks vulnerability in her role as dancer Satine. As the innocent lover-composer Christian, Tveit (“Next to Normal”) has the depth of a stick figure. And as struggling theater impresario Harold Zidler, six-time Tony nominee Danny Burstein is sadly underutilized, serving primarily as an intermediary.\n\n“Moulin Rouge!” works best during an extended preshow sequence in which audience members can marvel at, and take photos of, the scenic environment — with its red lights, interior staircases, turning windmill and giant elephant display. They can also feat their eyes upon the performers, who sexily and silently stalk the stage. It makes you wish you could be in the audience of the actual Moulin Rouge — as opposed to “Moulin Rouge!”",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 559,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/amny-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:44:04.740Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (503): Request failed with status code 503"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250618215648",
  "archiveOrgUrl": "http://web.archive.org/web/20250618215648/https://www.amny.com/entertainment/moulin-rouge-review-1.34264501/"
}