{
  "showId": "moulin-rouge-2019",
  "outletId": "broadwayworld-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.broadwayworld.com/article/BWW-Review-MOULIN-ROUGE-is-Visually-Gorgeous-Vibrantly-Performed-and-Seriously-In-Need-of-An-Original-Score-20190726",
  "publishDate": null,
  "fullText": "Bookwriter John Logan Deepens The Characters To The Point Where Pop Hits Aren't Enough\n\nFrom his hit Off-Broadway debut with A VERY MERRY UNAUTHORIZED CHILDREN'S SCIENTOLOGY PAGEANT to his Broadway bow with BLOODY BLOODY Andrew Jackson to his current mounting of BEETLEJUICE, that crazily imaginative Alex Timbers has spent the past 15 years or so establishing himself as New York's top director for turning weird ideas into terrific times at the theatre.\n\nLush, traditional romance (the kind that doesn't involve political assassinations or heavyweight boxing matches) hasn't been of his previous ilk, but darn it, he aces the genre beautifully with his superbly atmospheric mounting of bookwriter John Logan's adaptation of filmmaker Baz Luhrmann's 2001 hit, Moulin Rouge!.\n\nGive a big hunk of credit to top shelf set designer Derek McLane, who converts the Al Hirschfeld Theatre into a spectacularly opulent dreamscape of 19th Century Belle Époque artistry. On the left bank of audience seating, the landmark red mill that was mounted atop the original Moulin Rouge cabaret rests in a mezzanine box. Look to your right and there's the architectural elephant, where, within its belly, wealthy gentlemen enjoyed more intimate entertainment. Up front, a ramp leads from the stage to a smaller floor where showgirls give patrons a closeup look of that new dance craze, the can-can.\n\nAs the audience enters, Parisians are slowly promenading across the surroundings, bathed in Justin Townsend's warm nostalgic lighting as they model Catherine Zuber's costume designs; reserved elegance for the customers, tastefully seductive for the dancers.\n\nAs in the film, the story is a familiar one about a woman who survives by providing men with an onstage (and sometimes offstage) sexual fantasy that the more delusional of them confuse with love. In this case it's the nightclub's star attraction, Satine (wryly sexual onstage, emotionally guarded offstage Karen Olivo), who has been asked by club owner and emcee Harold Zidler (Danny Burstein, eccentrically leering as the host, but a kind and supportive boss) to spend an evening with the wealthy Duke of Monroth (distinguished, dashing and cold Tam Mutu) in hopes that he will invest in the financially struggling venue.\n\nMeanwhile, a penniless songwriter from Ohio named Christian (Aaron Tveit, credibly naïve, but with a dark streak) wanders into the bohemian side of town, where he meets the great artist Toulouse-Lautrec (sage/philosophical Sahr Ngaujah) and an Argentinian dancer named Santiago (comically passionate Ricky Rojas), who convince him to visit Satine in her dressing room and sell her on the idea of putting songs into her show from a new musical they'll write.\n\nNaturally, Satine thinks the handsome young American is the Duke she's meant to entertain, and after some farcical business the real Duke makes Zidler an offer he's in no position to refuse. He'll buy the club outright, and finance the musical, and everything will be fine as long as Satine belongs, so to speak, exclusively to him.\n\nOf course, it wasn't the story that made the film a hit. The attraction was Luhrmann's concept of having the characters break into a multitude of flashy song and dance moments incorporating late 20th century hits from the likes of Madonna, Nirvana, Elton John, Nat King Cole, David Bowie, Frank Sinatra and many more, making the flick resemble a series of music videos held together by a thin, predictable story.\n\nOn Broadway, the song list is increased to include 21st Century hits from pop stars like Katy Perry, Beyoncé and Lady Gaga. And though we only hear snippets from most of the tunes, smashed into medleys, the grand total of 70+ selections in the 2-act musical means that at each performance of Moulin Rouge! 161 songwriters receive royalty payments.\n\nAnd all would be well and good if it weren't for the fact that Logan's book adds enough dramatic depth and complexity to the characters that generic pop lyrics that aren't specific to their situations just don't cut it anymore.\n\nSure, it's a blast when the women of the dancing ensemble open the show by breaking into \"Lady Marmalade\" or when Satine leads them in a medley that includes \"Diamonds Are Forever,\" \"Diamonds Are A Girl's Best Friend,\" \"Material Girl\" and \"Single Ladies.\" And the second act commences with a knockout erotic tango between Santiago and Satine's rival for the spotlight, Nini (terrific Robyn Hurder), a highlight of Sonya Tayeh's sensationally hard-driving choreography.\n\nBut something more is needed when Toulouse-Lautrec tries explaining his own experience with Satine's irresistibility than a chorus of \"Nature Boy.\" Satine herself, forced into prostitution as a child and spending her life as a fantasy figure, never has a character-driven moment to musically express her relationship with men. Particularly poignant, and perhaps worthy of song, is how Zidler, who is shown being intimately involved with a man, sincerely looks after her while Satine sincerely looks after Baby Doll (Jeigh Madjus), a young drag performer who fears being forced back to underground clubs or the street if the Moulin Rouge closes.\n\nAnd when it turns out that the obsessive Christian, who, let's face it, convinced himself that he was in love with Satine while watching her perform a medley of songs about being a gold-digger, has become dangerously possessive, his toxic reaction needs a more specific form of musical expression than \"Rolling In The Deep.\"\n\nBut of course, inserting the pop hits into the period Parisian setting is the whole point of the venture, and Moulin Rouge! is certain to do very well at the box office without pleasing this reviewer's desire for an integrated score that would help the excellent company of actors achieve more fully-realized performances. There are certainly worse ways to spend an evening than with a musical so visually gorgeous and vibrantly performed.\n\nGet Info\n                    \n                        \n                          \n\n                           \n\n                              \nBuy Tix\n   \n\n                                                                        \n             \n                              \n                              \n\n\n\n\t\t\t\t\n\t\t\t\t\n                                  Cast\n\n                                                                \n                                \n                                \n                              \n                                    \n                                    Photos\n                                  \n                                \n  \n                            \n                                        Videos\n\n                               \n\n      \n             \n                        \n        \n\n             \n          \n                      \n  \n\n\n        \n\n\n    \n    \n    \n\n\n\n\n    \n        \n        \n        \n        \n        \n    \n\n\n\n\n\n\n\n\n      \n    \n  \n\n\n\n\n\n\n\n\n\n  \n\n\n\n\t            \n            \n\n           \n        \n            \n            \n \n                              \n\n        \n        \n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n            \n            \n \n\n     \n     Powered by-->\n     \n     \n\n\n\n\n\n\n\n\n\n\n\n  \n\nGet Show Info\n\n\n Info\n\n                    \n                    \n\n\n\nGet Tickets\n\n                                                        \n                \n             \n\n\n\n\nCast\n\n                                                                \n\n\n\nPhotos\n                                  \n                                \n\n\nVideos\n\n                                  \n\n             \n                                  \n\n\n \n  Powered by\n  \n\n\n \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n            \n        \n                        Videos",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 975,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/broadwayworld-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:44:41.431Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "sourceMethod": "scrapingbee"
}