{
  "showId": "moulin-rouge-2019",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://cititour.com/NYC_Broadway/Moulin-Rouge-The-Musical/295",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $99\n\t Buy Tickets\n\nCititour.com Review\n    As any Francophile can tell you, red is the signature hue of the new Broadway megamusical “Moulin Rouge,” now at the Al Hirschfeld Theatre. It’s prevalent in many aspects of Derek McLane’s extra-extravagant set, Catherine Zuber’s gorgeous, turn-of-the-20th-century costumes, and even (mild spoiler alert) in the bloodstains on the handkerchief of courtesan/nightclub star Satine.\n\nBut truth be told, should your mind wander even for a second from Alex Timbers’ consistently eye-and-ear-popping production – which is admittedly unlikely – the color most likely to pop into your head is green; specifically the amount of money it cost to mount this ultra-lavish adaptation of Baz Luhrmann’s 2001 movie (reportedly $30 million) and, even moreso, the amount of money this crowd-pleasing spectacle will eventually take in before it closes in 2025. (Yes, I’m just guessing!)\n\nThe production’s spend-spend-spend mentality is evident from the moment you enter the Hirschfeld, which has been completely transformed by McLane to echo the titular club, from the massive red windmill on one side of the mezzanine and the giant elephant on the other. Indeed, you’ll want to come early not just to take in all that scenery, but to see the talented ensemble – in various states of dress – wriggling, writhing and executing Sonya Tayeh’s slithery, athletic movement in a pre-show like none you’ve ever seen. \n\nAnd once the actual show begins (unsurprisingly to the film’s big hit, “Lady Marmalade,”), you’ll likely be transfixed by most of what happens, even if John Logan’s book is so utterly simplistic it feels like it took the Tony-winning scribe took 15 minutes to pen it. Indeed, there’s not much depth to the story, with its echoes of “Rent”, nor to its main characters: the mostly pragmatic -- if deeply romantic -- Satine (played with utter magnetism and killer vocals by Karen Olivo); her young All-American suitor Christian (a too-bland Aaron Tveit, who nonetheless possesses Broadway’s strongest pop-singing chops); or the Duke of Momfort (an admittedly sexy Tam Matu), the haughty aristocrat who buys Satine –and the entire Moulin Rouge – mostly because he can.\n\nIn fact, the leads often prove less interesting than the supporting players: the great Sahr Ngaujah is consistently compelling as the outspoken artist Toulouse-Lautrec; the limber Robyn Hurder steals the spotlight as tough-but-tender dancer Nini (especially opposite the sinewy Ricky Rojas in an Argentine-flavored take on Lady Gaga’s “Bad Romance”); and the ever-invaluable Danny Burstein gives his all to the role of club’s louche impresario Harold Zilder.\n\nUltimately, though, everyone and everything on stage is basically playing second fiddle to the show’s massive song catalogue, which includes snippets and segments of dozens of pop hits; at times, “Moulin Rouge” almost feels like a live-action version of “Name That Tune.” A few of the numbers, thankfully, get a more full-blown treatment, allowing the cast to really impress us: Olivo mines surprising emotion from Katy Perry’s “Firework”; Tveit stuns in an amazingly passionate sequence set to The Police’s “Roxanne;” and the pair duet beautifully on Elton John’s iconic “Your Song” and the lovely “Come What May” (which was specifically written for the film). Meanwhile, Matu makes a meal out of the Rolling Stone’s “Sympathy for the Devil”; Burstein gleefully leads the ensemble in a boisterous take of Sia’s “Chandelier”; and Ngaujah touches the heart with his rendition of the classic ballad “Nature Boy.” \n\nIndeed, the musical’s simplest moments were among my favorites. As much as the more-is-more attitude behind “Moulin Rouge” can be diverting; I also found some of the show (especially its post-ending ending) unnecessarily excessive. Then again, maybe I’m crazy…\n    \t    By Brian Scott Lipton\n\nVisit the Sitehttps://moulinrougemusical.comCastAaron Tveit, Karen Olivo, Danny Burstein, Sahr Ngaujah, Tam Mutu, Ricky Rojas, Robyn Hurder Open/Close DatesOpening 7/25/2019Closing Open-endedPreview Open/ Preview Close DatesPreview Opening 6/28/2019Closing Open-endedBox Office877-250-2929\nTheatre Info\nAl Hirschfeld Theatre302 West 45th StreetNew York, NY 10036\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 703,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/cititour-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:45:29.278Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "sourceMethod": "scrapingbee"
}