{
  "showId": "moulin-rouge-2019",
  "outletId": "NYSR",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2019/07/25/moulin-rouge-review-oxfeld/",
  "publishDate": "2019-07-25",
  "fullText": "The page you are looking for no longer exists. Perhaps you can return back to the homepage and see if you can find what you are looking for. Or, you can try finding it by using the search form below. ★★★★☆ Playwright Simon Stephens and tech wizards concoct the world’s first mixed reality play ★★★☆☆ Ian McKellen is among the performers appearing virtually in this one-act play by Simon Stephens ★★★☆☆ Erica Schmidt’s world premiere dramedy skewers a self-absorbed filmmaker and the people who love him ★★★☆☆ Hamish Linklater, Miriam Silverman, and Dylan Baker are among the stars of Erica Schmidt's world premiere play riffing on show business and marriage ★★★★☆ A new production of the Tony-nominated musical comedy goes to the head of the class ★★★★☆ Lesley Manville and Mark Strong have disturbingly good chemistry as theater’s most famous twice-related couple ★★★★★ Laurie Metcalf and Micah Stock star in Samuel D. Hunter's acclaimed drama, previously seen at Steppenwolf Theatre Company ★★★★★ Bess Wohl takes inspiration from her mother’s life for her clever, decade-jumping memory play ★★★★★ Joshua Henry gives what’s destined to be a Tony-winning performance in this much-needed revival ★★★★☆ Jonathan Groff gives a once-in-a-lifetime performance as the Grammy-winning “Beyond the Sea” singer Copyright © 2026 • New York Stage Review • .",
  "isFullReview": false,
  "bwwExcerpt": "has a show that has it all: it's not just 70 songs that are rolled into one show, but also a canvas of spectacle and emotion that isn't just a floorshow but left me floored with its sublime artistry. Jesse Oxfeld, New York Stage Review : That's not to diminish any other parts of the staging or performance. Timbers, always an endlessly visually inventive director, has always had material that lived up to his specialties. ( Rocky comes to mind.) But Luhrmann's fantasia gives Timbers license to do his best work-while creating something that is a definitively theatrical experience, not just a pale imitation of the film. Melissa Rose Bernardo, New York Stage Review : No disrespect to headliners Karen Olivo (a Tony winner as Anita in 2009's West Side Story), who plays the tuberculosis-plagued performer/courtesan Satine, and Aaron Tveit (Catch Me If You Can, Next to Normal), as the lovestruck aspiring composer Christian but the real stars of this Moulin Rouge! are the artists who don't appear",
  "originalScore": null,
  "assignedScore": 80,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-MOULIN-ROUGE-Opens-On-Broadway-See-What-The-Critics-Think-20190725",
  "textStatus": "partial",
  "textWordCount": 215,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/nysr--jesse-oxfeld_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:15:15.649Z",
  "textIssues": [
    "Word count too low: 215 (min: 300)",
    "Show title not found in text"
  ],
  "textQuality": "partial",
  "sourceMethod": "bww-roundup",
  "scoreSource": "sentiment-positive",
  "scoreConfidence": "medium"
}