{
  "showId": "moulin-rouge-2019",
  "outletId": "NYTG",
  "outlet": "New York Theatre Guide",
  "criticName": "Mark Shenton",
  "url": "https://www.newyorktheatreguide.com/reviews/moulin-rouge-broadway",
  "publishDate": "2019-07-25",
  "fullText": "Whoops! Page not foundWe're sorry you couldn't find what you were looking for.Return to homeYour experience mattersWe use cookies to personalise your experience, including improving the quality of your show recommendations. By clicking \"accept all\", you consent to our .Accept allReject allMore options",
  "isFullReview": false,
  "bwwExcerpt": "fanciful world feeling somewhat pummeled by the heightened visual and aural, not to mention emotional, assault. Yet I woke up the next morning in love with the show. There's genius in that, I think. Mark Shenton, New York Theatre Guide : In a crowded Broadway market place, Moulin Rouge has a show that has it all: it's not just 70 songs that are rolled into one show, but also a canvas of spectacle and emotion that isn't just a floorshow but left me floored with its sublime artistry. Jesse Oxfeld, New York Stage Review : That's not to diminish any other parts of the staging or performance. Timbers, always an endlessly visually inventive director, has always had material that lived up to his specialties. ( Rocky comes to mind.) But Luhrmann's fantasia gives Timbers license to do his best work-while creating something that is a definitively theatrical experience, not just a pale imitation of the film. Melissa Rose Bernardo, New York Stage Review : No disrespect to headliners Karen Olivo (",
  "originalScore": null,
  "assignedScore": 90,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-MOULIN-ROUGE-Opens-On-Broadway-See-What-The-Critics-Think-20190725",
  "textStatus": "partial",
  "textWordCount": 43,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/nytg--mark-shenton_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:09:47.308Z",
  "textIssues": [
    "Word count too low: 43 (min: 300)",
    "Show title not found in text"
  ],
  "textQuality": "excerpt",
  "sourceMethod": "bww-roundup"
}
