{
  "showId": "moulin-rouge-2019",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/MoulinRouge2019.html",
  "publishDate": null,
  "fullText": "Musical soundtrack CDsPlay directing guidesThe Vortex TheatreMusical theatre reviewsLocal theatre directoryRegional theater ticketsPlaywrighting coursesYou Will Get SickStudio TheatrePear Theatre\n\n\n\n\n\n\n\n\n\n\n            \t\t                  \n                                            \n \n\n\t\n\n \n \n\n\n\n Past ReviewsBroadway Reviews\n\nTheatre Review by Howard Miller - July 25, 2019\n\nMoulin Rouge Book by John Logan. Based on the 2001 Twentieth Century Fox motion picture written by Baz Luhrmann and Craig Pearce, directed by Baz Luhrmann. By special arrangement with Buena Vista Theatrical. Directed by Alex Timbers. Scenic design by Derek McLane. Costume design by Catherine Zuber. Lighting design by Justin Townsend. Sound design by Peter Hylenski. Hair design by David Brian Brown. Makeup design by Sarah Cimino. Creative services by Baz Luhrmann and Catherine Martin. Music producer Matt Stine. Music supervision, orchestrations, arrangements, and additional lyrics by Justin Levine. Co-orchestrators Katie Kresek, Charlie Rosen, and Matt Stine. Music direction and additional arrangements by Cian McCarthy. Choregraphed by Sonya Tayeh. Dance arrangements by Justin Levine and Matt Stine. Music coordinator Michael Aarons. Associate director Ashley Rodbro. Associate choreographer Katie Spelman. Cast: Danny Burstein, Bahiyah Hibah, Robyn Hurder, Holly James, Reed Luplau, Jeigh Madjus, Tam Mutu, Sahr Ngaujah, Karen Olivo, Ricky Rojas, Aaron Tveit, Amber Ardolino, Olutayo Bosede, Kyle Brown, Sam J. Cahn, Max Clayton, Aaron C. Finley, Paloma Garcia-Lee, Ericka Hunter, Morgan Marcell, Brandt Martinez, Jodi McFadden, Kevyn Morrow, Fred Odgaard, Khori Michelle Petinaud, and Benjamin Rivera.\n \nTheatre:  Al Hirschfeld Theatre, 302 West 45th Street between 8th and 9th Avenues\n\nTickets:  Ticketmaster\n\nIf you can cut through the glitz for just a moment (and, yes, that is asking a lot), you will find that the story of Moulin Rouge is a tale old as time, or at least as old as Alexandra Dumas fils's nineteenth century romance novel \"La Dame aux Camélias,\" Verdi's La Traviata, Puccini's La Bohème, and Jonathan Larson's Rent. Pass along the blood-stained handkerchief as an heirloom from the various consumptive heroines, and you'll find a straight line connecting Camille to Violetta to Mimi to Satine, the female lead in Moulin Rouge, exquisitely portrayed by Karen Olivo, the one performer who seems able to stay fully fixed on the musical's sometimes elusive heart.\n\nThat heart is best expressed through one of the 70 pre-existing pop tunes that are sung in whole or (mostly) in snippets throughout the evening. The definitive lyrics come not from the film's popular pledge of eternal love, \"Come What May,\" but from \"Nature Boy,\" the 1948 Nat King Cole hit song that ends with these words: \"The greatest thing you'll ever learn, is just to love and be loved in return.\" Satine, the street-smart star attraction at the Moulin Rouge boîte in Paris, is able to drop her well-honed guard and embrace the sentiment of these words when she meets a young American naïf named Christian (Aaron Tveit).\n\nChristian, a songwriter who bursts into Rodgers and Hammerstein show tunes at the drop of a beret, has embarked to Paris from his native Ohio to learn about life and make his way in the world. He is quickly adopted by a pair of would-be revolutionaries, Toulouse-Lautrec (Sahr Ngaujah) and Santiago (Ricky Rojas). The two are excellent as the show's comic foils, even if their jokes are sometimes eye-roll inducing. When Christian runs into them, they are struggling to find the right words for a song to be featured in a show they hope to mount at the Moulin Rouge. The best Toulouse-Lautrec can come up with is \"The hills are alive with the screams of the proletariat.\"\n\nChristian does a quick rewrite, and his talents win him quick entrée into their bohemian circle. Their idea is to bring Christian to the club to audition for Satine, who they are certain will insist that he and his friends be hired on the spot to put on their show.  Satine is indeed smitten with Christian. Unfortunately for both of them, she has mistaken him for the exorbitantly wealthy and melodramatically cruel Duke of Monroth (Tam Mutu, the hissable personification of narcissism). In order to save the club from bankruptcy, and at the urging of its presiding impresario, Harold (Danny Burstein, a most ebullient ringmaster), Satine agrees to be the Duke's mistress in exchange for the funds to keep the Moulin Rouge in business.\n\nCould there possibly be a single bolt of red satin or black lace remaining in all of New York City?  Not if designer Catherine Zuber had anything to say about it. She has created eye-popping bordello-suggestive costumes for the women who perform in the club, top hats and tails for the cigar-and-Gauloises-smoking men, and others that could very well have been used in the Lincoln Center production of My Fair Lady or in Gigi's Broadway run a couple of years back, both of which had Ms. Zuber as their designer.  For his part, Derek McLane has provided a wide-ranging colorful set design that takes us both inside the club and out on the streets of Paris. A garret with floor-to-ceiling windows looking out on a red (as if there could be any other color; look at the show's title!) neon \"L'Amour\" sign is more than a little reminiscent of the one that was the central set in Baz Luhrmann's 2003 Broadway production of La Bohème. Theater as illusion; theater as allusion.\n\nAnd then there is the music. The New York Times reports there are 70 songs, credited to 161 writers, with all of the necessary rights corralled by the show's music supervisor, orchestrator, arranger, and contributing lyricist Justin Levine. Whatever struggles Mr. Levine had in garnering all of these rights, it would appear that he had a blast in matching song to situation and in compiling mashups that sometimes, if not always, work to great effect.\n\nOne of the best involves the first appearance of Satine, who descends on a trapeze and performs a medley of \"diamond\" themed songs:  \"Diamonds Are Forever,\" \"Diamonds Are A Girl's Best Friend,\" and the related Madonna's \"Material Girl\" and Beyoncé's \"Single Ladies (Put a Ring on It).\" Karen Olivo performs the hell out of the medley, and there is no question that she deserves to be the star of both the club and of the musical. There is also a terrific opening production number that builds around LaBelle's \"Lady Marmalade,\" and other songs that are likely to startle or even make you laugh out loud by the way they are used in the production, including The Rolling Stones \"Sympathy for the Devil\" and a wonderous Act II opener that is anchored by Lady Gaga's \"Bad Romance.\" Choreographer Sonya Tayeh goes all out with this one, and, given its setting in what appears to be an alleyway outside of the club, it may remind you of the \"Too Darn Hot\" production number that Warren Carlyle created for last season's revival of Kiss Me Kate. At other times, Ms. Tayeh leans heavily on pounding club moves and the occasionally dipping of a toe into the world of Cirque du Soleil.\n\nAll in all, Moulin Rouge is a high octane rush of a musical, intentionally filled with visual and auditory triggers that are likely to set your synapses ablaze with memories of songs and sights past, as well as the feelings they evoke. Quibble if you must that Karen Olivo and Aaron Tveit don't seem all that compatible, as long as you understand that the life-battered Satine and the head-in-the-clouds Christian see what they want to see in each other: truth, beauty, freedom, and love. Moulin Rouge is a phenomenon that cannot easily be dismissed. If it is successful, it may very well establish a trend for compilation jukebox musicals for a long time to come.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1267,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:55:14.474Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "sourceMethod": "brightdata"
}