{
  "showId": "moulin-rouge-2019",
  "outletId": "theatermania-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theatermania.com/broadway/reviews/moulin-rouge-on-broadway-is-spectacular_89397.html",
  "publishDate": null,
  "fullText": "I had trouble falling asleep Tuesday night. Hours after seeing Moulin Rouge! at the Al Hirschfeld Theatre, I was still buzzing from the barrage of stimuli I experienced in this most spectacular of Broadway musicals. It's a feeling that I've only ever had after a night of heavy clubbing, which is perhaps what director Alex Timbers, his tireless cast, and his all-star team of designers are going for in this musical about the most famous nightclub in the world.\n\nThat would be the Moulin Rouge in Paris, which is also the inspiration for the 2001 Baz Luhrmann film on which this show is based. That movie-musical used the radio hits of the latter 20th century to tell a story about the fin-de-siècle bohemian underworld, and it cinematically captured the delirious swirl of color and sound that accompanies any successful night of hedonism. One gets the sense that Luhrmann and his editor chugged five cans of Red Bull before every work session.\n\nIn the musical, that caffeinating role has been assumed by music supervisor, arranger, orchestrator, and all-around genius Justin Levine. He has taken the jukebox of the film and supersized it, his driving ethos seemingly being, Why settle for one song when you can have three? Levine puts pop hits from the last 60 years in a blender and mixes them up, with each new strain of a familiar song delighting the crowd. He's like a really good wedding DJ, and he reminds us how much fun a jukebox musical can be when it isn't beholden to the song catalogue and revisionist history of one specific artist (the bourgeois lawyers who secured the song rights are the real heroes of this musical about penniless bohemians).\n\nSonya Tayeh's stylish choreography illustrates the hyperactive musical numbers. Tayeh has avoided the grotesque thrusting that usually accompanies musicals featuring lovely ladies of the night, achieving something that is legitimately sexy and always impressive. The music and dancing are the best parts of Moulin Rouge! If you go in expecting a spectacle, you will not be disappointed.\n\nBut this is still a book musical, so it has to make some effort at telling a story: Christian (Aaron Tveit) is a young writer newly arrived in Paris. He falls in with a circle of bohemians led by painter Toulouse-Lautrec (Sahr Ngaujah) and Argentine dancer Santiago (Ricky Rojas). They take him to the Moulin Rouge, run by impresario Harold Zidler (Danny Burstein). That's where he falls in love with the star of the club, Satine (Karen Olivo). But a rich and powerful Duke (Tam Mutu) wants her for himself, and Zidler needs his moolah to keep the Moulin spinning.\n\nBook writer John Logan has maintained the basics of the Luhrmann-Craig Pearce screenplay, making a few cosmetic alterations. His biggest departures are in the song list, which now incorporates music by Lady Gaga, Beyoncé, and Katy Perry to name a few (naming more would take away one of the pleasures of the show, which is allowing these ditties to sneak up on you).\n\nThe songs generally fit well, and when they don't, director Alex Timbers distracts us enough that it doesn't matter. His maximalist aesthetic has never worked better as he blitzes us with lights, sounds, and sparkles. Derek McLane's set is plush and ever-shifting. Catherine Zuber's costumes dazzle and titillate, glittering under Justin Townsend's colorful and laser-focused lighting. We hear every lyric and musical hook through Peter Hylenski's precision sound design. There's just so much to hear and see. With Moulin Rouge!, Timbers firmly establishes himself as the heir to Franco Zeffirelli, making extravagant dreams a reality onstage.\n\nThat reality is made possible by the hardest-working ensemble on Broadway: Over the course of three hours, they never seem to stop moving and quick-changing, selling every number like they're performing in the Super Bowl halftime show.\n\nCounterintuitively, the principals have abandoned the stagy acting of the film for something more naturalistic — and that proves to be a smart decision that injects some heft into the book. Burstein sets the pace as Zidler, a painted ringmaster who approaches the dirty business of show with clear eyes. Olivo glimmers when she's on as the \"sparkling diamond\" of the club, but it's a luster that instantly darkens in private. Underneath, Satine is a scrappy survivor who has clawed her way to comfort, only to be blindsided by true love. And Tveit is undeniably lovable as Christian, the earnest and naïve dreamer who hails from that tribe's spiritual homeland (Ohio). The two have real chemistry that helps support their impractical, dangerous love.\n\nAnd that's a good thing, because Tam Mutu is giving them a real challenge as the Duke. No longer the inbred hothead of the film, he's genuinely attractive in the role (in that jerky sort of way). He dismisses the \"ridiculous dogma\" of bohemian idealism with the well-reasoned condescension of a columnist for The Wall Street Journal. In your head, you know he's right (even if your heart rebels).\n\nIf there is a major weakness in Moulin Rouge, it is the ending. The musical struggles to maintain its frenetic joy as the plot hurtles toward its inevitable conclusion (Spoiler Alert: It's a downer). Timbers has contrived a ludicrously extended curtain call to bring us back to Broadway bliss, but no amount of confetti can completely banish the tragedy we've just witnessed. This is an incongruity that Logan might have resolved with a clever frame. Unfortunately, he declined.\n\nOf course, theatergoers won't be attending Moulin Rouge to marvel at its dramaturgy. They'll flock (as they should) to revel in its extraordinary showmanship — some of the best Broadway currently has on offer.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 942,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/theatermania-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:55:48.261Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230321181014",
  "archiveOrgUrl": "http://web.archive.org/web/20230321181014/https://www.theatermania.com/broadway/reviews/moulin-rouge-on-broadway-is-spectacular_89397.html"
}