{
  "showId": "moulin-rouge-2019",
  "outletId": "theaterpizzazz-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theaterpizzazz.com/moulin-rouge-tujour-amour/",
  "publishDate": null,
  "fullText": "It’s a splendid colorful storybook of characters of love and romance, sex and grit displayed in an embarrassment of opulence pitting the idealistic Bohemians against the monied Aristocrats. The setting is fin-de-siècle Paris. It’s 1899 Montmartre in the history making Moulin Rouge nightclub lavishly re-invented inside the Al Hirschfeld Theatre. Spectacular flashy sets create the spectacle imagined by Derek McLane, with exquisite lighting by Justin Townsend, as early audience arrivals can gaze in wonder at that BIG elephant and all the red glitz and lights . . . the scantily clad half naked ladies of the club sensually slither and slink with naughty looks in their eyes even before the show opens, (exotic extravagant costumes by Catherine Zuber); the sexy men staring unafraid at the audience. It’s all dazzling to the senses as the larger than life, dubious character M.C. Harold Zidler, the exceptionally sensational Danny Burstein who can do anything, welcomes the guests – “ You gorgeous collection of reprobates and rascals, artistes and arrivistes, soubrettes and sodomites . . .”\n\nAll is right in Paris . . . except the club is broke but Harold has a plan, a scheme that involves his long time friend, star and diamond of the Moulin Rouge, the all too knowing Satine (powerhouse, gorgeous Karen Olivo) – whom he befriended when she was a prostitute on the streets at the age of 13. But now he needs her to use her feminine charms and take on the all too familiar role of courtesan and woo the devilish, nasty, very rich Duke of Monroth (Tam Mutu) in order to save the club. They must meet in her dressing room – the Elephant Room – after her performance. “Should I call him Your Grace?”\n\nA pure case of mistaken identity unfolds, having already locked eyes with young wannabe songwriter Christian (the glorious voiced Aaron Tveit) when descending from above on a swing to sing her opening number “Diamonds Are Forever/Diamonds Are a Girl’s Best Friend/Material Girl/ All the Ladies/Put a Ring on It” . . . she, thinking he is The Duke.\n\nSahr Ngaujah, Aaron Tveit, Ricky Rojas\n\nChristian, an American expat, lives in squalor with painter Toulouse –Lautrec (sweet and sincere Sahr Ngaujah) and the wild, hot Argentinian tango dancer Santiago (Ricky Rojas) and immediately impresses them with his lyrical abilities “I Don’t Want to Wait,” “Every Breath You Take,” “Never Gonna Give You Up.” Fascinated with what they hear, they too have a plot to have Satine fall in love with Christian’s music; find a way for him to audition his songs for the Moulin Rouge, write a musical (let’s put on a show!) which eventually results in a play within the play. It sounds a bit convoluted … yes? But what’s more convoluted are the 70 some odd songs from Baz Luhrman’s 2001 pop culture film that inspired this raucous, racy high energy production – most are two, three or four line lyrics linked together, some are full out showstoppers like Olivo&#8217;s “Firework” or Rolling in the Deep.”\n\nThen there are all those L’Amour songs, the endless list (but I’ll be brief): “All You Need is Love/Just One Night/Can’t Help Falling in Love/Love Hurts/What’s Love Got to Do With It/I Will Always Love You” . . .\n\nThe expansive, highly physical choreography by Sonya Tayeh allows for hot, hot, hot dance segments especially noteworthy when sexy Nini (Robyn Hurder), pairs with Ricky Rojas opening Act 2 with “Bad Romance,” “Toxic,” “Sweet Dreams.” Ms. Tayeh has her entire team dancing up a storm as bodies move, groove, tangle and tumble.\n\nThe songs keep coming from The Everly Brothers to Tina Turner, The Beatles, Bowie, Gwen Stefani, Rolling Stones – endless and mind swirling. Outstanding, however, is “Nature Boy” – the one memorable song that touches the heartstrings (at least mine) in this jukebox musical written by John Logan with energetically, over the top direction by Alex Timbers. There are surely more than enough songs for everyone that will bring them back to their own time of nostalgia, requited and unrequited love and loss.\n\nAnd amazingly, all this only costs $28 million as ticket sales zoom into the stratosphere.\n\nYou’ll have to sell your soul to the devil on this one as ticket prices sky rocket. Only on Broadway folks!\n\nMoulin Rouge! – Al Hirschfeld Theater, West 46 Street, run time 2 hrs, 35 min. with intermission – www.moulinrougemusical.com\n\n* August 10th to be determined, please check web site",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 746,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/theaterpizzazz-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:56:31.187Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250910232509",
  "archiveOrgUrl": "http://web.archive.org/web/20250910232509/https://theaterpizzazz.com/moulin-rouge-tujour-amour/"
}