{
  "showId": "moulin-rouge-2019",
  "outletId": "theatrereviews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theatrereviews.com/broadway-review-moulin-rouge-the-musical-at-the-al-hirschfeld-theatre/",
  "publishDate": null,
  "fullText": "Although the new Broadway musical “Moulin Rouge! The Musical” takes place in Paris in 1899, it is without a doubt a “Cabaret” for the 21st Century. It captures the sounds of Lady Gaga, Katie Perry, Patti Labelle, Beyonce, Elton John and an endless host of others as they are woven into the plot with unequivocal brilliance. Those all familiar high-octane vocals perfectly match the glitz and purely decadent glamour that surrounds them and echoes their sentiment. As you await the show to begin, revel in the pre-show antics of the family of actors, singers and dancers that occupy this louche house of entertainment. That will only happen if you stop your eyes from gorging themselves on the visual feast that scenic designer Derek McLane has placed before you, complete with signature windmill and elephant that peer over your shoulder from the now defunct boxes high above. Immerse yourself in the kaleidoscope of color that blankets the stage and adorns the sexy costumes by Catherine Zuber that are bathed with washes of warm and inviting lighting designed by Justin Townsend. Snap pictures with your phone like an enthusiastic tourist, mill around the theatre amongst the crowded aisles of the orchestra and feel the energy of the devoted congregation. They are not there to pray. It seems worth whatever the cost as you are transported to a place that is foreign but familiar, sleazy but safe and tempting but tragic, because, you want to be there. This is “Moulin Rouge! The Musical.” The story is simple and a somewhat dark, Brechtian romance. An ageless scenario depicting a lover’s triangle that does not end well. Christian (a convincing and magnetic Aaron Tveit) who has fled his restrained life in America, to join the bohemian artists of Paris and become a song writer finds his way to the Moulin Rouge and meets Satine (the incomparable and intoxicating Karen Olivo) the outlandish diva of the cabaret. Enter the Duke (an evil and beguiling Tam Mutu) who is there to save the club from bankruptcy in exchange for an introduction to the beautiful and alluring Satine. Harold Zidler (the outstanding Danny Burstein) is the owner of the cabaret who officiates over the devilish proceedings. That is where the story begins. Where it ends is the heartbreaking tragedy. Mr. Tveit uses all his charm to create a genuine character that is under written and supports his effort with his mesmerizing baritone vocals. Ms. Olivo is no less than a wonder entering the show in a glittering gown on a trapeze teasing the audience with a tempting rendition of “Diamonds Are A Girls Best Friend”. This is just the spark that ignites her performance as she shatters the house with her impeccable vocal ability. The superb Mr. Burstein portrays the father of this family of misfits with honesty and practicality while managing to serve up his dual personality as ringmaster of the decadent circus with a sonorous style and forlorn energy. Director Alex Timbers with a keen eye for detail, galvanizes his cast, inspiring them to participate in the debauchery of the musical extravaganza but never lose sight of the tragic story. The choreography of Sonya Tayeh is the heartbeat of the production, pumping life into musical numbers and challenging dancers to turn emotions into movement. Orchestrations, arrangements and music supervision by Justin Levine is the cohesive element that supports, invigorates and fortifies every creative aspect of the performances. Categorized as a jukebox musical this production gives new meaning to the adverse classification by weaving the musical catalogue of mega hits into the straightforward book by Jonathon Logan. Call this opulent, over the top, musical extravaganza anything you like but be aware it will never diminish the incredible work of a first-rate creative team or depreciate the entertainment value that it delivers. Get used to it, because “Moulin Rouge! The Musical” will be a glittering fixture on Broadway for quite a while. Producer Carmen Pavlovic (Global Creatures) is proud to announce that Moulin Rouge!, based on the 2001 Twentieth Century Fox Motion Picture by Baz Luhrmann, will open on Broadway at the Al Hirschfeld Theatre. Previews will begin June 28, 2019 prior to a July 25 opening night. An exclusive fan-only pre-sale… The Outer Critics Circle (OCC), the official organization of writers on New York theatre for out-of-town newspapers and national publications, present the recipients of this year’s special honors for the 2019-2020 Broadway and Off-Broadway season. Past OCC Award honorees Kristin Chenoweth, Bryan Cranston, Patti LuPone, Lin-Manuel Miranda, and Patrick Stewart, announced this season’s honorees by video feed today, Monday May… We can’t go to Broadway this holiday season, but there are many ways to celebrate theatre with friends and family. Check out our favorite holiday gifts of 2020! FOR THOSE LOOKING TO GET INTO THE HOLIDAY SPIRIT FROM THE COMFORT OF HOME: Get tickets to see Andrew Lincoln (AMC’s “The…",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 814,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/theatrereviews-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:56:38.287Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}