{
  "showId": "moulin-rouge-2019",
  "outletId": "time-out-new-york",
  "outlet": "Time Out New York",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/moulin-rouge-broadway-review",
  "publishDate": "July 25th, 2019",
  "fullText": "Red alert! Red alert! If you’re the kind of person who frets that jukebox musicals are taking over Broadway, prepare to tilt at the windmill that is the gorgeous, gaudy, spectacularly overstuffed Moulin Rouge! The Musical. Directed with opulent showmanship by Alex Timbers, this adaptation of Baz Luhrmann’s 2001 movie may be costume jewelry, but its shine is dazzling. The place is the legendary Paris nightclub of the title, and the year is ostensibly 1899. Yet the songs—like Catherine Zuber’s eye-popping costumes—span some 150 years of styles. Moulin Rouge! begins with a generous slathering of “Lady Marmalade,” belted to the skies by four women in sexy black lingerie, long velvet gloves and feathered headdresses. Soon they yield the stage to the beautiful courtesan Satine (a sublimely troubled Karen Olivo), who makes her grand entrance descending from the ceiling on a swing, singing “Diamonds Are Forever.” She is the Moulin Rouge’s principal songbird, and Derek McLane’s sumptuous gold-and-red set looms around her like a gilded cage. After falling in with a bohemian crowd, Christian (the boyish Aaron Tveit), a budding songwriter from small-town Ohio, wanders into the Moulin Rouge like Orpheus in the demimonde, his cheeks as rosy with innocence as the showgirls’ are blushed with maquillage. As cruel fate would have it, he instantly falls in love with Satine, and she with him—but she has been promised, alas, to the wicked Duke of Monroth (Tam Mutu), on whose patronage the club depends. Also, Satine is dying of consumption, as a classic red-handkerchief moment reveals. Like the film, John Logan’s script trades in unvarnished melodrama. The characters function mostly on the level of archetype: They exist to flesh out the songs, which happily include many of the most memorable pop hits of our time. More than 75 of them are crammed into the musical’s two and a half hours, ranging from Offenbach and Bizet to Walk the Moon’s 2014 earworm “Shut Up and Dance.” The movie’s tentpole tunes (“Nature Boy,” “Your Song,” “Come What May”) have been augmented by dozens of others, spliced into updated megamedleys—the terrific arrangements and orchestrations are by Justin Levine—that keep the audience in an ongoing game of Name That Tune. (Wait, was that Outkast? Pink? Queen? Adele? Beyoncé? Britney Spears? Regina Spektor? David Bowie? Yes.) Moulin Rouge! is one showpiece after another: Olivo and Tveit singing the stuffing out of Katy Perry’s “Firework” and the Police’s “Roxanne,” respectively; a party scene in which absinthe glows like kryptonite as Christian pursues an elusive vision of Satine as a green fairy and his friends—including the club’s louche emcee Harold Zidler (Danny Burstein, with his signature mix of tenderness and verve)—sing Sia’s “Chandelier”; and, best of all, a thrilling dance explosion set to Lady Gaga’s “Bad Romance,” choreographed by Sonya Tayeh and led by the magnetic Robyn Hurder and Ricky Rojas. The musical gives lip service to proletarian ideals, as enunciated by its version of the painter Henri de Toulouse-Lautrec (Sahr Ngaujah), but its appeal is the opposite: As Broadway shows become pricier and pricier, here is one that looks and feels expensive. It’s a very fancy heart-shaped box of Valentine’s Day chocolates, and though you know exactly what you’re going to get, each bite is still a little surprise: sometimes gooey, sometimes nutty, sometimes fruity, sometimes sweet, sometimes stale but mostly delicious. And if it’s any consolation to the haters, Moulin Rouge! may turn out to be the jukebox musical to end all jukebox musicals—if only because, among its particular type of jukebox musical at least, it’s hard to imagine how it can be topped. Al Hirschfeld Theatre (Broadway). Book by John Logan. Music and lyrics by various artists. Directed by Alex Timbers. With Karen Olivo, Aaron Tveit, Danny Burstein, Tam Mutu, Sahr Ngaujah. Running time: 2hrs 40mins. One intermission. Follow Adam Feldman on Twitter: @FeldmanAdamFollow Time Out Theater on Twitter: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page Been there, done that? Think again, my friend. By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. Thanks for subscribing! Look out for your first newsletter in your inbox soon! All kids under 18 can watch a Broadway show for free this February 15 beautiful pictures of NYC under snow By 2030, NYC landlords may be required to provide air conditioners in all units These enormous inflatable dogs will cruise down Manhattan streets this February The best things to do in NYC this weekend Discover Time Out original video",
  "isFullReview": true,
  "showScoreExcerpt": "ââââ \"Red alert! Red alert! If you're the kind of person who frets that jukebox musicals are taking over Broadway, prepare to tilt at the windmill that is the gorgeous, gaudy, spectacularly overstuffed 'Moulin Rouge! The Musical.' Directed with opulent showmanship by Alex Timbers, this adaptation of Baz Luhrmann's 2001 movie may be costume jewelry, but its shine is dazzling.\"",
  "showScoreUrl": "https://www.show-score.com/broadway-shows/moulin-rouge-broadway",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 768,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/time-out-new-york--adam-feldman_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:34:52.504Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}