{
  "showId": "moulin-rouge-2019",
  "outletId": "VULT",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/2019/07/moulin-rouge-broadway-review.html",
  "publishDate": "2019-07-25",
  "fullText": "We apologize for the inconvenience but the page you are looking for cannot be found.",
  "isFullReview": false,
  "bwwExcerpt": "ellent company of actors achieve more fully-realized performances. There are certainly worse ways to spend and evening than with a musical so visually gorgeous and vibrantly performed. Sarah Holdren, Vulture : For all its splashy, glittery, high-kicking, butt-cheek-baring, sword-swallowing maximalism, Moulin Rouge! is something more unsettling than not good. It's not even very interesting. There's a shapelessness about it, a weird enervation underneath the flash and bang. It's directed by Alex Timbers, but it feels like it was assembled by committee, even by algorithm. The show veers broadly away from its beloved-by-millennials-everywhere source material, which in itself is no crime. But the path its creators have taken is one long trip through the Kingdom of Pandering, with multiple pit stops in the Meadows of Cutesiness and the Forest of Flat Characters. Everywhere it should be filthy, it's scrubbed aggressively clean, yet somehow it's still a hot mess. Adam Feldman, Time Out New Yor",
  "showScoreExcerpt": "\"'Moulin Rouge!' Is Broadway’s Biggest Karaoke Night. It commits singlemindedly to stuffing as many additional hit tracks as possible.\"",
  "originalScore": null,
  "assignedScore": 78,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-MOULIN-ROUGE-Opens-On-Broadway-See-What-The-Critics-Think-20190725",
  "textStatus": "partial",
  "textWordCount": 15,
  "archivePath": "data/archives/reviews/moulin-rouge-2019/vult--sara-holdren_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:58:07.321Z",
  "textIssues": [
    "Word count too low: 15 (min: 300)",
    "Show title not found in text"
  ]
}