{
  "showId": "sweat-2017",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Matt Windman",
  "url": "https://www.nytimes.com/2017/03/26/theater/sweat-review-broadway.html?_r=0",
  "playbillVerdictUrl": "https://www.nytimes.com/2017/03/26/theater/sweat-review-broadway.html?_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The bar that is the principal location for “Sweat,” Lynn Nottage’s bracingly topical portrait of American dreams deferred in working-class Pennsylvania, is a place where friendships go to die. Sure, it looks awfully cozy and welcoming, and you can see why its denizens regard it as a second home.\n\nBut this much-trafficked watering hole also exerts a dangerous gravitational force, the kind that holds people in place when they should be moving on. In “Sweat,” which opened on Sunday night at Studio 54, the feeling of familiarity that pervades the play’s central setting gradually shades into contempt among those who drink there — for themselves, for one another and for the life they cannot escape.\n\nAs bars often are in old-fashioned and socially conscious dramas like “Sweat,” this one is a microcosm for a larger world. That includes not only Reading, Pa., the steel town where the play is set, but also a beleaguered part of the United States in which jobs are under siege and identity is fraying.\n\nIt is foolish to underestimate the anger in places like these, as the most recent presidential election confirmed. Though it takes place in 2000 and 2008, and one of its characters swears he will never vote again, “Sweat” is the first work from a major American playwright to summon, with empathy and without judgment, the nationwide anxiety that helped put Donald J. Trump in the White House.\n\nFor that reason alone, the arrival on Broadway of “Sweat,” which originated at the fertile Oregon Shakespeare Festival and was previously staged in New York at the Public Theater, warrants serious applause. So does the fact that it marks the belated Broadway debut of Ms. Nottage, a justly acclaimed dramatist of ambitious scope and fierce focus.\n\nLynn Nottage explains how a broken city gets a turn onstage in her play “Sweat.”\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 331,
  "archivePath": "data/archives/reviews/sweat-2017/nytimes--matt-windman_2026-02-04.html",
  "textFetchedAt": "2026-02-04T18:28:45.268Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250427123333",
  "archiveOrgUrl": "http://web.archive.org/web/20250427123333/https://www.nytimes.com/2017/03/26/theater/sweat-review-broadway.html?_r=0",
  "duplicateTextOf": "nytimes--ben-brantley.json",
  "contentTier": "needs-rescrape",
  "wordCount": 331,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T09:03:31.164Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is cut off mid-article with a JavaScript error message, making it impossible to determine the critic's actual verdict or recommendation about the show.; openai: The text is interrupted with a message about enabling JavaScript and verifying access, indicating it's not a complete review.",
  "promptVersion": "5.2.0"
}
