{
  "showId": "sweat-2017",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2016/11/04/theater/review-the-jobs-are-gone-in-sweat-so-are-peoples-hopes.html?_r=0",
  "publishDate": null,
  "fullText": "In Lynn Nottage’s scorching play “Sweat,” the bonds among a group of working-class friends and family are frayed to the breaking point by the pressure of an eroding economic future. Keenly observed and often surprisingly funny — but ultimately heartbreaking — the work traces the roots of a tragedy with both forensic psychological detail and embracing compassion. Ms. Nottage, a Pulitzer Prize winner for “Ruined,” is writing at the peak of her powers, and the superb cast and the director, Kate Whoriskey, rise to the occasion.\n\nWith the decline of manufacturing jobs in the rust belt having become a significant issue in this turbulent election year, the arrival of the play in New York, where it opened on Thursday at the Public Theater after originating at the Oregon Shakespeare Festival, could hardly be more timely. But the issues it explores have been making headlines for years.\n\nMuch of the play takes place in 2000, with a prologue and other scenes that are set eight years later. In the prologue, we meet two men, still young, in encounters with their parole officer. One is the truculent, uncooperative Jason (Will Pullen), who’s white and doesn’t seem interested in resuming a fruitful life; the other, the black Chris (Khris Davis), is doing his best to get back on track. Both Jason and Chris, we gather, were convicted of the same crime, although its details remain unmentioned, stoking suspense.\n\nThe play then moves back in time. The setting is mostly a bar in Reading, Pa., where workers at a local steel-tubing factory — by this point, one of the few functioning local industries, it’s implied — regularly gather, to celebrate or just ease the burden of another long shift on the factory floor. (To research the play, Ms. Nottage and Ms. Whoriskey interviewed inhabitants of the city, which was cited as the most economically depressed in the country in 2011.)\n\nTonight, Jason’s mother, Tracey (Johanna Day), is celebrating her birthday with her co-workers Cynthia (Michelle Wilson), who is Chris’s mother, and Jessie (Miriam Shor, convincingly a mess), who’s not much fun, slumped over the table, dead drunk. The bartender, Stan (a gruffly sympathetic James Colby), who worked at the same plant for 28 years before he was injured on the job, joins in the party. Grim gossip going around concerns an acquaintance who snapped when his wife left, feared he’d lose his job, and tried to burn his house down.\n\nTracey jokingly asks the bar-back and general handyman, the younger Oscar (Carlo Albán), if he might know a fellow Puerto Rican she could hire to burn her house down, should the urge arise. “Well, I’m Colombian,” Oscar replies, with just a hint of offense, “and I don’t know.” (Mr. Albán gives a tender, sensitive performance in this comparatively quiet role.)\n\nThe more serious subject is the murky news about changes at the plant where Chris and Jason — who we soon learn are close friends — also work. Stan recalls that another local plant shut down with little warning. “You could wake up tomorrow, and all your jobs are in Mexico, wherever,” he says. (Although they are all drawn with nuance, Stan, and a few others, can be sententious: “They squeeze us like a sponge, drain every last drop of blood out and then throw us away.”)\n\nAs “Sweat” proceeds, a sense of unsettling change begins to gather in the bar. A promotion to management is being offered, potentially to one of the floor workers, and when Cynthia mentions that she may apply — after 24 years, she’s had enough of working the line — Tracey reacts with scorn. “Management is for them,” she says, “not us.”\n\nMs. Nottage’s scope is wide, as she alludes to the toll the loss of a job takes: Cynthia’s husband, Brucie (the excellent John Earl Jelks), turned to addiction after his union was locked out — for 93 weeks and counting — at the textile mill where he worked, and she’s had to kick him out of the house.\n\nLynn Nottage explains how a broken city gets a turn onstage in her play “Sweat.”\n\n“Sweat” is an ensemble play, and crucial to its effectiveness is the camaraderie among the characters — how close they have become after working and drinking together for years, and how fragile their relationships are when conflicts arise.\n\nMs. Wilson brings feisty charm and earthy intelligence to Cynthia, making it plausible that she would harbor ambitions beyond physical labor. Ms. Day’s Tracey is more cynical, especially when she decides to apply for that managerial job. After Cynthia gets it, she can’t stop herself from implying that Cynthia got the job only because she is black.\n\nMore dangerous still are the tempers that flare when it is learned that jobs will indeed be eliminated, and that the union workers are locked out. The news that Oscar may apply for one of the nonunion jobs raises the level of tension to near toxic. Particularly incensed is Jason, whom Mr. Pullen imbues with a loose, touchy temperament, and, to a lesser degree, Chris, played with bouncy energy by the engaging Mr. Davis.\n\nAs “Sweat” drives to its disturbing climax with the headlong speed of a train reeling out of control, you may feel that you know where it’s going. And, yes, the play offers a grim picture of how lives buffeted by economic change can slide into desperation. But Ms. Nottage springs a dark surprise that shook me up once again, even though I knew it was coming.\n\nEarly in the play, thinking about his past, Chris remarks with sorrowful bemusement: “A couple minutes, and your whole life changes. That’s it.” Sadly, for the characters in this superb play — essentially good-hearted people just trying to keep on keeping on, and maybe climb a few inches up the social scale — when change inevitably comes, it is not likely to be for the better.\n\nSchedule information on Friday with a theater review of \"Sweat,\" at the Public Theater in Manhattan, misstated the closing date. While the play was originally scheduled to close Nov. 27, it has been extended to Dec. 4.\n\nWe’re interested in your feedback on this page. Tell us what you think.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Keenly observed and often surprisingly funny — but ultimately heartbreaking — the work traces the roots of a tragedy with both forensic psychological detail and embracing compassion. Ms. Nottage is writing at the peak of her powers, and the superb cast and the director, Kate Whoriskey, rise to the occasion...'Sweat' is an ensemble play, and crucial to its effectiveness is the camaraderie among the characters.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 1037,
  "archivePath": "data/archives/reviews/sweat-2017/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:50:30.157Z",
  "designation": "Critics_Pick",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20161207063828",
  "archiveOrgUrl": "http://web.archive.org/web/20161207063828/http://www.nytimes.com/2016/11/04/theater/review-the-jobs-are-gone-in-sweat-so-are-peoples-hopes.html?_r=0",
  "wordCount": 1037,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-07T05:26:31.962Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production of 'Sweat' at the Public Theater, not the current Broadway run.; kimi: This review covers the Off-Broadway premiere at the Public Theater, not the Broadway production. The text explicitly states the play opened at the Public Theater after originating at the Oregon Shakespeare Festival.",
  "promptVersion": "5.2.0"
}
