{
  "showId": "sweat-2017",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Matt Windman",
  "url": "http://variety.com/2017/legit/reviews/sweat-review-broadway-lynn-nottage-1202015575/",
  "playbillVerdictUrl": "http://variety.com/2017/legit/reviews/sweat-review-broadway-lynn-nottage-1202015575/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Following an Off Broadway run at the Public Theater last fall, “Sweat” opened on Broadway March 26. The cast was largely the same, with the exception of new addition Alison Wright taking the place of Miriam Shor. Printed below is an edited version of Marilyn Stasio’s review of the Off Broadway production, which ran in Variety Nov. 3.\n\nIn “Sweat,” Lynn Nottage goes where few playwrights have dared to go — into the heart of working-class America. Her insightfully observed characters all went to the same schools, work at the same factory, drink at the same bar, and are going to hell in the same hand basket. Their jobs, their community, and their way of life are doomed, in director Kate Whoriskey‘s mercilessly realistic production, although no one seems to have gotten the message yet.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nThe entire play takes place on John Lee Beatty’s splendid set of an old neighborhood bar in Reading, Penn., a second home for everyone who works in the factory in this factory town. Stan (a reliable James Colby) owns the place. Tracey, Cynthia, and Jessie, friends who work the line together as their families did for three generations, are his best customers.\n\nTracey (Joanna Day, really committed to the role) talks tough, but seems content to work on the line for the rest of her life, provided she gets regular pay raises and the union continues to protect her benefits. Jessie (played on Broadway by Alison Wright) has no ambitions outside of getting wasted at the end of the week. Only Cynthia (a smart performance from Michelle Wilson) sees her factory job as a way to professional advancement. She applies for a supervisor job and gets it, without realizing the wedge it will create between her and her friends on the line.\n\nNone of them, however — not even Cynthia — thinks of looking beyond their day-to-day jobs. That soothsayer role falls to Stan, who reads both the newspapers and the writing on the wall. He’s heard rumors of layoffs and closings at other plants, and tries to alert his bar patrons. “You could wake up tomorrow and all your jobs are in Mexico,” he warns them.\n\n“They got buttons now that can replace all of us,” someone finally realizes.\n\nNottage wrote “Sweat” after extensive interviews with people in Reading, which accounts for the solid character work and stretches of realistic dialogue. The plot is less successful for trying to cover every conceivable labor issue, from the failure of collective bargaining and the ultimate collapse of the trade unions to the toll on company towns when the local factory, coal mine or steel mill goes under. But credit the writer for giving many forgotten Americans a voice.\n\nAt Stan's, the regulars are quick to dismiss the foreboding warnings as management gossip to keep everyone on edge — despite unmistakable signs that some of their neighbors are already cracking under the stress of shortened hours and cutbacks on the factory line. There’s a lot of heavy drinking and drug dependency. One poor guy burns down his own house. But not even a costly and fruitless strike by their union can get through to some people.",
  "isFullReview": true,
  "textWordCount": 555,
  "archivePath": "data/archives/reviews/sweat-2017/variety--matt-windman_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:33:12.359Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 555,
  "tierReason": "Full review text"
}