{
  "showId": "sweat-2017",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2017/03/theater-review-sweat-on-broadway.html",
  "publishDate": "March 27, 2017",
  "fullText": "Sweat is a play that asks hard questions about who deserves what in America, and why some people's security must come at the cost of others' displacement.",
  "isFullReview": false,
  "dtliExcerpt": "Sweat is a play that asks hard questions about who deserves what in America, and why some people's security must come at the cost of others' displacement.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "What I realized seeing the play again is that its central conflict - between Tracey, who is white, and Cynthia, who is black - is trumped-up. This is not to say that longtime friendships have not been shattered over work disputes, or that work disputes have not surfaced the subcutaneous racism of white people hanging on to their last scrap of privilege. But nothing in Sweat convinces us that these particular women, as established, could develop in the way the play forces them to. Tracey especially, despite Johanna Day's valiant performance, is bent so far out of shape by the dramatic agenda that she no longer makes any sense.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Sweat is a play that asks hard questions about who deserves what in America, and why some people's security must come at the cost of others' displacement.",
  "contentTier": "invalid",
  "contentTierReason": "Short text (27 words)",
  "textQuality": "truncated",
  "rejectedAt": "2026-02-04T14:16:33.413Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence describing the play's themes rather than an actual review with critical evaluation; openai: The text provided is a thematic description of the play 'Sweat' and does not contain any evaluative content or opinion about the current Broadway production.; gemini: This is a plot summary with no evaluation of the production.; kimi: This text provides only thematic description of the play's subject matter ('asks hard questions about who deserves what in America') without evaluating the production quality, performances, direction, or overall merit. It appears to be contextual setup or plot summary rather than critical assessment.",
  "promptVersion": "5.2.0",
  "bwwScore": 7,
  "sources": [
    "web-search",
    "bww-reviews"
  ]
}
