{
  "showId": "eureka-day-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2024/12/16/eureka-day-wokes-the-word-in-jonathan-spectors-timely-comedy/",
  "publishDate": "2024-12-16T19:57:47",
  "fullText": "Broadway audiences frequently reward songs and dances with applause during musicals, but it is exceedingly rare for audiences to applaud the excellence of a scene in the middle of a play. Yet that’s what viewers did midway through Eureka Day. Mad applause erupted during last Friday’s preview of Jonathan Spector’s smart and terribly timely comedy, which opens tonight at the Samuel J. Friedman Theatre.\n\nBefore detailing this wickedly funny sequence, let’s note that Spector’s 95-minute story occurs mostly inside the cheerful library of Eureka Day School, a progressive private institution near San Francisco. It is September, 2018. True to its inclusive ideals, Eureka Day’s executive committee designates a slot for a parent new to the school. So as the play begins, Carina (Amber Gray) and the viewers are neatly clued into Eureka Day’s ultra-liberal policies by Suzanne (Jessica Hecht), one of its founders, and other board members; all obviously goodhearted people.\n\nDon (Bill Irwin) is the kindly, mildly quirky principal who quotes lines from Rumi, the mystical 13th century poet. Meiko (Chelsea Yakura-Kurtz) is a single mom whose stylish clothes suggest money just as her nearly ceaseless knitting hints at inner anxiety. Eli (Thomas Middleditch) is an unkempt stay-at-home dad who talks too much and happens to be a tech millionaire in a semi-open marriage. Not so incidentally, Eli and Meiko are enjoying a casual affair whenever their kids have playdates. While everyone samples a plate of artisanal scones, their nice, earnest conversation drops words such as “contextualize,” “erasure,” “transracial” and “othered.” Carina observes, “You can always spot a Eureka Day kid because at soccer games they’re the ones who cheer when the other team scores.”\n\nThe committee hastily reconvenes a few days later when mumps breaks out and it is learned that dozens of students are not vaccinated. Conflicting opinions on vaccinations and whether to keep the school open or not leads to a livestream video presentation to the parents. To the committee’s confusion and horror, the emoji-dotted comments among the parents – projected above the action so viewers can witness both the cascading remarks and the characters’ reactions – begins as irrelevant bickering and grows increasingly nasty. As sharply staged by director Anna D. Shapiro and expertly played by the ensemble, the cunningly written sequence draws huge waves of laughs that drown out some dialogue.The playwright intends viewers to lose a few words to laughter here, just as he smoothly shifts his play into its darker remainder when the school’s existence is threatened and the committee members argue. Shapiro’s direction and the actors’ natural performances illuminate the satirical comedy’s thoughtful, even heartfelt, passages without sacrificing the ironic humor that suffuses the story.\n\nIt’s ironic, too, how Eureka Day is timely in its seriocomic consideration of liberal mindsets and in its anticipation of the ugly national mood that stews today. Yet it also can be appreciated as a period piece set way, way back in 2018 before the Covid-19 nightmare and the mass usage of Zoom and Tik Tok afflicted American society. Commissioned and produced by Aurora Theatre Company of Berkeley, CA, in 2018, the play was staged in its Manhattan premiere by the Colt Coeur company in a 65-seat space in Tribeca in August 2019. As one of the relatively few reviewers of Colt Coeur’s capable production, let me note that Spector has changed scarcely a word of his fine play aside from crafting a new closing line that brings down the house.\n\nManhattan Theatre Club and director Shapiro give Eureka Day, in every aspect, the tiptop Broadway production it deserves. Designer Todd Rosenthal provides an airy, brightly-colored library that illustrates the school’s joyous outlook. Jen Schriever unobtrusively shades times and moods with her lighting. Designer Clint Ramos aptly dresses the characters; for instance, Suzanne’s voluminous, eccentric clothing choices suggest a hippie background and possibly health issues. The rhythmic, toy piano-style music and sound design both credited to Rob Milburn and Michael Bodeen bespeak childish emotions.\n\nAlthough the actors mesh wonderfully as an ensemble, two artists offer exceptional performances. Anchoring the play as the school’s conciliatory though increasingly harried principal, Bill Irwin employs his eloquently craggy face and elastic body to melt down or freeze up in subliminal comical reactions to circumstances. So poignant in the pivotal role of Suzanne, a sweet, ardent social activist and mom, Jessica Hecht initially is very funny when blithely dealing out woke terms and then later, well, she breaks your heart. Both of these actors and the play and probably other elements of the production are likely to figure prominently in various theater awards come this spring. Certainly they bring great distinction to the current Broadway season.\n\nEureka Day opened December 16, 2024, at Samuel J. Friedman Theatre and runs through February 16, 2025. Tickets and information: manhattantheatreclub.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars"
}
