{
  "showId": "eureka-day-2024",
  "outletId": "theater-scene",
  "outlet": "Theater Scene",
  "criticName": "Joseph Pisano",
  "url": "https://www.theaterscene.net/plays/broadway-plays/eureka-day-2/joseph-pisano/",
  "publishDate": null,
  "fullText": "Posted on December 18, 2024 by Joseph Pisano in Broadway, Plays Bill Irwin, Thomas Middleditch, Amber Gray, Jessica Hecht and Chelsea Yakura-Kurtz in a scene from the Manhattan Theatre Club’s production of Jonathan Spector’s “Eureka Day” at the Samuel J. Friedman Theatre (Photo credit: Jeremy Daniel) Since its 2018 West Coast world premiere and subsequent 2019 downtown bow at the now defunct Walkerspace (reviewed by TheaterScene’s editor-in-chief Victor Gluck), Jonathan Spector’s Eureka Day has achieved a dramatic paradox, both becoming exponentially more topical and more quaint over the last half decade or so. Set at a progressive and private elementary school that shares its name with the play, Spector bitingly takes those two initial and conflicting descriptors to task as a satiric side course to depicting the parental turmoil that follows a mumps outbreak among the students. Though caused by widespread anti-vaxxing beliefs within a decidedly privileged nook of Berkeley, California, Spector does not update his work to fully reflect our post-pandemic moment, instead largely letting the play remain a prescient period piece of impending catastrophe. Given who might be in charge of the U.S. Department of Health and Human Services soon, sadly, Spector’s foresight shows no signs of abating. Perhaps the Manhattan Theatre Club was equally prophetic about the 2024 election, explaining not only the scheduling of Eureka Day for its current Broadway season but also why the production’s run ends on the eve of the next presidential inauguration (does Joe Biden have to pardon the company’s Artistic Director?). Of course, as Spector complicatedly observes, vaccine skepticism exists end-to-end across the political spectrum, with it voiced in Eureka Day by a subset of the school’s entirely liberal executive committee, whose five members long-windedly rule their institution from colorful, child-sized seats in its socially conscious library (the scenic design is by Todd Rosenthal). Before life-and-death matters intrude, however, cultural sensitivity is first combatively asserted in a word-salad discussion about the available racial categories on the school’s admissions form, as if virtue signaling about that dropdown menu will somehow inevitably lead to meaningful student-body diversity. Bill Irwin and Jessica Hecht in a scene from the Manhattan Theatre Club production of Jonathan Spector’s “Eureka Day” at the Samuel J. Friedman Theatre (Photo credit: Jeremy Daniel) Politically correct grandstanding aside, the executive committee, in truth, solely exists to further the vision of its longest serving parent volunteer Suzanne, who the extraordinary Jessica Hecht turns into a cunning, and often hilarious, force of passive-aggressive put-downs and gestures. As single mom and nervous knitter Meiko (Chelsea Yakura-Kurtz) tells the executive committee’s newest member Carina (Amber Gray), decisions come through consensus, a massively high bar that essentially means nothing ever changes, except when the white, wealthy, and deceptively soft-spoken Suzanne allows it. The pragmatic Carina, a black woman, immediately recognizes this group dynamic, going along with it until she finds herself at loggerheads with Suzanne over a vaccine mandate. Though Carina is on the pro side, which is where the play’s sympathies lie, Suzanne, the anti-vaxxer, nonetheless arouses compassion by revealing the flawed reasoning for her stance through a heartbreaking monologue about a past tragedy. Misguided as she is, Suzanne’s intent really is to prevent harm. At the same time, while Spector’s empathy is considerable, it also has a limit, disappearing altogether when Suzanne pugnaciously insinuates to Carina that she should be grateful for the generous financial aid package that allows her child to attend Eureka Day. The underlying intent of this verbal jab is to deliver a not-so-subtle reminder that when Suzanne talks about community, she means her community, one that she is willing to open to the less fortunate but only on completely inflexible terms. That Carina and her partner are paying the school’s full educational costs (which apparently includes listening to nonsense), stuns Suzanne, as if the blow intended for Carina has landed squarely on her own jaw. Amber Gray, Bill Irwin and Chelsea Yakura-Kurtz in a scene from the Manhattan Theatre Club production of Jonathan Spector’s “Eureka Day” at the Samuel J. Friedman Theatre (Photo credit: Jeremy Daniel) The other characters in Eureka Day are caught in the middle of Suzanne and Carina’s convictions, with Meiko and Eli (Thomas Middleditch), a mega-rich former tech bro turned youthful retiree who speaks the language of woke, experiencing predictable and far less predictable complications from their polyamorous relationship. Meanwhile, acting as the play’s straight man, Bill Irwin is a perfect model of feigned equanimity as Don, the Rumi-quoting head of school whose dearly held civility is severely challenged during a virtual town hall scheduled to address the mumps outbreak (guess what a lot of parents are against). As the meeting riotously descends into recriminations, name calling, and the repeatedly sidesplitting use of a thumbs-up emoji, the obliging Irwin humbly accepts being overshadowed by an increasingly frantic and profane succession of chat bubbles displayed on a gigantic raised screen. It’s the play’s best scene, an astounding mix of incredible absurdity and, for all the Zoom veterans out there, undeniable believability, especially with everyone talking and typing past each other. Still, while serving the play’s humor, director Anna D. Shapiro must simultaneously contend with its overt underside, sick children, as well as a modern audience replete with the traumatic knowledge that, after the 2018-2019 school year, the worst is yet to come. Given that, it’s an outright testament to the impressive comedic talents of Shapiro, Spector, and the play’s ensemble that the subject matter of Eureka Day can remain a laughing matter. Eureka Day (extended through February 16, 2025) Samuel J. Friedman Theatre, 261 West 47th Street, in Manhattan For tickets, call 212-239-6200 or visit http://www.manhattantheatreclub.com Running time: one hour and 40 minutes without an intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"both becoming exponentially more topical and more quaint over the last half decade or so\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "rejectedAt": "2026-02-04T07:49:41.887Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is just a fragment with no actual evaluation of the show - appears to be a teaser or excerpt prompt rather than review content; gemini: The provided text is incomplete and lacks any evaluative content. It's a fragment that doesn't offer a clear opinion or recommendation about the show.",
  "promptVersion": "5.2.0",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 949,
  "archivePath": "data/archives/reviews/eureka-day-2024/theater-scene--joseph-pisano_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:51:25.206Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 949,
  "tierReason": "Full review text"
}