{
  "showId": "the-cher-show-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2018/12/03/the-cher-show-turning-back-time-with-a-singular-superstar/",
  "publishDate": "2018-12-03T20:40:33",
  "fullText": "A wildly entertaining affair, The Cher Show truly represents the singular superstar it chronicles: Just like the lady herself, this flashy new musical regarding the fabulous life and times of Cherilyn Sarkisian Bono Allman is funny, down-to-earth, madly flamboyant, occasionally conventional, blazing with talent, and delivers dozens of hit songs.\n\nOpening tonight at the Neil Simon Theatre, The Cher Show will thrill her fans. How this latest jukebox bio-show fares with a greater Broadway audience remains to be seen, of course, but it offers a helluva better experience than Summer, On Your Feet! or Motown the Musical, to name similar attractions that strived to illuminate the lives of pop music legends through their songs.\n\nLike Summer: The Donna Summer Musical, this show deploys three women to depict the star at different stages of life: Babe (Micaela Diamond) is the youngest Cher incarnation, Lady (Teal Wicks) is Cher in her middle ages, and Star (Stephanie J. Block) is the latter day Cher, who turns back time to review her story.\n\nAll three performers—who manage to sound wonderfully like Cher without parodying her distinctive vocals—intermittently converse with each other, narrate events, and plunge into the various scenes and songs of Cher’s lifetime, which chronologically spins out.\n\nRick Elice, the writer, boasts Jersey Boys among his credits, so he surely knows how to craft slick bio-shows. Since its doings are presented to viewers directly by Cher(s), Elice artfully makes the threesome casually speak in Cher’s conversational voice. This lends a personal, often humorous, quality to these proceedings that creates a genuine sense of credence and warmth.\n\nSuch informality also gives Elice latitude to finesse his script, as when Star Cher ends a scene by saying, “Okay, moving on to the next part of the story.” One incredible incident involving Lucille Ball is annotated with the statement, “My hand to God, guys—this conversation actually happened.”\n\nLet’s not describe the mountains and valleys of Cher’s life depicted here, except to note that Elice maps them fluently while making cunning use of the lady’s song stack to reflect her good times and bum times. “Fame is a fleeting bitch,” says Cher, whose show certainly is a testament to tenacity, especially for a woman coping in a showbiz jungle mostly overrun by men. It’s great to see Emily Skinner forthrightly portray the star’s mama, who grounds Cher’s anxieties with the motto “the song makes you strong.”\n\nCher (and Elice) gives full credit to Sonny Bono for her discovery and cultivation as a star, and he is charmingly given life by Jarrod Spector. The couple’s rendition of “I’ve Got You Babe” is downright adorable, and Spector’s rapport with Diamond, Wicks, and Block seems authentic. Cher’s romance and troubled marriage with Gregg Allman (a sweetly hazy Matthew Hydzik) is rendered neatly within the country & western circumstances of “Ramblin’ Man” and other Allman hits.\n\nProbably the show’s most delightful sequences involve Cher’s longtime association with designer Bob Mackie, aptly embodied here with debonair flair by Michael Berresse, whose outrageously glam diva couture retrospectively parades by to the tune of “Ain’t Nobody’s Business If I Do.” Mackie also designs all of The Cher Show costumes and they look terrifically appropriate both in period and hotsy-totsy purpose.\n\nNot all of the show grooves quite so smoothly.\n\nThe meltdown of Cher’s ties with Sonny erupts into a risible “Bang Bang” number involving torturous dancing amid an inferno of hellish projections, while the overstuffed second act, which hosts a droll “The Beat Goes On” salute to Cher’s movie career, proves somewhat choppy.\n\nEven so, it packs a dazzling, dramatic “Dark Lady” dance interlude during which Ashley Blair Fitzgerald wows the crowd as a Cher torn by rival emotions. Christopher Gatelli, who created the choreography for this showstopper, drives the production along sinuously, incorporating at times dance moves devised by others for Cher’s concert and video extravaganzas. The ensemble, sporting some sex-see Mackie duds, whips through the numbers with admirable energy and precision.\n\nAlthough The Cher Show has its occasional stumbles, the production mostly is fluently staged by director Jason Moore, thanks in no small part to the traveling video walls devised by Christine Jones and Brett J. Banakis, which accommodates effectively glitzy atmospherics conjured up by lighting designer Kevin Adams and video designer Darrel Maloney. Similarly, Daryl Waters’ music supervision unifies songs by dozens of writers into a Broadway-scale sonority that still suggests their original pop music flavor.\n\nLook: I’m no Cher fanboy, but I’ve grown up enjoying her songs, performances (I saw her breakthrough stage turn in Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean back in 1982 and, no lie, she was the real deal), and the forthright personality that she always radiates. Take it from me: The Cher Show does Cher proud and the show delivers enormous entertainment in doing so.\n\nThe Cher Show opened December 3, 2018, at the Neil Simon Theatre. Tickets and information:  thechershowbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
