{
  "showId": "the-cher-show-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2018/12/03/the-cher-show-just-as-sassy-bold-and-determined-as-the-star-herself/",
  "publishDate": "2018-12-03T20:35:09",
  "fullText": "The indomitable Cher is making certain that the beat goes on—and on and on and on. As one of the producers of The Cher Show, she’s helped guarantee that the Neil Simon Theatre stage transfer is a great big hit as it reprises her life with and without her ambitious mother Georgia, with and without creative but money-hungry Sonny Bono, and with and without fancy guitarist and drug-inclined Gregg Allman.\n\nHer valentine to herself is just what a fan—this reviewer is a loyal one—might have expected it to be: a glittering, glamorous Las Vegas-like jukebox revue elevated by a basic but snappy Rick (Jersey Boys) Elice book that tracks the onetime Cherilyn Sarkisian from her poor childhood as a dark Armenian among California blonds to Top 40 standing to The Sonny and Cher Comedy Show to Oscar-winning actor and to abiding, often activist celebrity.\n\nJust as it takes three performers to portray Donna Summer in the Las Vegas-like jukebox revue Summer, Stephanie J. Block, Teal Wicks, and Micaela Diamond are Cher as, respectively, Star, Lady, and Babe. Their cumulative depiction amounts to a jaw-dropping presentation of Cher’s sound and inimitable sashay.\n\nActually, Block, Wicks and Diamond are so effective at their work that it’s got to be said that evidently Cher is imitable, after all. They nail Cher, about whom it might be said her vocal dynamics are what distinguish her more than the deep emotional feelings she lends a lyric. Block, in particular, who narrates throughout, is given the lengthiest share of Cher and is astounding.\n\nThe hits are here—“Believe,” “Gypsies, Tramps and Thieves”, “Half Breed,” “If I Could Turn Back Time,” “The Way of Love.” The song list includes, of course—how could they not be included?—“The Beat Goes On,” “Bang, Bang,” and “I Got You, Babe,” all written by Sonny Bono, whom Jarrod Spector plays. Yes, it only takes one actor to represent Sonny, and Spector, a Beautiful alumnus (he opened as songwriter Barry Mann in that jukebox example), is perfect at the high Sonny Bono pitch and the tv-show picked-on swagger.\n\n(During the action, Sonny is shown hounding Cher to work long hours so they’ll never go hungry again, but this self-perpetuating production suggests that perhaps she isn’t against upping the bank account, either.)\n\nA strong argument could be made that a humongous part of the Cher look was created by Bob Mackie. So it’s only right that he has the costume design assignment here, which he takes with the endless glitzy fantasies that often turned Cher into a dazzling outré-fashion manikin.\n\nBackstage the costume racks must take up enormous space. The dressers must end performances needing oxygen. There’s a stunningly staged act-one dress parade that’s a Cher highlight. Certainly Mackie—played here by the agile Michael Berresse—has the costume design Tony sewed up (pun intended, needless to say). (What was the costume budget? The producers aren’t revealing.)\n\nNo matter how uplifting or downgrading a Broadway musical might be, more often than not a craftsmanship prevails that never falls below a level not reached anywhere else on the theater planet. That display is on offer here with Charles G. LaPointe’s wigs, the Christine Jones and Brett J. Banakis sets, the Kevin Adams lighting and Nevin Steinberg sound. The same goes for Darrel Maloney’s video and projection design and certainly the Daryl Waters music supervision, orchestrations and arrangements and Andrew Resnick’s music direction.\n\nJason Moore’s direction is spot on from start to finish, as are the actors energized under him. Prominent among them are Emily Skinner as Cher’s mom Georgia Holt, Matthew Hydzik as talented, bedeviled Gregg Allman and Michael Campayno as bagel guy Rob Camelletti, with whom Cher had a hot but paparazzi-infested fling.\n\nAs might be expected in a jukebox review of this sort, there’s plenty of choreography. Christopher Gattelli is responsible for it. He looks to have gone after a music-video look, which he and his hard-working dancers easily accomplish. The result may not be consistently fresh and inventive, but there it is again and again.\n\nThese days, Cher—who never shies away from expressing what’s on her mind with humor and intelligence—tweets regularly. Maybe the thing to do with The Cher Show is to regard it as a theater-sized tweet and a fan’s treat.\n\nThe Cher Show opened December 3, 2018, at the Neil Simon Theatre and runs to March 17, 2019. Tickets and information: thechershowbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
