{
  "showId": "the-nance-2013",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/broadway-review-nance-645127/",
  "publishDate": "April 16, 2013",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Nathan Lane gives a powerhouse performance in Douglas Carter Beane's moving drama about a comedian who performs in drag in 1930s burlesque houses.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Nathan Lane gives a powerhouse performance in Douglas Carter Beane's moving drama about a comedian who performs in drag in 1930s burlesque houses.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/nance-theater-review-439779",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "textWordCount": 453,
  "archivePath": "data/archives/reviews/the-nance-2013/hollywood-reporter--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:55:20.070Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "RIO DE JANEIRO – “In season 5 I pitched to kill Sookie, I really did,” revealed True Blood writer/executive producer Raelle Tucker of Anna Paquin's character who was close to disappearing from the show “because I think nobody should be safe.”\n\nTucker joined Grey's Anatomy's co-producer William Harper last week to talk about their decision to kill off characters and other curiosities about their shows at a seminar about TV series production at Rio Market, an industry sidebar at Rio de Janeiro Film Festival.\n\nDuring the seminar moderated by Brazilian screenwriter Ren&ecirc; Belmonte, the Brazilian audience was interested to know how they felt about the audience being upset after a character is out of the show.\n\nPHOTOS: ‘True Blood’s’ 10 Bloodiest Deaths\n\n\"It's a good feeling if the audience is feeling upset when a character dies, that means we have done our job right,\" Tucker said. The TV writer continued to explain that there is a certain amount of death that they need to have because people are constantly on the verge of almost being killed, so if authors don't kill somebody, “there is no point.”\n\nMeanwhile, Grey's Anatomy's Harper said he finds it challenging when a great actor needs to exit the show, stating, \"Our stories have a naturally ending, so it's a combination of actors wanting to move on and a character having a naturally end to their stories.”\n\nHarper also addressed the success of the medical TV series going strong in its tenth season.\n\n\"Shonda [Rhimes] has a very specific voice and in 2005 no one had never heard that voice before and she came up with the show that put a lot of people in the same position as the main characters and spoke to that voice and it wrap the audience really quickly,\" he said.\n\nMeanwhile, Tucker said that one of the main reasons for True Blood's success is the support of the network and the studio.\n\nSTORY: On the Set of Stephen Daldry’s ‘Trash’ in Rio: Stray Dogs and a Massive Garbage Dump\n\nTucker also expressed that television \"has never been so exciting\", especially with the addition of the new platforms like Netflix, Amazon and Hulu: “It feels that the only limitation on television is what you can imagine, there is no boundaries of what you can say, what you can do.”\n\nThe producer/screenwriter is also developing two new series including an untitled project about a woman trying to break into a male dominated industry involving murder and drugs. The second is called Junction, a story set in Silver Lake, a neighborhood in Los Angeles. The series is about an unconventional relationship between two women in their 20’s.\n\nRio de Janeiro International Film Festival ends Oct. 10."
}