{
  "showId": "the-nance-2013",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2013/04/16/theater/reviews/the-nance-starring-nathan-lane-at-lyceum-theater.html",
  "publishDate": "April 15, 2013",
  "fullText": "https://www.nytimes.com/2013/04/16/theater/reviews/the-nance-starring-nathan-lane-at-lyceum-theater.htmlShare full articleAdvertisement\n\nA spotlight works like a face-lift on Chauncey Miles, the title character of “The Nance,” the strained if heartfelt new play by Douglas Carter Beane, set in the twilight of burlesque. As portrayed with shiny expertise and dark conviction by Nathan Lane in a production that opened on Monday night at the Lyceum Theater, Chauncey looks every year of whatever age he may admit to, and then some, whenever he’s not onstage.\n\nBut put him before an audience in the seedy theater where he plies his trade in the late 1930s, and the haggard Chauncey becomes as bright and rosy as a pink light bulb. The anger and anxiety that creased his face in the wings have been exchanged for a contented, commanding smoothness. Never mind that Chauncey is now playing a mincing caricature of the gay man he is in real life. For as long as the comedy sketch lasts, he’s in charge, at home and at ease.\n\nMr. Beane has said that when he conceived “The Nance,” he envisioned Mr. Lane in the leading role. You can understand why. Among Broadway’s marquee names, Mr. Lane is the sole avatar of a spirited comic tradition that stretches back to vaudeville and is associated with stars like Eddie Cantor, Bert Lahr and Phil Silvers.\n\nLike them, he has a puckish signature persona that automatically makes people smile and reads big, even from the balcony. But before he became a Tony-winning song-and-dance star in shows like “The Producers,” Mr. Lane had demonstrated a brooding dramatic intelligence in plays that included Terrence McNally’s “Lisbon Traviata.” He has since taken on classic angry middle-aged-man roles in Simon Gray’s “Butley” and in Eugene O’Neill’s “Iceman Cometh.”",
  "isFullReview": true,
  "dtliExcerpt": "Mr. Lane gives what may be the performance of his career, finding the aching soul within the seemingly debased comic stereotype.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "A spotlight works like a face-lift on Chauncey Miles, the title character of 'The Nance,' the strained if heartfelt new play by Douglas Carter Beane, set in the twilight of burlesque. As portrayed with shiny expertise and dark conviction by Nathan Lane in a production that opened on Monday night at the Lyceum Theater, Chauncey looks every year of whatever age he may admit to, and then some, whenever he's not onstage...This Janus-faced persona makes Mr. Lane a natural for the divided soul that is Chauncey, and he doesn't disappoint. Moving between his natural and artificial selves in increasingly adverse circumstances, his Chauncey flips the on and off switch so often that it finally short circuits, to devastating effect...But even Mr. Lane can't reconcile all the disparities Mr. Beane's script asks him to weave together.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-NANCE-Opens-on-Broadway-Updating-LIVE-20130415",
  "showScoreExcerpt": "Mr. Lane gives what may be the performance of his career, finding the aching soul within the seemingly debased comic stereotype.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (21 words)",
  "textQuality": "partial",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "playbillVerdictUrl": "http://theater.nytimes.com/2013/04/16/theater/reviews/the-nance-starring-nathan-lane-at-lyceum-theater.html?pagewanted=all&_r=0",
  "previousUrl": "https://www.nytimes.com/2013/04/16/theater/reviews/the-nance-starring-nathan-lane-at-the-lyceum.html",
  "urlDiscoveredAt": "2026-02-04T01:59:15.575Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 285,
  "archivePath": "data/archives/reviews/the-nance-2013/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T19:17:49.038Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "wordCount": 285,
  "tierReason": "Short text (285 words)",
  "bwwScore": 8,
  "rejectedAt": "2026-02-06T16:29:44.032Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is cut off mid-sentence and ends with a technical error message about retrieving content and enabling JavaScript, making it impossible to determine the critic's verdict.; openai: The text is incomplete and includes a technical error message about enabling JavaScript, indicating it is not a full review.",
  "promptVersion": "5.2.0",
  "archiveOrgTimestamp": "20241216075714",
  "archiveOrgUrl": "http://web.archive.org/web/20241216075714/https://www.nytimes.com/2013/04/16/theater/reviews/the-nance-starring-nathan-lane-at-lyceum-theater.html"
}