{
  "showId": "the-nance-2013",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2013/04/theater-review-the-nance.html",
  "publishDate": "April 16, 2013",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Joan Marcus\n \n \n \n It’s no small thing to hand a great performer a great part. Did I say “small thing”? Did I say “great part”? Whaaat!?\n\nWelcome to the camp world of The Nance, in which Douglas Carter Beane has written Nathan Lane his best new role in years. (The play grows on you, too — whaaat?!) Lane plays Chauncey Miles, a burlesque performer who spews double entendres like Rip Taylor tossing confetti.* “I’m usually more comfortable with a hymn,” he lisps in a church sketch. “What? What? I like to play with the organ. What? What? I love love love when the organ swells. Oh, you brutes!”\n\nChauncey is the nance act at the Irving Place Theater near Union Square circa 1937, doing bits between the strips. Though Chauncey is a fiction, the nance was a real feature of burlesque, as much a part of its ecosystem as the top banana and the talking woman. And just as no one assumed that a performer playing a “Hymie” or a “Dago” was actually Jewish or Italian, the nance was not seen as actually gay, if such a category was even clearly delineated at the time. Indeed, the character’s extravagant effeminacy, his leering yet somehow neutered sexuality, was funny largely to the extent it was assumed to be incredible. Strange as it now seems, the nance was welcome, even beloved, onstage.\n\nThe problem, at least for Chauncey, is offstage. He really is gay, though he thinks of himself in harsher terms. (A pansy playing a nance, he says, is “like a Negro doing blackface” — also not uncommon then.) A lifelong Republican with the survival instincts of a rat on a ship, he has constructed for himself a kind of mirrored closet: He lets you see no more than he’s willing to reflect. The obvious queens in their astrakhan coats get disdain, the vice cops a butched-up image of propriety. Only to men he finds attractive will he offer a subtle sign — the placement of a hat will do — announcing his availability. In this way he has come to accept, and even to believe he prefers, a life of cat-and-mouse cruising for frustrated husbands at restaurants and rough trade under cover of dark. That he might just as easily be arrested or beaten up, depending on how accurately he reads his intended audience, is a fact he has incorporated into his gnarled idea of romance.\n\nBut at a Horn & Hardart Automat one evening, Chauncey picks up a sweet and famished if unwashed young man, lately run away from Buffalo and his wife, not necessarily in that order. To Chauncey’s surprise, Ned is neither straight nor trade: He is a new breed we may begin to recognize, not tortured by his love of men and expecting no less from that love than what anyone “normal” might. On top of that, he’s gorgeous — did I say “on top”? Whaaat!?\n\nAs Ned and Chauncey embark on an uneasy affair that tests new possibilities for openness and self-acceptance, the world of burlesque is threatened by forces pushing in the other direction. Chauncey’s hero, Mayor LaGuardia, begins a crackdown on stage indecency, under the prudish eye of the city’s commissioner of licenses, Paul Moss. (It is not lost on Chauncey that Moss — a real figure in New York history — was a failed theatrical himself, a lifelong bachelor and “dandy.”) In this way, Beane’s script finds ways to rock Chauncey’s equilibrium both onstage and off. Scenes from the two worlds alternate, with the burlesque skits and even the strips commenting, like Cabaret’s songs, on the “real life” action. At first this is mostly comic, as when the early glow of the affair butts up (oh, never mind) against this bit of ribaldry with Efram, the top banana:\n\nCHAUNCEY: Peace and Quiet Rest Home, how may I help you today?EFRAM: I’d like a room, please.CHAUNCEY: Ooooooooh. I could just spit. We’re all full up.EFRAM: Hey, I’m a Crisco salesman, you sure you can’t slide me in somewhere?CHAUNCEY: Well this is an interesting position you’ve put me in. I’m sure if you forced things — yes. I’ve found an opening! There’s room for you. Plenty of room.\n\nAs the two stories play out, though, they darken and intertwine. Likewise, the comedy turns rueful and garish; Chauncey’s final aria is delivered in the character of an old streetwalker named Hortense. (“She looks pretty relaxed to me.”) Admirably, Beane resists any hint of a happy ending, the promise of liberation still being decades away, but he resists melodrama too. The play ends with a startling image that’s as gorgeous as it is incomprehensible. I guess you’d have to call it a coup de what.\n\nIn any case, Beane has done an admirable job of digging into the historical material to reveal something rather deep: a source of the creation of modern gay identity in the unlikely crucible of the theater. The Nance is in that sense a love letter to an outlived form of both social construction and entertainment. You can feel it in the care with which the burlesque bits have been given the right mix of grin and groan, and in the spot-on songs — lyrics by Beane, music by Glen Kelly — that eerily recall the sound of those distant ditties with their gnomic catchphrases (“Hi, simply hi!”) and forgotten assumptions.\n\nFor Beane, the play is a revelation that effects a rehabilitation. After writing the books of three fairly trite musicals, he has found a way to harness his love of camp and make it do something other than amuse with diminishing returns. When The Nance is sharp, it’s very sharp indeed. But it isn’t perfect; Beane will go almost anywhere for a joke, even years into the future, and the storytelling gets woozy and frankly a bit lost whenever it leaves the central plot behind. Some scenes — especially those involving an attempt by the burlesque workers to organize their theatrical colleagues in a strike—are almost impossible to follow. That the director, Jack O’Brien, has not been able to focus this material is an oddly glaring problem considering that the rest of the action is so satisfyingly organized on John Lee Beatty’s gorgeous revolving set. And in general the supporting cast, save that old pro Lewis J. Stadlen as Efram, is not as convincing in the later material as in the earlier.\n\nBut Lane, in the apotheosis of his sad clown routine, is sensational throughout. Rarely have his innate qualities of pathos and quacking cheer been put to better use; it’s hard to decide whether Beane has given him a part he was born to play or he has given Beane a role he was born to write. His patented way of saying something funny and then disowning it with a scowl — the pause that disgusts — here becomes a kind of living double entendre, the apparent meaning souring almost immediately into something much darker. When Beane has Chauncey explain that the heart of burlesque humor is “the gap between what is known and what can be said,” it’s impossible not to feel it. Lane’s genius, exploited so beautifully in The Nance, is that he not only feels that gap, he lives there.\n\nThe Nance is at the Lyceum Theater through June 16.\n\n* This review previously read “Rip Torn throwing confetti” when it should have read “Rip Taylor throwing confetti.”\n\nShow \n \n \n Leave a Comment\n \n\n Theater Review: The Nance\n\n \n \n\n Things you buy through our links may earn Vox Media a commission.\n\nEditor’s Picks\n \n \n \n \n \n \n \n \n 2024 rnc\n \n Photos: The Triumphalist Republican National Convention\n Photos: The Triumphalist Republican National Convention\n \n \n \n \n \n \n \n \n \n \n health\n \n When a Mammogram Misses Breast Cancer\n When a Mammogram Misses Breast Cancer\n \n \n \n \n \n \n \n \n \n \n gold rush\n \n The Soft Devastation of Netflix’s Emmy Morning\n The Soft Devastation of Netflix’s Emmy Morning\n \n \n \n \n \n\n \n\n \n \n \n Sign In to Comment\n \n\n \n \n Most Popular\n \n\n \n \n \n \n Cinematrix No. 113: July 17, 2024\n \n \n \n \n \n \n Shōgun and The Bear Lead 2024 Emmy Nominations\n \n \n \n \n \n \n The Acolyte Season-Finale Recap: Original Sins\n \n \n \n \n \n \n Who’s Presumed Guilty on Presumed Innocent?\n \n \n \n \n \n \n Have You Ever Heard ‘The Star-Spangled Banner’ Sung in Cursive?\n \n \n \n \n\n \n \n \n \n The Acolyte Season-Finale Recap: Original Sins\n \n \n \n \n \n \n Who’s Presumed Guilty on Presumed Innocent?\n \n \n \n \n \n \n Presumed Innocent Recap: So You Snapped\n \n \n \n \n \n \n Shōgun and The Bear Lead 2024 Emmy Nominations\n \n \n \n \n \n \n Cinematrix No. 113: July 17, 2024\n \n \n \n \n\n \n\n \n \n \n\n \n \n\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n\n \n \n Email\n \n \n\n \n \n You\\'ll receive the next newsletter in your inbox.\n \n \n *Sorry, there was a problem signing you up.",
  "isFullReview": true,
  "dtliExcerpt": "The Nance is a beautifully crafted play about the costs of hiding, and Nathan Lane gives one of his finest performances as Chauncey Miles, a burlesque comic who specializes in effeminate stereotypes while concealing his own homosexuality.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "For Beane, the play is a revelation that effects a rehabilitation. After writing the books of three fairly trite musicals, he has found a way to harness his love of camp and make it do something other than amuse with diminishing returns. When The Nance is sharp, it's very sharp indeed. But it isn't perfect; Beane will go almost anywhere for a joke, even years into the future, and the storytelling gets woozy and frankly a bit lost whenever it leaves the central plot behind...But Lane, in the apotheosis of his sad clown routine, is sensational throughout. Rarely have his innate qualities of pathos and quacking cheer been put to better use; it's hard to decide whether Beane has given him a part he was born to play or he has given Beane a role he was born to write.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-NANCE-Opens-on-Broadway-Updating-LIVE-20130415",
  "showScoreExcerpt": "The Nance is a beautifully crafted play about the costs of hiding, and Nathan Lane gives one of his finest performances as Chauncey Miles, a burlesque comic who specializes in effeminate stereotypes while concealing his own homosexuality.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "playbillVerdictUrl": "http://www.vulture.com/2013/04/theater-review-the-nance.html",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 8,
  "textWordCount": 1409,
  "archivePath": "data/archives/reviews/the-nance-2013/vulture--jesse-green_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:10:38.269Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240718052630",
  "archiveOrgUrl": "http://web.archive.org/web/20240718052630/https://www.vulture.com/2013/04/theater-review-the-nance.html",
  "wordCount": 1409,
  "tierReason": "Full review text"
}
