{
  "showId": "come-from-away-2017",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2018/10/24/come-from-away-get-a-gander-at-strangers-being-kind-to-each-other/",
  "publishDate": "2018-10-24T23:38:09",
  "fullText": "When people hear about my line of expertise, they often ask me to suggest a Broadway production that they might like. Before doing so, usually I inquire about what shows they have enjoyed in the past and whether they want to see an attraction that’s serious or otherwise.\n\nAfter all, some theatergoers might prefer to skip the complex, historical charismatics of Hamilton or the moody charms of The Band’s Visit to pleasurably party instead with the sex-see Chicago crowd.\n\nThese days, however, the one musical that I unreservedly tell everyone to see, and take their family to it, too, is Come From Away.\n\nIts real-life story is stirring and honestly heartwarming, the tunes sound friendly to the ear, and the whirlwind staging is so smart that it’s scarcely noticeable.\n\nA visit to the Schoenfeld Theatre, where Come From Away has been packing in capacity audiences since early in 2017, finds the show to be in excellent shape with nearly all of its original 12-person cast still giving vivid life to what seems like hundreds of different characters.\n\nThe actors expertly portray, among many, many others, a cross-section of the Canadian natives of Gander, a little town in rural Newfoundland that happens to have a large airport left over from the bygone times of pre-jet air travel. Back in September, 2001, that’s where 38 jets flying over from Europe unexpectedly descend when 9/11 erupts and all aircraft are ordered to land immediately.\n\nSuddenly, the folks of Gander and nearby villages find themselves hosting more than 7,000 bewildered strangers who are scared, hungry, and otherwise distressed by their situation.\n\nThese “plane people,” as the Gander folk call them, not only involve Americans of every color, creed, and race who are heading for home, but also include travelers from multiple nations around the globe—and their animals, too, as a volunteer from the local ASPCA discovers when she ventures into various cargo holds.\n\nHow the good folk of Gander manage to accommodate and even entertain their multitudes of guests during the next week, as well as how these visitors who “come from away” deal with it all, fuses into an emotionally resonant saga adeptly created by Irene Sankoff and David Hein, who crafted the show’s book, music, and lyrics.\n\nThe sorrowful aftermath of the 9/11 attacks on the U.S. mainland smolder in the background as the writers concentrate on what happened among the newcomers and the natives of Newfoundland.\n\nStrangers fall in love, couples break up, unlikely friendships are forged, and cultural differences are bridged as everyday individuals reveal their better/nicer sides under challenging circumstances. This documentary-style musical—such a format is a musical theater anomaly—is rendered with compassion, humor, and insight during a fast-moving 100 minutes. The score’s rhythmic, folk-rock music, which possesses a windswept, Celtic flavor, briskly drives along these compelling doings.\n\nChristopher Ashley, who directs the production (and deservedly won a Tony Award for his artistry), and scenic designer Beowulf Boritt make strategic use of a turntable and some homely chairs and tables to present a flexible performance area that switches locations from a plane full of passengers to a coffee shop to the countryside in a second. The fluidity of such staging allows the show’s many story-lines to freely play out, just as the changeable everyday bits and pieces among designer Toni-Leslie James’ award-winning costumes cunningly enable the dozen actors to instantly switch through their many roles.\n\nThese instant modulations in characterizations, with their varying accents and personal attitudes, are believably projected by the actors, whose tightly-meshed performances as an ensemble are so sterling that to single any one of them would not be fair.\n\nStill … let’s give in and at least mention the intense presence of Jenn Colella, whose steely depiction of an airplane captain from Texas (plus her show-stopping rendition of the character’s soaring “Me and the Sky” solo) proves especially striking. And let’s give a shout-out to the eight-member onstage band, whose lively country & western-ish sounding instrumental music-making never cease to maintain the show’s upbeat energy level.\n\nAshley’s brilliant (yet clandestine) staging of the production lends every moment of this show a spontaneous quality that aptly reflects the musical’s essential motive about people figuring things out as they go along.\n\nIn our currently sad, nasty, troublous times of divisive politics and general distrust, it is really lovely to experience Come From Away, a humane, heartfelt reminder that people are capable of being kind and generous to each other in difficult circumstances. Yes, oh, yes, everybody should see this show.\n\nCome from Away opened March 12, 2017, at the Gerald Schoenfeld Theatre. Reviewed: October, 2018. Tickets and information: comefromaway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
