{
  "showId": "come-from-away-2017",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Robert Hofler",
  "url": "http://www.thewrap.com/come-from-away-broadway-review/",
  "playbillVerdictUrl": "http://www.thewrap.com/come-from-away-broadway-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Sankoff and Hein's book tries to drum up suspense in the show's opening scenes by telling us that few of these visitors to Gander knew about the attacks on the World Trade Center and the Pentagon, because few people back then owned cell phones. Really? As songwriters, this duo relies on a strong percussive element that's so incessant that their songs take on a militaristic flair. And they're also very, very loud. Gareth Owen's sound design is the most abrasive to grace a Broadway stage since the entry of 'Waitress' a year ago. Dialogue is shrill and disembodied from the actors, and when the ensemble sings any of the show's foot-stomping anthems, the lyrics are indecipherable. Come from Away is a musical about hope, perseverance and people coming together to help each other in difficult times. The Gander townspeople have much in common with the citizens of Meredith Willson's River City, only they're much more adorable.",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-COME-FROM-AWAY-Lands-on-Broadway-Updating-Live-20170312",
  "showScoreExcerpt": "\"As songwriters, this duo relies on a strong percussive element that’s so incessant that their songs take on a militaristic flair. And they’re also very, very loud...Dialogue is shrill and disembodied from the actors, and when the ensemble sings any of the show’s foot-stomping anthems, the lyrics are indecipherable...Christopher Ashley directs the ground traffic, and when he finally gets all those stranded visitors back up in the air you will definitely experience their sense of relief.\"\n\nRead more"
}