{
  "showId": "stranger-things-2024",
  "outletId": "broadwayworld",
  "outlet": "BroadwayWorld",
  "criticName": "Alexander Cohen",
  "url": "https://www.broadwayworld.com/article/Review-STRANGER-THINGS-THE-FIRST-SHADOW-Phoenix-Theatre-20231215",
  "publishDate": null,
  "fullText": "Review: STRANGER THINGS: THE FIRST SHADOW, Phoenix Theatre An intoxicating marriage of epic story and mesmerising theatricality makes this a must-see for fans By: Alexander Cohen Dec. 15, 2023 POPULAR 1 OH, MARY! to Launch U.S. Tour in Fall 2026 2 Broadway Shows Weather the Storm: What Happens to Performances During Major NYC Snowfall? 3 The Business Behind Broadway: When and Why Shows Open or Close 4 A Complete History of RAGTIME googletag.cmd.push(function(){googletag.display('div-gpt-ad-1442371043694-2');}); document.getElementById('pxl').src += '&sourcevar=' + encodeURIComponent(document.referrer); LATEST NEWS Video: BEETLEJUICE Cast Takes Final Bow at Broadway Sessions Video: Audition-Ready Beauty: A M·A·C Makeup Artist Shares the Perfect Self-Tape Look Photos: THE LOST BOYS Arrives on Broadway Theaters Cancel Performances Due to Severe Weather - Updating Live 1/1 Skip Ad Continue watchingafter the adVisit Advertiser websiteGO TO PAGE.cnx-non-linear-ad-container .cnx-ad-bid-slot{position:absolute;top:0;left:0;grid-area:adslot;opacity:0;background:none;width:100%;height:100%}.cnx-non-linear-ad-container .cnx-ad-bid-slot.cnx-ad-bid-slot-selected{opacity:1;z-index:10}.cnx-non-linear-ad-container .cnx-ad-slot{display:flex;position:absolute;top:0;left:0;justify-content:center;align-items:center;width:100%;height:100%;overflow:hidden}.cnx-non-linear-ad-container .cnx-ad-slot video,.cnx-non-linear-ad-container video.cnx-ad-slot{background-color:unset}.cnx-ad-container .cnx-ad-bid-slot{position:absolute;top:0;left:0;grid-area:adslot;opacity:0;background:#f4f4f4;width:100%;height:100%}.cnx-ad-container .cnx-ad-bid-slot.cnx-ad-bid-slot-selected{opacity:1;z-index:10}.cnx-ad-container .cnx-ad-slot{display:flex;position:absolute;top:0;left:0;justify-content:center;align-items:center;width:100%;height:100%;overflow:hidden}.cnx-ad-container .cnx-ad-slot div{background-color:rgba(0,0,0,0) !important}.cnx-ad-container .cnx-ad-slot iframe{box-sizing:border-box;border:3px solid #fff !important;color-scheme:none}.cnx-ad-container .cnx-ad-slot iframe:not([id]){border:none !important}.cnx-ad-container .cnx-ad-slot-video-type iframe{border:none !important}.cnx-ad-container .cnx-ad-slot video,.cnx-ad-container video.cnx-ad-slot{background-color:#f4f4f4}Video: Inside Opening Night of STRANGER... Video: STRANGER THINGS Is Still... Video: Sadie Sink Is Living for the Warm... Video: STRANGER THINGS: THE... Video: STRANGER THINGS (new Image()).src = \"https://capi.connatix.com/tr/si?token=2567734e-c94e-44e5-83a6-446910cda556&cid=81bd3014-14af-4d51-b524-e3719a43b0b8\"; cnx.cmd.push(function() { cnx({ playerId: \"2567734e-c94e-44e5-83a6-446910cda556\" }).render(\"fa5da7a21b4442c78e1f9d7b5f8c914c\"); }); It’s very much a case of if it ain’t broke don’t fix it. The winning formula of gruesome body-horror thrills, teenage romance, and fuzzy edged nostalgia for the analogue age will feel familiar in this highly anticipated stage prequel. But if that formula is raking in millions who is complaining? If it’s Stranger Things you want, it’s Stranger Things you’ll get. It could have risked devolving into campy schmaltz but Kate Trefry, along with Jack Thorne, pen a standalone story that stands strongly on its own two feet. An adventure romp brimming with action and exploding with spectacle, expect a fare few winks to the fans along the way and a healthy dash of horror. We are in 1950s Hawkins with teenage versions of favourite characters navigating the hormone fuelled ebbs and flows of small town America. Backstories are interwoven deftly: Henry Creel’s socially maladjusted childhood and metamorphosis into the mad bad muscle monster Vecna takes centre stage. Jim Hopper’s journey from rebel without a cause to straight-laced cop and the seeds of his will-they won’t-they relationship with Joyce, who rather reflexivley is directing the High School play, are firmly sown together to a soundtrack of Elvis and doo wop. Yes, you probably do need to have watched the show to get what is going on. The light shed on characters’ backstories gives them added depth and intrigue. Even sadistic G-man Dr Brenner is given a suitably creepy past, made all the more deliciously spine-chilling by an excellent Patrick Vaill and the writing’s attention to real world conspiracy theories. The most praiseworthy inheritance from the show is the decision to cast newcomers as leads. Louis McCartney makes an outstanding professional stage debut as the tormented Creel, creepy in spades, but always retaining a flicker of magnetic humanity. Ella Karuna Williams plays Creel’s love interest Patty Newby with heartfelt sincerity. No doubt like the series they will go on to become household names, and the rest of the cast do dazzling jobs of capturing their screen counterparts’ idiosyncrasies. The boundary between stage, screen, and streaming service has never been more blurred. Almost literally. Steven Daldry’s production is supercharged with kinetic energy thanks to Miriam Buether’s gorgeously evocative set design. The revolve stage spins around sliding one scene cinematically into another. Even opening titles borrowed straight from the TV show make a grand appearance anchored with now iconic electro score. Sadly there’s no Kate Bush. But there is Philip Glass whose soundtrack, borrowed from his operas, sets the tone for the epic standoffs to come. Is this a bad thing? The stage and the screen will never be substitutes but Stranger Things: The First Shadow never feels limited by the medium. It leans into the theatricality hammering the audience with slick illusions and visually stunning trickery applied impasto. No expense is spared but that is hardly surprising. Netflix lackeys were scurrying around the press night no doubt crossing their fingers for a hit. They can breathe a sigh of relief. But I doubt they were holding their breath. Read our interview with actor Michael Jibson about the show here. Stranger Things_The First Shadow plays at The Phoenix Theatre until 25 August Photo Credit: Manuel Harlan Buy Tickets to Stranger Things: The First Shadow Reader Reviews To post a comment, you must register and login. @media (max-width: 767px) { .carousel { position: relative; padding-bottom: 0px; } } NEXT UP FOR YOU Deals from Chicago Buy Tickets from $83.00 Major Snowstorm Headed Toward NYC; Does Broadway Close Down Because of Snow? Mandy Patinkin Shares Advice for Jonathan Bailey Ahead of SUNDAY A Complete History of RAGTIME RENT Reunion Panel and More Set For BroadwayCon 2026 Jeremy Jordan Will Take Over as 'Bobby Darin' in JUST IN TIME Ben Crawford and More Complete the Cast of THE LOST BOYS on Broadway function trackArticleClick(abTestName, abTestVariant, sortMethod, articleId, articleTitle) { fetch('/for-you/track_click.cfm?type=article&abTestName=' + encodeURIComponent(abTestName) + '&abTestVariant=' + encodeURIComponent(abTestVariant) + '&sortMethod=' + encodeURIComponent(sortMethod) + '&articleId=' + encodeURIComponent(articleId) + '&articleTitle=Article', { method: 'GET' }) .then(response => response.text()) .then(data => console.log('✅ Click tracked:', data)) .catch(error => console.log('❌ Tracking failed:', error)); } Browse More BWW FOR YOU .signup-container { display: flex; flex-wrap: wrap; gap: 8px; align-items: center; } .signup-container input[type=\"text\"] { flex: 1; min-width: 200px; } .signup-container input[type=\"submit\"] { width: 100px; } @media (max-width: 600px) { .signup-container { flex-direction: column; align-items: stretch; } .signup-container input[type=\"submit\"] { width: 100%; } } Need more Broadway Theatre News in your life? .. RATE & REVIEW ON MY SHOWS .recommended-grid { display: grid; grid-template-columns: repeat(4, 1fr); gap: 20px; } @media (max-width: 768px) { .recommended-grid { grid-template-columns: repeat(2, 1fr); } } .recommended-item img { width: 100%; aspect-ratio: 1/1; object-fit: cover; border: none; padding: 0; margin: 0; display: block; } .recommended-item h3 { font-size: 1rem; text-align: center; margin: 8px 0 0; } .recommended-item a { text-decoration: none; color: inherit; display: block; } .recommended-item .rating { margin-top:6px; text-align:center; } .recommended-item .rating .rating-count { display:block; font-size:.75rem; color:#666; margin-top:2px; } 113 ratings Chess 5 users All Out: Comedy About Ambition 45 ratings Oedipus 209 ratings Hamilton Activate Your MY SHOWS Profile RELATED STORIES 1 Photos: Further Look at STRANGER THINGS: THE FIRST SHADOW as it Extends in London All new photos have been released from the West End production of Stranger Things: The First Shadow as it celebrates its second anniversary at the Phoenix Theatre. Check out the photos here! 2 Interview: 'It's Relentless': Actor Jack Christou on STRANGER THINGS: THE FIRST SHADOW After nearly a decade, the hit Netflix television series, Stranger Things, will be coming to a close with Season Five. But fear not, fans - there is still the stage version, Stranger Things: The First Shadow, running in the West End. The play is a prequel to the events on screen, showing some of the older characters in high school and exploring the origins of the show’s main villain, Vecna. Recently, we had the chance to speak with Jack Christou, who plays the role of Henry Creel. We discussed what it is like to be part of the stage adaptation of such a popular television series, how he prepared for the role and even what he hopes audiences take away from the show as a whole. 3 STRANGER THINGS in the West End to Host Cosplay Competition This Halloween, Stranger Things: The First Shadow will host a cosplay costume competition at Phoenix Theatre for both its matinee and evening performances on the 31 October. Learn more! 4 New Cast Set For STRANGER THINGS: THE FIRST SHADOW in London The full company has been announced who will join the critically acclaimed, Olivier Award-winning, world première production of Stranger Things: The First Shadow. From This Author - Alexander Cohen Review: LAST DAYS, Royal Ballet And OperaReview: END, National TheatreReview: BACCHAE, National TheatreReview: THE WEIR, Harold Pinter Theatre Browse More Local BWW FOR YOU #foxsocial { display: none; } @media screen and (max-width: 767px) { #foxsocial.show { display: flex; } } document.addEventListener('DOMContentLoaded', function () { const foxsocial = document.getElementById('foxsocial'); const topSocial = document.getElementById('top-social'); // Adjust to your actual element ID const threshold = topSocial.offsetTop + topSocial.offsetHeight; window.addEventListener('scroll', function () { if (window.scrollY > threshold) { foxsocial.classList.add('show'); } else { foxsocial.classList.remove('show'); } }); }); X Get Tickets Get Info Buy Tix Cast Photos Videos function closestickysocial() { document.getElementById(\"foxsocial\").style.display = \"none\"; } !function(f,b,e,v,n,t,s){if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)};if(!f._fbq)f._fbq=n; n.push=n;n.loaded=!0;n.version='2.0';n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0];s.parentNode.insertBefore(t,s)} (window,document,'script','https://connect.facebook.net/en_US/fbevents.js'); fbq('init','128124764529976'); function uuidv4(){ if (window.crypto && crypto.getRandomValues) { return 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g,c=>{ const r=crypto.getRandomValues(new Uint8Array(1))[0]&15, v=c==='x'?r:(r&0x3|0x8); return v.toString(16); }); } return 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g,c=>{ const r=Math.random()*16|0, v=c==='x'?r:(r&0x3|0x8); return v.toString(16); }); } const fbEventId = uuidv4(); const topicParams = { show_name: \"Stranger Things: The First Shadow\", region: \"Broadway\" }; fbq('track','PageView',{}, {eventID: fbEventId}); fbq('trackCustom','TheatreTopicView', topicParams, {eventID: fbEventId}); <img height=\"1\" width=\"1\" style=\"display:none\" src=\"https://www.facebook.com/tr?id=128124764529976&ev=PageView&noscript=1\"/> @media (max-width: 1024px) { .most-popular, .video-row { display: block;margin-top:25px; } } /* Hide the showboxmobile-side by default */ .showboxmobile-side { display: none; } /* Show .showboxmobile-side and ensure full-width on screens 1599px and below */ @media screen and (min-width: 768px) { .showboxmobile-side { display: block; width: 100%; margin-bottom: 0; table-layout: fixed; /* Ensure consistent column width */ } } .displayprice-side { display: inline; } @media screen and (max-width: 768px) { .displayprice-side { display: block; } } .responsive-logo-side { width: 100% !important; max-width: 100%; height: auto; padding: 0; border-width: 1px; border-style: solid; display: block; } .responsive-logo-side2 { display: none !important; } .desktop-text-side { display: block; } .mobile-text-side { display: none; } @media screen and (max-width: 768px) { .desktop-text-side { display: none; } .mobile-text-side { display: block; } } .showboxmobile-side table { width: 100%; table-layout: fixed; } .showboxmobile-side table td { width: 100%; box-sizing: border-box; padding: 0; margin: 0; text-align: left; } .showboxmobile-sidelogo img { display: none; } .showboxmobile-sidelogo img[src] { display: block; } Get Show Info Info Get Tickets Cast Photos Videos Powered by Videos BEETLEJUICE Cast Takes Final Bow at Broadway Sessions Marc Shaiman Is Telling Showbiz Stories in His New Book Watch Adrien Brody in Trailer for THE FEAR OF 13 View all Videos googletag.cmd.push(function() { googletag.display('div-gpt-ad-1442371043694-CountdownClock'); }); googletag.cmd.push(function(){googletag.display('div-gpt-ad-1442371043694-0');}); TICKET CENTRAL More Hot Shows Discounts Recommended For You Browse More BWW FOR YOU Get Broadway's #1 Theatre Newsletter Get the best news & discounts for Broadway Shows & beyond. Email: Sign-up googletag.cmd.push(function(){googletag.display('div-gpt-ad-1442371043694-3');});",
  "isFullReview": true,
  "bwwExcerpt": "It could have risked devolving into campy schmaltz but Kate Trefry, along with Jack Thorne, pen a standalone story that stands strongly on its own two feet. An adventure romp brimming with action and exploding with spectacle, expect a fare few winks to the fans along the way and a healthy dash of horror.",
  "showScoreExcerpt": "“The stage and the screen will never be substitutes but Stranger Things: The First Shadow never feels limited by the medium. It leans into the theatricality hammering the audience with slick illusions and visually stunning trickery applied impasto. No expense is spared but that is hardly surprising.”",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "bwwThumb": "Up",
  "bwwUrl": "https://www.broadwayworld.com/article/Review-STRANGER-THINGS-THE-FIRST-SHADOW-Phoenix-Theatre-20231215",
  "textStatus": "complete",
  "textWordCount": 1704,
  "archivePath": "data/archives/reviews/stranger-things-2024/broadwayworld--alexander-cohen_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:17:16.309Z"
}