{
  "showId": "stranger-things-2024",
  "outletId": "culturesauce-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://culturesauce.com/2025/04/22/stranger-things-the-first-shadow-netflix-broadway-review/",
  "publishDate": null,
  "fullText": "Louis McCartney in 'Stranger Things: The First Shadow' (Photo: Matthew Murphy and Evan Zimmerman) Netflix’s sci-fi series Stranger Things, which is expected to stream its fifth and (supposedly) final season later this year, has developed a rabid following since its 2016 debut for its savvy combination of horror and sci-fi tropes around a group of teenage heroes who feel like they could be non-animated versions of the Scooby-Doo gang one moment and potential victims in an ’80s summer-camp slasher film the next. Now the streamer is expanding the fictional world of Hawkins, Indiana, with a pricey but puzzling stage show, Stranger Things: The First Shadow, that fleshes out some of the backstory of its characters while providing a state-of-the-art visual experience that replicates the CG-heavy effects of its biggest small-screen hit. The opening, which includes a projected Netflix logo (complete with the familiar sonic ba-dum), establishes the tone with an effects-heavy sequence built around a 1940s warship that runs aground due to a mysterious creature first detected on sonar that then emerges as a ghastly malevolent force that brings smoke billowing out over the first rows of the theater and a hazmat-suited team combing the aisles of the Marquis Theatre. It’s a spectacular start — literally — and reflects the production’s seamless blend of elaborate sets (by Miriam Buether), costumes (by Brigitte Reiffenstuel), dramatic lighting (by Jon Clark), stereo-surround sound (by Paul Arditti), and video projections and visual effects (by Jamie Harrison, Chris Fisher and the studio 59). We soon settle into a meandering story that functions as a prequel to the ’80s-set series focused on the origin story of Henry Creel, a boy with supernatural powers who morphs into the show’s chief baddie and takes on a variety of names (One, Peter Ballard, Vecna) depending on where he is in his villain’s journey. Here, he’s a teenager in 1959 — finely embodied by the diminutive Louis McCartney in a role he originated in the show’s original London run — who struggles to control his telekinetic gifts as well as the anger issues springing from his feelings as an outsider both within his family and with other kids his age. Henry and his family (including parents played by Rosie Benton and T.R. Knight) have just moved to Hawkins after a scandalous incident involving Henry in their previous California home, and he quickly connects with another awkward, self-conscious loner at the town’s high school — Patty (Gabrielle Nevaeh), the adoptive daughter of the school principal (Andrew Hovelson) who yearns to meet her birth mom. The two are improbably cast in the school’s new musical, a production of the 1945 oddity Dark of the Moon about a witch-boy who falls for a human girl that’s the pet project of Joyce Maldonado (Alison Jaye) — the spunky woman who will grow up to be a fitfully employed single mom played by Winona Ryder. Fans will no doubt get a kick out of seeing a teenage Joyce as an ambitious theater kid who dreams of a drama scholarship to escape her hometown — especially since Jaye nails Ryder’s vocal inflections and pent-up energy — as well as seeing the younger versions of other familiar grown-ups from the show. Ex-husband Lonnie Byers (Logan Gould) is the school bully, while future boyfriend and Radio Shack manager Bob Newby (Juan Carlos) is the geeky DJ for the local radio station who pines for Joyce from afar (not unlike the middle-aged version played by Sean Astin). And of course, the jockish police chief’s son James Hopper Jr. (Burke Swanson) bristles at his dad’s domineering ways but finds himself leading the investigation into the strange goings-on around town, especially the torture and mutilation of the town’s pets. (It’s no wonder that the character, later played by David Harbour, would follow in his dad’s bootsteps and become a cop himself.) Matthew Modine’s Dr. Brenner also makes an appearance late in the show, played by Alex Breaux with a malevolent flourish that underscores that he was never a good guy gone bad but rotten from the jump. There are at least a dozen other named characters, and as a result the plot can get convoluted when it bothers to make any sense at all. The script, by Katie Trefry based on a story by Trefry, Jack Throne, and show creators Matt and Ross Duffer, must thread a very tiny and delicate needle within the Stranger Things universe. It must fit into the larger world the Duffer Brothers have created, stand on its own as a compelling story, but also not be so essential to the overall arc given that the audience for even a hit Broadway show is limited compared to the series’ global streaming audience. As it happens, the disconnect with the show may be the biggest pitfall. We never spend enough time with any of the characters to care about what happens to them in the illusion-boosted battle sequence that seems to end every scene — a real departure from the series, which fleshes out its distinct band of warriors. The play also raises some unanswered questions about the internal logic of the Stranger Things universe: If Joyce and Hopper, et al, were intimately involved in Henry’s origins from their high school days, why do they seem so clueless about these momentous events in the series? In what world would a 1950s high schooler, let alone one that we come to know as a reticent woman like Joyce, eschew Oklahoma for Dark of the Moon — and what became of all that artistic talent and gumption? More troublingly, the story frequently falls into a series of “and then, and then” scenes that sap our interest in following the narrative thread. The plot, with all its echoes of the TV series, either defies logic or seems needlessly redundant. What The Last Shadow lacks in effective storytelling it compensates for with fan service and mesmerizing stagecraft — the levitation of characters, the appearance of an evil demogorgon, the snapping of limbs and splattering of blood, the images of an alternate reality that according to show lore is not yet dubbed the Upside Down. The action set-pieces, staged with visual flair (and sometimes flares) and a cinematic sense of pacing by director Stephen Daldry and co-director Justin Martin, are truly incredible. They’re also surprisingly graphic (don’t let the stuffed demogorgon or dismember-able cat at the merch stand fool you into thinking this is a show for kids). Netflix clearly spent a fortune on the production, and audiences can see that investment in just about every scene — especially if you’re able to snag seats in the center sections, or not too close to the sides where some views may be obstructed. ★★★☆☆ STRANGER THINGS: THE FIRST SHADOWMarquis Theatre, BroadwayRunning time: 2 hours, 45 minutes (with 1 intermission)Tickets on sale through November 16 for $60 to $301 ‘Safety Not Guaranteed’ delivers low frills, no thrills (Off Broadway review)October 3, 2024In \"Theater\" Off Broadway review: Ngozi Anyanwu’s ‘The Last of the Love Letters’September 14, 2021In \"Theater\" Critic’s picks: The best of Broadway and Off Broadway right nowJanuary 11, 2026In \"Theater\" Δ /* <![CDATA[ */ document.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() ); /* ]]> */",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1202,
  "archivePath": "data/archives/reviews/stranger-things-2024/culturesauce-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:37:10.428Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}