{
  "showId": "stranger-things-2024",
  "outletId": "EW",
  "outlet": "Entertainment Weekly",
  "criticName": "Emlyn Travis",
  "url": "https://ew.com/stranger-things-first-shadow-broadway-review/",
  "publishDate": "2025-04-22",
  "fullText": "​ Page Not Found This is not the page you are looking for. We hope you can go about your business by using our menu or search option. By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Accept All Cookies",
  "isFullReview": false,
  "bwwExcerpt": "he curious to make it last and pay off? Only time will tell, just as only time will determine its chances to attract a whole new generation to the joys of live theater. Stranger things have happened. Emlyn Travis, Entertainment Weekly: Immersive, heartfelt, and exhilarating, First Shadow is a must-see spectacle for the Stranger Things obsessive as much as it is for the theater aficionado who wants to see the medium pushed to new heights. Dan Rubins, Slant Magazine: Viewers of the series know that Henry will eventually become the demonic Vecna, ruler of the Upside Down and the monsters within, and how this backstory plays out since The First Shadow is ultimately an evening-long adaptation of a flashback sequence from season four. Most of the plot twists will be retrodden territory for Netflix viewers, and as such, when it comes to the story, the play’s fan service lies mostly in the recreation of iconic images from the series and in the supporting cast laying Easter eggs. Robert Hofler,",
  "originalScore": null,
  "assignedScore": 85,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-STRANGER-THINGS-THE-FIRST-SHADOW-Opens-On-Broadway-20241120",
  "textStatus": "partial",
  "textWordCount": 59,
  "archivePath": "data/archives/reviews/stranger-things-2024/ew--emlyn-travis_2026-01-25.html",
  "textFetchedAt": "2026-01-25T05:14:16.529Z",
  "textIssues": [
    "Word count too low: 59 (min: 300)",
    "Show title not found in text"
  ],
  "textQuality": "excerpt",
  "sourceMethod": "bww-roundup"
}
