{
  "showId": "stranger-things-2024",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=IQL7U1",
  "publishDate": null,
  "fullText": "Louis McCartney, Gabrielle Nevaeh. Photo: Matthew Murphy and Evan Zimmerma. For fans of the streaming series Stranger Things (I am one): The new attraction at the Marquis is a fascinating milestone in the ongoing saga, focusing on Henry Creel, who, we learned in season four, is the hidden link between the weird experiments at Hawkins Lab and the Upside Down, the hellscape populated by demodogs, Vecna, and The Mind Flayer. For those who haven't seen Stranger Things: Why are you still reading this? Talk about fan service: Broadway has previously seen brand extension efforts, both dire (Spider-Man: Turn off the Dark) and delightful (Harry Potter and the Cursed Child). Stranger Things: The First Shadow is something else: a roughly $40-million trailer for the series' fifth season, packed with information that will need to be repeated for the millions of viewers who won't be making their way to Broadway. It's a gigantic scream-in-the-dark ride designed to juice up fan interest, a deeply unnecessary piece of stage hokum that will likely amuse the hardcore crowd, leaving everyone else feeling like victims of The Mind Flayer. The producers have asserted that it is a stand-alone work that is understandable even for first-timers. In fact, for them, it would be tantamount to walking into a film halfway through its running time. For the record: Stranger Things: The First Shadow features the adolescents Joyce Maldonado, Jim Hopper, and Bob Newby, who grow up to be played by Wynona Ryder, David Harbour, and Sean Astin. The central character is Henry Creel, also known as Friendly Orderly and One, who, we learn in season four, is the linchpin linking the series' two narrative lines. Henry is first seen moving into a new home in Hawkins, Indiana, with his parents and sister. A mass of nervous tics, toting a radio that picks up private conversations, and prone to causing electrical disturbances when upset, Henry could be the younger brother of Stephen King's Carrie. Soon, animals turn up dead, their limbs shattered and their eyes gouged out. Of course, the up-to-date Stranger Things viewer knows Henry's mother and sister will meet the same fate, with his father, Victor, taking the fall for murders he didn't commit. But I digress. The socially awkward Henry bonds, tentatively, with Patty, Bob's adopted (or is she) biracial sister, who has problems of her own, beginning with their cruelly controlling father, the high school principal. Henry even gets cast in the school play (in a suitably sinister role), but, as his destructive tendencies become more pronounced, he falls under the influence of Dr. Martin Brenner, the government scientist who wants to refashion the boy into a lethal weapon against America's enemies. The biggest revelation of Stranger Things: The First Shadow is that the whole convoluted narrative begins with a failed World War II science experiment designed to make battleships invisible. I didn't see that coming. The opening sequence, complete with shipwreck, is as arresting a display of stagecraft as any I've seen. Billed as the last work in stage spectacle, the production is notable more for the breadth of its technology than its innovation. Most of the imagery supplied by the design firm 59 seems to come from projectors rather than video screens, and the scariest scenes are underlined by Paul Arditti's seemingly bottomless fund of rumbles, growls, and screams. In Miriam Buether's scenic design, the action unfolds in a high school gym, with various wagons rolling onstage to suggest a church, a soda shop, a liquor store, and other locations. The show is packed with illusions (by Jamie Harrison and Chris Fisher), but nothing we haven't seen before -- people floating, instant onstage costume changes, and puppetry. (There is a significant use of doubles to create certain effects.) Many touches are genuinely amazing: When The Mind Flayer, the head monster from the Upside Down, appears, it is via a scenic coup that makes The Phantom of the Opera's chandelier look like a desk lamp. The turntable on Buether's set gets a workout in an early sequence, disgorging so many characters and backstories that even the initiated may struggle to keep up. It's an enormous exposition dump highlighting the production's biggest problem: The series' likable characters and offhand sense of humor are largely missing here, replaced by a relentless series of mechanical shocks and self-conscious special effects. On the screen, even when the plot jumps the rails (a Soviet mining operation installed under an Indiana mall, Joyce's wild rescue of Hopper from a Russian prison), one goes along for the fun of it, keeping a rooting interest in Hopper and Joyce's halting romance and the teen triangle of Jonathan, Nancy, and Steve (none of whom are featured here). One especially misses El, the series' central figure, who makes only a cameo appearance in the final scene. The plot-heavy script by Kate Trefry (one of the series' regular writers), based on a scenario by The Duffer Brothers (the brains behind Stranger Things) and Jack Thorne, is a Jacobean demolition derby: Scenes of mutilation and murder are greeted by the audience not with shock or horror but applause for the ingenuity of the bloodshed. Underlining the impact of these Grand Guignol antics are some mighty unlikely plot devices. The wildest involves Joyce's plan to secretly stage a school production of the witchcraft drama Dark of the Moon, unveiling it on opening night to an audience expecting Oklahoma!. (Where does the money come from? Is there no faculty advisor?) Others include a meltdown suffered by Henry in front of his classmates that strangely provokes no reaction from the onlookers and a raid by Bob, Patty, Joyce, and Hopper in a hospital room where one of Henry's victims is hidden away, protected by government security guards. Overall, the costumes by Brigitte Reiffenstuel are too colorful and musical comedy in their style. Regarding Joyce's play, the designer hasn't done her homework -- the characters in Dark of the Moon are Appalachian, not Pilgrims -- and she gives into cheap gags, for example dressing one of the actresses like one of Gypsy's strippers. Stephen Daldry and his co-director Justin Martin pile on the bravura effects, never letting the audience stop to catch its breath. Their technical command is impressive, and certain sequences, including one unfolding on a collapsing theatre catwalk, are especially memorable. The cast members race through their assignments like athletes, keeping straight faces no matter the circumstances. Making his Broadway debut, the Irish actor Louis McCartney makes Henry an equally menacing and pitiable creature, terrified by his growing monstrousness. Equally striking is Gabrielle Nevaeh as Patty, a gritty survivor bent on hunting down the mother who seemingly abandoned her. As Joyce, Alison Jaye does a convincing impersonation of Ryder as a teenager. Burke Swanson and Juan Carlos are solid as Hopper and Bob; it's not their fault that the adult versions of their characters are much more interesting. The cast includes welcome veterans like Rosie Benton and T. R. Knight as Louis' tormented, repressed parents. Alex Breaux lends his sleek, greyhound profile and eerie imperturbability to Brenner, offering a plausible sketch of the soft-voiced, duplicitous manipulator played onscreen by Matthew Modine. A massive, expensive piece of foolishness that doesn't quite capture the charm of its bonkers, inventive source material, Stranger Things: The First Shadow is practically guaranteed to fill seats with the series' faithful and tourists looking for thrills. It's a self-selecting audience, likely to be satisfied by what they find, never mind its shortcomings as drama. Still, I have a question: Although the script tries to insulate Hopper and Joyce from too many revelations about Henry's true nature, after four seasons of battling monsters from the Upside Down, how is it that, in their rare idle moments, they haven't recalled the bizarre doings of their youth? I can't wait to see how the writers explain that one. Bring on season five! --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1332,
  "archivePath": "data/archives/reviews/stranger-things-2024/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:42:19.452Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}