{
  "showId": "stranger-things-2024",
  "outletId": "newyorktheater-me",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://newyorktheater.me/2025/04/26/stranger-things-the-first-shadow-broadway-review-horror-season-4-ep-7-on-stage/",
  "publishDate": null,
  "fullText": "In the lobby gift shop of the Marquis, where Netflix’s Broadway version of “Stranger Things” has opened, there is a Demogorgon plushie for sale for thirty dollars. It’s not called a Demogorgon; the price list just says “Plush.” But if you know, you know. “The First Shadow” might as well be StrangerCon. Netflix claims it is a “standalone adventure.” This is simply not true, especially if they mean that theatergoers need not be familiar with the streaming platform’s popular sci-fi horror series. “Stranger Things: The First Shadow” is strictly for fans of “Stranger Things,” presenting both a prequel and an origin story that feature several characters from the series. Most baldly, the show serves as a teaser for the forthcoming fifth and final season. Those who don’t know the series get…smoke and mirrors. Admittedly, they’re spectacular smoke and mirrors, state-of-the-art, high-tech, costly, intense — smoke volcanically erupting from the ground or gruesomely pouring out of bodies; mirrors suddenly cracking or shattering…many “whoaaa” special effects accompanied by shrieks, crackles and booms loud enough to feel in your seat: explosive fires, fusillades of electric sparks, an entire World War II battleship teetering on its side electrocuted before our eyes, a monster that bursts into three dimensions and hovers over the stage, people slammed against walls and levitated up through the ceiling. As for making sense of it all: The best the novice can hope for is that the cacophony, convolution and confusion on stage will finally prod him to join the addicted screen-watching horde to figure out the point of it all. Truthfully, Stranger viewers are not immune to the confusion: That battleship, which is destroyed in a cold open, is not explained until hours later. But at least fans have a head start, having already seen the main plot of The First Shadow: It was presented, in greatly abbreviated form but with some of the exact same dialogue, in episode 7 of Season 4. (which is another way this show is not a “standalone.”) The First Shadow tells the backstory of Henry Creel, who is memorably portrayed by Louis McCartney, persuasively essence-of-nerd, albeit scented with creepy, who is even somewhat sympathetic as he’s tortured into becoming the monster known as Vecna. Henry arrives with his family in Hawkins, Indiana in 1959, having fled Nevada after his uncontrollably encroaching dark powers made him kill pets and mutilate humans. He winds up doing the same in Hawkins, with lots of abrupt physical contortions and nose bleeding; he’s Vecna after all. But first, he attends Hawkins High School, where he meets classmates Joyce Maldonado (Alison Jaye), James Hopper Jr. (Burke Swanson), Bob Newby (normally Juan Carlos, but Patrick Scott McDermott on the night attended.) There is a new character, Bob’s sister, Patty Newby (Gabrielle Nevaeh.) Patty is adopted, and is treated with contempt by her adoptive father, who is the principal of the school (Andrew Hovelson.) The two outcasts, Henry and Patty, are drawn to one another, hints of tenderness that attempt to engage us in their fates. “You’re definitely not the Devil,” Patty reassures him. “You’re just a weirdo.” Most of the cast – there are a whopping 34 in all – represent a bestiary of high school clique caricatures that we’ve seen many times before. But the five principal teenagers have something approaching individual personalities, or at least serve a function: Bob is DJ of the school radio station, helpfully supply a running narrative (how many pets killed so far), which supplement the many video projections of newspaper headlines, from the Hawkins Post and the Indianapolis Gazette. Joyce turns out to be a theater nerd, who is directing the school play. She has decided that, instead of doing “Oklahoma!” yet again, she was going to sneak in a play called “Dark of the Moon,” which is about a witch boy who seeks to become human after falling in love with a human girl. It’s a clever touch. “Dark of the Moon” was an actual play on Broadway in 1945; the choice, I suspect, is not just because of the parallel to the story of Henry and Patty, but as something of a secret signal. Kate Trefry, who is credited as the writer of “The First Shadow,” has no previous background in the theater; she is a staff writer and producer for the series. But both directors are Broadway veterans, Stephen Daldry a three-time Tony winner, and Sonia Friedman, who is co-producing the show with Netflix, has 13 Tonys – and has produced five other plays and musicals on Broadway this season alone. These people know theater. The scenes about putting on a play reflect this knowingness, but they are also played for comic relief – relief from what is otherwise a fairly relentless bombardment of horror. The TV series has far more humor, and pays far more attention to the characters and their relationships — which is also at the core of much good theater.. Since the core of The First Shadow is more hollow, I toyed with the notion that, behind the scenes of the depicted epic battle between good and evil, there was another epic battle between the screen and stage folk for the soul of the show. And the signals they were sending out were distress signals – not so much SOS, as Don’t Blame Us. How else to explain the exchange when Hopper tells Joyce he wants to join the play. Joyce is suspicious — for good reason, since he has ulterior motives; he thinks this is the way he can find the pet-killer. “Name one play,” Joyce challenges him.“Godzilla”“That’s a movie”“Well,” he replies, “it should be a play.” Stranger Things: The First ShadowMarquis TheaterRunning time: Two hours and 45 minutes, including one intermissionTickets: $100 – $300. Rush: $40. Digital lottery: $45Written by Kate Trefry; Original story by The Duffer Brothers, Jack Thorne and Kate Trefry; Based on the Series by Netflix; Based on the Netflix Series, ‘Stranger Things’, created by The Duffer Brothers; Original music by D.J. Walde; Music orchestrated by D.J. Walde; Music arranged by D.J. WaldeDirected by Stephen Daldry; Co-Directed by Justin Martin; Choreographed by Lynne Page.Scenic Design by Miriam Buether, Costume Design by Brigitte Reiffenstuel, Lighting Design by Jon Clark; Sound Design by Paul Arditti, Video Design & Visual Effects by 59; Hair and Wig Design and make-up design by Campbell Young Associates; Video Designer for 59: Benjamin Pearcy and Leo Warner. llusions & Visual Effects Design by Jamie Harrison and Chris FisherCast: Louis McCartney as Henry Creel,Gabrielle Nevaeh as Patty Newby, Alison Jaye as Joyce Maldonado, Burke Swanson as James Hopper, Jr, Juan Carlos as Bob Newby, Rosie Benton as Virginia Creel, Alex Breaux as Dr. Brenner, Janie Brookshire, Kelsey Anne Brown, Malcolm Callender, Ta’Rea Campbell as Patty’s Mom, Antoinette Comer, Robert T. Cunningham as Charles Sinclair, Ayana Cymone as Sue Anderson, Tom D’Agustino, Victor de Paula Rocha, Ian Dolley as Walter Henderson, Dora Dolphin as Karen Childress, Nya Garner, Logan Gould asLonnie Byers, Shea Grant as Claudia Yount, Andrew Hovelson as Principal Newby, Rebecca Hurd, Alison Jaye as Joyce Maldonado, T. R. Knight as Victor Creel, Ted Koch as Chief Hopper and Captain Brenner, Poppy Lovell as Alice Creel Alternate, Jamie Martin Mann, as Ted Wheeler, Patrick Scott McDermott, Sean Mikesh, Stephen Wattrus, Maya West, Eric Wiegand as Alan Munson, Graham Winton, Azalea Wolfe as Alice CreelAlternateUnderstudies: Janie Brookshire (Virginia Creel), Kelsey Anne Brown (Joyce Maldonado, Claudia Yount, Karen Childress), Malcolm Callender (Charles Sinclair), Antoinette Comer (Patty’s Mom), Ayana Cymone (Patty Newby), Tom D’Agustino (Lonnie Byers, Alan Munson, Ted Wheeler), Victor de Paula Rocha (Henry Creel, Walter Henderson), Ian Dolley (Henry Creel), Nya Garner (Patty Newby, Sue Anderson), Logan Gould (James Hopper, Jr., Dr. Brenner), Shea Grant (Joyce Maldonado), Rebecca Hurd (Virginia Creel, Claudia Yount, Karen Childress), Jamie Martin Mann (James Hopper, Jr., Lonnie Byers), Patrick Scott McDermott (Bob Newby, Walter Henderson, Alan Munson, Ted Wheeler), Sean Mikesh (Charles Sinclair), Stephen Wattrus (Dr. Brenner, Principal Newby, Victor Creel, Chief Hopper, Captain Brenner), Maya West (Patty’s Mom, Sue Anderson), Eric Wiegand (Bob Newby, Walter Henderson) and Graham Winton (Principal Newby, Victor Creel, Chief Hopper, Captain Brenner) Photographs by Matthew Murphy and Evan Zimmerman 2025 Outer Critics Circle Awards: Maybe Happy Ending, John ProctorMay 12, 2025In \"Awards\" Outer Critics Circle Award 2025 NominationsApril 25, 2025In \"Awards\" Broadway Week 2-for-1 Tickets On Sale NowAugust 19, 2025In \"Broadway\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1392,
  "archivePath": "data/archives/reviews/stranger-things-2024/newyorktheater-me--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:42:25.787Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}