{
  "showId": "stranger-things-2024",
  "outletId": "pagesonstages-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.com/2025/05/07/stranger-things/",
  "publishDate": null,
  "fullText": "Stranger Things: The First Shadow – 06 May 2025 A high intensity ride through the life of possibly possessed Henry Creel (Louis McCartney), Stranger Things tells a story taking place in multiple dimensions – the face value, awkward high school level in which the audience roots for Henry and gets to laugh at comedic stereotypes about teenagers; the family where the audience pities Henry and feels a twinge of pain when his parents mistreat him; the sinister, but still palatable level in which Henry is using his powers, sometimes in attempts to help, others that result in him murdering and mutilating animals; and the full and unbridled insanity of Henry’s capacity to do harm, taking place in another dimension in the literal sense. Act two adds a political dimension – the level in which the US government finds a “doctor” to harness Henry’s power for future weaponization. Utterly unique in dramatic structure, Stranger Things encapsulates a full spectrum of types of stories told on stage: funny, stupid, frightening, unsettling, emotional, affectionate, quirky, sarcastic, disturbing, intentional, purposeful, entertaining, and horrifying. It gave me chills, but also laughs, and is perfectly balanced so that the audience never remains disturbed for so long that they begin to feel genuine fear and desire to leave. The lighter scenes calm the autonomic nervous system, lulling us into a false sense of security that keeps the adventure alive. I’ve never seen the television show, so I can’t speak to whether or not this is consistent. The show’s most outstanding features are its scenic (Miriam Buether), illusions (Jamie Harrison, Chris Fisher), sound (Paul Arditti), and original music (D.J. Walde). These design elements shone in their ability to trap the audience in moments (both good and bad) and transition the audience in and out of safety. These design elements fully maximize the potential of the Marquis Theatre as a space located on the third floor of a hotel with possibilities for large trap doors and unparalleled fly space. This theater was the perfect place to fully realize a production like this, and the design team took full advantage of the possibilities. The ensemble cast was equally committed to their respective roles in this intensely collaborative effort. Stranger Things surprised me in that it worked effectively as a piece of theatre and had structural integrity that did not require knowledge of the television show to be understood. Its seamless crossing of genres felt theatrical in every moment, and it utilizes the best stereotypical theatre devices in innovative ways. Despite some disturbing moments and concepts, I really enjoyed the show and highly recommend Stranger Things: The First Shadow. I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 448,
  "archivePath": "data/archives/reviews/stranger-things-2024/pagesonstages-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:44:45.828Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}