{
  "showId": "stranger-things-2024",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Kobi Kassal",
  "url": "https://www.theatrely.com/post/stranger-things-the-first-shadow-is-a-triumph-on-broadway-review",
  "publishDate": "April 22, 2025",
  "fullText": "Stranger Things: The First Shadow is a truly breathtaking spectacle that successfully brings Netflix's beloved series to Broadway. The production follows young Henry Creel's arrival in Hawkins, Indiana, weaving together storylines about high school musicals, romance, amateur detectives, and a mysterious monster.\n\nDirector Stephen Daldry (known for Billy Elliott and The Crown) collaborated with the Duffer Brothers to adapt the material, with writer Kate Trefry developing the book. Louis McCartney's Broadway debut performance as Henry Creel is perhaps the best singular performance of the season for his frenetic energy.\n\nThe 34-member cast, many making their Broadway debuts, delivers fresh interpretations of fan-favorite characters. Enough can't be said that this production doesn't just change the game of Broadway, it smashes the game board and shoots it into a new dimension. When you take one of the most watched television shows in history and bring it to the stage, the pressure is high but Netflix and producer Sonia Friedman cracked the code thanks to the work of hundreds of artisans and crew—a nod should be given to Jamie Harrison and Chris Fisher for their work on illusions and visual effects.\n\nStranger Things: The First Shadow may just be the best production, visually speaking, to ever hit Broadway—well in this universe, anyway. The show runs nearly three hours and is a high-octane rollercoaster that successfully translates the series' appeal to live theater. Horror productions often struggle on stage, but this adaptation feels like the first truly successful production in this category.\n\nStranger Things: The First Shadow is at the Marquis Theatre on West 46th Street in New York City.",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": null,
  "source": "webfetch-scraped",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-24T00:00:00.000Z"
}
