{
  "showId": "the-25th-annual-putnam-county-spelling-bee-2005",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/the-25th-annual-putnam-county-spelling-bee-off-broadway-review",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/the-25th-annual-putnam-county-spelling-bee-off-broadway-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Read our review of The 25th Annual Putnam County Spelling Bee off Broadway, a 20th-anniversary production of the award-winning musical at New World Stages. Listen up for the word “syzygy” in The 25th Annual Putnam County Spelling Bee. It’s defined as an out-of-this-world alignment. Off Broadway at New World Stages, all the elements have stacked up splendidly in a revival of the show that arrives 20 years after the Broadway premiere and captures every drop of the original charm. The endearing misfit characters, upbeat and thoughtful songs, and consistently laugh-out-loud humor add up to pure joy. Written by William Finn (music and lyrics) and Rachel Sheinkin (book), the show follows six quirky middle schoolers competing in a local spelling bee, supervised by adults with issues of their own. Director/choreographer Danny Mefford’s production seen last year at the Kennedy Center lands in NYC with shrewd, venue-specific zingers (“Have you ever been in a gymnasium next to a production of Heathers before?”) and updates for today (one speller “is president of the pronoun club”). Punchy jokes surface when contestants step up to the mic and when the spelling words are used in sentences. There are six main student competitors: athletic Chip Tolentino (Philippe Arroyo), politically aware Logainne Schwartzandgrubenierre (Autumn Best), home-schooled Leaf Coneybear (Kimberly Akimbo Tony nominee Justin Cooley), allergy-prone William Barfée (Glee’s Kevin McHale), overachieving Marcy Park (Leana Rae Concepcion), and shy Olive Ostrovsky (BOOP! Tony nominee Jasmine Amy Rogers). Adults on the scene include bee host Rona Lisa Peretti (Lilli Cooper), word pronouncer Douglas Panch (Jason Kravits), and comfort counselor Mitch Mahoney (Matt Manuel). They’re a reminder that idiosyncrasies make us human, and they can last a lifetime. But each character, flaws and all, is more than just a solitary trait. That's thanks in large part to insightful, character-driven songs that explore family expectations, awkward crushes, outsider status, perils of puberty, and the pressures of competition. And the entire ensemble shines, squeezing every last drop out of each moment. Leaf confronting his insecurities in “I’m Not That Smart” and Olive imagining the words she wishes to hear from her parents in “The I Love You Song” are standout musical moments. For wonderful weirdness, “Magic Foot” is tops. William belts it to demonstrate his bee technique with the word “lugubrious,” tracing letters on the ground and, finally, dotting an “I” with his toe. It’s an eloquent gesture in a show that’s as big-hearted as it is fleet-footed. The 25th Annual Putnam County Spelling Bee is a musical comedy that celebrates imperfection and individuality as it follows six middle schoolers competing in a local spelling bee. Songs by William Finn, who died in April, reveal the spellers' personal insecurities, desires, and what makes them tic, and tick. Previously seen off and then on Broadway in 2005, the musical is based on C-R-E-P-U-S-C-U-L-E, a play by The Farm. The show takes place in a garden-variety school gym neatly rendered by scenic designer Teresa L. Williams. On a bleacher are 10 chairs set up for bee contestants. Four of those chairs are filled by audience members who can volunteer to get in on the act. The interactive device really works: When a show is this fun, you want to share it. As of writing, Spelling Bee had earned an impressive near-perfect 96% audience approval rating on the online review aggregator Show-Score. Read more audience reviews of The 25th Annual Putnam County Spelling Bee on Show-Score. Big on feels and fun, The 25th Annual Putnam County Spelling Bee is 105 minutes without an intermission, and the time flies by. Learn more and get The 25th Annual Putnam County Spelling Bee tickets on New York Theatre Guide. The 25th Annual Putnam County Spelling Bee is at New World Stages through April 12. *Photo credit: The 25th Annual Putnam County Spelling Bee off Broadway. (Photos by Joan Marcus) The 25th Annual Putnam County Spelling Bee is a beloved musical about student competitors spelling their way to the top...and dealing with comedic adolescent issues along the way. The running time of The 25th Annual Putnam County Spelling Bee is 1hr 45min. The 25th Annual Putnam County Spelling Bee is playing at New World Stages. The theatre is located at 340 West 50th Street, New York, 10019. Tickets for The 25th Annual Putnam County Spelling Bee start at $64. The recommended age for The 25th Annual Putnam County Spelling Bee is Ages 13+. Children under 4 years old will not be admitted.. Book tickets for The 25th Annual Putnam County Spelling Bee on New York Theatre Guide. Originally published on Nov 17, 202520:00",
  "isFullReview": true,
  "textWordCount": 764,
  "archivePath": "data/archives/reviews/the-25th-annual-putnam-county-spelling-bee-2005/nytg--joe-dziemianowicz_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:16:16.982Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 764,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-05T04:06:46.506Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about an off-Broadway production at New World Stages, not the current Broadway run.; kimi: This review covers an off-Broadway production at New World Stages, not the current Broadway run.",
  "promptVersion": "5.2.0"
}
