{
  "showId": "elf-2024",
  "outletId": "san-jose-mercury-news",
  "outlet": "San Jose Mercury News",
  "criticName": "Unknown",
  "url": "http://www.mercurynews.com/entertainment/ci_27131213/review-broadway-musical-elf-decks-hall-time-christmas",
  "playbillVerdictUrl": "http://www.mercurynews.com/entertainment/ci_27131213/review-broadway-musical-elf-decks-hall-time-christmas",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "A jolly old “Elf” shimmied down the chimney at San Francisco’s Curran Theatre Friday night.\n\nA comic-book style musical version of the 2003 Will Ferrell movie, “Elf” has its heart in the right place but at the risk of sounding like the Grinch, it’s still pretty ho-ho-hum. The first act sags, the songs lack pizazz and the one-joke plot wears thin long before the Christmas miracle happens.\n\nStill if you’re hankering for some candy-cane coated fare and “Nutcracker” and “A Christmas Carol” don’t hit your sweet spot, you can hop aboard Buddy’s sleigh through Dec. 28.\n\nBuddy (a nicely goofy Eric Williams), is a huge man who was adopted by Santa (Ken Clement) as a baby. He thought himself an elf until Old St. Nick, who uses an iPad and frets about global warming, let it slip that his real father is a power broker publishing executive (Jesse Sharp) who lives in New York and spends a lot of time in the naughty column.\n\nIt should have tipped Buddy off that he’s not a miniature toy-making fiend like the rest of the elves (who do some very impressive high kicks on their knees), but, alas, he’s not the sharpest icicle in the drawer.\n\nOff the Buddster goes to save papa and the rest of Manhattan. Along the way he gets a gig at Macy’s, where jaded seasonal temp workers are magically transformed into people more worthy of Buddy’s gifts.\n\nQuick as a wink, he also with bonds his neglected little brother Michael (played alternately by Tyler Altomari and Harper S. Brady), and gets Jovie (Maggie Anderson) the glum girl he fancies, to turn her frown up side down.\n\nWriters Bob Martin (“The Drowsy Chaperone”) and Thomas Meehan (“Annie”) lay on the sugary sentiment a tad thick. The romance could use a little more chemistry but the nicely-cloaked sex jokes are a hoot. There’s also a fun put-down of Los Angeles regarding its abject lack of niceness.\n\n“I’ve never heard of it,” says the wide-eyed Buddy of the City of Angels. “I don’t think Santa goes there.”\n\nIf the show spends a little too much time amid Buddy’s dad publishing house, the gags about the lack of creativity in the world today ring true.\n\nCertainly the songs (score by Matthew Sklar and Chad Beguelin) are festive enough if not exactly sparkling. “Sparklejollytwinklejingley” and “Nobody Cares About Santa” are perhaps the best of the Yuletide bunch.\n\nWilliams is the real gem in this stocking stuffer; his unstoppable ditziness powers this gentle comedy. He may not have Ferrell’s sardonic charm but he works overtime to try and fill the character’s pointy shoes. Anderson also shines as the grumpy recent New York transplant. There aren’t many sparks between Williams and Anderson them but perhaps that’s just as well in a family-friendly affair.\n\nThe bottom line is that you really have to be in a deck-the-halls mood to savor this holiday concoction. But if you are, then Rudolf and Frosty better watch out, because “Elf” is the new kid in town.\n\nContact Karen D’Souza at 408-271-3772. Read her at www.mercurynews.com/karen-dsouza, and follow her at Twitter.com/karendsouza4.\n\nBy Matthew Sklar, Chad Beguelin, Bob Martin and Thomas Meehan; adapted from the movie “Elf”\n\nThrough: Dec. 28Where: Curran Theatre, 445 Geary St., San FranciscoRunning time: 2 hours 30 minutes, one intermissionTickets: $45-$160, 888-p746-1799. www.shnsf.com.",
  "isFullReview": true,
  "textWordCount": 555,
  "archivePath": "data/archives/reviews/elf-2024/san-jose-mercury-news--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:40:34.729Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 555,
  "tierReason": "Full review text"
}