{
  "showId": "gore-vidals-the-best-man-2012",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/gore-vidals-best-man-theater-review-394449/",
  "publishDate": "December 10, 2012",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "The revival of Gore Vidal's 1960 political drama proves that good writing and solid performances can make even familiar material feel fresh and relevant.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The revival of Gore Vidal's 1960 political drama proves that good writing and solid performances can make even familiar material feel fresh and relevant.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 429,
  "archivePath": "data/archives/reviews/gore-vidals-the-best-man-2012/hollywood-reporter--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:53:51.455Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "FX remains committed to late night offerings BrandX and Totally Biased with W. Kamau Bell.\n\nIn its bid to expand its footprint in the evening’s later and potentially lucrative hours, the network has granted both series 13 additional episodes, with Russell Brand‘s BrandX expanded from a half hour to an hour. The latter is a tweak to the fledgling format that critics including The Hollywood Reporter’s Tim Goodman had recommended, with his initial review stating: “FX’s foray into late night is a great idea, and Brand’s lightening-quick take on issues of the day is both funny and, yes, insightful. If only the show were an hour.”\n\nTV Review: Russell Brand Brings Manic Genius to FX’s ‘Brand X‘\n\nAs part of the move, BrandX will round out its 2012 run with a one-hour special on Nov. 29, featuring comedian Sarah Silverman and author and new age philosopher Daniel Pinchbeck. When the series returns on Feb. 7 at 11:30 p.m., the show will expand to a full-hour format. For its part, the final 2012 installment of Totally Biased will air Nov. 29 with The Daily Show’s John Oliver as Bell’s guest. The 11 p.m. series, which is more focused on dissecting politics, race, religion and pop culture, will return for its new cycle on Jan. 17.\n\nSTORY: FX’s W. Kamu Bell, Russell Brand and Chris Rock on Sarah Palin, Chick Fil-A, Charlie Sheen and Louis C.K.\n\n“We’re proud to have two of the most strikingly original and funny voices in late night as part of the FX comedy lineup,” said FX’s EVP of Original Programming Nick Grad. “Russell’s irrepressible energy and unique style have made BrandX a daring show where anything can happen. Kamau is one of the sharpest, smartest and funniest comedians in the business. The New York Times called him ‘the most promising talent in political comedy in many years,’ and we couldn’t agree more.”\n\nBoth entries are produced in-house at the rapidly expanding FX Productions. BrandX is done in association with Branded Films and Dakota Films, with Brand, Troy Miller, Nik Linnen and John Noel on board as executive producers. Totally Biased includes Chris Rock, Chuck Sklar and Keri Smith Esguia as EPs.\n\nEmail: Lacey.Rose@THR.com; Twitter: @LaceyVRose\n\nFocusing on entertainment news as it pertains to the comic book, horror and video game realms.\n\nBy providing your information, you agree to our\n Terms of Service\n and our\n Privacy Policy. We use vendors that may also process your information to help\n provide our services.\n\nYou’re signed up for the Heat Vision Newsletter\n\nSave on The Definitive Voice of Entertainment News"
}