{
  "showId": "collected-stories-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2010/legit/reviews/collected-stories-1118015588/",
  "publishDate": "March 2, 2010",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Linda Lavin and Sarah Paulson bring vivid life to Donald Margulies' examination of the complex relationship between a established writer and her young protege in this well-crafted revival.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Linda Lavin and Sarah Paulson bring vivid life to Donald Margulies' examination of the complex relationship between a established writer and her young protege in this well-crafted revival.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 366,
  "archivePath": "data/archives/reviews/collected-stories-2010/variety--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T05:13:02.630Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "showNotMentioned": true,
  "wrongFullText": "Bigelow, Cameron seize most pre-Oscar awards\n\nFor many, the Oscar director race is already down to two nominees: Kathryn Bigelow of “The Hurt Locker” and James Cameron of “Avatar.”\n\nBut the helmers — and former spouses — seem to be graciously fluffing the red carpet for each other. Accepting his director trophy at the Golden Globes on Jan. 17, Cameron admitted that he hadn’t prepared a speech because he thought Bigelow was going to win.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Box Office: ‘28 Years Later: The Bone Temple' Scares 'Avatar: Fire and Ash' Off Top Spot Friday With $5.6 Million \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Timothée Chalamet Makes Oscars History With 'Marty Supreme' as Youngest Man With Three Acting Noms\n\nAbout two weeks later, she did, at the Directors Guild of America Awards. That victory puts Bigelow at an advantage to win on March 7 as, more often than not, the DGA winner goes on to take the Oscar. (There are six exceptions to that rule from the past 61 Directors Guild kudos.)\n\nBigelow also scooped up the majority of film critics kudos for directing, including New York, Los Angeles, Chicago and the broadcast crix.\n\nAn Oscar win for Bigelow would set an important milestone — she would become the first woman to receive the director statue in the Acad’s 82-year history. Just three female helmers have been nominated before her: Lina Wertmueller, Jane Campion and Sofia Coppola.\n\nThe buzz surrounding the Bigelow/Cameron tussle leaves the category’s other helmers — Quentin Tarantino (“Inglourious Basterds”), Jason Reitman (“Up in the Air”) and Lee Daniels (“Precious”) — in somewhat of an also-ran zone.\n\nAll three bowed their films at major 2009 fests (while Bigelow’s “Hurt” debut goes all the way back to Venice 2008, and “Avatar” opened commercially in December). A first-timer to the Oscar director derby, Daniels has been showered with jury and audience prizes since Sundance just over a year ago. Reitman, previously Oscar nommed as director of “Juno,” has been gathering praise for his pic since its Toronto premiere in September. And Tarantino, nommed before for “Pulp Fiction,” has gathered momentum with boffo “Basterds” B.O. in late summer following a May Cannes bow.\n\nThe exact same five were nominated for the DGA kudo."
}