{
  "showId": "new-york-new-york-2023",
  "outletId": "broadwaynews",
  "outlet": "Broadway News",
  "criticName": "Unknown",
  "url": "https://www.broadwaynews.com/old-age-pageantry-and-new-age-sentiment-clash-in-new-york-new-york/",
  "playbillVerdictUrl": "https://www.broadwaynews.com/old-age-pageantry-and-new-age-sentiment-clash-in-new-york-new-york/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "A run-of-the-mill big Broadway extravaganza that knows where, but not when, it is.\n\nComposer John Kander and lyricist Fred Ebb are the legendary songwriting partners behind genre staples like “Chicago” and “Cabaret.” Those works — first produced in the ’60s and ’70s — married theatrical spectacle with important socio-political themes. The duo’s latest musical offering “New York, New York,” however, gets stuck between the two.\n\n“New York, New York,” arrives on Broadway, narrowly based on the 1977 Scorsese film of the same name. It touts some of the film’s famous songs but adds some fresh tunes, a new cast of characters and an original book by David Thompson and Sharon Washington. And while director-choreographer Susan Stroman’s staging holds tight to the old-school aesthetic framework of the film, Thompson and Washington’s script hastily stuffs in contemporary ideals about female empowerment and race — both of which lag. The result is a run-of-the-mill big Broadway extravaganza that knows where, but not when, it is.\n\nTechnically, “New York, New York” is set specifically in 1946. Post-World War II prosperity runs amuck in Stroman’s Big Apple, which she imbues with a fervent nostalgia.The first act introduces us to Jimmy Doyle (Colton Ryan), a down-on-his-luck musician who instantly falls for Francine Evans (Anna Uzele), a Black singer from Philadelphia. The former has trouble keeping work while the latter has trouble finding it. He’s not responsible and she’s not blonde. But after some early hesitation on Francine’s part, they couple-up and their luck begins to turn.",
  "isFullReview": true,
  "textWordCount": 250,
  "archivePath": "data/archives/reviews/new-york-new-york-2023/broadwaynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:32:01.210Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251213223501",
  "archiveOrgUrl": "http://web.archive.org/web/20251213223501/https://www.broadwaynews.com/old-age-pageantry-and-new-age-sentiment-clash-in-new-york-new-york/",
  "textIssues": [
    "Word count too low: 256 (min: 300)"
  ],
  "contentTier": "truncated",
  "wordCount": 250,
  "tierReason": "Short text (250 words)"
}