{
  "showId": "new-york-new-york-2023",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Lipton",
  "url": "https://cititour.com/NYC_Broadway/New-York-New-York/1146",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/New-York-New-York/1146",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "Even if Stroman’s never-ending choreography can occasionally feel exhausting, it’s almost impossible not to be delighted by much of her work, most notably, the inventive, tap-filled number “Wine and Peaches,” led by the wonderful Clyde Alves (as Jimmy’s boyhood friend Tommy Caggiano) and featuring some very nimble “construction workers.” Like the city it’s named after, “New York, New York” is full of promise and potential – neither of which is completely fulfilled.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-NEW-YORK-NEW-YORK-Opens-On-Broadway-20230426",
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $69\n Buy Tickets\n\nCititour.com Review\n While New York, New York may be (for some of us) the city so nice they named it twice, sitting through the new musical of the same name just once can be a sometimes exasperating (and sometimes joyous) experience! Despite the formidable talents one of the most accomplished creative teams in history --including director-choreographer Susan Stroman, composer John Kander, and lyricists Fred Ebb and Lin-Manuel Miranda -- this ambitious musical suffers from its overstuffed concept and too-busy execution.\n\nIndeed, the show – with its large company of excellent performers constantly moving and dancing their way through Beowulf Boritt’s superb cityscape set while wearing Donna Zakowska’s colorful costumes – often seems better suited to Radio City Music Hall than the St. James Theatre. All it’s missing is the Rockettes!\n\nTrue, one admires the central idea of creating a tapestry of life in the Big Apple shortly after the end of World War II – including a focus on the struggles of various minorities (African American, Jewish and Cuban) to achieve their version of the “American Dream.” Unfortunately, book writers David Thompson and Sharon Washington have crafted too many subplots and written too many underdeveloped supporting characters who continually shift focus away from the two people we’re being asked to care most about.\n\nThat’s Irish pianist Jimmy Doyle (a bracing, idiosyncratic Colton Ryan), a loud-mouthed, hard-drinking musician whose self-destructive behavior can be partly explained by the death of his much-admired older brother in the war, and African American singer Francine Evans (the steel-voiced, steel-backed Anna Uzele), who suffers through a series of menial jobs before becoming a popular radio star. (If the characters’ names and part of the plot sound familiar, it’s because they are borrowed from Martin Scorsese’s unpopular film, “New York, New York,” which starred Robert DeNiro and Liza Minnelli.)\n\nThe pair’s courtship and marriage aren’t completely believable; as Francine likes to say, they are “oil and water.” Moreover, the show oddly downplays the prejudice they likely face as an interracial couple, which could have been far more integral to the couple’s story.\n\nStill, their plotline (which includes a temporary breakup in Act II) allows these superb performers to sing some of the finest songs in the extraordinary Kander & Ebb catalogue. Ryan’s awestruck take on “A Quiet Thing,” his plaintive “Marry Me,” and his heartbreaking “Sorry I Asked” are small masterpieces. Meanwhile, Uzele’s “Let’s Hear It for Me” and “But the World Goes Round” are bona fide showstoppers you won’t quickly forget. (As for the title tune, which I know you already know, just wait around 2 ½ hours and you’ll see how it’s done!)\n\nSadly, one wishes that a great talent such as Emily Skinner (as music teacher Madame Veltri) was given an equally impressive number, but her solo, “Better Than Before” (one of seven new numbers by Kander and Miranda) simply isn’t quite on the same level as those older songs. And why there’s absolutely nothing for the velvet-voiced Ben Davis (as sleazy producer Gordon Kenrick) to sing is beyond me!\n\nStill, one can happily hear Miranda’s “voice” in “Gold,” the ebullient song crafted for Cuban immigrant Mateo Diaz (Angel Sigala) – an effeminate drummer seeking stardom and acceptance – and his mother Sofia (a sadly underused Janet Dacal). There is also something quite moving about “Light,” a late-show choral number led by African American trumpeter Jesse Webb (a fine John Clay II).\n\nEven if Stroman’s never-ending choreography can occasionally feel exhausting, it’s almost impossible not to be delighted by much of her work, most notably, the inventive, tap-filled number “Wine and Peaches,” led by the wonderful Clyde Alves (as Jimmy’s boyhood friend Tommy Caggiano) and featuring some very nimble “construction workers.”\n\nLike the city it’s named after, “New York, New York” is full of promise and potential – neither of which is completely fulfilled. \n\n By Brian Scott Lipton\n\nVisit the Sitehttps://newyorknewyorkbroadway.com/CastColton Ryan, Anna Uzele, Clyde Alves, John Clay III, Janet Dacal, Ben Davis, Oliver Prose, Angel Sigala, and Emily Skinner, and features Wendi Bergamini, Allison Blackwell, Giovanni Bonaventura, Jim Borstelmann, Lauren Carr, Mike Cefalo, Bryan J. Cortés, Kristine Covillo, Gabriella Enriquez, Haley Fish, Ashley Blair Fitzgerald, Richard Gatta, Stephen Hanna, Naomi Kakuk, Akina Kitazawa, Ian Liberto, Kevin Ligon, Leo Moctezuma, Aaron Nicholas Patterson, Alex Prakken, Dayna Marie Quincy, Julian Ramos, Drew Redington, Benjamin Rivera, Vanessa Sears, Davis Wayne, Jeff Williams, and Darius WrightOpen/Close DatesOpening 5/26/2023Closing 7/30/2023\nTheatre Info\nSt. James Theatre246 West 44th StreetNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 799,
  "archivePath": "data/archives/reviews/new-york-new-york-2023/cititour--brian-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:24:19.802Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 799,
  "tierReason": "Full review text"
}