{
  "showId": "new-york-new-york-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2023/04/26/new-york-new-york-little-town-blues-lost-in-big-city/",
  "publishDate": "2023-04-26T21:53:46",
  "fullText": "Anna Uzele, as a post-WWII radio singer, starts the Kander & Ebb near-classic “But the World Goes ’Round,” moves down front as scenery and castmates disappear, and commandingly steps into focus as she launches into the bridge. The arranger adds a bar or two: “There’s still gonna be a summer, a winter, a spring… and a fall…” The swingin’ band modulates up a step, the strings sneak in, and Uzele knocks it out of the proverbial ballpark, enveloped most fittingly in a seven-beamed spotlight stream, as audience cheers blast the rafters.\n\nBut “But the World Goes ’Round” doesn’t come along until a full 2 hours and 20 minutes into New York, New York, the not-quite-new, not-quite-Kander & Ebb musical at the St. James. The show catches fire for the final half-hour, culminating in a coup de théâtre leading into a smashing rendition of the title song every bit as exciting as you’d find in a prime nitery. Although in a prime nitery, the proprietors wouldn’t make you wait hours and hours to get to the good stuff.\n\n“Ya got trouble,” as some other songsmith once wrote. Not in River City, Iowa, but in New York, New York. The show is “inspired by” the 1977 Martin Scorsese film that collapsed in what was said to have been a cocaine haze, leaving behind a title song that went on to a finer life as an anthemic paean to that magical place where little town blues melt away. We’ve seen numberless Broadway musicals based on hit movies; but a Broadway musical based on a Hollywood flop? The film did have those two aforementioned songs, which represent Kander & Ebb at their best, and the show carries what they used to call “a million-dollar title.” But a million dollars only takes you so far, nowadays.\n\nThe tale is all too familiar, about a broken-down musician (ex-De Niro, now the charmingly assured Colton Ryan of Girl from the North Country) and an ambitious singer (ex-Minnelli, now Uzele of Six) who meet, marry, part, and get together in the final frame to rekindle their flame. Director/choreographer Susan Stroman (The Producers) has conceived her latest musical as something of a celebration of the city. Dance is everywhere, from the office-workers and tourists on the street to the construction workers tap-tap-tapping on the girders of some skyscraper. That particular scene is pulled from an iconic Depression-era photo of steel workers (“Lunch atop a Skyscraper” they call it); it is masterfully staged and performed, complete with an effective scenic transition. Set designer Beowulf Boritt has a field day moving us through the city, on what might well be a million-dollar set.\n\nBut what is this Depression image doing in this postwar musical? If anything is consistent in the evening, it’s the lack of tone. We are always, yes, in New York, New York (with a stop in Hoboken); and the book by David Thompson and Sharon Washington clearly places us in the years just after World War II. But some of the scenes, and some of the characters, and some of the songs seem placed in the Depression or elsewhere. And for what it’s worth—or not worth—the authors see fit to open their grand new musical celebration with the line, and I quote in full, “Holy shit!”\n\nThat said, there is plenty of first-rate musical making in New York, New York. Stroman gives us some of the most exciting choreography on Broadway just now; there is too much of it, though, and a good deal distracts from (or covers for the faults of) what used to be called plot. The design elements are strong, led by Boritt’s shifting views of New York. Donna Zakowska’s costumes are mostly excellent, although the couture—like the show—seems to shift from postwar to prewar. Some delicious work from Zakowska, along with hair and wig designer Sabana Majeed and whoever did the hats, is mixed in with the more generic rest. Lighting designer Ken Billington, who goes back to Chicago and the original Sweeney Todd, deserves a star of his own for his above-referenced work in the “World Goes ’Round” number.\n\nLet us move to the music. The 96-year-old John Kander is a legend, the most revered veteran of Broadway’s yesterdays now that Sondheim has made his exit. The score is what some other old-time songwriter called “a thing of threads and patches, of ballads, songs and snatches.” Early on, you indeed hear some snatches—themes, not full songs—and you find your ears perking up: that’s real music, from someone who knows how to write a soaring melody! When did we last hear that, outside of revivals, in a Broadway theatre?\n\nThe sound of Kander, yes; and it’s most welcome. These particular songs, though, are randomly placed into the narrative whether they serve well or no. Some are new, revised or pulled from the trunk; half are authentic Kander & Ebb, most presumably written long before Fred’s death in 2004. Lin-Manuel Miranda, who frequently salutes Kander for generously opening career doors for him, is credited for additional lyrics. On first hearing, “One Minor Chord” (lyric by Kander) stands out among the previously unheard songs, along with “My Own Music” (lyric by Miranda) and “Better Than Before” (an Ebb lyric revised by Miranda). We look forward to hearing them again.\n\nThe music department, led by music supervisor and arranger Sam Davis, is superb. Kander is, and always has been, an intelligent and entertaining composer; Davis and his co-orchestrator Daryl Waters keenly seize on every musical accent, punctuating the score in a keenly professional manner that is becoming infrequent in our orchestra pits. Alvin Hough Jr. leads a band of 19, and they swing when given the opportunity. Like in the last half hour of the show.\n\nBut we stray from the issue at hand. New York, New York starts very much like the Bernstein-Comden-Green musical On the Town, with that other “New York, New York” song about how it’s a helluva town. Both shows open with extended musical sequences spanning mid-1940s New York, amid visions of Grand Central and the Brooklyn Bridge. But the authors of On the Town wisely concentrated on the escapades of their three main characters. Thompson, Washington, and Stroman roam from plot to plot, place to place, milieu to milieu to the extent that we can’t—or don’t care to—follow what passes for a story.\n\nAlong with the clearly delineated De Niro and Minnelli characters, we get a melting pot of a half dozen story strands; each—cynics might note—features characters of different ethnicities. There is the Irish hero’s Italian best friend, Tommy (Clyde Alves), who at various spots seems to court and eventually win a nameless dancer who is unidentified in the show or in the program. The diminutive Cuban exile Mateo Diaz (the highly entertaining Angel Sigala) walks around literally carrying bongo drums, and has a battered mother (Janet Dacal) and abusive father (also unidentified in the program). Jesse Webb (John Clay III) is a talented trumpeter who can only find work in the kitchen. They are contrasted by Gordon Kendrick (Ben Davis), an upper-class Broadway producer-type who has a goatee and thus, musical comedy shorthand decrees, is the bad guy.\n\nAnd then there’s Alec Mann (Oliver Prose), a fiddler from Poland wearing brown knickers and ugly shoes to show that he’s poor and worthy, who stands in the street playing a song from the 1981 musical Woman of the Year. We don’t get the lyric here, but it’s an especially strong Kander melody formerly called “Sometimes a Day Goes By.” Alec hooks up, in an adoptive son sort of way, with a landlady grieving for her lost-in-action son who in former life was a violin virtuoso—the landlady, not the lost son—but who now rubs her hands so frenetically that we suppose she’s got the arthritis don’t ya know. Even so, young Alec—who appears to be just yesterday off the boat—somehow managed to hear the landlady back in the days when she was headlining at Carnegie Hall before her hands went bad. (Anything can happen in New York.) This tenement landlady is named Madame Veltri; the excellent performance is so understatedly appealing that it was a surprise to decipher, at intermission, that this was the accomplished but rarely understated powerhouse known as Emily Skinner (inevitably remembered for Side Show).\n\nAt several points during the numerous street scenes we notice an elderly drudge who sings while she mops. Late in the second act, while singing and mopping, she is suddenly whisked to the Metropolitan, begowned, and singing Traviata. She just as quickly disappears, unidentified in the show or in the program. The performer is good, whoever she may be. But if the authors don’t care enough to identify these characters, how are we to care about them? And what do these multifarious strands have to do with Jimmy Doyle (the piano player) and Francine Evans (the singer)? Too many characters, too many atmospheric incidentals, too little actual plot.\n\nAn all-purpose actor named Jim Borstelmann—you might recognize him from other Stroman musicals—goes similarly unidentified in the cast list but the authors give him ten or so small cameos through the evening. This allows him to garner laugh after laugh after laugh. Sometimes as a news peddler, sometimes laboring beneath the worst toupee in town, sometimes just wincing as he crosses the stage or opens the evening with that “holy shit”—Borstelmann makes a stronger impression than many of the others. It almost seems like the authors spent their energy sitting around thinking up more and more bits for Borstelmann, rather than fleshing out the actual characters. His impersonation of a zonked bass player beneath a sad porkpie hat is one of the most well-etched character delights on stage.\n\nAnd then the band, finally, plays “New York, New York.” It’s just that kind of show.\n\nNew York, New York opened April 26, 2023, at the St. James Theatre. Tickets and information: newyorknewyorkbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial"
}
