{
  "showId": "new-york-new-york-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Roma Torre",
  "url": "https://nystagereview.com/2023/04/26/new-york-new-york-the-new-musical-cant-quite-make-it-here/",
  "publishDate": "2023-04-26T21:52:09",
  "fullText": "Of all the new musicals scheduled to open this Broadway season, New York, New York had the most potential, at least on paper. The creative pedigree alone put it at the top of our must-see list: music and lyrics by the great John Kander & Fred Ebb, direction and choreography by Susan Stroman, additional lyrics by none other than Lin-Manuel Miranda, and it was inspired by the Martin Scorsese film featuring Liza Minnelli singing that stirring title anthem “New York, New York.” How could it possibly go wrong, you might ask. Well, let’s just call it a case of too many legends stirring the pot.\n\nThe publicity material calls it “a glittering love letter to the greatest city in the world.” That may be what they’re going for; but love letters, no matter how glittering, don’t make for good musicals. And if that’s truly the aim, a better venue might have been Radio City Music Hall where less discerning tourists go for over-produced razzle dazzle.\n\nOf course, given such a stellar team, New York, New York does have its moments but they’re too few and far between to justify the over-produced razzle dazzle taking up more than two and a half hours on the St. James stage.\n\nIf you’re looking for anything resembling the cinematic love story starring Liza Minnelli and Robert DeNiro as an up and coming singer and a struggling musician, you’re mostly out of luck. And I would attribute that to the book writers, David Thompson and Sharon Washington. They moved the timeline up a year from the movie’s V-J Day to 1946. Not sure why that is but they also threw in a bunch of subplots and extraneous characters that basically detract from the two stars. Their names remain the same, Jimmy Doyle and Francine Evans; only in this version, Francine is African American. It’s a good choice but the writers glossed over the challenging dynamic that a mixed race couple would have faced in the 1940’s. And it struck me as a missed opportunity for some genuine dramatic heft.\n\nThere’s a general sense that the entire show was crafted by committee with every voice given equal weight. The result is a sort of throw-it-all-out-there-and-see-what-sticks approach in which the stage is cluttered with fragmented sketches. Instead of a few compelling storylines, we get a lot of cliched vignettes featuring a large ethnically diverse cast with dreams of making it in the big city.\n\nAmong the disparate stories…a gay Cuban bongo player and his mother are tormented by his abusive father. It’s 1946, so you know there’s got to be a war-related tragedy. Someone’s not coming home. Several of the plots involve black musicians and singers desperate for a break. There’s even a bizarre tangent featuring a peripheral maid character who gets a whole scene out of the blue appearing as an opera singer. She has a magnificent voice but it just slows the narrative.\n\nSusan Stroman’s direction is uncharacteristically sloppy, leaning heavily on her choreographic skills where she always shines. The opening number is a busy hodgepodge that looks pretty enough but does little to introduce the story. And almost all of the scene changes are staged with dance sequences depicting city life: pickpockets, street artists, straphangers, mob hits, you name it. A little of that would have gone a long way but after awhile it just serves to stop the momentum. And how to explain the body of a murdered gangster who suddenly stands up and exits in full view stage left?\n\nOne of the highlights in the production is a dance number Stroman ingeniously conceived atop a steel girder at a construction site. There isn’t much reason for it but it’s nevertheless a thrill. And special mention to Clyde Alves whose gymnastics and energetic dancing make him a standout.\n\nAs for the rest of the performances, it’s a mixed bag. Angel Sigala is making a smashing Broadway debut as the young Cuban bongo player. Another Broadway rookie, Oliver Prose, delivers sweetly as an aspiring Polish violinist. And John Clay III as a trumpet playing vet is equally impressive. Emily Skinner, with 10 Broadway shows under her belt, is wasted in an underwritten stock role here. Even her costume, a suffocatingly stiff suit, conspires to hem in her enormous talents.\n\nThe two leads, Colton Ryan and Anna Uzele are plenty talented themselves, but they’re undermined by the crowded book which deprives them of proper character development. They’re stuck in a barebones boy-meets-girl scenario that doesn’t allow for any real emotional investment. And neither displays the requisite star power to overcome the show’s numerous flaws.\n\nThey do sing nicely and what may be the show’s singular salvation is the goosebump inducing finale, when the orchestra rises from the pit and Uzele joins them downstage in a knockout rendition of that ubiquitous title song.\n\nUzele also does a splendid job with “But the World Goes ’Round.” Those are the two best numbers in the show which is essentially a jukebox musical of Kander & Ebb’s songbook. Not all the songs fit and many just feel forced. The songwriters certainly deserve their due but they are not all that well served in this overstuffed production.\n\nA lot of money was spent on the show and it’s mostly displayed in the elaborate scenic designs by Beowulf Boritt, who also devised the projections with Christopher Ash. Anchored by floor to ceiling tenement fire escapes moving this way and that, It all looks spectacular for the most part but as they say, people don’t come for the sets.\n\nIt’s going to be hard avoiding unfavorable comparisons to such other works as On The Town and A Star Is Born. And I wish I had better news to spread here. There’s a line near the end of the show in which a character says “Don’t bet against New York.” Unfortunately, I can’t say the same thing about its musical namesake.\n\nNew York, New York opened April 26, 2023, at the St. James Theatre. Tickets and information: newyorknewyorkbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars"
}
