{
  "showId": "new-york-new-york-2023",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/new-york-new-york-its-up-to-you-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/new-york-new-york-its-up-to-you-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "With so much going on around him, though, it hardly dampens the brassy, cheery proceedings. Your mileage will vary on whether New York, New York and it’s all singin’, all dancin’ peppiness is for you. It’s certainly an upbeat time, and one towards which you can confidently point your visiting uncle. As a friend told me before going, much like the city itself, it holds whatever energy you bring into it.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-NEW-YORK-NEW-YORK-Opens-On-Broadway-20230426",
  "fullText": "New York, New York Cast | Photo: Emilio Madrid\n\nAt its best, the new musical New York, New York feels like the “Rhapsody in Blue” segment from Fantasia 2000; an impressionistic burst of sound and movement coalescing rapturously around a theme. Loosely based on the 1977 Martin Scorsese film that introduced the world to one of its most enduring anthems—written by John Kander & Fred Ebb, whose music returns here, with some additions by Kander and Lin-Manuel Miranda—it is a loud, brash, and often brilliant ode to the city that never sleeps.\n\nOn an opera-sized canvas, Susan Stroman’s agile direction and choreography pulls together a strong-faced painter dabbing away at a canvas, umbrellas flying about during a storm, subway riders jumping to avoid rats, and other fantastic street scenes. A gasp-worthy set reveal (by Beowulf Boritt at the top of his game) sees a collection of steel beams assemble into a tableau like the “Lunch atop a Skyscraper” photograph, and it’s hard not to smile upon seeing a crew of tap-shoe’d workers you just know is about to deliver.\n\nBut this can only go so far, and it’s not long before New York, New York starts to feel like a Radio City Music Hall pageant rather than an actual book musical. Diverging from the original screenplay (until it doesn’t), David Thompson and Sharon Washington’s book battles leftover pandemic weariness (set after WWII, there’s lots of talk of shops reopening and the city coming back to life) with relentless optimism. In the first act especially, there’s not so much plot as a collection of 2-minute setbacks—racism, xenophobia, you name it; it doesn’t much matter—dashed by a scrappy cast member yelling, “It’s New York! Greatest city on earth!” and followed by a megawatt ensemble number. (Shoutout to the St. James ushers who, from the back of the house, thunderously lead the charge of applause after each of these municipal truisms).\n\nWith smart lyrics and melodies meant to be individualized, Kander & Ebb songs are typically best suited to vaudevillian solos (see Cabaret, Chicago, etc), and these group songs, however joyously choreographed by Stroman, start to blend.\n\nWe’re also introduced to a glut of characters, including Jesse (John Clay III), a Black soldier and horn-player; Mateo (Angel Sigala, radiant), a gay-coded Cuban musician and mama’s boy; Alex (Oliver Prose), a fresh-off-the-boat Polish violinist taking lessons from established musician Madame Veltri (Emily Skinner), who awaits her son’s return from war; and Tommy (Clyde Alves), who is just Italian.\n\nThey are all very talented, and they all become very superfluous, especially as the overburdened story gradually zeroes in on its two leads, Jimmy (Colton Ryan) and Francine (Anna Uzele), a pianist and a singer in what we’re told is a tumultuous love affair. Jimmy, you see, drinks (we’re told), is prone to get belligerent (we’re told), and risks crashing Francine’s rising star. He’s Irish, and she’s Black, and this is sometimes referenced, but never meaningfully.\n\nIn the case of Francine, this doesn’t matter much, as Uzele is charming, and sings the hell out of standards made famous by Liza Minnelli in the film, like “But the World Goes ‘Round” and the title theme. But, in one of the most unserious lead turns in memory, Ryan presents a black hole of charisma in a lazy, unfocused performance almost hard to believe is on Broadway. His voice vacillates between affected impressions of Judy Garland, Frank Sinatra, and a Newsie, and it’s hard to discern whether this is the character or actor’s choice, given the overall carelessness of his presence onstage. The part might not be strongly written, and what little characterization is written into it is mostly centered around his being a nuisance, but Ryan throws in the towel, wandering around with more than a hint of smugness.\n\nWith so much going on around him, though, it hardly dampens the brassy, cheery proceedings. Your mileage will vary on whether New York, New York and it’s all singin’, all dancin’ peppiness is for you. It’s certainly an upbeat time, and one towards which you can confidently point your visiting uncle. As a friend told me before going, much like the city itself, it holds whatever energy you bring into it.\n\n‍New York, New York is in performance at the St. James Theatre on West 44th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 833,
  "archivePath": "data/archives/reviews/new-york-new-york-2023/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:24:23.246Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251212025309",
  "archiveOrgUrl": "http://web.archive.org/web/20251212025309/https://www.theatrely.com/post/new-york-new-york-its-up-to-you-review",
  "contentTier": "complete",
  "wordCount": 833,
  "tierReason": "Full review text"
}