{
  "showId": "harmony-2023",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://cititour.com/NYC_Broadway/Harmony/1179",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $59\n\t Buy Tickets\n\nCititour.com Review\n    Timing is everything – a cliché, to be sure, but not without a grain of truth.  Take for example, The Comedian Harmonists, a remarkable group of six German singers who ascent to worldwide fame in the early 1930s was unceremoniously halted by the Nazis (since the group contained three Jews), and who would have become more than just a footnote in history had they existed in almost any other decade.\n\nTake, also for example, the new musical about the group, “Harmony,” now at the Ethel Barrymore Theatre. This labor of love by pop legends Barry Manilow and Bruce Sussman has arrived on Broadway after 26 years of development – and in a moment where its messages about antisemitism and the failure to take action against it could not be more “timely.” \n\nBut even in a different era, it would be a credit not only to Manilow and Sussman – making their first foray into this difficult genre – as well as the extraordinary cast of performers (led by the brilliant Chip Zien) and the inventive director-choreographer Warren Carlyle that we feel fully immersed in Nazi-era Germany in the show’s tension-filled second act.\n\nIndeed. as the Nazis rise to power grows and the group’s “harmony” and livelihood are increasingly threatened – the words “Heil Hitler” have never felt more chilling to me – we feel the fear that these men did for both their livelihood and their lives. (The shows minimal if effective scenery by Beowulf Borrit, fine period costumes by Linda Cho and Ricky Luie, superb lighting by Jules Fisher + Peggy Eisenhower and excellent media design by batwin+robin productions all contribute greatly to the atmosphere.)\n\nAdmittedly, though, it’s an issue with the show’s structure that you may not feel quite as involved (or as tense, for sure) during the slightly-too-breezy first act. Ultimately, it acts as little more than 75-minutes of exposition as it charts the group’s first six years of famine-to feast and introduces us to the show’s many players -- before setting up the show’s main conflict, which takes place directly after the group’s triumphant 1933 concert at Carnegie Hall.\n\nWhile the six men who ultimately make up the Harmonists are not given much more than two-dimensional personalities, they are nonetheless brought to full-bodied life by Danny Kornfeld (Young Rabbi), Zal Owen (Harry), Sean Bell (Bobby), Eric Peters (Erich), Blake Roman (Chopin), and Steven Telsey (Lesh), each of whom prove to be – individually and collectively -- truly great singers, dancers and actors!  Strong impressions are also made by Sierra Boggess and Julie Benko -- given far less material than they deserve – as respectively, Young Rabbi’s sensible shiksa wife Mary and Chopin’s perpetually angry, politically active wife Ruth. \n\nYet, the unquestionable “star” of the show is the indefatigable, brilliant Zien as the show’s narrator, the now 87-year-old “Rabbi” (yes, he survived the war). He is full of regrets, recriminations and ruefulness, struggling to make peace with his troubled past and suffering from more than a dose of survivor’s guilt. As he attempts to find inner peace, Zien not only breaks our hearts, but invades our minds, imploring us to speak up and do right, no matter how difficult the situation. \n\nZien also proves to be a scene-stealer in an extensive number of cameos (mostly comic), including Albert Einstein (presented as a prophet – of both wisdom and doom) and the composer and music impresario Richard Strauss.\n\nBut to quote another musical: “I know what you’re thinking.” Isn’t the music the star? Well, maybe not – but only because it’s probably not what you’re expecting from the team who wrote “Mandy” and “I Made It Through the Rain.” The most notable exception is “Every Single Day,” a traditional Manilow-Sussman love song that will be stuck firmly in your ears until the end of 2023. \n\nThe rest of the varied, accomplished score ranges from such lovely ballads as “Stars in the Night,” “In This World.” “And What Do You See” and “Where You Go” (beautifully performed as a duet by Benko and Boggess) to satirical tunes like “Come to the Fatherland,” “Hungarian Rhapsody #20” (aka “the least Liszt) and “How Can I Serve You Madame” that showcase a more humorous side of this versatile songwriting duo.\n\nAnd then there’s the delightful title number with its promise of happiness – professional and personal. May we all find a way in 2023 to live in harmony, both off and on the stage. That would truly be something to sing about!\n\nVisit the Sitehttps://harmonyanewmusical.com/CastChip Zien, Sierra Boggess, Julie Benko, Sean Bell, Danny Kornfeld, Zal Owen, Eric Peters, Blake Roman, Steven Tesley, Allison Semmes, Andrew O’Shanick, Zak Edwards, Dan Hoy, Bruce Landry, RhonniRose Mantilla, Daniel Z. Miller, Benjamin H. Moore, Matthew Mucha, Constantine Pappas, Kayleen Seidl, Kyla Stone, Bronwyn Tarboton, Kate Wesler, Stuart Zagnit, Lee ZarrettOpen/Close DatesOpening 11/13/2023Closing 2/4/2024\nTheatre Info\nEthel Barrymore Theatre234 West 47th StreetNew York, NY 10036\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 884,
  "archivePath": "data/archives/reviews/harmony-2023/cititour-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:32:19.961Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}