{
  "showId": "harmony-2023",
  "outletId": "nystagereview-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nystagereview.com/2023/11/13/harmony-a-harmonious-new-musical-about-discordant-1930s-germany/",
  "publishDate": null,
  "fullText": "★★★★★ Barry Manilow and Bruce Susskind create, Warren Carlyle choreograph-directs, and Chip Zien finally gets his leading-man moment There was a time when reviewers excited about an opening would resort to the “Run, don’t walk…” plug. You don’t hear it much nowadays. Nonetheless, I’m reviving it for Harmony, the superb new musical for which Barry Manilow wrote the tunes and Bruce Sussman wrote the lyrics and book. Be advised not even to run but to race to this tale of a six-man Berlin singing group that was founded in 1927, became an international sensation by the early 1930s, and disbanded when Hitler decided that the three Jewish members must no longer appear on stage but were better off leaving the country, as they were able to do. Sounds like a grim story, and it is. But not completely so, as the title suggests and as its authors hope in an implied message that remains as cogent today, when antisemitism in on the rise domestically and globally. Whether that wished-for goal is attainable or not, Manilow, Sussman and crew are ebulliently pushing for harmony musically and societally. [Read Sandy MacDonald’s ★★★★☆ review here.] Sussman and Manilow, having worked on Harmony for about 30 years — their efforts praiseworthily apparent — have decided that the Comedian Harmony facts, known in every German household then, are best recalled by the last one surviving. His nickname was Rabbi (Chip Zien), and he’s lived in the States for decades. After the title tune is delivered at a flashy opening by Bobby (Sean Bell), Young Rabbi (Danny Kornfeld), Harry (Zal Owen), Erich (Eric Peters), Chopin (Blake Roman), and Lesh (Steven Telsey), Rabbi takes over. He begins with the jovial birth of the group, details some early rejections, and quickly gets to their mounting fame, instigated by, of all people, Richard Strauss (Zien again), who recommends them for a renown-making café engagement. All but immediately they begin a successful touring, recording, and movie-making career — even supporting Josephine Baker (Allison Semmes) in the 1934 Ziegfeld Follies. Their achievements would be endlessly thrilling were they not occurring at the same time as the National Socialists were gaining control, resulting in Adolf Hitler’s seizing absolute authority as Führer. (Harmony can be seen and heard as a microcosmic metaphor for Nazism taking charge of on both German and Austrian.) At the personal level, Young Rabbi meets and marries Mary (Sierra Boggess), a Gentile who converts to Judaism at that uncertain time. Chopin, a Gentile, meets, and marries unstoppable political activist Ruth (Julie Benko) but doesn’t convert, a situation that increasingly threatens their union. As disturbing scenes pile on exhilarating scenes, Rabbi outlines the Harmonists responding to the encroaching terror. He chronicles their growing concern that the Jewish members could be targets. Act One ends at Carnegie Hall, where a triumphant evening includes news that NBC would like to sign the group. The volatile question raised is whether they should remain stateside or return to their imperiled homeland. They receive a backstage visit from Albert Einstein (Zien again), who suggests that staying where they are is the safest prospect. (He pointedly says — as if speaking to today’s audience — “The world will not be destroyed by those who do evil but by those who watch them and do nothing.”) They debate the pros and cons of Einstein’s observations, with, ironically, Young Rabbi casting the final vote to go home. Act Two recounts the eventual plundering of Europe and the inevitable Comedian Harmonists demise in Munich on November 5, 1935. Other hardships take place, among others, Ruth’s quitting her marriage and eventually disappearing into the ravenous Nazi maw. (Incidentally, a program note specifies of the musical that “Some license has been taken with regard to chronology and locale.” Another liberty: pianist Chopin didn’t sing, although he does here.) Throughout Manilow and Sussman place their songs with the authority of generals planning a campaign. There’s a first-act comedy number that establishes the “Comedian” half of their name. Wearing shirts and boxer shorts, they sing with gleeful innuendo, “How Can I Serve You. Madame?” By contrast, in Act Two for a gig in Denmark’s Tivoli Park, they intone a satirical and deliberately provocative “Come to the Fatherland.” There’s not a clinker in the score, which John O’Neill skillfully conducts. There’s even more than one love song. (Who writes those anymore?) Pay attention to “Every Single Day,” which Kornfeld delivers with passionate clarity. Rarely in recent years have so many sustained high notes from so many cast members made their way over the footlights. Significantly, the high-level Harmony reaches in the writing is matched by Beowolf Borritt’s swank set, Lina Cho and Ricky Lurie’s costumes, Jules Fisher and Peggy Eisenhauer’s lighting, Dan Moses Schreier’s sound, Batwin + Robin Productions’ media design, and Tom Wilson’s hair and wig design. Director-choreographer Warren Carlyle is a signal hero, maximizing every second, ever note, every meaningful gesture, every syllable spoken and sung – all cast members mentioned above outstanding at it all. So is Andrew O’Shanick as the frosty Ubersturmführer. It must be said that the actual Comedian Harmonists amassed a multi-hit song list. Why, it’s fair to ask, have they been discarded in favor of the Manilow-Sussman numbers? The explanation is likely that the original sextet polished a tone that might be considered excessively sweet today. Their work is available on YouTube and will prove instantly appealing for some music lovers. Try to resist “Veronika, der lenz ist da.” A final word: Following a long, celebrated Broadway and off-Broadway career, Zien conquers in a leading-man role. Its range — the many doubling opportunities — includes a soul-searching 11 o’clock “Rabbi’s Turn.” Wrenching confused feelings from deep within, Zien nails it. Sustained bravos for him and the entire memorable enterprise. Harmony opened November 13, 2023, at the Ethel Barrymore Theatre. Tickets and information: harmonyanewmusical.com David Finkle is a freelance journalist specializing in the arts and politics. He has reviewed theater for several decades, for publications including The Village Voice and Theatermania.com, where for 12 years he was chief drama critic. He is also currently chief drama critic at The Clyde Fitch Report. For an archive of older reviews, go here. Email: david@nystagereview.com.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1034,
  "archivePath": "data/archives/reviews/harmony-2023/nystagereview-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:39:36.424Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}