{
  "showId": "harmony-2023",
  "outletId": "the-daily-beast",
  "outlet": "THE DAILY BEAST",
  "criticName": "Tim",
  "url": "https://www.thedailybeast.com/review-barry-manilows-harmony-strikes-a-bum-note-on-broadway",
  "publishDate": "November 13, 2023",
  "fullText": "The seed of Barry Manilow and longtime collaborator Bruce Sussman’s Broadway show, Harmony: A New Musical (Barrymore Theatre, booking to Sept. 1, 2024), is certainly fascinating. The Comedian Harmonists were one of the most successful musical performance groups in Europe in the years leading up to World War II. Half the Germany-based sextet was Jewish, half Gentile, and they are so little-known because their work was almost entirely destroyed by the Nazis.\n\nOn Monday, the show opened on Broadway at the very deliberately chosen time of 11.18pm—“18” is a traditionally celebratory Jewish number (corresponding to the Hebrew word “chai” meaning “life”). The show also has a ticketing policy, “18 at 18,” wherein the first 18 people at the box office when it opens for every performance can buy a ticket for $18.\n\nLast year, when the musical was first performed at the National Yiddish Theatre Folksbiene, Manilow told The Daily Beast that the Harmonists made for “a really incredible story, and it’s amazing nobody remembers them. They invented a style of music and comedy we take for granted now, but they were hugely successful, the Backstreet Boys of their day. They did movies, they sold millions of records.”\n\nHowever, the musical—music by Manilow, book and lyrics by Sussman, directed and choreographed by Warren Carlyle—only makes an occasionally compelling case that the Harmonists (Ari Leshnikoff, Erich Collin, Erwin “Chopin” Bootz, Robert Biberti, Harry Frommerman, and Cantor Josef Roman Cykowski, aka “Rabbi”) should be better remembered by history.\n\nThe unevenly staged Harmony is a shakily constructed set of misfiring elements, whose most compelling beats around Nazism, antisemitism, and bigotry—all points resoundingly and rightly made—feel imposed and didactic rather than flowing naturally from the source material.\n\nThis seems primarily because, as the story presented on stage sketches at least, the six members of the group didn’t do much to stand up against Nazism (except to play satirical, anti-fascist songs when performing outside Germany), and they evaded death and injury too. In the musical, they dither—a lot—when faced with menacing Nazi cultural enforcers, then move on to another song. Their story and characters seem insubstantial. Big ballads like Rabbi’s “Every Single Day” erupt—structurally and emotionally—too soon, prior to our investment with a character having had a chance to form.\n\nWe follow the Harmonists from becoming a group in 1927 to their parting in 1935, including a glittering engagement at Carnegie Hall in 1933 and playing with Josephine Baker (Allison Semmes) at the Ziegfeld Follies in 1934 for the razzle-dazzle opening number of Act 2, “We’re Goin’ Loco!,” which seems to flirt with segueing into Manilow’s “Copacabana.” It’s a discordantly glamorous, colorful prelude to the inevitably grim trajectory of Act 2.\n\nThe men’s inaction may be entirely understandable, but it is not explained or elaborated upon—and, whatever the truth of what they did or not do, it makes for a strangely hollow, hero- and bravery-free musical. The only true acts of courage we see on stage are from Ruth (Julie Benko), wife of Bootz (Blake Roman). Ruth does protest fascism and is beaten, persecuted, insulted, and then ‘disappeared,’ fate ultimately unknown, for doing so.\n\nRuth is the most interesting character in the show—you wish the narrative followed her, rather than her conflicted, inert spouse and his bandmates. “We fight because you married a Jew in this lousy Jew-hating country! And you won’t stand up to them. That’s why we fight!” Ruth rightly tells her husband—and her frustration is shared by the audience.\n\nOf everyone on stage, Ruth has the richest story, and she makes a genuine stand—yet this musical treats its lead female characters shabbily, even while its male leads are so lacking. (Side point: after this, and her career-making role as the standby-turned-star of Funny Girl, can someone just give Benko her own show to helm. It’s overdue.)\n\nJulie Benko, left, as Ruth and Sierra Boggess as Mary in 'Harmony.'\n\nThe most impressively drawn (and acted) of the men is the character of Rabbi, played engagingly as a young man by Danny Kornfeld and by an older man by Chip Zien, who acts as a narrator for the show, looking back from 1988 at history as “the only one left.” Zien is a wonderful performer, but it is hard to square the older man’s bellowing anger and regret—he says he had a chance to shoot Hitler on a train, yet did not—with the younger man’s lack of agency. One of the things the musical could show is how the latter bloomed into the former.\n\nJust as the musical glides past Ruth, it also doesn’t know what to do with Rabbi’s non-Jewish wife Mary (Sierra Boggess). Like Ruth, Mary is defined solely by her relationship with her husband. When she has her say about the future of the group, she is unfairly criticized for fermenting issues within the group. Boggess’ performance, even when armed with such meager material, pops vividly where the men’s do not. She and Benko share a duet, “Where You Go”—another underlining of their devotion to the menfolk who don’t deserve them, and another reminder that, as characters in Harmony, they deserve far better treatment.\n\nAnother major problem: Again, as presented on stage, the Comedian Harmonists aren’t that funny. Mostly, they sing in non-comedic harmony. The singing is fine as it goes, but not stunning or rousing or as standout as, say, a really fine barbershop quartet.\n\nTheir comedy? One of the show’s major set-pieces is a number in which the harmonizing is done around a Marx Brothers-style slapstick skit, “How Can I Serve You, Madame?,” set in a venue where the manager gets continually doused with water. The act of this manager being soaked with water is supposed to be funny. It is absolutely, crashingly not, mostly because the guy getting the dousing seems like a fairly decent sort who’s just trying to do his job. The whole bit falls flat. Far better, and visually striking, are the men playing puppets as they skewer fascism in the show’s most effective song, “Come to the Fatherland!”\n\nAnother bizarre thing is the musical’s misty-eyed insistence that it was such a shame the group fell apart, because the men were such close friends. Again as written, played and presented on stage, they don’t seem to be. We don’t see the formation of their bonds, we don’t see the close and natural flow of a collective friendship in front of us. “These are my friends. My buddies. I don’t think human beings can get any closer,” Rabbi tells us. But the musical doesn’t sketch this convincingly.\n\n(l to r) Steven Telsey, Blake Roman, Danny Kornfeld, Chip Zien, Eric Peters, Sean Bell, and Zal Owen in 'Harmony.'\n\nThe group’s pivotal decision is to return to Germany, rather than take up an offer from NBC to stay in America—except this move, while leading to some unpleasant front-facing encounters with Nazism and the group being placed under pressure, leads to a cul-de-sac of story and plot in the actual show. The men just ultimately go to other places—and their passage to these other places is related as an aside.\n\nWhen the group is ultimately rent asunder it just doesn’t have an impact, or feel that sad a moment. The Jewish members of the group feel powerless in the face of the Nazi threats, while the Gentile members don’t do anything to help them. The Nazis stomp around, are vile, say awful things, threaten the men… and that’s that.\n\nThe stakes turn out to be far lower than the jackbooted, “Heil Hitler”-led scenes of the show imply. Rabbi’s missed opportunity to kill Hitler becomes an overwrought statement of regret by Zien. His “you could have stopped him” self-flagellation should be stirring, but it ends up feeling too much—perhaps because the rest of the story attached to the men has seemed so banal. The show finally has some drama, and melodramatically milks it.\n\nHarmony is bookended by two verbose passages, one sung, one spoken—the first a title-introductory song that never seems to end, the second a piece of anguished rhetoric by Zien. Zien’s passion is stirring, but sounds odd for a show whose protagonists—at least on the strength of what we see on stage—did all they could to evade direct confrontations with bigotry, and who don’t seem that close, or collectively invested as friends, despite the repeated insistence that they were.\n\nLast year, speaking to The Daily Beast at the time when the Ukraine war was leading the headlines, Sussman said he thought his and Manilow’s Jewishness informed their response to the material. Now, the Israel-Hamas war, and its rancorously ugly global fallout, forms the backdrop to the show’s Broadway engagement.\n\n“My Jewishness had nothing to do with it for me. I was trying to write a love song for the girl, and I was trying to write an amusing song for the guys. That was my job.”— Barry Manilow, 2022In 2022, Sussman said that “as time has gone on and the headlines gotten worse, as Jews I feel more of an obligation to tell the story than I ever did before. I wish I didn’t have to say that, but here I am sitting at the gorgeous Museum of Jewish Heritage, ‘A Living Memorial to the Holocaust.’ Every stone in this building is here to encourage remembering. We know we have the right place for the New York debut of this show, and it’s almost unfortunate to say that we probably have the right time to tell this story as well. It’s more relevant than ever.”\n\nIn 2022, Manilow told The Daily Beast he thought current events have given the show a deeper resonance, but he was more focused on writing “a proper song at a proper moment. My Jewishness had nothing to do with it for me. I was trying to write a love song for the girl, and I was trying to write an amusing song for the guys. That was my job.”\n\nThe musical keeps trying to elicit our tears, and—as Sussman said last year—one cannot escape the moment of now it is opening within. There is no doubt that its dramatizing of Antisemitism and bigotry, and Zien’s ringing words on both, hit closer to the bone because of current events. A final number, “Stars in the Night,” has a simple, elegiac beauty, but also unintentionally underlines that we have not come to know the sextet we are being encouraged to feel so deeply about.\n\nSir Tom Stoppard’s play (West End Theatre, to Dec. 10) about math, nature, knowledge, academic jousting, lust, and shifting histories is a complex and juicy hulk of a play that also has a whimsical delicacy and mischief about it. Here however, as performed by the renowned Bedlam Theatre Company, the weight and complexity of Arcadia’s text seems to defeat clarity and structure, despite the sterling efforts of the talented company to deconstruct and elucidate the play anew.\n\nDirector Eric Tucker and designer John McDermott make an engaging space out of a former church, with a scrawled “England” and some spare images to convey the Derbyshire country house of Sidley Park, wherein the brewing genius of the young Thomasina Coverly (an excellent Caroline Grogan) is already far outpacing the teachings of her tutor Septimus Hodge (Shaun Taylor-Corbett).\n\n“Bedlam has a furiously good time rooting through Stoppard’s thicket of intellectual merriment, but this can also feel a wordy muddle—especially over a three-hour run time in a play so rich in ideas.”Their non-age-appropriate attraction for one another is fly in the general ointment, while Thomasina’s genius (around chaos theory and the second law of thermodynamics) is lost in time—while Septimus is ultimately just lost. In the modern day, whatever Lord Byron did or didn’t do at the house is the subject of furious (and again, horny) debate between author Hannah Jarvis (Zuzanna Szadkowski) and academic Bernard Nightingale (Elan Zafir).\n\nBedlam has a furiously good time rooting through Stoppard’s thicket of intellectual merriment, but this can also feel a wordy muddle—especially over a three-hour run time in a play so rich in ideas. Still, it’s not every play where the audience sits on the stage, with the actors taking their places in the audience’s seats, as this production of Arcadia sets up its second act. It’s a switcheroo that speaks to the production: bracing, playful, but not entirely successful.\n\nGot a tip? Send it to The Daily Beast here.",
  "isFullReview": true,
  "dtliExcerpt": "The unevenly staged Harmony is a shakily constructed set of misfiring elements, whose most compelling beats around Nazism, Antisemitism, and bigotry—all points resoundingly and rightly made—feel imposed and didactic rather than flowing naturally from the source material.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "DOWN",
  "dtliUrl": "https://didtheylikeit.com/shows/harmony/",
  "needsScoring": true,
  "textWordCount": 2064,
  "archivePath": "data/archives/reviews/harmony-2023/the-daily-beast--tim_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:41:23.216Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}