{
  "showId": "harmony-2023",
  "outletId": "theatrereviews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theatrereviews.com/broadway-review-harmony-at-the-ethel-barrymore-theatre-currently-on/",
  "publishDate": null,
  "fullText": "The Comedian Harmonists was an internationally famous all-male German singing group that was formed during the Weimar period and was forced to disband in the early 1930’s when the Nazi regime came into power. The group consisted of six males, three of whom were Jewish or of Jewish decent and one that had married a Jewish woman. The story of this group’s rise and fall is the subject matter of the musical “Harmony” that recently opened on Broadway after its successful off-Broadway run last season. The music is by Barry Manilow and the book and lyrics are penned by Bruce Sussman. Fans of Mr. Manilow may be disappointed if they are expecting his trademark modulating romantic pop songs from the seventies but will be pleasantly surprised by the deviation and the valid musical theater score he has composed. Mr. Sussman’s lyrics fuel the group’s comedic genre but also capture the tension in the emotional scenes. The book has the task of covering a lot of territory in the two and a half hour time frame of the show but rises to the occasion with minor difficulties. The concept of using an older version of the only surviving member of the group as narrator guiding the audience and commenting on the action serves the production well. Director and choreographer Warren Carlyle move through the story at a fast clip which packs a wallop with the entertaining musical numbers in act one, but slightly falters with a long and labored second act.\n\nIn 1927 Harry Frommerman (an astute Zal Owen) an unemployed actor has the idea to form an all-male singing group mirrored after groups he listened to from the United States. He holds auditions at his flat in Berlin and can assemble a motley crew of singers including pianist Erwin Bootz nicknamed “Chopin” (a romantic and sincere Blake Roman) and Roman Cycowski, called “Rabbi” denoting his rabbinical studies which he abandoned (a compelling and intriguing Danny Kornfeld). Rounding out the group was Ari Leschnikoff, “Lesh”, who at this performance was played by understudy Dan Hoy. Mr. Hoy confidently filled the shoes of Steven Telsey who usually plays the role, turning in an energetic and heartfelt performance. Erich A Collin (a pensive Eric Peters) and Robert Biberti (a somber and resourceful Sean Bell). They get off to a rough start but quickly hit their stride when their tuxedos are stolen before a show, and they perform a choreographed, harmonious comedic act in waiters’ jackets and boxer shorts. The rest is history. These six actors are the heart of this production and define the theatrical term “triple threat” as they carve out their characters, delve into their vocal arsenal and show off their dancing prowess. The romantic interests Ruth (a feisty and determined Julie Benko) and Mary (the delightful and understanding Sierra Boggess) play key roles in the group’s life altering decisions. Their vocals, whether solo or duet, are powerful, noteworthy and of course in perfect “Harmony”. Finally, there is Broadway veteran Chip Zien who inhabits the role of the aged “Rabbi” acting as narrator sometimes stepping back into history shadowing and pleading with his younger self during challenging times to make the right choices. It is a tour de force performance which is highlighted by his tense and dramatic solo musical number “Threnody.”\n\nThis musical has been a journey for the creators over the past twenty-five years and has finally come to fruition with a New York debut at the National Yiddish Theatre Folksbiene in lower Manhattan. The show is entertaining, informative, and delivers an important piece of history about a successful musical group that would otherwise be forgotten. The most challenging element of this endeavor is the balancing of comedy and drama. The show is filled with entertaining musical numbers and some comic turns by the quirky characters. In the end this endeavor will not leave the audience smiling as they exit the theatre like a typical musical comedy, but they will certainly be pondering a challenging and important part of history.\n\nProducers Tom Kirdahy, Sonia Friedman Productions, and Hunter Arnold announced today that Matthew Lopez’ acclaimed play, THE INHERITANCE, directed by Stephen Daldry, will conclude its Broadway run on Sunday, March 15th. THE INHERITANCE began previews on Broadway at the Ethel Barrymore Theater (243 West 47th street) on Friday, September 27th,…\n\nMischief Theatre has returned to Broadway with another play that isn’t going exactly as planned, exactly the way the creative team wanted it to, now on stage at the Ethel Barrymore Theatre, aptly titled “Peter Pan Goes Wrong” based on the play “Peter Pan” by JM Barrie. The book showcases…\n\n“Our Town” by Thorton Wilder is recognized as a classic, and the revival now playing at the Ethel Barrymore Theatre on Broadway, directed by Kenny Leon is the perfect example of why it has achieved that status. It is timeless, appealing to a multi-generational audience, and allows each theatergoer to…",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 821,
  "archivePath": "data/archives/reviews/harmony-2023/theatrereviews-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:51:30.509Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.goto: Timeout 60000ms exceeded.\nCall log:\n  - navigating to \"https://www.theatrereviews.com/broadway-review-harmony-at-the-ethel-barrymore-theatre-currently-on/\", waiting until \"domcontentloaded\"\n"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "ends_with_ellipsis"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}