{
  "showId": "chicken-and-biscuits-2021",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Chicken-Biscuits/1049",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Chicken-Biscuits/1049",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $69\n Buy Tickets\n\nCititour.com Review\n As those of us who grew up in households without a great cook all know, a meal can be overcooked or half-baked, yet made with enough love that it can still be satisfying – even delicious. As frequent theatergoers also know, the same can be said of plays, which may explain one reason audiences are jumping to their feet at the end of Douglas Lyons’ “Chicken & Biscuits” at Circle in the Square. \n\nTrue, there can be little argument by anyone that the show desperately needs some strong-handed dramaturgy (among other issues, it’s absurdly overlong at 2-plus intermission-less hours) and would also benefit from a stronger directorial hand than the one that belongs to Broadway newcomer Zhailon Levingston. Still, there can be no disagreement that Lyons has written an often humorous and deeply sentimental love letter to power of family and forgiveness.\n\nThe family in question belongs to the late Bernard Jenkins, whose funeral provides the setting for the show. Its fulcrum is his pious, slightly bossy older daughter Boneatta (a fine Cleo King) – obviously keeping some sort of secret -- and her husband, the sweet-natured Reginald Mabry (Norm Lewis), who is also somewhat nervously taking over Bernard’s post as the church’s pastor. (His not-so-somber eulogy for Bernard is one of the show’s highlights and Lewis handles it wonderfully.)\n\nAlso on hand are the couple’s grown children, the slightly strident Simone (the surprisingly touching Alana Raquel Bowers) and her younger brother Kenny (a charismatic Devere Rogers), a gay actor who isn’t fully out to his family, as well as Boneatta’s flamboyant, tell-it-is like younger sister Beverly (a consistently scene-stealing Ebony Marshall-Oliver) and her equally outspoken teenaged daughter Latrice (a spot-on Aigner Mizzelle). All four characters are defined as much by what they say as what they wear, and costume designer Dede Ayite has done another spectacular job in finding each the perfect outfit to express their personalities.\n\nAs much as these folks all spat and squabble, much of the show’s conflict comes from the presence of two other people: Kenny’s white and almost shockingly clueless Jewish boyfriend Logan (the hilarious Michael Urie, unapologetically milking every laugh he can) and an initially mysterious woman named Brianna (a beautifully grounded Natasha Yvette Williams), who shows up partway through the proceedings. \n\nYet as disruptive as their presences are on the surface – and Lyons does create a moment or two of true dramatic frisson -- it’s not exactly a spoiler to say that everyone onstage will eventually sit down together to feast on Bernard’s favorite meal, chicken and biscuits. The play is, above all, meant to be comfort food for the soul, and audiences who come prepared to eat it all up are sure to leave satisfied.\n\n By Brian Scott Lipton\n\nVisit the Sitehttps://chickenandbiscuitsbway.com/CastCleo King, Norm Lewis, Michael Urie, Alana Raquel Bowers, Ebony Marshall-Oliver, Aigner Mizzelle, Devere Rogers, NaTasha Yvette WilliamsOpen/Close DatesOpening 10/10/2021Closing Open-ended\nTheatre Info\nCircle in the Square235 West 50th StreetNew York, NY 10019 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 552,
  "archivePath": "data/archives/reviews/chicken-and-biscuits-2021/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:22:56.829Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 552,
  "tierReason": "Full review text"
}