{
  "showId": "chicken-and-biscuits-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2021/10/10/chicken-biscuits-funeral-plus-family-dysfunction-adds-up-to-familiar/",
  "publishDate": "2021-10-10T20:49:28",
  "fullText": "Stop me if you’ve heard this one before. A funeral for a family patriarch gets derailed by sibling rivalries, inappropriate behavior and language, and the arrival of a surprise guest that spurs dramatic revelations.\n\nOf course you have, because the familiar scenario has inspired an endless series of films, television shows and plays, including not one but two film versions of the darkly comic Death at a Funeral. But that hasn’t stopped playwright Douglas Lyons from hewing to the formula yet again with his debut Broadway effort. Previously presented at Queens Theatre in a 2020 production cut short by the pandemic, Chicken & Biscuits has returned with a formidable new cast including Norm Lewis, Michael Urie, and TV and film veteran Cleo King (Mike & Molly).\n\nHow much you enjoy the evening will depend on your tolerance for stereotypical characterizations and situations more redolent of a sitcom than theater. To be sure, there are laughs to be had, and the audience at a late preview performance was certainly partaking of them.\n\nThe play revolves around the memorial service of a pastor whose death has resulted in the appointment of his son-in-law Reginald (Lewis, seemingly enjoying not having to sing on Broadway for once) as his replacement. One of Reginald’s first duties is officiating at the funeral attended by his wife Baneatta (King, a formidable presence) and her younger sister Beverly (Ebony Marshall-Oliver). The other mourners include their daughter Simone (Alana Raquel Bowers) and son Kenny (Devere Rogers) and Beverly’s social media-obsessed teenage daughter La’Trice (Aigner Mizzelle). Much to his mother’s consternation, Kenny has brought along his partner Logan (Urie), whom she refuses to accept. She even pretends not to remember Logan’s name, referring to him as “your little friend, Lucas.”\n\nTensions are apparent from the beginning. The rambunctious Beverly’s revealing clothes and plunging neckline elicits disapproval from her daughter and straitlaced older sister, but she’s unrepentant. “Today is a celebration, that’s why my puppies are out!” she declares. “Her titties are doing the tango outta her blouse,” Baneatta observes. The Jewish Logan has never been to church before, let alone attended a Black funeral. “It’s like a reverse Get Out and we all know how that ended!” he says nervously.\n\nIn case the on-the-nose dialogue proves too subtle, director Zhailon Levingston emphasizes the tense interactions by having the actors momentarily freeze to the ominous strains of Ennio Morricone’s The Good, the Bad and the Ugly theme.\n\nThe moment we’re introduced to the characters, we know how things are going to play out. Will Baneatta and Beverly overcome their very different personalities and resolve their long-standing issues? Will Kenny find the courage to stand up to his mother and proudly declare Logan to be his lover? Will the insecure Bernard come into his own as a pastor, leading the family members (and the audience) in a rousing chant of “Hallelujah?” And will the arrival of the mysterious Brianna (Natasha Yvette Williams, Waitress) and the revelation of her relationship to the others bring the family closer together or drive them further apart? No points for guessing correctly.\n\nTo his credit, the playwright introduces various social, racial, and class themes into the mix. The problem is, he does so in highly awkward fashion, with jarring tonal shifts in which the farcical proceedings stop cold so that various groups of characters can engage in deadly serious conversations. It all feels like a situation comedy indulging in a “very special episode.”\n\nThe performers, several of them new to Broadway, strive mightily to mine the broad humor for all its worth and generally succeed. The standouts are Mizzelle, a hoot as the precocious teen, and Urie, who gets laughs with every nervous twitch, although he’s playing the sort of role from which he should have graduated by now.\n\nFor more than a few, Chicken & Biscuits will live up to its name by being enjoyable theatrical comfort food. But you can’t ignore the fact that it simply isn’t very nutritious.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
