{
  "showId": "chicken-and-biscuits-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2021/10/10/chicken-biscuits-dysfunctional-family-becomes-beautifully-functional/",
  "publishDate": "2021-10-10T20:50:54",
  "fullText": "To put it succinctly: Douglas Lyons’s Chicken & Biscuits, directed by Zhailon Levingston, is as satisfying a theatrical meal as is an ample serving of actual chicken and biscuits.\n\nTo put it at greater length: Chicken & Biscuits joins the long list of American plays about dysfunctional families. It also joins a shorter list of American plays during which those dysfunctioning forge a way to become functional.\n\nIt may be that while creating that trajectory, dramatist Lyons takes a few, sometimes sentimental shortcuts, but only the crankiest onlookers will object to what looks to be a commercial success.\n\nThe family here, residing in New Haven, is named Jenkins. They and a couple of not necessarily welcome guests have gathered for the funeral of Pastor Bernard Jenkins (affectionately called “B”), whose special chicken and biscuits dish wasn’t loved by all due to the biscuits being predictably dry.\n\nThe service is to be led by the deceased man’s son-in-law and now successor pastor Reginald Mabry (Norm Lewis). Reginald is married to knows-her-own-mind Baneatta Jenkins Mabry (Cleo King). Also present are Baneatta’s outspoken sister Beverly Jenkins (Ebony Marshall-Oliver) and Beverly’s 15-going-on-16 daughter La Trice Franklin (Aigner Mizzelle).\n\nRounding out the effervescent, frequently boisterous group are the Reginald-Baneatta offspring, Simone Mabry (Alana Raquel Bowers) and Kenny Mabry (Devere Rogers), who brings to the service his white (gasp!) boyfriend Logan Jacob Leibowitz (Michael Urie). There is one other attendee, Brianna Jenkins (Natasha Yvette Williams). More of her later—well, not much more.\n\nRecognizing Lyons’s characters is crucial, because each one is some kind of alarm-pulsing character, all right. They’re fictional figures—are any or all of them plucked from Lyons’s past?—that actors love to grab by the shoulders and make theirs. Which is a way of saying that Lewis (taking a hiatus from musicals but getting close to singing once) is his usual irrepressible self. He’s not alone. Attempting to repress any of the others busy at their high-level thesping would be a formidable challenge. Just leave it that this ensemble is a playwright’s dream.\n\nSo what goes on for the two hours that Chicken & Biscuits covers its forty-miles-of-good/bad-road course? Yes, this is a drama, but it’s peppered-and-salted with hugely comic moments. For much of the loopy proceedings Baneatta refuses to acknowledge Logan, other than to call him not by his rightful name but by substitutions like Lucius. Sisters Baneatta and Beverly wage their sisterly war, a war in which the former starts by taking great objection to the latter’s low-cut and glittery outfit. La Trice is very involved with her adolescent self. Simone and Kenny lace into their own sibling battles. Logan spends much stage time taking Kenny’s temperature on acknowledging to his family the extent of their alliance. For the most part Reginald keeps his cool. Then there’s Brianna Jenkins, but this is a spoiler-free review zone, so that’s the end of that.\n\nBecause Lyons has packed so much into a family get-together that comes across more like a family lets-get-at-each-other-while-we’re-together encounter, it constantly somersaults from one wild mood to one tame mood and back again and them back again. To handle the shifts, it takes a director who may feel the need to consult a lion tamer. Director Levingston is up to the task most of the time. Occasionally he allows his happily histrionic troupe to get the upper hand, whereupon the audience may experience a whoosh in the solar plexus.\n\nTo make certain his point gets across, Lyons may insert one or two too many clashes. His characters’ reversals more often than not ultimately feel right, but sometimes they don’t. Would self-involved La Trice become as accepting as she does towards Logan? Sure, Logan is Jewish; but would he really wonder, when asked to open his Bible to the Book of John, whether John has a last name? The joke gets one of the big Lyons laughs, but it’s hardly as deserved as so many others are.\n\nKudos to the creative team, especially Dede Ayite, the range of whose costumes are an eye-popping fashion parade. Special attention need be paid to Baneatta’s stylish funeral suit, Beverly’s ultra-swank almost-outfit, and La Trice’s jacket with streamers swinging just below the shoulders. Nikiya Mathis’s wigs and hair designs also run a wide field. The same shout-out to lighting designer Adam Honoré and sound designer Twi McCallum.\n\nReserved kudos go to Lawrence E. Moten II, who arranges, possibly under Lyons’s desires, four pews in a square to indicate a chapel, which is fine as far as it goes. The catch is that throughout Chicken & Biscuits locales change, requiring awkward pew pushing and pulling and sometimes merely ignoring them. When Reginald’s service is underway, Moten does reveal a Black Jesus, which makes complete sense in the context.\n\nImportant extra: Throughout dramatic literary history, special theatrical symbols abound. An unforgettable example appears in Chicken & Biscuits when a covered casket becomes a dining table for a redemptive celebratory meal. Watch for it.\n\nWe all know—don’t we?—the phrase Goin’ to Church, which means letting religious fervor flow no matter what the context. Dramatist Lyons has written a play about literally goin’ to church. He’s gotten the church bells reverberantly chiming. If theater lovers are smart, they’ll heed the call and go straight to Chicken & Biscuits church.\n\nChicken and Biscuits opened October 10, 2021, at Circle in the Square and runs through November 28. Tickets and information: chickenandbiscuitsbway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
