{
  "showId": "chicken-and-biscuits-2021",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/chicken-biscuits-worth-seconds-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/chicken-biscuits-worth-seconds-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "Lyons' play is nothing new, but it feels joyful and pure. I do wonder if the familiar bit about a relative's latent homophobia being framed as a pesky character trait and not a damnable offense has any place in 2021, but it skirts the offensive here by quickly reframing it as more of a race than a sexuality issue, in the case of Kenny and Logan. Still, with the cast having this much fun onstage, it's hard not to feel like part of the family, and Chicken & Biscuits is comfort food worth reheating",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-CHICKEN-BISCUITS-Opens-on-Broadway-What-Did-the-Critics-Think-20211010",
  "fullText": "The cast of Chicken & Biscuits | Photo: Emilio Madrid They’re cooking up an old favorite down at the Circle in the Square Theatre. Douglas Lyons’ new play Chicken & Biscuits reheats the classic family reunion recipe and the resulting comedy is satisfying, if not entirely fresh. Apparently, so were the ones made by Bernard Jenkins, the patriarch of a Black family assembled for the first time in years to mourn his recent passing. Despite his lackluster cooking, he left a lasting impression on his descendents, who have all come to New Haven for the funeral. Baneatta (Cleo King), the eldest daughter, is concerned with sanctifying his legacy against the good of the family. Her husband, pastor Reginald (Norm Lewis), is scared to deliver his father-in-law’s sermon, and anxious to keep his flustered wife from going off the rails. This seems imminent, not because their daughter Simone (Alana Raquel Bowers), the perfect church girl, has recently called off her engagement, but because their actor son Kenny (Devere Rogers) is bringing his white boyfriend Logan (Michael Urie), who Baneatta is reluctant to address. Beverly (Ebony Marshall-Oliver), Baneatta’s younger sister—as she reminds us often and joyfully—pays this no mind, and is looking forward to hitting the clubs after the funeral, and her sixteen-year-old daughter La’trice (Aigner Mizzelle) is just waiting for her mixtape drop next week. The cast—five of whom are making their Broadway debuts—is excellent, and promises finer work in more nuanced material. The women, in particular, are intensely watchable and could all lead their own shows; I hope they do. As an eternally young-at-heart aunt, Marshall-Oliver makes a meal out of Beverly, flinging her expressive Lucille Ball eyelashes around with lovable charisma. NaTasha Yvette Williams, in just a few brief moments onstage, radiates pathos as an 11th-hour addition not entirely welcome by all members of the family. Zhailon Levingston directs the proceedings well, with a dynamism that uses the theatre’s in-the-round space eloquently without exhausting the audience. It’s almost hard to imagine this play being staged anywhere else, with the space’s heightened intimacy elevating material which might not fare as well on a proscenium. Lawrence E. Moten III’s scenic design consists of a simple, uncluttered church set with a few pews that are put to various use by the cast. Dede Ayite’s costumes are fun and character-appropriate, and I recommend thinking about how booked and busy Ayite has been lately to distract yourself from Twi McCallum’s goofy sound design, all cartoon sound effects better left for Looney Tunes. Lyons’ play is nothing new, but it feels joyful and pure. I do wonder if the familiar bit about a relative’s latent homophobia being framed as a pesky character trait and not a damnable offense has any place in 2021, but it skirts the offensive here by quickly reframing it as more of a race than a sexuality issue, in the case of Kenny and Logan. Still, with the cast having this much fun onstage, it’s hard not to feel like part of the family, and Chicken & Biscuits is comfort food worth reheating. Chicken & Biscuits is now in performance at the Circle in the Square Theatre on West 50th Street in New York City. For tickets and more information, visit here. Juan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.",
  "isFullReview": true,
  "textWordCount": 604,
  "archivePath": "data/archives/reviews/chicken-and-biscuits-2021/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:23:34.265Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 604,
  "tierReason": "Full review text"
}