{
  "showId": "to-kill-a-mockingbird-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/12/13/to-kill-a-mockingbird-harper-lees-classic-makes-magnificent-theater/",
  "publishDate": "2018-12-13T20:40:45",
  "fullText": "The not inconsiderable controversy that has surrounded the Broadway adaptation of Harper Lee’s To Kill a Mockingbird since it was authorized by the author shortly before her death in early 2016 has been convincingly resolved at the Shubert. Concerns about whether the script by Aaron Sorkin supports or subverts the novelist’s intentions are instantly allayed, with the audience held in rapt attention throughout. This stage Mockingbird is majestically triumphant.\n\nWords are necessarily changed, actions altered, and scenes refashioned for dramatic purpose, yes; but playwright Sorkin—with expert aid from director Bartlett Sher—serves Lee exceptionally well. The soul and conscience of the 1960 novel virtually leap across the footlights, in a manner every bit as strong as they did on the page and in the 1962 motion picture version. The Broadway Mockingbird will likely leave a throb in your heart and a well of tears in your eyes.\n\nSorkin and Sher begin their play on what turns out to be the precisely right note. A decrepit warehouse-like space is revealed, which is then almost magically (read: theatrically) transformed to each and all of the necessary locales in the fictional “tired old town” of Maycomb, Alabama, during the Depression-era summer of 1934. From the first, three children—young Scout, her brother, Jem, and their Penrod-like friend, Dill—take focus, serving as narrators offering a vibrant flashback to the serious events of the preceding months. The fragmented and impressionistic storytelling, built around “big scenes” that stand out in the three childrens’ collective memories, carefully capture the startling impact of Lee’s novel. This is enhanced by the manner in which Sorkin and Sher weave the children into some of the flashbacks as almost ghostly observers.\n\nA major part of this Mockingbird’s spell, right from the beginning, is a second conceit: These children are played, openly and unapologetically, by adult actors. There’s no reason to expect that Celia Keenan-Bolger (Peter and the Starcatcher, The Glass Menagerie), Will Pullen (Sweat), and Gideon Glick (Significant Other) should be so very good in the roles. As it turns out, their acting skills allow them to convincingly serve and sustain the play in a manner that three juvenile actors most likely could not. Keenan-Bolger, with a ferociously jutting jaw leading her body across the stage, has determination enough for any six-year-old; and Glick, his body gangly and concave, is a perfect embodiment of the irrepressibly awkward Dill (patterned after Lee’s childhood pal, who grew up to become Truman Capote).\n\nThe centerpiece of any representation of Lee’s novel, of course, must be the actor playing Atticus Finch, the small-town lawyer who insists on seeing the best in everyone. Jeff Daniels—whose long career recently brought him back to Broadway with Blackbird—undertakes the role here, and he is remarkable. It’s not that he wipes out the memory of Gregory What’s-His-Name in the motion picture version; it’s simply that Daniels perfectly embodies Atticus Finch, and that’s that.\n\nLaTanya Richardson Jackson (Raisin in the Sun) adds moral gravity as the housekeeper, somewhat more so than Calpurnia does in the novel. In 1960 America, there were limits to how noble and well-spoken the novelist could have drawn the character. Standing out among the large cast are Gbenga Akinnagbe (in his Broadway debut) as Tom Robinson, the man on trial; Frederick Weller (Mothers and Sons), vibrantly evil as the repellent Bob Ewell; and Erin Wilhelmi (The Crucible) as the victimized Mayella. (Did the author borrow this oversexed, incestuous father-daughter duo from Erskine Caldwell’s Tobacco Road, a bestseller published when Lee was 6 and successfully adapted for both stage and screen by the time she was 15?) There are two excellent performances from members of the recent Iceman Cometh cast: Dakin Matthews as the judge who bends over backward to assure a fair trial; and Neal Huff as Link Deas, the town misfit who speaks the truth.\n\nSher and associates have devised a physical production that augments the play’s aura of fragmented memory. Set designer Miriam Buether does this with high theatrical flair; all the relevant locales are clearly presented, but there seem to be few actual walls other than the jailhouse exterior. Buether, who provided the psychologically compelling scenery for last year’s Three Tall Women, is also currently on the boards with the astounding The Jungle at St. Ann’s Warehouse.\n\nAnn Roth, who has been providing exquisitely realized costumes for stage and screen since the days when giants like Neil Simon and Mike Nichols roamed the Rialto—The Odd Couple, in 1966, was Roth’s eighteenth Broadway show—works her usual magic here. Note the way Scout is dressed in drably colored tomboy garb but with a noticeably newer add-on collar emblazoned with bright red roses. Also consider what is presumably the only courtroom-worthy suit Atticus owns, with trousers that look that they haven’t been pressed since Herbert Hoover was voted out of office. Jennifer Tipton expertly sculpts the many playing areas with light, as she has been doing since the late 1960s. Scott Lehrer does his customarily effective job with the sound design.\n\nIt should be noted that Sher has worked almost exclusively, and always successfully, with one set designer, one costume designer, and mostly two lighting designers; the team has done all 11 of Sher’s prior Broadway shows. Mockingbird has jolted him into new collaborations, with rewarding results all around.\n\nSher has also commissioned an atmospheric incidental score from the estimable Adam Guettel of Light in the Piazza, played by an onstage organist (at the base of the stage left proscenium) and a guitarist (on stage right). Beneath the dress and wig of that schoolmarmish organist, incidentally, is Kimberley Grigsby, who has electrified musicals like The Full Monty and Spring Awakening from the conductor’s podium.\n\nThe magic of Mockingbird, though, rests on the theatrical imagination of Sorkin, who burst into prominence in 1989 with A Few Good Men and has since ensconced himself in screen-and-TV-land with The West Wing and The Social Network, among many highlights. He demonstrates here what novelist Lee—who was famously protective of her work—presumably recognized when granting permission for his play. Stage adaptation is just that; not simply transplanting dialogue from page to stage, but refashioning the source material for the very different medium. (In this case, Sorkin uses humor as one of his effective tools.) A relevant comparison can be made with the current Network: the heart of the piece is well conveyed, thanks in part to a bravura performance by the leading man. But the rest of the venture is dramatically uncompelling, leaving us thinking we might as well just watch the movie.\n\nLee publicly praised Horton Foote when he won an Oscar for his screen adaptation of Mockingbird. Contrary to the recent complaints and courtroom wrangling from the late novelist’s literary executor—a small-town lawyer with an apparently limited artistic imagination—one suspects the Harper Lee would be similarly thrilled by the magnificent manner in which Sorkin, Sher & Co. have brought Atticus, Scout, Jem, Dill, Boo Radley, and the rest to the stage.\n\nTo Kill a Mockingbird opened December 13, 2018, at the Shubert Theatre. Tickets and information:   information: tokillamockingbirdbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars"
}
