{
  "showId": "on-your-feet-2015",
  "outletId": "broadwayworld",
  "outlet": "BroadwayWorld",
  "criticName": "Michael Dale",
  "url": "https://www.broadwayworld.com/article/BWW-Review-ON-YOUR-FEET-Gloria-and-Emilio-Estefan-Bio-Musical-Is-Vivacious-and-Entertaining-When-the-Music-and-Dancers-Sizzle-20151105",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "For as long as director Jerry Mitchell and choreographer Sergio Trujillo can keep their new Broadway musical in motion, and they do so for nearly all of its wonderfully vivacious and entertaining first act, On Your Feet is a dazzling display of Latin-American musical culture, telling the professional and romantic story of Gloria and Emilio Estefan...Bookwriter Alexander Dinelaris'...cleverest move is to ignore chronology, letting the songs serve the situations...Ana Villafane makes an impressive Broadway debut as Gloria, growing from a shy teen to a confident professional...As Emilio, Josh Segarra is a strong and sympathetic presence...On Your Feet's second act suffers from a common trap when jukebox musicals turn dramatic; there are no songs that specifically address the issues at hand. With little to dance about, the show drags its heels to the plot's triumphant finish that immediately blasts into a boisterious finale, full of spangled costumes and energetic dance solos.",
  "bwwScore": 9,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ON-YOUR-FEET-Opens-on-Broadway-Updating-LIVE-20151105",
  "showScoreExcerpt": "\"The dance-heavy first half ends on a high point, but 'On Your Feet' loses steam when the melodramatic plot takes over in a second act…'On Your Feet's' second act suffers from a common trap when jukebox musicals turn dramatic; there are no songs that specifically address the issues at hand...The musical's success is predominantly dependent on the wonderfully entertaining moments supplied by the dancers and music.\"\n\nRead more"
}