{
  "showId": "on-your-feet-2015",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2015/11/06/theater/review-on-your-feet-rides-the-rhythm-of-the-estefans.html?ref=theater&_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "The recipe may be familiar, but the flavor is fresh in 'On Your Feet!,' the half-formulaic, half-original and undeniably crowd-pleasing musical about the lives of Emilio and Gloria Estefan that opened on Thursday at the Marquis Theater. To cite the most unusual element: Many a musical could be described as a car crash, but I can't think of any in which such a calamity figures as a dramatic turning point. Still, it's no spoiler to say that the show includes the accident that threatened Ms. Estefan's life and might have ended her career. Fans of hers will recall that 1990 incident, which darkens the second act and brings some gravity to this mostly flashy, salsa-splashed show.",
  "bwwScore": 8,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ON-YOUR-FEET-Opens-on-Broadway-Updating-LIVE-20151105",
  "fullText": "https://www.nytimes.com/2015/11/06/theater/review-on-your-feet-rides-the-rhythm-of-the-estefans.htmlAdvertisement\n\nThe recipe may be familiar, but the flavor is fresh in “On Your Feet!,” the half-formulaic, half-original and undeniably crowd-pleasing musical about the lives of Emilio and Gloria Estefan that opened on Thursday at the Marquis Theater.\n\nTo cite the most unusual element: Many a musical could be described as a car crash, but I can’t think of any in which such a calamity figures as a dramatic turning point. Still, it’s no spoiler to say that the show includes the accident that threatened Ms. Estefan’s life and might have ended her career. Fans of hers will recall that 1990 incident, which darkens the second act and brings some gravity to this mostly flashy, salsa-splashed show.\n\nThe musical, which stars a vibrant Ana Villafañe as Ms. Estefan and a commanding Josh Segarra as her husband and musical collaborator, neatly showcases the boppy dance-floor hits and swoony ballads that made Ms. Estefan and the band Miami Sound Machine a radio and MTV staple in the 1980s. But with an often mechanical book, moving through its rags-to-riches paces as if to a rigid percussive beat, “On Your Feet!” ultimately falls somewhere in the middle of the hefty pack of jukebox musicals that have plugged in to Broadway’s power strip\n\nLike the Carole King musical, “Beautiful,” albeit with a built-in audience of a different generation, “On Your Feet!” offers a music-business bio-drama laced with hurdles, and a score stuffed with familiar songs, in this case “Conga,” “Rhythm Is Gonna Get You,” “Don’t Wanna Lose You Now” and many others. But it also depicts the struggles of its Cuban-American characters with honesty, if occasional shorthand.\n\nWe meet the young Gloria (a terrific Alexandria Suarez) in Miami, where she and her parents moved after the Cuban revolution. Singing improvised compositions and strumming her guitar, she listens to encouraging words recorded on a tape by her father, José (Eliseo Roman), who is away fighting in Vietnam: “You’re a born artist, my angel. And one day you’re going to be a big star!”\n\nSuch rote dialogue comes as a jarring surprise, given that the book writer, Alexander Dinelaris, shared an Oscar for the screenplay of “Birdman.” (His less impressive stage credits: the ill-received musical “The Bodyguard” in London and the dreary “Red Dog Howls” at New York Theater Workshop.) Throughout, Mr. Dinelaris’s writing oscillates oddly between showbiz clichés and intimately observed scenes of family life.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 423,
  "archivePath": "data/archives/reviews/on-your-feet-2015/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T17:36:14.838Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250125133128",
  "archiveOrgUrl": "http://web.archive.org/web/20250125133128/https://www.nytimes.com/2015/11/06/theater/review-on-your-feet-rides-the-rhythm-of-the-estefans.html?ref=theater&_r=0",
  "wordCount": 423,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T16:00:16.039Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text cuts off mid-sentence and ends with a technical error message about JavaScript and retrieving article content, making it impossible to determine the critic's final verdict or recommendation.; openai: The text is truncated and includes navigation instructions and access issues, making it not scoreable.",
  "promptVersion": "5.2.0",
  "showScoreExcerpt": "\"The recipe may be familiar, but the flavor is fresh in 'On Your Feet!,' the half-formulaic, half-original and undeniably crowd-pleasing musical...But with an often mechanical book, moving through its rags-to-riches paces as if to a rigid percussive beat, 'On Your Feet!' ultimately falls somewhere in the middle of the hefty pack of jukebox musicals that have plugged in to Broadway’s power strip.\"\n\nRead more"
}