{
  "showId": "on-your-feet-2015",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Oxman",
  "url": "http://variety.com/2015/legit/reviews/on-your-feet-review-gloria-estefan-chicago-1201522935/",
  "publishDate": null,
  "fullText": "There is something comfortingly familiar and predictable about \"On Your Feet!,” the Broadway-bound new bio-musical featuring the story of Gloria Estefan and her music-producer husband Emilio. Another way to say that might be that it never goes deeper than the superficial and that its narrative follows a TV-movie template. But the show boasts sufficient sincerity with its schmaltz, and features a fluid, structurally sound story that strings together the Estefans’ pop ballads with a ready dose of the buoyant Cuban-fusion dance numbers that sold kajillions of albums worldwide. It's a show sure to please the built-in audience that will find absolutely exactly the entertainment they expect, and even the less fully acquainted will find that the rhythm really is going to get you.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Southeast Asian Horror Film 'Baran: Inheritance' From 'Polis Evo's' Joel Soh Boarded by Paradise City Sales (EXCLUSIVE) \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Science-Fiction Thriller 'Psychonaut,' Starring Fiona Dourif, Boarded by Fizz-e-Motion as Trailer Debuts (EXCLUSIVE)\n\nBook writer Alexander Dinelaris (whose wonderfully incongruous credits include the Oscar-winning screenplay of \"Birdman,\" the musical version of \"The Bodyguard\" and the campy Off Broadway musical \"Zanna Don't\") positions the crossover superstar's severe spinal injury during a 1990 tour-bus accident as its flashback point. Act I covers Estefan's (Ana Villafane) early life in Miami, her connection in her late teen years with Emilio (Josh Segarra), and their battles to achieve that elusive but ultimately groundbreaking commercial crossover with the infectious \"Conga,\" which literally has people dancing down the aisles leading into intermission.\n\nAfter the first act made you feel the beat, the second asks you to feel the emotion, focusing on Gloria and Emilio's conflicts with her stubborn mother (Andrea Burns), the familial reconciliation at the time of Gloria's accident (with the one original song, written by Gloria and her daughter, beautifully employed here), and her ultimate recovery and feel-good triumphant return at the American Music Awards. Then there's a medley.\n\nDinelaris actually had quite a challenge here, because other than the accident, Gloria Estefan has lived a ridiculously charmed life — her first boyfriend becomes both her husband and her champion, and until her accident the most difficult internal struggle she faces is that she really, really would rather not be the center of attention. But she's just too talented, and she gets over it — whew! But while she isn't exactly a multi-dimensional character, Dinelaris and actress Villafane (who looks just like Estefan, and will make her Broadway debut with this show) do manage to communicate a genuine sense of humility and likability , which then breathes emotional life to the moment when her thousands of fan letters provide her the encouragement she needs when times get tough.\n\nDinelaris has intelligently scattered the songs — which include \"1-2-3,\" \"Get On Your Feet,\" \"Don't Want to Lose You Now,\" \"Reach,\" and others — non-chronologically in service of the story, and director Jerry Mitchell understands exactly how to hit the sentimental chord of the moment and let the songs provide the depth, which they do. Particularly nice, for example, is having Gloria's father — who served in both the Cuban and American armies and then suffered from debilitating multiple sclerosis — sing \"When Someone Comes Into Your Life\" as Gloria imagines him offering her the advice she craves. It's the epitome of the sappy sweetness of this show that somehow never goes overboard, a tribute to the quality of the songs themselves.\n\nAnd at the moments it threatens to get too serious, the team lets the energetic ensemble burst forth, dancing Sergio Trujillo's kick-crazy Latin choreography, including the boisterous young Eduardo Hernandez, an \"America's Got Talent\" contestant and Latin dance champion who plays the Estefan's son Nayib and who moves his feet in a nearly disturbing blur.\n\nAnd while Gloria is clearly the brand — that's even stated outright at one point as the band Miami Sound Machine is subsumed under her name — this is also Emilio's story. If Gloria's tale has a wee bit of the structure of the Carole King story \"Beautiful\" in it, Emilio's is more like the inside-the-business \"Motown.\"\n\nSegarra does both romantically dashing and ultra-macho, a characteristic which comes into cliché but crowd-pleasing play when dealing with record executives. At one moment, he gets in the face of an executive who thinks they should stick to the Latin market. \"This,\" insists Emilio, with Segarra infusing the moment with righteous anger along with his heavy accent (which gets picked on occasionally), \"is what America looks like.\" That very executive then turns around later, after watching Emilio demand and get more money than Madonna. \"How do you sit down,\" he asks admiringly, \"with balls that size?\"\n\nIt's corny, stereotypical, too on-the-nose... and it works, which is true throughout this unsubtle but ever-crafty and unquestionably entertaining show.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"There is something comfortingly familiar and predictable about 'On Your Feet!' It never goes deeper than the superficial and its narrative follows a TV-movie template. But the show boasts sufficient sincerity with its schmaltz, and features a fluid, structurally sound story...It’s sure to please the built-in audience that will find absolutely exactly the entertainment they expect, and even the less fully acquainted will find that the rhythm really is going to get you.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 795,
  "archivePath": "data/archives/reviews/on-your-feet-2015/variety--steven-oxman_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:41:49.197Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 795,
  "tierReason": "Full review text"
}