{
  "showId": "on-your-feet-2015",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Unknown",
  "url": "http://www.vulture.com/2015/11/theater-review-on-your-feet.html",
  "playbillVerdictUrl": "http://www.vulture.com/2015/11/theater-review-on-your-feet.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nOn Your Feet!, at the Marquis Theatre. Photo: Matthew Murphy I’m no fan of jukebox musicals. If they’re the type that tell an invented tale, like Mamma Mia! or Rock of Ages, the book is generally rendered idiotic by the effort to accommodate the songs. If they’re instead pop biographies, like Jersey Boys and Beautiful, the problem is even worse because the songs, too, are denatured, by the effort to accommodate a preexisting storyline. Furthermore, the structure of musicals in the second category can only lead to a bathetic climax: In the final scenes, the protagonists (Frankie Valli, Carole King) become exactly who we already knew them to be. That’s more than ever the case with the new Gloria Estefan jukebox musical On Your Feet! because if you don’t arrive at the Marquis Theatre knowing the billboard headlines of her story (Cuban immigrant becomes American pop star, gets hit by a truck, eventually returns in triumph), why are you there? The only real issues for me in approaching a show like this are the fun of the tunes and the ingenuity of the distraction. To say that On Your Feet! is better than most of its ilk is therefore faint praise; it means you might have almost as good a time as you would if it were merely a concert.\n\nI don’t mean by this to belittle the life experiences of Estefan and her husband, Emilio. Theirs is a classic crossover success story in which talent and hard work overcome prejudice — a fact that the show’s book, by Alexander Dinelaris, underlines so vehemently it begins to pall.\n\nShow \n 0 Comments / 0 New\n \n Comment\n \n\n Theater Review: On Your Feet!\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 320,
  "archivePath": "data/archives/reviews/on-your-feet-2015/vulture--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:46:49.930Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 320,
  "tierReason": "Full review text"
}