{
  "showId": "walking-with-ghosts-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2022/10/27/walking-with-ghosts-gabriel-byrne-goes-down-a-dark-memory-lane/",
  "publishDate": "2022-10-27T19:53:24",
  "fullText": "In case you haven’t noticed, memoirs are all the rage these days. People of all stripes seem to have an overwhelming urge to tell their own stories, whether on the printed page or the stage. And sometimes both, as is the case with actor Gabriel Byrne, who has adapted his 2020 book Walking with Ghosts into a solo autobiographical one-person show now playing on Broadway. It follows in the heels of a previous autobiography, 1994’s Pictures in My Head, and a 2008 documentary, Gabriel Byrne: Stories from Home. Clearly, this is an actor who doesn’t always feel the need to hide behind his characters.\n\nOf course, it helps if you’re a handsome movie and television star with more than 70 films to your credit, as well as once being labeled by People magazine as one of the “Sexiest Men Alive.” At age 72, Byrne still strikes a dashing figure, speaking in an Irish brogue so soothing and sexy that it should be marketed as an aphrodisiac.\n\nThis is the sort of theatrical memoir for which the term “lyrical” must have been invented. Recounting the story of his early life and only briefly dipping into the sort of show business anecdotes (none of them particularly juicy, alas) for which some gossip-craving theatergoers might be hoping, the piece is so quintessentially Irish that you’ll find yourself craving a Guinness on the way home. Redolent of both James Joyce and Eugene O’Neill, two writers whose work Bryne has performed in his lengthy career, Walking with Ghosts feels far more literary than theatrical.\n\nThat problem becomes apparent from the opening moments of the show, divided into chapters that must have been easily digestible on the page but feel affected here. Byrne begins his tale thusly: “One night, I had this dream. And in the dream it was a summer’s day. I was standing in an orchard, overlooking the streets and the fields of Dublin, where I once lived. Everything shimmered and shone in glorious technicolor. The foaming white of the hawthorn, the purple of the lilac, the fields, green and golden, stretching away to the distant hills. For days afterwards, I couldn’t shake this dream, and on an impulse, I came back. Or should I say, I came home.”\n\nIt would be churlish to say that listening to this sort of poetical description is a chore, especially when delivered in the actor’s mellifluous tones, but a little of it goes a long way. And Walking with Ghosts clocks in at nearly two-and-a-half hours, making the evening feel very long indeed.\n\nIt doesn’t help that the material, as sensitive and heartfelt as it is, too often feels mundane. Byrne tells us about one of his first memories, involving waiting as a child for his father to come home and then imploring him to play his favorite game, “Horsey Horsey.” And so it goes, with tales about his first day of school, his first communion, his first time seeing a dead body, and his suffering at the hands of an abusive schoolteacher. His story about going to the movies for the first time, escorted by his kindly grandmother, is a virtual repeat of a scene from Kenneth Branagh’s similarly autobiographical film Belfast.\n\nEven a harrowing tale about attending a seminary and being sexually molested by a priest feels tragically familiar, although his description of confronting his abuser many years later provides a poignant grace note.\n\nThe show becomes more entertaining in the second half, when Byrne delivers self-deprecating tales about his early career which began when he joined an amateur acting troupe. Much to his delight, he scored a bit part in a television show, only to nearly derail it when he attempted to embellish his character with a backstory, including a limp. He also provides an interesting, if not terribly illuminating, description of an intimate conversation with his idol, Richard Burton, when they were both soused. Which leads, of course, to a harrowing account of his own ultimately successful years long battle with alcoholism.\n\nByrne is such a talented performer, displaying a remarkable talent for mimicry as he embodies the various characters, that he manages to make his tales come alive onstage. But you too often feel the actorly polish which ironically results in a distancing effect from the traumatic incidents being related. It doesn’t help that the staging by Lonny Price is self-consciously theatrical to a fault. The lighting and sound effects call attention to themselves rather than drawing us in; if Byrne describes walking through a revolving door, rest assured that you’ll be treated to the sound of it loudly whooshing.\n\nAs an actor, Byrne tends towards the serious side in his roles (he once even played Satan, in a bad Arnold Schwarzenegger movie). He has the sort of face that makes brooding seem alluring. So it came as a surprise that the most real moment in the soul-baring show involved him comically berating the old television sitcom The Brady Bunch, of all things, complete with a sarcastic imitation of its typically inane dialogue. Byrne, seemingly delighted by his own performance, broke himself up, momentarily alleviating the evening’s torrent of gloomy self-reflection. Or maybe it was just more expert acting.\n\nWalking with Ghosts opened October 27, 2022, at the Music Box Theatre and runs through November 20. Tickets and information: gabrielbyrneonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
