{
  "showId": "walking-with-ghosts-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2022/10/27/walking-with-ghosts-gabriel-byrnes-book-makes-a-hazy-memory-play/",
  "publishDate": "2022-10-27T19:54:44",
  "fullText": "Last year, a dear friend who especially enjoys actor autobiographies gifted me Walking With Ghosts, Gabriel Byrne’s 2021 memoir. It’s a gorgeous, poetic book, garrulous and disarming, visually evocative, and, in the grand tradition of Irish storytelling, as funny as it is wise. I read it on a cross-country flight, and finished long before my plane touched down.\n\nSo it’s not at all surprising that Byrne, a performer with stage presence to spare, would choose to adapt Ghosts into a one-man show, taking it first to his hometown of Dublin, then to Edinburgh and the West End, and now to Broadway for a limited run.\n\nThe actor makes precious few Broadway appearances, which makes Walking With Ghosts event-worthy in itself. And it’s a joy to see him as himself—rather than as, say, a hard-drinking Eugene O’Neill anti-hero. (In 2016, he appeared opposite Jessica Lange in A Long Day’s Journey Into Night; in 2000, he starred in A Moon for the Misbegotten and in 2005, A Touch of the Poet.)\n\nWith his tousled gray-flecked hair, dressed neatly in a jacket, shirt, and sweater vest in cool, complementary shades of blue, Byrne effortlessly charms the audience with tales of wax-like nuns, uncharitable Christian Brothers, and an indulgent granny who fed him forbidden cornflakes and introduced him to the joys of the cinema.\n\nYet every engaging, dramatic moment brings many more equally lackluster stretches. For example, Byrne’s description of the all-you-can-eat, all-you-can-play, carnival-style Bicentennial at the Guinness Brewery (where his father made wooden barrels) is so joyous and evocative that we can practically taste the cotton candy and licorice cigarettes. “The day seemed heaven blessed. How to contain the minutes, the hours, the seconds to make them last forever?” (Sinéad McKenna’s lighting does an expert job amping up the joy and darkening the mood as required.) But that section is bookended by dreary visits with scary eyepatch-wearing Mrs. Gordon—“she looked like a wicked old crone from a fairytale”—and a trip to Dublin department store Clery’s to procure fancy First Communion clothes.\n\nThose mundanities make for welcome breaks in a 200-page book, but in a two-act, one-person show that runs nearly two and a half hours, they play like dull patches. Obviously, no one’s life is packed with thrilling events—not even an award-winning actor’s—nor are we expecting a nonstop, action-packed autobiographical ride. And Byrne shares many heart-piercing tales of tragedy (a priest/mentor became his abuser when he was a seminary student) and hard-earned triumph—he’s now 24+ years sober: “I had admired artists who were legendary boozers and drug addicts. The hell raisers, as they are known. It’s a long illustrious list. They wanted something impossible from the world. Their souls a battleground, for the angels and the devils,” he explains as he recalls a meeting with Richard Burton. Eventually, he concludes, “I was tired of slashing my own soul, and I was sick of the roaring life.”\n\nBut Walking With Ghosts moves in fits and starts, flickering with imagination before ultimately fading away in a ghostlike haze.\n\nWalking With Ghosts opened Oct. 27, 2022, at the Music Box Theatre and runs through November 20. Tickets and information: gabrielbyrneonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
