{
  "showId": "how-to-succeed-in-business-without-really-trying-2011",
  "outletId": "newyorker",
  "outlet": "The New Yorker",
  "criticName": "John Lahr",
  "url": "http://www.newyorker.com/arts/critics/theatre/2011/04/11/110411crth_theatre_lahr",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "In Rob Ashford’s inspired revival of “How to Succeed in Business Without Really Trying” (by Abe Burrows, Jack Weinstock, and Willie Gilbert, with music by Frank Loesser), we watch with delight as J. Pierpont Finch (Daniel Radcliffe) rises by cunning degrees from window washer to chairman of the board. Every nanosecond of this well-cast production is eloquent with craft and wit. But the laurels of the evening go to Radcliffe and the towering John Larroquette, as the boss, J. B. Biggley. Radcliffe’s youthful brightness is a perfect foil for Larroquette’s dopey severity. Radcliffe is having the time of his life; you feel his joy.",
  "bwwScore": 10,
  "contentTier": "complete",
  "fullText": "THE THEATRE review of “Bengal Tiger at the Baghdad Zoo” and “How to Succeed in Business Without Really Trying.” In “Bengal Tiger at the Baghdad Zoo” (sluggishly directed by Moisés Kaufman), author Rajiv Joseph’s first instincts were his best: to get the tiger (played by Robin Williams) talking, and to allow us to see the mayhem in Iraq through his green eyes. But, at an early point in the play, “Bengal Tiger” takes a strategic turn, and tigerosity gives way to verbosity. The tiger is now a ghost, and neither he nor Williams reemerges from the trap of abstraction in which the playwright snares them. “Bengal Tiger,” which was nominated for a Pulitzer Prize, may work on the page, but it is numbing and listless on the stage. It’s arbitrary in its construction, haphazard in its characterizations, and vague in its moral argument. In Rob Ashford’s inspired revival of “How to Succeed in Business Without Really Trying” (by Abe Burrows, Jack Weinstock, and Willie Gilbert, with music by Frank Loesser), we watch with delight as J. Pierpont Finch (Daniel Radcliffe) rises by cunning degrees from window washer to chairman of the board. Every nanosecond of this well-cast production is eloquent with craft and wit. But the laurels of the evening go to Radcliffe and the towering John Larroquette, as the boss, J. B. Biggley. Radcliffe’s youthful brightness is a perfect foil for Larroquette’s dopey severity. Radcliffe is having the time of his life; you feel his joy.\n\nJohn Lahr, The Theatre, “Tooth and Claw,” The New Yorker, April 11, 2011, p. 76\n\nYou can also buy online access to a single issue. Individual back\nissues are available for sale through our customer-service department, at 1-800-825-2510.\n\nAll articles published before May, 2008, can be found in “The Complete New Yorker,” which is available for purchase on hard drive and DVD. Most\nNew Yorker articles published since December, 2000, are available through Nexis.\n\nTo search for New Yorker cartoons and covers, visit the\n Cartoon Bank.\n\nMore news, politics, culture, business, and technology:\n\n© 2013 Condé Nast. All rights reserved\n\n Use of this site constitutes acceptance of our User Agreement (effective August 1, 2011) and Privacy Policy (effective August 1, 2011).\n \n Your California Privacy Rights \n The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.",
  "isFullReview": true,
  "textWordCount": 396,
  "archivePath": "data/archives/reviews/how-to-succeed-in-business-without-really-trying-2011/newyorker--john-lahr_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:51:15.972Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20130703140217",
  "archiveOrgUrl": "http://web.archive.org/web/20130703140217/http://www.newyorker.com/arts/critics/theatre/2011/04/11/110411crth_theatre_lahr",
  "wordCount": 396,
  "tierReason": "Full review text"
}