{
  "showId": "how-to-succeed-in-business-without-really-trying-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "http://www.variety.com/review/VE1117944907",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Radcliffe, the 21-year-old Brit who spent half his life as Harry Potter before starring in 'Equus' at the West End and on Broadway, has undergone a crash course in singing, dancing and mugging. Turns out he is proficient at the first, surprisingly adept at the second and especially good at the third.",
  "bwwScore": 9,
  "contentTier": "complete",
  "fullText": "Bright and irresistible revival of the 1961 smash \"How to Succeed in Business Without Really Trying\" features a dazzling Daniel Radcliffe and a strong Broadway debut for John Larroquette.\n\nAfter their problematic if strong-selling 2010 production of “Promises, Promises,” director-choreographer Rob Ashford and lead producers Broadway Across America and Craig Zadan/Neil Meron take a clear step forward with this bright and irresistible revival of the 1961 smash “How to Succeed in Business Without Really Trying.” Featuring a dazzling Daniel Radcliffe and a strong Broadway debut for John Larroquette, “Business” takes its place at the executive level in a season of musical-comedy hits.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Battlefield 6' Launch Drives Record Sales for Electronic Arts in Latest Quarterly Earnings \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Take-Two Pauses 'Borderlands 4' Nintendo Switch 2 Release; CEO Addresses Pulling 'GTA Online' User-Created Charlie Kirk Mission\n\nRadcliffe, the 21-year-old Brit who spent half his life as Harry Potter before starring in “Equus” at the West End and on Broadway, has undergone a crash course in singing, dancing and mugging. Turns out he is proficient at the first, surprisingly adept at the second and especially good at the third.\n\nWhile hardly the evening’s only asset, the young actor shines as J. Pierrepont Finch, the ambitious window-washer who rises from mailroom to executive suite. Radcliffe makes the role (which originally catapulted Robert Morse to fame) look easy, but it’s not; just ask Matthew Broderick, who headed the show’s mirthless 1995 revival. That production made the piece look weary and faded; in director Rob Ashford’s hands, “How to Succeed” springs back to life.\n\nLarroquette makes a gruff and funny J.B. Biggley, with the humor only heightened by his coincidental resemblance to Bernie Madoff. Newcomer Rose Hemingway is a delicious Rosemary, displaying sweet innocence mixed with an underlying sense of just what is going on in this ’60s world of big business. Christopher J. Hanke scores as the cartoon villain Bud Frump; Rob Bartlett is a delight in his twin roles; and Tammy Blanchard, Mary Faber, Ellen Harvey and Michael Park all add to the fun. CNN commentator Anderson Cooper provides the wry narration.\n\nThe humor in Abe Burrows’ book sparkles with satiric jabs that still ring true 50 years later. Loesser’s score is a case study in how to write musical comedy; if no titles stand out other than “The Brotherhood of Man” and “I Believe in You,” that’s because the well-crafted songs are designed to support the laff pyramid.\n\nAshford’s choreography works up a full head of steam in “The Brotherhood of Man”; what makes the dance so exhilarating is that the director plunks his leading man at the apex of the dancing wedge, and Radcliffe more than holds his own. But other numbers have been reinvented in an awkward manner, and Ashford has a tendency to take perfectly crafted book songs and add athletic dancers doing impressive-but-distracting steps, blunting the authors’ work.\n\nThe sets — which in the original production added to the merriment — are here merely functional, typified by the drab collection of “Hollywood Squares”-type cubicles upstage. The costumes, too, disappoint; those “Paris Original” dresses, which rep one of Burrows’ best gags, are supposed to be bitingly satiric but are here merely ghastly.\n\nStill these production lapses are easily overlooked, thanks to the ministrations of the expert cast led by Radcliffe, who repeatedly brings down the house with a smile and a barely raised brow.",
  "isFullReview": true,
  "textWordCount": 564,
  "archivePath": "data/archives/reviews/how-to-succeed-in-business-without-really-trying-2011/variety--steven-suskin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:47:15.982Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 564,
  "tierReason": "Full review text",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Broadway-Review-Roundup-HOW-TO-SUCCEED-IN-BUSINESS-20110327"
}
