{
  "showId": "a-view-from-the-bridge-2010",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2015/11/13/theater/review-a-view-from-the-bridge-bears-witness-to-the-pain-of-fate.html?_r=0",
  "playbillVerdictUrl": "http://www.nytimes.com/2015/11/13/theater/review-a-view-from-the-bridge-bears-witness-to-the-pain-of-fate.html?_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "https://www.nytimes.com/2015/11/13/theater/review-a-view-from-the-bridge-bears-witness-to-the-pain-of-fate.htmlShare full article82Advertisement\n\nThis must be what Greek tragedy once felt like, when people went to the theater in search of catharsis. Ivo van Hove’s magnificent reconception of Arthur Miller’s “A View From the Bridge,” which opened on Thursday night at the Lyceum Theater, takes you into extreme emotional territory that you seldom dare visit in daily life.\n\nAt the end of its uninterrupted two hours, you are wrung out, scooped out and so exhausted that you’re wide awake. You also feel ridiculously blessed to have been a witness to the terrible events you just saw.\n\nMr. van Hove, a Belgian director who has become the contemporary theater’s most celebrated exponent of maximal minimalism, has stripped stark naked Miller’s 1956 drama of a self-imploding Brooklyn longshoreman. And what he and his cast, led by the astonishing Mark Strong, find beneath the play’s period trappings and kitchen-sink naturalism is a pure primal force. In this centennial year of Miller’s birth, his exalted notion that classic tragedy and the common man can indeed coexist has never seemed so organic.\n\nThough this production was greeted with hosannas when it was staged in London last year at the Young Vic Theater, before transferring to the West End and winning an Olivier Award for best revival, another Broadway version of “Bridge” hardly felt necessary. Gregory Mosher’s first-rate revival, starring Liev Schreiber and Scarlett Johansson, was only five years ago.\n\nYet as fine as it was, that interpretation also seemed to confirm the conventional perception that for all its raw strength, “Bridge” is an imperfect work, awkward in its aspirations to timeless grandeur. After all, it is framed by the self-conscious recollections of a Brooklyn lawyer, who speaks as ponderously of inexorable fate as any Greek chorus ever did.\n\nPerhaps the most startling accomplishment of Mr. van Hove’s “Bridge” is that it not only justifies Miller’s use of this character, Alfieri, but also makes him absolutely essential to our experience of the play. Portrayed by Michael Gould, Alfieri becomes our conduit into a world where irrational passions trump even the instinct to survive. That’s the world of the dockworker Eddie Carbone (Mr. Strong), and the wife he loves too little (Nicola Walker) and the niece he loves too much (Phoebe Fox).\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 399,
  "archivePath": "data/archives/reviews/a-view-from-the-bridge-2010/nytimes--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T14:08:48.937Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 399,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2015 outside valid range 2007–2012 for show opening 2010"
}