{
  "showId": "parade-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2023/03/16/parade-an-american-tragedy-stunningly-musicalized/",
  "publishDate": "2023-03-16T21:55:28",
  "fullText": "Parade has triumphantly marched back. The 1999 succès d’estime by Alfred Uhry and Jason Robert Brown, directed by co-conceiver Harold Prince, won writing Tonys but little favor from a public taken aback by the application of song and dance to a real-life turn-of-the-last-century nightmare: the trial, conviction, and eventual lynching of Jewish businessman Leo Frank for the murder of adolescent factory worker Mary Phagan. Over the last 25 years, we’ve become more used to musicals handling difficult subject matter, and our current red state/blue state polarization has perhaps made us readier to explore the historical roots of that divide. In any event, Michael Arden’s acclaimed 2022 concert staging at New York City Center now arrives on Broadway as welcome as it is provocative.\n\nProducing Parade requires finding a balance between its two parallel narratives, lightly connected by the theme of loyalty. Of central interest is the gradual transformation of a marriage of convenience into that of true partnership, and Ben Platt slides easily into the role of the accused, a fussy transplanted Brooklynite contemptuous of the vulgarian Southerners he’s surrounded by and fighting, in his mind, a solo battle. The heavy lifting goes to Micaela Diamond as unappreciated wife Lucille Frank, the railroading of whose husband brings out enough unexpected toughness to confront authority in search of justice.\n\nThe process by which the scales drop from Leo’s eyes is told by Brown in song, and beautifully executed here. Platt’s insistent vibrato, so ubiquitous in his signature Dear Evan Hansen power ballads, serves him well in transitioning from passionate self-righteousness to the recognition that this woman means everything to him. And Diamond evokes all the delicacy and strength needed for the bitter, despairing “Do It Alone, Leo” down to the Franks’ climactic discovery of missed opportunity in “All the Wasted Time.” Barbara Cook was our premier interpreter of character in song, and I can’t help but think she would be proud of Diamond’s continuing in that tradition.\n\nAt the same time, there’s a societal indictment to be filed, in terms of the part played in this travesty of justice by Lucille’s fellow Georgians. Uhry — long our Bard of the strains between that part of the country and Judaism, in his celebrated Driving Miss Daisy and underrated The Last Night of Ballyhoo — locates their prejudices in the steadfast loyalty to a long-vanished (if it ever existed) Southern ideal, introduced in the chilling opening chorale “The Old Red Hills of Home” and woven in and out of Brown’s score thereafter, along with samples of “Dixie” and “Camptown Races.” Honor requires that the sons and daughters of the Confederacy always be in the right; in this mindset, women are to be venerated and outsiders reviled. So if the young girls at the pencil factory say their manager trifled with them, they’re unquestionably believed. And if prosecutor Hugh Dorsey (Paul Alexander Nolan) sees homicide in the so-called bulging eyes of the Jew Frank, then no other suspects need be considered. The groupthink has spoken.\n\nIt would be easy to portray the citizens of Marietta and Atlanta as a more or less faceless mob, and I’ve seen them so staged. But perhaps because of his own acting career, Arden has been masterly at infusing ensemble roles with vivid life in his revivals of Spring Awakening and Once on This Island. He outdoes himself here, permitting every cast member to make a strong impression beginning with conscience-driven Governor Slaton (Sean Allan Krill) and his loyal wife, Sally (Stacie Bono), a relationship in deft contrast to the Franks’ chaos. The flirtation of Frankie Epps (Jake Pedersen) with poor Mary Phagan (Erin Rose Doyle) is a sweet preamble to the tragedy to follow.\n\nHousekeeper Minnie McKnight (Danielle Lee Greaves) practically keens in grief over her false testimony damning Leo, while Jim Conley (Alex Joseph Grayson) swaggers through his in two stunning tours-de-force, first in court (“That’s What He Said”) and later on a chain gang in the implacable call-and-response “Feel the Rain Fall.” For their part, the Slatons’ house servants, Angela (Courtnee Carter) and Riley, (Douglas Lyons) make the most of their scathing Act Two opener about the “A Ramblin’ and a Rollin'” coming up because of a little white girl’s murder, too aware that nothing much would be happening had Mary Phagan looked like them. The piece’s villains — Nolan; Manoel Felciano’s crusading bigot; Jay Armstrong Johnson’s bibulous reporter — can’t do much outside of their stock functions, but they at least sidestep moustache-twirling menace while reinforcing the notion of people trapped within their environment’s expectations.\n\nThat environment is inescapable, in fact, thanks to the production’s singular visual motif, vintage black-and-white photos marshaled by designer Sven Ortel onto a vast video wall, not unlike those immersive rooms in which you meander through Van Gogh’s paintings. Each historical character is identified and pictured when those playing them first appear, along with scenes of all the story’s actual locations. If Dane Laffrey’s scenic contribution is somewhat cluttered around the central playing platform, the eye-pleasing projections consistently unify the action and ground us in the storytelling’s veracity. We’re never permitted to distance ourselves from the prejudice and blind hatred that tribalism fosters. And thank God for that, because when we forget past injustices we’re doomed to repeat them.\n\nParade opened March 16, 2023, at the Bernard B. Jacobs Theatre and runs through August 6. Tickets and information: paradebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2023/03/16/parade-ben-platt-turns-provocative-musical-into-surefire-hit/"
}
