{
  "showId": "the-play-that-goes-wrong-2017",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2017/04/02/theater/review-the-play-that-goes-wrong-review.html?_r=0",
  "playbillVerdictUrl": "https://www.nytimes.com/2017/04/02/theater/review-the-play-that-goes-wrong-review.html?_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "web-search",
    "bww-roundup"
  ],
  "fullText": "https://www.nytimes.com/2017/04/02/theater/review-the-play-that-goes-wrong-review.htmlShare full article6464Advertisement\n\nWhen your world — or, as it often seems these days, the world — is falling apart, there’s perverse comfort in watching things go smash in a safe, contained environment. (And no, the White House doesn’t qualify.) Such is the brutal allure of monster truck jams, videos of toddlers falling off trikes and steel-cage wrestling matches.\n\nThat is also the appeal of Mischief Theater’s “The Play That Goes Wrong,” which opened on Sunday at the Lyceum Theater and is as close to a demolition derby as we are likely to see on Broadway. This knockabout farce out of London, where it has been running for more than two years and won the Olivier Award for best comedy, is devoted entirely to destroying itself before your eyes.\n\nSo take a long look at the uncurtained stage when you arrive. You will see a tacky, cheerful simulacrum of a classically creepy English manor drawing room. (Nigel Hook did the self-immolating set.)\n\nNow try to envision the ways that this set, which ominously includes an upstairs and an elevator, might be violently dismembered by a cast of really bad, really clumsy actors. Whatever visions of chaos your imagination summons, the odds are that this show’s artfully hapless team will exceed them.\n\nBy now, you should have read enough to know whether “The Play That Goes Wrong” is for you or not. If you feel that it is, be advised that it is perfectly O.K., and possibly preferable, to see it after a couple of drinks or in the glazed condition that comes from too many sleepless nights.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 291,
  "archivePath": "data/archives/reviews/the-play-that-goes-wrong-2017/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T19:28:58.732Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203852",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203852/https://www.nytimes.com/2017/04/02/theater/review-the-play-that-goes-wrong-review.html?_r=0",
  "textIssues": [
    "Word count too low: 291 (min: 300)"
  ],
  "contentTier": "needs-rescrape",
  "wordCount": 291,
  "tierReason": "Short text (291 words)",
  "bwwExcerpt": "I propose putting your rational mind into sleep mode, the better to savor tickling images of order-inverting bizarreness, straight out of Dada, in which suddenly nothing is in its customary place or being used for its customary purpose. There's a wild, redeeming poetry in such anarchy. My audience, for the record, roared as loudly as the crowds at any wrestling match.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-PLAY-THAT-GOES-WRONG-Attempts-to-Open-on-Broadway-Updating-Live-20170402",
  "rejectedAt": "2026-02-07T11:36:11.485Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The text cuts off mid-review with a technical error message about retrieving content and enabling JavaScript, making it impossible to determine the critic's verdict or recommendation.; openai: The text provided is incomplete and includes a retrieval error message, making it unsuited for scoring.",
  "promptVersion": "5.2.0",
  "publishDate": "April 3, 2017"
}
