{
  "showId": "the-play-that-goes-wrong-2017",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "http://variety.com/2017/legit/reviews/the-play-that-goes-wrong-review-broadway-1202019860/",
  "playbillVerdictUrl": "http://variety.com/2017/legit/reviews/the-play-that-goes-wrong-review-broadway-1202019860/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The show must go on — but in the Broadway transfer of West End hit “The Play That Goes Wrong,” forgotten lines, lost props, technical gaffes and rebellious scenery all seem to reply, \"Oh no it doesn't.\" This broad, silly and deliciously demented show, about a fictitious amateur theatrical group with great resilience and greater incompetency, is by the Brit trio of Henry Lewis, Jonathan Sayer and Henry Shields in a style that evokes \"Fawlty Towers\" with nods to Buster Keaton, Carol Burnett and Monty Python. Under the go-for-broke direction of Mark Bell, its high-energy cast is comic gold and manages to sustain, with a never-ending series of diversionary tactics, its one-joke concept.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nThe show isn't as elegant or as clever as that other hit British show-run-amuck farce, \"Noises Off!,\" whose last revival was seen on the Broadway just last season. “Wrong” isn’t interested in the relationship between its characters and the ones they portray in the play-within-a-play. It's more lowbrow, interested in the gag and shameless in how it gets it: sometimes incredibly inventively, but sometimes going for the low-hanging fruit. (A special nod goes to sound designer Andrew Johnson who created the various bonks, splats, and crashes.)\n\nThe play follows the woeful troupe as it tries to build a better mousetrap with its presentation of a dusty murder mystery, whose plot happily gets lost along the way as the production implodes. Though it could benefit from some cutting, the production is an idiot's delight. It should also prove a boon when it hits the provinces, despite engineering challenges of the screw-loose set ingeniously designed by Nigel Hook.\n\nIt's clear from the beginning — even before the beginning with its pre-show shtick — that wrong will be just right. But it takes a while before the laughs come at full speed.\n\nAmong the misguided characters in the play-within-a-play are a lively corpse (Greg Tannahill), an exasperated detective (Shields, in a performance that John Cleese might admire), a word-mangling butler (Sayer) who is, of course, in charge of the dense exposition, and a sound man (Ron Falconer) who is more interested in listening to Duran Duran than he is in the show at hand.\n\nThen there's novice actor Max (a sweetly loopy Dave Hearn), the bearish actor Robert (Lewis), a painfully shy stage manager (Nancy Zamit) who finds her calling when she is enlisted to act after Sandra (Charlie Russell), the female lead, becomes incapacitated in one of the play's most outrageous and hysterical bits.\n\nPity the replacement cast that succeeds this troupe, which has had years together perfecting its timing, physical gags and carefully choreographed mayhem. \"Break a leg\" could take on a whole new meaning.",
  "isFullReview": true,
  "textWordCount": 473,
  "archivePath": "data/archives/reviews/the-play-that-goes-wrong-2017/variety--frank-rizzo_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:53:10.115Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "duplicateTextOf": "variety--charles-isherwood.json",
  "contentTier": "complete",
  "wordCount": 473,
  "tierReason": "Full review text"
}