{
  "showId": "the-notebook",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2024/03/14/the-notebook-just-another-love-story-with-kleenex/",
  "publishDate": "2024-03-14T20:55:19",
  "fullText": "The spring parade of Broadway musicals is at the gate, seeking to curry huzzahs and premium ticket sales, with entrants lined up like helium balloons along Central Park West on the night before Thanksgiving. The first of this seven-week sprint to the finish (i.e., the Tony Award nomination deadline on April 25) is a professionally assembled emotion-tugger called The Notebook, derived from the popular 1996 novel by Nicholas Sparks and further popularized by a 2004 film version.\n\nThis is one of those musicals that some viewers will love vociferously while others, inevitably, espouse a decidedly contradictory view. There is enough quality entertainment on hand, especially from the performers, to provide viewers with a thoroughly watchable two-and-a-half hours. In normal Broadway seasons, when full-scale original musicals can be counted on a hand’s worth of fingers, these attributes might be enough to place The Notebook in the Tony winner’s circle, or at least in contention. But based on the 2023-24 musicals which have opened thus far and those which have already been seen in pre-Broadway mountings, one might predict that The Notebook will fall far above the worst but not in league with the best.\n\nThe notebook in question is a book within a book, if you will. Allie is suffering from dementia. A kindly elderly “friend,” who anyone with story sense will immediately realize is actually husband Noah, reads a story to her; not from a tattered paperback or late-model Kindle but from a leather-bound notebook. Soon enough, we also realize that what Noah is reading is not some popular novel like Sparks’ The Notebook or Erich Segal’s earlier and not dissimilar Love Story. Rather, this notebook tells the tale of the enduring romance between Allie and Noah, with which he hopes to engage her vanished memory.\n\nIt doesn’t, alas, quite work.\n\nHow to tell a story which spans 50 years, with the characters growing 50 years older (and/or younger) while the actual actors hardly age at all? Bookwriter Bekah Brunstetter (The Cake) and composer-lyricist Ingrid Michaelson (with numerous recording credits)—both making their Broadway and musical theatre debuts—have split each character into three. Directors Michael Greif and Schele Williams have seen fit to play many scenes with all of ’em standing on stage in color-coded costumes: Allie in shades of blue and white, Noah in denim with brown shirts or sweaters. The directors even have the actors hold their hands or simultaneously scratch their necks in the same manner at the same moment (as in the production photographs accompanying this review).\n\nNot so subtle, but under the circumstances necessarily so. In olden times, these roles would have been cast by actors who might—with the help of costumer and wigmaker—look more or less alike. (This goes back, at least, to Shakespeare’s mistaken-identity siblings in Twelfth Night and long-lost twins in The Comedy of Errors.) Nowadays, we are happy to see directors cast the best performers available for the parts. Here, though, the use of six actors in these two tripartite leading roles seems contrived, and to at least some audience members might be confusing.\n\nNobody is likely to complain about the presence of the great Maryann Plunkett in the role of what they call Older Allie. Plunkett’s years in Richard Nelson’s Rhinebeck plays have brought the actor deserved acclaim, although she has been a most winning performer since turning up 40 years ago as star replacement in the original productions of Agnes of God and Sunday in the Park with George. (For a treat, stop in your tracks and watch the YouTube video of Plunkett “Doin’ The Lambeth Walk,” and winning the 1987 Best Actress Tony, in Me and My Girl. End of digression.) Given the Notebook performances of Younger Allie (Jordan Tyson) and Middle Allie (Joy Woods), they are quite welcome as well.\n\nThe men in question range from strong (John Cardoza, of Jagged Little Pill, as Younger Noah) to good (Ryan Vazquez, a Hamilton replacement in Hamilton, as Middle Noah) to mild (Dorian Harewood, as Older Noah). Sharing top honors with Plunkett are Woods, who sings up a storm (as she did this winter as the femme fatale in I Can Get It for You Wholesale); and the always excellent Andréa Burns, in subsidiary roles as the head nurse and the mother of all those Allies. Also standing out and adding refreshing humor to the proceedings is Carson Stewart as Younger Noah’s friend and Older Noah’s physical therapist.\n\nGreif, whose resume includes such epochal entertainments as Rent and Dear Evan Hansen, here works with co-director Schelle Williams, whose production of The Wiz is loading in over at the Marquis. The choreography is by Katie Spelman. Set designers David Zinn and Brett J. Banakis provide one of those all-purpose unit sets featuring an upper bridge; if memory serves, this is not dissimilar in look to Greif’s Next to Normal and If/Then. Mixed with innovative design plus well-coordinated contributions from designers Ben Stanton (lights) and Lucy Mackinnon (projections), though, this physical production works far better than those of the earlier musicals. Paloma Young, one of today’s most inventive costume designers, provides those color-coded clothes.\n\nThe musical treatment is distinctive as well. Not so much the quality of the writing; the composer’s workable music is contrasted by sometimes tortured lyrics. (The refrain of the opening number rhymes, or tries to rhyme, “time, time, time” with “mine, mine, mine.” Repeatedly.) The orchestrations for ten players by John Clancy and Carmel Dean are heavy on strings and guitar strings, accented by only one reed (no brass) and with a luxuriant harp washing over the Schoenfeld. A most happy and fitting scheme for this moody memory musical, with lovely results from music director Geoffrey Ko and his players.\n\nThe Notebook arrives having scored a success at the Chicago Shakespeare Theater, and it does seem likely to generate significant enthusiasm here and in what are sure to be numerous regional and local productions across the country and abroad. But with Hell’s Kitchen, Suffs, Water for Elephants, The Outsiders, Cabaret, Lempicka, The Great Gatsby and more lapping at the gate, or at least the ticket wicket, this three-generation Kleenex-clutching weepie might get lost in the awards season rush.\n\nThe Notebook opened March 14, 2023, at the Gerald Schoenfeld Theatre. Tickets and information: notebookmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
