{
  "showId": "dana-h-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2021/10/17/dana-h-deirdre-oconnell-brilliant-in-lucas-hnaths-portrait-of-his-mother/",
  "publishDate": "2021-10-17T19:59:58",
  "fullText": "Maybe not the first observation to make about Dana H., playwright Lucas Hnath’s new piece, is that it contains an unforgettable feat. All the same, I’m going to observe it. Throughout, Deirdre O’Connell, a New York City actress not nearly as celebrated as she deserves to be, pulls off an unusually astounding accomplishment. (The awards she’s already amassed during her career must be near to collapsing a home shelf.)\n\nFor the overwhelming part of 80 minutes, O’Connell lip-syncs a testimony that playwright Hnath’s mother gave some time ago about her life, a life marked dramatically by a terrifying episode from which she still hasn’t recovered. For that matter, she isn’t entirely convinced it happened.\n\nIn giving testimony to Hnath’s not-seen-but-heard-on-tape friend Steve Cosson, Dana H. spoke—as people do when talking under duress—by stumbling over words, coughing, hesitating, uttering the occasion “um-er” equivalent, giving into embarrassed laughter, breathing warily.\n\nAt no time does O’Connell commit the slightest lip-synched mistake. As she delivers the lines (from elided tapes), she accompanies herself with appropriate gestures, often while paging through a manuscript she holds containing the harrowing 2013 memoir she was finally able to write about a central, five-month-long 1997 incident.\n\nSo yes, O’Connell is again offering her audience a tour de force commensurate with the accolades she received when Dana H. opened two years ago at the Vineyard.\n\nThat enthusiastically said, Hnath’s Dana H. does prompt some touchy questions. Notice that above I referred to it as a “piece,” which is a way of suggesting that an actor sitting in a chair for most of the hour and twenty minutes it takes to unfold doesn’t necessarily rise to the level of a play, On the other hand, Dana H. is certainly a something. But what exactly? Perhaps it validates itself sufficiently as a verbatim account of a dreadful event in one woman’s life, an experience representative of what might occur in a society ill-prepared to deal with these and other horrors visited on women. (For recent comparison, consult A German Life, Christopher Hampton’s adaptation of Joseph Goebbels’ chilling, emotionless secretary’s tale, as rendered by a sitting, non-lip-synching Maggie Smith.)\n\nAs Hnath presents it and director Les Waters carefully shapes it, Dana H. introduces herself as a chaplain recognized for her success with difficult patients as well as for her outstanding care at dying patients’ bedsides. Relieved of her duties when superiors hear of her impending divorce and follow company policy, she finds work elsewhere and is eventually brought into contact with suicidal Jim (no surname supplied).\n\nRecovering from the hideous but failed attempt to end his life, Jim retaliates by kidnapping Dana H., forcing her on a cross-country chase including multiple criminal acts. Having her purchase a gun—which he’s unable to undertake himself due to a criminal record—is only one of the episodes she endures. Purchasing ingredients for a bomb he eventually sets off is another. Declaring  her “favorite part,” Dana H. devotes much of her confessional time chronicling the worst act she underwent. That won’t be detailed here.\n\nExplaining how Jim constantly kept her by his side, Dana H. reports that even when Jim and she were briefly separated, he convinced her she was being watched. That she believed him, never attempting to make a run for it might pique some observers’ disbelief. Then again, others might call to mind Patty Hearst and the frightening Stockholm Syndrome.\n\nObviously, Dana H. is rescued from her living nightmare—there is an incident when she felt she was about to lose her life—but the situation lingers that Dana H. isn’t quite a play. Not that Hnath and director Waters don’t make a valiant try to clinch it. About two-thirds through the work the lights fade for several seconds and when they come up, O’Connell is gone and a pulsating lighting-and-sound interlude tales over—Paul Toben the lighting designer, Mikhail Fiksel on sound.\n\nFiksel increasingly piles loud and louder chunks of the Dana H./Cosson tapes one on the other. Toben rainbows the lights on set designer Andrew Boyce’s version of an anonymous hotel (motel?) room where at least one of the traveling tapes is recorded.\n\nPossibly, the foremost question a Dana H. spectator wants answered is the huh-why of Hnath’s exposing the hours of tapes his mother sat for. The likely answer is that he’s persuaded himself that the world needs to know about such daily atrocities. Dana does mention she found trying to get police attention futile. Yet, there remains a soupçon of humiliation in Hnath’s endeavor, this from a first-rate playwright who makes a policy of never repeats himself from play to play.\n\nIt seems likely that in Dana H., Hnath has his reasons for both allying himself with his mother and separating himself from her. Nonetheless, he has written a theatre piece that unmistakably demands considerable thought and even more unmistakably boasts Deirdre O’Connell’s unbounded talents.\n\nDana H. opened October 17, 2021, at the Lyceum Theatre and runs through November 28. Tickets and information: thelyceumplays.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-reviews"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://nystagereview.com/2021/10/17/dana-h-deirdre-oconnell-triumphs-in-a-survivor-story/",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "Maybe not the first observation to make about Dana H., playwright Lucas Hnath's new piece, is that it contains an unforgettable feat. All the same, I'm going to observe it. Throughout, Deirdre O'Connell, a New York City actress not nearly as celebrated as she deserves to be, pulls off an unusually astounding accomplishment. (The awards she's already amassed during her career must be near to collapsing a home shelf.) For the overwhelming part of 80 minutes, O'Connell lip-syncs a testimony that playwright Hnath's mother gave some time ago about her life, a life marked dramatically by a terrifying episode from which she still hasn't recovered. For that matter, she isn't entirely convinced it happened.",
  "bwwScore": 8
}
