{
  "showId": "dana-h-2021",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/dana-h-finally-on-broadway-mesmerizes-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/dana-h-finally-on-broadway-mesmerizes-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup",
    "bww-reviews"
  ],
  "bwwExcerpt": "O'Connell's performance was unlike anything I've ever seen on the stage. After the initial novelty of the lipsycing wears off, it becomes impossible to believe that O'Connell is not the one speaking these lines. Her performance is nuanced and never passive. Director Les Waters' staging is simple-Dana tells the story sitting in a comfy chair against the backdrop of a classic Floridan motel room (scenic design Andrew Boyce).",
  "bwwScore": 9,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-DANA-H-Opens-on-Broadway-20211017",
  "fullText": "Deirdre O'Connell in DANA H. | Photo: Chad Batka\n\n“Nothing was the way it was supposed to be…”\n\nSo says Dana Higginbotham, mother of playwright Lucas Hnath, via audio tape during Dana H., the astonishing new thriller which opened tonight at the Lyceum Theatre on Broadway.\n\nComposed entirely of interview clips conducted by Steve Cosson, the play is lip synced by actress Deirdre O’Connell. The play follows the distressing story of Higginbotham, a chaplain from Orlando who was abducted and held captive for 5 months in motels throughout the South in the late 90s. Dana’s captor was a troubled man named Jim whom she met at a psych ward after he attempted to take his own life. The story details the months of her captivity in excruciating detail weaved together by Hnath himself.\n\nO'Connell's performance was unlike anything I’ve ever seen on the stage. After the initial novelty of the lipsycing wears off, it becomes impossible to believe that O’Connell is not the one speaking these lines. Her performance is nuanced and never passive. Director Les Waters’ staging is simple—Dana tells the story sitting in a comfy chair against the backdrop of a classic Floridan motel room (scenic design Andrew Boyce).\n\nAt 75 minutes in length, there is absolutely no room for redundancy. Hnath’s ability to present this story with such concision is a testament to his skill as a storyteller. It would be easy for this piece to be a 7 hour podcast or true crime documentary and Hnath somehow manages to give us the payoff of those formats at breakneck speed. The pacing is marvelous. Hnath leaves almost no room for the audience to breathe. Having the play be composed of interviews, there is always a built-in level of safety for the audience. Ultimately, even in the back of our minds, we know Dana survives this torment and that allows Hnath to push the narrative to the very edge.\n\nThere’s always discussion about works that provide insight into a playwright's own life. Somehow offering this extremely personal trauma of his mother has offered a view into Lucas Hnath and his mind. By not including a version of himself in the play and by having the performance lip synced, Hnath doesn’t attempt to appropriate his mother’s story or sensationalize. Of course the story is sensational, but it’s all real. Hnath demonstrates such grace by allowing his mother’s words to affect us all.\n\nDana H. is a play unlike anything Broadway has seen before. Sprinkled throughout the piece are little moments of Dana reminding the audience that the story is true. It’s gentle and it’s mostly for her. She shows us tokens Jim gifted her and towards the end, she briefly explains how the events she just detailed have affected her ability to interact with the world. She explains that her story is so unbelievable and rooted in a reality that does not match the norm that she feels as though those around her cannot possibly relate to her in a meaningful way or without questioning her. Perhaps that is Hnath’s greatest gift to his mother: to present her story in a space of liminality where even the unbelievable is believable. After 18 months of true crime podcasts and TV shows at home, Dana H. expands the genre into the theatrical sphere and establishes itself as one of the best plays in the season.\n\nDana H. is in performance at the Lyceum Theatre on West 45th Street, where it plays in repertory with Is This A Room. For tickets and more information, visit here.\n\nOriginally from Southern California, Noah packed it up and relocated to the East Coast in 2014 to pursue a degree in theatre at Emerson College. He moved to New York in 2018 and has zero intention of leaving. Noah has a strong interest in Shakespeare and in opera and aspires to direct queer interpretations. His goal is to get booed off the stage at the Metropolitan Opera. In his spare time he can be found baking out of the Claire Saffitz cook book, reading, or sleeping.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 721,
  "archivePath": "data/archives/reviews/dana-h-2021/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:29:12.064Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251212010624",
  "archiveOrgUrl": "http://web.archive.org/web/20251212010624/https://www.theatrely.com/post/dana-h-finally-on-broadway-mesmerizes-review",
  "contentTier": "complete",
  "wordCount": 721,
  "tierReason": "Full review text"
}
