{
  "showId": "an-act-of-god-2016",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "http://www.ew.com/article/2015/05/28/jim-parsons-an-act-of-god-broadway-ew-review",
  "playbillVerdictUrl": "http://www.ew.com/article/2015/05/28/jim-parsons-an-act-of-god-broadway-ew-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\nTop Stories\n\n1\n\nPenn Badgley reacts to Joe’s last words in 'You' finale\n\n2\n\n'Drag Race' star Jiggly Caliente dies at 44\n\n3\n\n'Mobland' recap: A key character gets killed\n\n4\n\nJay Leno describes awkward visit to David Letterman's house\n\nJim Parsons in 'An Act of God' on Broadway: EW review\n'Big Bang Theory' star amuses in a less-than-divine new comedy\n\nIn An Act of God—now playing at Broadway’s Studio 54 through Aug. 2—Jim Parsons plays the titular creator of the universe. Or rather, if one believes the explanation offered by God at the start of this comedy by former Daily Show head writer David Javerbaum, He has chosen to inhabit the form of “beloved television star” Jim Parsons. “The irony of him starring in a show called The Big Bang Theory—I couldn’t resist!”, it is explained early on.\n\nWhy has God decided to appear on Broadway? Partly because He wants to speak directly to the Jewish people (that’s God’s stereotype, not mine) and partly to dispense a new Ten Commandments, God having grown weary of the original bunch “in exactly the same way that Don McLean has grown weary of ‘American Pie'”. This second set of rules, whose unveiling comprises the bulk of the 90-minute show, features holdovers such as “You Shalt Have No Other Gods Before Me,” and newbies, such as the pro-gay sex “Thou Shalt Not Tell Others Whom To Fornicate,” but all inspire humorous ruminations which collectively cover an extremely disparate array of topics. That list includes The Book of Job (“It’s funnier than both The Book of Mormon and The Book of Mormon“), masturbation (“The reason [it’s] a sin is not that it’s intrinsically evil but. It’s that every time you do it, I have to watch”), and Bruce Jenner (“The first Kardashian woman I can actually tolerate”).\n\nThere is no shortage of jokes, and the hit rate is high, my personal favorite being Parsons’ note-perfect harassment of some audience latecomers: “I’ll tell you this, you’re lucky I’m God and not Patti LuPone.” Indeed, the Big Bang star makes for a surprisingly believable ultimate being, doubly so as God’s psychological issues make themselves (Themselves?) increasingly evident.\n\nThe problem is that, for a Broadway show, this isn’t much of a Broadway show. If God really is in the house, would it have killed the Supreme Being who whipped up the Earth and sky to produce a few dancing girls, metaphorical or otherwise? God does have a couple of helpers in the literally angelic forms of Christopher Fitzgerald’s audience-roaming Michael and Tim Kazurinsky’s Commandment-announcing Gabriel. But this is still essentially a stand-up routine—make that a sit-down one, given the amount of time God spends lounging on a sofa on the spare, all-white set. As a theatrical spectacle, An Act of God is the anti-Wicked, which is a surprise given the shows share a director in Joe Mantello. May we suggest another commandment? Thou Shalt Not Charge Broadway Ticket Prices To See Jim Parsons Tell Jokes—no matter how beloved He mightest be. B–",
  "isFullReview": true,
  "textWordCount": 506,
  "archivePath": "data/archives/reviews/an-act-of-god-2016/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:08:44.622Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250428212829",
  "archiveOrgUrl": "http://web.archive.org/web/20250428212829/https://ew.com/article/2015/05/28/jim-parsons-an-act-of-god-broadway-ew-review/",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 506,
  "tierReason": "Full review text"
}