{
  "showId": "an-act-of-god-2016",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Unknown",
  "url": "http://www.theguardian.com/stage/2015/may/29/an-act-of-god-review-jim-parson-plays-the-deity",
  "playbillVerdictUrl": "http://www.theguardian.com/stage/2015/may/29/an-act-of-god-review-jim-parson-plays-the-deity",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Studio 54, BroadwayThe almighty manifests himself on the Great White Way, offering to explain the nature of existence – with gags. It’s a promising genesis for a show, but we need more revelations Blessed art thou, the Lord our God, king of the universe. And hey, congratulations on thy Broadway debut in An Act of God. It seems strange that thou, ancient of days, are opening in May, a notoriously slow month in the Broadway calendar. Was this another one of those weird bets with Satan? And OK, admittedly, I wasn’t expecting thou to choose Jim Parsons of The Big Bang Theory as an avatar. Was Mandy Patinkin not available? Or Nathan Lane? Surely, Bill Nighy could use a break from all that spaghetti and misery in Skylight. Well, as thou explainest: “In the desert I appeared as a burning bush. On Broadway, I appear as Sheldon Cooper.” Thou hast always worked in mysterious ways. Studio 54 doesn’t seem like a place that thou wouldst set up shop. (Oh, wait, dost thou love disco? Because honestly, that would explain so much. Didst thou have a hand in Funky Town?) Guessing thou delegated the angels (and Scott Pask) to handle the set design. Because a giant hard-boiled egg that also resembles an ivory vagina doesn’t seem like thy style. Thou hast developed a top-down management style and a tradition of afflicting lesser beings with frogs and boils, so it’s nice that thou and thy director Joe Mantello conceived of An Act of God as a public forum. That the archangel Michael (Christopher Fitzgerald) reads the minds of audience members rather than handing them the microphone reduces thy opportunities to use thy almighty powers of improvisation, though thou dost have a way with latecomers and infidel cellphones. “You people are lucky I’m God and not Patti LuPone,” thou sayest. If you’ll forgive me, oh Lord of hosts, though this play is billed as a chance to ask “any questions that arise regarding the nature of existence, that I may deign to answer them and enlighten thee”, as justifying the ways of God to man go, this is not exactly Paradise Lost. The main thrust: God often goes into “ethereal-hover mode” while he lets humanity roll along and while he does have a divine plan, “I’m not afraid to riff. Go with the flow.” Which goes a long way toward making sense of the narwhal and several varieties of Haribo sweets. And listen, please don’t take this the wrong way, because thou hast a habit of turning thy doubters into pillars of salt, but couldn’t this have been funnier? Yes, the script, written by thou and Daily Show head writer David Javerbaum, has plenty of jokes and some of them are good, but there are long passages, like thy retelling of the story of Abraham and Isaac that don’t go anywhere. With the source material on hand (have you read the Bible lately?) this could have been rib-bruisingly hilarious rather than merely chucklesome. And thy pacing is pretty draggy. Concluding the show with the new commandment “Thou shalt believe in thyself!” feels a little new agey for an old God like you. Not that you look your age! Not at all! That Parsons, a charmer, looks like he’s barely out of swaddling clothes, and he gets able support from Michael and Gabriel (Tim Kazurinsky). If this show isn’t all it’s cracked up to be, maybe thou couldst think about a follow-up version in a couple of years. I know thou lovest a sequel. But really, thou hast the heavens and the Earth, so thou dost not need to read thy theatre reviews, right? Right? We hope you appreciated this article. Before you close this tab, we want to ask if you could support the Guardian at this crucial time for journalism in the US. In his first presidency, Donald Trump called journalists the enemy; a year into his second term, it’s clear that this time around, he’s treating us like one. From Hungary to Russia, authoritarian regimes have made silencing independent media one of their defining moves. Sometimes outright censorship isn’t even required to achieve this goal. In the United States, we have seen the administration apply various forms of pressure on news outlets in the year since Trump returned to office. One of our great disappointments is how quickly some of the most storied US media organizations have folded when faced with the mere specter of hostility from the administration – long before their hand was forced. While private news organizations can choose how to respond to this government’s threats, insults and lawsuits, public media has been powerless to stop the defunding of federally supported television and radio. This has been devastating for local and rural communities, who stand to lose not only their primary source of local news and cultural programming, but health and public safety information, including emergency alerts. While we cannot make up for this loss, the Guardian is proud to make our fact-based work available for free to all, especially when the internet is increasingly flooded with slanted reporting, misinformation and algorithmic drivel. Being free from billionaire and corporate ownership means the Guardian will never compromise our independence – but it also means we rely on support from readers who understand how essential it is to have news sources that are immune to intimidation from the powerful. We know our requests for support are not as welcome as our reporting, but without them, it’s simple: our reporting wouldn’t exist. Of course, we understand that some readers are not in a position to support us, and if that is you, we value your readership no less. But if you are able, please support us today. All gifts are gratefully received, but a recurring contribution is most impactful, helping sustain our work throughout the year ahead (and among the great benefits, we’ll show you far fewer fundraising requests like this). It takes just 37 seconds to give. Thank you for protecting the free press. Written in an extremely irritating fashion. Would have liked to read an actual review rather than thou, dost, etc etc over and over again. It's like the feeling you get of being 'punched in the eye repeatedly' when someone overuses exclamation marks throughout their written text. This show will have to be respectful of the more popular superstitions.",
  "isFullReview": true,
  "textWordCount": 1062,
  "archivePath": "data/archives/reviews/an-act-of-god-2016/guardian--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:08:52.149Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 1062,
  "tierReason": "Full review text"
}