{
  "showId": "an-act-of-god-2016",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/sean-hayes-an-act-god-864395/",
  "publishDate": "May 29, 2016",
  "fullText": "Act of God Production Still - H 2016\n\nNo offense to Sean Hayes, but when most of us picture God, we don't picture the \"beloved star of stage and screen,\" as he describes himself in the early moments of An Act of God. It doesn't really matter who we picture since God has chosen to manifest himself through Hayes because they're both at William Morris. He explains this in one of many catered adjustments to the hit Broadway comedy, now in Los Angeles. Assembled by playwright David Javerbaum from his @TheTweetOfGod feed and his book, The Last Testament: A Memoir By God, this divine comedy proves the former Daily Show writer is worth his 13 Emmy wins. It has devilishly funny gags and clever insights that hit more often than they miss.\n\nDesigner Scott Pask might have been inspired by light-and-space artist James Turrell in creating God's foyer, a staircase ascending through arcs of pastel shades (courtesy of lighting designer Hugh Vanstone) to a circular opening on brisk-moving clouds against a crisp blue sky. Hayes as God sits on a banquette downstage, where he’s administered by a pair of angels, Gabriel (James Gleason) and Michael (David Josefsberg).\n\nIt’s no surprise the Almighty hates L.A., but he loves celebrities, who he says are just like him: “Adored, pampered and tantrum-prone.\" Who knew the Heavenly Father could be so insouciant? And witty? Though you might have expected it, given he invented both. Through the course of the evening, the King of Kings is petulant, vain and petty when pushed, as when he smites a wing from Michael for pressing him about whether or not he answers prayers. \"I made mankind in my image, and I'm an asshole,\" he explains.\n\nThe updates are as current as Ted Cruz's Iowa caucus win, El Nino and, of course, the Donald — \"Why is Donald Trump allowed to roam the earth?!\" he demands. Javerbaum structures his comedy around one of the Creator's greatest hits, the Ten Commandments, which has been revised with new edicts like \"Thou shalt not kill in my name\" and \"Thou shalt not tell others whom to fornicate,\" whereby he dispels the notion that he's homophobic by recasting Adam and Eve as Adam and Steve. \"You shall not lie with a man as with a woman,\" he explains, is simple advice on effective prevarication.\n\nAn Act of God owes some debt to Mel Brooks' 1961 classic 2000 Year Old Man, in which Carl Reiner interviews Brooks' miraculously preserved antediluvian about the first spoken language (Basic Rock), dating Joan of Arc and mankind's greatest invention (cellophane), among other things. Both are modest comedies that rely on ribald language and the subversion of long-held truths. But one of the main differences is that Brooks' piece runs 30 minutes while Javerbaum's runs 90. What might have originated as a \"Shouts and Murmurs\" column in the pages of The New Yorker feels fattened up for the main stage, especially when pacing flags as God launches into a serious retelling of Abraham and Isaac.\n\nUnder veteran Joe Mantello’s direction, Hayes has no problem slipping into the white robes of the All Powerful, a role that requires comedic timing and attitude, attributes audiences associate with the actor since his days playing narcissist Jack McFarland on Will & Grace. Here, he offers a personable charm enabling him to cut to the quick during God's more wrathful moments, then smooth things over with a smile.\n\nWhen the last commandment finally comes, it lands as a self-help bromide from the ‘70s: \"Thou shalt believe in thyself.\" \"You are my greatest creation. And I am your worst,\" he preaches. It may or may not be sentiments like this that kept Javerbaum's book from U.K. bookshelves. But while most of its jokes might not slay them in heaven, An Act of God is funny as hell.\n\nVenue: Ahmanson Theatre, Los Angeles\n Cast: Sean Hayes, David Josefsberg, James Gleason\n Director: Joe Mantello\n Playwright: David Javerbaum\n Set designer: Scott Pask\n Lighting designer: Hugh Vanstone\n Costume designer: David Zinn\n Music: Adam Schlesinger\n Sound designer: Fitz Patton\n Presented by Jeffrey Finn, The Shubert Organization, Carl Moellenberg, Roy Putrino, Adam Zotovich, Arielle Tepper Madover, Stacey Mindich, Grove Entertainment, Bob Boyett, Richard Winkler, FG Productions, Marco Gomez, Jay & Cindy Gutterman, Jamie Kaye-Phillips, Corinne Hayoun, Denver Center for the Performing Arts",
  "isFullReview": true,
  "dtliExcerpt": "The show is intermittently funny, but it's also repetitive and one-note, with limited comic range despite the rich satirical possibilities of its premise.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The show is intermittently funny, but it's also repetitive and one-note, with limited comic range despite the rich satirical possibilities of its premise.",
  "contentTier": "complete",
  "contentTierReason": "Short text (23 words)",
  "previousUrl": "https://www.hollywoodreporter.com/news/general-news/an-act-god-broadway-review-892016/",
  "urlDiscoveredAt": "2026-02-03T08:51:13.213Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 721,
  "archivePath": "data/archives/reviews/an-act-of-god-2016/hollywood-reporter--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:51:13.217Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230208014049",
  "archiveOrgUrl": "http://web.archive.org/web/20230208014049/https://www.hollywoodreporter.com/news/general-news/sean-hayes-an-act-god-864395/",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 721,
  "tierReason": "Full review text"
}