{
  "showId": "an-act-of-god-2016",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2016/legit/reviews/an-act-of-god-review-sean-hayes-1201703755/",
  "publishDate": "May 29, 2016",
  "fullText": "Ash Wednesday, the Christian calendar's annual reminder of life's transitory nature, seems a provocative choice for unveiling \"An Act of God\" at the Ahmanson. But if offense was intended, none need be taken. Faithful and nonbelievers alike should find pleasure, and even food for thought, in the Supreme Being's admonitions, insights and sheer gags as transcribed by David Javerbaum and presented by Sean Hayes under Joe Mantello's direction. If you're anything like the opening night audience, you'll laugh your ash off.\n\nThe premise is simple enough. God has decided to inhabit the person of \"Will & Grace\" star Hayes — much as He did last year on Broadway with Jim Parsons of \"Big Bang Theory\" — with the aim of presenting a revised set of Ten Commandments, to clear up all the muddles we've found ourselves in since Moses received the Word.\n\n\"Thou shalt not take My name in vain\" is a holdover — we have to stop assuming divine interest in sporting event outcomes, for instance — but \"Thou shalt not tell Me what to do\" is a new one. \"Don't tell me what to bless!\" God insists. \"That goes triple for sneezing.\" There's probably a special place in Hell for critics who reveal too many jokes, but that's a pretty good example of the method throughout: Hit 'em with some solid advice, and toss in a badump-bump punchline. (God also has a hidden, personal purpose, snuck in as a latter-half bid for seriousness that comes across as more than a little strained.)\n\nFor a backdrop, set designer Scott Pask has conjured up an impressive Art Deco-futuristic mashup, with a miniature Hollywood Bowl shell and a set of illuminated \"American Idol\" steps leading down to...why, it's a couch, isn't it? Not unlike the one occupied by Bette Midler as Sue Mengers in \"I'll Eat You Last,\" also directed by Mantello.\n\nAnd Hayes has a lot in common with Midler's Mengers in his chatty affect, dishing on the truth about the Garden of Eden. The Lord is utterly unembarrased about — and even takes pride in — the plagues he's inflicted on mankind. (The lowdown on the Noah story and the Book of Job is especially potent.) Hayes finds a good balance between preening and humility, without which even the Lord God might prove a bit much.\n\nHe's also picked up Dame Edna's penchant for passive-aggressive audience assaults, merrily waving to Ahmanson balcony dwellers while assuring the higher-paying orchestra they're the chosen people. The Archangel Michael (David Josefsberg) serves as roving reporter to read spectators' minds for a contentious Q&A, while Gabriel (James Gleason) remains on stage as a sort of ethereal Ed McMahon, quoting selected Bible passages to spur God's musings.\n\nJaverbaum owns enough Emmys for writing \"The Daily Show\" to stage the Last Supper, and fans of the Comedy Central standby will feel right at home with \"An Act of God.\" The Lord and Jon Stewart prove to be impelled by the same motives — namely, puncturing self-righteousness and calling for fundamental common sense. As exasperated as each becomes with us, we're reassured there's hope for us yet if we just behave ourselves.",
  "isFullReview": true,
  "dtliExcerpt": "The show works best when Martin keeps the tone light and conversational, as if he's having a friendly chat with the audience about the mysteries of existence.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The show works best when Martin keeps the tone light and conversational, as if he's having a friendly chat with the audience about the mysteries of existence.",
  "contentTier": "complete",
  "contentTierReason": "Short text (27 words)",
  "previousUrl": "https://variety.com/2016/legit/reviews/an-act-of-god-review-broadway-1201788964/",
  "urlDiscoveredAt": "2026-02-03T08:53:19.135Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 525,
  "archivePath": "data/archives/reviews/an-act-of-god-2016/variety--marilyn-stasio_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:53:19.139Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230814214504",
  "archiveOrgUrl": "http://web.archive.org/web/20230814214504/https://variety.com/2016/legit/reviews/an-act-of-god-review-sean-hayes-1201703755/",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 525,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T01:00:20.666Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production at the Ahmanson Theatre, not the current Broadway run.; kimi: This review covers the production at the Ahmanson Theatre in Los Angeles (starring Sean Hayes), not the current Broadway production. It explicitly references the previous Broadway production with Jim Parsons as having occurred 'last year on Broadway,' confirming this is a different production at a different venue.",
  "promptVersion": "5.2.0",
  "playbillVerdictUrl": "http://variety.com/2015/legit/reviews/broadway-review-jim-parsons-in-an-act-of-god-1201506483/",
  "sources": [
    "web-search",
    "show-score-playwright",
    "playbill-verdict"
  ],
  "wrongProduction": true
}