{
  "showId": "mother-play-2024",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Mother-Play/1230",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Mother-Play/1230",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTickets from $108\n Buy Tickets\n\nCititour.com Review\n Paula Vogel has never shied away from using her life and her family in her work – she made her theatrical “name” over 40 years ago with the autobiographically-inspired “The Baltimore Waltz” – but the Pulitzer Prize-winning writer seemingly lets it all hang out in her tragicomedy “Mother Play: A Play in Five Eviction,” now making its world premiere at Second Stage’s Hayes Theater under Tina Landau’s assured direction.\r\n\r\nAnd despite what one reads on Wikipedia or in various interviews, most of us can’t be sure how much of this alternately hilarious -- there are dancing roaches! – and sad “memory play” is completely accurate. But the one thing we do know for sure is that it features the season’s greatest dramatic performance, by the peerless Jessica Lange as Vogel’s “fictional” mother, Phyllis (also her real name). \r\n\r\nShe’s a woman who struggles through divorce, alcoholism (or at least an unhealthy dependence on the gin bottle), the teachings of a conservative Southern upbringing, and above all, the task of motherhood for which she was neither prepared nor actually wanted, thereby damaging (if not outright destroying) both herself and her children in the process. One can even imagine who Phyllis, and the other “mothers” like her, might have become had they defied societal expectations. \r\n\r\nUsing grand gestures and histrionic outbursts to great effect – or, sometimes no words at all (especially in one remarkable and lengthy scene) -- Lange lets us see all the anguish and heartbreak in Phyllis’ existence, as well as her resilience to survive. (If she resembles Tennessee Williams’ Amanda Wingfield – a role Lange played on Broadway in 2005 – then so be it.) \r\n\r\nThe story, which spans nearly 60 years, is told (thankfully not in flashback) by Vogel’s fictional stand-in Martha (played with unflinching honesty by the great Celia Keenan-Bolger), who grew up in the Washington, D.C area in various apartments. (The superb scenic design is by David Zinn.)\r\n\r\nDuring her adolescence, Martha is mostly ignored by Phyllis but bonds with her slightly older, gay brother Carl (which was Vogel’s brother’s name). He is played in effective if rather obvious fashion by Jim Parsons, so much so that it is almost laughable -- given both the writing and Parsons’ preening -- that Phyllis appears genuinely shocked when she discovers Carl’s homosexuality. \r\n\r\nOne suspects Phyllis really wants to love her children unconditionally -- just as she loves her bigoted parents -- but it’s literally beyond her capabilities. Having thrown Carl out of the house in the early 1970s, she slowly reconnects with him -- even having a grand time with him and Martha at a local gay bar. (One can see Lange as she must have looked and danced at Studio 54.) More surprisingly, Phyllis then takes him in when he’s diagnosed with AIDS, a rapprochement that ends up being short-lived for more than one reason.\r\n\r\nAs for Martha – a lesbian – she proves to be the bigger person, refusing to abandon her often scornful mother, even making some sort of peace much later in life (helped in part by the fact that, due to Phyllis’ Alzheimer’s, she doesn’t even recognize her.). Indeed, as might be expected from the play’s title, the daughter becomes the mother: an inevitable fate for so many women, no matter which life path they choose!\r\n\n By Brian Scott Lipton\n\nVisit the Sitehttps://2st.com/shows/mother-playOpen/Close DatesOpening 4/25/2024Closing Open-ended\nTheatre Info\nHayes Theatre240 West 44th StreetNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 623,
  "archivePath": "data/archives/reviews/mother-play-2024/cititour--brian-scott-lipton_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:32:38.217Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee auth failed: Monthly API calls limit reached: 250000"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}