{
  "showId": "mother-play-2024",
  "outletId": "pagesonstages-wordpress-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.wordpress.com/2024/06/08/mother-play/",
  "publishDate": null,
  "fullText": "I loved that Mother Play was artistically unafraid to stylize its aesthetic in bold, unrealistic ways while handling themes that were serious, heavy, and painfully real. This show followed the erosion of a family’s quality of life amid stereotypes about the queer community and the role of a mother. The show began in a light, pleasant way, showcasing gender stereotypes and stereotypes about motherhood and poverty that seemed light. The evictions had giant, dancing roaches projected all over (projection designer Shawn Duan, these were simultaneously cheesy and terrifying), and the mother, Phyllis (Jessica Lange) was funny despite her drunkenness—collecting the roaches and mailing them to the landlord. The gender conversation began with two marvelously funny scenes about how to walk like a man and how to walk like a woman that included all three characters. It was pretty clear from these early moments that Carl (Jim Parsons) was queer. Martha (Celia Keenan-Bolger), on the other hand, seemed to be dealing with sexual harassment from male peers and struggling with being seen as a woman by others more than wanting to be seen a certain way because of her own internal understanding. Though she emerged as lesbian later in the show, this origin story seemed problematic to me. After Phyllis’s rejection of Carl’s homosexuality, Martha stayed in the house for years, and finally convinced Phyllis to meet Carl at a gay bar. This scene was beautiful, and just as Phyllis was starting to crack open and embrace her son again, she discovered Martha kissing a woman and rejected them both. The scene that followed was, by far, the most brilliant moment of Mother Play. Phyllis came home to her empty home, and she didn’t know what to do with herself. For ten minutes, she wandered around in silence (with a clock tick and some music contributed by sound designer Jill BC Du Boff), unsure what to do with herself. She absent mindedly picked up objects, wandered for a long time before remembering to take off her coat, tried to eat and put in too much hot sauce… the exact wandering of someone who is lonely, wants to be alone, but doesn’t really know how to sit with herself. It was absolutely moving and heart breaking. Toward the end, Carl dies of AIDS, and Martha continues to take care of Phyllis. As sole caretaker, Martha’s rocky relationship with Phyllis comes to a head and Martha is frustrated. Phyllis ends up in a nursing home, and doesn’t recognize Martha. Just as Martha gives up on trying to prove to her mother, who is asking for Carl, that she is her daughter, her mother tells her that Martha reminds her of her daughter and expresses her pride, the first time Martha has ever heard those sentiments from her mother, and it puts Martha at peace after a life of fighting everybody and never feeling like she belonged. All of this is recontextualized in Phyllis’s admission that she never wanted to be a mother but couldn’t have an abortion. She admits that she never had a knack for motherhood and didn’t develop it along the way. All throughout the show, she’s been playing a part that hasn’t felt like her own. Going back to the opening scene, her oldest child was fourteen when she was in her thirties. So she was practically a child when she became a mother. As an adult woman, it is mentioned several times that she called her own mother every single day. What happens when we reexamine her behavior as a child? Sounds to me like a child, clumsily navigating the world of adulthood. Her children grew up into adults because they became so independent from her neglect. But Carl and Martha made a similar mistake—they never let Phyllis have enough independence to truly become an adult because they had been taking care of her for so long that it never occurred to them to help her learn to do things for herself. And be content with it. The whole story seems like child’s play. I did not attend this performance on a press pass",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 685,
  "archivePath": "data/archives/reviews/mother-play-2024/pagesonstages-wordpress-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:32:16.885Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}