{
  "showId": "mother-play-2024",
  "outletId": "the-daily-beast",
  "outlet": "THE DAILY BEAST",
  "criticName": "Tim",
  "url": "https://www.thedailybeast.com/jessica-lange-is-thrilling-even-if-mother-play-on-broadway-isnt",
  "publishDate": "April 25, 2024",
  "fullText": "Let us be clear: It is mesmerizing, a delicious treat, a little surreal, and utterly thrilling to watch Jessica Lange act on stage in Paula Vogel’s Mother Play: A Play in Five Evictions (2nd Stage, to June 16). In this Broadway play, she plays Phyllis, the louche, erratic, loving, and extremely not-loving mother of Carl (Jim Parsons) and Martha (Celia Keenan-Bolger). The play, set in various apartments inside and outside the Beltway of Washington, D.C., spans 1964 to the 21st century, and Phyllis in various stages of detachment from her children and the world around her.\n\nThe one constant is this season’s most skin-crawling special effect: Shawn Duan’s projections of cockroaches, who—in the five evictions the title mentions—range freely over refrigerators, and even march in relentless unison all over the walls. You may go home and look up the number of an exterminator.\n\nThose evictions seem a strangely inert dramatic device. Rather like the relationships between mother and son, and mother and daughter, they flare oddly into life and flare down. The characters are also types, who we don’t really get to know, except in relation to Phyllis; here Parsons plays a gay son, who wants acceptance, and who will forgive his mother her ugly homophobia out of a deeply felt devotion. Martha, who also comes out, is less forgiving, especially as Phyllis seems far more judgmental and sniping towards her. Carl is warm and fluttering, impervious to Phyllis’ viciousness, while Martha remains a block of suspicion and disbelief at their mother’s words, deeds, and blithe lack of care.\n\nWhen Martha comes out, Phyllis, hands in the air, moans she has “two of them,” but the play resists going down a conventional coming out story path. It plausibly sketches the unpredictable, eddying currents of rejection and acceptance around coming out.\n\nLeft to right: Jim Parsons, Jessica Lange, and Celia Keenan-Bolger in “Mother Play.”\n\nBut this is not a warm play, until in sporadic bursts it is. Phyllis is, by any measure, a not-good mother, whose children have learned to parent themselves, and to look after her. She drinks, she scolds, she is affectionate, then she is stone-cold. The play doesn’t delve; we skate through scenes, never staying in one place long enough, or discovering what underpins affection and antagonism. But then there is Lange. In one scene, she ends up in a gay bar with both her children, dancing to “I Will Survive” (a truly iconic moment worth the price of a ticket) and briefly, arms entwined, there is a happy bringing together of the trio.\n\nWith both children away from home, another stunning scene watches time pass with Lange facing the audience eating TV dinners all alone. Yet, as the play meanders through the years it's hard to connect with the characters, and hard to care about them too—even if Vogel supplies a late-in-play AIDS storyline for Parsons’ character, KS splodges and all. When just mother and daughter are left, there are some piercingly tender moments between Phyllis—now in the grips of dementia—and Martha that land, if glancingly. But mostly, Mother Play feels a cold, airless, and puzzling tundra to orienteer—despite the can-this-be-happening electricity of watching Jessica Lange perform on stage.\n\nIt is perhaps fitting that The Great Gatsby (Broadway Theatre, booking to Nov. 24) is the final opening of a crowded Tony Awards season. The cutoff date for nominations is tonight, they will be announced Tuesday, and Gatsby wants to end a packed and chaotic brace of openings with a literal bang. This is a bombastic, ridiculous, big, loud, and glamorous show. It rewrites Fitzgerald's characters, it throws everything at the audience—it’s green lights flash-time at intermission!—and yet, despite its flat first act, the second goes for full-on shameless spectacle, even as it mangles Fitzgerald's poetic writing. Ah well, there are two roof-raising songs and dance numbers instead! It is not a great musical, but by the end resistance seems futile—and its cars are the best this critic has ever seen on stage.\n\nGot a tip? Send it to The Daily Beast here.",
  "isFullReview": true,
  "dtliExcerpt": "But mostly, Mother Play feels a cold, airless, and puzzling tundra to orienteer—despite the can-this-be-happening electricity of watching Jessica Lange perform on stage.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "MEH",
  "dtliUrl": "https://didtheylikeit.com/shows/mother-play/",
  "needsScoring": true,
  "textWordCount": 675,
  "archivePath": "data/archives/reviews/mother-play-2024/the-daily-beast--tim_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:34:38.775Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}