{
  "showId": "mother-play-2024",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.theaterscene.net/plays/broadway-plays/mother-play/joel-benjamin/",
  "publishDate": null,
  "fullText": "Posted on May 9, 2024 by Joel Benjamin in Broadway, Plays Jim Parsons, Jessica Lange and Celia Keenan-Bolger in a scene from Paula Vogel’s “Mother Play, A Play in Five Evictions” at The Helen Hayes Theater (Photo credit: Joan Marcus) [avatar user=”Joel Benjamin” size=”96″ align=”left”] Joel Benjamin, Critic[/avatar] Pulitzer Prize-winning playwright Paula Vogel has contributed her Mother Play, A Play in Five Evictions to the current teeming Broadway season, produced under the auspices of the Second Stage company at the Helen Hayes Theater. It brings three bona fide stars back to the stage: Jessica Lange (A Streetcar Named Desire, Long Day’s Journey into Night), Celia Keenan-Bolger (To Kill a Mockingbird, The Glass Menagerie) and Jim Parsons (Harvey, The Boys In the Band). The story is told from the point of view of daughter Martha (Keenan-Bolger) as a memory play that takes this threesome from 1962 when Martha and brother Carl (Parsons) were in their early teens to the early 2000’s after lives of dramatic changes. Mom, Phyllis (Lange), is an outwardly cool, tart-tongued figure who is gradually broken down by the tragedies that life hands her. Jessica Lange and Celia Keenan-Bolger in a scene from Paula Vogel’s “Mother Play” at The Helen Hayes Theater (Photo credit: Joan Marcus) She is 30 at the play’s beginning. Her strife is aggravated by a taste for liquor and an antipathy towards her children. In one scene she has spent money on a new designer outfit—supposedly purchased at a charity store—and parades it in front of her kids who suffer from her scrimping. Lange does nothing to make Phyllis a sympathetic character. Nor does she take pains to visibly age Phyllis even though she goes from her 30’s to her 70’s, choosing, instead, almost imperceptible changes of posture and voice. Yet somehow she conveys the tough conversion she goes through by the end of her life. The subtitle of Vogel’s play is a witty evocation of the vagaries of the Herman family. An irresponsible, runaway dad/husband left them unable to pay rent, making packing and moving experts of Martha and Carl as evictions mount. As Mother Play begins, the two siblings are efficiently sealing cartons of possessions. David Zinn’s perfect set, consisting of bits and pieces of their lives on moveable dollies, allows for the flow from one dreary apartment to the next, mostly sub-par superintendent digs. Their constant battle with vermin in these flats is delightfully exaggerated by Shawn Duan’s projections of creepy-crawly creatures who, at one point during an apartment move, dance jovially to “La Cucaracha”! Celia Keenan-Bolger and Jim Parsons in a scene from Paula Vogel’s “Mother Play” at The Helen Hayes Theater (Photo credit: Joan Marcus) As the years progress, Martha and Carl find solace in each other as they watch their Mom become more financially independent, rising up in a series government clerical jobs—the play takes place in Washington, D.C.—while becoming harder and harder towards her offspring. When she discovers that Carl is gay and, subsequently, that Martha, who, like Vogel, becomes a playwright, is a lesbian, she reacts poorly. Parsons, as the brainy, doomed Carl expands his emotional range here, making it clear that under his jovial façade he is devastated. He even gets to show off his limited dancing chops in a jaunty duet with Keenan-Bolger. Mother Play, though based on Vogel’s own life, is at her most schematic, more an outline barely fleshed out with lots of details rather than the intense emotional revelations of her earlier works such as How I Learned to Drive and Indecent. The chronological span of the play precludes anything but a quick portrayal of a procession of life-changing events in the Herman family and the rest of the world. Only Martha comes close to revealing her inner tumult at being torn between her mother and her brother. AIDS and other markers of the fast-moving decades are served up too quickly and with foregone conclusions in weak attempts to pluck the audience’s heart strings. Jessica Lange in a scene from Paula Vogel’s “Mother Play” at The Helen Hayes Theater (Photo credit: Joan Marcus) Toni-Leslie James’ costumes quietly guide the audience through the decades while Jen Schriever’s lighting elucidates each new apartment as they slide in and out on Zinn’s moveable bits and pieces. Tina Landau, a long-time Vogel colleague and interpreter, mines Vogel’s fast-moving play for every tidbit of emotion. Mother Play, A Play in Five Evictions (through June 23, 2024) The Helen Hayes Theater, 240 West 44th Street, in Manhattan For tickets, visit http://www.2ST.com Running time: one hour and 45 minutes without an intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 764,
  "archivePath": "data/archives/reviews/mother-play-2024/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:37:30.843Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}