{
  "showId": "mother-play-2024",
  "outletId": "timeout-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.timeout.com/newyork/theater/mother-play-five-evictions-broadway-review-jessica-lange-paula-vogel",
  "publishDate": null,
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Joan Marcus | Mother Play: A Play in Five EvictionsReview\n\n4 out of 5 starsTheater, DramaRecommendedThursday April 25 2024ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\nPaula Vogel has tapped into veins of autobiography throughout her distinguished career, and in her latest work she hits the big one: the mother lode. As its wryly categorical title suggests, Mother Play is an I-remember-mama drama in a time-honored mode; it carries a hint of resignation—as though it were in some sense an act of obligation, a rite through which every playwright must pass. And to drive home its place in the matrilineal succession, the play’s world premiere at Second Stage stars the supreme Jessica Lange, whose two most recent Broadway appearances were as the preeminent ghost moms of American drama: Amanda Wingfield in The Glass Menagerie and Mary Tyrone in Long Day’s Journey Into Night.\n\nMother Play’s Phyllis combines aspects of both. She’s an impoverished single mother from the South who tries to live up to outmoded standards (and spends a lot of time on the phone); she’s also an addict whose children must ultimately take care of her. A gin-swilling divorcée in thrift-store Chanel who mails dead bugs to her landlord with the rent, Phyllis is a real character—and a character openly based on the real Phyllis Vogel. The play is a slice of life, served raw. It’s a savage but grudgingly loving portrait of two women stuck together with blood: one who never wanted to be a mother, and one who never chose to be her daughter. “It is never over,” as Phyllis says. “It’s a life sentence.”\n\nMother Play: A Play in Five Evictions | Photograph: Courtesy Joan Marcus\n\nMuch of the play unpacks the baggage that Phyllis saddled on her children: the mother load. Celia Keenan-Bolger portrays Martha, the play’s name for Vogel fille, from early-1960s tweendom to roughly present late-middle age, and Jim Parsons is the playwright’s older brother, Carl, who died of AIDS in 1988. Vogel dealt with Carl’s story in her breakthrough work, 1990’s The Baltimore Waltz, but in a highly stylized way: She inverted it into an absurdist film-noir spoof about a wild European adventure. Mother Play takes a far more straightforward (though very queer-forward) approach. It has a magical elements, which are given their due in Tina Landau’s staging—a bottomless handbag, dancing roaches—but for the most part it presents its story as personal evidence. (The play includes a real-life letter from Carl, in which he wittily plans his own funeral, that was published as background in the introduction to the The Baltimore Waltz.)\n\nThe result may or may not be a full portrait of Phyllis Vogel. As a memory play, it mirrors the way memory works: It’s fragmentary, with trauma to the front. The martinis, the oversharing, the continual uprooting (whence the subtitle A Play in Five Evictions) are bad enough, but they pale next to Phyllis’s homophobia. Carl and Martha are both gay; it’s one of the things that bonds them as kids. (A teenage Carl teaches Martha how to walk like a man, in a delightful twist on a famous scene from La Cage Aux Folles.) “All troubles begin with sexual repression,” claims the precocious Carl, and Phyllis—the child of conservative Catholics—is the agent of their repression. She cruelly disowns her son and alienates her daughter; whenever she takes steps, she collapses back.\n\nMother Play: A Play in Five Evictions | Photograph: Courtesy Joan Marcus\n\n“That’s right! Blame the mother!” cries Phyllis, and the play does sometimes feel like revenge. Vogel shows us this woman at her worst: the mother, lowed. “You were so angry at her at the end,” Martha confesses to Carl. “I’ve been holding onto your anger and onto mine.” But while Mother Play may be punitive, it is never pitilessly so. And in putting her mother onstage, Vogel effectively puts her on a kind of pedestal. She’s not just a character; she’s a star. And not just any star; she’s Jessica Lange.\n\nKeenan-Bolger and Parsons are very good indeed in Mother Play, but there’s no question to whom it belongs. Lange is magnificent, especially in this production’s most moving scene: a long passage that the script calls the Phyllis Ballet. Phyllis is alone onstage, because she has pushed everyone away. There is no dialogue, because she has no one to talk to. She stares out motionless at the audience for a discomfiting amount of time, letting us project onto her face like an actress in a film; then, in a silky magenta robe, she enacts a kind of sad silent comedy, setting a dignified dinner for herself and dousing her food in hot sauce. She has fallen down the well of loneliness. Bringing decades of experience to bear, Lange is riveting—and so, by extension, is Phyllis. In this painfully honest tribute, Phyllis’s pain is part of the picture. Vogel does her mother dirty, but she does her mother proud.\n\nMother Play: A Play in Five Evictions. Hayes Theater (Broadway). By Paula Vogel. Directed by Tina Landau. With Jessica Lange, Celia Keenan-Bolger, Jim Parsons. Running time: 1hr 45mins. No intermission.\n\nFollow Adam Feldman on X: @FeldmanAdamFollow Time Out Theater on X: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nMother Play: A Play in Five Evictions | Photograph: Courtesy Joan Marcus\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "dtliExcerpt": "\"While Mother Play may be punitive, it is never pitilessly so.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": 100,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1194,
  "archivePath": "data/archives/reviews/mother-play-2024/timeout-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:38:04.513Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "designation": "Critics_Choice",
  "scoreSource": "time-out-stars",
  "scoreConfidence": "medium",
  "originalRating": "5/5 stars"
}