{
  "showId": "kpop-2022",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Amanda Marie Miller",
  "url": "https://www.theatrely.com/post/kpop-the-musical-shines-on-broadway-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/kpop-the-musical-shines-on-broadway-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "bwwExcerpt": "If you are a fan of K-pop, KPOP The Musical is a can’t-miss show. If you have an interest in Broadway and the future of the theatre industry at large, KPOP is a must see, shining star, of what is possible. It is not difficult to look around at other audience members and see fans having the time of their life. KPOP has a crowd. You should be in it.",
  "bwwScore": 10,
  "fullText": "The ensemble of KPOP The Musical | Photo: Michaelah Reynolds/Theatrely\n\nKPOP The Musical is the most exciting, interesting, and alive show on Broadway right now. In a season of half-baked adaptations and Golden Age revival attempts, this exhilarating musical is a reminder of the importance of new works and contemporary stories. This musical knows exactly what it wants to be and the cast? They’re ready to win over your heart.\n\nI attended a matinee and sat, surprisingly, with a collection of families. A mom and daughter in matching BLACKPINK sweatshirts. A group of brothers who, at intermission, discussed how fictitious group F8 is “kind of like BTS!” KPOP, in structure, is a thrilling cross between a concert and a musical, but regardless of label, viewers are locked in and I, a BTS stan just like the family I am sitting with, am thrilled to be here.\n\nIn this story we find the executive behind RBY, a fictitious Korean pop music label, desperate to showcase three of her acts in New York City after a lifetime of personal sacrifices. Ruby (Jully Lee) enlists scheming director Harry (Aubie Merrylees), only to reignite previous conflicts. With musical numbers, and the help of some video teaser content, we meet the acts and skyrocket into the world of RBY. MwE (played by a poised, regal, and vocally tenacious Luna) is the solo star who has been working since her preteen years, but has hit a breaking point. The guys of F8 value tradition, but are fighting to stick together after newcomer Brad (Zachary Noah Piser, a stimulant) starts to shake things up. And RTMIS, the girl group of five, were inspired to perform by a young MwE, but struggle with the looming pressure of impending stardom. The key here is that these acts are not in competition with each other; no, they are fighting to stick together and support one another. This setup provides the ultimate opportunity to the audience: to root for all of the characters, and by extension, the entire production.\n\nEach performer is at the top of their game combining traditional musical theatre elements with the styles of the K-pop industry. Kevin Woo (as Jun Hyuk) charismatically leads F8 through red flags with Joshua Lee (representing the rap line as Timmy X) providing depth and variety. On the RTMIS side, the group balances star power and raw talent with enchanting standout performances from BoHyung (a matter of fact Tiny) and Min (the powerful Riya).\n\nThe musical numbers shine with Jennifer Weber’s electric choreography. Paired with the dynamic songs of Helen Park and Max Vernon, including bangers “Gin & Tonic” and “Supergoddess,” these performances are perfectly suited for Broadway crowds eager to see top talents onstage. Clint Ramos and Sophia Choi contribute a dazzling wardrobe of costumes, bejeweled and shimmering in all the right moments.\n\nWhile this version may not be considered “immersive” like its off-Broadway predecessor, the production pulls out every stop to near the experiential nature previous audiences fell in love with. Unassuming sleek scenic design (Gabriel Hainer Evansohn) and active, physical, direction (Teddy Bergman) make smart use of the space, including every inch of aisle, platform, and trap door available. The technology (including lighting by Jiyoun Chang and projections by Peter Nigrini) shines in a way that mirrors the high-tech spectacle of true sold-out stadium K-pop concerts, yet nimbly shifts focus to drive the show forward past its musical numbers.\n\nWhen experiencing over the top, glimmering songs, an exchange of quiet dialogue or a scenic transition can stand out and threaten to slow the pace…though here, it never actually does. Insertions of exposition may sound heavy-handed in the moment, but they accomplish their purpose of raising the tension, increasing the stakes. As we learn more about MwE's backstory, or the history of dynamic group F8, some viewers might have a gripe with the construction of the scenes. It’s difficult to pinpoint exactly how to mediate the clash between high energy performance and focused conversation, but I didn't want to—I was too busy having fun. The book does what it needs, we connect a few dots, now back to the show.\n\nFrom any seat in the house, it is abundantly clear: there is a hunger on this stage, both in the fictitious world and in the current moment. Just as MwE, F8, and RTMIS want to be seen and understood for who they are, these Broadway performers—including 18 debuts—are leaving everything on the stage to share this story. Art imitates life and so on. The finale is a high-energy showcase of talent accompanied by, at my matinee, a crowd of fans jumping with applause and humming along. Broadway needs more shows like this. More risks, more challenges, more celebrations.\n\nIf you are a fan of K-pop, KPOP The Musical is a can’t-miss show. If you have an interest in Broadway and the future of the theatre industry at large, KPOP is a must see, shining star, of what is possible. It is not difficult to look around at other audience members and see fans having the time of their life. KPOP has a crowd. You should be in it.\n\nKPOP The Musical is now playing at Circle in the Square Theatre in New York City. For tickets and more information, click here.\n\nAmanda Marie Miller is an NYC-based writer and creative with an interest in pop culture and new work development. Amanda is from Kansas City and loves to talk about fan engagement and her most recent playlists. You can typically find her hosting bar trivia or searching for an iced americano.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 972,
  "archivePath": "data/archives/reviews/kpop-2022/theatrely--amanda-marie-miller_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:08:04.396Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251212034054",
  "archiveOrgUrl": "http://web.archive.org/web/20251212034054/https://www.theatrely.com/post/kpop-the-musical-shines-on-broadway-review",
  "contentTier": "complete",
  "wordCount": 972,
  "tierReason": "Full review text",
  "duplicateOf": "theatrely--marie-miller.json"
}
