{
  "showId": "good-people-2011",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2011/03/04/theater/reviews/04good.html",
  "publishDate": "March 3, 2011",
  "fullText": "https://www.nytimes.com/2011/03/04/theater/reviews/04good.htmlShare full articleAdvertisement\n\nDon’t make the mistake of thinking you understand Margaret Walsh from the get-go, because she’s not an easy gal to get a fix on. Not at first, anyway.\n\nEmbodied with an ideal balance of expertise and empathy by Frances McDormand, Margie (as her friends call her, using a hard “g”) is the not-quite heroine of David Lindsay-Abaire’s “Good People,” the very fine new play that opened Thursday night at the Samuel J. Friedman Theater. And discovering how Margie operates — and where she’s coming from — is one of the more subtly surprising treats of this theater season.\n\nWhere Margie comes from is, on one level, a no-brainer. She’s from South Boston, or Southie, and her most basic notions of herself are tied up in her identification with that neighborhood. She was born there, and the odds are she’ll die there, never having escaped its particular culture of poverty and loyalty. Why this has to be is the gentle mystery that propels “Good People,” a Manhattan Theater Club production that also stars Tate Donovan and is directed with a skillfully slow hand by Daniel Sullivan. Other people escape from Southie, including a guy Margie dated in high school. Why can’t she?\n\nFor whatever reasons, the seedier milieus of Boston have of late become favorite haunts for popular crime novelists and filmmakers like Dennis Lehane (“Mystic River”) and Ben Affleck (“The Town”), a fashionable place to uncover dark secrets on mean streets. Steeped in mouthy Southie lingo and hard-knocks sociology, “Good People” has a few secrets of its own, but their revelations are unlikely to startle you. In this play character really is fate. And when you look back, everyone has behaved exactly in character, without any plot-bending, credibility-stretching manipulations on the part of its author.\n\nSuch integrity is less common than you might think in theater. How often do you leave a play thinking, “There’s no way she would have done that,” or “He wouldn’t talk like that”? But as in his previous Broadway drama, the Pulitzer Prize-winning “Rabbit Hole” (2006), Mr. Lindsay-Abaire (who grew up in South Boston) is scrupulous here about presenting people who are consistent even in their inconsistencies.\n\nYou get the feeling that this writer — who made his name with fantasy-tinged, diabolically whimsical works like “Fuddy Meers” and “Kimberly Akimbo” — feels a special obligation not to cheat or take shortcuts when working in naturalism. This means not only that “Good People” refuses to shy from the clichés that its characters would normally use, but also that there is little that’s dramatically flashy or high impact.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Ms. Lynch gives what may be the performance of her career as Margaret Walsh, a struggling single mother from South Boston who refuses to let poverty strip her of her dignity or her wicked sense of humor.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Embodied with an ideal balance of expertise and empathy by Frances McDormand, Margie (as her friends call her, using a hard “g”) is the not-quite heroine of David Lindsay-Abaire’s “Good People,” the very fine new play that opened Thursday night at the Samuel J. Friedman Theater. And discovering how Margie operates — and where she’s coming from — is one of the more subtly surprising treats of this theater season.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Ms. Lynch gives what may be the performance of her career as Margaret Walsh, a struggling single mother from South Boston who refuses to let poverty strip her of her dignity or her wicked sense of humor.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Short text (37 words)",
  "rejectedAt": "2026-02-07T05:02:40.288Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The text appears to be truncated with a technical error message at the end, and the content shown seems incomplete without a clear critical verdict; openai: The text is a mix of incomplete review content and technical issues preventing access to the full article.",
  "promptVersion": "5.2.0",
  "bwwScore": 8,
  "sources": [
    "web-search",
    "bww-reviews"
  ],
  "previousUrl": "https://www.nytimes.com/2011/03/04/theater/reviews/good-people-by-david-lindsay-abaire-review.html",
  "urlDiscoveredAt": "2026-02-05T02:59:45.134Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 458,
  "archivePath": "data/archives/reviews/good-people-2011/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:32:15.914Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241216183150",
  "archiveOrgUrl": "http://web.archive.org/web/20241216183150/https://www.nytimes.com/2011/03/04/theater/reviews/04good.html",
  "wordCount": 458,
  "tierReason": "Full review text"
}
