{
  "showId": "good-people-2011",
  "outletId": "vulture",
  "outlet": "New York Magazine",
  "criticName": "Scott Brown",
  "url": "http://nymag.com/daily/entertainment/2011/03/stage_dive_the_bad_moves_of_da_1.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "It’s a given that we don’t talk about class in this country, so it’s hardly surprising that we don’t see a lot of plays about it. (We don’t see many plays, period, but that’s a different, if related, matter.) David Lindsay-Abaire’s Good People — the latest in his Rabbit Hole realism phase — isn’t exactly an Odetsian war cry. But simply by broaching the subject of haves and have-nots, it will make a stir: Prepare for overpraise for “bravery” and abuse for not going further, for ending on a note perilously close to magical complacency. Whatever. Good People is a fine, small, heartfelt work that shadowboxes with social darkness in a safely lit room, floating on a vast sea of unsaid things.",
  "bwwScore": 8,
  "contentTier": "complete",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nIt’s a given that we don’t talk about class in this country, so it’s hardly surprising that we don’t see a lot of plays about it. (We don’t see many plays, period, but that’s a different, if related, matter.) David Lindsay-Abaire’s Good People — the latest in his Rabbit Hole realism phase — isn’t exactly an Odetsian war cry. But simply by broaching the subject of haves and have-nots, it will make a stir: Prepare for overpraise for “bravery” and abuse for not going further, for ending on a note perilously close to magical complacency. Whatever. Good People is a fine, small, heartfelt work that shadowboxes with social darkness in a safely lit room, floating on a vast sea of unsaid things.\n\nBut while the play itself is reticent, there’s little left unsaid by its main character, the luckless, endlessly self-sabotaging South Boston matron, Margaret (Frances McDormand). Her mouth is a holy terror — the most dangerous thing on Broadway outside of the Foxwoods — and she holds us in mortal fear of what’s going to come out of that maw. Closed, it’s forbidding, the jaw set in a gangsterly Fifth Amendment jut. Open, it’s a weapon of mass destruction. Life hasn’t been kind to Margaret, an out-of-work single mom with a mentally handicapped adult child, and she can’t decide how unkind she should be in return — and who should pay for her pain. Opportunity knocks in the shape of erstwhile high-school boyfriend Mike (Tate Donovan), a “lace curtain” bootstrapper who made the improbable hop from rough Southie to Beacon Hill fertility doctor. Margie’s got a stunning ace to play: some old-neighborhood knowledge of Mike, carnal and otherwise. Should she deploy the blackmail scheme suggested by her brash best friend (Becky Ann Baker) and chiseling landlady (Estelle Parsons, brilliantly bonkers)?\n \nThe play’s main contest erupts when Margie crashes Mike’s plush home and meets his beautiful, buppified African-American wife (the stealthily superb Renee Elise Goldsberry). Wine is poured, a comically gigantic cheese tray enters with the menace of a B-1 bomber, and a pricey crystal vase waits patiently for its Big Moment. Pretty much every buttonhook in Good People is telegraphed well in advance, but fans of Lindsay-Abaire’s Rabbit Hole know that normative predictability hardly impedes enjoyment of his work. Even at his most antically Durangian (Fuddy Meers), his concerns have always been intimate, not systemic. There are no big issues on trial here, just Margaret — Lindsay-Abaire’s richest, most fabulously flawed character yet, brought to life with flinty unsentimentality by the ferociously talented ­McDormand. Theatergoing is a gamble, even for those “lace curtain” enough to afford tickets, but you could do worse than to put your money where her mouth is.\n\nYour product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 492,
  "archivePath": "data/archives/reviews/good-people-2011/vulture--scott-brown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:03:42.981Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No usable CDX snapshots (all non-200 or non-HTML)"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 492,
  "tierReason": "Full review text"
}