{
  "showId": "the-performers-2012",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/theater-review-performers-390442/",
  "publishDate": "November 15, 2012",
  "fullText": "The Performers Ari Graynor Alicia Silverstone - P 2012\n\nNEW YORK – The draw of The Performers for many will probably be a near-naked Cheyenne Jackson, playing an adult film star named Mandrew, or possibly Henry Winkler as Chuck Wood, an egomaniacal porn-industry veteran famed for his endowment. But the money shot of this production is an incandescent comic turn by Ari Graynor, her inventive line readings matched by the daffy expressivity of her face and body. As for David West Read's play, it's a so-so Broadway boulevard comedy with a generous dose of raunch. But while the material is as skimpy as Mandrew's suede microshorts, the cast works on this fluff like expert fluffers.\n\nSet in a Las Vegas hotel on the night of the Adult Film Awards, the comedy is basically a collision of two couples that forces them to re-examine their attitudes toward sex, monogamy and commitment. Muscle-bound Mandrew is a nominee for Best Male Performer for his work in Planet of the Tits. His high school friend Lee (Daniel Breaker) is a New York Post reporter, in Vegas with his schoolteacher fiancée Sara (Alicia Silverstone) to write a profile piece.\n\nVIDEO: ‘The Performers’ Sneak Peak\n\nWhen one-woman man Lee starts questioning whether his lack of sexual experimentation will come back to haunt his married life, Sara rankles at the perceived personal affront, storming out to explore what Vegas has to offer. Taking her cue from the title of a nominated film, she says it's time to be Spontaneass. Meanwhile, Mandrew's wife and frequent co-star Pussy Boots (Graynor), known as Peeps for short, explodes in a jealous rage when she learns he violated their marital pact by kissing another woman off-camera.\n\nThat woman is porn stablemate Sundown LeMay (Jenni Barber). Her freshly installed Russ Meyer-esque breast implants are viewed as another betrayal by Peeps, who fears being left behind and prematurely relegated to MILF roles. The fact that she's pregnant makes her even more emotional, a state that her primal-scream therapy can't fix.\n\nRead made a well-received Off Broadway debut last season with the drama The Dream of the Burning Boy, which like this play, was directed by Evan Cabnet. The playwright has concocted himself a fertile setup for comedy but fails to do anything creative with it. He tosses in hit-or-miss jokes (I laughed at Das Booty as a title for German dungeon porn), but very little actual cleverness or emotional insight into relationship issues. As the two young couples' insecurities send them into a tailspin, Winkler's more seasoned character provides sobering evidence that success doesn't necessarily bring respect or fulfillment. But as plotted here, the reaffirmation of their love feels rote and inconsequential.\n\nOn the plus side, set designer Anna Louizos and costumer Jessica Wegener Shay deliver an amusing take on Vegas-style tacky glamour. Mandrew's black lace shirt, leopard fur jacket and lace-up-crotch matte-leather pants are like something Roberto Cavalli might have thrown together for Siegfried & Roy, and Peeps' aquamarine Juicy Couture velour tracksuit is hideous perfection.\n\nJulian Fleisher's jazzy scene-change music underscores that, beneath all its licentiousness, this is at heart an old-fashioned Broadway comedy. Cabnet can't entirely dodge the lags in such featherweight material, but the appealing cast should satisfy undemanding audiences looking for light entertainment with a touch of the risqué. And if they retain a soft spot for the Fonz, they might not even notice that Winkler ambles through a role that's loaded with prurient gags but underdeveloped when it comes time for introspection.\n\nA distinctive personality in shows like Passing Strange and By the Way, Meet Vera Stark, Breaker is stuck playing straight man here, but does so with a nice note of droll humor in his earnestness. The naturally effervescent Silverstone gets to cut loose more often, particularly when Sara does a Freaky Friday-inspired wardrobe swap with Peeps and hits the vodka. But the choicest roles, naturally, are the performers, and Jackson, Graynor and Barber find whatever shadings they can in their characters' himbo/bimbo stupidity, along with redeeming evidence of their humanity.\n\nJackson's sharp comic timing and pulchritudinous charms are well deployed here, but it's Graynor who really stands out. Her voice combines a squeak with a bark, virtually guaranteeing laughs, and her pout transforms in an instant to defensiveness when Peeps is out of her depth intellectually, which is often. It's some achievement that she manages to create an endearing character out of this ditz.\n\nVenue: Longacre Theatre, New York (runs indefinitely)\n\nCast: Cheyenne Jackson, Ari Graynor, Daniel Breaker, Jenni Barber, Alicia Silverstone, Henry Winkler\n\nCostume designer: Jessica Wegener Shay\n\nLighting designer: Jeff Croiter\n\nSound designer: Nevin Steinberg\n\nProjection designer: Richard DiBella\n\nPresented by Robyn Goodman, Amanda Lipitz, Scott M. Delman, Cynthia Stroum, Playing Pretend Productions, Kevin Kinsella, Bruce Bendell/Scott Prisand, Morris Berchand, Richard Vague, Karen Segal, Russell J. Notides, Burnt Umber/Rebecca Gold, Debbie Buslik/Jamie Bendell, Kevin McCollum",
  "isFullReview": true,
  "dtliExcerpt": "The Performers is a backstage farce that feels more like a backstage catastrophe, with Neil Patrick Harris working overtime to inject life into David West Read's labored comedy.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "The money shot of this production is an incandescent comic turn by Ari Graynor, her inventive line readings matched by the daffy expressivity of her face and body. As for David West Read’s play, it’s a so-so Broadway boulevard comedy with a generous dose of raunch. But while the material is as skimpy as Mandrew’s suede microshorts, the cast works on this fluff like expert fluffers…The playwright has concocted himself a fertile setup for comedy but fails to do anything creative with it...Julian Fleisher’s jazzy scene-change music underscores that, beneath all its licentiousness, this is at heart an old-fashioned Broadway comedy. Cabnet can’t entirely dodge the lags in such featherweight material, but the appealing cast should satisfy undemanding audiences looking for light entertainment with a touch of the risqué.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-PERFORMERS-Opens-on-Broadway-Updating-LIVE-20121114",
  "showScoreExcerpt": "The Performers is a backstage farce that feels more like a backstage catastrophe, with Neil Patrick Harris working overtime to inject life into David West Read's labored comedy.",
  "contentTier": "complete",
  "contentTierReason": "Short text (28 words)",
  "textQuality": "truncated",
  "bwwScore": 7,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ],
  "previousUrl": "https://www.hollywoodreporter.com/review/performers-theater-review-393505/",
  "urlDiscoveredAt": "2026-02-07T10:46:42.703Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 811,
  "archivePath": "data/archives/reviews/the-performers-2012/hollywood-reporter--david-rooney_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:46:42.708Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20210725201223",
  "archiveOrgUrl": "http://web.archive.org/web/20210725201223/https://www.hollywoodreporter.com/news/general-news/theater-review-performers-390442/",
  "wordCount": 811,
  "tierReason": "Full review text"
}