{
  "showId": "the-people-in-the-picture-2011",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2011/04/29/theater/reviews/the-people-in-the-picture-with-donna-murphy-review.html",
  "publishDate": "April 21, 2011",
  "fullText": "https://www.nytimes.com/2011/04/29/theater/reviews/the-people-in-the-picture-with-donna-murphy-review.htmlShare full articleAdvertisement\n\nWhen Donna Murphy time travels, she packs light. A pair of glasses, a shawl, maybe some lipstick: that’s all this chameleon actress requires to step over the chasm that divides two chapters of one woman’s life in “The People in the Picture,” a sincere and queasy new musical about mother love, Yiddish theater and the Holocaust that opened on Thursday night at Studio 54.\n\nYou may never have realized, for example, how expressive a set of shoulders can be in defining the differences between youth and age. When Ms. Murphy plays the actress Raisel, the darling of a Yiddish troupe in Warsaw in the 1930s and ’40s, her shoulders seem to ripple skyward, suggesting wings tucked restlessly beneath her skin.\n\nAnd when Ms. Murphy is Bubbie, the live-in grandma of 1977 Manhattan that Raisel turns into, those same shoulders collapse into a set of fragile bones — breakable, sloping slaves to gravity. When the lights are low on Bubbie, and her face sheds its animation, her silhouette is unmistakably that of a woman slouching toward death.\n\nIt is the good fortune of theatergoers that the fragile Bubbie hangs on until the end of “The People in the Picture,” though there are many moments when it looks as though she might be crossing over to join her old departed colleagues, who hang around on stage as kibitzing ghosts. Without Ms. Murphy this well-meaning Roundabout Theater Company production — which has a book and lyrics by Iris Rainer Dart and songs by Mike Stoller and Artie Butler — would be thin treacle indeed.\n\nAs it is, even Ms. Murphy (who also gets to portray the various characters that Raisel plays onstage and on screen) has trouble generating the kind of energy that makes an audience sit up and smile, or sit up, period. Directed by Leonard Foglia, “People” has all the elements of an emotional bulldozer on autopilot: a plucky Jewish theater group working defiantly in the shadow of Nazism; mothers and daughters longing to love but locked in conflict; a family secret — buried in the rubble of postwar Poland — that must be revealed if any of our main characters are to find (no, stop me, please don’t let me say that word) closure.\n\nSuch eventful, tear-stained, multigenerational plots are less common to musicals than they are to fat novels displayed in airport bookstores as temptations to women with purses full of Kleenex and long flights ahead. And it is no coincidence that Ms. Dart is best known for just such a novel, “Beaches,” which became a four-hankie hen flick starring Bette Midler and Barbara Hershey.\n\nIt’s pretty unlikely that Red (a straightforward Nicole Parker), a single mom and the exasperated daughter of the aging Bubbie, would ever break into the hit song from “Beaches,” the one that goes, “Did you ever know that you’re my hero?” Though Bubbie has been living with Red for years, taking care of Red’s little girl, Jenny (Rachel Resheff), these two women show little admiration for each other.\n\nRed really, really resents Bubbie because of, you know, the Secret. And besides, Bubbie has totally won over Jenny with Yiddish lessons, Yiddish cooking lessons, Yiddish jokes and endless stories of life with the Warsaw Gang, a troupe so committed to its art that it staged performances underground during the ghetto years.\n\nBubbie’s memories come to life, as memories have a way of doing in musicals. The troupe members — solidly embodied by familiar Broadway veterans, including Alexander Gemignani, Christopher Invaar, Joyce Van Patten, Chip Zien and Lewis J. Stadlen — carry out the creed of Raisel, their resident playwright as well as star. The best thing you can do in a time of crisis, she says, is to lift the spirits of the afflicted with happy shows with happy endings.\n\n“A cold wind’s blowing,” they sing, “But there’s one thing for certain. You’re gonna laugh and cry until the final curtain.”\n\nSo they bring on the jokes. Of their amended classic plays: “If Shakespeare found out what Raisel did to his plots — he would!” Or: “They call us Jewish hams. But that’s an oxymoron.” Or: “Hey, a pogrom is not an easy act to follow.”\n\nHoping to be remembered by posterity, they also make movies, including one in which Raisel stars as a dancing dybbuk who sings, “I’m not in this world or in that/I got no head, I got no body/ So I look silly in a hat.”\n\nMr. Stoller (of the great pop song-writing team Leiber and Stoller) and Mr. Butler set such lyrics to a surprisingly oomph-free klezmer-inflected score. The music tends to trickle, avoiding the big crescendos of Broadway showstoppers. This tonal uncertainty may reflect the problems of combining peppy folk humor and death-camp fears into one package. But even the more conventional ballads, like the songs that Red sings about putting Mom in a nursing home, feel vague and utterly resistible.\n\nThe production features a rather literal-minded set, centered on picture frames, by Riccardo Hernandez and easy-to-wear costumes by Ann Hould-Ward that allow Ms. Murphy to make the required quick changes. Paul Gemignani (father of Alexander) is the esteemed music director, and Andy Blankenbuehler is responsible for the “musical staging,” which includes a lively danced prologue that introduces the Warsaw Gang.\n\nMs. Murphy has given some of the most memorable musical performances I’ve ever seen, in shows that run from Stephen Sondheim’s somber “Passion” to the giddy “Wonderful Town.” I can’t say that her Raisel belongs in that gallery, but it does make you marvel anew at her protean gifts.\n\nIn the show’s best song, “Selective Memory,” a number about fading recollection and lost love, Ms. Murphy manages to be both Raisel and Bubbie in one breath. The old woman and her younger self truly coexist in the same slender body, and you believe equally that this woman could either collapse into ashes or soar toward the sun.\n\nBook and lyrics by Iris Rainer Dart; music by Mike Stoller and Artie Butler; directed by Leonard Foglia; musical staging by Andy Blankenbuehler; musical direction by Paul Gemignani; sets by Riccardo Hernandez; costumes by Ann Hould-Ward; lighting by James F. Ingalls; sound by Dan Moses Schreier; projections by Elaine J. McCarthy; hair and wig design by Paul Huntley; makeup by Angelina Avallone; orchestrations by Michael Starobin; dance music arrangements by Alex Lacamoire; dialect coach, Kate Wilson; fight director, Rick Sordelet; production stage manager, Peter Wolf; production manager, Aurora Productions; general manager, Rebecca Hebel; executive producer, Sydney Beers; associate artistic director, Scott Ellis. Presented by the Roundabout Theater Company, Todd Haimes, artistic director; Harold Wolpert, managing director; Julia C. Levy, executive director, in association with Tracy Aron, Al Parinello and Stefany Bergson. At Studio 54, 254 West 54th Street, Manhattan; (212) 719-1300; roundabouttheatre.org. Through June 19. Running time: 2 hours 20 minutes.\n\nWITH: Donna Murphy (Bubbie/Raisel), Alexander Gemignani (Moishe Rosenwald), Christopher Innvar (Chaim Bradovsky), Nicole Parker (Red), Rachel Resheff (Jenny), Hal Robinson (Doovie Feldman/Rabbi Velvel), Lewis J. Stadlen (Avram Krinsky), Joyce Van Patten (Chayesel Fisher) and Chip Zien (Yossie Pinsker).\n\nShare full articleAdvertisement",
  "isFullReview": true,
  "dtliExcerpt": "Ms. Margulies has created characters who register as genuine people, not just pegs on which to hang a thesis. And she has found a theatrical language that accommodates both the mundane and the mythic aspects of her story.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Without Ms. Murphy this well-meaning Roundabout Theater Company production - which has a book and lyrics by Iris Rainer Dart and songs by Mike Stoller and Artie Butler - would be thin treacle indeed. As it is, even Ms. Murphy (who also gets to portray the various characters that Raisel plays onstage and on screen) has trouble generating the kind of energy that makes an audience sit up and smile, or sit up, period.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Broadway-Review-Roundup-THE-PEOPLE-IN-THE-PICTURE-Updating-Live-20110428",
  "showScoreExcerpt": "Ms. Margulies has created characters who register as genuine people, not just pegs on which to hang a thesis. And she has found a theatrical language that accommodates both the mundane and the mythic aspects of her story.",
  "contentTier": "complete",
  "contentTierReason": "Short text (38 words)",
  "textQuality": "truncated",
  "rejectedAt": "2026-02-05T10:12:26.927Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a brief excerpt or quote fragment, not a complete review that provides enough context to determine the critic's overall recommendation; openai: The text is a brief excerpt that lacks a clear evaluative verdict or recommendation about the show.",
  "promptVersion": "5.2.0",
  "bwwScore": 3,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ],
  "previousUrl": "https://www.nytimes.com/2011/04/22/theater/reviews/the-people-in-the-picture-review.html",
  "urlDiscoveredAt": "2026-02-05T06:32:29.927Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1184,
  "archivePath": "data/archives/reviews/the-people-in-the-picture-2011/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T19:26:34.513Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241216014826",
  "archiveOrgUrl": "http://web.archive.org/web/20241216014826/https://www.nytimes.com/2011/04/29/theater/reviews/the-people-in-the-picture-with-donna-murphy-review.html",
  "wordCount": 1184,
  "tierReason": "Full review text"
}