{
  "showId": "the-people-in-the-picture-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "http://www.variety.com/review/VE1117945115",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "The 2010-2011 Broadway season wisps to a close with 'The People in the Picture.' Holocaust-themed song-and-dancer is a thoroughly earnest endeavor, but earnestness doesn't necessarily ensure entertainment. Donna Murphy works extra hard as a glamorous Polish actress-turned-doddering Jewish grandmother, but to little avail.",
  "bwwScore": 3,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Broadway-Review-Roundup-THE-PEOPLE-IN-THE-PICTURE-Updating-Live-20110428",
  "fullText": "Holocaust-themed song-and-dancer is a thoroughly earnest endeavor, but earnestness doesn't necessarily ensure entertainment.\n\nThe 2010-2011 Broadway season wisps to a close with “The People in the Picture.” Holocaust-themed song-and-dancer is a thoroughly earnest endeavor, but earnestness doesn’t necessarily ensure entertainment. Donna Murphy works extra hard as a glamorous Polish actress-turned-doddering Jewish grandmother, but to little avail.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Music Industry Moves: Joy Oladokun Signs With Concord \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Miranda Lambert Sells Entire Song Catalog to Sony Music Publishing Nashville and Domain Capital\n\nRoot of the problem stems from book and lyrics by Iris Rainer Dart, a novelist (“Beaches”) making her Broadway bow. Story tells of Yiddish actress Raisel Rabinowitz — approaching senility and death in Greenwich Village — racing against time to tell her granddaughter Jennie about her comrades who were killed in the Warsaw ghetto. The so-called people in the picture are living ghosts, walking and dancing and singing their tales (circa 1935) to the little girl (circa 1977).\n\nDart has somehow seen fit to get music from the composer of “You Ain’t Nothin’ But a Hound Dog.” Mike Stoller, whose songs with Jerry Leiber sparked the long-running “Smokey Joe’s Cafe,” herewith makes his book musical debut at the age of 78. He is joined by one of his proteges, Artie Butler, who provides music for four songs. But the tunes, while not as catchy as Stoller’s “Jailhouse Rock” and “Stand by Me,” are not the problem; the die is cast in Dart’s very first lyric, which rhymes “skittish” with “Yiddish,” “see us” with “ideas.”\n\nDirector Leonard Foglia (“Master Class”) seems not to have had much creative input on the meandering piece. What’s more, someone should have restrained the artsy choreography by Andy Blankenbuehler (“In the Heights”), which is built on ersatz “Fiddler on the Roof” moves and at times borders on the laughable.\n\nMurphy plays the aged Bubbie extremely well, and in a flashback — playing a young girl whose body is inhabited by a Dybbuk (devil) while surrounded by four dancing rabbis — seems to channel Fanny Brice. The star is so good and so funny here that we can perhaps understand why she was attracted to the role.\n\nBut other than two of these zany flashbacks and one effective, especially dramatic ballad (“Selective Memory”) from Murphy, it’s a long evening filled with threadbare melodramatic machinations. Book perks up in the last 20 minutes, bringing tears to many in the audience, but it’s too little too late.\n\nVeteran funnymen Lewis J. Stadlen and Chip Zien pull through as minor members of the Warsaw players, handily compensating for subpar material. Alexander Gemignani is impressive in a dramatic role, and the 10-year-old Rachel Resheff is very good as Murphy’s granddaughter. Also on hand is Joyce Van Patten, who herself played a major kid role in Broadway’s first anti-Nazi play, the 1943 “Tomorrow the World.”\n\nThe musical’s scheduled November 2009 tryout, under the title “Laughing Matters,” was bumped from the Pasadena Playhouse in favor of “Baby It’s You!,” which opened on Broadway the night before “People in the Picture.” In this case, a developmental tryout would surely have helped.",
  "isFullReview": true,
  "textWordCount": 517,
  "archivePath": "data/archives/reviews/the-people-in-the-picture-2011/variety--steven-suskin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:33:11.881Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 517,
  "tierReason": "Full review text"
}