{
  "showId": "mamma-mia-2025",
  "outletId": "culture-sauce",
  "outlet": "Culture Sauce",
  "criticName": "Thom Geier",
  "url": "https://culturesauce.com/2025/08/14/mamma-mia-2025-broadway-review/",
  "publishDate": "August 14, 2025",
  "fullText": "Nobody could mistake Mamma Mia! for high art. Cardboard-cutout characters vamp through a ridiculous romantic plot, while beloved disco-era ABBA hits are shoehorned in often as clumsily as Cinderella's prince struggling to find the perfect fit for the lost slipper of his royal-ball dancing partner. But audiences still thrill to dancing queens. And Mamma Mia!, returning to Broadway nearly a quarter century after it began a long and glorious run at the Winter Garden Theatre (and later the Broadhurst), has an infectious, high-energy showmanship that's almost irrepressible.\n\nFans of the show, and they appear to be legion at the early performances at the Winter Garden, will find a production that appears to be a carbon copy of director Phyllida Law's original: from Mark Thompson's brightly colored set design and costumes, including a stylized re-creation of a Greek coastal taberna, to Howard Harrison's similarly primary-hued lighting to Anthony Van Laast's athletic and witty choreography — which again includes a routine in which buff wetsuit-wearing chorus boys do high kicks while wearing flippers.\n\nLaw repeats her duties here, and directs her talented cast to take a broad, English music-hall approach to the decidedly silly material. That's especially true of the three middle-aged women at the center of the story: Donna (Christine Sherrill), the former lead of a girl group now running a modest Greek hotel, and her two erstwhile backup singers, the sassy, thrice-married Tanya (Jalynn Steele) and the full-bodied singleton Rosie (Carly Sakolove). They cavort about the stage in full Christmas panto mode, turning bananas into the horns of a charging bull or paddles to resuscitate a collapsed comrade.\n\nThe three have reunited for the wedding of Donna's 20-year-old daughter, Sophie (Amy Weaver, bringing a perky youthfulness and a sweet voice), to a local guy named Sky (Grant Reynolds). This is a bit of stumper. Sophie, happily raised by her single mom without knowing the identity of her father, seems improbably eager to embark on married life that she's never really encountered herself. In early scenes with her gal pals, she also seems more like a naive preteen marveling that her mom could have ever had sex at all and reducing the romantic act to ellipses. Indeed, the telltale \"dot dot dots\" she finds in her mom's old diary lead her to glean the names of the three guys who might be her biological dad — and so she naturally invites all three to the nuptials.\n\nJust as naturally, all three turn up: the rugged adventurer Bill (Jim Newman), the demure former head-banger Harry (Rob Marnell), and the now-divorced architect Sam (Victor Wallace, reprising the role he played when the show closed on Broadway in 2015). Sam immediately emerges as the front-runner to rekindle his romance with Donna because they get the most duets together.\n\nThe plot is a bit of sub-Shakespeare-comedy balderdash, but the cast leans into the sitcommy cheesiness in a way that extends to the spirited production numbers. No, the songs don't always make sense with the story being told around them, and there are probably too many of them. Plus, I don't believe for a second that Steele's wonderfully no-nonsense Tanya really has a cougarish fling with the wiry twink named Pepper on Donna's staff (played with puppy-dog charm by Justin Sudderth) — but both performers embraces the implausible turns of the plot with an earnestness that almost manages to convince you. We believe because we want to believe, and because there's no danger of mistaking these cartoons for real people.\n\nSherrill, making her Broadway debut after a long career in Chicago and regional theater, is a natural at depicting Donna's survivalist spirit. She's also blessed with a lovely, vibrato-heavy voice that soars on the high notes and blends nicely with Wallace in their many duets. So what if she sounds more like a musical theater journeywoman than a former pop star of great repute? Weaver and Sakolove are also Broadway newbies who, like Sherrill, have been playing their roles for nearly two years on a successful 25th anniversary tour across the country. (Like The Wiz and the upcoming Beetlejuice revival at the Nederlander, bringing national tours to Broadway for lengthy or even open-ended runs is now a thing.)\n\nBut that's true to the origins of this musical, which followed its 1998 London premiere with a 2020 national tour before opening at the Winter Garden just days after the September 11 terrorist attack in 2001. The show was widely praised for its feel-good message in a dark time, and with helping to lure theatergoers and tourists back to Manhattan at a time when the city had a very visible target on its back. And the current production boasts the energy and spunk that you don't find in shows that have been running for years and years.\n\nMamma Mia! still has the power to connect with audiences in an old-fashioned, almost primal way. Chalk it up to the heartbeat provided by those familiar syncopated synthesizer beats (which, due to a clumsy sound mix, unfortunately drown out the vocals in some numbers). There's consolation in the familiar, in watching old episodes of classic sitcoms for the umpteenth time, in scrolling down and clicking on that '70s playlist, in grooving in your seat to the protracted three-song encore after the curtain call. And this production delivers on the promise that you can return to those comforts one more time. Here we go again. The winners really do take it all.",
  "isFullReview": true,
  "bwwExcerpt": "Nobody could mistake Mamma Mia! for high art. Cardboard-cutout characters vamp through a ridiculous romantic plot, while beloved disco-era ABBA hits are shoehorned in often as clumsily as Cinderella's prince struggling to find the perfect fit for the lost slipper of his royal-ball dancing partner. But audiences still thrill to dancing queens. And Mamma Mia!, returning to Broadway nearly a quarter century after it began a long and glorious run at the Winter Garden Theatre (and later the Broadhurst), has an infectious, high-energy showmanship that's almost irrepressible.",
  "originalScore": "4/5",
  "assignedScore": null,
  "source": "playwright-scraped",
  "scrapedAt": "2026-01-24T04:00:00.000Z",
  "bwwThumb": "Up",
  "bwwUrl": "https://culturesauce.com/2025/08/14/mamma-mia-2025-broadway-review/"
}
