{
  "showId": "mamma-mia-2025",
  "outletId": "pagesonstages-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.com/2025/08/26/mamma-mia/",
  "publishDate": null,
  "fullText": "The North American Broadway Tour of Mamma Mia! has made its way to New York City! Featuring some of ABBA’s most beloved songs and a lively cast of phenomenal dancers and singers, this production fills Broadway’s void of feel good shows with no philosophical agenda other than to get people dancing in their seats. It tells a lovingly familiar story with wonderfully funny choreography (Anthony Vaan Last), beautiful moments, and pure entertainment for entertainment’s sake. The world of the production is fleshed out with magnificent lighting (Howard Harrison), extravagant costuming (Mark Thompson), and sound (Bobby Aitken, Martin Koch) you can feel pulsing through the room. Mamma Mia! tells the story of a girl named Sophie (Amy Weaver) who never knew her father. She finds three possible dads in her mother’s diary and invites them all to her wedding, sure she will know which one is her biological father when she meets him. She doesn’t, and hilarity ensues for both her and her mother as both come to realize that it’s okay to lean on others every once in a while. Though Pages on Stages primarily breaks down thematic content, I’d like to take a moment to celebrate Mamma Mia! as one of the only shows that succeeds at being pure fun without feeling insipid. It’s a thoroughly enjoyable performance, and even in its most ridiculous, scuba-gear-wearing moments, it never crosses the line into cringe. As for this production, it is very clear that it was built to tour. The minimalist set (Mark Thompson) leaves ample space for the dancers. There is no automation or projection. In this sense, it is true to the time period in which it was written and the time period it recalls. The comedic moments are really beautifully played up, particularly “Dancing Queen” and “Take a Chance on Me.” Christine Sherrill’s rendition of “The Winner Takes it All” is the most nuanced and moving number of the show. Amy Weaver has a clear voice like a bell, and is a very charming and becoming Sophie. If I can offer one criticism, the frequency of offstage voices (possibly prerecorded Ableton tracks?) was a little disappointing and, at times, disconcerting. When most of the singers were not visible, it felt odd to hear full vocal chords and only see one mouth moving. I also felt like there were times when the dancers were possibly lip syncing. It would take real athleticism to do some of this choreography live— perhaps too much to be plausible. Overall, as the three song curtain call attests, Mamma Mia! leaves us all smiling and wanting more. We don’t have to learn something to enjoy it as phenomenal entrainment. It shines beautifully on its own merits as a good story and a good time. I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 470,
  "archivePath": "data/archives/reviews/mamma-mia-2025/pagesonstages-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:45:24.030Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}