{
  "showId": "doctor-zhivago-2015",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Unknown",
  "url": "http://www.theguardian.com/stage/2015/apr/21/doctor-zhivago-review-musical",
  "playbillVerdictUrl": "http://www.theguardian.com/stage/2015/apr/21/doctor-zhivago-review-musical",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Getting wiggy with it: Tam Mutu and Kelli Barratt in Doctor Zhivago. Photograph: Matthew Murphy/SuppliedView image in fullscreenGetting wiggy with it: Tam Mutu and Kelli Barratt in Doctor Zhivago. Photograph: Matthew Murphy/Supplied This article is more than 10 years oldReviewDoctor Zhivago review – a mega-musical sprinkled with inadvertent comedyThis article is more than 10 years oldThe Broadway Theater, New YorkMore overblown than overwhelming, this melodramatic musical has minimal impact despite some good songs – and Lara’s wig is ridiculous\n\nLate in the first act of Doctor Zhivago, Yurii Andreyevich, that “celebrated doctor-poet”, and the lissome Lara finally declare their love for each other.\n\n“Now,” they warble. “The only time is now.”\n\nAre they sure? Doctor Zhivago, based on the Boris Paternak novel and the David Lean flick, gallops across the first several decades of the 20th century. But the period it most resembles is the 1980s, with the spectacle-driven mega-musicals it birthed.\n\nNot that Doctor Zhivago, slickly directed by Des McAnuff, is especially mega. There’s no helicopter, no plunging chandelier, and while there are a couple of barricades, most of them are made of chairs. (If stock levels at local Ikeas are perilously low, you’ll know which show to blame.) But quite a lot of the budget seems to have gone to special effects – stage blood, stage smoke, stage gunshots, stage icicles, some preposterous projections.\n\nThe music is big and the cast is big and the emotions are definitely outsized. The story itself, which centres on a pair of lovers parted by strife and circumstance and plot devices, while Russia writhes toward a not-so-glorious revolution, suggests the epic. And yet the impact is oddly minimal.\n\nMaybe it’s the undistinguished book or Lara’s ridiculous wig or those silly icicles, but Doctor Zhivago seems a lot more overblown than overpowering. The style is pure melodrama, but most of the actors don’t have the stanchness or the lines to pull it off. I’m pretty sure a threat like “I may have to visit your student friend and tell him how you cry out with pleasure when we make love” was supposed to bring a shiver to the spine rather than a giggle to the lips, but there is unintentional comedy sprinkled throughout. I still haven’t recovered from the Russian breakdancing bit – or the vomit that followed.\n\nWhich is a shame, as many of the songs are skillful. The composer, Lucy Simon, wrote The Secret Garden, an utterly lovely chamber piece, and if a few of the tunes and orchestrations here border on bombast or balalaika overload, many of them communicate tone and character eloquently, particularly the songs for the women – like Lara’s admission of erotic fixation, When the Music Played, or the duet for Lara and Zhivago’s wife, Tonia, It Comes as No Surprise.\n\nLora Lee Gayer is a touching Tonia and Paul Alexander Nolan does fine work in the nearly impossible role of the revolutionary Pasha. Kelli Barrett has a lovely voice, but can’t sell Lara as the cynosure of every man’s desire. (That wig doesn’t help.) And if Tam Mutu doesn’t seem the poetry-writing type, he has a pleasantly romantic baritone and very handsome looks. (Zhivago loses his coat on the run from the Red Army. Could he not have lost his shirt, too? Or maybe wrestled a bear?) If only he had something in his doctor’s bag to fix this show.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 582,
  "archivePath": "data/archives/reviews/doctor-zhivago-2015/guardian--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:08:04.668Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 582,
  "tierReason": "Full review text"
}