{
  "showId": "pirates-the-penzance-musical-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2025/04/24/pirates-the-penzance-musical-not-for-purists-but-fun-for-everyone-else/",
  "publishDate": "2025-04-24T21:58:19",
  "fullText": "The title of the Roundabout’s new Broadway production of Gilbert and Sullivan’s classic operetta gives you the first clue. G&S purists should probably stay away from Pirates! The Penzance Musical, which takes more than few liberties with its source material. The rest of you, however, are bound to have a swell time with this jolly reimagining that, if it doesn’t quite erase memories of the classic Joe Papp production some forty-four years ago (!), proves thoroughly entertaining in its own right. One might even say it’s very model of a modern revival.\n\nThe creators of the show seem to have recognized that an explanation must be made of the fact that the show’s setting has been changed to New Orleans’ French Quarter. I’m not referring to director Scott Ellis or adaptor Rupert Holmes, but rather W.S. Gilbert (David Hyde Pierce) and Arthur Sullivan (Preston Truman Boyd), who introduce the proceedings by informing us that the reason for the show’s premiere on our shores is to guarantee an ironclad U.S. copyright, something they unfortunately neglected with their previous work, H.M.S. Pinafore. They make a quick exit, but rest assured that both actors reappear in the show proper, as the Major-General and Sergeant of Police respectively.\n\nThe story largely remains the same, revolving around the comic escapades of the none-too-successful Pirate King (Broadway heartthrob Ramin Karimloo) and his merry band of buccaneers; Frederic (Nicholas Barasch), his lieutenant who was apprenticed by mistake; Ruth (Jinkx Monsoon, RuPaul’s Drag Race), Frederic’s nursemaid, whom he believes is beautiful, mainly because he’s never seen another woman; Mabel (Samantha Williams), the comely young maiden who makes him realize just how wrong he’s been; and her father the Major-General, a bumbling military man who’s assigned the show’s funniest patter song.\n\nThe music mostly hews to the original as well, although the orchestrations by Joseph Joubert reflect the setting by providing jazzy and bluesy elements to some of the numbers. Several of the original songs have been cut, and there are interpolations from other G&S shows. And some lyrics have been entirely rewritten, such as the finale, “We’re All From Someplace Else,” that uses a Pinafore number as a springboard for a rather too on-the-nose timely message about immigrants.\n\nBut the comic heart and soul of Penzance remains happily intact, thanks to the boisterous staging and the riotous performances by its stars. Karimloo hams it up perfectly as the boisterous Pirate King who wastes no opportunity to show off his athletic prowess and finds it perplexing that all of his would-be victims turn out to be pitiful orphans. Monsoon is a hoot as the lovelorn Ruth who gets a vocal moment to shine with “Alone, and Yet Alive” from The Mikado. Barasch is endearingly goofy as the sweet Frederick, and Boyd makes a comedic meal out of such numbers as “A Policeman’s Lot.” Williams has comparatively little to do as Mabel but shows off her powerful vocal chops with “Poor Wand’ring One” and “Oh, Dry the Glistening Tear.”\n\nAnd then there’s Hyde Pierce, who effortlessly steals the show every moment he’s onstage with his droll delivery and perfect comic timing. Like Nathan Lane, he’s effortlessly funny in everything he does, and he rightly stops the show, not once but twice, with his hilarious “I Am the Very Model of a Modern Major-General” in which he doesn’t miss a verbal beat.\n\nDirector Ellis keeps things moving at a properly fast pace, even if the second act occasionally falters. And Warren Carlyle has outdone himself with his stellar choreography that inventively makes use of such things as semaphores and washboards; the “Cat-Like Tread” number, not surprisingly, proves a highlight.\n\nProviding just around two hours of silly joy, Pirates! The Penzance Musical would make Gilbert and Sullivan proud. They might object to some of the changes, but they would surely approve of the pleasure it’s providing to modern-day audiences.\n\nPirates! The Penzance Musical opened April 24, 2025, at the Todd Haimes Theatre and runs through July 27. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "nyc-theatre",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "nycTheatreExcerpt": "\"Providing just around two hours of silly joy, Pirates! The Penzance Musical would make Gilbert and Sullivan proud. They might object to some of the changes, but they would surely approve of the pleasure it's providing to modern-day audiences.\"",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2025/04/24/pirates-the-penzance-musical-bright-and-breezy-in-the-big-easy/"
}
