{
  "showId": "pirates-the-penzance-musical-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2025/04/24/pirates-the-penzance-musical-bright-and-breezy-in-the-big-easy/",
  "publishDate": "2025-04-24T21:59:20",
  "fullText": "Did you know The Pirates of Penzance was first seen in New York City? The soon to become legendary British team of W.S. Gilbert and Arthur Sullivan premiered their fifth operetta here in 1879 to establish an American copyright, so their latest work would not be pirated like dozens of unauthorized H.M.S. Pinafore troupes then playing around the country and paying them no royalties. That’s musical theater trivia, of course, but it is the notion behind the concept for Pirates! The Penzance Musical, which bowed in a swell Broadway production (that’s swell as in beaucoup big and buoyant) at the Todd Haimes Theatre on Thursday.\n\nRather than merely revive The Pirates of Penzance as written, or in the celebrated version the Public Theater unleashed in Central Park in 1980 that moved to a two-year Broadway run, Roundabout Theatre Company launches a bright and breezy adaptation aimed to entertain family audiences. Devised by Rupert Holmes, the inventive writer-composer best known for The Mystery of Edwin Drood, this remix of the Victorian romp appears to involve perhaps 70% of the original operetta plus another ten percent being songs borrowed from other G&S works. The rest is new material, including some thoroughly revised lyrics by Holmes.\n\nEssentially, Gilbert and Sullivan visit New Orleans with a traveling troupe in 1880 to secure the copyright on The Pirates of Penzance. Like some voodoo spell, the heady atmosphere of the Big Easy results in the collaborators reworking their English operetta into what Gilbert calls a “bubbling musical jambalaya” reflecting regional culture and so on they go with the show: The original plot is not greatly altered as the ever-dutiful Frederic tries to quit his career as a pirate but is foiled by various topsy-turvy circumstances. The significant changes here are heard in the music department as Holmes, musical director Joseph Joubert and Daryl Waters take the starch out of Sullivan’s songs and spicily rearrange them with jazzy, bluesy, sometimes Caribbean rhythms and orchestrations. The “Chattering Chorus” disappears and “Poor Wand’ring One” gets short shrift here, but the “Nightmare Song” from Iolanthe is choreographed into a cleverly spooky interlude. So is “We Sail the Ocean Blue” from H.M.S. Pinafore, which balloons into a hot, foot-stomping, Dixieland-style parade as the mad first act finale sees the entire company merrily rattling away on metal washboards.\n\nBefore mentioning the excellent principals and company, let’s note how Scott Ellis, the director, has lavishly blown Roundabout’s bucks on this show, which he expertly stages at a skipping pace. With nary a projected image anywhere – thank you! — David Rockwell’s pretty New Orleans settings easily provide a pirate ship, a lollipop sun and moon, and even a blue bayou, romantically lighted by Donald Holder. Parasols to tap shoes to fluffy ruffles in the middle, the fanciful costumes designed by Linda Cho move beautifully along with Warren Carlyle’s lovingly old-school choreography and the rousing swordplay bouts directed by Sordelet, Inc. The only significant trouble with this giddy Pirates! is that it’s really too much of a good thing and might be better were it one show-stopper fewer or perhaps ten minutes less. Still, it’s fun to hear gags that are nearly 150 years old, like the silly “orphan/often” exchange, still raise laughs today and it’s great to see Roundabout introduce a Gilbert & Sullivan classic, more or less, to a fresh audience.\n\nSporting mutton-chop whiskers in his dual role as Gilbert playing Major-General Stanley, David Hyde Pierce rattles through several patter numbers with perfect assurance and depicts the retired soldier with a befuddled dignity droll to behold. Robust and roguish as the Pirate King, Ramin Karimloo shows off his magnificent baritone and the gleaming chest from which it comes. Genial as Sullivan, Preston Truman Boyd amiably appears as the Sergeant of Police whose midnight gambols with the Stanley daughters and his tap-happy flatfoot platoon are highlights of the second act. Nicholas Barasch makes a perfectly ingenuous Frederic and sings the role handsomely opposite Samantha Williams’ flirtatious Mabel. Jinkx Monsoon ably cuts her good-natured Ruth along the mildly goofy lines of Andrea Martin, but gets stuck with one of Katisha’s arias from The Mikado reworked as a not so hot torch song; better had they simply given Ruth a new costume for act two. The members of the ensemble perform with fresh voices and considerable vitality. Finally, any child who witnesses David Hyde Pierce reel off “I Am the Very Model of a Modern Major-General,” backed by the ensemble cheerily waving blue and white flags during the choruses, will either wake up screaming some night or will recall this sequence for the rest of their lives. Family audiences: Be warned.\n\nPirates! The Penzance Musical opened April 24, 2025, at the Todd Haimes Theatre and runs through July 27. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
