{
  "showId": "pirates-the-penzance-musical-2025",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2025/04/24/theater/pirates-penzance-musical-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2025/04/24/theater/pirates-penzance-musical-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "nyc-theatre",
    "bww-roundup"
  ],
  "nycTheatreExcerpt": "\"Except for the central performance by David Hyde Pierce, marvelously underplaying the tongue-twisting Major-General, the production has a sweaty quality, bordering on frenzy, that's hopelessly at odds with the cool wit of the original.\"",
  "bwwExcerpt": "Despite such mismatches between the original and the remake, “Pirates!” is still a feather in the tricorn of the Roundabout Theater Company, which produced and nurtured it. Operettas don’t last 146 years just because they’re good. (I love Gilbert and Sullivan’s “Ruddigore” too, but have never seen it except at camp.) Longevity like that requires faith not only in the past but also in the future.",
  "bwwThumb": "Meh",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PIRATES-THE-PENZANCE-MUSICAL-Opens-On-Broadway-Starring-Ramin-Karimloo-Jinkx-Monsoon-and-More-20250424",
  "fullText": "W.S. Gilbert and Arthur Sullivan, the operetta kings of 19th-century Britain, had a hit in America with “H.M.S. Pinafore,” but they reaped no American fortune from it. Instead, lacking U.S. copyright protection, their glorious piffle spread in the States like spring colds, causing fits of laughter but returning no royalties. By the time the team from London arrived in Manhattan in late 1878, bringing the real thing with them, 15 pirate productions were already running.\n\nIs it any wonder that their next operetta, in 1879, was called, with a wink, “The Pirates of Penzance”? And that they opened it in New York instead of London to avoid the financial fate of “Pinafore”? Gilbert and Sullivan were sharp satirists but also savvy businessmen.\n\nMore than any of their 13 other so-called Savoy operas, “Pirates” has borne that out, returning to Broadway regularly ever since. (The Public Theater’s 1981 revival, starring Kevin Kline and Linda Ronstadt, ran longer than any previous production anywhere.) For a work so old, in such a seemingly passé genre, whose touchstones and targets are literally Victorian, that’s astonishing: a tribute to the resilience of Gilbert’s words, the delight of Sullivan’s music and our willingness to make common cause with the past.\n\nThough jolly enough, the latest Broadway incarnation, which opened on Thursday at the Todd Haimes Theater, trusts neither the material nor us as much as it might. Clumsily but accurately retitled “Pirates! The Penzance Musical,” and transported to post-Reconstruction New Orleans, it is also significantly altered in tone. Except for the central performance by David Hyde Pierce, marvelously underplaying the tongue-twisting Major-General, the production has a sweaty quality, bordering on frenzy, that’s hopelessly at odds with the cool wit of the original.\n\nPerhaps the sweat is a nod to the story’s steamy new location, or a sign of the effort it took to get it there. As adapted by Rupert Holmes, and directed by Scott Ellis, “Pirates” now takes place in a French Quarter theater — a clever touch, given Louisiana’s historic proximity to actual piracy, but one that requires laborious workarounds and, apparently, an uplifting lesson.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 375,
  "archivePath": "data/archives/reviews/pirates-the-penzance-musical-2025/nytimes--jesse-green_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:26:45.953Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250425024232",
  "archiveOrgUrl": "http://web.archive.org/web/20250425024232/https://www.nytimes.com/2025/04/24/theater/pirates-penzance-musical-review.html",
  "contentTier": "needs-rescrape",
  "wordCount": 375,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T08:37:12.481Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text cuts off mid-sentence and ends with a technical error message about retrieving content and enabling JavaScript, making it impossible to determine the critic's final verdict; openai: The text is truncated with an error message about retrieving content, indicating it's not a complete review.; gemini: The review is cut off mid-sentence, preventing a clear understanding of the critic's final verdict.",
  "promptVersion": "5.2.0",
  "showScoreExcerpt": "\"Though jolly enough, the latest Broadway incarnation... has a sweaty quality, bordering on frenzy, that’s hopelessly at odds with the cool wit of the original.\"\n\nRead more"
}
