{
  "showId": "13-2008",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "https://www.nytimes.com/2008/02/13/theater/reviews/13thic.html",
  "publishDate": "October 6, 2008",
  "fullText": "“Here I am, young and pretty/Still I’m sweeping up the floor again,” sings the Oregon hipster Bean (Julie Fitzpatrick) in the opening of the short musical “Co-Op.” It’s a bad start. What painfully shy girl suffering from low self-esteem calls herself pretty? But don’t lose faith so soon.\n\nBlessed with several tuneful songs by Matt Schatz, this meet-cute musical stars performers whose delicate, wavering voices nicely complement their characters’ nervous states of mind. Steve Boyer plays the equally angst-ridden (though not quite as unhappy) Ethan with an earnestness that you find almost exclusively in musicals. Embarrassing things are said, eyes are rolled, and a connection is made. By the end of this persuasively sincere one-act, you may well be charmed.\n\nWhether that happens again in the 2008 edition of “Thicker Than Water,” a program of seven short, slight works about young people falling in love and glaring angrily at their parents, may depend on your taste for angst. There’s a lot on display.\n\nAnd maybe that’s not surprising for this, the ninth collection of new plays and musicals by members of Youngblood, the Ensemble Studio Theater project for playwrights under 30, whose alumni include Christopher Shinn and Lucy Thurber.\n\n“It’ll Soon Be Here,” by Delaney Britt Brewer, is yet another musical about a pretty, awkward and unusually named girl  this time it’s Rainbow (Jenny Greer)  mooning over a boy. Set during a Bill Clinton campaign rally in 1992, back when he was the politician peddling hope and change, the show begins with Rainbow bickering with her mom (Debbie Lee Jones), a former folk singer. But maybe Mom is not so lame after all. Rainbow is stunned to discover that Eric (Lance Rubin), a dreamy older boy, is a fan.\n\nThere is a similar message in “La Fête (The Holiday),” Daria Polatin’s shrill dysfunctional-family drama, in which a pouty daughter feels guilty about how she is treating her mother. It almost makes you wonder if someone’s parents are responsible for these plays.\n\nPerish the thought. There are enough hookups and heartbreak in the freshman dorm rooms of Emily Chadick Weiss’s frothy soap opera “Both” to upset anyone who has spent money on college. This play benefits from some fine performances, including Maureen Sebastian’s as the giggly Upper East Sider Josephine and Mr. Boyer’s as Nate, another sensitive naïf.\n\nDespite the plays’ relatively similar themes, “Thicker Than Water” can seem like an unwieldy collection of parts. The set changes take too long, largely because of an unnecessary reliance on clunky furniture. And the evening, filled with more sweetness than substance, could benefit from trimming a play or two. A few light confections can be lovely, but too many in one night may give you a stomachache.\n\n“Thicker Than Water” continues through March 1 at the Ensemble Studio Theater, 549 West 52nd Street, Clinton; (212) 352-3101, ensemblestudiotheatre.org.",
  "isFullReview": true,
  "dtliExcerpt": "The show has a sunny, optimistic spirit that is hard to resist, even when the material feels thin. The young performers attack their roles with an enthusiasm that proves infectious.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The show has a sunny, optimistic spirit that is hard to resist, even when the material feels thin. The young performers attack their roles with an enthusiasm that proves infectious.",
  "contentTier": "complete",
  "contentTierReason": "Short text (30 words)",
  "previousUrl": "https://www.nytimes.com/2008/10/06/theater/reviews/06thir.html",
  "urlDiscoveredAt": "2026-02-03T10:08:14.486Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 476,
  "archivePath": "data/archives/reviews/13-2008/nytimes--charles-isherwood_2026-02-03.html",
  "textFetchedAt": "2026-02-03T10:08:14.499Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wordCount": 476,
  "tierReason": "Full review text"
}