{
  "showId": "the-picture-of-dorian-gray-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Roma Torre",
  "url": "https://nystagereview.com/2025/03/27/the-picture-of-dorian-gray-a-masterpiece-from-page-to-stage/",
  "publishDate": "2025-03-27T21:58:33",
  "fullText": "Wow!!! There really are no superlatives that could come close to capturing the mastery of Sarah Snook’s solo performance in The Picture of Dorian Gray. “Solo” is something of a misnomer if you consider the ensemble of 26 characters plus the narrator she portrays non-stop in the span of two intermissionless hours. The production is the brainchild of a fellow Aussie, Kip Williams, who found inspiration in Oscar Wilde’s 1890 novel with the idea that each of us is basically a myriad of different lives and that life itself is “one grand act of theatre.” And that is precisely how I would describe the phenomenal work they’ve concocted on the Music Box stage.\n\nThis is not story theater as one might imagine. It is a wondrous merging of technical wizardry, clever stagecraft and incomparable artistry. As you enter the theater, there’s little more than a giant screen suspended on a bare stage. When it begins, we hear Snook’s voice narrating the scene set in an artist’s studio as we meet the artist Basil Hallward and his friend Lord Henry Wotton discussing Basil’s portrait of Dorian Gray, a young man they find “wonderfully handsome.” Snook appears on the giant screen as Dorian, and magically she also becomes the two older men as they all converse about “a new hedonism” that worships the beauty of youth above all else. Lord Henry’s hedonistic ideals make such a powerful impression on Dorian, he starts to fret about his eventual old age “growing horrible and dreadful”; and it drives him to wish for eternal youth, saying “If it were I who was to be always young, and the picture that was to grow old! I would give my soul for that!” It is a Faustian bargain that becomes a horror story.\n\nSnook was brilliant as Shiv in TV’s “Succession” but that was just a glimpse of her extraordinary talents. With the assistance of five “camera operators” who follow her around, she embodies one character after another as the story unfolds on various screens that seem to drop out of nowhere. Sometimes the sequences feature pre-recorded projections in which we see Snook having a conversation with herself dressed in the guise of others on the screen. It’s thrilling to watch as the cameras go in for closeups revealing Snook’s expressive face and then widen out as she races across the stage, talking all the while. She’s a quick change artist as well, instantly donning wigs and costumes while altering her voice and mannerisms to become a dandy, a dowager, a debauched dilettante without missing a beat. Marg Horwell deserves tremendous credit for her innovative sets and costumes injecting whimsical touches in her designs.\n\nWilliams did the adaptation as well as the direction, which is all intricately choreographed. As the action builds, the storytelling becomes more complex, and it’s jaw-dropping to see Snook leading the troupe of technicians around the stage, timing the cues down to the second to match the pre-recorded interactions.They have fun with it as well; at one point Snook and the camera operators actually dance together and there are moments when Snook and her screen character seem to forget which one of them is supposed to be in the scene. They talk over each other before one of them ends up walking off. The energy, the concentration and the timing required to pull it off with such precision is a marvel in itself, and it’s no wonder that there’s no understudy listed in the Playbill for Snook. She is peerless!\n\nThe entire technical team deserves a huge bow. Kudos especially to video designer David Bergman whose work here is ingenious and will likely set a new standard for the stage. Whether that’s a plus for the future of theater remains to be seen.\n\nWhile the story is more than a century old, Dorian’s superficial obsession with youth and appearance fits right into today’s selfie culture. The creative team was obviously aiming for parallels as they tossed in a bunch of anachronistic touches. When Lord Henry pays a social visit to another aristocrat, a syringe appears from the side of the screen, suggesting a botox injection. In a climactic scene Dorian transforms into a 21st century influencer staring into a cell phone frantically flipping through a face altering app to make himself appear more and more beautiful. We can see his features on the big screen behind him as the lips get larger, nose gets smaller, cheeks become ruddier till finally he turns into a grotesque avatar of himself.\n\nThe production is full of paradoxes like that. It’s both harrowing and funny even as we witness murder most foul. Wilde was known for such contradictions in his works.…Dorian Gray was his only novel and it put the writer, famed for his witty plays, at odds with the critics who deemed the story morally depraved. They didn’t get the point but Williams and company certainly do. Through comedy, the narrative exposes the tragic consequences of our fixation with youth and beauty. It was true in the 19th century as much as it is today; and I bet Mr. Wilde is somehow looking down at this latest incarnation of his great work and laughing all the way.\n\nThe Picture of Dorian Gray opened March 27, 2025 at the Music Box Theatre and runs through June 15. Tickets and information: doriangrayplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "This is not story theater as one might imagine. It is a wondrous merging of technical wizardry, clever stagecraft and incomparable artistry. As you enter the theater, there’s little more than a giant screen suspended on a bare stage. When it begins, we hear Snook’s voice narrating the scene set in an artist’s studio as we meet the artist Basil Hallward and his friend Lord Henry Wotton discussing Basil’s portrait of Dorian Gray, a young man they find “wonderfully handsome.” Snook appears on the giant screen as Dorian, and magically she also becomes the two older men as they all converse about “a new hedonism” that worships the beauty of youth above all else.",
  "bwwScore": 10
}
