{
  "showId": "the-picture-of-dorian-gray-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2025/03/27/the-picture-of-dorian-gray-sarah-snook-slays-with-multiple-selfies-and-multimedia-screens/",
  "publishDate": "2025-03-27T21:57:14",
  "fullText": "Narcissism rules supreme at The Music Box, where The Picture of Dorian Gray stars Sarah Snook acting with, against or despite dozens of other Sarah Snooks within a complex mix of live action and recorded video that simultaneously is marvelous and horrifying to witness. Although this award-winning production by the Sydney Theatre Company, which opened Thursday, might be described as a solo event, in actuality five black-clad camera operators ceaselessly scurry around Snook in varying clusters, their lenses magnifying her face across an array of screens.\n\nProviding thousands of video angles, the crew projects a nonstop two-hour odyssey as Snook wanders, rambles or otherwise traverses the stage – a few times going backstage – as she acts out a cautionary Gothic tale of self-obsession. At times Snook interacts in sync with recorded videos of herself garbed in quasi-Victorian costume as figures in the 1891 classic by Oscar Wilde about a London gentleman who sacrifices his soul to stay agelessly beautiful.\n\nAt its glittering best, The Picture of Dorian Gray frames a bravura performance by Snook, reknowned for the HBO series Succession. Snook’s feat of memorization and concentration alone is remarkable as she confidently spools out miles of narration and dialogue all the while roaming the stage – amid a huddle of camera operators – and brightly assuming the voices and attitudes of more than a score of individuals. Writer-director Kip Williams’ respectful adaptation stays faithful to the novel while arranging it to be interpreted by a single artist augmented by multimedia technology.\n\nComposed in a cool distillation of Wilde’s prose, the saga of Mr. Dorian Gray’s apotheosis as a self-involved dreamboat and his journey into decadence and murder is driven by narrative voices, pre-recorded or spoken by Snook. Even as she talks, Snook is dressed up or out of clothes, wigs, and make-up by her kuroko-like posse to incarnate key individuals, notably among them the sardonic dandy Lord Henry Wotton, tragic ingénue Sibyl Vane and, of course, the beauty-into-beast Dorian himself. Snook’s characterizations are wholly integrated into the complex physical and technological production that increasingly envelops and enlarges her appearance.\n\nInitially the stage presents a shadowy void, where in the center hangs a large, dark video screen that activates when Snook and the camera crew arrive. As the show proceeds, additional panels materialize. Chunks of actual scenery appear only to vanish as needed; a garden urn brimming with Technicolor blossoms, a cute red puppet playhouse for Sibyl’s thesping, a surprising gallery of ancestor portraits, and more, all smartly realized by scenic and costume designer Marg Horwell. These scenic whatnots and omnipresent video equipment are strategically lighted to fulfill dramatic and technical demands by designer Nick Schlieper. Suspended above the action to provide individual and collective views of Snook’s doings, the screens can move separately or together in varying directions.\n\nMidway through the tale as self-besotted Dorian plunges into a hedonistic rave of cocaine, disco music and fuchsia lighting, Snook raises on high a mobile phone and wildly whirls around the stage, grabbing selfies that light up all of the screens. The camera filters soon blow up Dorian’s features with grotesque lips and eyes; images initially comical and then growing monstrous, especially when projected across multiple surfaces. It is a disturbing, brilliant sequence reflecting the mad narcissism at the heart of the dark tale.\n\nSimilar nice bits of shiny stagecraft pop up throughout Williams’ inventive staging, especially the deft interactions of Snook in the flesh with the Snook(s) amid the video sequences designed by David Bergman. Making so much of it happen is the ace camera crew known individually as clew, Luka Kain, Natalie Rich, Benjamin Sheen and Dara Woo, whose swift moves around their star suggests a busy flock of black hummingbirds.\n\nBack in the 1890s and for many years after, the novel was notorious for its homoerotic and bisexual undertones. Today, as Snook energetically tackles a predominantly male cast of characters, the tone of her broad performances is comically ambisexual. Lord Henry’s mustachios are patently fake. The curly first wig among Dorian’s ever-morphing blond coiffeurs – all the hair is big and fabulous – calls to mind a Harpo more than an Apollo. The flashy costumes meld Victorian fancies with nowadays accessories, just like the melodramatic score from composer and sound designer Clemence Williams samples familiar themes by Mozart, Strauss and Vivaldi with pop music (to say nothing of Barbara Harris caroling “Gorgeous” from The Apple Tree cast album). For much of its length, the director and performer point and punctuate the play in order to provoke laughter – Sybil’s flop as Juliet is hilarious rather than pathetic – so when they finally strive to forge a dark, momentous conclusion, it scarcely resonates.\n\nAlthough The Picture of Dorian Gray is imaginatively executed and the event is undeniably entertaining, its omnipresent use of video bolstering a lone performer is the latest example of a dubious trend in the theater. Who wants to pay to see a Broadway show and then watch movies? Frankly, the event proved more exhausting than exhilarating to my elderly Boomer taste and attention skills. Probably the generations who grew up on those big screens at home and little screens in their hands will love a hot date with Sarah Snook in such a cool show.\n\nThe Picture of Dorian Gray opened March 27, 2025 at the Music Box Theatre and runs through June 15. Tickets and information: doriangrayplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
