{
  "showId": "the-picture-of-dorian-gray-2025",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Allison Considine",
  "url": "https://www.newyorktheatreguide.com/reviews/the-picture-of-dorian-gray-broadway-review-sarah-snook",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/the-picture-of-dorian-gray-broadway-review-sarah-snook",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Read our review of The Picture of Dorian Gray on Broadway, a solo adaptation of Oscar Wilde's classic novel starring Succession Emmy Award winner Sarah Snook. The camera loves Sarah Snook. In this one-woman stage adaptation of Oscar Wilde’s only novel, The Picture of Dorian Gray, Snook masterfully plays to both the camera and the audience at the Music Box Theatre in a career-defining performance. The Picture of Dorian Gray flips the script on the solo show and offers the most innovative use of cameras on Broadway to date. Snook tackles dozens of roles with remarkable aplomb, from a cynical aristocrat to a Cockney maid to the dynamic protagonist and beyond. This is where the cameras come in: the live Snook shares scenes with pre-recorded footage of herself. The camera also captures her performance in real time, portraying her expressive face on large screens suspended above the stage. Almost like a 19th-century portrait. Written and adapted by Kip Williams, the show playfully explores the timeless obsession with youth and beauty. It juxtaposes these ideals in the Victorian era — with corsets and wigs — and the modern era, with tools like Facetune and lip fillers. At its core, the production celebrates Wilde’s brilliant storytelling while offering new insights to the 1890 book. And while the source material is dark (spoiler alert: the title character sells his soul), Williams and Snook imbue this production with pure joy. For a comic bit, Snook and a pre-recorded version of herself have overlapping dialogue and argue with each other (themselves?) about who can tell the next part of the story. At my performance, Snook was having so much fun on stage she made herself laugh more than once. It’s a good thing she was laughing because if she wasn’t, the tour-de-force performance might have made her cry. I was exhausted and completely enthralled by Snook’s boundless energy onstage. The 2-hour, intermissionless play gave few opportunities for Snook to catch a breath, let alone take a sip of water. Her performance is a masterpiece in both the physical demands of theatre and the brilliance of camera work, with every subtle rise of an eyebrow captured on screen. She deserved all the cheers at the multiple curtain calls, and a very long nap. The Picture of Dorian Gray, adapted by Kip Williams, is based on Oscar Wilde’s 1890 novel of the same name. The story follows Dorian Gray, an innocent young man whose beauty is immortalized in a portrait. Dorian makes a fateful wish that he would sell his soul to remain as beautiful as his picture. As Dorian grows older, his face remains youthful and untouched, but the portrait becomes distorted and grotesque, representing the corruption of his soul and the consequences of his hedonistic lifestyle. Williams's production first wowed audiences in London in 2024, where Sarah Snook won an Olivier Award for her performance. And while Snook is the requisite star, the production is made possible with a small army of camera operators who also move set pieces and help Snook into wigs and costume pieces on stage. Everything requires incredibly precise blocking, and in some scenes, the camera operators dance around Snook in careful choreography. On the review aggregator Show-Score, The Picture of Dorian Gray has an audience approval score of 91%, with audiences praising Snook’s performance and the innovative staging. Read more audience reviews of The Picture of Dorian Gray on Show-Score. You don’t have to have read The Picture of Dorian Gray to appreciate this theatrical marvel. From the storytelling and innovative staging to Sarah Snook’s incredible performance as numerous characters, it’s a show you won’t want to miss. Learn more and get The Picture of Dorian Gray tickets on New York Theatre Guide. The Picture of Dorian Gray is at the Music Box Theatre through June 29. Photo credit: Sarah Snook in The Picture of Dorian Gray. (Photos by Marc Brenner) Book tickets for The Picture of Dorian Gray on New York Theatre Guide. The Picture of Dorian Gray is playing at Music Box Theatre. The theatre is located at 239 West 45th Street (between Broadway and 8th Avenue), New York, 10036. The recommended age for The Picture of Dorian Gray is Ages 4+. Children under 4 years old will not be admitted.. The running time of The Picture of Dorian Gray is 2hr. No intermission. The original book is by Oscar Wilde, now adapted for the stage in an enthralling production from Kip Williams. Winning an Olivier Award for this play, \"Sarah Snook is astonishing,\" The Washington Post wrote. \"So revolutionary, remarkable, and dazzling.\" The show enjoyed five-star reviews in London and is now coming to the US for Snook's Broadway debut. There is no set age recommendation yet but the play has strong themes and audiences under four are not allowed in Broadway theatres. Originally published on Mar 27, 202522:00",
  "isFullReview": true,
  "textWordCount": 812,
  "archivePath": "data/archives/reviews/the-picture-of-dorian-gray-2025/nytg--allison-considine_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:48:29.602Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 812,
  "tierReason": "Full review text"
}