{
  "showId": "the-picture-of-dorian-gray-2025",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2025/03/27/theater/picture-of-dorian-gray-review-snook.html#:~:text=Her%20closety%20Hallward%20is%20fantastically,of%20the%20play's%20two%20hours.",
  "playbillVerdictUrl": "https://www.nytimes.com/2025/03/27/theater/picture-of-dorian-gray-review-snook.html#:~:text=Her%20closety%20Hallward%20is%20fantastically,of%20the%20play's%20two%20hours.",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "An LED screen more than 16 feet tall. Four smaller ones drifting like clouds. Another that has a kind of walk-on cameo. Five camera operators with their electronic burdens. Nine people dashing every which way with wardrobe, wigs and whatnot. Three million pixels, in case you’re counting. Sixteen million colors. Two cellphones, at least on a recent glitchy night when the first malfunctioned. And one Sarah Snook.\n\nOr rather a multitude of Snooks.\n\nThese are among the many wonders you’ll find onstage at the Music Box Theater, where a technologically spectacular adaptation of “The Picture of Dorian Gray,” with Snook playing 26 roles, opened on Thursday.\n\nWhat you won’t find is “The Picture of Dorian Gray.”\n\nThe 1890 magazine story by Oscar Wilde, which he novelized in 1891, has proved irresistible to adapters, thanks to its nifty plot device: a portrait that ages instead of the sitter. The more the gorgeous Dorian Gray falls under the decadent influence of Lord Henry Wotton, the uglier the painting by Basil Hallward becomes.\n\nTo get to that plot, though, adapters have to adapt out a lot because what Wilde wrote is less the psychological thriller they imagine than a perfumed treatise on aesthetic philosophy. Another thing usually sacrificed is the homosexual undercurrent, which, even after expurgation by the story’s first editors, was deep enough to drown in. Convicted of “gross indecency” in 1895, Wilde was sentenced to two years’ imprisonment, with hard labor, and died, just 46, in 1900. “Dorian Gray” was part of the evidence.\n\nLike the 1945 M-G-M movie, the current adaptation, written and directed by Kip Williams, downplays the treatise aspects. The queerness, though, is frank if complicated, in part because Snook, an Emmy-winning star of “Succession,” is still a woman while playing a man. Or not even a man. Her cherubic, shiny-cheeked Dorian is less the godlike 20-year-old of the novel than a barely pubescent boy.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 341,
  "archivePath": "data/archives/reviews/the-picture-of-dorian-gray-2025/nytimes--jesse-green_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:19:53.717Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250516140848",
  "archiveOrgUrl": "http://web.archive.org/web/20250516140848/https://www.nytimes.com/2025/03/27/theater/picture-of-dorian-gray-review-snook.html",
  "contentTier": "needs-rescrape",
  "wordCount": 341,
  "tierReason": "Full review text",
  "showScoreExcerpt": "\"It’s that the technology dominates all other values, including Wilde’s, often denying the human contact, and contract, that are at the heart of theater’s effectiveness.”\n\nRead more",
  "rejectedAt": "2026-02-07T05:51:53.670Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: Review text is truncated with a JavaScript error message at the end, making it impossible to determine the critic's verdict or recommendation; openai: The text is interrupted with a message about enabling JavaScript and verifying access, indicating it's not a complete review.; gemini: The review is cut off mid-sentence, preventing a clear understanding of the critic's final verdict.",
  "promptVersion": "5.2.0",
  "bwwExcerpt": "Yet it’s not technology itself that leaves “Dorian Gray” feeling so brittle where “Vanya” is a tear fest. It’s that the technology dominates all other values, including Wilde’s, often denying the human contact, and contract, that are at the heart of theater’s effectiveness. Some important scenes, though shot live onstage, must be watched onscreen because the screen itself blocks the upper half of Snook’s body. Her giant face is rendered in such super close-up that you might as well be an otolaryngologist; only her legs are left to do IRL acting.",
  "bwwScore": 6,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Sarah-Snook-Stars-In-THE-PICTURE-OF-DORIAN-GRAY-On-Broadway-20250327"
}
