{
  "showId": "just-in-time-2025",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani Samuel",
  "url": "https://www.broadwaynews.com/the-broadway-review-just-in-time-is-safe-swoonful-concert-style-theater/",
  "publishDate": "April 27, 2025",
  "fullText": "Review — Just in Time The Broadway Review: ‘Just in Time’ is safe, swoonful concert-style theater To no one’s surprise, star Jonathan Groff’s got the magic, vintage touch. , and Brittani Samuel April 27, 2025 . 8:58 PM 11 min read Share on Twitter Share on Facebook Share on LinkedIn Share via Email Jonathan Groff (center) and the company of “Just in Time” on Broadway, 2025 (Credit: Matthew Murphy and Evan Zimmerman) This post is for paying subscribers only Subscribe now Already have an account? Sign in Review — Just in Time — News — Jonathan Groff — Alex Timbers — Shannon Lewis — Andrew Resnick — Ted Chapin — Warren Leight — Isaac Oliver — Christine Cornish — Julia Grondin — Valeria Yamin — Emily Bergl — Michele Pawk — Gracie Lawrence — Erika Henningsen — Catherine Zuber — Derek McLane Introductory Offer $1/month for 3 months Subscribe Already have an account? Log in Latest Closer Look What does it take to actually revise a musical? Closer Look How the original company of ‘Ragtime’ was cast Insights Loyalty Report: January 22, 2026 Closer Look How ‘Riverdance’ revolutionized the world of dance Podcast 30 years ago, Tracy Letts wrote a play tailor-made for today with ‘Bug’ Personnel Neil Mazzella steps down as CEO of Hudson entities Books The original music director of ‘Rent’ reveals scenes from the very first auditions Closer Look Christian Cowan uses detail and taste to make ‘The Queen of Versailles’ shine",
  "isFullReview": false,
  "dtliExcerpt": "But the manner in which “Just in Time” unfolds is mercilessly predictable, so the beats rarely surprise; we feel every snap coming. For what it’s worth, Groff, Lawrence and Henningsen don’t seem to mind — they’re having a howling good time slipping into these characters’ shoes.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Meh",
  "textStatus": "partial",
  "textWordCount": 245,
  "archivePath": "data/archives/reviews/just-in-time-2025/broadway-news--brittani-samuel_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:46:54.652Z",
  "textIssues": [
    "Word count too low: 245 (min: 300)"
  ],
  "textQuality": "partial",
  "sourceMethod": "dtli"
}