{
  "showId": "just-in-time-2025",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Kobi Kassal",
  "url": "https://www.theatrely.com/post/a-superb-jonathan-groff-brings-bobby-darin-to-life-in-just-in-time-review",
  "publishDate": "April 26, 2025",
  "fullText": "It seems every other year at this point we get a new bio-jukebox musical of some singer with a troubled past living in the 40s, 50s, or 60s, and Donnie Kirshner appears in some way. There is just one issue that all those other musicals have… they don't have Jonathan Groff in them.\n\nFresh off his Tony Award-winning performance as Franklin Shepard in last season's fantastic Merrily We Roll Along revival, Groff is back on Broadway this time at the intimate Circle In The Square where Just In Time officially opens tonight. Based on the life of Bobby Darin, and featuring all his greatest hits, this new musical takes everything we know about conventional bio-musicals and throws it out the window.\n\nGroff became enamored with Darin after performing his music at the 92nd Street Y back in 2018, and ever since then has been waiting for tonight. He enlisted the help of Alex Timbers who directs (and developed) the piece with a book by Warren Leight and Isaac Oliver. The show starts out in a nightclub in 2025 with Groff on stage and he effortlessly transforms right before our very eyes — it's an astonishing feat that has the audience enraptured at every point.\n\nDuring intermission, a very polite British tourist asked me if I had ever seen Groff perform on stage — it was her first time ever seeing him and she was gobsmacked by his talent. As well she should be, since Groff is delivering a career-defining highlight that is sure to be talked about for years to come.\n\nWhen we add in the cast of stunning supporting characters including the heartwrenching Michele Pawk (who should be in every musical ever) as Darin's mother Polly and the incredible Emily Bergl as his sister Nina, the performance really comes together. Timbers directs Groff and company to use up every inch of space around the theatre and immerses us in Darin's life. Pop icon Gracie Lawrence returns to Broadway as the vibrant Connie Francis — her belting is worth the price of admission alone. She's paired with the equally charming Sandra Dee who graciously takes over narration from Darin at points to give us her POV. Of course the highlight of the evening was the music (Andrew Resnick oversaw music supervision and orchestrations with Michael Thurber). That big band sound carries us away as if we were at the Copa. And boy are they moving! Shannon Lewis makes her Broadway debut as a choreographer, and what a lovely debut it is.\n\nWith a terrific full band right on stage the entire time, we are transported to the streets of East Harlem, Vegas, and even Portofino thanks to versatile nightclub scenic design by Derek McLane. I task you with finding a leading man today with half the charisma that Jonathan Groff possesses. He brings not just the story, but the very soul of Bobby Darin to life. If there is one musical to see this season, you might as well grab your bathing suit and come splash in the basement of Wicked - you won't be disappointed.\n\nJust In Time is now in performance at the Circle In The Square on West 50th Street in New York City.",
  "originalScore": null,
  "assignedScore": null,
  "dtliThumb": "Up",
  "source": "webfetch-scraped",
  "scrapedAt": "2026-01-23T23:30:00.000Z"
}