{
  "showId": "just-in-time-2025",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jackson McHenry",
  "url": "https://www.vulture.com/article/theater-review-jonathan-groff-bobby-darin-in-just-in-time.html",
  "publishDate": "April 26, 2025",
  "fullText": "Groff is undeniably great at bending a crowd around his little finger, and he’s working with an audience that’s delighted to be pandered to. He spends much of the show weaving through that crowd and traipsing up the aisles and back to find people to flirt and dance with, like a Labrador licking his way through a maze in search of treats. How could you deny this guy the adulation he craves?",
  "isFullReview": false,
  "dtliExcerpt": "Groff is undeniably great at bending a crowd around his little finger, and he’s working with an audience that’s delighted to be pandered to. He spends much of the show weaving through that crowd and traipsing up the aisles and back to find people to flirt and dance with, like a Labrador licking his way through a maze in search of treats. How could you deny this guy the adulation he craves?",
  "bwwExcerpt": "The energy verges from electric to manic, in a way that makes you wonder Is Jonathan Groff telling us that he would like to die mid-performance? All right, that’s an exaggeration, but it does move the question of what a star gets out of entertaining, and what an audience gets out of receiving that performance, right to the center of the show, more so than the specific biography of Darin himself. It’s like Prospero at the end of The Tempest turning to the audience to be, finally, released by their applause—if Prospero were wearing a tuxedo and crooning “Beyond the Sea.” Still, as you from crimes would pardoned be, let your indulgence set him free. Cue the megamix.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "bwwThumb": "Meh",
  "bwwUrl": "https://www.vulture.com/article/theater-review-jonathan-groff-bobby-darin-in-just-in-time.html",
  "dtliThumb": "Up",
  "textStatus": "missing",
  "textQuality": "missing",
  "sourceMethod": "dtli"
}