{
  "showId": "therese-raquin-2015",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2015/10/30/theater/review-in-therese-raquin-keira-knightley-as-a-baleful-adulteress.html",
  "publishDate": "October 29, 2015",
  "fullText": "https://www.nytimes.com/2015/10/30/theater/review-in-therese-raquin-keira-knightley-as-a-baleful-adulteress.htmlGive this article32Advertisement\n\nFrom the moment we first set eyes on the title character of “Thérèse Raquin,” the bleak literary melodrama that opened on Thursday night at Studio 54, we know without a doubt that she is doomed, doomed, doomed. Portrayed with a dedicated and joyless intensity by the film star Keira Knightley in her Broadway debut, she makes her entrance in the play’s opening seconds in stern, silhouetted profile, carrying a bowl of water and a heap of bad karma.\n\nHer gait is laboriously slow and measured, as if she were leading a funeral procession for all her hopes and dreams. And though you may assume, dear innocent theatergoer, that things can only lighten up for this poor blighted creature, she will continue to march in lock step with an unforgiving destiny for the succeeding two and a half hours.\n\nHappiness is never in the cards in this tale of murder and adultery. And that’s as true for audiences at this Roundabout Theater Company production, directed by Evan Cabnet, as it is for our gal Thérèse.\n\nAdapted by Helen Edmundson from Émile Zola’s 1867 novel, “Thérèse Raquin” takes the lesson of its plot’s inexorability a bit too much to heart. The show is so determined to demonstrate how destiny never relaxes its stranglehold on its characters that any sparks of pleasure are snuffed out almost before they appear.\n\nTake, for example, the early scene in which Thérèse, a prisoner of a loveless marriage in 19th-century provincial France, has learned that her petulant invalid husband, Camille (Gabriel Ebert), has decided to move with her and his doting mother (Judith Light) to Paris to start a new life.\n\n“Where will you take me?” says Thérèse, who has wandered into the meadows to commune with her only friend, the river. “Let it be somewhere light, somewhere beautiful. Let me live!”\n\nNo sooner does she utter those words than — clunk! — a new set falls into place from above like a guillotine blade. It is the dark and claustrophobic Paris apartment into which the Raquins have moved, and it looks for all the world like the interior of a coffin.\n\nMortuarial imagery is perhaps appropriate to a play inspired by a novel of which its author wrote, “I simply applied to two living bodies the analytical methods that surgeons apply to corpses.” The bodies in question belong to Thérèse and Laurent (the Royal Shakespeare Company alumnus Matt Ryan), her husband’s handsome best friend, who begin an obsessive affair that carries them beyond reason.\n\nIf only they could get rid of Camille, they figure, life would be hunky-dory. But once they do, by drowning him in a bona fide body of water that has been provided for this production’s first-act climax, guilt robs them of their lust. Soon they’re hearing spooky creaking noises whenever they’re in bed (Josh Schmidt did the sound design as well as the solemn music), which is either Camille’s ghost or the machinery of the plot.\n\nThe great problem with fatalism as a form of entertainment is that its monotone palette quickly turns monotonous unless it’s generously spiced with suspense and empathy. (Think of the riveting James M. Cain-inspired films of the 1940s like “Double Indemnity” or “The Postman Always Rings Twice.”) Yet for a play that is partly about the fear of being found out, “Thérèse Raquin” is curiously lacking in tension of any kind. It is steeped, instead, in a single shade of morbid resignation.\n\nAs designed by Beowulf Boritt (sets) and Keith Parham (lighting), this production sticks to a spectrum of late-autumn sepias and wintry grays. There’s even a moment, shortly before the climactic murder that ends the first act, when a few desiccated leaves flutter wanly to the stage. Jane Greenwood’s costumes are largely of the same hue, and I kept thinking that surely Thérèse’s disposition would improve if she were ever allowed to change that mouse-brown dress she wears for the first act.\n\nMs. Knightley’s résumé as a movie actress is filled with period costumes that she has worn very fetchingly in films like “Pride & Prejudice,” “Atonement” and the swashbuckling “Pirates of the Caribbean” series. Here, though, her full-skirted attire makes her look cadaverously angular from the waist up.\n\nSince Thérèse is a woman of few words, the focal point of both Ms. Knightley’s appearance and performance is her eyes. Whether glowering in resentment at her husband and mother-in-law, or staring smolderingly at Laurent, Thérèse is the master of the basilisk stare.\n\nNot since the days of silent movies has a star relied so completely on her gaze to speak for her. Setting her cap for Laurent, this Thérèse brings to mind the succubus vamps portrayed on screen by Theda Bara a century ago, except without the promise of fun in the sack.\n\nIt’s a disciplined and determined Expressionist performance. But it feels, well, unnatural in a work based on a pioneering novel of naturalism. It is also a style of acting that clashes so violently with that of the others onstage that you wonder why people don’t realize from the get-go that there’s something dangerously wrong with this baleful young woman.\n\nThen again, all of the cast members — who also include David Patrick Kelly, Mary Wiseman and Jeff Still as friends (lord knows why) of the Raquin family — seem to belong to different theatrical universes. As Camille, Mr. Ebert delivers the sort of tic-driven, crooked-line caricature for which he won a Tony in “Matilda the Musical,” where the style felt more appropriate to the content.\n\nMs. Light, known for her incisive portraits of sharp-tongued women, here delivers a not entirely fitting study in self-effacing goodness, which makes Thérèse’s anger toward her mother-in-law seem especially churlish. Mr. Ryan portrays Laurent with the jaunty, casual air of a boulevardier, and it’s hard to credit him as a man undone by relentless desire. (When he tells Thérèse, “I’m addicted to you,” the audience laughs; but then, there’s a fair amount of such laughter throughout.)\n\nThe sex scenes between Laurent and Thérèse are so brief and blunt that they hardly seem worth killing for. Like these characters’ lives, their erotic encounters are nasty, brutish and short. That’s a fair description of the play in which they appear, except for the short part.",
  "isFullReview": true,
  "dtliExcerpt": "Ms. Knightley brings a compelling combination of fragility and fierce determination to her role as a woman awakened to both passion and its terrible consequences.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Ms. Knightley brings a compelling combination of fragility and fierce determination to her role as a woman awakened to both passion and its terrible consequences.",
  "contentTier": "complete",
  "contentTierReason": "Short text (25 words)",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://www.nytimes.com/2015/10/30/theater/review-in-therese-raquin-keira-knightley-as-a-baleful-adulteress.html?_r=0",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "previousUrl": "https://www.nytimes.com/2015/10/30/theater/review-therese-raquin-with-keira-knightley-makes-a-steamy-broadway-debut.html",
  "urlDiscoveredAt": "2026-02-04T01:54:07.680Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1048,
  "archivePath": "data/archives/reviews/therese-raquin-2015/nytimes--ben-brantley_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:54:07.685Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20220922041033",
  "archiveOrgUrl": "http://web.archive.org/web/20220922041033/https://www.nytimes.com/2015/10/30/theater/review-in-therese-raquin-keira-knightley-as-a-baleful-adulteress.html",
  "wordCount": 1048,
  "tierReason": "Full review text"
}