{
  "showId": "shucked-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2023/04/04/shucked-salty-corn-on-the-musical-cob/",
  "publishDate": "2023-04-04T20:53:15",
  "fullText": "Oscar Wilde is frequently credited with declaring that puns are “the lowest form of humor.” Another Oscar – Levant – altered the remark by insisting, “A pun is the lowest form of humor – when you don’t think of it first.” As a matter of playwriting annals, Wilde thought of it first and many times over in The Importance of Being Earnest, starting with the title.\n\nBut why the talk about the purpose and power of puns when beginning a review of Shucked, the new musical tracking troubles in Cob County where corn is the cherished, and only, produce?\n\nBecause: Puns are the primary focus of an argument in Shucked’s favor. The tuners bookwriter is Robert Horn, last on Broadway with the script of the (so-so) musicalized Tootsie. Along with that credit, he arrives with a long list of awards for properties like television’s Designing Women, where he was a writer. The latter explains how so much of Shucked has a sit-cob ring – oops, I meant to type sit-com ring.\n\nWhat’s pertinent here is that with Shucked, Horn is following in Oscar Wilde’s stealthy footsteps. From start to finish of this work, he raises punning from its incorrectly regarded place as the lowest form of humor. Instead, and practically from line to line, he lifts it to the level of art. I’m not going to offer illustrative kernels. That could impair the undeniably cumulative watching and listening enjoyment – and yes, “kernels” is editorial punning.\n\nAlso, keep in mind that the name “Horn” rhymes with “porn.’ The estimable playwright deals in that as well – or close enough. As comics say about other comics, he (or she) “works blue.” Horn works so blue, he practically\nturns midnight blue. There’s a Shucked character called Peanut (the much-loved Kevin Cahoon), who might as well be handed a mic. More than once, he delivers a blue stand-up routine. For instance, he gets to say\nseemingly innocent remarks such as recalling an incident when putting a Christmas tree up himself.\n\nBeing exposed to Horn’s masterful pun demonstration comes close to equaling the price of Shucked admission, but what about the rest of it? Slightly less of a recommendation – with a caveat: Jack O’Brien’s direction.\n\nFor this production, which prides itself in being as corny as Cob County, O’Brien imbues the production with rat-a-tat style that not only knocks your socks off but blows your mind. The knocking and blowing are enhanced by Scott Pask’s set of a large, slatted barn with occasional corn rows sliding on. Japhy Weideman’s lighting and John Shivers’ sound help a bushel, too.\n\nWhat are all these first-rate Broadway values enhancing? The above-mentioned Cob County (in an unidentified state: Kentucky?) is a town ruled by a law not unlike Brigadoon’s town of Brigadoon. Sufficient unto themselves, no Cob County citizen can leave.\n\nSomeone does, however: Maizy (Caroline Innerbichler) – Maizy, like Maize (get it?) – who feels obligated to quit not only Cob County but also fiancé Beau (Andrew Durand). She’s learned, as has the entire town, that Cob County soil is drying up and reckons that only an out-of-town expert can solve the problem. Off she goes to Tampa and locates “corn doctor” Gordy (John Behlmann), a podiatrist and con man, whom she brings back to Cob County, believing he’ll solve the problem.\n\nThat’s the storyline, during which she gets entangled in marriage vows to Gordy, while he falls for her hard-as-nails funny cousin Lulu (Alex Neville). And the audience is expected to hang on the suspense as to who will end\nup nuptialing whom, which is hardly a cliffhanger of Perils of Pauline/Flash Gordon magnitude.\n\nOkay, it all passes by easily enough – as enlivened by a proficient cast and Horn’s Olympic-style punditry. And by the way, it’s narrated (longer than necessary) as a supposed fable by Storyteller 1 (Ashley D. Kelley) and\nStoryteller 2 (Grey Henson), who are the lucky recipients of much of that unceasing pun-running.\n\nRemember, please, that this is a musical about corn of at least two types piled “as high as an elephant’s eye.” (Thanks for that borrowed Oklahoma! lyric, Oscar Hammerstein!) Because the corn is so high, it must have\nstruck the Shucked purveyors that it should have a corntry music sound. Oops, I meant to type country music.\n\nThe music and lyrics are attributed to Brandy Clark and Shane McAnally, for whom this appears to be a first Broadway score. To country music lovers, the names won’t be new: Grammy noms by the big numbers. For Shucked they offer “Somebody Will,” that Durand sells like a trouper, and “Independently Owned,” that Neville blasts as if it’s the roof-raising 11 0’clock number, even if it’s in the first act. There’s also “Hee-Haw,” which the male cast members sing – and is choreographed by the underused Sarah O’Gleby. This one could be an homage to the long-running CW tv series, though without Minnie Pearl.\n\nOther than those three items, the songs serve their purpose but don’t accomplish much more, which could lead to Clark and McAnally being judged as only serviceable for such an assignment. Their fans know better. The explanation is that here they’re ostensibly writing for hire, whereas their best work singly or with others is writing unflinchingly from within themselves. For starters, listen to her “Buried” and his “Are Your Eyes Still Blue” and immediately join their\nfan clubs.\n\nWhat of Shucked itself? Let’s just go with an endearing, soil-kicking “Aw, shucks!”\n\nShucked opened April 4, 2023, at the Nederlander Theatre. Tickets and information: shuckedmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2023/04/04/shucked-cornpone-hilarity/",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
