{
  "showId": "shucked-2023",
  "outletId": "timeout",
  "outlet": "Time Out New York",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/shucked-review",
  "publishDate": "April 4, 2023",
  "fullText": "This corny musical comedy about a small farming town threatened by a crop crisis is more sweet than sharp, but it has enough charm to keep audiences entertained.",
  "isFullReview": false,
  "dtliExcerpt": "This corny musical comedy about a small farming town threatened by a crop crisis is more sweet than sharp, but it has enough charm to keep audiences entertained.",
  "originalScore": 60,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "While the lyrics sometimes lack the rigor of the best Broadway songwriting—the word “Tampa” is forced into shotgun rhymes with “camera,” “plasma” and “extravaganza”—the songs mostly hit the spot, and the show knows how to sell them. Director Jack O’Brien and choreographer Sarah O’Gleby set the show’s winking tone in an opening number that nods to Michael Bennett and Tommy Tune, and roll out the barrels later on for the Seven Brides for Seven Brothers–style showstopper “The Best Man Wins.” Innerbichler acts and sings with winsome lucidity, and the limber-voiced Durant scores with Beau’s hurt-but-defiant “Somebody Will.” But Newell ignites the show’s real barn burner: “Independently Owned,” in which hooch mama Lulu declares her autonomy and Newell, as in Once on This Island, soars to stratospheric vocal heights with unperturbed poise. (When I saw the show, the song earned a partial standing ovation in the middle of Act I.) The show’s most valuable player, however, is book writer Robert Horn, who won a Tony for his similar Tootsie role and who stuffs Shucked’s script with laugh-out-loud puns and one-liners.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-SHUCKED-Opens-On-Broadway-The-Critics-Weigh-In-20230404",
  "showScoreExcerpt": "This corny musical comedy about a small farming town threatened by a crop crisis is more sweet than sharp, but it has enough charm to keep audiences entertained.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (28 words)",
  "playbillVerdictUrl": "https://www.timeout.com/newyork/theater/shucked-broadway-musical-review",
  "sources": [
    "web-search",
    "show-score-playwright",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "textQuality": "truncated",
  "bwwScore": 9
}