{
  "showId": "1984-2017",
  "outletId": "broadwaynews",
  "outlet": "Broadway News (Charles Isherwood)",
  "criticName": "Charles Isherwood",
  "url": "http://broadway.news/2017/06/22/review/1984-review/",
  "playbillVerdictUrl": "http://broadway.news/2017/06/22/review/1984-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "Summer entertainment options do not get more counterintuitive than the Broadway adaptation of George Orwell’s “1984” that opened at the Hudson Theatre on Thursday, just as beach season swings into high gear. In truth, to call this almost unrelievedly grim production entertainment may be misleading. If you’re in the mood for a meal of pure spinach, to use a now-outmoded food metaphor, this 100-minute immersion in one man’s bleak odyssey through a brutally oppressive culture certainly fits the ticket.\n\nThe adaptation, written and directed by Robert Icke and Duncan Macmillan, comes with a London pedigree and features a skilled cast led by Tom Sturridge as the famous protagonist, Winston Smith, who, as both play and book begin, finds stirring within him an urgent need to chronicle his inner life and past experience, a radical act in the totalitarian culture that he inhabits. (Here it is moved from the book’s London to an unspecified locale.) To express thoughts not approved by the ruthless ruling party, led by the omnipresent Big Brother, dooms him to live in fear of violent, even fatal, retribution.\n\nOrwell’s book, easily the most celebrated dystopian novel ever written, has been much on the minds, lips and e-book readers of Americans these days, for reasons that don’t need much elaboration. When Winston bravely asserts, in refutation of the prevailing dogma, that “there is truth and there are facts,” and that “freedom is the freedom to know and say that,” heads will naturally nod in knowing sympathy. In America today, under a president who blithely asserts as truth matters that are demonstrably false, and regularly derides all unpalatable-to-him information as “fake news,” Orwell’s vision of a world in which reality is regularly denied by those in power, and the past is seen as a fungible commodity to be rewritten at will, certainly seems painfully familiar.\n\nBut this familiarity tends to work against this honorable but undeniably glum and mostly suspense-less production. Even if you have not read Orwell’s novel recently, or indeed ever, the production’s brooding gloominess – accentuated by nerve-sizzling bursts of loud static in blackouts between scenes – may send you spiraling into a funk of sighing recognition well before Winston meets his gruesomely violent fate. How many will want to pay Broadway prices to see a nightmare vision of a world that seems dangerously near? (And, of course, already exists in North Korea, and to a lesser degree in some other countries run by strongman leaders.)\n\nA minor framing device, inspired in part by the novel’s appendix, suggests an attempt to slightly leaven the darkness. In a wood-paneled room that vaguely recalls a conference room in a library, characters from the future – roughly 100 years after the titular year, when Winston apparently first put pen to paper in his diary – argue over the currency, or not, and the veracity, or not, of the events it describes. Humanity has, it seems, in some part recovered from the years of brutality through which Winston and his contemporaries lived.\n\nMost of the production takes place in this same nondescript room, standing in for many others, as we flash back to Winston toiling in a government ministry, sleepwalking through his days until, as he is beginning to inwardly rebel against the dehumanizing strictures of the culture, he finds a potential ally. A beautiful co-worker, Julia (Olivia Wilde), stealthily hands him a note on which are written the startling words “I love you” – a sure indication that she, too, shares his rebellious instincts, since love is anathematized as virulently as independent thought in the world run by Big Brother. (In contrast to the book, which describes a world plastered in propaganda posters featuring his face, we never actually see it here.)\n\nBut in their depiction of Julia, Icke and Macmillan squander a rare opportunity to crack open a window and let in some warming light. In the novel, Julia’s unbridled narcissism, healthy sensuality and insouciant dismissal of the oppressive world she and Winston must negotiate strikes a refreshing and even funny note: she personifies the possibility that joy still remains within grasp, that at least some people have retained their instinctive will to pleasure. Here, however, as played with minimal vivacity by Wilde, she’s less colorful and less well-defined, her vibrancy toned down to a pale gray.\n\nThat’s certainly the color I’d use to describe Sturridge’s Winston, whose slouching demeanor and often hushed voice do not exactly make him a hero whose decision to subversively fight the brutal powers that be has us shaking our fists with excitement. True, Winston must tamp down all expressions of feeling in public, since even a twitch of spontaneous emotion might come to the attention of the dreaded Thought Police. But even when he and Julia begin their affair, Sturridge’s Winston does not seem to have a racing pulse. (Their version of sweet nothings: “We are the dead.”) Sturridge is most compelling, I’m sorry to say, when Winston is suffering agonizing brutality at the hands of O’Brien, his ally-turned-betrayer, a ruling party functionary disguising himself as a rebel, played by a truly scary Reed Birney. A placid smile on his face, his voice milky smooth, Birney’s O’Brien casually orders his minions to implement repugnant methods of torture that are hard to watch, especially as magnified on a wide screen above the stage.\n\nIcke and Macmillan have obvious reverence for Orwell’s allegory of man’s ineradicable capacity for cruelty, and the extremes to which stratified societies tend. But their production, while hardly literal-minded – the use of live video is effective, and there are flickers of imaginative innovation throughout – nevertheless feels like a homework assignment from a civics class, replete with a virtual list of study suggestions: Note parallels between the society (or societies) depicted and our own. (Yep, I caught that line about people who “will not look up from their screens long enough to notice what’s really happening.”) Note how even the hero becomes corrupted by the culture in which he lives. (Got it.) Consider how much human nature has changed since Orwell wrote his book, first published in 1949. (Not much.)\n\nIn a grim irony, this all makes for the kind of evening that doesn’t so much stimulate thought as shut it down, since the meanings have been so carefully parsed and served up for us. It inspired in me an impulsive longing for a big gulp of mindless escapism. Doesn’t Katy Perry have a new album out? █",
  "isFullReview": true,
  "textWordCount": 1079,
  "archivePath": "data/archives/reviews/1984-2017/broadwaynews--charles-isherwood_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:17:59.114Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.goto: net::ERR_NAME_NOT_RESOLVED at http://broadway.news/2017/06/22/review/1984-review/\nCall log:\n  - navigating to \"http://broadway.news/2017/06/22/review/1984-review/\", waiting until \"domcontentloaded\"\n"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20170903105538",
  "archiveOrgUrl": "http://web.archive.org/web/20170903105538/http://broadway.news:80/2017/06/22/review/1984-review/",
  "contentTier": "complete",
  "wordCount": 1079,
  "tierReason": "Full review text",
  "bwwExcerpt": "Summer entertainment options do not get more counterintuitive than the Broadway adaptation of George Orwell's '1984' that opened at the Hudson Theatre on Thursday, just as beach season swings into high gear. In truth, to call this almost unrelievedly grim production entertainment may be misleading. If you're in the mood for a meal of pure spinach, to use a now-outmoded food metaphor, this 100-minute immersion in one man's bleak odyssey through a brutally oppressive culture certainly fits the ticket.",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Big-Brother-Has-Its-Eyes-on-Opening-Night-of-1984-20170622"
}
