{
  "showId": "1984-2017",
  "outletId": "newsday",
  "outlet": "Newsday (Elizabeth Vincentelli)",
  "criticName": "Elizabeth Vincentelli",
  "url": "http://www.newsday.com/entertainment/theater/1984-review-tom-sturridge-olivia-wilde-in-orwell-s-still-pertinent-story-1.13753366",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/1984-review-tom-sturridge-olivia-wilde-in-orwell-s-still-pertinent-story-1.13753366",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "It looks like there is no Newsday subscription account associated with this login information.\n\nIf you used an Optimum login, click the Connect Account button to use your Optimum login info to manage your Newsday subscription account.\n\nUpdated June 22, 2017 9:00 PM\n By Elisabeth Vincentelli Special to Newsday\n\nadvertisement | advertise on newsday\n\nWHERE Hudson Theatre, 139-141 W. 44th St.\n\nINFO $35-$149; 855-801-5876; thehudsonbroadway.com\n\nBOTTOM LINE A brutal, nightmarish telling of a cautionary novel.\n\nPicture fun, escapist summer fare. Now, picture the exact opposite — that would be the powerful but grueling stage version of “1984,” which has just opened on Broadway.\n\nThe adaptation, which premiered in the United Kingdom in 2013, is an assault on the senses, with the audience subjected to blasts of deafening sounds and blinding lights. A man is shot in the head (in a video close-up) and the final torture scene may rattle the most hardened theatergoers.\n\nAnd then there is the assault on the soul, with the show depicting the bludgeoning of democracy and plain humanity.\n\nIt is all hard to take — and you have to wonder how the magnetic Tom Sturridge, who bears the brunt of the attacks, can go through this eight times a week — but then there is no other way to do justice to George Orwell’s landmark 1949 novel. The book has encountered renewed popularity over the past few months: Many people feel that a novel describing a dystopian world where reality is denied is apropos when an adviser to the president mentions “alternative facts.”\n\nAdapted and directed by Robert Icke and Duncan Macmillan, this “1984” uses a framing device inspired by Orwell’s appendix to his book. We are around 2050 and a handful of people are reading and commenting on the decades-old diary of Winston Smith (a fully committed Sturridge), which has become a testament to a defunct totalitarian regime. Is the diary even real? Has the ruling party actually fallen or is it all a figment of Winston’s imagination? The lines between fact and fabrication keep shifting, as Winston knows all too well: His job is to constantly rewrite the past for the oxymoronically named Ministry of Truth.\n\nThis, by the way, is confusing onstage — the storytelling could baffle those unfamiliar with the book, and a quick refresh before going to the play is helpful.\n\nIn a society forbidding love and pleasure, Winston falls for Julia (Olivia Wilde, late of “House” and making an assured Broadway debut). For a short while, they think they’ve found a refuge away from the prying eyes of Big Brother, the ever-present leader watching over the citizenry via ubiquitous two-way monitors.\n\nadvertisement | advertise on newsday\n\nThe show doesn’t convincingly bring to life this constant invasion of privacy, but gains traction as soon as the affair is exposed as Winston, screaming like the damned, endures terrifying “re-education” at the hands of O’Brien (Tony winner Reed Birney, most recently of “The Humans”), whose preternaturally calm demeanor contrasts with his inhuman actions. Even a possibly optimistic coda about the end of the dictatorship fails to reassure. When lies are the norm, how can you tell that they have stopped?\n\nGet the latest on celebs, TV and more.\n\nBy clicking Sign up, you agree to our privacy policy.\n\nNewsday.com now uses Facebook for our comment boards. Please read our guidelines and connect your Facebook account to comment.\n\nBy using this site, you agree to our\nPrivacy policy.",
  "isFullReview": true,
  "textWordCount": 575,
  "archivePath": "data/archives/reviews/1984-2017/newsday--elizabeth-vincentelli_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:21:10.948Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20170627104028",
  "archiveOrgUrl": "http://web.archive.org/web/20170627104028/http://www.newsday.com:80/entertainment/theater/1984-review-tom-sturridge-olivia-wilde-in-orwell-s-still-pertinent-story-1.13753366",
  "contentTier": "complete",
  "wordCount": 575,
  "tierReason": "Full review text",
  "bwwExcerpt": "The show doesn't convincingly bring to life this constant invasion of privacy, but gains traction as soon as the affair is exposed as Winston, screaming like the damned, endures terrifying 're-education' at the hands of O'Brien (Tony winner Reed Birney, most recently of 'The Humans'), whose preternaturally calm demeanor contrasts with his inhuman actions. Even a possibly optimistic coda about the end of the dictatorship fails to reassure. When lies are the norm, how can you tell that they have stopped?",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Big-Brother-Has-Its-Eyes-on-Opening-Night-of-1984-20170622"
}
