{
  "showId": "on-a-clear-day-you-can-see-forever-2011",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "Frank Scheck",
  "url": "http://www.hollywoodreporter.com/review/a-clear-day-you-can-see-forever-theater-review-1123914",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/a-clear-day-you-can-see-forever-theater-review-1123914",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "There’s a distinct “Let’s put on a show” vibe to the Irish Rep’s revival of Burton Lane and Alan Jay Lerner’s 1965 musical that actually suits the problematic material. The abridged, scaled-down production helps one overlook the sheer clunkiness of Lerner’s book. This rendition of On a Clear Day You Can See Forever, starring Melissa Errico and Stephen Bogardus in the roles originally played on Broadway by Barbara Harris and John Cullum, also serves as a valuable reminder of the quality of the show’s melodic score.\n\nA rare flop from the creators of Finian’s Rainbow and My Fair Lady, respectively, the musical was made into a failed 1970 movie starring Barbra Streisand and Yves Montand. It also received a misconceived, gender-bending 2011 Broadway revival with Harry Connick, Jr. and Jessie Mueller. Seeing it again, it’s easy to see why it has never quite worked.\n\nThe story revolves around Daisy Gamble (Errico), a chain-smoking neurotic who also happens to be psychic and has the power to make plants grow instantaneously. In a desperate attempt to get rid of her smoking habit, she sees a psychiatrist, Dr. Mark Bruckner (Bogardus). While she’s under hypnosis, he discovers that she’s the reincarnation of an 18th century British aristocrat, Melinda Welles, who carried on an extramarital affair with a dashing portrait artist, Edward Moncrief (John Cudia). Complications ensue, including the shrink falling in love with Daisy’s previous incarnation.\n\nDirector Charlotte Moore has tightened the book considerably, eliminating numerous subplots and characters (16, down from more than 50), but there’s little she can do to make the proceedings any less silly. The attempts at humor often fall flat, with Bogardus playing it totally straight and Errico lacking the comic chops of her predecessors in the role.\n\nThe show’s strongest element is its beautiful score, which includes the memorable title song, the gorgeous “What Did I Have That I Don’t Have?” and the propulsive “Come Back to Me.” Musical theater buffs will be intrigued by the inclusion of “Who Is There Among Us Who Knows,” a song cut from the film version and originally intended to be sung by Jack Nicholson in a supporting role.\n\nErrico, who played Eliza Doolittle in a 1993 Broadway revival of My Fair Lady, sings gorgeously, and Bogardus brings a smooth polish to his numbers. But the real standout is the dashing Cudia, who has played both the Phantom and Jean Valjean on Broadway. His powerful pipes are even more effectively showcased thanks to the production’s lack of artificial amplification.\n\nThe large ensemble looks cramped on the tiny stage, especially when performing Barry McNabb’s exuberant group choreography for such numbers as “S.S. Bernard Cohen” and “Wait Till We’re 65.” James Morgan’s sets and projections have a musty, summer-stock look and the music inevitably feels diminished, although Josh Clayton’s orchestrations make the most of the pint-sized, six-piece band.\n\nBut the technical limitations somehow suit the show. Only the most curmudgeonly could resist its undeniable charm, which might easily get lost in an overblown production. Despite its estimable pedigree, On a Clear Day You Can See Forever will never have a prominent place in the musical theater canon. But much like its central character, it seems destined to be reborn in one form or another from time to time.\n\nVenue: Irish Rep Theatre, New York\n Cast: Florrie Bagel, William Bellamy, Stephen Bogardus, Rachel Coloff, Peyton Crim, John Cudia, Melissa Errico, Caitlin Gallogly, Matt Gibson, Daisy Hobbs, Craig Waletzko\n Music: Burton Lane\n Book & lyrics: Alan Jay Lerner, adapted by Charlotte Moore\n Director: Charlotte Moore\n Choreographer: Barry McNabb\n Set designer & projection art: James Morgan\n Costume designer: Whitney Locher\n Lighting designer: Mary Jo Dondlinger\n Sound designer: M. Florian Staab\n Projection designer: Ryan Belock\n Presented by Irish Repertory Theatre",
  "isFullReview": true,
  "textWordCount": 623,
  "archivePath": "data/archives/reviews/on-a-clear-day-you-can-see-forever-2011/hollywood-reporter--frank-scheck_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:54:21.893Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 623,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-04T10:32:18.115Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about the Irish Rep's revival of 'On a Clear Day You Can See Forever,' not the current Broadway production.; kimi: This review covers an Off-Broadway production at Irish Repertory Theatre, not a Broadway production. The text describes it as an 'abridged, scaled-down' production on a 'tiny stage' with a 'pint-sized, six-piece band,' and explicitly identifies the venue as Irish Rep Theatre rather than a Broadway house.",
  "promptVersion": "5.2.0"
}