{
  "showId": "on-a-clear-day-you-can-see-forever-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "http://www.variety.com/review/VE1117946735",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "The skeleton of the 'Clear Day' plot is retained, but without a leading lady playing dual roles, it's like a banana split without bananas. Melinda's neurotic half, Daisy, is now played by a slip of a boy who works in a flower shop; the unsuccessful surgery weakens the score. Some songs, which refer to Daisy's excised ESP story thread, seem robbed of their meaning; the now extraneous title song is relegated to the closing spot. Two songs have been transformed into overblown production numbers, and the new plot calls for seven reprises. (Added songs come from the Fred Astaire pic 'Royal Wedding.') The keen listener will notice numerous unfamiliar lyrics; Lerner seems to have been rewritten by an uncredited hand, and clumsily so.",
  "bwwScore": 7,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ON-A-CLEAR-DAY-on-Broadway-Updating-Live-20111211",
  "fullText": "Director Michael Mayer (\"Spring Awakening,\" \"American Idiot\") has taken it upon himself, with the help of playwright Peter Parnell, to reconceive Alan Jay Lerner and Burton Lane's 1965 musical \"On a Clear Day You Can See Forever.\"\n\nDirector Michael Mayer (“Spring Awakening,” “American Idiot”) has taken it upon himself, with the help of playwright Peter Parnell, to reconceive Alan Jay Lerner and Burton Lane’s 1965 musical “On a Clear Day You Can See Forever.” The original was an eight-month failure; this version, with radical rewrites encouraged by the authors’ estates in hopes of generating income, features a sex change and a bifurcated leading role, but the outlook for this “Clear Day” is stormy.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n LISTEN: Investors Fret But Netflix Fights for Warner Bros. Discovery Deal \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Sinners' Costume Designer Ruth E. Carter Becomes Most-Nominated Black Woman in Oscar History\n\nThe play initially was constructed as a vehicle for a star singer/comedienne (played by Barbara Harris on stage, Barbra Streisand on screen). The challenge and the fun came from watching an insecure neurotic instantly and repeatedly transformed through hypnosis into her glamorous, past-life self. Mayer has seen fit to divide this star part in half and have it played by two actors, removing the one element that thoroughly worked in the original.\n\nBarbara and Barbra were supported by a subsidiary leading man, a psychiatrist who mostly stood around and watched the irrepressible and lovable star. The new scheme forces the doctor, here played by Harry Connick Jr., to carry the show. It’s an impossible task for a character who largely stands around watching when he isn’t standing around singing.\n\nThe skeleton of the “Clear Day” plot is retained, but without a leading lady playing dual roles, it’s like a banana split without bananas. Melinda’s neurotic half, Daisy, is now played by a slip of a boy who works in a flower shop; the unsuccessful surgery weakens the score. Some songs, which refer to Daisy’s excised ESP story thread, seem robbed of their meaning; the now extraneous title song is relegated to the closing spot. Two songs have been transformed into overblown production numbers, and the new plot calls for seven reprises. (Added songs come from the Fred Astaire pic “Royal Wedding.”) The keen listener will notice numerous unfamiliar lyrics; Lerner seems to have been rewritten by an uncredited hand, and clumsily so.\n\nThe main items of interest in this misguided affair are the performances of the split-in-two heroine. Jessie Mueller, as the glamorous Melinda, is a find; the character has been transformed into a 1943 jazz singer, and Mueller handles this extremely well when given a chance (as in “Ev’ry Night at Seven”). David Turner plays Davey — formerly Daisy — and acquits himself respectably in a role that might well have come across as offensive.\n\nChristine Jones‘ scenery, which complemented the concepts of Mayer’s “Spring Awakening” and “American Idiot,” here is built on psychiatric patterns of lines, stripes and triangles filled with blues, purples and oranges, and at times is almost painful to look at. The action has been moved to 1974, as evidenced by Catherine Zuber’s costumes, heavy on bellbottoms and platform shoes.",
  "isFullReview": true,
  "textWordCount": 524,
  "archivePath": "data/archives/reviews/on-a-clear-day-you-can-see-forever-2011/variety--steven-suskin_2026-02-06.html",
  "textFetchedAt": "2026-02-06T09:13:02.782Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 524,
  "tierReason": "Full review text"
}