{
  "showId": "kinky-boots-2013",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "http://theater.nytimes.com/2013/04/05/theater/reviews/kinky-boots-the-harvey-fierstein-cyndi-lauper-musical.html?pagewanted=all&_r=2&",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "web-search",
    "bww-roundup"
  ],
  "bwwExcerpt": "'Kinky Boots,' with a book by Harvey Fierstein and directed by Jerry Mitchell, is a reminder that you don't always have to be a masochist to enjoy being smashed by a steamroller...Unlike her more commercially savvy coeval Madonna, Ms. Lauper has held on to the same goofy image throughout her career, and, equally unlike Madonna, she has always seemed to sing from the heart. That sincerity comes through in 'Kinky Boots'...The leading players here - notably Stark Sands, Billy Porter and Annaleigh Ashford - pick up on the trademark Lauper mix of sentimentality and eccentricity, but each makes it his or her own. Under Mr. Mitchell's precise and affectionate direction, they do what you want performers in musicals to do: they define specific characters by the way they sing and move.",
  "bwwScore": 8,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-KINKY-BOOTS-Opens-on-Broadway-Updating-LIVE-20130404",
  "publishDate": "April 4, 2013",
  "showScoreExcerpt": "\"Portraying Lola, Mr. Brady gleams with unassailable contentment and confidence, at least as long as he’s wearing a dress…It is a relief to report that Mr. Brady’s singing and dancing chops are of Broadway caliber...He radiates stellar heat and good humor...The perpetual cheer-churning machine that is 'Kinky Boots' keeps moving forward smoothly and propulsively, even through the inspirational quicksand of its second act.\"\n\nRead more",
  "fullText": "https://www.nytimes.com/2013/04/05/theater/reviews/kinky-boots-the-harvey-fierstein-cyndi-lauper-musical.htmlShare full articleAdvertisement\n\nCyndi Lauper knows how to work a crowd. Making her Broadway debut as a composer with “Kinky Boots,” the new musical that opened on Thursday night at the Al Hirschfeld Theater, this storied singer has created a love- and heat-seeking score that performs like a pop star on Ecstasy. Try to resist if you must. But for at least the first act of this tale of lost souls in the shoe business, you might as well just give it up to the audience-hugging charisma of her songs.\n\nYet, for a good while, “Kinky Boots” manages to ride over the skeptical grumbling of your conscious mind. That has a lot to do with Ms. Lauper (who, though she did appear on Broadway in the 2006 “Threepenny Opera,” is not in this show). From the time she soared to fame with the album “She’s So Unusual“ in 1983, Ms. Lauper has been known as the ultimate tough but vulnerable misfit, bright and hard on the outside but with a sweet and melting center. Unlike her more commercially savvy coeval Madonna, Ms. Lauper has held on to the same goofy image throughout her career, and, equally unlike Madonna, she has always seemed to sing from the heart.\n\nThat sincerity comes through in “Kinky Boots.” So does the defiant quirkiness that made even Ms. Lauper’s gooier recordings palatable. The leading players here — notably Stark Sands, Billy Porter and Annaleigh Ashford — pick up on the trademark Lauper mix of sentimentality and eccentricity, but each makes it his or her own.\n\nUnder Mr. Mitchell’s precise and affectionate direction, they do what you want performers in musicals to do: they define specific characters by the way they sing and move. From their entrances, the cast members build up a bank of good vibrations. This is fortunate, since we’ll need to cash in those vibes in the show’s second half, when the preachier aspects of Mr. Fierstein’s script take over, and all the clichés stand naked before you.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 359,
  "archivePath": "data/archives/reviews/kinky-boots-2013/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T17:34:54.811Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee auth failed: Monthly API calls limit reached: 1250000"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 359,
  "tierReason": "Full review text"
}