{
  "showId": "caroline-or-change-2021",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2021/10/27/theater/caroline-or-change-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2021/10/27/theater/caroline-or-change-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "Now Clarke, who won an Olivier award for her performance in the British production, adds hers. She makes of the maid an almost Shakespearean figure; even at the depths of the character's despair, in the scarifying 11 o'clock number \"Lot's Wife,\" she commands attention without begging for it, and does not allow herself, because Caroline wouldn't, the luxury of collapse. The result of that restraint is more painful than cathartic, leaving the story's emotional rele",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-CAROLINE-OR-CHANGE-Opens-On-Broadway-See-What-the-Critics-Are-Saying-20211027",
  "fullText": "https://www.nytimes.com/2021/10/27/theater/caroline-or-change-review.htmlShare full article38Advertisement\n\nDifficult, even painful stories are no impediment to great musicals. Maybe the opposite is true. Pogroms, suicides and revolutions have all been turned into transcendent shows.\n\nStill, few have dared to tell as many such stories as “Caroline, or Change” does. But of the subjects “Caroline” grabs in the meaty fist of its ambition — civil rights, economics, mourning, the Mississippi floodplain — the most radical is also the most traditional: the anguish of troubled love.\n\nI speak not of love like Tony and Maria’s, nor even Porgy and Bess’s, but of the love, more honored in the breach, between Blacks and Jews. No musical has ever faced its country’s history, its creators’ history and the history of its genre — which has often caricatured both groups — as unblinkingly as “Caroline.”\n\nThat was true when it premiered at the Public Theater in 2003 and feels truer now in the electrifying Broadway revival that opened on Wednesday at Studio 54. Not because much has changed in the show itself. Tony Kushner’s book and lyrics, no less than Jeanine Tesori’s flood of ’60s-style music, remain models of thematic concision, wonders of imagery, daring pileups of incompatible emotions.\n\nBut the world around “Caroline” has changed in ways that make it seem more prescient, more painful and — despite a performance of tragic grandeur in the title role by Sharon D Clarke — more hopeful now than it did back then. As if to acknowledge that, the first thing we see in Michael Longhurst’s shrewd staging for the Roundabout Theater Company, based on his 2018 British production, is a Confederate statue called “that ol copper Nightmare Man.” By evening’s end, at least that nightmare will be over.\n\nOthers will remain to prickle your conscience and your politics; the premise almost seems designed to make you squirm. Caroline Thibodeaux is a 39-year-old Black woman who, in 1963, works for the Gellmans, a Jewish family in Lake Charles, La. Cleaning, doing laundry and minding 8-year-old Noah after school, she earns $30 a week; on that paltry salary, lacking the help of her absent husband, she must sustain her children. With tyrannical self-discipline that leaves little time for warmth, she very nearly manages.\n\nAs the leading character in a musical, Caroline is unique: Titanically dour, she seeks to repel all sympathy her circumstances might invite. Noah, too, is a complex character, mourning his mother’s death from lung cancer and fixating on Caroline as a substitute parent. (In this production, three young actors alternate in the role.)\n\nDespite their twinned sadnesses, Noah’s love thaws Caroline only to the point of allowing him to light her daily cigarette. Otherwise, she treats him as she might an untrained puppy, shooing him out of the basement where she works, “16 feet below sea level,” in the oppressive heat and humidity of the appliances of her trade.\n\nThe equilibrium of this precarious system is carefully set up in the opening scenes, as is the musical’s stylistic daring. Instead of a chorus, Kushner provides a pantheon of singing allegorical figures: the bubbly washing machine (Arica Jackson), the infernal dryer (Kevin S. McAllister), the sexy radio (Nasia Thomas, Nya and Harper Miles, wearing aerial tiaras), and the serene moon (N’Kenge). (Later, there’s also a bus, wonderfully voiced by McAllister.) Around these companions she can be herself, as she daren’t around Noah or his despised new stepmother, Rose.\n\nCaroline’s imperviousness at first tips the balance of the show’s sympathy toward Noah, whose fantasy of being centrally important in her life is excused by his youth and his grief. (If he is something of a martyr, perhaps it is not insignificant that Kushner sets the semi-autobiographical story at 913 St. Anthony Street.) In a more typical musical, the fulfillment of his needs would fulfill Caroline’s as well.\n\nInstead, Noah (Jaden Myles Waldman on the night I attended) precipitates the show’s crisis, unwittingly egged on by Rose (Caissie Levy). Recently married to Noah’s feckless father, and trying to assert authority in the awkward situation, she imposes a new rule: Caroline should keep any change she finds in Noah’s dirty clothes. When Noah, in response, starts leaving money deliberately, Caroline must fight with herself about taking it; the emotional underpinnings of the household, which Kushner equates with economics, very quickly collapse. Change causes change.\n\nAnd that’s barely the half of it. “Caroline” is as full of incident as Kushner’s “Angels in America,” but hugely condensed and then heightened by song. The wonder is that it is never less than thrilling to experience. This being a musical, the music is part of that; Tesori’s wondrous score is like the search function on a car radio, picking up snippets of every genre on the dial. The sounds of klezmer, blues, Broadway, Motown, Mozart and girl-group pop, among many others, pinpoint each character but also serve as expressive vehicles for the larger ideas the story is assembling.\n\nThose ideas start small. It seems merely an irritating infraction, for instance, that Rose mispronounces Caroline’s name as Carolyn — until you notice Clarke wincing as if struck when it happens.\n\nAnd Noah’s fantasies, which at first seem merely sweet, soon grow ridiculous and grandiose. He imagines Caroline’s children — teenage Emmie (Samantha Williams) and her younger brothers Jackie and Joe (Alexander Bello and Jayden Theophile on the night I attended) — praising him over dinner for his largess: “Thank God we can eat now!” In reality, they do not think of him at all.\n\nCaroline does, if no longer as a pitiful boy then as an ethical dilemma, an heir to the exploitative ways of even liberal whites. Nor does she see Rose as anything more than a tightfisted employer. I’m afraid I almost did, too; it’s a rare miscalculation that she is made the villain of a piece that doesn’t need one. (Surely Noah’s father, Stuart, a musician who in John Cariani’s performance is as mournful as the clarinet he plays, is just as culpable.) In any case, the force of the characters’ needs, once set in motion, is more than enough to do the damage.\n\nLonghurst best dramatizes the oncoming collision in his acute staging of the Gellmans’ Hanukkah dinner. At the middle of the stage, the family — now expanded to include Rose’s lefty father visiting from New York (Chip Zien) and Stuart’s don’t-rock-the-boat Southern parents (Stuart Zagnit and Joy Hermalyn) — sing and dance and argue. Rose’s father offers Noah a marvelously compact sermon along with a fateful $20 bill:\n\nMoney follows certain laws,it’s worth how much it’s worth becausesomewhere, something’s valued less;it’s how our blessings come, I guess.\n\nMeanwhile we see Caroline, her friend, Dotty (Tamika Lawrence), and Emmie hustling to prepare and serve the holiday meal as they circumnavigate the Gellmans on a turntable. Though the whites are literally centered, the image nevertheless decenters whiteness, with the Black characters often obscuring them. Thus we are well prepared, though we may still gasp, when late in the second act Noah asks if he and Caroline can ever again be friends.\n\nHer answer is crushing: “Weren’t never friends.”\n\nThat huge lesson in the boy’s life, a lesson the actual boy evidently took to heart, is but a moment in Caroline’s. The story does not end with him but with her and her family. If this is an admirable insight from white authors, keep in mind that the musical was strongly shaped by Black artists as well, among them the original director, George C. Wolfe, and his Caroline, Tonya Pinkins. Their imprint is everywhere.\n\nNow Clarke, who won an Olivier award for her performance in the British production, adds hers. She makes of the maid an almost Shakespearean figure; even at the depths of the character’s despair, in the scarifying 11 o’clock number “Lot’s Wife,” she commands attention without begging for it, and does not allow herself, because Caroline wouldn’t, the luxury of collapse.\n\nThe result of that restraint is more painful than cathartic, leaving the story’s emotional release to those who can afford it: Caroline’s children. The chance to believe in change is her hard-won bequest to them — and, in this devastating, uncomfortable, crucial musical, to us.\n\nCaroline, or ChangeThrough Jan. 9 at Studio 54, Manhattan; roundabouttheatre.org. Running time: 2 hours 30 minutes.\n\nJesse Green is the chief theater critic. Before joining The Times in 2017, he was the theater critic for New York magazine and a contributing editor. He is the author of a novel, “O Beautiful,” and a memoir, “The Velveteen Father.”",
  "isFullReview": true,
  "textWordCount": 1420,
  "archivePath": "data/archives/reviews/caroline-or-change-2021/nytimes--jesse-green_2026-02-05.html",
  "textFetchedAt": "2026-02-05T01:31:27.198Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251025125821",
  "archiveOrgUrl": "http://web.archive.org/web/20251025125821/https://www.nytimes.com/2021/10/27/theater/caroline-or-change-review.html",
  "contentTier": "complete",
  "wordCount": 1420,
  "tierReason": "Full review text"
}