{
  "showId": "what-the-constitution-means-to-me-2019",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/what-constitution-means-to-me-theater-1198404/",
  "publishDate": "March 31, 2019",
  "fullText": "Lots of great plays acquire timeliness as their themes circle around again to find fresh echoes in the sociopolitical cycle — think Shakespeare, Shaw, Miller. But given the years of development usually involved, few new works for the stage are as instantly, trenchantly timely as writer-performer Heidi Schreck’s sui generis memoir What the Constitution Means to Me.\n\nThe seed idea for this deceptively freewheeling yet ingeniously structured piece — an impassioned civics debate illuminated by intense personal reflection that embraces both anguish and hope — was first hatched 20 or so years ago, with actual work on the play beginning some 10 years later. But its arrival right now seems almost a direct response to a moment in which women’s voices demand to be heard with an urgency not felt since second-wave feminism, and when so many basic rights of Democracy appear under threat. The temporal convergence is uncanny.\n\nPerhaps that’s why director Oliver Butler's compact, briskly paced production, became such a word-of-mouth sensation when it premiered at New York Theatre Workshop last fall, propelling it now to Broadway after sold-out extended runs at two venues that drew an impressive list of names from across politics, media and entertainment.\n\nIt’s a play of ideas for which people are not just hungry but starved. What makes it so edifying is that this isn’t the kind of political theater that merely reaffirms the views of a liberal audience. It challenges us to step back and look at the bigger picture, to dwell not just on losses but also gains. And while it certainly contains elements that encourage us to engage with whatever tools we have in the struggle to keep our precarious rights and freedoms from moving backwards, its effectiveness is the result not of a call to action so much as the simple, inherently generous act of storytelling.\n\nAmbling out onto the stage with an eager smile and relaxed, friendly manner, Schreck makes clear from the outset that there is no fourth wall, introducing herself and establishing a warm connection with the audience. She then swiftly frames the show as a recollection of her experience as a 15-year-old from a small town in Washington state, traveling the country giving speeches about the U.S. Constitution in American Legion contests and collecting prize money that would put her through college. “Thank you,” she says in response to the admiring applause. “It was 30 years ago and it was a state school, but thank you.”\n\nExplaining that she started thinking about the Constitution again a few years ago, “for various reasons,” Schreck tells us she began wondering what it was she loved so much about the country’s founding document as a teenager. So the play is set up as a shared recreation of that earlier Heidi giving a remembered version of her prize-winning speech. The setting is a non-naturalistic representation of her local American Legion hall that she acknowledges was reconstructed from her dreams, with help from set designer Rachel Hauck. She asks us, the audience, to imagine ourselves as the men — they were all men — who judged her efforts.\n\nThe illusion, such as it is, gets extended with the arrival on stage of actor Mike Iveson, in Legionnaire uniform, who explains the rules of the two-part contest. The competitor gets seven minutes to deliver a prepared speech demonstrating his or her understanding of the Constitution and how it pertains to their lives, before drawing a random Amendment and speaking extemporaneously on that subject.\n\nThis sounds like the basis for a sketch more than a play, but what makes it so involving is the way 15-year-old Heidi increasingly struggles to stay within the boundaries of the re-enactment, as late-40s Heidi impulsively cuts in to add her lengthy observations. What’s driving her is the fact that as a teenager, she was “pretty emotionally guarded,” which put her at a disadvantage to a chief rival with no shortage of moving stories about her pioneer grandmother, even if it didn’t stop Heidi from winning.\n\nShreck shares the stories she held back in her youth — of her immigrant great-great grandmother Theressa, who came to Washington state from Germany by way of a mail-order bride catalog, price tag $75, later dying of melancholia at 36 in a state mental hospital; of her battered grandmother, whose abusive second husband broke her nose, her arm, beat up her kids and began raping her eldest daughter when she turned 16; and of her own mother, who bravely called the cops on her stepfather at 14, testifying against him in court.\n\nExpertly weaving them in amongst lighter observations and humorous personal revelations, Schreck tells these harrowing stories with the raw vulnerability of someone who will probably continue parsing her family history her entire life — particularly that of the women. Her emotional candor is profoundly moving. It made me think for the first time in years about a particular aunt who died young, her twin daughters, the grandmothers I knew either hardly or not at all. The gray areas in their lives have always seemed clouded by sadness, in one case shocking tragedy. It also made me want to learn more about my own immigrant great-great grandparents.\n\nSchreck makes repeated mention of her feelings while creating this piece, and it’s significant that she uses the verb “making” rather than “writing.” The thoughtful craftsmanship that has gone into building the play is fully evident, notably in the skill with which Schreck relates her own history to the gaping holes in the Constitution where adequate protections for women should be. Without ever veering into lecture territory, she deftly ties her family stories to issues such as reproductive rights, domestic violence, sexual assault, gender equality and even the fundamental human right of personhood.\n\nClearly, the show’s many tonal transitions and its nimble leaps from one related subject to another have been carefully honed in the scripting. But as a performer, Schreck’s natural ability to balance effervescence (she says she was raised to be “psychotically polite”) and earnestness make it all play like stream-of-consciousness improvisation.\n\nHer skillful segues from her own family to the history of other women are achieved with crisp economy — the forced sterilization of women of color and indigenous women in the late 19th century; the Native American women whose marriages to white men were annulled when Washington became a state and the Constitution no longer considered those women as people.\n\nThat selective blindness is especially wrenching in Schreck’s account of the 2005 case of Jessica Gonzales, whose repeated calls to Colorado police — by phone and in person — for protection from her violent husband went unheeded during a night that ended with him murdering their three daughters. An audio clip from the Supreme Court hearing that resulted from that horrific crime reveals Antonin Scalia getting into a discussion about the semantics of the word “shall,” while spending little time talking about Gonzales or her daughters, aged 7, 8 and 10, as human beings.\n\nOn a contrasting droll note, we hear the uncomfortable throat-clearing of Supreme Court justices when obliged to consider women’s bodies — something for which there is zero language in the Constitution — in a 1965 case against a Connecticut Planned Parenthood staffer, arrested for distributing IUDs to women living in poverty.\n\nThe play’s spectrum is broadened when Iveson steps out from his “performance” role as a Legionnaire once Schreck has pretty much shredded the rules. He talks about his initial concern when Heidi asked him to be in the show as its representative of “positive male energy,” especially after having spent so many formative years considering himself more gender neutral. And he shares touching insights about the identity struggles of being the gay son of a working-class Welsh immigrant father. But this is not a transparent move to insert LGBTQ rights into the equation, although that is indeed touched upon, along with immigrant rights in an oblique reference that evokes the recent parent-child border separations. Rather, it serves to reinforce the play’s underlying point that our founding document needs to be reframed in inclusive human terms.\n\nIn the final, and most delightfully mutable part of What the Constitution Means to Me, which expands its think-piece nature further still while artfully tying everything together, Schreck welcomes onto the stage one of two New York City high school students, who are champion participants in Parliamentary debate contests today. Both times I’ve seen the show, it’s been with sharp-as-a-tack, charmingly self-assured 14-year-old Rosdely Ciprian, who alternates with 17-year-old Thursday Williams.\n\nIt’s here that Schreck’s hopeful outlook, based on the young women she has met while making this play, goes beyond rhetoric into shining example. The two women — separated by three decades of life experience — debate on whether the Constitution is protecting us, or is the source of our problems. Effectively, the argument boils down to: keep the flawed document and continue working on crucial Amendments to make it more adequately address our contemporary lives, the Equal Rights Amendment being a great place to start; or trash it and build a more comprehensive positive-rights document from scratch. The resulting conclusion can be surprising, varying from performance to performance depending on the audience member chosen as the final judge.\n\nWatching the spirited back-and-forth that wraps up this unique, stimulating and exquisitely heartfelt show on such an uplifting note, you can’t help but wish that the primary and election debates in our country’s hopelessly mired political system were even half as intellectually vigorous, half as perceptive and compassionate. If that were the case, the choices of every thinking person perhaps would be clear and our problems well on the way to being solved. We can dream, right?\n\nVenue: Helen Hayes Theater, New York\nCast: Heidi Schreck, Mike Iveson, Rosdely Ciprian, Thursday Williams\nPlaywright: Heidi Schreck\nDirector: Oliver Butler\nSet designer: Rachel Hauck\nCostume designer: Michael Krass\nLighting designer: Jen Schriever\nSound designer: Sinan Refik Zafar\nProduction: Clubbed Thumb, True Love Productions, New York Theatre Workshop\nPresented by Diana DiMenna, Aaron Glick, Matt Ross, Madeleine Foster Bersin, Myla Lerner/Jon Bierman, Jenna Segal/Catherine Markowitz, Jana Shea/Maley-Stolbun-Sussman, Rebecca Gold/Jose Antonio Vargas, Level Forward, Cornice Productions, Lassen Wyse Balsam, Nederlander Presentations/Kate Lear",
  "isFullReview": true,
  "dtliExcerpt": "Schreck has crafted a work of uncommon intelligence and emotional power that manages to be both deeply personal and bracingly political without ever feeling preachy.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Schreck has crafted a work of uncommon intelligence and emotional power that manages to be both deeply personal and bracingly political without ever feeling preachy.",
  "contentTier": "complete",
  "contentTierReason": "Short text (25 words)",
  "textQuality": "truncated",
  "previousUrl": "https://www.hollywoodreporter.com/news/what-constitution-means-me-theater-review-1197315/",
  "urlDiscoveredAt": "2026-02-04T01:49:16.375Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1699,
  "archivePath": "data/archives/reviews/what-the-constitution-means-to-me-2019/hollywood-reporter--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:49:16.384Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20260105034948",
  "archiveOrgUrl": "http://web.archive.org/web/20260105034948/https://www.hollywoodreporter.com/news/general-news/what-constitution-means-to-me-theater-1198404/",
  "wordCount": 1699,
  "tierReason": "Full review text"
}