{
  "showId": "what-the-constitution-means-to-me-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2019/03/31/what-the-constitution-means-to-me-heidi-schreck-gets-political-and-personal/",
  "publishDate": "2019-03-31T19:46:11",
  "fullText": "I have this fantasy that involves Heidi Schreck, a bunch of women, and MSNBC. It’s one of those innumerable indistinguishable partisan events we’re forced to endure in the endless run-up to a primary election. But here, it’s playwright and actress Schreck, not some cable-news talking head, who gets to ask the questions. Just imagine: Schreck—who, I’m convinced, knows the Constitution more intimately than any potential presidential candidate—getting in passionate discussions over amendments and clauses with Kamala Harris, Elizabeth Warren, Amy Klobuchar, and Kirsten Gillibrand. And hey, let’s invite Pete Buttigieg, Beto O’Rourke, and Cory Booker to the party. (Sorry, Bernie, only Democrats allowed in my fantasy debate.) It would be brilliant.\n\nFortunately, currently at Broadway’s Helen Hayes Theater, we have Schreck’s inventive, invigorating What the Constitution Means to Me, fresh from fall 2018 runs at off-Broadway’s New York Theatre Workshop and Greenwich House (she developed and debuted the show at Clubbed Thumb). This is what got me thinking about Schreck and Kamala and company.\n\nIf the title sounds like a high school civics-class assignment, that’s the point. The year is 1989, and Schreck, a 15-year-old from Wenatchee, Wash., obsessed with theater, witchcraft, and Patrick Swayze (same, girl), is traveling the country giving speeches about the Constitution at American Legion halls. Not just for fun—for prize money, which paid for her entire college education. “Thank you,” she tells the applauding audience. “It was 30 years ago and it was a state school, but thank you.”\n\nBut it was more than just a moneymaking scheme cooked up by her debate-coach mom. Schreck has a visible, and contagious, passion for the subject—and a gift for conveying it to the crowd. She uses words like “miraculous.” By the time she’s done you’ll be using them too.\n\nWhile it’s certainly not a lecture, the show is undoubtedly an education. If any of you knew what the Ninth Amendment was before seeing this, I applaud you. If any of you know any of the amendments off the top of your head—apart from the really big ones, you know, the First and Second (and maybe the 25th Amendment, since it’s mentioned so frequently these days)—again, bravo. But the Ninth? It reads: “The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.” Or, as Schreck explains, “Just because a certain right is not listed in the Constitution, it doesn’t mean you don’t have that right.” She breaks it down even further: “The fact is there was no possible way for the framers to put down every single right we have—the right to brush your teeth, sure you’ve got it, but how long do we want this document to be?” She calls it “the most magical and mysterious amendment of them all.”\n\nAnd just wait until she gets to the 14th Amendment: “The Fourteenth Amendment is like a giant, super-charged force field protecting all of your human rights,” she says, practically bursting with excitement. Here’s Section One, the first of five super-charged sections:\n\nAll persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State in which they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n\nAll persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State in which they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n\nHere also is where the show begins to get personal. “It doesn’t say anything about how immigrants can become citizens,” Schreck notes. Her great-great grandma Theressa—who came over from Gengenbach, Germany, when her great-great grandfather ordered her from a catalog—died at age 36 in a mental hospital before becoming one, she adds. The “nor shall any State deprive any person of life, liberty, or property, without due process of law” clause, she explains, is at the heart of Roe v. Wade (“Justice Harry Blackmun used the Ninth Amendment to find the right to privacy in the Fourteenth Amendment”); that’s when Schreck tells us about her own abortion. And she calls the last part, the equal protection line, “the most miraculous clause” in the whole Constitution.\n\n“It actually uses the word ‘person,’ not ‘citizen.’ Which means that if you are an undocumented immigrant, you must be given all the protections of Clause Three, the due process clause. You cannot be locked up without a fair trial. You cannot have anything—or anyone—seized from you.” Schreck pauses to take a deep breath. And I can’t help but think: Will someone send the orange abomination in the White House a copy of this amendment? Or, better yet, one of the pocket Constitutions that theatergoers receive toward the end of the show? It’s a lot like the one that Gold Star father Khizr Khan held up at the 2016 Democratic National Convention and offered to lend the then–Republican nominee.\n\nBut she has more important stories to tell: Like that of Jessica Gonzales, whose three young daughters, Rebecca, Katheryn, and Leslie, were kidnapped and later murdered by their father; Gonzales had a restraining order against her husband, but the police refused to help—and the Supreme Court eventually ruled, in 2005’s Castle Rock v. Gonzales, that they weren’t obligated to do so. And there’s her Grandma Bette, a strong woman—she was a waitress, but her side hustle was log running—whose second husband beat her, his stepchildren (including Schreck’s mom), and his own children. “I actually know this story pretty well but I prefer to read it,” Schreck explains as she takes a stack of index cards from Mike Iveson, the actor who plays a Legionnaire/contest monitor (inspired by a real figure from Schreck’s speechifying days) then morphs into her onstage support system; she describes him as “positive male energy,” and he is, once he sheds the pins and ribbons and pointy hat and becomes himself.\n\nIt would be enough if Schreck had made this simply her show—her memoir, her coming-of-age story, her take on the Constitution. But she dedicates the last section to debate with a high school student—Rosdley Ciprian and Thursday Williams alternate performances—much like her younger self. The topic: Should we abolish the U.S. Constitution? The night I attended, Schreck argued to get rid of it (“It is doing exactly what it was designed to do from the beginning, which is to protect the interests of a small number of rich, white men”) and Williams argued to keep it (“Just like us, this document is flawed. But just like us, it is also capable of getting better. And better. With every generation”). Each night, one audience member decides who won the debate. But no matter what, you get to keep your pocket Constitution.\n\nThe first time I saw Schreck’s show was the weekend after the Brett Kavanaugh hearings. After watching his smug, self-satisfied face and histrionic outbursts replayed on TV and Twitter ad nauseam, Constitution was comforting and restorative; it was exactly what I needed. Now, it feels energizing and hopeful—and exactly what our country needs.\n\nWhat the Constitution Means to Me opened on March 31, 2019, at the Helen Hayes Theater and runs through August 24. Tickets and information: constitutionbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial"
}
