{
  "showId": "what-the-constitution-means-to-me-2019",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2019/legit/reviews/what-the-constitution-means-to-me-review-1203177085/",
  "publishDate": "March 31, 2019",
  "fullText": "Heidi Schreck’s affecting disquisition on the U.S. Constitution is an eye-opener -- and a jaw-dropper.\n\nCall it stealth theater. In the disarming introduction to her play \"What the Constitution Means to Me,\" Heidi Schreck holds forth in an American Legion hall in her hometown of Wenatchee, Wash., an “abortion-free zone” where her 15-year-old self is competing in the regional semifinals of a Legion oratory contest. The debate topic, of course, is what the Constitution means in the life of a high school girl from Wenatchee, Wash., in 1989.\n\nHer mother, she tells us, managed to preserve (and treasure) the hunk of hair she cut off in high school. But for some reason, she threw out her daughter's prize-winning speech, leaving Schreck no choice but to recreate a version of the talk she gave thirty years ago, on a civic stage very like the one designed for Broadway by Rachel Hauck. (Highly waxed floor, a showy display of flags and a photo gallery of all-male worthies.)\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Variety's 'Actors on Actors' Earns Fourth Daytime Emmy Nomination\n\nThe engaging writer-performer is all smiles and so are we, anticipating a naive speech from a bright high school girl about her personal appreciation of the U.S. Constitution. But by the end of the show, we've been stirred — and challenged — by her penetrating insights into that document. This is not a spoiler, but a promise.\n\nThe big reveal is that the actual word \"woman\" is not even mentioned in our Constitution. (Pause here for gasps from the audience.) Not once. Not in the Amendments that filled in the gaps. Not even in the Fourteenth Amendment that validates the equal rights of emancipated slaves. In fact, the Fifteenth Amendment specifically guarantees the right to vote regardless of \"race, color, or previous condition of servitude\" without acknowledging the inclusion of women in that right.\n\nBy now, Schreck is armed and dangerous. Testifying now as her grown-up self, she pays homage to all the women in her family who suffered domestic abuse, going back four generations to her great-great grandmother, a mail-order bride who was bought for $75 and died at age 36 of \"melancholia\" in a mental institution.\n\nAlthough she never drops her unthreatening demeanor of all-American niceness, Schreck takes a more acerbic tone as she works up to her true subject: the rights that the Constitution does not specifically guarantee women. (The practice of birth control, she pointedly reminds us, was a crime until it was legalized in 1972.)\n\nWe blew it, she emphasizes, when the cherished Fourteenth Amendment, which asserts that no \"person\" can be denied equal protection under the law, failed to spell out that women are also persons. We blew it again, she says, when the Equal Rights Amendment failed to pass. Left legally unprotected against violence, women can anticipate an extension of the \"centuries of inherited trauma\" that are their birthright.\n\nTo her credit, Schreck doesn't let righteous anger curdle into polemics. On the contrary, she closes with an uplifting message: \"The only thing holding us together right now as a country is a collective faith in this document.\"\n\nIt's especially shrewd of her to conclude the show with a literal debate with a high-school orator. Rosdely Ciprian, a 14-year-old freshman, held up her end with admirable ease at the performance this reviewer caught. (Thursday Williams, a senior at William Cullen Bryant High School in Queens, plays the role three nights a week.) Honestly, how great is that?",
  "isFullReview": true,
  "dtliExcerpt": "Schreck has fashioned a work of theater that is both deeply personal and urgently political, managing to be funny, heartbreaking and galvanizing all at once.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Schreck has fashioned a work of theater that is both deeply personal and urgently political, managing to be funny, heartbreaking and galvanizing all at once.",
  "contentTier": "complete",
  "contentTierReason": "Short text (25 words)",
  "textQuality": "full",
  "previousUrl": "https://variety.com/2019/legit/reviews/what-the-constitution-means-to-me-review-heidi-schreck-1203169751/",
  "urlDiscoveredAt": "2026-02-04T01:49:52.008Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 579,
  "archivePath": "data/archives/reviews/what-the-constitution-means-to-me-2019/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:49:52.013Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250722091216",
  "archiveOrgUrl": "http://web.archive.org/web/20250722091216/https://variety.com/2019/legit/reviews/what-the-constitution-means-to-me-review-1203177085/",
  "wordCount": 579,
  "tierReason": "Full review text"
}