{
  "showId": "reasons-to-be-pretty-2009",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "Unknown",
  "url": "http://www.hollywoodreporter.com/review/reasons-be-happy-theater-review-566335",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/reasons-be-happy-theater-review-566335",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NEW YORK – First seen in 2008 on this same stage before transferring to Broadway, Neil LaBute’s four-character dissection of thorny relationship dynamics, Reasons to Be Pretty, is among the playwright’s most mature and satisfying works, distinguished by its uncharacteristic emotional rawness. Picking up the same fractious quartet a few years down the track, Reasons to Be Happy is an engrossing if less impactful companion piece that again tempers LaBute’s sardonic side by allowing a glimmer of compassion for people who seem incapable of sustaining lasting connections.\n\nThe play mirrors the structure of the earlier work a little too schematically. It opens with another fierce tirade from an enraged female, followed by a succession of mainly two-person encounters, shuffling back and forth between a soul-deadening workplace and neutral ground. While never quite escaping its more-of-the-same feel, this freestanding quasi-sequel improves as it steadily tightens its focus on the writer’s stand-in, Greg (Josh Hamilton). Via that character, it reflects on the sometimes painful necessity of cutting ties with the past in order to have a legitimate shot at self-knowledge. However, that makes it a rinse-and-repeat variation on Greg’s arc in the earlier work.\n\nPHOTOS: Tony Awards 2013: Red Carpet Arrivals\n\nWhen Reasons to Be Pretty premiered, it was labeled the conclusion of a trilogy by LaBute about the cultural premium placed on physical appearance, following The Shape of Things and Fat Pig. The playwright appears to be revising that structural grouping with this new work, which explores interlocking romantic triangles and closes on the threshold of further developments for Greg and Steph (Jenna Fischer) and Carly (Leslie Bibb) and Kent (Fred Weller).\n\nAnyone who saw the previous play will remember that volatile hairdresser Steph is an expert at hurling invective, and that chronically passive Greg, the bookish former warehouse worker who has now graduated to teaching, is skilled at ducking and deflecting. The cause of Steph’s anger this time is the discovery that Greg has begun a relationship with her gorgeous friend Carly, Kent’s ex-wife, a security guard at the plant where Greg and Kent used to work. While Steph has moved on and married since the messy end of her relationship with Greg, she tells him in no uncertain terms that he has crossed a line.\n\nBut amid the animosity she feels toward him, Steph’s old attraction to Greg resurfaces. Being someone who lets things happen to him rather than taking the wheel, Greg goes along with the plan to give it another shot with Steph. However, the situation gets more complicated when he attempts to break the news to Carly and she informs him that she’s pregnant.\n\nPHOTOS: Broadway Musicals That Have Sung Their Way to the Big Screen\n\nSet in the airless suburbs of some unnamed Middle American town, this would be standard soap in most writers’ hands. LaBute at least keeps it lively with his honed dialogue and his skill at getting under an audience’s skin by exposing misdemeanors many of us have committed at one time or another in a relationship.\n\nIn his depiction of obtuse Steph in particular – and also in The Office star Fischer’s abrasively off-putting characterization – the playwright seems to be actively courting the charges of misogyny that have often been leveled at his work. But though the women are set up to appear manipulative, self-serving and even disloyal, they end up being the more reasonable ones, making rational decisions while the guys mostly amble along being evasive.\n\nWhen non-confrontational Greg finally develops the backbone to face some personal truths and set out in search of a life, it’s a breakthrough. However, LaBute is too cynical a playwright not to leave some gnawing doubt as to whether Greg is really capable of change.\n\nDirected by LaBute, this is a pithy production of a play that maintains involvement and generates some squirmy humor. But unlike the bristling first chapter that introduced these characters, it never yields a lot in the way of emotional rewards. To be honest, it’s harder to care this time around about any of them, either as individuals or couples.\n\nFischer and Bibb do what’s required of them. But their lack of professional stage experience makes them no match for the guys, both of whom go down murky alleys of male weakness and dishonesty. Playing the least sympathetic character, Weller (USA Network’s In Plain Sight) is arguably the most enjoyable of the four actors to watch, whether Kent is simmering with barely contained hostility, sharing his primitive views on women or dissolving into painful self-pity. His scenes with Greg are the play’s truest. But that’s unsurprising given that LaBute has always been most at home when investigating the male psyche, particularly as concerns men’s desire of and behavior toward women.\n\nHamilton captures the internal conflict of a guy who has outgrown his environment and the associations that come with it, yet up to now has struggled to see himself someplace else. As the heart of the play, however, he lacks the yearning ache that Thomas Sadoski brought to the same character in Reasons to Be Pretty. But perhaps that’s missing in the writing.\n\nVenue: Lucille Lortel Theatre, New York (runs through June 29)\n\nCast: Leslie Bibb, Jenna Fischer, Josh Hamilton, Fred Weller\n\nPlaywright-director: Neil LaBute\n\nCostume designer: Sarah J. Holden\n\nSound designer: Robert Kaplowitz\n\nPresented by MCC Theater, by special arrangement with the Lucille Lortel Theatre Foundation\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice.",
  "isFullReview": true,
  "textWordCount": 1008,
  "archivePath": "data/archives/reviews/reasons-to-be-pretty-2009/hollywood-reporter--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:49:20.277Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 1008,
  "tierReason": "Full review text"
}