{
  "showId": "spring-awakening-2006",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/spring-awakening-review-deaf-culture-in-a-revelatory-rock-musical-1.10890858",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/spring-awakening-review-deaf-culture-in-a-revelatory-rock-musical-1.10890858",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Updated September 25, 2015 3:59 PM\n By LINDA WINER linda.winer@newsday.com\n\nadvertisement | advertise on newsday\n\nBOTTOM LINE: Less edgy than the original, but an original all its own.\n\nWhen a Los Angeles company called Deaf West Theatre brought its breakthrough musical revival of \"Big River\" to Broadway in 2003, the combination of American Sign Language and spoken word fused into a surprising form that told its Huck Finn story through song and a kind of beautiful gestural ballet.\n\nAnd when a revelatory rock musical called \"Spring Awakening\" won eight Tonys in 2007, the audacious show made riveting rock art out of a scandalous 1891 tragedy about repressed adolescents in a German village. Not incidentally, this primal scream of turbulent puberty introduced such big-future newbies as Lea Michele, Jonathan Groff and John Gallagher Jr.\n\nNow Deaf West is back to put its unique, if not as edgy, interpretive touch on a work deeper, darker, more dauntingly challenging than \"Big River.\" The acclaimed production, which just got 16 nominations for theater awards in Los Angeles, combines Deaf actors, hearing actors and a hero, Austin P. McKenzie as Melchior, who hears but is also fluent in ASL. Since the other two main characters in this ensemble show are deaf -- Sandra Mae Frank as budding Wendla, Daniel N. Durant as the misfit Moritz -- they are deftly shadowed by singing and speaking counterparts in modern dress.\n\nThis is, after all, a story about innocent kids, deprived of sex education, who sing about \"The Word of Your Body,\" one of the stirring Steven Sater-Duncan Sheik songs. Spencer Liff's choreography, though lacking the creepy and erotic romanticism of Bill T. Jones' brilliant original, builds on the cumulating furies of self-discovery.\n\nThe adults -- cruel or at least clueless -- are played by Tony-winning Deaf actress Marlee Matlin, with talking and singing supplied by basso Patrick Page, and Camryn Manheim, who is more cartoon evil than necessary.\n\nThe costumes and the spare double-decker stage with the upstairs band are by Dane Laffrey. Most of the dress, including the white underwear worn in the preshow, is late 19th century. But the stirrings -- masturbation, incest, suicide, abortion -- are as timelessly modern as when pioneering pre-Expressionist playwright Frank Wedekind shocked his world with them.\n\nadvertisement | advertise on newsday\n\nThe results are moving and both visually and musically impressive, if ultimately a bit repetitious. Although the production never quite delivers the knotted punch of the sharp-edged original, the teens' stifled internal lives roil with the power of outsider-ness and communication crises that transcend straightforward storytelling.\n\nWHERE Brooks Atkinson Theatre, 256 W. 47th St.\n\nINFO $35-$160; 877-250-2929, springawakeningthemusical.com\n\nComing soon: Newsday's Entertainment newsletter, for the latest on celebs, TV, more.\n\nNewsday.com now uses Facebook for our comment boards. Please read our guidelines and connect your Facebook account to comment.",
  "isFullReview": true,
  "textWordCount": 471,
  "archivePath": "data/archives/reviews/spring-awakening-2006/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:18:58.475Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20151001021609",
  "archiveOrgUrl": "http://web.archive.org/web/20151001021609/http://www.newsday.com:80/entertainment/theater/spring-awakening-review-deaf-culture-in-a-revelatory-rock-musical-1.10890858",
  "contentTier": "complete",
  "wordCount": 471,
  "tierReason": "Full review text"
}