{
  "showId": "spring-awakening-2006",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "http://www.nydailynews.com/entertainment/theater-arts/deaf-west-delivers-winning-spring-awakening-broadway-article-1.2373093",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/theater-arts/deaf-west-delivers-winning-spring-awakening-broadway-article-1.2373093",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "ExpandAustin P. McKenzie rocks as the rebellious Melchior.\n\nBetween raging hormones and clueless adults, the adolescents in \"Spring Awakening\" have plenty to sing — and wail — about.\n\nIn Deaf West's exhilarating reboot of the moody and stirring 2007 Tony winner by Duncan Sheik and Steven Sater, the repressed and rudderless kids are lifting more than their voices. They're also raising their hands to express themselves — and casting a whole new spell.\n\nThe show combines hearing and non-hearing actors who use American Sign Language. Some roles are played by two actors — one who sings and speaks, one who signs. Many in the cast do both at once.\n\nThe result: Lines and lyrics look as poetic and provocative as they sound.\n\nSigning is a natural for this story based on Frank Wedekind's bold 1890 drama about sex and teens whose concerns fall on the deaf ears of parents and professors. Signing adds a texture to an already arresting story and rich and rousing indie-rock score.\n\nA silent father-son scene with Daniel N. Durant, r., and Russell Harvard devastates.\n\nLike the show's first Broadway run, which boosted careers of Lea Michele and Jonathan Groff, this run is packed with young talent.\n\nWendla, an inquisitive girl who learns the hard way where babies come from, showcases the raw vulnerability of Sandra Mae Frank and the sweet singing of Katie Boeck.\n\nDespairing lost soul Moritz is brought to vivid life by a poignant Daniel N. Durant and Alex Boniello, who provides vocals.\n\nDefiant dreamboat Melchior is played solely by Austin P. McKenzie, whose assured theater debut is very impressive.\n\nDoomed Wendla is played by Katie Boeck (standing) and Sandra Mae Frank (kneeling). Camryn Manheim is her mother.\n\nAdult roles are handled capably by Marlee Matlin, Camryn Manheim, Patrick Page and Russell Harvard.\n\nMichael Arden, known as an actor from Deaf West's \"Big River\" in 2003 and more recently \"The Hunchback of Notre Dame,\" announces himself as a director in a big way.\n\nArden guides the cast to poignant portrayals and, in concert with choreographer Spencer Liff, keeps all moving parts gliding fluidly. Arden's best move: Using dead silence in two dire scenes. Words are projected on a large gray wall.\n\nSome may think \"Spring Awakening\" hasn't been gone long enough to miss it. But it's good to have it back.",
  "isFullReview": true,
  "textWordCount": 388,
  "archivePath": "data/archives/reviews/spring-awakening-2006/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:19:01.519Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20221204082155",
  "archiveOrgUrl": "http://web.archive.org/web/20221204082155/https://www.nydailynews.com/entertainment/theater-arts/deaf-west-delivers-winning-spring-awakening-broadway-article-1.2373093",
  "contentTier": "complete",
  "wordCount": 388,
  "tierReason": "Full review text"
}