{
  "showId": "spring-awakening-2006",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2006/legit/reviews/spring-awakening-1200514059/",
  "publishDate": "December 11, 2006",
  "fullText": "For anyone weary of pedestrian screen-to-stage adaptations or cut-and-paste jukebox assemblies, the arrival on Broadway of a truly original new musical like \"Spring Awakening\" is exhilarating. Seven years after it was first workshopped, Duncan Sheik and Steven Sater's artful reinterpretation of the 1891 German Expressionist drama has deepened considerably.\n\nFor anyone weary of pedestrian screen-to-stage adaptations or cut-and-paste jukebox assemblies, the arrival on Broadway of a truly original new musical like “Spring Awakening” is exhilarating. Seven years after it was first workshopped, Duncan Sheik and Steven Sater’s artful reinterpretation of the 1891 German Expressionist drama has deepened considerably. The show’s long evolution and further fine-tuning since its hit run at Off Broadway’s Atlantic Theater early this summer have amplified its resonance, adding texture and poignancy. It captures the dangerous anxiety of youth standing on the precipice of adulthood with transfixing honesty.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Disney CEO Succession Drama: How Josh D’Amaro Won the Battle to Replace Bob Iger \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Keys to the Kingdom: Why Josh D'Amaro and Dana Walden's Fates at Disney Are Now Intertwined\n\nIt’s hard to do adolescent angst without a degree of phoniness, but integrity and a refusal to condescend are arguably the primary achievements of Michael Mayer’s striking production. Where “Rent” now seems hampered by bad-ass, living-on-the-edge posturing, “Spring Awakening” has an authenticity that connects the show directly to the generation being depicted. Getting that generation — not a prime theatergoing demographic — to pay Broadway prices will be the major marketing challenge.\n\nSater’s book and lyrics seem to capture from within the uniquely teenage feeling that every emotion is the most tempestuous, frightening, passionate or exciting one ever experienced. Factor in Sheik’s melodic alt-rock score, which shifts easefully between dreamy and driving modes, Mayer’s highly physical direction, choreographer Bill T. Jones‘ convulsive movement and some of the richest, most full-bodied ensemble singing heard on Broadway in a long time, and you have a show that bristles with rawness, vitality and urgency.\n\nWhat makes the musical so distinctive is its audacious balancing act between period drama and contemporary edge. The smart central conceit is to remain largely faithful in book scenes to Frank Wedekind’s original text and its starchy language. However, musical numbers reveal inner voices that are distinctly modern. It’s disconcerting at first when 19th-century European schoolkids whip out hand mics from under their jackets and start belting out rock songs. But it’s a savvy, energizing device to explore the incongruity between appearances ruled by convention and expectation and the characters’ churning, angry secret selves.\n\nWedekind’s play remains startlingly frank in dealing with sexual initiation, masturbation, teen pregnancy, abortion, homosexuality and incest, subject matter that has enduring currency.\n\nDespite the natural shift into a more poetic idiom that adaptation into a musical entails, Sater has maintained, even heightened, the original text’s stinging candor, as has Mayer’s bold staging. And while Sater’s lyrics tend at times to stray toward purple, prosaic vagueness, they fit the scenario. Who can afford to indulge in gooey self-expression if not romantic 14-year-olds?\n\nSince the shift from the Atlantic, Mayer has ratcheted up the comedy in the opening scenes, particularly from doomed problem pupil Moritz (John Gallagher Jr.) and the various adult authority figures (Christine Estabrook, Stephen Spinella), recast for Broadway. The choice grates at first but it allows the drama to build in different directions, gathering layers of melancholy that crescendo into piercing sorrow in the second act before segueing into an ending that slides gracefully from tragedy to hope and possibility. The show now seems both more haunting and more uplifting.\n\nThe young cast all have grown more fully into their roles, ably led by Jonathan Groff as self-possessed progressive radical Melchior, Lea Michele as vulnerable, questioning Wendla and Gallagher as confused Moritz.\n\nThe peripheral characters have new depth, too, especially the boys. The perilously unbalanced romance between timid, fragile Ernst (Gideon Glick) and arrogant Hanschen (Jonathan B. Wright) treads a delicate line between comedy and pathos. On the distaff side, Lilli Cooper’s Martha and Lauren Pritchard’s Ilse, both damaged in different ways, make profound impressions. They also get one of the show’s most lacerat-ing songs, “The Dark I Know Well,” detailing the abuse they have suffered with visceral rocker-chick attitude.\n\nWhile they veer toward arch caricature as the monstrous schoolteachers, Estabrook and Spinella both improve on their predecessors in the roles. They each have penetrating moments, Estabrook as Melchior’s liberal-minded mother cornered into acting against her son, and Spinella as Moritz’s strict father during an intensely moving funeral scene paired with the beautiful song “Left Behind.”\n\nDesigner Christine Jones has negotiated the move into a larger space with superb results, the rear brick wall littered with bric-a-brac denoting male and female emblems. A centerstage section is cleverly adapted to sink into an open grave or be elevated in the play’s pivotal scene to become the hayloft .\n\nThe captivating experiment that started at the Atlantic of having lateral banks of onstage audience seating has been repeated, now with four additional singers sitting among them for extra vocal robustness. (The crystalline sound allows for serious volume without impeding comprehension of the lyrics.) The construction of downstage steps over the orchestra pit eliminates further distance between audience and players, enhancing the show’s immediacy.\n\nOf the production’s many arresting attributes, perhaps the most gorgeous is Kevin Adam’s lighting, a hypnotic, messy jumble of neon tubes and geometric shapes, hanging bulbs, sharp-edged beams and twinkling colors. A cascade of cerulean lights during “The Mirror-Blue Night” is magical.\n\nThis strange, beguiling show is by no means flawless, but with subtle, nurturing changes, the creative team and cast have fashioned an already seductive work into something even more lovely and lyrical.",
  "isFullReview": true,
  "dtliExcerpt": "This electrifying musical about teenage sexual awakening in 19th-century Germany crackles with raw energy and emotional authenticity that makes it feel utterly contemporary.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This electrifying musical about teenage sexual awakening in 19th-century Germany crackles with raw energy and emotional authenticity that makes it feel utterly contemporary.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 945,
  "archivePath": "data/archives/reviews/spring-awakening-2006/variety--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T18:18:42.475Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "duplicateTextOf": "variety--charles-isherwood.json",
  "wordCount": 945,
  "tierReason": "Full review text"
}