{
  "showId": "the-crucible-2016",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/the-crucible-review-ivo-van-hove-electrifies-arthur-miller-1.11636612",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/the-crucible-review-ivo-van-hove-electrifies-arthur-miller-1.11636612",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup",
    "bww-reviews",
    "show-score-playwright"
  ],
  "bwwExcerpt": "...despite the sprawling locations of Miller's story, all the action feels unforced into one big country schoolroom...Ronan -- blond, unbridled and unrecognizable from the gentle brunette in her Oscar-nominated film, 'Brooklyn' -- plays Abigail with the duplicity of a malevolent surfer-girl. Whishaw, as good-but-flawed John Proctor, is more low-key and less heroic than was Liam Neeson in the 2002 revival. Okonedo is quietly forceful -- and ultimately heartbreaking -- as John's wife, accused of witchcraft so Abigail can get her husband, and Hinds is aptly imperious as the pious, self-serving deputy-governor...Although van Hove resists even a hint of cheap contemporary resonance, the village characters in their everyday work clothes connect the dots for us. This is not to suggest that van Hove resists a few outrageous and entertaining touches of the hyper-theatrical.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-CRUCIBLE-Opens-on-Broadway-Updating-LIVE-20160331",
  "showScoreExcerpt": "\"In this gut-wrenching, modern-dress 'Crucible' — infused with the visceral suspense and the manipulative underscoring of a horror movie — the director denies us any protective distance from the cumulative modern implications of mass hysteria and hypocrisy. Despite the starry cast, this is a big splendid ensemble of equals. And despite the sprawling locations of Miller’s story, all the action feels unforced into one big country schoolroom.\"\n\nRead more"
}
