{
  "showId": "the-crucible-2016",
  "outletId": "njcom",
  "outlet": "NJ.com",
  "criticName": "Christopher Kelly",
  "url": "http://www.nj.com/entertainment/index.ssf/2016/03/the_crucible_saoirse_ronan_broadway_review.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "Van Hove is nothing if not consistent -- just like 'A View from the Bridge,' his approach to 'The Crucible' is alternately striking, lugubrious, and fruit loopy...Whether van Hove is succeeding in his stated goal of stripping away theatrical conventions and cutting to the heart of classic drama -- or, in fact, is doing the opposite, and serving up a 'Crucible' that is affected and artificial -- probably comes down to your personal taste...[Ronan's] Abigail is at once sexually forthright and sadistically righteous; the most nightmarish sorority queen you would never want to cross. As John Proctor, the man who once had an affair with Abigail and who is now suffering the unexpected consequences, the wonderful Ben Whishaw...is wholly commanding, even as he rarely raises his voice. He makes deeply palpable both Proctor's mounting outrage and the man's nagging guilt that his own moral weaknesses are what set this disastrous chain of events in motion.",
  "bwwScore": 9,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-CRUCIBLE-Opens-on-Broadway-Updating-LIVE-20160331",
  "showScoreExcerpt": "\"His approach is alternately striking, lugubrious, and fruit loopy...Whether van Hove is succeeding in his stated goal of stripping away theatrical conventions and cutting to the heart of classic drama—or, in fact, is doing the opposite, and serving up a 'Crucible' that is affected and artificial—probably comes down to your personal taste...If all of the disparate pieces never quite fit together, you can do a lot worse than an audacious production of a built-to-last masterpiece.\"\n\nRead more"
}