{
  "showId": "peter-pan-goes-wrong-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2023/04/19/peter-pan-goes-wrong-heap-o-corny-cheesy-mayhem-goes-right/",
  "publishDate": "2023-04-19T21:54:10",
  "fullText": "The past weeks have brought an uncongenial Camelot devoid of magic along with a decidedly bad Bad Cinderella deplete of enchantment. Over at the Barrymore, we suddenly find a ragtag company with a duct tape-and-spit budget but none of the pretensions of the aforementioned entertainments offering not only a bagful of hand-made magic and clumsy enchantment but also more good-natured cheer than both those big-budget musicals combined.\n\nYou even get to lustily boo the villain, if that is your wont, and he’ll boo right back at you. (“Josh Groban is a block over slitting everybody’s throat,” he yells at the audience over the din, “and nobody boos him!”) It’s been three years since sitting in a packed Broadway house with an eager Broadway audience has felt so—well—back to normal.\n\nAs those who remember the 2017 laff-fest The Play That Goes Wrong might discern, we speak of the Mischief troupe’s new romp, Peter Pan Goes Wrong. Yes, we have seen other Pans go wrong, either happily (as in Peter and the Starcatcher) or not (as in multiple problem plays which try to get under the pseudo-sexual psyches of contemporary Wendys and Peters). The present example, however, prides itself in going wrong—that’s in the title, after all—and the wronger, the cheesier, the hoarier the better. The folks who call themselves Mischief lust for low laughs. And they find ’em, by the kegful.\n\nIn this case, they take on J.M. Barrie’s 1904 play—just now on the cusp of a belated entry into the public domain, due to copyright vagaries—and explode it. The conceit is the same as in their earlier foray into the drayma, which ran almost two years at the Lyceum and continues in an off-Broadway transfer at New World Stages. We are attending a production of the Cornley Polytechnic Drama Society, which combines eager amateurs with what they term “real near-professional actors and directors.” The fictional members of the Cornley cast paste their provincial personalities on their Pan roles—as genuine professional actors never do, of course—so we are watching imported professional actors playing amateur actors giving a down-grade performance of Peter Pan on a set, and within a production, in which everything indeed does go wrong.\n\nThe five core members of Mischief, who seem to float between various productions of their various enterprises, have stepped back into the roles (and shtick) they created. Henry Shields introduces the piece, in his guise as director of this Cornley production, and goes on to play the dual roles of Mr. Darling and Captain Hook. I first encountered Shields standing in the aisle, prior to the performance, dressed in evening clothes and seating unsuspecting playgoers—who presumably took him to be an usher—in presumably wrong seat locations. He is tall, thin, and limber; at one point in the nursery scene, he seems to slip sideways through a closed door. But give him a sneer, a mustache, and a hook affixed to his right hand when it doesn’t slip off, and he is a terror who easily out-hams Cyril Ritchard (and if you don’t get that reference, Nathan Lane will do).\n\nHenry Lewis doesn’t even attempt a level of decorum. He spends much of the night as Nana, the dog. Too beefy to push through the doggie door in the lower half of the nursery door, he gets stuck and causes an array of missed entrances and bolloxed stage traffic. He moves into the guise of Hook’s henchman Starkey, who mumbles so prolifically that the trio of authors (the two Henrys and Jonathan Sayer) give him a full, unintelligible section which goes on until we can actually decipher his jabberwocky. The beefy (or fat-suited?) Lewis also steps into an ill-fitting black leotard to play Peter Pan’s shadow—don’t ask—and does an improbably funny shadow dance. Sayer takes the part of local actor Dennis, who in turn portrays Wendy’s brother John. He is relegated to the fringes, alas; the running gag upon which his role is built—that he cannot remember his lines, so they are obtrusively fed to him over a pair of anachronistic headphones—is not funny, at least to this viewer.\n\nCharlie Russell has relatively little room for fun as Wendy; she does, though, contribute some furtive farcical sexual business behind the scenes (or when she thinks she is behind the scenes). The fifth cofounder of Mischief, Nancy Zamit, offers delightful clowning all the way through. She doubles as Mrs. Darling and the Darling’s housekeeper, Lisa, which results in scampering through doors making exits as one and entrances as the other, with—as the pace quickens—élan but also wardrobe malfunctions. She is then drafted to play the fairy Tinker Bell; Zamit continually falls into that sparklingly Disney-esque Tinker Bell pose, despite the fact that she—or at least Cornley actor “Annie Twilloil”—would likely never be mistaken for a Disney fairy.\n\nAll of this is staged in rapid-paced fashion by director Adam Meggido on a very much provincial set featuring a turntable that, when put to the test, indeed goes wrong. The scenery is designed, with gags and multiple breakaway pieces, by Simon Scullion. Roberto Surface’s costumes combine professional values with hand-made elements. Peter Pan (Greg Tannahill) is in a green, camouflage-like costume incorporating a breast piece that looks like it’s a remnant from a Christmas sweater granny hand-knit 15 years ago. And don’t think we don’t notice that Wendy’s younger brother, Michael (Matthew Cavendish), wears a pink romper with a genuine Peter Pan collar. Matthew Haskins designed the lights, which also—continually—go wrong with humorous effect. The designer of the flying sequences is unbilled, likely because he or she walked out when it became clear that what Mischief actually wanted was a series of near-miss aerial mishaps.\n\nProducer Kevin McCollum, who heads the team that brought this production to Broadway, gets in on the fun with a bit of product placement, a very funny six-shooter bit which salutes his musical hit (Six) running across the street. The corn, at times, is even higher than that over at the Nederlander.\n\nA special paragraph is deserved by guest star Neil Patrick Harris. Starting out as a dignified Masterpiece Theatre-type narrator, his performance disintegrates into a protean slapstick turn with magic and audience interaction mixed in. Any suggestion of “yes, they can easily bring in any name actor to play this” disappears as Harris loses his pants; devolves into a scowling pirate, without dagger or bottle of rum; and winds up sprawled across the deck—of the pirate ship, the Cornley stage, and the Barrymore itself. Harris is scheduled to depart at month’s end. But really, mightn’t he stay? Film and television or sitting by the fireside with your loving family who are already inured to your jokes simply cannot be this much fun, black and blue bruises aside.\n\nIs Peter Pan Goes Wrong quite as blisteringly sidesplitting as The Play That Goes Wrong? Well, no; it’s difficult or perhaps impossible to offer the surprises of that initial foray into the Mischief formula. But the frantic, manic, desperate humor is the same; you might start the affair sitting in your seat thinking “go ahead, just try to entertain me” as you watch pseudo-stagehands scurrying to apply last-minute fixes to the ramshackle scenery. But as with the earlier show, they quickly win you over. And do, for gosh sake, bring the kids.\n\nIn a word: Arghh!!!\n\nPeter Pan Goes Wrong opened April 19, 2023, at the Ethel Barrymore Theatre and runs through July 9. Tickets and information: pangoeswrongbway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "showScoreExcerpt": "\"Film and television or sitting by the fireside with your loving family who are already inured to your jokes simply cannot be this much fun, black and blue bruises aside.\"\n\nRead more",
  "bwwExcerpt": "Is Peter Pan Goes Wrong quite as blisteringly sidesplitting as The Play That Goes Wrong? Well, no; it’s difficult or perhaps impossible to offer the surprises of that initial foray into the Mischief formula. But the frantic, manic, desperate humor is the same; you might start the affair sitting in your seat thinking “go ahead, just try to entertain me” as you watch pseudo-stagehands scurrying to apply last-minute fixes to the ramshackle scenery. But as with the earlier show, they quickly win you over. And do, for gosh sake, bring the kids.",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PETER-PAN-GOES-WRONG-Opens-On-Broadway-20230421"
}
