{
  "showId": "peter-pan-goes-wrong-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2023/04/19/peter-pan-goes-wrong-so-wrong-its-high-flying-right/",
  "publishDate": "2023-04-19T21:53:07",
  "fullText": "Full Disclosure: I’m a sucker for the Goes Wrong series: The Play That Goes Wrong, The Play About a Bank Robbery, to name the two I’ve seen– and more than once. The creators are Henry Lewis, Jonathan Sayer, and Henry Shields, three inveterate fun lovers who’ve turned themselves into Lords of Mishap, Masters of Wreckage, Honchos of Haywire.\n\nIt’s hardly a surprise but a welcome turn of cock-up events that they’ve now turned their glinting eyes, their lip-smacking tongues to J. M. Barrie’s children’s (and adults’) classic, Peter Pan. The rapture this time is that eager spectators on the way in are already well versed in the property. They – we – are already thinking about what could go wrong and hoping everything they’re – we’re – thinking about going wrong does go wrong.\n\nForemost might be the flying, without which no Peter Pan would be a respectable Peter Pan. Then there’s the Darling family’s house pet, big and lumbering Nana. Will Nana be a puppet with entangled strings or a person in a dog suit? What about Captain Hook and his formidable hook? What’ll go wrong for that love-to-hiss villain and sidekick Smee? What’ll be with the already hand-ingesting crocodile? And on and on.\n\nIt’s a pleasure to report that those of us – our number is growing mightily, especially among kids – arriving primed to find out the answers to these important questions and carloads more won’t be disappointed. Lewis, Sayer, and Shields show up (doubling and tripling,  like everyone else in the hilarious cast) offering hilarious answers. They’ve imagined abundantly gratifying fiascos, such as a narrator repeatedly running into trouble when the winch on which he’s perched fails to retreat to the wings smoothly, such as a character unable to remember lines that must be fed him through headphones, such as doors failing to open, such as a pirate ship unable to remain level.\n\nNo more of their misfits and mis-feats will be described here. Nothing more will be even spoiler alerted. They’re all too precious to be given away before they dutifully  fail. The only thing to say is that Lewis, Sayer, and Shields must have been cracking each other up when devising Peter Pan Goes Wrong. They must have been unable to go on for minutes when something howlingly funny struck them,\n\nAll right and truth to tell, not every single one of the supposedly howlers works, only approximately 98 percent. So, anyone angrily storming the box office for his or her money back will only be someone totally unaware that silliness – the silliness here is sublime – is a necessary life ingredient, particularly during our current parlous, parodic times.\n\nThe three writers, who met when studying at LAMDA (and  the rest is comedy-writing history), are so adept at handling the audience that they are able to have themselves roundly booed while turning those heartfelt boos into heartfelt cheers.\n\nThough Lewis, Sayer, and Shields are, as always, part of the cast, they see to it that they blend in. There is no first among equals, the rest of whom are Chris Leask, Matthew Cavendish, Neil Patrick Harris (guesting for Harry Kershaw through April 30), Charlie Russell, Nancy Zamit, Brenann Stacker (in for Bianca Horn at the performance I saw), Greg Tannahill, and Ellie Morris. To all of them, kudos and (let’s hope) no crutches, unless the role calls  for crutches, which one role does.\n\nIt looks as if Lewis, Sayer, and Shields are now so bankable that their budget has fattened.  The result: the beauty of a three-sided Simon Scullion set sometimes twirling so fast it’s dizzying, Roberto Surace’s costumes (sometimes even plucked off unceremoniously), There’s also Matthew Haskins’ lighting design, and Ella Wahlstrom’s sound design, Richard Baker and Rob Falconer’s original music, and Tommy Kurzman’s wig and make-up design. Richard Hoist does the flying rig operating.\n\nAdam Meggido directs, having also directed Magic Goes Wrong. He knew what he was getting into when he took on this sweating-brow assignment, and he’s made it look as if engineering all the controlled chaos is no more challenging than staging a drawing-room comedy. Does he have band-aids and bandages at the ready? It doesn’t look as if he needs them. It looks as if he’s calm as the proverbial cucumber. (Why cucumbers are calm is a play for Lewis, Sayer, and Shields to tackle at another time.)\n\nIndeed, it looks as if Meggido has easily pulled off a Broadway marquee example of top-drawer theater madness.\n\nPeter Pan Goes Wrong opened April 19, 2023, at the Ethel Barrymore Theatre and runs through July 9. Tickets and information: pangoeswrongbway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
