{
  "showId": "peter-pan-goes-wrong-2023",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/peter-pan-goes-wrong-in-the-best-ways-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/peter-pan-goes-wrong-in-the-best-ways-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Does the shtick get old? It does and it doesn't. Director Adam Meggido moves things along at a breathless clip that almost immediately obscures any misses with other hits, and the book (by Shields, Henry Lewis, and Jonathan Sayer) nicely develops a couple of B-plots, involving cast romances and ambitions, to keep us hooked. Nancy Zamit and Henry Lewis shine as featured players in a variety of roles, making the most of the play's treasured pantomime influences. And Simon Scullion's turntable set is theme park chic at its finest, spinning wildly as the ramshackle in-show production goes hilariously awry. Is it a kids' show? I can't say it's tailored for adults, but my date and I were delighted by the sheer bravado of its joke-a-minute style, inventive design, and committed performances. And the kids around us were howling with laughter, never feeling condescended to, and even being let in on some curiously naughty jokes. Who knew going wrong would feel so right?",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PETER-PAN-GOES-WRONG-Opens-On-Broadway-20230421",
  "fullText": "The cast of Peter Pan Goes Wrong | Photo: Jeremy Daniel\n\nThe title says it all and, if you’re game, then you’ll be (Captain) hooked by the Broadway transfer of Mischief Theatre’s London hit, now in performance at the Barrymore Theatre and starring Neil Patrick Harris (in the surprisingly involved role of Narrator) for just a few performances. If the overall idea is to present slapstick comedy as broadly as possible, the play’s critique of overacting thespians fighting, but not earning, the spotlight is brilliantly, (unfortunately) perceptive in an American theatre landscape riddled with overeager MFAs. (Charlie Russell as the ballerina-wannabe who plays Wendy Darling captures this best).\n\nWith cast members cosplaying as stagehands running amok before the show, the stage is amusingly set for a low-budget theatre company’s production of J.M. Barrie’s Peter Pan, which we’re told will be a marked improvement from its last production, “Jack and the Bean.” Despite its pompous director’s (Henry Shields) best efforts, it all falls apart, again and again and again.\n\nDoes the shtick get old? It does and it doesn’t. Director Adam Meggido moves things along at a breathless clip that almost immediately obscures any misses with other hits, and the book (by Shields, Henry Lewis, and Jonathan Sayer) nicely develops a couple of B-plots, involving cast romances and ambitions, to keep us hooked. Nancy Zamit and Henry Lewis shine as featured players in a variety of roles, making the most of the play’s treasured pantomime influences. And Simon Scullion’s turntable set is theme park chic at its finest, spinning wildly as the ramshackle in-show production goes hilariously awry.\n\nIs it a kids’ show? I can’t say it's tailored for adults, but my date and I were delighted by the sheer bravado of its joke-a-minute style, inventive design, and committed performances. And the kids around us were howling with laughter, never feeling condescended to, and even being let in on some curiously naughty jokes. Who knew going wrong would feel so right?\n\n‍Peter Pan Goes Wrong is in performance through July 9, 2023 at the Barrymore Theatre on West 47th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 464,
  "archivePath": "data/archives/reviews/peter-pan-goes-wrong-2023/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:37:44.247Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251010000358",
  "archiveOrgUrl": "http://web.archive.org/web/20251010000358/https://www.theatrely.com/post/peter-pan-goes-wrong-in-the-best-ways-review",
  "contentTier": "complete",
  "wordCount": 464,
  "tierReason": "Full review text"
}