{
  "showId": "bengal-tiger-at-the-baghdad-zoo-2011",
  "outletId": "nytheatre",
  "outlet": "nytheatre.com",
  "criticName": "Martin Denton",
  "url": "http://www.nytheatre.com/showpage.aspx?s=beng11722",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Rajiv Joseph's Bengal Tiger at the Baghdad Zoo, which is having its New York premiere at the Richard Rodgers Theatre, is certainly the most distinguished work to arrive on Broadway this season. This is true because of the across-the-board excellence of the artists who have contributed to this production, from the playwright to the director (Moises Kaufman), from the top-notch team of designers to the brilliant ensemble of actors on stage. Here is a play that's been crafted to entertain, to engage, to challenge, and to jolt its audience—and that succeeds in all of these endeavors, shatteringly. Joseph makes us confront the world we've made for ourselves in the past decade. By turns darkly comic, grotesque, horrifying, absurd, and deeply disturbing, Bengal Tiger demands to be seen by people who care about humanity and art and their troubling devolutions in the 21st century.",
  "bwwScore": 9,
  "contentTier": "excerpt",
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 388,
  "archivePath": "data/archives/reviews/bengal-tiger-at-the-baghdad-zoo-2011/nytheatre--martin-denton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T01:55:50.434Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Explore key tips for theater photography, highlighting the importance of rehearsal shoots, understanding dramatic lighting, and capturing emotion and narrative. Learn how to build relationships with theater companies and grow your artistic skills. Theater photography typically happens during dedicated tech rehearsals or dress rehearsals rather than live performances with audiences present. This allows photographers to shoot without the constraints of absolute silence, though remaining unobtrusive remains essential as actors and crew are working through final preparations. Coordinate closely with directors and stage managers to understand critical moments worth capturing, identify optimal shooting positions that won't interfere with sightlines or technical operations, and confirm whether flash photography is permitted during any portions of rehearsal. Theatrical lighting presents unique challenges and opportunities. Stage lighting is designed for dramatic effect rather than photographic exposure, creating extreme contrasts, saturated colors, and intentional shadows that push camera sensors to their limits. Embrace high ISO settings (3200 to 6400 or beyond), shoot in RAW format for maximum post-processing flexibility, and use spot metering to expose for actors' faces even when backgrounds go dark. The theatrical lighting itself becomes part of your composition—spotlights, colored gels, and shadow patterns contribute to the emotional atmosphere you're documenting. Capturing narrative and emotion distinguishes great theater photography from simple documentation. Study the script beforehand if possible to anticipate dramatic peaks, intimate moments, and visually striking scenes. Look for gesture, facial expression, and body language that convey character and story, frame shots that show relationships between actors and their spatial dynamics, and include elements of costume, set design, and staging that establish production style and period. A compelling theater photograph should give viewers who weren't present a sense of the production's tone, energy, and artistic vision. Building relationships with local theater companies opens doors for consistent work and artistic growth. Start by approaching community theaters and smaller production companies, offering to photograph shows in exchange for portfolio-building experience and promotional images they can use. Deliver a diverse gallery promptly after each production—action shots, character studies, ensemble moments, and detail images of technical elements—and you'll likely receive repeat invitations. As your reputation grows, pursue work with larger regional theaters, consider whether to specialize in particular genres like musicals or experimental work, and explore opportunities to have your theater photography exhibited as fine art that celebrates the collaborative magic of live performance.",
  "_showNotMentionedDiscoveryAttempted": true
}
