{
  "showId": "bengal-tiger-at-the-baghdad-zoo-2011",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://archive.nytimes.com/artsbeat.blogs.nytimes.com/2011/04/03/curtain-down-heads-up-readers-review-bengal-tiger-at-the-baghdad-zoo/",
  "publishDate": "March 32, 2011",
  "fullText": "A “smart, savagely funny and visionary new work of American theater, whose presence on Broadway invites fanciful comparison to the titular beast.” That’s how Charles Isherwood describes Rajiv Joseph’s\n play “Bengal Tiger at the Baghdad Zoo,” which opened at the Richard Rodgers Theater\n on Thursday in a production starring Robin Williams. Readers were a little less generous with the superlatives.\n Following are excerpts from several readers’ reviews posted on the theater section\n of NYTimes.com.\n\nSeveral readers strongly disagreed with Mr. Isherwood’s assessment of the show in his Critic’s Pick review, singling out Mr. Joseph’s script and Mr. Williams’s performance for criticism:\n\n“Way, way too much preaching to the audience, and very little if any dramatizing that carries any emotional impact. The sporadic moments of drama (with the exception of the tiger bite) play out without so\n much as a stir from the audience. The play also features characters that you can’t tell me for a second you actually care about, though admittedly you recognize them as characters you are Supposed to\n Care About.” — AvidTheatergoer, New York\n\n“Robin Williams mails it in and looks totally uninterested. What a disappointment. The only thing good about the show was that I was able to stretch out to the orchestra seat next to me when the couple next\n to me left at intermission.” — MR, Boston\n\n“Complete waste of money and time; the profanity was overdone. The young actors were talented, but I did not see the fit for Robin Williams in this role.” — Rainy, New York\n\n“Aside from the fact that Robin Williams sleepwalks through this show, the acting was compelling. However, since we went because of Mr. Williams, it was hugely disappointing. I believe that he is best when\n he can improvise and just let himself go. But tied to a tight script, he simply doesn’t cut it.” — Julie1119, Miami\n\nSeveral readers, however, gave the play high marks for bringing difficult and serious subject matter to Broadway:\n\n“It’s a play that dwells in mystery, in the unexplainable, and that careens between metaphysical crises and ‘on-the-ground’ realities. Audiences looking for a ‘well-crafted story’\n might be advised to look elsewhere, but those looking for a touching, honest experience should check out this young writer immediately.” — Jon, Brooklyn\n\n“I found this play to be an extremely creative piece attempting to address unanswerable questions. Yes, the play could be harsh, unsubtle. But so were the circumstances of cultural and political clashes,\n and the futility of grasping for metaphysical answers in a devastating reality. Beautifully directed, wonderfully acted and so thought-provoking that my friend and I are still discussing it the day after.”\n — KatWomanNYC, New York\n\n“Some parts might be a little squeamish for younger folks, as the play does not attempt to veil the atrocities of war. Other than that, my only complaint was the play felt too quick. Credit that to how well\n it moved along, but I would have loved to sit there for another hour.” — Chris Murphy, Mass.\n\nWhat do you think? Add your review here.",
  "isFullReview": true,
  "dtliExcerpt": "Robin Williams brings a manic energy to this surreal war drama, though the play itself struggles to find its footing between comedy and tragedy.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Robin Williams brings a manic energy to this surreal war drama, though the play itself struggles to find its footing between comedy and tragedy.",
  "contentTier": "invalid",
  "contentTierReason": "Short text (24 words)",
  "previousUrl": "https://www.nytimes.com/2011/03/32/theater/reviews/bengal-tiger-at-the-baghdad-zoo-review.html",
  "urlDiscoveredAt": "2026-02-03T12:36:15.680Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 509,
  "archivePath": "data/archives/reviews/bengal-tiger-at-the-baghdad-zoo-2011/nytimes--ben-brantley_2026-02-03.html",
  "textFetchedAt": "2026-02-03T12:36:15.683Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20221222185850",
  "archiveOrgUrl": "http://web.archive.org/web/20221222185850/https://archive.nytimes.com/artsbeat.blogs.nytimes.com/2011/04/03/curtain-down-heads-up-readers-review-bengal-tiger-at-the-baghdad-zoo/",
  "wordCount": 509,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T05:39:54.850Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is a compilation of reader comments/reviews, not Ben Brantley's actual review of the show; openai: This text is a compilation of reader reviews and opinions, not a single critic's review of the show.; kimi: This text is a compilation of reader/user reviews and comments posted on NYTimes.com, not a professional theater critic's review. While it references Charles Isherwood's assessment, the content consists of disparate excerpts from multiple amateur reviewers (AvidTheatergoer, MR, Rainy, etc.) offering conflicting opinions without a unified critical verdict from a professional critic.",
  "promptVersion": "5.2.0"
}
