{
  "showId": "bengal-tiger-at-the-baghdad-zoo-2011",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://theater.nytimes.com/2011/04/01/theater/reviews/bengal-tiger-with-robin-williams-review.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Rajiv Joseph's smart, savagely funny and visionary new work of American theater invites fanciful comparison to the titular beast. 'Bengal Tiger at the Baghdad Zoo,' for all the killing and suffering it contains, is buoyed by the vitality of its imaginative scope. Violence is not after all the only human activity that can have far-reaching, unforeseen effects, shaping lives far into the future. Mr. Joseph's richly conceived play reminds us that art can have a powerful afterlife too.",
  "bwwScore": 9,
  "contentTier": "complete",
  "fullText": "Bengal Tiger at the Baghdad Zoo, with Robin Williams, near right, and Glenn Davis, in the drama by Rajiv Joseph at the Richard Rodgers Theater.\n\nAn exotic beast is stalking Broadway. No, I'm not referring specifically to the man-eating title character played by Robin Williams in \"Bengal Tiger at the Baghdad Zoo.\" I'm talking about the play itself: Rajiv Joseph's smart, savagely funny and visionary new work of American theater, whose presence on Broadway invites fanciful comparison to the titular beast. A Pulitzer Prize finalist last year, \"Bengal Tiger\" is like a majestic cat serenely striding through a litter of cute-as-can-be kittens ready for their YouTube close-ups.\n\nFollow @NYTimestheater for theater news and reviews from Broadway and beyond.\n\nFrom left, Robin Williams, Glenn Davis and Brad Fleischer in \"Bengal Tiger at the Baghdad Zoo.\"\n\n\"Bengal Tiger,\" which opened Thursday night at the Richard Rodgers Theater, asks us to think and feel like adults, absorbing the dark absurdities in Mr. Joseph's microcosmic vision of the chaos that reigned in Baghdad shortly after the invasion of Iraq. Its quiet urge to attend to the moral problems that beset our world — not to mention the existential mysteries man has pondered for centuries — stands in stark contrast to the more prevalent invitations blaring from Broadway marquees: to be serenaded by sweet nostalgia or to Facebook-friend our inner teenager.\n\nThe production, directed with gorgeous finesse by Moisés Kaufman (\"I Am My Own Wife,\" \"33 Variations\"), does make a standard concession to the celebrity-centric economy of today's theater by headlining a box-office name. (The rest of the terrific cast comes from Mr. Kaufman's Los Angeles production, which I saw last spring.) But Mr. Williams, the kinetic comic who has sometimes revealed a marshmallowy streak in movies, never indulges the audience's hunger for displays of humorous invention or pinpricks of poignancy. He gives a performance of focused intelligence and integrity, embodying the animal who becomes the play's questioning conscience with a savage bite that never loosens its grip.\n\nAnd, oh yes, Mr. Williams is quite funny too. He is after all playing a tiger with a foul mouth and a disposition to match, who's been locked up in the Baghdad zoo for years and is growling as loudly as his stomach when the play opens. (Mr. Williams doesn't wear a Tigger costume, only a grizzled beard and unkempt hair suggest an animal.) I should emphasize that \"Bengal Tiger\" is not a civics lesson kind of play to be dutifully attended like a cultural homework assignment. Man and beast, and man turned beast, are depicted throughout with a fanciful humor that still allows for clear-eyed compassion.\n\nThe American invasion of 2003 has just taken place, and Baghdad is riven by conflict and confusion. Two soldiers guarding the tiger's cage — the cocky Kev (Brad Fleischer) and the business-minded Tom (Glenn Davis) — are killing time by swapping stories of their wartime experience. The tiger does some trash-talking himself, gloating over the stupidity of the lions, who fled their habitat only to be mowed down by artillery.\n\nThe juvenile Kev, played to dopey perfection by Mr. Fleischer, alternately gripes and makes absurd boasts about the prowess he is yet to prove. He seems to think that warfare is just a cool video game, and the other guys are hogging the Xbox. Tom, imbued with forceful gravity by Mr. Davis, was present when the American troops reached the palace of Uday and Qusay Hussein, Saddam's sons. His spoils from the looting that took place: a gold-plated toilet seat and a matching handgun that he's stashed in his knapsack.\n\nThis gleaming weapon, sowing mayhem as it moves from hand to hand, is a potent symbol of both corrupting greed and the brutality it can engender. A vulgar talisman of the rapacious Hussein regime, it also becomes a trophy sought after — possibly even killed for — by an American soldier intent on getting what he can out of the war. (Draw your own conclusions about the larger American imperatives in Iraq.)\n\nThe golden gun's first victim is the hapless tiger. As the awed and envious Kev marvels at this spectacular bit of bling, Tom makes the mistake of offering a snack to the beast in the cage, with results that leave him without a hand and the tiger with a gut full of lead. \"I get so stupid when I get hungry,\" the tiger groans in self-disgust.\n\nAnd yet death proves oddly congenial to this grumpy beast, who spends his time in the afterlife haunting the soldier who caused his death while pondering the mysteries his ongoing consciousness presents.\n\n\"It's alarming, this life after death,\" he confides. \"The fact is, tigers are atheists. All of us. Unabashed. Heaven and hell? Those are just metaphorical constructs that represent 'hungry' and 'not hungry.' Which is to say, why am I still kicking around?\" Suddenly this creature of dumb instinct begins acquiring a moral sense and with it the burning desire to know how the afterlife can exist without God, and how God can ignore the unruly garden of corruption that his world has become.\n\nAt Davos, some still want governments to just get out of the way. Others see the real need for governments to set the right rules.\n\nAn Alabama case shows why federal enforcement of the Voting Rights Act of 1965 is still needed today.\n\nIn countries around the world, TV serials are being used to deliver important social messages to millions of viewers.",
  "isFullReview": true,
  "textWordCount": 915,
  "archivePath": "data/archives/reviews/bengal-tiger-at-the-baghdad-zoo-2011/nytimes--charles-isherwood_2026-02-05.html",
  "textFetchedAt": "2026-02-05T01:55:55.892Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20120630080205",
  "archiveOrgUrl": "http://web.archive.org/web/20120630080205/http://theater.nytimes.com/2011/04/01/theater/reviews/bengal-tiger-with-robin-williams-review.html",
  "wordCount": 915,
  "tierReason": "Full review text",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Broadway-Review-Roundup-BENGAL-TIGER-AT-THE-BAGHDAD-ZOO-20110331"
}
