{
  "showId": "merrily-we-roll-along-2023",
  "outletId": "broadwaynews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.broadwaynews.com/the-broadway-review-a-revival-that-makes-sense-and-sizzle-out-of-merrily-we-roll-along/",
  "publishDate": null,
  "fullText": "The first Broadway revival of Stephen Sondheim and George Furth’s notorious bomb explodes with heart and sophistication. Good evening, and welcome to Broadway News’ Broadway Review by Naveen Kumar (standing in for Brittani Samuel), which includes our overview of reactions, recommendations and information tied to the Broadway opening of “Merrily We Roll Along.” Growing older is about letting go of possibility: Every open door you choose means another slams shut. “Merrily We Roll Along,” which could easily be called “Midlife Crisis: The Musical,” has long been labeled a problem child. It’s no small wonder that this sensational revival manages to synthesize the famous flop’s unwieldy ambitions into a palpable hit. The show’s combination of rueful existentialism with wide-eyed wonder is signature Sondheim, who wrote the music and lyrics, though George Furth’s high-concept book is often considered uncrackable. Director Maria Friedman and a dynamite cast — led by Jonathan Groff, Lindsay Mendez and Daniel Radcliffe — make ingenious use of tart humor and eager heart to fuel this backward coming-of-age about three once-inseparable friends. Friedman smartly frames the action as a reverie: Groff’s Frank Shephard is tracing his shattered ideals (and disastrous personal life) back through how it all went wrong. (Surely, others can relate.) Structural problems remain, including a second act that loses momentum as characters retreat into naïveté. But the production’s clever sophistication and knock-out performances send the onetime dud soaring to rapturous heights. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 247,
  "archivePath": "data/archives/reviews/merrily-we-roll-along-2023/broadwaynews-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:28:32.747Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 247 (min: 300)"
  ]
}