{
  "showId": "merrily-we-roll-along-2023",
  "outletId": "newyorktheatreguide-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.newyorktheatreguide.com/reviews/merrily-we-roll-along-broadway-review-jonathan-groff-daniel-radcliffe-lindsay-mendez",
  "publishDate": null,
  "fullText": "Read our four-star review of Jonathan Groff, Daniel Radcliffe, and Lindsay Mendez in Stephen Sondheim and George Furth's Merrily We Roll Along on Broadway. “That’s just something I do when I want to hold onto a moment,” composer Franklin Shepard shares in Merrily We Roll Along. “I close my eyes tight and I swallow. Like I take a picture that I can treasure.” Be prepared to do the same during the bracing revival of Stephen Sondheim’s musical, back on Broadway for the first time. You’re going to want to preserve the riches flowing throughout this hurts-so-good musical about growing up and growing apart. The show's 1981 premiere was short-lived thanks to various staging issues. But George Furth's heart-stirring, if cliched, story about the delicate nature of friendship and Sondheim’s enduring hits – “Not a Day Goes By,” “Good Thing Going,” and “Old Friends” among them – earned the show a robust afterlife. Based on a 1934 play by George S. Kaufman and Moss Hart, the musical unfolds in reverse chronological order. Soutra Gilmour’s spare and handsome set shapeshifts effectively as scenes move back in time and across cities. The plot follows the fates of three close pals – Frank (Jonathan Groff), dramatist Charley Kringas (Daniel Radcliffe), and writer Mary Flynn (Lindsay Mendez) – whose tight-knit bond erodes as the days go by. It’s 1976 when we first lay eyes on Frank. He's a hotshot movie producer with a fancy home in Bel Air and a life he hates. “How did you get to be here?” sycophants and wannabes want to know. Director Maria Friedman’s staging emphasizes that Frank is reflecting on how he got to where he is, which calls up the rest of the show's worth of memories. In a way, the concept turns an opening lyric from the title song — “Yesterday is done” — on its head. The past is always present. As he holds a script of an unproduced stage show he abandoned for Hollywood, Frank fades in on how his betrayals, cheating, and greed conspired to ruin relationships with Mary, now a self-loathing drunk, and Charley, who’s been excised from his life. Frank’s wives, first Beth (Katie Rose Clarke), and then Gussie (Krystal Joy Brown), a calculating actress, are other casualties. The plot finally rolls back to 1957 in New York, where the wide-eyed trio becomes fast friends as Sputnik orbits and signals that anything’s possible – especially when your besties have your back. The big-hearted “Our Time” spills over with emotion. Friedman’s production premiered in London in 2012 and wrapped a New York Theatre Workshop run in January with the Broadway cast. Her vision is clear, accessible, and very fine. It’s nitpicking to note that the first act pacing is snail-mail slow, but it is. Since the downtown run, though, the three leads are even better. Cast against the nice-guy type, Groff steps up with a dark streak as Frank, a wolf in Shepard’s clothing. Mendez makes Mary’s quips drip acid and the reality-check number, “Like It Was,” a musical highlight. Radcliffe really pops now, and Charley’s comedic cri de coeur “Franklin Shepard, Inc.” is a showstopper. Actually, it’s a moment to close your eyes tight and swallow. Merrily We Roll Along is at the Hudson Theatre through March 24. Get Merrily We Roll Along tickets on New York Theatre Guide. Photo credit: Daniel Radcliffe, Jonathan Groff, and Lindsay Mendez in Merrily We Roll Along. (Photo by Matthew Murphy) Daniel Radcliffe, Jonathan Groff, and Lindsay Mendez star in the first Broadway revival of this Sondheim musical. The story of of three artists whose friendship falls apart starts at the end and ends at the beginning. Knowing their future, can something in the past change their fate? Relive your teenage years at Merrily We Roll Along and learn more about tickets today. Merrily We Roll Along on Broadway is playing at Hudson Theatre. The theatre is located at 141 West 44th Street, New York, 10036. The running time of Merrily We Roll Along on Broadway is 2hr 30min. Incl. 15min intermission. The recommended age for Merrily We Roll Along on Broadway is Ages 10+. Children under 4 are not permitted in the theater.. Book tickets for Merrily We Roll Along on Broadway on New York Theatre Guide. The script for Merrily We Roll Along is by George Furth, adapted from George S. Kaufman and Moss Hart's 1934 play of the same name. The music and lyrics are by Stephen Sondheim, who previously collaborated with Furth on Company. Merrily We Roll Along's score includes the famous Sondheim songs \"Good Thing Going,\" \"Not a Day Goes By,\" \"Like It Was,\" and \"Merrily We Roll Along.\" There are 26 musical numbers in the show. Merrily We Roll Along is recommended for children 10 and older due to some strong language and references to alcoholism and adultery. Please note that children 4 and younger are not permitted in Broadway theatres. Daniel Radcliffe has been on Broadway multiple times before in shows like How to Succeed in Business Without Really Trying in 2011. Learn more about all of Daniel Radcliffe's Broadway and international stage credits. Merrily We Roll Along is on Broadway through March 24, 2024 only at the Hudson Theatre. Merrily We Roll Along on Broadway stars Daniel Radcliffe as Charley Kringas, Jonathan Groff as Frank Shepard, and Lindsay Mendez as Mary Flynn. Learn more about Merrily We Roll Along and its cast. Maria Friedman directs Merrily We Roll Along. Her production, which she first staged in London in 2012 before bringing it on and off Broadway in 2023, received critical acclaim in both the U.K. and U.S. Merrily We Roll Along is among the best-reviewed shows on New York Theatre Guide. Our four-star review of the Off-Broadway production praises Groff, Radcliffe, and Mendez's performances and reads, \"The story’s consideration of the fragility of friendships stands out.\" Originally published on Oct 10, 202308:00",
  "isFullReview": true,
  "dtliExcerpt": "“You’re going to want to preserve the riches flowing throughout this hurts-so-good musical about growing up and growing apart.”\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 984,
  "archivePath": "data/archives/reviews/merrily-we-roll-along-2023/newyorktheatreguide-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:32:47.335Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright"
}