{
  "showId": "merrily-we-roll-along-2023",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Calum Marsh",
  "url": "https://www.nytimes.com/2025/12/04/movies/merrily-we-roll-along-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2025/12/04/movies/merrily-we-roll-along-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "“Merrily We Roll Along” is an OK movie of a good production of a great musical: on balance, another worthy addition to the Stephen Sondheim canon, which can always stand to be expanded.\n\nThe history of “Merrily” is perhaps better-known than the play itself. When it opened on Broadway in 1981, the show about a gifted composer who sells out and betrays his closest friends, based on a 1934 play by George S. Kaufman and Moss Hart and told backward, received almost universally negative reviews and closed after just 12 days, becoming relegated to black sheep status among Sondheim’s celebrated corpus. But its return to Broadway in 2023, in a production directed by the British theater artist Maria Friedman and starring Jonathan Groff, Daniel Radcliffe and Lindsay Mendez, brought it back to unanticipated glory, culminating in a Tony Award last year for best musical revival.\n\nFriedman, a longtime friend and collaborator of Sondheim, has regarded “Merrily” as a passion project, and she directs this filmed version of her own stage show, with the company RadicalMedia, who also made the live stage recording of “Hamilton” for Disney+. In immortalizing this musical, allowing it to be savored by new audiences, she’s done a precious and admirable thing: seeing Radcliffe tear through “Franklin Shepard, Inc.,” or the core trio clown and dazzle with “Bobby and Jackie and Jack,” remains a gift.\n\nBut as a film director, Friedman adds little and, occasionally, inadvertently subtracts: This “Merrily” is too reliant on close-ups and frenetic cutting, which simply distract from the moving, beating heart of this wonderful play.\n\nMerrily We Roll AlongRated PG-13 for strong language, some innuendo and mild drug references. Running time: 2 hours 30 minutes. In theaters.",
  "isFullReview": true,
  "textWordCount": 284,
  "archivePath": "data/archives/reviews/merrily-we-roll-along-2023/nytimes--calum-marsh_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:19:35.755Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Word count too low: 288 (min: 300)"
  ],
  "contentTier": "complete",
  "wordCount": 284,
  "tierReason": "Short but structurally complete review"
}