{
  "showId": "girl-from-the-north-country-2022",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Michael Billington",
  "url": "https://www.theguardian.com/stage/2017/jul/27/girl-from-the-north-country-review-bob-dylan-conor-mcpherson",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2017/jul/27/girl-from-the-north-country-review-bob-dylan-conor-mcpherson",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Poise and poignancy … Shirley Henderson and Arinzé Kene in Girl from the North Country. All photographs: Tristram Kenton for the GuardianView image in fullscreenPoise and poignancy … Shirley Henderson and Arinzé Kene in Girl from the North Country. All photographs: Tristram Kenton for the Guardian This article is more than 8 years oldReviewGirl from the North Country review – Dylan's songs are Depression-era dynamiteThis article is more than 8 years oldOld Vic, LondonA superb cast use Bob’s back catalogue to glorious effect in Conor McPherson’s astonishing cross-section of hope and stoic suffering in Depression-era Minnesota\n\nThis is the second time in a week I’ve seen an Irish writer create a remarkable fusion of text and music. Woyzeck in Winter at the Galway arts festival unites Büchner and Schubert. Now Conor McPherson has written and directed a play incorporating 20 diverse songs by Bob Dylan. Set in Dylan’s home town of Duluth, Minnesota, in 1934, the piece uses the songs to reinforce the mood of desperation and yearning that characterised America in the Depression era.\n\nIt was the Dylan team who approached McPherson with the idea and they knew what they were doing since his work, from The Weir onwards, has been marked by a sense of unfulfilled longing. Here, that is located in a run-down guesthouse where everyone is staring into a bleak future. Nick, the owner, has to deal with crushing debt, a wife with dementia, a layabout son, and he is trying to marry off an adopted, pregnant, black daughter to an elderly shoe salesman. His guests include a ruined family, a fugitive boxer, a blackmailing preacher-cum-Bible salesman and Nick’s lover, who is awaiting a legacy that fails to mature. Yet for all their failures they still manage, gloriously, to sing.\n\nView image in fullscreenSheila AtimThe use of a local doctor as narrator reminded me of Thornton Wilder’s Our Town. The interweaving of multiple stories suggests Arthur Miller’s mosaic of the Depression, The American Clock. But it is the constant dialogue between the drama and the songs that makes this show exceptional. The songs are drawn from every decade of Dylan’s extensive catalogue, and are presented as visible “numbers”, with the actors often singing into stand-microphones.\n\nAt the same time, they articulate the characters’ innermost feelings. The preacher and the boxer unite in Slow Train (1979), from Dylan’s born-again Christian period. Nick’s son and his departing girlfriend express their shared frustration in I Want You (1966), dating from the time when Dylan was revolutionising rock. On the eve of Thanksgiving, the whole cast rousingly unite in You Ain’t Goin’ Nowhere (1975), which perfectly catches the mood of hope endlessly deferred.\n\nBecause the songs are so good, it is easy to overlook the economy and skill with which McPherson evokes the mood of 1930s America: the racism that leads the black boxer to be alternately insulted and exploited, the poverty that has highways lined with people living in tents. As director, McPherson has created an astonishingly free-flowing production and the 19-strong cast, which includes three musicians, is so uniformly strong it is tough to pick out individuals.\n\nShirley Henderson as Nick’s wife gives a mesmerising portrait of a woman unshackled by social convention. But Ciarán Hinds as the stoically suffering Nick, Stanley Townsend as a bankrupt factory owner and Bronagh Gallagher – very handy on drums – as his pill-popping wife are equally striking. And there is fine work from Sheila Atim as Nick’s desolate daughter, Arinzé Kene as the fleeing pugilist, Ron Cook as the choric doctor and Jim Norton as the shoe merchant who, lamenting his widowed solitude, says: “You remember a warm light and a smile from long ago.” That’s a deeply poignant line, and it says much about the fruitful creative marriage of McPherson and Dylan that it might have been written by either of them.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 660,
  "archivePath": "data/archives/reviews/girl-from-the-north-country-2022/guardian--michael-billington_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:15:07.654Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 660,
  "tierReason": "Full review text",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2017 outside valid range 2019–2024 for show opening 2022"
}