{
  "showId": "girl-from-the-north-country-2022",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "Stephen Dalton",
  "url": "http://www.hollywoodreporter.com/review/girl-from-north-country-theater-1024700",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/girl-from-north-country-theater-1024700",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Bob Dylan‘s music is woven into a widescreen tapestry of antique Americana by Irish writer-director Conor McPherson in Girl From the North Country. The action takes place in a run-down rooming house in Dylan's birthplace of Duluth, Minnesota, though the Depression-era backdrop predates the rich musical legacy he would begin crafting 30 years later. It is 1934, and Rae Smith's elegantly austere stage set looks like a sepia-tinted photograph. The initial sense is not so much witnessing a straight musical based on Dylan's songs, more like time-traveling deep into his lyrical hinterland. But first impressions can be deceptive.\n\nOriginally suggested by Dylan and his management, who gave McPherson a free hand creatively and musically, Girl From the North Country is an ambitious attempt to fashion a sprawling folk opera from one of the greatest songbooks of the last century. It aspires to be rich in plot and character, like a great Robert Altman movie. Alas, it ends up cluttered and incoherent, like a bad Robert Altman movie. Dylan's music is its saving grace, and his legendary name will undoubtedly sell tickets, but this messy misfire will not be winning any Nobel prizes for literature.\n\n \n\n \n \n \n Related Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Business\n \n \n \n \n\n \n \n \n \n Substack Bets On Canada as Next Expansion Market (Exclusive) \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Movies\n \n \n \n \n\n \n \n \n \n Matthew Macfadyen Joins Rachel Weisz in Tomas Alfredson's 'Seance on a Wet Afternoon'\n\nHarry Potter and Game of Thrones veteran Ciaran Hinds anchors a large ensemble cast as the guest house's gruff owner Nick Laine, who is slowly buckling under the pressure of financial hardship and an imploding marriage. Pity poor Shirley Henderson, another Hogwarts alumnus, in the thankless role of Nick's wife Elizabeth, who spends most of the evening squeaking and barking and grinding herself against the other actors. This is because Elizabeth is suffering from a unique kind of stage dementia that obliges her to be babbling and disinhibited one minute, then supernaturally lucid and articulate the next, like some kind of post-menopausal Manic Pixie Dream Girl. A mad-eyed lady of the lowlands.\n\nNick and Elizabeth have a grown-up white son, aspiring writer Gene (Sam Reid), and an adopted black daughter Marianne (Sheila Atim), who is pregnant to a man whose identity she refuses to reveal. Also passing through the house are various drifters and grifters including Nick's clandestine lover (Debbie Kurup), a slippery Bible salesman (Michael Shaeffer), a former boxing champ recently sprung from an undeserved jail term (Arinze Kene), a haunted older couple (Stanley Townsend and Bronagh Gallagher) with a mentally challenged adult son (Jack Shalloo), and more. On chorus duty is the Stetson-wearing Doctor Walker (Ron Cook), who breaks the fourth wall to share Garrison Keillor-ish homespun ruminations on the characters and their fates. The tenor of these monologues is perilously corny, like a Coen Brothers screenplay stripped of its ironic humor.\n\nMcPherson signposts his literary influences so clumsily here — John Steinbeck, Thornton Wilder, Eugene O'Neill, Arthur Miller — that Girl From the North Country initially feels like a Tarantino-esque exercise in post-modern cultural recycling. But the largely naturalistic tone of the dramatic scenes soon suggests more conventional intentions. These starchy patriarchs and small-town sweethearts are not knowingly stylized archetypes, just stock characters. Their emotional and financial woes are not arch commentaries on dramatic cliche, merely hoary old cliches themselves. The performances also feel over-emphatic and shouty, with much stage-drunk wassailing and some shamefully poor attempts at the Midwestern accent, which appears to have strong Scottish and Irish undertones.\n\nFortunately, the songs provide the emotional charge that the dramatic scenes do not. McPherson uses music as suggestive shading rather than direct commentary on character or action, calling the result \"a conversation between the songs and the story.” He also ranges widely across Dylan's six-decade catalogue, showing admirable restraint by selecting only three tracks from his Sixties prime, including the heartbroken 1963 ballad that gives this play its title, apparently inspired by the singer's early girlfriend Suze Rotolo. Many more come from Dylan's less feted Seventies flirtation with gospel-infused Christian rock.\n\nSticking to period-correct instruments, musical supervisor Simon Hale and his onstage band deploy guitar, violin, mandolin, piano and double bass to summon up a smooth mix of saloon-bar jazz, blues, folk, gospel and country elements, with various castmembers sporadically helping out on drums. There are duets and lovely full-cast close-harmony numbers, plus stand-out solo performances including Kene's lusty take on \"Hurricane,\" which segues into \"All Along the Watchtower,\" and Atim's rousingly soulful rendition of \"Tight Connection to My Heart (Has Anybody Seen My Love).\" The most recent composition is \"Duquesne Whistler\" from 2012, a jaunty exercise in pastiche western swing delivered with rollicking conviction by Shalloo.\n\nIn dramatic terms, Girl From the North Country ends as frustratingly as it begins, its surplus of subplots left to fizzle out largely unresolved. Teasing hints of murder, rape, blackmail, suicide, racial friction and illicit desire are tossed into the pot, then either sidelined or dropped altogether. Who fathered Marianne's baby? Is Elizabeth faking her dementia? What made Gene an embittered drunk with racist tendencies? Did he ever reconcile with his high-school sweetheart? The answers to these puzzles are left blowing in the wind.\n\nMcPherson's best known play, The Weir, is a sustained exercise in humor, poetry and ghostly ambience set in a rural Irish pub. Girl From the North Country has similarities in tone and setting, but feels much more prosaic. The writer only shifts into high lyrical gear at the very end, when he shakes off stilted naturalism with a scalding tirade about love from Elizabeth and a sublime elegy from Doctor Walker, both delivered as the band play softly behind them. For these scant minutes, the simple marriage of words and music achieves a potent emotional force that rises to the challenge of Dylan's genius. A transcendent coda, but too little, too late.\n\nVenue: Old Vic, London\n Cast: Ciarán Hinds, Shirley Henderson, Sheila Atim, Ron Cook, Debbie Kurup, Arinze Kene, Michael Schaeffer, Sam Reid, Stanley Townsend, Bronagh Gallagher, Jack Shalloo\n Director, playwright: Conor McPherson\n Music and lyrics: Bob Dylan\n Set & costume designer: Rae Smith\n Lighting designer: Mark Henderson\n Sound designer: Simon Baker\n Musical director: Alan Berry\n Orchestrator, arranger, musical supervisor: Simon Hale\n Musicians: Pete Callard, Charlie Brown, Don Richardson\n Movement director: Lucy Hind\n Presented by The Old Vic",
  "isFullReview": true,
  "textWordCount": 1041,
  "archivePath": "data/archives/reviews/girl-from-the-north-country-2022/hollywood-reporter--stephen-dalton_2026-02-04.html",
  "textFetchedAt": "2026-02-04T15:59:20.440Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1041,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-05T01:54:38.703Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production at the Old Vic in London, not the current Broadway run.; kimi: This review is explicitly of the London production at the Old Vic (as indicated by the 'Venue: Old Vic, London' credit at the end), not the current Broadway production. The cast listed (including Shirley Henderson and Ciarán Hinds) reflects the original London ensemble rather than the Broadway transfer.",
  "promptVersion": "5.2.0"
}
