{
  "showId": "girl-from-the-north-country-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2022/05/29/girl-from-the-north-country-bob-dylan-musical-remains-superb/",
  "publishDate": "2022-05-29T18:26:50",
  "fullText": "Bob Dylan introduced his formidable  “Like a Rolling Stone” in the Highway 61 Revisited album. Before the nervy, propulsive outburst reaches an impassioned finish, it repeats a question in a few variations, “How does it feel to be on your own with no direction home, like a complete unknown, like a rolling stone?”\n\nIf any question lies at the black-hole core of Conor McPherson’s Girl From the North Country — which regularly plucks chunks from the Dylan songbook for miraculous effect — it’s a question about the unalterable pronouncement that everyone travels alone through life with no direction home. Samuel Beckett would recognize the sentiment and likely agree.\n\nSupporting his thesis, McPherson focuses on Thanksgiving 1934 in Duluth, Minnesota. where the current inhabitants of Nick Laine’s (Jay O. Sanders) boarding house are trying their existential best to make something of the present and the future — without any noticeable glimmer of success. This is the Depression, and are McPherson’s people depressed! (That the unique tuner feels uncomfortably timely, if far from uplifting, needs mentioning. Immeasurably uplifting is the high quality of the writing and production.)\n\nPerhaps the most prominent member of the playwright’s extraordinarily motley collection is Elizabeth Laine (Mare Winningham), Nick’s wife, who’s in the throes of madness. Caring for her constantly isn’t so much the frustrated Nick but son Gene (Colin Bates), a perpetual loser, and adopted daughter Marianne (Kimber Elayne Sprawl), a Black girl now of marriageable age but unwilling to respond to the advances of 70-year-old Mr. Perry (Tom Nelis).\n\nNick’s agitated resting-place is only a stop in the Depression’s middle years for everyone present — from an out-of-business businessman (Craig Bierko), with angry wife (Luba Mason) and mentally challenged son (Todd Almond), to a former hotshot boxer (Austin Scott), just escaped from prison. Nick’s only solace is Mrs. Neilson (Jeannette Bayardelle), who fills the dual role of boarder/extra-marital-affair partner.\n\nMcPherson, his own skillful director, has his accomplished actors constantly swarming set/costume designer Rae Smith’s often impressively cluttered stage in her properly shabby period costumes as they clutch invisible frayed tethers until all but maybe two of those tethers break irreparably.\n\nSometimes singly, often forming groups around a single mic stand, often breaking into dance routines (Lucy Hind, the movement director), they deliver parts of 22 Dylan songs (one co-written with Jacques Levy, one co-written with Robert Hunter). Marco Paguia conducts with admirable determination; Simon Baker sees to the exquisite sound.\n\nThe use of Dylan’s vaunted, wide-ranging catalog calls for discussion. Normally, in today’s proliferation of jukebox musicals — someone’s hit songs woven (awkwardly) into a story (biographical, more often than not) — a property like Girl From the North Country would be designated just that: yet another jukebox musical. (The Dylan catalog has already weathered one of those: Twyla Tharp’s 2006 dance musical, The Times They Are A-Changin’, with 35 previews, 28 performances.)\n\nIn this case McPherson offers something more than a great, big, flashing Broadway jukebox. The pungent, poignant Dylan shards are incorporated not necessarily as tied directly to the emotions the band of lost souls are feeling but more as an oblique comment on the characters’ states of mind.\n\nIt could be that McPherson’s using Dylan snippets of varying lengths in a dramatic setting goes some persuasive way towards explaining why the songwriter/performer was awarded the 2016 Nobel Prize. His lyrics, certainly as reprised here, are that trenchant, that ground-breaking, that toying-with-time, that literary.\n\nKeep in mind that Girl From the North Country opened pre-pandemic at the Public Theater. The Broadway opening was March 5, 2020, followed by an almost immediate Covid-19 shutdown. It reopened April 29, 2022, confirming this reviewer’s belief that the property is the best musical — jukebox or no — of the past three years.\n\nFor musical lovers wondering if it’s worth seeing — or reseeing — by the announced June 19 closing date: Don’t think twice, it’s so all right.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial"
}
