{
  "showId": "girl-from-the-north-country-2022",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2017/07/26/theater/girl-from-north-country-review-bob-dylan.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2017/07/26/theater/girl-from-north-country-review-bob-dylan.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews"
  ],
  "bwwExcerpt": "A nation is broken. Life savings have vanished overnight. Home as a place you thought you would live forever no longer exists. People don't so much connect as collide, even members of the same family. And it seems like winter is never going to end. That's the view from Duluth, Minn., 1934, as conjured in the profoundly beautiful 'Girl From the North Country,' a work by the Irish dramatist Conor McPherson built around vintage songs by Bob Dylan. You're probably thinking that such a harsh vision of an American yesterday looks uncomfortably close to tomorrow. Who would want to stare into such a dark mirror? Yet while this singular production, which opened on Thursday night at the Belasco Theater under McPherson's luminous direction, evokes the Great Depression with uncompromising bleakness, it is ultimately the opposite of depressing. That's because McPherson hears America singing in the dark. And those voices light up the night with the radiance of divine grace.",
  "bwwScore": 9,
  "showScoreExcerpt": "CRITIC’S PICK. \"Bob Dylan’s Amazing Grace: This ravishing and singular musical, written and directed by Conor McPherson, hears America singing — Dylan — during the Great Depression.\"\n\nRead more",
  "fullText": "https://www.nytimes.com/2017/07/26/theater/girl-from-north-country-review-bob-dylan.htmlShare full article8Advertisement\n\nLONDON — The Irish playwright Conor McPherson has gone a-wanderin’ in a Minnesota of the mind, a bleak and soulful place conjured by the songs of Bob Dylan. As portrayed in “Girl From the North Country” — the truly sui generis new work written and directed by Mr. McPherson, with a multitude of songs by Mr. Dylan — this cold corner of the United States is a place where it is all too easy to lose your way.\n\nThat’s certainly true for the angry and bewildered characters in this strange theatrical hybrid of soaring music and thudding dialogue, which opened on Wednesday night at the Old Vic Theater here. As for Mr. McPherson, one of the greatest dramatists working, he, too, seems to be traveling through the dark without a compass.\n\nSuch helplessness has always been the natural state of the people who inhabit Mr. McPherson’s plays, which include the unsettling masterworks “The Weir” and “Shining City.” These folks are a haunted breed, mortally lonely yet dimly aware of a connection to some indefinable otherworld. Song often becomes their conduit to that unmapped place, and I shall never forget the fleeting transcendence achieved in his “The Night Alive” by four whacked-out wastrels dancing to Marvin Gaye.\n\nThat same subliminal beauty, as rousing as it is heartbreaking, shimmers through “Girl From the North Country” whenever its performers raise their voices in songs (culled from every phase of Mr. Dylan’s long career), finding a holy rhythm that reality denies their characters.\n\nYet the gap here isn’t just between the drab lives and the opalescent music. It also yawns between the thrill of this production when it sings and its perversely melodramatic flatness when it’s behaving like a traditional play.\n\nGirl From the North CountryThrough Oct. 7 at the Old Vic Theater, London; oldvictheatre.com.",
  "isFullReview": true,
  "textWordCount": 304,
  "archivePath": "data/archives/reviews/girl-from-the-north-country-2022/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T05:42:15.277Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 304,
  "tierReason": "Full review text"
}