{
  "showId": "girl-from-the-north-country-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Matt Trueman",
  "url": "http://variety.com/2017/legit/reviews/bob-dylan-musical-review-girl-from-the-north-country-1202508546/",
  "playbillVerdictUrl": "http://variety.com/2017/legit/reviews/bob-dylan-musical-review-girl-from-the-north-country-1202508546/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "\"Bob Dylan: the Musical,\" or something more sophisticated? Picking his way through the legendary songwriter's back catalogue, Irish playwright Conor McPherson has come up with a portrait of Depression-era America in \"Girl From the North Country.\" Dylan's music sets the mood and, if it sometimes feels like a setting in search of a story, the production at London’s Old Vic taps into that time. It walks a fine line between a beloved literary tradition and something more resonant – a reflection of our own recession. The blend slips down easy: enjoyable and soulful.\n\nSet in a guest house in Duluth, Minnesota – Dylan's boyhood home – \"Girl From the North Country\" gives us glimpses of the lives of those passing through, the flotsam and jetsam of Dust Bowl America. It's really a series of short stories rubbing shoulders, sharing a table in a temporary home. There are runaways and romantics; sinners and snake oil salesmen; drinkers down on their luck and out on their own. Were McPherson a lesser writer, this would quickly feel ersatz: John Steinbeck Country or Carson McCullers' backyard. Instead, it's a loving homage with a neat turn of phrase and a tang in the air. Dylan's songs becomes the soundtrack of the Great Depression, heartfelt and hopeful but mostly kicking their heels.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Industry' Season 4 Premiere Viewership Jumps 20% From Season 3 \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'It's Florida, Man' Renewed for Season 3 at HBO\n\nThe proprietor is Nick Laine, a good man getting by. He charges what he can, and gives credit where he can't. Played by Ciarán Hinds, his face reflects the times: his lips have seized up into a permanent downturn. His wife Elizabeth (Shirley Henderson) has succumbed to early dementia. His son Gene's hit the bottle, unable to find work, let alone write for a living, and he can't find a decent, young husband for his pregnant, black, adopted daughter Marianne (Sheila Atim).\n\nAmong those under his roof are a slippery clergyman, selling a stash of cheap bibles, and a black boxer, Joe Scott, just out of jail. Respectable businessman Mr. Burke (Stanley Townsend) is out of cash and on the road with his wife and disabled son in tow. Nick's mistress Mrs. Neilsen (Debbie Kurup) dangles dreams of buying him a bigger guest house. An old widower (Jim Norton) stops by every so often, trying to tempt Marianne into a marriage of mutual convenience.\n\nThe \"jukebox musical\" is coming of age in London. Preposterous as it is, \"Bat Out of Hell\" elevates Meat Loaf to the level of opera, while in \"Nina,\" Josette Bushell-Mingo has arranged Nina Simone's songs into a searing solo, part tribute gig, part protest.\n\n\"Girl from the North Country\" might be the most grown-up yet. Officially, it's a play with songs; in practice, songs with a play; a fusion of drama and gig. McPherson dots his guest house with vintage mics and musical instruments. His script doesn't crowbar in hits or bunnyhop between songs. No \"Blowin' in the Wind.\" No \"Knockin' On Heaven's Door.\" The songs serve the show, not vice versa. Some unfold in full, like musical monologues. Some are just snippets, segues from one scene to the next.\n\nDylan's never incidental, though. His music sets the mood, unhurried but restless, downbeat but uptight. There's a reason they call it the Great Depression, and Dylan's slow numbers reflect long, empty days. Everyone's too busy trying to scrap a living to actually live, let alone love. It's a world of widowers and heavy hearts. Sam Reid's Gene sings \"I Want You\" with the ex-girlfriend leaving town, a quiet sob of a song. \"You Ain't Goin' Nowhere\" speaks for almost everybody, and there's a heaviness in the air, the sense of storm clouds brewing; a \"Slow Train\" coming in. McPherson makes abundantly clear that in troubled times, families are dead weight – extra mouths to feed, more care to bestow. Love is a luxury, but loneliness can kill.\n\nTen years after our own financial crash, all of that rings true. A show that seems to romanticize the last major recession, conforming to the clichés of a literary tradition, starts to reflect our reality. Guests talk of tents lined up along the roadside and bright, young men queueing for work. Dust Bowl America bumps into Austerity Britain. You recognize the rhythms at play: the weight of debts, the fraying tempers, the hopelessness.\n\nYet there's hope in here too, and the simplicity of Dylan's music shines through. Simon Hale's arrangements clean the songs right up and instead of gravel, they take on a choral sheen, soaring upwards like spirituals. Tambourines and egg shakers drive the tempo on. A simple house band – violins, pianos and drums – sit behind voices. When people sing, it's as if they pop the bonnets of their brains and let us look inside. Henderson's bird-like Elisabeth rattles around \"Like a Rolling Stone,\" as dementia has freed her from everyday trouble. Jack Shalloo's Elias Burke bursts into an exuberant \"Duquesne Whistle\" when he finds release.\n\nThis is a fine ensemble, though, without a weak link in place. Characterful performances, from Michael Shaeffer's slimeball priest to Arinzé Kene's wronged man, fill the play with life. The flip side is that the play can feel diffuse, but as darkness encroaches and depression digs in, McPherson makes clear that the times haven't changed all that much.",
  "isFullReview": true,
  "textWordCount": 895,
  "archivePath": "data/archives/reviews/girl-from-the-north-country-2022/variety--matt-trueman_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:39:21.472Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 895,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2017 outside valid range 2019–2024 for show opening 2022"
}