{
  "showId": "potus-or-behind-every-great-dumbass-are-seven-women-trying-to-keep-him-alive-2022",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2022/04/27/theater/potus-review-broadway.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2022/04/27/theater/potus-review-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "https://www.nytimes.com/2022/04/27/theater/potus-review-broadway.htmlGive this article+Advertisement\n\nKeep your eye on the bust of Alice Paul.\n\nYou remember Paul, the suffragist who helped secure the vote for women in 1920 and then went on to write the still-unratified Equal Rights Amendment? If not, you could head downtown to the Public Theater to see “Suffs,” the musical about Paul and her colleagues.\n\nBut uptown, Paul is a projectile. Or rather, in “POTUS,” the snappy and intermittently hilarious farce that opened on Wednesday at the Shubert, a plaster sculpture of her face is. It’s Paul who brings down the first act curtain of Selina Fillinger’s rough-and-tumble feminist comedy — and with it, in a way, the patriarchy itself.\n\nI’d be giving away too much to say exactly how a sculpture undoes Fillinger’s nameless and unseen president, who may remind you of someone who in real life recently held the position and still thinks he does. The play, in any case, is happy to be rid of him. Its lumbering subtitle — “Behind Every Great Dumbass Are Seven Women Trying to Keep Him Alive” — makes clear that “POTUS” is less interested in the incompetent man than in his hypercompetent enablers.\n\n“POTUS” is in fact an encyclopedia of enabling, a natural field guide to the various poses that women who subcontract their souls get into. The classic cases are Harriet, the president’s beleaguered chief of staff, and Jean, his constantly blindsided press secretary. What Jean (Suzy Nakamura) tells Harriet (Julie White) applies to them both: “You stand in for him every single day, you’ve done it for years. You clean up his messes, you make excuses, you do his job, and then you wake up and do it all over again.”\n\nOn the day “POTUS” is set, that means trying to keep the president on track as he faces a series of public engagements, including a nuclear nonproliferation conference, a political endorsement, a photo op with disabled veterans and a gala honoring a women’s leadership council with the apt acronym FML. By 9 a.m. he is already disastrously off course, having referred to the first lady, at his first appearance, with a word that should have been unspeakable and is at any rate unprintable here.\n\nThough there appears to be no love lost between the two, Margaret, the first lady, is no Melania Trump, except for the catlike smugness that’s the top note of Vanessa Williams’s sleek performance. Margaret is spectacularly accomplished: a graduate of Stanford and Harvard, a lawyer, an author, a gallerist and a taekwondo practitioner. She must nevertheless put up with and cover for her husband’s tawdry affairs, including one with a “woke powderpuff” named Dusty (Julianne Hough), who shows up at the White House vomiting “blue raz” slushies.\n\nHow Dusty enables the president with her own spectacular accomplishments, which include both adventurous sex play and flax farming, I leave for Hough — who, like the play, is gleefully filthy — to reveal.\n\nIn any case, Dusty introduces a new note to the proceedings, which until her arrival seem, in Susan Stroman’s prestissimo production, at least loosely tied to reality. You can imagine how a woman like Stephanie, the president’s secretary, who speaks five languages and has a photographic memory, might still be disdained as a loser in this environment, because she’s fainthearted and has no polish. The first lady calls her “a menopausal toddler” — a description that Rachel Dratch, with her repertoire of cringes and moues, fully inhabits.\n\nAnd Lilli Cooper, winning even when whining, makes it easy to imagine how a woman like Chris, a Time magazine journalist and a newly divorced mother, might be worried about her job despite her experience and expertise. There are always, Jean warns her, younger male colleagues who “can out-tweet you, out-text you, chug a Red Bull and work three days straight.” Whereas Chris, on hand to interview the first lady, spends most of the play multitasking just to keep afloat — coordinating with her babysitter, her ex, her editors and her subjects while either pumping breast milk or leaking it.\n\nStill, you would readily include her as one of the women about whom the play asks, in frustration and shock, “Why aren’t you president?”\n\nDusty does not fit that bill, gifted though she may be. Nor does the seventh character, Bernadette (Lea DeLaria), the president’s exuberantly butch and frankly criminal sister. The only country you could imagine her as president of would be a despotic narcostate, the kind that DeLaria, having a ball in the role, suggests is not much different than ours.\n\nIf Dusty and Bernadette, as outside forces, are necessary for forwarding the farce, they gnaw at its underpinnings. The point of the satire, so perfectly sharp in the initial confrontations — with White and Nakamura making a terrific comedy team — begins to dull as the emphasis shifts from verbal to physical humor.\n\nThat physical humor is not always expertly rendered. (Dratch does it wonderfully, but the fight choreography is unconvincing.) And the turntable set (by Beowulf Boritt) that efficiently rotates the early action from room to room, like a White House Lazy Susan, seems by the second act to be spinning of its own accord, signifying hysteria but not giving us much chance to absorb it. (The sitcom bright lighting is by Sonoyo Nishikawa.) As the women move from cleaning up men’s messes to making messes of their own, you may feel some of the air, or perhaps the milk, leaking out of the comedy.\n\nIn a way, that’s a faithful expression of Fillinger’s belief, as she told Amanda Hess in The Times, that “if you take the man out of the room, patriarchy still exists and we still play by its rules.”\n\nBut in extending that idea to comedy, Fillinger, like a politician, is trying to have it both ways. In this, her Broadway debut, the ways aren’t always working together. As a farce, “POTUS” still plays by old and almost definitionally male rules; farce is built on tropes of domination and violence. On the other hand, and more happily, “POTUS” lets us experience the double-bind of exceptional women unmediated by the men who depend on their complicity. “He’s the pyromaniac, but you gave him kindling,” Chris, the journalist, tells the others.\n\nOr as Harriet, the chief of staff, puts it in a line that Alice Paul might have appreciated: “He can’t last if you stop saving him.” Maybe that’s true of male-dominated farces as well.\n\nPOTUS: Or, Behind Every Great Dumbass Are Seven Women Trying to Keep Him AliveThrough Aug. 14 at the Shubert Theater, Manhattan; potusbway.com. Running time: 1 hour 45 minutes.",
  "isFullReview": true,
  "textWordCount": 1105,
  "archivePath": "data/archives/reviews/potus-or-behind-every-great-dumbass-are-seven-women-trying-to-keep-him-alive-2022/nytimes--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:52:48.733Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20220427210719",
  "archiveOrgUrl": "http://web.archive.org/web/20220427210719/https://www.nytimes.com/2022/04/27/theater/potus-review-broadway.html",
  "contentTier": "complete",
  "wordCount": 1105,
  "tierReason": "Full review text"
}