{
  "showId": "potus-or-behind-every-great-dumbass-are-seven-women-trying-to-keep-him-alive-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2022/legit/reviews/potus-review-play-broadway-1235253436/",
  "playbillVerdictUrl": "https://variety.com/2022/legit/reviews/potus-review-play-broadway-1235253436/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "I am woman, hear me roar — with laughter, at “POTUS: or, Behind Every Great Dumbass Are Seven Women Trying to Keep Him Alive,” playwright Selina Fillinger's delicious feminist farce about the all-female staff that keeps the country out of war and other sticky situations while babysitting the dullard who holds the highest office in our beleaguered land. Playing characters largely unknown to the public within the world of the play are actors Lilli Cooper, Lea DeLaria, Rachel Dratch, Julianne Hough, Suzy Nakamura, Julie White and Vanessa Williams. Director Susan Stroman's ensemble is a bona-fide dream team.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Saccharine' Review: A Grisly Body-Image Body Horror for the Age of Weight Loss Meds \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n João Nicolau Talks Casting Portuguese Eurovision Star Salvador Sobral in Rotterdam Opener ‘Providence and the Guitar’\n\nFillinger writes for \"The Morning Show\" on Apple TV but is a newbie to Broadway, announcing her comic voice here with the smart dedication of her play to \"any woman who's ever found herself the secondary character in a male farce.\"\n\nThere are no secondary characters here, but a tight, fiercely funny ensemble of women who have devoted their lives and sacrificed their sanity to the political upkeep and personal maintenance of their figurehead boss, the President of these United States. Unseen (except for his lower legs in a funny compromising situation), this lucky dog has a woman for every necessity to maintain his office and affirm his questionable humanity.\n\nAs befits modern farce, the basic plot seems absurdly simple until you start unpacking it. In Act One, we learn about all the fraught political issues bedeviling the White House, the nation and the world. It's hard not to howl — and then feel guilty about it — when Jean, the press secretary played with prissy political finesse by Nakamura, wonders aloud which of the scheduled callers might be cut from the morning's lengthy guest list. (\"The two veterans who were blinded and maimed while saving their units in Iraq?\")\n\nIn Act Two, we watch all the problems outlined in Act One blow up in everyone's collective faces. The fun, of course, is observing the characters trying — and failing — to hold it together while losing their marbles.\n\nCall them stereotypes if you must, but every woman in the President's orbit makes a vivid impression. Maybe not as uniformly vivid as his sister, Bernadette — such a pretty name for such a tough broad, in Lea DeLaria's priceless, super-butch performance — but vivid enough to be memorable. Although everyone onstage makes liberal use of the c-word, DeLaria puts real oomph into it.\n\nNot to play favorites, but White rules this hen house as Harriet, the long-suffering chief of staff who is so good at her job that, in a terrific running gag, people keep asking Harriet why she isn't herself serving as president. Good question. (Me, I keep wondering why Julie White isn't president.) Watching Harriet searching for a euphemistic way to identify the physical affliction (an anal abscess) that is holding up POTUS's public appearances is heaven on steroids.\n\nSteroids, by the way, turn out to be about the only serious drug that the president's poor press secretary, Stephanie (Rachel Dratch, who is to-roll-over-and-die-laughing funny), doesn't accidentally ingest during the course of the farcical mayhem. Although Dratch is one of the theater's certifiable comic treasures (and one reason why \"Saturday Night Live\" restored the good name of late-night television), she is only now making her Broadway debut. Her comic timing is great and her line readings are giddy fun, but it's that face of hers — with that haplessly lost, who-am-I-and-what-am-I-doing-here? look of abject confusion — that makes her irresistibly funny.\n\nKudos all around to Fillinger, Stroman and her whip smart creative team, and to a super-duper cast who aren't afraid to use the c-word with all the pride and joy it deserves.",
  "isFullReview": true,
  "textWordCount": 644,
  "archivePath": "data/archives/reviews/potus-or-behind-every-great-dumbass-are-seven-women-trying-to-keep-him-alive-2022/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:53:05.891Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 644,
  "tierReason": "Full review text"
}