{
  "showId": "glengarry-glen-ross-2025",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Glengarry-Glen-Ross/1290",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Glengarry-Glen-Ross/1290",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $319\n Buy Tickets\n\nCititour.com Review\n The knives are out, literally, before the curtain rises on Patrick Marber’s revival of David Mamet’s Pulitzer Prize-winning “Glengarry Glen Ross” now at the Palace Theatre. The presence of a set of sharply drawn steak knives on the show curtain – a prize in the sales contest being foisted on a set of unhappy realtors – gave me hope that director Patrick Marber might find a refreshing new take on the play.\n\nAnd then I remembered that the famous speech about the sales contest, memorably delivered by Alec Baldwin in the movie version, doesn’t even exist in the play. So, then I wondered this “Glengarry” -- now being given its fourth Broadway production in 40 years (all of which I’ve seen) -- be a winner after all? Sadly, it doesn’t even show!\n\nWhat ensues is an often miscast, sitcom-like version of Mamet’s drama – one that can be hard to take, even under the best of circumstances, especially in 2025. Mamet’s profanity-spouting, racist, xenophobic, misogynistic, homophobic and perpetually angry men have always been meant to be a clear-eyed – and arguably sympathetic – portrait of toxic white masculinity. As a result, those of us on a certain side of the political spectrum may feel the need to take a shower the second we return from the theater!\n\nNonetheless (although the production is still set in the early 1980s) with today’s difficult economic climate, one can understand some of the motivations of these cutthroat and deeply unhappy real estate salesmen -- who are competing for not just a new Cadillac, but their entire livelihood – without liking them. \n\nStill. in order to feel badly for them, you need stronger performances than the ones being delivered by the show’s marquee names: “Breaking Bad” star Bob Odenkirk as the floundering, down-on-his luck salesman Shelley “The Machine” Levene and recent Oscar winner Kieran Culkin as hotshot-of-the-moment Ricky Roma (a role that won Tony Awards for two of his Broadway predecessors, Joe Mantegna and Liev Schreiber).\n\nWe actually meet six of the play’s seven characters in its 30-minute first act, consisting of three quick, two-person scenes set in an elegant Chinese restaurant (gorgeously designed by Scott Pask, who manages to fill the vast Palace stage), and which – somewhat disappointingly -- tells us all we need to know about the actors’ characterizations.\n\nIn the first scene, Levene pleads with his seemingly by-the-book office manager John Williamson (the fine African American actor Donald Webber, Jr., in what I think is purely color-blind casting) for the opportunity to shore up his fading fortunes. Odenkirk mostly switches too frequently between cockiness and desperation – something he does for the entire show – but never really exhibits the despair (real and existential) we need for “Glengarry” to land its final set of sucker punches.\n\nThe second scene – surprisingly the most effective one in this production – lets us peek in on a meeting between office bully Dave Moss (stand-up comedian Bill Burr, flawlessly utilizing his macho persona and expert timing) and sad-sack co-worker George Aaronow (an excellent Michael McKean), whom he wants to be his accomplice in an underhanded scheme.\n\nFinally, the third scene introduces us to what should be the play’s most colorful character, the fast-talking, soulless salesman Ricky Roma – who changes personalities more often than he changes his designer underwear – but Culkin simply isn’t totally right for the role. (The so-so costumes, also supplied by Pask, don’t help matters.)\n\nA too-appealing actor, Culkin ultimately lacks the urbane slickness the part requires, which undercuts his two pivotal scenes; when he initially lures unwitting prey James Lingk (an effective John Pirrucello) into listening to (and buying) his patented shpiel, and then unleashing his full-blown rage on everything and everyone in the real estate office (another pitch-perfect Pask creation) – including no-nonsense cop Baylen (Howard W. Overshown) -- when that deal suddenly disintegrates. \n\nGiven the high prices the production is asking for tickets, the inconsistency of the acting, and the unwise choice of using a less-than-intimate theater, I feel those who spend their money on this “Glengarry Glen Ross” are getting an even rawer deal than the show’s characters. And once you buy tickets, you don’t have three days to change your mind.\n By Brian Scott Lipton\n\nVisit the Sitehttps://www.glengarryonbroadway.com/Open/Close DatesOpening 3/31/2025Closing Open-ended\nTheatre Info\nPalace Theatre1564 Broadway (at 47th Street)New York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 785,
  "archivePath": "data/archives/reviews/glengarry-glen-ross-2025/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:45:04.125Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 785,
  "tierReason": "Full review text"
}