{
  "showId": "glengarry-glen-ross-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Roma Torre",
  "url": "https://nystagereview.com/2025/03/31/glengarry-glen-ross-the-stars-are-mostly-selling-it/",
  "publishDate": "2025-03-31T23:28:23",
  "fullText": "The buzz was palpable walking into the Palace Theatre last week. Tickets are going for upwards of $800. Watching the line at the theater bar stretched across the lobby, people were pumped for this one. Glengarry Glen Ross has achieved cult status. David Mamet’s Pulitzer Prize winner first opened in 1984 and it’s been revived three times since then. And let’s not forget the highly popular film version. It’s catnip for male actors, and audiences just seem to lap it up. When the cast for this latest revival was announced – led by fan favorites Kieran Culkin, Bob Odenkirk and Bill Burr – the run was extended even before the first preview performance. So, how good is it?  With some reservations, pretty f’ing good.\n\nExcuse the expletive but it’s the word of choice in this play. Mamet’s film version clocked in with 138 F-bombs. With its cast of chauvinistic characters competing against each other in a real estate sales office where the stakes are dog-eat-dog, Glengarry is a pitch perfect ode to toxic masculinity.\n\nThe play is tightly structured. The first act features three scenes, each of them set in a Chinese restaurant, the local hangout for the salesmen. We first meet Shelley Levene (Bob Odenkirk) desperately trying to persuade his implacable office manager, John Williamson (Donald Webber, Jr.) to give him better leads for a bogus Florida development called Glengarry Highlands. The pressure’s on for the four salesmen whose bosses have set up a do-or-die contest for the top closer. The first place finisher who makes the most sales gets a Cadillac. Second place gets a set of steak knives; and the two guys in third and fourth get fired. Levene, in a dry spell, is at the very bottom. Odenkirk is having a blast in this role. He’s got the Mamet-speak down pat with those halting, syncopated rhythms. And when he practically prostrates himself, offering to do just about anything for those precious leads, you believe him. He’s an absolute mess and it’s a hoot watching him shamelessly squirm.\n\nNext, we meet Bill Burr’s Dave Moss, the most obnoxiously abrasive of the four. To fans of the popular comedian, that should sound like perfect casting. Burr’s public persona is just that: angry ranting loud-mouth. To say he’s a natural in the part is an understatement and he nails it. One might even say he was born to do Mamet and he does not disappoint. He has little to no theatrical experience but he sure has stage chops; and even more, his comic timing is impeccable. He gets well deserved laughs just by opening his mouth. He shares the scene with Michael McKean (in a less showy but equally impressive turn) as fellow salesman George Aaronow, the sad sack of the bunch. The two commiserate over work pressures, but it doesn’t take long before Moss reveals a scheme that he’s concocted and he wants George to go in on it with him. What follows is a classic Mamet duet. They speak over and under each other, repeating lines but never quite saying what they really mean with half sentences and clipped dialogue in a sort of unspoken code. It’s not easy to pull off but when performed correctly it has the seductive power of music. And these two guys are “singing”.\n\nThe first act concludes with Kieran Culkin as ace salesman Richard Roma seated in the same Chinese restaurant delivering a rambling philosophical soliloquy to a man sitting in a nearby booth. Roma is the firm’s top closer, the smoothest and most ruthless, and the one the other guys need to beat. And here he is in action, reeling in a complete stranger with what’s supposed to be a slickly deceptive pitch. As written, the scene is designed to demonstrate Roma’s masterful sales skills but Culkin is disappointingly lackluster here. Instead of giving us a tutorial on the art of the sale, he seemed somewhat disengaged the night I attended…and just wasn’t “selling” it.\n\nAnother curious misfire: that first act ends with the expectation that Culkin is about to go in for the kill and close the deal but the lights stay on long enough for us to see Culkin and the other actor suddenly get up from their seats and exit the stage. It’s either a poor directorial decision or a missed lighting cue but it’s clearly an unforced error that undercuts the play.\n\nCulkin’s Roma comes alive in the second act when the action shifts to the sales office (known as the “boiler room”) after it’s been robbed. He becomes furious when he thinks the leads were stolen. He kicks the furniture and hails abuse on office manager Williamson. But it’s a tantrum befitting a rookie instead of an outburst from a top dog, which is what the role requires. Ricky Roma is typically played by actors with tough guy personas – Joe Mantegna, Liev Schreiber, Al Pacino and Bobby Cannavale. Roma is the guy who always wins; and the fun is watching how this take-no-prisoners character deals with a major loss. Culkin is a great actor. It’s apparent from his award winning roles in A Real Pain and HBO’s Succession but he’s simply miscast here, lacking the charisma and commanding presence to fit the bill.\n\nIt really would take a lot more than one case of miscasting to tank this play. That misstep aside, the production remains highly entertaining. In addition to Odenkirk, Burr and McKean’s standout performances, Donald Webber, Jr. as the stoic office manager Williamson, and John Pirruccello’s turn as Roma’s target – the indecisive schlub James Lingk – are both excellent.\n\nAt one hour 45 minutes, it’s well paced, the technical designs are appropriately realistic and it’s as funny now as it ever was.\n\nBottom line: Mamet’s 41-year- old black comedy still holds up. It was never celebrated for its plot which is pretty simplistic. It stands out to this day for its brutally honest depiction of capitalism at its worst. The humor drives home the point even further as we witness the insanely unethical and illegal lengths the salesmen are willing to go. In Glengarry world, you’re either a villain or a victim. Money, success, winning at all costs is what defines these men. Sound familiar?\n\nGlengarry Glen Ross opened March 31, 2025 at the Palace Theatre and runs through June 28. Tickets and information: glengarryonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
