{
  "showId": "glengarry-glen-ross-2025",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2025/03/31/theater/glengarry-glen-ross-review-culkin-odenkirk-burr.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2025/03/31/theater/glengarry-glen-ross-review-culkin-odenkirk-burr.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "Watch out for Richard Roma. Top man among the bottom feeders at a scammy Chicago real estate agency, he has a hypnotic come-on and a dizzying spiel. Identifying your vulnerabilities with forensic accuracy, he’ll lance them with a blunt needle. (“You think you’re queer?” he asks one mark. “I’m going to tell you something: We’re all queer.”) If it’s what you need, he’ll be the brother who thinks big on your behalf, who sees beyond your sad habit of safety to the rewards only risk can offer.\n\nNot that there are actually rewards. The lots he’s selling in Florida, in developments ludicrously called Glengarry Highlands and Glen Ross Farms, are worthless.\n\nBack at the office, too, he’s the alpha among losers. On the leaderboard of recent earnings, he stands closest by far to the $100,000 mark that will win him a Cadillac in the agency’s sales contest. (The two lowest earners will be fired.) His colleagues are merely additional marks to be bamboozled. They have schemes; he has juice.\n\nNo wonder he remains, 41 years after he first hit Broadway in David Mamet’s “Glengarry Glen Ross,” one of theater’s greatest characters: the unregulated id of sociopathic capitalism. He makes Willy Loman look like a softy. This salesman will never die.\n\nOr so I thought. But in the weirdly limp revival that opened on Monday at the Palace Theater, something has flipped. As played by Kieran Culkin, leading a sales team that also features Bob Odenkirk, Bill Burr and Michael McKean, Roma is no longer the master of everyone else’s neuroses; he’s neurotic himself. Especially in the scene that ends the first act, as he winds up for a pitch into the soul of a schlub, he is so deeply weird and interior that any semblance of a confident exterior evaporates. The man couldn’t sell a dollar for a dime.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 333,
  "archivePath": "data/archives/reviews/glengarry-glen-ross-2025/nytimes--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T15:17:54.098Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250507133803",
  "archiveOrgUrl": "http://web.archive.org/web/20250507133803/https://www.nytimes.com/2025/03/31/theater/glengarry-glen-ross-review-culkin-odenkirk-burr.html",
  "contentTier": "needs-rescrape",
  "wordCount": 333,
  "tierReason": "Full review text",
  "bwwExcerpt": "Or so I thought. But in the weirdly limp revival that opened on Monday at the Palace Theater, something has flipped. As played by Kieran Culkin, leading a sales team that also features Bob Odenkirk, Bill Burr and Michael McKean, Roma is no longer the master of everyone else’s neuroses; he’s neurotic himself. Especially in the scene that ends the first act, as he winds up for a pitch into the soul of a schlub, he is so deeply weird and interior that any semblance of a confident exterior evaporates. The man couldn’t sell a dollar for a dime.",
  "bwwScore": 6,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Starry-GLENGARRY-GLEN-ROSS-Revival-Opens-On-Broadway-20250331",
  "rejectedAt": "2026-02-05T15:02:04.965Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is truncated and ends with an error message about retrieving article content and enabling JavaScript, indicating technical issues rather than a complete review.; openai: The review content is incomplete and includes a technical error message about retrieving the article content.",
  "promptVersion": "5.2.0"
}
