{
  "showId": "life-of-pi-2023",
  "outletId": "broadwaynews",
  "outlet": "Broadway News",
  "criticName": "Brittani Samuel",
  "url": "https://broadwaynews.com/2023/03/30/review-life-of-pi-earns-its-stripes-as-a-complex-dramedy-balancing-the-real-and-surreal/",
  "playbillVerdictUrl": "https://broadwaynews.com/2023/03/30/review-life-of-pi-earns-its-stripes-as-a-complex-dramedy-balancing-the-real-and-surreal/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright"
  ],
  "showScoreExcerpt": "“Though ‘Life of Pi’ deals with the real and the fabled, it’s much better at portraying the latter...Pi knows that the best stories prioritize possibility over probability. So, I’d argue, do the best plays.”\n\nRead more",
  "fullText": "The life of pi is infinite. Literally, because the mathematical constant “pi” is a limitless irrational number. And figuratively, because Yann Martel’s bestselling book “Life of Pi” continues to capture the hearts of readers across the globe. In that book, adapted for stage by Lolita Chakrabarti, central character Pi is just as boundless as the algebraic figure he’s named after. Case in point, Pi is Hindu, but also goes to church and mosque on the weekends. During a moment of crisis he cries out “Vishnu preserve us, Allah protect us, Christ save us.” At only 17, Pi — born Piscine Molitor Patel — knows that God’s name matters less than his voice. And Pi wants that voice to answer his questions about human suffering before he has even experienced his extreme bout of it. Pi is not afraid to hold seemingly opposite logics and faiths in the same hand. Neither is Chakrabarti in a brilliantly-staged dramedy that constantly blurs the lines between fact and fiction.\n\n“Life of Pi” begins with our boyish hero (Hiran Abeysekera) in a Mexican hospital room circa 1978, hiding from Japanese Ministry of Transport investigator Mr. Okamoto (Daisuke Tsuji) and Canadian Embassy worker Lulu Chen (Kirstin Louie). The two want to know what led to the sinking of the ship Tsimtsum on its journey from India to Canada; a crash which killed everyone on board except for Pi, including his family. “I’ve had a terrible trip,” Abeysekera delivers with an arid sarcasm that seems unlikely for a teenage boy. But 227 days abandoned at sea (as we find out Pi has endured) laughs in the face of 17 years on land. Especially when, according to Pi, that time was spent on a lifeboat with an anxious orangutan, a crippled zebra, an insatiable hyena and a ferocious Bengal tiger named Richard Parker, all of which were cargo on the same now-sunken ship.\n\nThe Noah’s Ark of it all boggles the inflexible minds of Chen and Okamoto, who are set on recording facts about the wreck, not listening to Pi’s “unbelievable” recounts. As his memories play out before us, the back walls of the hospital unfold into the vibrant streets of Pondicherry, where we learn Pi and his family operated a zoo. Under expert direction by Max Webster, a team of creative juggernauts — Tim Hatley (scenic and costume design), Andrzej Goulding (video design and animation), Tim Lutkin (lighting design), Nick Barnes and Finn Caldwell (puppet design), Carolyn Downing (sound design) — liven the Gerald Schoenfeld Theatre.\n\nGasp-inducing flutters of butterflies conjure the atmosphere of the Indian village; lovable puppets pepper the set as zoo creatures; vibrant lights illuminate an Indian market packed with marigolds, intricate rugs and the best flavors of kulfi. Echoes of chirping birds flood the senses. The impact of their collaborative design heightens as Pondicherry morphs into the Tsimtsum which, after its sinking, transforms into the boundless Pacific.\n\nOut on that ocean is where we see the best work of Pi and his small cohort of beasts. Abeysekera is an acrobat, leaping across the raft with wild but nimble abandon. His acting matches that athleticism, moving through quick juts of panic and slower moments of retrospection with equal agility. His frequent monologuing tires the ear — in order to tighten “Life of Pi,” Chakrabarti reduced the novel’s multiple narrators to just one — but Abeysekera himself (ever pluckish, ever charming) remains a persistent delight to the eye.\n\nPuppeteers bring complete anthropomorphic life to their animals, especially tiger Richard Parker, who expresses anger and fear through an emotive chorus of grunts, growls and sneers (puppetry and movement direction by Caldwell). In fact, the puppetry is so astounding, supporting actors playing humans look poor by comparison. They rely on spiked voices and predictable hand gestures to rev up the same amount of action Parker’s controllers do with a threatening chest puff and ominous tail flick. To be fair, Charkrabarti gives the auxiliary actors scraps to work with. Each character has hints of personality — Pi’s confident sister Rani is a math wiz, the ship’s menacing French cook is a crude version of Obelix — but they are severely underdeveloped, outliers in a story that’s clearly about Pi.\n\nThough “Life of Pi” deals with the real and the fabled, it’s much better at portraying the latter. The breathtaking, cosmic aesthetic when Pi and Richard Parker are out at sea, is ruptured by the dull walls of the hospital. The dexterous beauty of the puppets counter the one-dimensional outlines of human characters. The play’s weak excuse for historical context — unexplained riots are the reason why Pi and family decide to relocate their zoo in the first place — has no grip. But as Pi states, “Be excessively reasonable and you risk throwing out the universe with the bath water.” Pi knows that the best stories prioritize possibility over probability. So, I’d argue, do the best plays.\n\n“Life of Pi” opened at the Gerald Schoenfeld Theatre on March 30, 2023.\n\nReview photo by Matthew Murphy and Evan Zimmerman for MurphyMade\n\nCreative: Adapted by Lolita Chakrabarti based on the novel by Yann Martel; Directed by Max Webster; Resident direction by Ashley Brooke Monroe; Original music by Andrew T. Mackay; Scenic design by Tim Hatley; Costume design by Hatley; Lighting design by Tim Lutkin; Sound design by Carolyn Downing; Puppet design by Nick Barnes and Finn Caldwell; Puppetry and movement direction by Caldwell; Video design and animation by Andrzej Goulding; Wig design by David Brian Brown; Dramaturgy by Jack Bradley; Casting by Stewart/Whitley.\n\nProduced by Simon Friend, Daryl Roth, Hal Luftig, Mark Gordon Pictures, Playing Field, Tulchin Bartner Productions, Gavin Kalin, Hunter Arnold, Hall Smalberg Winkler, 42nd.club, Elizabeth Armstrong, Eilene Davidson, deRoy Shea Waxman, Federman Jenen Productions, Susan Gallin, Independent Presenters Network, John Gore Organization, Kuhn Dodani, Harriet Newman Leve, Anastasia Muravyeva, Mary Lu Roffe, Catherine Schreiber, American Repertory Theatre and Sheffield Theatres.\n\nCast: Hiran Abeysekera, Adi Dixit, Brian Thomas Abraham, Rajesh Bose, Nikki Calonge, Mahnaz Damania, Fred Davis, Avery Glymph, Jon Hoche, Mahira Kakkar, Kirstin Louie, Rowan Ian Seamus Magee, Jonathan David Martin, Usman Ali Mughal, Uma Paranjpe, Salma Qarnain, Betsy Rosen, Celia Mei Rubin, David Shih, Sathya Sridharan, Daisuke Tsuji, Sonya Venugopal, Scarlet Wilderink, Andrew Wilson.",
  "isFullReview": true,
  "textWordCount": 1038,
  "archivePath": "data/archives/reviews/life-of-pi-2023/broadwaynews--brittani-samuel_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:08:43.255Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230404045154",
  "archiveOrgUrl": "http://web.archive.org/web/20230404045154/https://broadwaynews.com/2023/03/30/review-life-of-pi-earns-its-stripes-as-a-complex-dramedy-balancing-the-real-and-surreal/",
  "contentTier": "complete",
  "wordCount": 1038,
  "tierReason": "Full review text"
}