{
  "showId": "life-of-pi-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Roma Torre",
  "url": "https://nystagereview.com/2023/03/30/life-of-pi-play-delivers-stunning-stagecraft-to-die-for/",
  "publishDate": "2023-03-30T21:53:46",
  "fullText": "Life of Pi is a ravishing collaboration of art, craft, and a magnificent lead performance. It would be very easy for me to say the design team steals the spotlight in this exquisite production, but that is not the case.\n\nAdapted from the bestselling novel by Yann Martel, Life of Pi tells the story of Pi Patel, the son of a zookeeper from India whose idyllic childhood is tragically upended at sea when his family leaves home for a better life in Canada.\n\nPi, short for Piscine, is a precocious teenager with an intense curiosity about religion. Not content solely with the Hinduism of his upbringing, he seeks answers in Catholicism and Islam. He says he just wants to believe in God but is confused by the divergent stories of faith.\n\nIt is Pi’s spiritual strength that enables him to survive as he endures the devastation of losing his entire family when their cargo ship containing most of the zoo animals sinks in the Pacific Ocean.\n\nAs hard as it is to believe, Pi tells the miraculous story of his 227 days on a life boat with a Bengal tiger named Richard Parker.\n\nThe adaptation by Lolita Chakrabarti smartly begins at the end of the book just days after Pi’s harrowing journey ends on a remote beach in Mexico. From his hospital room, he is interviewed by a Japanese official from the cargo ship company and a representative from the Canadian embassy. Through flashback, Pi begins to narrate the events that led to his ordeal.\n\nThat’s also when director Max Webster begins to weave his stage magic as the set instantly converts to Pi’s home, a thriving marketplace, and the zoo where we first meet the animals so inventively realized by puppet co-designers Nick Barnes and Finn Caldwell, also credited as Puppetry/Movement Director. Their work is stunning as the puppets seem to come to life thanks to the incredible manipulations of a dozen or so puppeteers embodying, among others, the motions of a zebra, hyena, orangutan, and most especially Richard Parker.  With no effort to disguise them, the human handlers essentially disappear with every movement of those lifelike creations.\n\nIt’s a sleight of hand and body that amounts to bravura choreography, rivaling in its way the talented ensemble in Bob Fosse’s Dancin’ currently on stage just across the street.\n\nThe sleight of hand doesn’t stop there. Tim Hatley’s inspired scenic designs will have you scratching your head wondering ‘how did they do that?’ The life boat seems to materialize out of the blue, quite literally, with schools of luminescent fish passing by amid roiling waves you’d swear was actual water.  The imagery conjured up by lighting designer Tim Lutkin and video designer Andrzej Goulding is astonishing. And so realistic are those visuals, in a scene when Pi jumps into the “water” and disappears, we actually see ripples of waves in his wake. Wow!\n\nAnd now for more “wow”. Pi is played by Hiran Abeysekera, a young man with gobs of talent that seems to know no end. He’s already won the Olivier award for this performance which calls for him to be on stage the entire two hours as he emotes like a Shakespearean while nimbly leaping, balancing and bounding like a world class acrobat.  He has clearly mastered this complex role after his many months performing in London’s West End and it’s an absolute joy to see this gifted actor, so fully nuanced by now, tapping into such remarkable virtuosity.\n\nThe other performers round out the cast with a fine degree of professionalism though the roles are not nearly so well defined. Chakrabarti made some necessary changes to the script, largely justified, considering that so much of the book is interior thought. So when Pi reads a survival manual, an actor playing the naval captain who wrote it, enters, verbalizing the life-saving tips. And Pi’s father, impressively played by Rajesh Bose, shows up as if in memory helping Pi to understand how to tame his man-eating companion.\n\nIt’s also worth noting some prophetic words of wisdom from the father complaining that the problem with the world is that bad behavior has no consequences and we need more accountability.  Some very timely sentiments in our own hostile universe.\n\nFor those familiar with the story, either from the novel or the Ang Lee film, one of the most arresting moments centers on Pi’s arrival at a mysterious island inhabited exclusively by thousands of meerkats. Given the dazzling artistry of the technical crew, I was looking forward to seeing how they were going to depict those fantastical scenes. Instead, the play addressed that episode only through dialogue. It was all left to the imagination. I hate to think it was due to a budgeting shortfall.\n\nA note of caution to anyone bringing young children. This is not a G-rated puppet show – less Disney, more National Geographic. There is carnage – blood, guts and all!  And because the designers do such a good job mimicking reality, some of the scenes can be difficult to watch.\n\nThe production will likely bring to mind two other ingenious displays of theatrical puppetry – Lion King and War Horse. Like them, Life of Pi does a phenomenal job of creating a sense of realism with extraordinary stagecraft. And while Life of Pi may not have the emotional punch of the other two shows, it succeeds in different ways. In light of Pi’s relentless pursuit of spirituality, the play prompts us to ponder our own beliefs, the nature of truth, morality, faith, and perhaps most resonantly, the incomparable power of live theater.\n\nLife of Pi opened March 30, 2023, at the Gerald Schoenfeld Theatre. Tickets and information: lifeofpibway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
