{
  "showId": "life-of-pi-2023",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Unknown",
  "url": "https://www.vulture.com/2023/03/theater-review-life-of-pi-broadway.html",
  "playbillVerdictUrl": "https://www.vulture.com/2023/03/theater-review-life-of-pi-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nFrom Life of Pi, at the Schoenfeld.\n Photo: Matthew Murphy and Evan Zimmerman\n \n \n \n What do you want from me: There’s a tiger onstage! A big, hulking, royal Bengal tiger, slouching in a lifeboat with feline insouciance and thinking about eating a 17-year-old for lunch. You can see at least three puppeteers attached to the tiger at all times—one crouched inside its body, as if already consumed by the beast; another standing beside it, swaying the head like a pendulum; and a third at the rear, managing the hindquarters—and a total of eight people are credited with its motions. On the West End, the tiger crew shared a supporting actor Olivier award, though I’d argue that he’s pretty much the star of this thing. Named Richard Parker, he makes its grand entrance early on in Life of Pi to devour a goat in a zoo, another lifelike puppet subjected to one of many gruesome animal deaths onstage. At my performance, he got the kind of applause that usually greets a movie star deigning to do a play on Broadway. We’re here for the tiger, folks—and yes, this tiger is pretty cool. It’s a pity that he’s stranded in a story awash with platitudes.\n\nWe meet the tiger in the zoo, but everyone is already waiting for him to reappear on a lifeboat, Life of Pi’s most famous setting. The play, adapted by Lolita Chakrabarti, is of course based on Yann Martel’s 2001 novel which follows the fantastical—if familiar, owing to the success of both the book and Ang Lee’s 2012 film—premise of a teenage boy named Pi Patel (played onstage by Hiran Abeysekera) who’s shipwrecked with a tiger and a few other animals in the middle of the Pacific. Pi and his family intend to relocate their family zoo from Pondicherry to Canada and capsize somewhere outside Manila. Somehow, he makes it to Mexico. That’s not a spoiler, because because the story is framed, in its many versions, by an interview where Pi describes his unbelievable experience at sea, in this case to a naval inspector (Daisuke Tsuji) and a representative from the Canadian embassy (Kirsten Louie). He tells them his tale with a heavy emphasis on a woo-woo interpretation of faith, full of bromides about the power of storytelling. “My story will make you believe in God,” Pi announces to his interlocutors early on. I can’t say it did, but it did reinforce my faith in puppetry.\n\nThe sermonizing lands hardest near the beginning and end of Life of Pi, where director Max Webster lets things get a little slack and starry-eyed. The first act is essentially an extended prologue, explaining how Pi gets stuck on that lifeboat, and the action drags. You end up rooting for catastrophe to hit sooner. Much of the time before then is spent on a series of scenes set around the family’s zoo that heavy-handedly lay thematic groundwork. Take note when Pi’s father (Rajesh Bose) says “man is the most dangerous animal in the zoo,” early on, because you’re going to hear that line twice more before the show ends.\n\nPi himself is one of those good to be true super-special boy protagonists. He happens to be interested in three religions at once—Hinduism, Islam, and Christianity—and sees little conflict between them. Abeysekera wisely makes the choice to lean into his humor wherever possible (“I’ve had a terrible trip,” he deadpans in his hospital room in Mexico) to bring him a little closer to the earth, even if it still feels like the boy floats a few inches above the ground at all times. Sathya Sridharan, similarly brings wit to Pi’s worldly maternal uncle, who’s traveled in France and is responsible for naming him “Piscine” in the first place, but also has to deliver some of Life of Pi’s glancing descriptions of political unrest in late-’70s India. Like the animals at the zoo, he says, the political parties involved “don’t need to like each other, they just have to share.” Like many of the sentiments in Life of Pi, that’s boldly, vaguely true enough.\n\nPhoto: Matthew Murphy and Evan Zimmerman\n \n\n Best to take the play’s cue and focus less on the people and more on the charismatic megafauna. In addition to Richard Parker the tiger, the marquee animal stars include a woeful zebra, an evil hyena, and a soulful orangutan named Orange Juice who’s partly puppeteered by Mahira Kakkar, who also play’s Pi’s mother, a doubling that prompts your sympathy for the ape and provides an early tell that Pi’s story may be more metaphorical than real. The first act comes together when, finally, the storm hits, the cargo ship goes down, and Pi and some of the animals end up on the lifeboat. There’s no sign of the tiger at first. Then Webster directs a taut sequence of animal-on-animal violence incited by the hyena—which the puppeteers delightfully refer to as “megadeath”—that leads up to Richard Parker’s action-hero-like re-emergence onto the stage. It’s visceral and unsettling, so much so that the children I saw in the audience looked shell-shocked at intermission. (I’d still recommend taking your kids; being unsettled by something on Broadway is an essential step in growing up.) The second act gets to the heart of the story as Pi tries to tame the tiger and survive at sea, conjuring more spectacles, some in the same gruesome vein and others more serene. Tim Hatley’s scenic design cleverly finds multiple uses for elements of the set, so that Pi’s bed in his hospital becomes part of the lifeboat and the frames of umbrellas that uses to try to capture rain reappear as constellations held by members of the ensemble. At one point, Pi jumps through the stage into the water, and at another, meets a sea turtle that moves in some primal way that reads as wise. This being a survival tale, Pi also has to kill the turtle. In that death, as in many of the others, the puppeteer detaches from the animal as it’s killed, the human slipping offstage like a soul leaving a body. There’s more heft in that gesture than in any of Pi’s more self-conscious moralizing.\n\nBy the end of the play, Life of Pi wraps back around to its big lessons, making landfall again in the land of the vague and obvious. What sticks more clearly, however, are the production’s smaller gestures like that turtle’s death: The way its creatures trigger your empathy in the way they move with consideration and care. In my favorite of those little moments, there’s a scene where Richard Parker slips a paw under his chin to watch Pi. The expression’s both menacingly predatory and as approachable as a housecat. Pi, when his interviewers demand a more rational explanation for his survival, challenges them with the question “Which is the better story, the story with animals or the story without animals?” Who would say no to the one with animals, especially when the animals look like this?\n\nComments\n \n Leave a Comment\n \n\n Life of Pi Is Best When Its Fangs Are Visible\n\n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.\n\nEditor’s Picks\n \n \n \n \n \n \n \n \n the money game\n \n The End of Crypto As We Know It\n The End of Crypto As We Know It\n \n \n \n \n \n \n \n \n \n \n royals\n \n The Juiciest Revelations From Prince Harry’s Court Cases\n The Juiciest Revelations From Prince Harry’s Court Cases\n \n \n \n \n \n \n \n \n \n \n drought\n \n No Water? No Subdivision.\n No Water? No Subdivision.\n \n \n \n \n \n\n \n\n \n \n \n \n Most Popular\n \n\n \n \n \n \n Drew Barrymore Is Figuring It Out Live\n \n \n \n \n \n \n The Simpsons Is Good Again\n \n \n \n \n \n \n Is Another Taylor Swift Backlash Brewing?\n \n \n \n \n \n \n The Idol Series-Premiere Recap: Frosted Like a Pop-Tart\n \n \n \n \n \n \n Wait, What Happened in the Manifest Series Finale?\n \n \n \n \n\n \n \n \n \n Drew Barrymore Is Figuring It Out Live\n \n \n \n \n \n \n The Simpsons Is Good Again\n \n \n \n \n \n \n Wait, What Happened in the Manifest Series Finale?\n \n \n \n \n \n \n Is Another Taylor Swift Backlash Brewing?\n \n \n \n \n \n \n The Idol Series-Premiere Recap: Frosted Like a Pop-Tart\n \n \n \n \n\n \n\n \n Sign In to Comment\n \n \n\n \n \n \n\n \n \n\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n\n \n \n Email\n \n \n\n \n \n You\\'ll receive the next newsletter in your inbox.\n \n \n *Sorry, there was a problem signing you up.\n\nThis site is protected by reCAPTCHA and the Google\n Privacy Policy and\n Terms of Service apply.",
  "isFullReview": true,
  "textWordCount": 1356,
  "archivePath": "data/archives/reviews/life-of-pi-2023/vulture--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:14:06.504Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230605233650",
  "archiveOrgUrl": "http://web.archive.org/web/20230605233650/https://www.vulture.com/2023/03/theater-review-life-of-pi-broadway.html",
  "contentTier": "complete",
  "wordCount": 1356,
  "tierReason": "Full review text"
}