{
  "showId": "stereophonic",
  "outletId": "variety-frank-rizzo",
  "outlet": "Variety (Frank Rizzo)",
  "criticName": "Frank Rizzo",
  "url": "https://variety.com/2024/legit/reviews/stereophonic-review-broadway-1235976418/",
  "playbillVerdictUrl": "https://variety.com/2024/legit/reviews/stereophonic-review-broadway-1235976418/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Apr 19, 2024 8:59pm PT\t\n\n\t\n\n\n\t\t\n\t\t\n\t\t\n\n\n\t\n\n\t\n\t\t‘Stereophonic’ Review: Behind the Music, There’s Theatrical Solid Gold in This New Broadway Play\n\nThere’s a moment in David Adjmi’s play “Stereophonic” when a discordant, mid-’70s band-on-the rise hears one of its songs played back to them in the recording studio for the first time, with all its multiple tracks layered together into an artful whole.\n\nIt leaves the ever-bickering band suddenly speechless, emotionally stunned and still with the realization that they have just heard something truly great.\n\nAudiences may feel the same way after seeing this work of theatrical virtuosity, realizing that all the tiny details, wild rhythms, and clever hooks presented on stage have added up to a work that is brave, purposeful, and rich.\n\n“Stereophonic,” which began at Playwrights Horizons, starts out at what seems like a light satire of drugged-out rockers, full of silly riffs, big egos and comic digressions. But ever so gradually, and with the highest of fidelity, the play turns into something altogether fresh and, in this play-with-music hybrid form, indefinable.\n\nAs each of the five members of the almost-famous band arrives at the Sausalito studio to record its follow-up to its break-out album, you might think you were in the middle of a Robert Altman film with its overlapping dialogue, multiple actions on stage and swings of mood and focus.\n\nBut over these layers of seemingly inconsequential verisimilitude, we glean that Diana (Sarah Pidgeon), the band’s talented singer and co-songwriter, is insecure, feels stranded without her tambourine and is intimidated by the volatile Peter (Tom Picinka), her lover of nine years and the band’s guitarist and forceful creative power.\n\nThen there’s a trio of Brits: Holly (Juliana Canfield) on keyboards, whose relationship with drugged-out  bass whiz Reggie (Will Brill) is on the skids. Keeping things cool and the group semi-grounded is drummer Simon (Chris Stack).\n\nOverseeing the session on David Zinn’s well-worn, split-level set of engineering and glassed-in recording rooms, nicely lit by Jiyoun Chan, are sound engineer Grover (Eli Gelb), who fudged his resume to get the gig, and his laid-back assistant Charlie (Andrew W. Butler).\n\nOne might think at first this is a tantalizing behind-the-music documentary on the making of a record like Fleetwood Mac’s era-defining “Rumours.” But these characters — and the terrific ensemble of actors who could probably tour as a band after the Broadway run — become uniquely suited to Adjmi’s thematic purposes.\n\nWith their first album climbing the charts and the record company upping the recording session’s budget with a blank check, the stakes rise considerably along with the tensions of the group amid its shifting dynamics.\n\nAs the sleep-deprived sessions go from days to weeks to months and beyond, the theater-verité feel established at the beginning subtly shifts and more specific scenes of creative and relationship dramas emerge, whether on break or while recording in the studio.\n\nA pivotal meltdown scene between Peter and Diana is played offstage and is eavesdropped on by the engineers — and us. The endless attempts to get the right sound for the drums wring humor out of the tedium and exhaustion of the artistic process. A later recording session demonstrates that the fury among musicians at their breaking point can nonetheless result in exquisite harmonies.\n\nIn this rarefied recording world, Ryan Rumery does a miraculous job in what must be an especially challenging sound design; the fine-tuned music direction is by Justin Craig. Enver Chakartash’s lived-in costumes help define the period but also the emotional changes in the characters. (Diana’s free-flowing songbird of a dress at the end is a nice nod to Stevie Nicks.)\n\nThe audience may first be hooked by the rock archetypes, but Adjmi defies expectations. Peter may be controlling and uncaring but as intensely played by Pecinka, he has his own insecurities, too — and though maddening, his creative instincts are always right.\n\nReggie seems to be the loquacious stoner barely capable of going through a door, but he’s also a dazzling guitarist, and Brill is a joy to watch in all of the character’s evolutions.\n\nSimon may be the cool and steady one in the group but as delicately played by Stack, he’s a true family man with a lot to lose and clearly weary of his mediating role as father figure. Holly is not just a supporting player to the group — and complex ally to Diana — but a sensitive artist fully capable of her own rage. Canfield also has one of the best off-topic scenes, talking about her love of the film “Don’t Look Now” and its intersection of love and grief, a note that could resonate with the band.\n\nEven Grover, who first appears to be the play’s comic relief — and audience stand-in during the band’s long sieges of madness — turns out to be one of the most original characters, and expertly played by Gelb as a man who is barely holding onto his job, if not his sanity. As for Charlie, well, even after a few years the band barely knows his name, though Butler’s reactive performance is certainly memorable.\n\nBut throughout the three hours of the play’s recording sessions, all eyes are on Diana, at first belittled and emotionally beaten by Peter’s brilliance and bullying. As played by Pidgeon, Diana’s incremental discovery of her own confidence, voice and courage to go her own way gives the play its emotional through-line.\n\nGiving the show critical music cred are the original songs by Will Butler, a former member of Arcade Fire. In the half dozen partial or full numbers reflecting the woozy era of Brit blues-folk-rock-pop, Butler succeeds in the considerable task of creating a song that needs to take away the band’s breath as well as ours. It does, thanks in no small part to Pidgeon’s remarkable performance.\n\nIn a way, director Daniel Aukin is much like Grover: the expert craftsman and invisible hand at the controls, making the slightest adjustments in tempo and tuning to Adjmi’s composition and the performances to make it all come together into a breathtaking whole. The result: A classic.\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice.",
  "isFullReview": true,
  "textWordCount": 1123,
  "archivePath": "data/archives/reviews/stereophonic/variety-frank-rizzo--frank-rizzo_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:00:13.038Z",
  "designation": "Recommended",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 1.5,
      "method": "browserbase",
      "success": false,
      "error": "Paywall detected"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee"
}