{
  "showId": "the-realistic-joneses-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2014/04/07/theater/realistic-joneses-stars-toni-collette-and-michael-c-hall.html?_r=1",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Plays as funny and moving, as wonderful and weird as 'The Realistic Joneses,' by Will Eno, do not appear often on Broadway. Or ever, really. You're as likely to see a tumbleweed lolloping across 42nd Street as you are to see something as daring as Mr. Eno's meditation on the confounding business of being alive (or not) sprouting where only repurposed movies, plays by dead people and blaring musicals tend to thrive...The disjointed push and pull of Mr. Eno's dialogue is not easy to master: He emphasizes the way in which we so often do throw words at one another, although most of us don't have the arsenal of curveballs that, say, John does. You may come out of this play hearing a new strangeness - and perhaps a lunatic beauty - in the way a casual conversation can unfold, or at least wishing that your interactions held the entrancing oddity of Mr. Eno's characters'...For all the sadness woven into its fabric, 'The Realistic Joneses' brought me a pleasurable rush virtually unmatched by anything I've seen this season.",
  "bwwScore": 8,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-REALISTIC-JONESES-Opens-on-Broadway-Updating-Live-20140406",
  "fullText": "https://www.nytimes.com/2014/04/07/theater/realistic-joneses-stars-toni-collette-and-michael-c-hall.htmlShare full articleAdvertisement\n\nPlays as funny and moving, as wonderful and weird as “The Realistic Joneses,” by Will Eno, do not appear often on Broadway. Or ever, really. You’re as likely to see a tumbleweed lolloping across 42nd Street as you are to see something as daring as Mr. Eno’s meditation on the confounding business of being alive (or not) sprouting where only repurposed movies, plays by dead people and blaring musicals tend to thrive.\n\nBroadway has long been a place inhospitable to the truly active currents of contemporary theater, so the opening of Mr. Eno’s play at the Lyceum Theater on Sunday night, in a production insured against instantaneous death (one hopes) by the presence of a few name stars — Toni Collette, Michael C. Hall and Marisa Tomei, alongside the less famous but no less gifted Tracy Letts — is an occasion worth celebrating.\n\nAnd I hope the word “weird” doesn’t scare you off: Mr. Eno’s voice may be the most singular of his generation, but it’s humane, literate and slyly hilarious. He makes the most mundane language caper and dance, revealing how absurd attempts at communication can be. He also burrows into the heart of his characters to reveal the core of their humanity: the fear and loneliness and unspoken love that mostly remains hidden beneath the surface as we plug away at life, come what may.\n\nAn awful lot, or a lot of awful, may be in store for the characters in “The Realistic Joneses,” which is easily his most accessible play (others include the Pulitzer Prize-finalist “Thom Pain (based on nothing)” and “Middletown”). It has been ushered onto Broadway with a gentle hand by the director Sam Gold, who allows his terrific cast to find its own way into the twisting grooves of Mr. Eno’s writing.\n\nThe play opens on a bucolic tableau that finds Bob and Jennifer Jones (Mr. Letts and Ms. Collette) idling through an evening at the picnic table in their backyard, exchanging nothing-much conversation that carries an undercurrent of unease.\n\n“It just seems like we don’t talk,” Jennifer says, after Bob has dodged her attempts to turn the conversation into serious channels.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 385,
  "archivePath": "data/archives/reviews/the-realistic-joneses-2014/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:20:14.708Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250602053333",
  "archiveOrgUrl": "http://web.archive.org/web/20250602053333/https://www.nytimes.com/2014/04/07/theater/realistic-joneses-stars-toni-collette-and-michael-c-hall.html?_r=1",
  "wordCount": 385,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T09:18:32.420Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text cuts off mid-article and ends with a technical error message about retrieving content and enabling JavaScript; openai: The text is incomplete and includes navigation instructions and error messages, making it not scoreable.",
  "promptVersion": "5.2.0"
}