{
  "showId": "the-realistic-joneses-2014",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2014/04/theater-review-the-realistic-joneses.html",
  "publishDate": "April 7, 2014",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nToni Collette and Michael C. Hall in The Realistic Joneses.\n Photo: ?2014 Joan Marcus/?2014, Joan Marcus\n \n \n \n Is Will Eno the absurdist Neil Simon? The 49-year-old playwright, a Pulitzer finalist in 2005 for Thom Pain (based on nothing), certainly has a gift for metaphysical one-liners, especially paraprosdokians, those jack-in-the-box epigrams that seem to lead one way before feinting another. Alas, in his first Broadway outing, it’s a gift he keeps giving till it hurts: The Realistic Joneses is a four-character play in which everyone talks like the deadpan comic Steven Wright.\n\nTry to guess which of the following lines are Wright’s and which Eno’s:\n\n1. Ice cream is a dish best served cold.2. I intend to live forever; so far, so good.3. A hundred-year-old fake is still a real antique.4. The early bird gets the worm, but the second mouse gets the cheese.5. It’s impossible to be almost late.\n\nPerfectly turned though they are, and serviceable for standup, such jokes (the odd-numbered ones are Eno’s) do not make a solid foundation for drama, especially a drama in which the two couples who speak them are meant to be unalike in status, background, health, and temperament. Bob and Jennifer Jones (Tracy Letts and Toni Collette) are long-settled in a quiet exurban town; they have regular jobs, or at least did until Bob came down with a mysterious degenerative neurological disease whose most visible symptom is a propensity for sarcastic zingers. On the other hand, their new neighbors, John and Pony Jones (Michael C. Hall and Marisa Tomei), do not seem to have any source of income, or much furniture or common sense, but are rich in prickly forms of avoidance. Which pair of Joneses, if either, is the “realistic” one is not made clear, or even addressed, though a certain merging of identities in the Albee manner makes the question moot.\n\nThis is not altogether unappealing. The jokes are funny, and when their content supports character development, as sometimes randomly happens, they even land quite nicely. The growing tension between Bob and John — a matter of peacock territoriality and something darker, it would seem — naturally finds expression in such conversational gambits:\n\nBOB: Don’t be an idiot.JOHN: That’s good advice.\n\nBut with both Jennifer and Pony — a nag and a ditz in Eno’s cosmology — also talking that way most of the time, the play very quickly starts to sound like a toddler banging the same bar on a xylophone over and over.\n\nWhat tune is implied? There must be one. The search for purpose, let alone meaning, may be vain in the Joneses’ neighborhood, but I have to believe that Eno’s own aims and attempts to reach them are more deliberate. If the one-liners are not being used to characterize the characters, who in any event alter their positions like weathervanes, what are they doing? At one level, I suppose, they are characterizing marriage and the fruitlessness of verbal interaction within it. (Each couple has discussions about what cannot be discussed.) More generally, words are implicated in a mysterious breakdown of the larger human condition:\n\nJOHN: People talk about things, or they don’t. It doesn’t really matter, the things will have their day, the things will rise again.BOB: I get what you’re saying.JOHN: You don’t get what I’m saying. Not your fault. Words don’t really do it for me anymore, anyway.\n\nThe mysterious breakdown, of course, is death, whose shadow hovers over the play from beginning to end. (“Because we’ll only be here for a short time, before we’re gone forever,” Eno himself announces before the curtain rises, “we ask that you refrain from photography and recording of any kind.”) It’s from the gap between overt forms of avoidance and the obscure but implacable progress of decay that Eno must want his drama to emerge. And the all-star actors, under Sam Gold’s lovely direction, do prove expert in mining that gap. Hall in particular, inching out conversation like a measuring tape then snapping it back in, makes the house style pay; his pathos is solid-state. Tomei, as jumpy (and birdbrained) as a starling, is marvelous too. And though Letts and Collette seem more reactive than real in the more obviously conceived parts, overall you could not ask for a better-tuned ensemble. Their commitment and cohesion pay off when the characters eventually begin to discuss their existential dread instead of submerging it beneath the drip-drip-drip of jokes, allowing something more tender and mature to rise to the surface.\n\nIt’s still not dramatic, though. Even when someone dies, it’s far offstage. What we get onstage, here as in previous Eno works like The Open House and Middletown, is the kind of desultory discussion that has become as much a cliché of contemporary “backyard” plays as crickets and bug zappers and shallow neighborliness. Eno brings a decided intellectual panache to the genre (as opposed to, say, Lisa D’Amour’s more emotional Detroit) but I’m not sure that’s an improvement if the aim is to produce meaning; it’s like producing water by squeezing a hamperful of damp clothes. You might be able to do it, but is it worth the effort? So even though The Realistic Joneses is smart and witty and beautifully produced, it’s not exactly enjoyable. As Groucho Marx, who knew from paraprosdokians, once said, “I’ve had a perfectly wonderful evening, but this wasn’t it.”\n\nThe Realistic Joneses is at the Lyceum Theatre through July 6.\n\nShow \n \n \n Comment\n \n\n Theater Review: The Realistic Joneses\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "dtliExcerpt": "The Realistic Joneses is a play about two couples who share more than a last name and a cul-de-sac address. They also share a rare neurological disease that affects movement and cognition.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The Realistic Joneses is a play about two couples who share more than a last name and a cul-de-sac address. They also share a rare neurological disease that affects movement and cognition.",
  "contentTier": "complete",
  "contentTierReason": "Short text (32 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://www.vulture.com/2014/04/theater-review-the-realistic-joneses.html",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "textWordCount": 951,
  "archivePath": "data/archives/reviews/the-realistic-joneses-2014/vulture--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:08:37.843Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 951,
  "tierReason": "Full review text"
}