{
  "showId": "jajas-african-hair-braiding-2023",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://cititour.com/NYC_Broadway/JaJas-African-Hair-Braiding/1171",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $59\n\t Buy Tickets\n\nCititour.com Review\n    A group of women in a hair salon – customers and stylists alike – bicker, bluster and bond, especially when one faces an unexpected tragedy. Yes, on the surface Jocelyn Bioh’s world premiere play, “Jaja’s African Hair Braiding,” now being given an extraordinary production at Manhattan Theatre Club’s Samuel J. Friedman Theatre, bears a superficial resemblance to that theatrical staple, “Steel Magnolias.” But Bioh’s work, set in Harlem in 2019, is richer, often funnier, and – above all, decidedly more political than Robert Harling’s play – and should hopefully find itself produced just as often in years to come. \n\nOf course, whether another company can find this skilled a cast, a director as finely attuned to the script as Whitney White, or such a superlative creative team (the very clever set is by the great David Zinn, the fabulous costumes are by the wonderful Dede Ayite, and the music and sound design are by the talented Justin Ellington) is another story entirely.\n\nWhile the titular salon is owned by Jaja, we’re led to believe we will not meet her, as the play takes place on the same day that she’s marrying a white man named Steven to finally get her long-awaited green card. As we quickly learn, all the shop’s employees are also African immigrants, each with their own very distinct personality: the sweet-natured Miriam (a lovely Brittany Adebouma), the caustic, judgmental Bea (a sensational Zenzi Willaims), the “romantic,” slightly naive Aminata (a fine Nana Mensah) and the seemingly laid-back but decidedly ambitious Ndidi (a feisty Maechi Aharanwa). Their co-existence in Jaja’s shop seems often on the brink of collapse.\n\nAs their stories unfold, we learn each came to America for better wages and to fulfill bigger dreams, as well as to escape various issues. Yet, they have also discovered that their new homeland comes with its own set of trials and tribulations, including unfaithful lovers (Michael Oloyede, who remarkably differentiates all four of the play’s small male roles) and demanding clients (well played by Rachel Christopher, Kalyne Coleman, and Lakisha May).\n\nBut the saddest story belongs to Jaja’s teenaged daughter Marie (an appealing Dominique Thorne). Marie– who has not seen her native Senegal since she was four years old -- has been succeeding brilliantly at a local private school using the name and papers of her cousin Kelly. But now, despite being the valedictorian, she is being stymied in her quest to attend college by the lack of her legal status.\n\nSolving that issue is the foremost reason Jaja is getting wed, as we learn she makes a surprise visit to the shop (Somi Kokama, bedecked in a somewhat over-the-top white wedding gown, makes an amazing entrance). For a few minutes, while justifying her reason for a seemingly questionably marriage, Jaja engages in a lengthy if brilliant tirade about how badly America treats its immigrant population, and how she believes all will become “right” once she can say she is an “American.” \n\n“This country is fine with TAKING. They are even fine with us GIVING, but the moment we ASK for something? Hey! That’s it. Who are you? Dirty Africans! Get out of our country!” Jaja shouts with righteous indignation. \n\nTrenchant as her speech is, it can feel a bit like she’s standing on a soapbox running for office, and the tone of her screed seems out of keeping with the more naturalistic-sounding language we’ve heard so far. Unsurprisingly, though, Bioh has a larger plan in store that fully justifies the sequence.\n\nIndeed, Jaja’s words will echo in our ears when the play takes a final, very dramatic twist. At the end of the 90-minute work, both the characters and the audience have no choice but to think twice about all that has gone before.\n    \t    By Brian Scott Lipton\n\nVisit the Sitehttps://www.manhattantheatreclub.com Open/Close DatesOpening 10/3/2023Closing 11/19/2023\nTheatre Info\nSamuel J. Friedman Theatre261 West 47th Street New York, NY 10036\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 716,
  "archivePath": "data/archives/reviews/jajas-african-hair-braiding-2023/cititour-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:28:38.153Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}