{
  "showId": "jajas-african-hair-braiding-2023",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/theater/theater-reviews/jajas-african-hair-braiding-review-broadway/",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nJaja's African Hair Braiding review: A powerful comedy with a twist\nJocelyn Bioh's play, which opens at the Samuel J. Friedman Theatre, features a standout ensemble, including Dominique Thorne, Zenzi Williams, Brittany Adebumola, and more.\n\nThere are few places in the world where one can share their innermost dreams, dish out some seriously scandalous gossip, and leave feeling more beautiful and confident than when they initially entered. Jaja's African Hair Braiding — the fictional, eponymous salon at the epicenter of Jocelyn Bioh's new comedy, now playing at the Samuel J. Friedman Theatre — is one of them.\n\nThe Ghanaian-American playwright (School Girls; Or, The African Mean Girls Play) and director Whitney White (Our Dear Dead Drug Lord) have teamed up with producers Taraji P. Henson and LaChanze to paint a brilliant, emotive portrait of a seemingly simple day in the life of the sedulous West African women working at its titular Central Harlem hair braiding shop. As their day progresses, theatergoers will uncover a powerful tale about joy, dreams, societal and familial expectations, community, politics, loss, and sisterhood.\n\nSet on a sweltering summer day in 2019, Marie (Dominique Thorne) arrives late to open her mother's shop to discover that sunny hair braider Miriam (Brittany Adebumola) is already waiting outside. With the flick of a lock, the pair enter the building as scenic designer David Zinn spins the shuttered storefront to reveal a Barbie-esque dream salon behind it, complete with neon pink walls, glittering mirrors, ruby red styling chairs, and a television that's used for listening to afrobeats songs and playing Nigerian films.\n\nThe rest of the play's standout ensemble slowly filter in after them, each with their own pivotal role within the salon's found family dynamic. There's the dogmatic and drama-loving Bea (Zenzi Williams) who's not afraid to give her two cents on everyone else's business; her breezy gossip partner Aminata (Nana Mensah); and the artsy younger hairstylist Ndidi (Maechi Aharanwa), who Bea squabbles with over stolen clients. The only person not in attendance is shop matriarch Jaja (Somi Kakoma), who has taken the day off to marry a white man named Steven, much to the chagrin of the entire salon. However, when an unexpected incident occurs, the team must all put aside their differences and come together to protect one of the shop's own.\n\nWhile Jaja's African Hair Braiding maintains a buzzy, lighthearted tone throughout its speedy 90-minute runtime, it doesn't shy away from addressing the sacrifices that each of its characters has made in order to build a new life for themselves in the United States. Bioh breathes both joy and grief into these women within her stellar script, giving them each their own distinct personalities and lived-in experiences. There's Bea, who survived moving to New York City by cleaning houses and braiding hair on the street, and Miriam, who left behind her entire family in Sierra Leone and hasn't returned in years. Marie, an undocumented high school graduate caught between two worlds, offers her own unique viewpoint as she fears being deported back to a country that she doesn't know.\n\nThe result is a play that is equally affecting as it is hilarious, weaving together expertly delivered punchlines and physical gags alongside frank discussions on race, immigration, and a few jabs at the racist rhetoric espoused by then-President Donald Trump. But what truly sells Jaja's African Hair Braiding is its almost entirely female cast, many of whom are making their Broadway debut, who each bring a real sense of love for their characters and for each other. Their solid chemistry can be seen when the salon throws an impromptu dance party — complete with sound designer Justin Ellington's original music and lighting designer Jiyoun Chang's flashing, colorful spotlights — that sees them all twirling, laughing, and cheering for one another as they flaunt their dance skills.\n\nAs Marie, Thorne — known for starring as Riri Williams in Marvel's Black Panther: Wakanda Forever and the forthcoming Ironheart series — deftly explores her character's conflicted nature, approaching every scene with an engrained sense of suspicion and distrust. Williams is a total scene-stealer as Bea, eliciting laughs from the audience with her blunt line deliveries and disapproving glares at whoever has decided to cross her at that given moment. Adebumola's Miriam is gentle, but not weak, bringing a real fire to the seemingly shy girl-next-door, while Mensah's Aminata is strong-willed until the moment that she locks eyes with her smooth-talking husband James (Michael Oloyede). Aharanwa brings both a laid-back energy and a strong discernment to the salon's \"It Girl \"Ndidi, who wisely knows when to pick her battles and when to just put in her headphones.\n\nThe shop's clients — played by Lakisha May, Rachel Christopher, and Kalyne Coleman — are also fantastic, each with their own backstories that range from an aspiring journalist to a woman who wants to look like Beyoncé. At one point, May's grouchy Vanessa succeeds in sending the entire theater into hysterics when she loudly lectures Aminata on her hair care routine before promptly falling asleep in her chair, leaving the entire staff to gaze at one another completely dumbfounded.\n\nOver the course of the play, its cast also conjures up some serious hair magic onstage, seamlessly transforming their clients' hair into several different Black hairstyles, from jumbo box braids to cornrows to micro braids. Although theatergoers can watch the hair braiders meticulously work throughout each scene, it was almost impossible to spot when the wigs — created by hair and wig designer Nikiya Mathis alongside hair braiding consultant Hair By Susi — are swapped with the next one, making it a delight for both the crowd and the client when their chair was spun to reveal a dazzling new look.\n\nThere are no easy answers to the complex problems that Jaja's African Hair Braiding presents, and certainly none that can be solved within the span of a single day. Instead, the play encourages viewers to inspect the way the current world works and, hopefully, leave its salon with a greater sense of compassion and understanding for those around them tirelessly working to make ends meet. Grade: A–",
  "isFullReview": true,
  "dtliExcerpt": "“There are no easy answers to the complex problems that ‘Jaja's African Hair Braiding’ presents, and certainly none that can be solved within the span of a single day. Instead, the play encourages viewers to inspect the way the current world works and, hopefully, leave its salon with a greater sense of compassion and understanding for those around them tirelessly working to make ends meet.”\n\nRead more",
  "originalScore": null,
  "assignedScore": 95,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1024,
  "archivePath": "data/archives/reviews/jajas-african-hair-braiding-2023/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:29:13.529Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "scoreSource": "extracted-grade",
  "scoreConfidence": "medium",
  "extractedGrade": "A"
}