{
  "showId": "jajas-african-hair-braiding-2023",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=RVTWDE",
  "publishDate": null,
  "fullText": "Brittany Adebumola, Dominique Thorne. Photo: Matthew Murphy \"Well, thank you, ladies. I feel like I moved in for the day.\" So says one of the customers at the title establishment of Jocelyn Bioh's latest play, and you're likely to share the feeling if you make an appointment at the Friedman in the next several weeks. Offering her contribution to the racial conversation that is so much a part of this theatre season, Bioh takes the classic route, employing a dramatic structure that would not be out of place on Broadway seventy or eighty years ago but revivifying it with fresh characters and insights. With its workplace setting, Jaja's African Hair Braiding recalls any number of plays, including Steel Magnolias and Thoughts of a Colored Man, but it offers a distinctive atmosphere and an often-uproarious sense of humor. It also has something pointed and troubling to say about our broken immigration system. The staff of Jaja's shop consists almost entirely of emigrés from various African countries and what a gallery they make. Bea, a native of Ghana and the senior member of the staff, is alarmingly blunt and addicted to gossip. With four husbands in the rearview mirror, she takes a dim view of love and romance and is only too willing to share her opinions; she's also an expert counterpuncher when she thinks her livelihood is threatened. But she will prove to be a tower of strength in the crisis that brings down the final curtain. And, as played by Zenzi Williams, she is an expert pot stirrer, keeping everyone else on their toes. Miriam, from Sierre Leone, is, by contrast, rather ladylike and a model of efficiency. But, as we learn, in one of the captivating arias that punctuate the action, she is a figure of scandal and regret, having stepped out on her unhappy marriage for a romance with a singer described as \"like Usher. But from Sierra Leone.\" In exile from her domestic troubles, she is trying to raise enough money to bring her daughter to the US. In any case, working in Jaja's shop has transformed her sense of self. \"Everyone think I'm quiet,\" she says. \"I'm not like average African woman, eh. No more time for quiet. I want to be loud, yeah?.... Yeah. Very loud.\" Thanks to Brittany Adebumola's remarkably layered work, Miriam's spirit is conveyed with unmistakable clarity. The Senegalese Aminata, the shop's flashiest dresser, has a case of hypertension exacerbated by her no-good husband James, a cheater and a scrounger. The staff's skillful diplomat, Aminata is often unintentionally hilarious, logic not being her strong suit; noting that her doctor has warned her about stress, she snaps, \"Of course, I have stress! You are telling me I have high blood pressure and that I'm going to die!\" Whether making short work of a bouquet from James or assiduously playing scratch-off lottery games in search of a life-changing payday, Nana Mensah makes her a steady source of delight. Ndidi, new to the shop, is a funny, flirty refugee from the Nigerian film industry; alas, her good-natured ways and unconscious knack for stealing Bea's customers drive the latter up the wall. Relentlessly keeping things positive, Ndidi is especially tactful when handling a customer who sees herself as a dead ringer for Beyoncé. In the hands of Maechi Aharanwa, she is a steady burst of sunshine who can't help but irritate cloudier souls. Riding herd on the captious, fractious sorority is eighteen-year-old Marie, daughter of Jaja (played with brio by Somi Kakoma), who is off getting married to a white man of whom her daughter disapproves. (Love him or hate him, marriage to him will secure Jaja's status as a US citizen.) Sensible, practical, and smart -- she pens short stories that rework the plot of Titanic with an all-Black cast -- Marie got through private school in stellar fashion using a cousin's identity papers; now, lacking citizenship, she is poignantly trying to figure out what comes next. Marie is rather less flamboyant than her co-workers but, as played by the film and TV actress Dominique Thorne, she more than holds her own in this powerhouse ensemble. Director Whitney White, not really known for her work in comedy, guides her company through one perfectly timed moment after another: Aminata casually losing all her business cards to avoid an obstreperous customer; an unintentionally humiliating encounter between Marie and a privileged, if airheaded, former classmate; the moment James, protesting his fidelity, asks God to strike him dead if he is lying -- and everyone in the room scurries for safety. (Keeping things lively are Kalyne Coleman, Lakisha May, Rachel Christopher and Michael Oloyede as a parade of customers and male interlopers.) White also stage-manages the characters' monologues with brio; engineers a showstopping entrance for Jaja (in a knockout of a wedding dress, courtesy of the excellent designer Dede Ayite); and expertly navigates a drastic shift in tone when something unexpected happens, laying bare how, for the undocumented, disaster and deportation remain a hair's breadth away. The action unfolds on David Zinn's marvelously detailed, pink-toned set, backgrounded by a Harlem skyline, with Jiyoun Chang's lighting evoking a stifling summer day before gradually slipping into night. Justin Ellington's original music and sound design call up the atmosphere of New York streets. Projection designer Stefania Bulbarella contributes some amusing footage from faux Nollywood films with their wild plot twists and emotive acting styles. And, for a show in which hair is a way of life, Nikyia Mathis' hair and wig designs are spectacular. Ultimately, the production makes an all-but-flawless swerve toward tragedy, making one realize how cunningly put together it is. Jaja's African Hair Braiding gets us to fall in love with these skilled, funny, contentious, and thoroughly independent women, then reminds us how easily their talents and spirits can be squandered in our so-called land of opportunity. It's an argument we can't hear enough right now and Bioh makes it with uncommon eloquence. --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1011,
  "archivePath": "data/archives/reviews/jajas-african-hair-braiding-2023/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:29:29.491Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}