{
  "showId": "jajas-african-hair-braiding-2023",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://talkinbroadway.com/page/world/JajasAfricanHairBraiding.html",
  "publishDate": null,
  "fullText": "Broadway Reviews\n \n\n Jaja's African Hair Braiding\n\n\nTheatre Review by Howard Miller - October 3, 2023\n\n\nJaja's African Hair Braiding by Jocelyn Bioh. Directed by Whitney White. Scenic design by David Zinn. Costume design by Dede Ayite. Lighting design by Jiyoun Chang. Original music and sound design by Justin Ellington. Video design by Stefania Bulbarella. Hair and wig design by Nikiya Mathis. Dialect and vocal coach Dawn-Elin Fraser\nCast: Brittany Adebumola, Maechi Aharanwa, Rachel Christopher, Kalyne Coleman, Somi Kakoma, Lakisha May, Nana Mensah, Michael Oloyede, Dominique Thorne, and Zenzi Williams.\nTheater: Samuel J. Friedman Theatre\nTickets: Telecharge.com\n\n\nKalyne Coleman and Maechi AharanwaPhoto by Matthew MurphyA couple of years back, Ghanaian-American playwright Jocelyn Bioh led the post-pandemic reopening of the Delacorte Theater in New York's Central Park with a delightful retelling of Shakespeare's comedy The Merry Wives of Windsor. Retitled Merry Wives and relocated to modern day Harlem, it featured characters representing members of the African immigrant population from Senegal, Nigeria, Ghana, and Liberia. Very specifically, the play took place on 116th Street, with one of its settings being a hair braiding salon.\n\nNow, Bioh and a different hair braiding salon are on hand as the playwright makes her Broadway debut with the thoroughly engrossing dramedy Jaja's African Hair Braiding, opening tonight at the Samuel J. Friedman Theatre. This time the salon is the sole setting, and, for the record, it is located a few blocks away on 125th Street, a competitor, perhaps. That is where we get to spend a day among the stylists, customers, and the occasional street vendor who pops in.\n\nAs was the case with Merry Wives, many of the characters are African immigrants, especially the stylists who have found a home under the embracing wing of Jaja (Somi Kakoma). Jaja, who is from Senegal, doesn't actually appear until late in the 90-minute play, but her presence is felt throughout. Meanwhile, in her absence, her 18-year-old daughter Marie (Dominique Thorne) keeps the place running. The play begins at 9 a.m. on a sweltering hot day in July as Marie and stylist Miriam (Brittany Adebumola), who hails from Sierra Leone, are getting ready to open up. We will be with them and the rest of the women for the remainder of their day as they banter, bicker, share secrets, and work with the customers who come and go from the shop (perfectly rendered in David Zinn's set design, down to the magenta walls and grimy glass storefront windows).\n\nBioh, a dab hand at blending the comic and the serious within her plays, allows the details of her characters to reveal themselves gradually. In this way, they become more and more real to us over time, until we feel, as one customer (Rachel Christopher) puts it after hours and hours of having micro braids put in, \"like I moved in for the day.\" \n\nThere is Bea (rhymes with \"bee\"), wonderfully realized in the role by Zenzi Williams. She is the judgmental neighborhood gossip and chief complainer, with an appropriately stinging personality befitting her name. Bea may see herself as a speaker of truth, but her manner makes her off-putting to almost everyone she comes into contact with. As her frenemy and co-worker Aminata (Nana Mensah) says to her after a particularly exasperating conversation, \"All this time when you talk about how your family back home won't speak to you, I would think 'how could they not want anything to do with their with their own flesh and blood?' But now I understand!\"\n\nDominique Thorne and Somi KakomaPhoto by Matthew MurphyBut don't write off Bea as being a one-sided character. The same is true of the others, all of whom have back stories that are well worth waiting for. There is Ndidi (Maechi Aharanwa), popular with her customers (much to Bea's chagrin) and with a fascinating tale to tell about the life she left behind in Nigeria. And the optimistic and gentle Miriam shows she has unexpected depths as she speaks of her plans to return to Sierra Leone. From time to time, various men (all well played and clearly differentiated by Michael Oloyede) enter the shop. One is James, Aminata's sleazy husband, while the others are street vendors, hawking socks, jewelry, or DVDs. Kudos as well to the women who portray the customers: Rachel Christopher as the ever-patient Jennifer whose micro braiding takes place over the course of the entire play, and Lakisha May and Kalyne Coleman, both of whom perform multiple roles. \n\nThe play takes on a more dramatic turn when Jaja comes into the shop, elegantly dressed all in white for her forthcoming wedding to a man in whom she has placed her hopes for her future and, even more, for the future of her daughter Marie. Much unfolds in the final scenes of the play, but what we come away with more than anything is a wonderful sense of community among these women, along with their immigrants' dream of making it in a not-always-welcoming America. \n\nUnder the sure hand of director Whitney White, Jaja's African Hair Braiding is an altogether terrific ensemble piece. The cast members embrace the all-for-one, one-for-all togetherness that touches the heart amid the comic elements that Bioh (perhaps best known for her multiple-award winning play School Girls; or the African Mean Girls Play) is so good at providing for us. A final shout-out to Dede Ayite, whose costume designs are a splendid mix of American casual and African-inspired looks, and a huge round of applause for the incredible work by hair and wig designer Nikiya Mathis.\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n                  \n\n                                                  \n                \n              \n            \n          \n        \n      \n    \n  \n\n\n\n\n\n\n\n\n    \n    \n    \n                \n                \n                \n\n            \n             \n            \n                \n                    \n                        Share:",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 924,
  "archivePath": "data/archives/reviews/jajas-african-hair-braiding-2023/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:37:18.611Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250605033400",
  "archiveOrgUrl": "http://web.archive.org/web/20250605033400/https://www.talkinbroadway.com/page/world/JajasAfricanHairBraiding.html"
}