{
  "showId": "constellations-2015",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "http://www.ew.com/ew/article/0,,20364394_20891829,00.html",
  "playbillVerdictUrl": "http://www.ew.com/ew/article/0,,20364394_20891829,00.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "''Do you know why it's impossible to lick the tips of your elbows?'', asks Marianne (Ruth Wilson) of Roland (Jake Gyllenhaal) at the start of British playwright Nick Payne's Constellations. ''They hold the secret to immortality.'' It's a charming come-on, but it tests your patience as Marianne repeats those lines again and again, with different outcomes. In one version, he shuts her down. In another, he flirts back, until they end up at her place...discussing theoretical physics. (Don't all great dates end that way?) Marianne, a physicist, believes in a multiverse where different realities coexist simultaneously, hence the play's endless diversions on the couple's meetings, fights, and chance encounters. Roland, a beekeepera job that exists only in Metaphorical Theaterisn't so sure. ''If everything I'm ever gonna do already exists,'' he asks, ''what’s the point?''\n\nYou may wonder the same thing watching Payne's thought-provoking but flawed 70-minute puzzler. Despite a radical structurethe standout scene is performed in sign-languageit's too much like something we've seen before. The time-is-a-flat-circle conceit has been overplayed in pop culture of late, along with the variations-on-the-same-scene structure that Wilson works so well in Showtime's newly Golden Globe-minted The Affair. Wilson is brilliant, dramatically altering key moments with the tiniest of inflections, and Gyllenhaal brings psychological depth to Roland. But that subtlety is upended by a heavy-handed finale, which is less an emotional breakthrough than philosophical trickery. While you're waiting for Constellations to grab and shake you, it's trying to lick its own elbows. B-",
  "isFullReview": true,
  "textWordCount": 247,
  "archivePath": "data/archives/reviews/constellations-2015/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:41:00.509Z",
  "originalScore": "D",
  "originalScoreNormalized": 35,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20150114174102",
  "archiveOrgUrl": "http://web.archive.org/web/20150114174102/http://www.ew.com/ew/article/0,,20364394_20891829,00.html",
  "textIssues": [
    "Word count too low: 258 (min: 300)"
  ],
  "contentTier": "truncated",
  "wordCount": 247,
  "tierReason": "Short text (247 words)"
}