{
  "showId": "marjorie-prime-2025",
  "outletId": "1-minute-critic-matthew-wexler",
  "outlet": "1 Minute Critic (Matthew Wexler)",
  "criticName": "Matthew Wexler",
  "url": "https://1minutecritic.com/marjorie-prime-broadway-review-june-squibb-cynthia-nixon/",
  "playbillVerdictUrl": "https://1minutecritic.com/marjorie-prime-broadway-review-june-squibb-cynthia-nixon/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "“The Prime says what we need to hear.” It’s a sentiment both terrifying and soothing in Marjorie Prime, Jordan Harrison’s play about a family grappling with mortality and the dubious technology to circumvent grief. The Pulitzer Prize-nominated work premiered over a decade ago, but with AI advancing at an alarming rate and recent symbolic ChatGPT wedding ceremonies, the line between science fiction and reality has become increasingly blurred.\n\nWith the average age of the Broadway theatergoer hovering around 42 years old, Marjorie Prime hits home. Many an audience member coping with aging parents may shift uncomfortably, but ultimately lean into the familiar family dynamics and stellar performances.\n\nWith her husband (Danny Burstein) ‘s encouragement, Tess (Cynthia Nixon) enlists a computer-generated, 30-something version of her late father (Christopher Lowell) to ease her aging mother, Marjorie’s (June Squibb) dementia. Marjorie is a spry 85, but her mind and body are becoming increasingly uncooperative.\n\nThe conversations, intended to provide solace (for the aged or the caregiver, we’re not sure), stir the family pot, including the long-ago tragic demise of Tess’s brother, the couple’s fraught relationships with their three adult children, and the collective anxiety around death and dying.\n\nAt 96, Squibb anchors the divine acting company with impeccable timing and witty reflection thanks to Harrison’s culture-stamped prose. References from Beyonce’s “Single Ladies (Put a Ring On It)” to The Gates, Christo and Jeanne-Claude’s 2005 Central Park art installation, themselves, fading timestamps.\n\nNixon’s acerbic Tess, voices what many of us have thought but are afraid to say aloud, questioning the desire to prolong the inevitable. “By the end you’re not even capable of having a single new moment,” she says, exasperated, “I don’t know why we have to keep each other alive for so long.”\n\nRegular theatergoers will have an even more profound sense of Burstein’s performance, who balances the family dynamic with a tender authenticity. As for the why, Marjorie’s recollection sums it up best: “How nice that I could love somebody.”\n\nJune Squibb and a superb company turn Marjorie Prime into an acting masterclass about mortality, memory, and why we love.\n\nMatthew Wexler is an award-winning editor and writer. His work has been recognized by GLAAD and the National Association of LGBTQ+ Journalists. Matthew is a member of the American Theater Critics Association and an alum of the National Critics Institute.\n\nYour email address will not be published. Required fields are marked *\n\nSave my name, email, and website in this browser for the next time I comment.\n\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "isFullReview": true,
  "textWordCount": 430,
  "archivePath": "data/archives/reviews/marjorie-prime-2025/1-minute-critic-matthew-wexler--matthew-wexler_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:21:15.641Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee auth failed: Monthly API calls limit reached: 250000"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}