{
  "showId": "marjorie-prime-2025",
  "outletId": "AMNY",
  "outlet": "amNewYork",
  "criticName": null,
  "url": "https://www.amny.com/entertainment/broadway/review-marjorie-prime-broadway/",
  "publishDate": "2025-12-08",
  "fullText": "Broadway Review | &#8216;Marjorie Prime&#8217; ages into something unsettling on Broadway By Matt Windman Posted on December 21, 2025 June Squibb and Cynthia Nixon in &#8220;Marjorie Prime&#8221; on Broadway. Photo by Joan Marcus/provided In “ Marjorie Prime ,” grief comes with customer service. Jordan Harrison’s quietly piercing drama, now receiving its long-awaited Broadway premiere, imagines a future where memory is a product, comfort can be outsourced, and the return policy is anything but clear. Broadway has seen no shortage of shows grappling with artificial intelligence, mortality, and what remains of us after we’re gone. What distinguishes “Marjorie Prime” is how quietly and devastatingly it arrives at its conclusions. First staged Off-Broadway in 2015 in a production starring Lois Smith, and later adapted into a 2017 film with Jon Hamm, the play has aged from speculative provocation into recognition. Close Get amNY in your inbox! News, events, culture and more — delivered to you. Thank you for subscribing! Email Sign Up When “Marjorie Prime” premiered a decade ago, its technology felt abstract and futuristic. Today, it feels incremental. Artificial intelligence is no longer a novelty; it is fluent, responsive, and embedded in daily life. What once played as a cautionary “what if” now lands as a question of habit: not whether we would use such technology, but why we already do. Christopher Lowell and June Squibb in &#8220;Marjorie Prime&#8221; on Broadway. Photo by Joan Marcus/provided Set in the not-so-distant future, “Marjorie Prime” unfolds in a sunlit living room where technology hums discreetly in the background and grief does the heavy lifting. The four-person cast is deceptively simple but formidable. June Squibb—now 96—stars as Marjorie, an 85-year-old widow whose memory is beginning to fail. Cynthia Nixon plays her tightly wound daughter Tess; Danny Burstein is Jon, Tess’s husband and the family’s emotional mediator; and Christopher Lowell appears as Walter, who seems at first to be Marjorie’s late husband in his prime. “Marjorie Prime” is deliberately coy about who is human and who is artificial, often allowing scenes to unfold before clarifying whether a character is real or a “Prime.” The ambiguity is not a trick but a condition of Harrison’s world—one in which emotional authenticity matters more than biological origin, and memory is already porous. Only gradually does the truth come into focus: Walter is a Prime, a holographic reconstruction designed to preserve—and gently curate—memory. He exists to remind Marjorie of her past, though not necessarily as it happened. Walter doesn’t merely recall Marjorie’s history; he learns it selectively. Details are nudged, softened, occasionally improved. Danny Burstein and Cynthia Nixon in &#8220;Marjorie Prime&#8221; on Broadway. Photo by Joan Marcus/provided Director Anne Kauffman, returning to the play she first staged a decade ago, keeps the focus squarely on the human cost of these edits. The technology itself is never flashy; it simply exists, like Wi-Fi or central air. The real drama plays out among the living. #placement_551839_0_i{width:100%;max-width:550px;margin:0 auto;} var rnd = Math.floor(Math.random()*10e6); var pid551839 = rnd; var plc551839 = window.plc551839 || 0; var abkw = window.abkw || ''; var absrc = 'https://ads.empowerlocal.co/adserve/;ID=181918;size=0x0;setID=551839;type=js;sw='+screen.width+';sh='+screen.height+';spr='+window.devicePixelRatio+';kw='+abkw+';pid='+pid551839+';place='+(plc551839++)+';rnd='+rnd+';click=CLICK_MACRO_PLACEHOLDER'; var _absrc = absrc.split(\"type=js\"); absrc = _absrc[0] + 'type=js;referrer=' + encodeURIComponent(document.location.href) + _absrc[1]; document.write(' '); Squibb delivers a performance that would be remarkable at any age, distinguished by its precision. Her Marjorie is sharp, flirtatious, vain, frightened, and funny—often within the same scene. She never sentimentalizes cognitive decline, treating it instead as another condition of being, one that exposes old tensions even as it erodes the capacity to confront them. Nixon gives one of her finest performances to date as Tess, a woman whose intelligence has calcified into armor. Burstein provides the production’s emotional ballast as Jon, the peacemaker whose kindness repeatedly places him at the center of impossible decisions. Lowell navigates the trickiest assignment as Walter Prime, making him warm, attentive, and just human enough to lull both Marjorie and the audience into forgetting what he is. googletag.cmd.push(function() { googletag.display('amny_content_responsive_1'); }); A decade ago, “Marjorie Prime” felt prescient. Today, it feels personal. In a culture increasingly eager to outsource discomfort, this quiet, unsettling play asks what we lose when we do—and whether comfort, once commodified, can ever truly be returned. Hayes Theater, 240 W. 44th St., 2st.com . Through Feb. 15. About the Author",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 68,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:03:01.901Z"
}
