{
  "showId": "marjorie-prime-2025",
  "outletId": "daily-beast",
  "outlet": "The Daily Beast",
  "criticName": "Tim Teeman",
  "url": "https://www.thedailybeast.com/obsessed/june-squibb-96-delivers-acting-tour-de-force-in-marjorie-prime/",
  "publishDate": "December 8, 2025",
  "fullText": "In a triumphant, surely award-worthy role, Squibb—who was Oscar-nominated for her role in Nebraska, and recently starred in the movie Thelma—not only shows that advanced age is no barrier to brilliance; her impressively composed performance is a sharp reminder to everyone younger not to shirk or sit around&#8230;Book a ticket right now to see Squibb break the rules in the best way possible.",
  "isFullReview": false,
  "dtliExcerpt": "First and most formidably brilliant, there is June Squibb.\n\nIn Marjorie Prime (2nd Stage at the Hayes Theater), Squibb is conducting nothing less than a supreme acting masterclass, playing two variations of her character Marjorie: an 85-year-old woman nearing the end of life with both a flickering grip and memory of times past, alongside a no-BS sharpness about that past and the present that surrounds her.\n\nAfter Marjorie dies, Squibb—herself 96—plays Marjorie's tech avatar, a so-called Prime (hence the title of the play), an AI, computer-programmed version of a human that lives on to ostensibly offer comfort and presence to loved ones after death. Finally, in Jordan Harrison's play, in a softly lit afterlife, Marjorie is reunited with other loved ones, all now transformed into Primes enjoying some downtime in a heavenly realm that looks very familiar on Lee Jellinek's very domestic set.\n\nIn a triumphant, surely award-worthy role, Squibb—who was Oscar-nominated for her role in Nebraska, and recently starred in the movie Thelma—not only shows that advanced age is no barrier to brilliance; her impressively composed performance is a sharp reminder to everyone younger not to shirk or sit around.\n\nSquibb's excellence is matched in the performances of Cynthia Nixon as Marjorie's daughter Tess, Danny Burstein as Tess' husband Jon (and husband of the year material at that!), and Christopher Lowell as the Prime younger version of her husband Walter.\n\nMarjorie's final chapter of life and later Prime incarnation serve as a means for the characters to explore grief, mortality, memory, responsibility, and, at its heart, what the substance and point of living a life—of being a parent, partner, or child—really mean.\n\nSquibb's Marjorie contains multitudes, and Squibb shows them all so tangibly and without airs that her character feels recognizably real right from the beginning of the play. She may be ailing, but in Squibb's compelling rendering—under Anne Kauffman's fine, sensitive direction—we see that Marjorie is not to be wrapped in cotton wool or patronized.\n\nIn this sense, she is like Thelma in Thelma; Squibb's skill is to make us see the characters she plays as people, rather than facsimile older people. We laugh at her dry wit (her first laugh line in Marjorie Prime is complaining about the peanut butter Tess buys), are moved by her memories, and listen intently to every word she says.\n\nIn the play's opening scene, she is talking to Lowell, a markedly younger-looking man called Walter. Initially, you worry: his arch tone and her warmth are jarring; is this an age-gap relationship with some element of exploitation?\n\nBut soon, past tenses and shared memories and Marjorie calling Tess their daughter point to something else: Is she imagining the younger spirit of her much-missed dead husband? And then, the existence of the Prime is revealed.\n\nThe Primes work in a simple way. \"The more you talk, the more human it gets,\" as Jon puts it. Much of the play looks at the intimacy the Primes offer; how a Prime converses equably to soften older pains (of family suicide and present-day child estrangement), or more jagged personal relationships.\n\nWalter's Prime is his youngest, most handsome self; Marjorie's is lovelier and kinder to Tess—they get on so much better—than in their real life.\n\nMarjorie's Prime gives space to Tess to say to her mother all the things she loved and recalled about her. As a Prime, Marjorie is transformed into a micro-chipped empath and listener. It is as seductive as it is plain weird.\n\nA later twist in the play, which will go unrevealed here, digs into the thorniness of this dead-and-alive dialogue—that, stripping away all the warmth of this reconfigured dead person, Primes are not real people; that they offer a semblance of family and intimacy, but they are not your loved one. And what they are offering is a kind of toxic balm, one that locks you in perpetually revolving doors of grief and nostalgia at the expense of moving forward.\n\nBurstein shows how even the endlessly supportive Jon has his limits, feeling increasingly desperate as Tess sinks further into a melancholic rabbit hole. Nixon has the toughest role on stage: a caring daughter becoming more careworn, as her silent resentments mount.\n\nTess is growingly convinced that aging is just a cycle with a known, bad end—losing control, going for dinner with friends, talking about the weather, over and over again until death. She cannot stand the idea.\n\nWhat Jon can stand, or what he will accept, is the play's final thicket of complication. He isn't sure he wants the demi-humanness of the Primes around him, and the final scene featuring a trio of them—so calm and gentle on the surface—speaks to a telling, if unspoken, absence on stage.\n\nMarjorie Prime asks why and how we should accept our passage through life and path to death—and it does so with a witty directness alongside a sense of wrenching inquiry and elegy. Is it all over when we die, asks the play? And even as it proffers the possibility of comfort provided by a tech-rejuvenated loved one, it quietly answers itself: Maybe it should be.\n\nAt the play's heart is the dazzlingly adept Squibb. Her Marjories (real and Prime) are measured, funny, vulnerable, and tough—two colorful, intriguing human portraits.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Up"
}