{
  "showId": "marjorie-prime-2025",
  "outletId": "ny-stage-review",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2025/12/08/marjorie-prime-a-very-real-exploration-of-memory-and-loss-powered-by-ai/",
  "publishDate": "December 8, 2025",
  "fullText": "A superb cast of four anchors Jordan Harrison's future-set drama.\n\nI'm reluctant to use the words \"trigger warning\" in reference to a show that many people haven't yet seen; sometimes those words prevent viewers from fully immersing themselves in a revelatory evening of theater. But in the case of Jordan Harrison's Marjorie Prime, which just opened at Broadway's Hayes Theater, it can't hurt to prepare yourself for this 90-minute emotional avalanche of a production. If you've ever watched a friend or family member deteriorate due to age and/or protracted illness, losing bits of their personality and memory each day as you desperately try to help them retain some sense of normalcy and routine, this show will hit you where it hurts.\n\nMarjorie (Oscar nominee and Broadway vet June Squibb, sublime) is 85 years old and clearly fading, despite the doting efforts of her tightly wound daughter, Tess (Cynthia Nixon, perfectly cast), and easygoing son-in-law Jon (Danny Burstein, who's never been better). Relaxing in her overstuffed recliner, mouthing off playfully, Marjorie could be your mother or your grandmother. The big difference: It's the year 2062, and Marjorie's most devoted companion is a Prime—a holographic projection of her late husband, Walter, in his 30s. He's played by Christopher Lowell, and though the character is a product of artificial intelligence, there's nothing creepy or stereotypically robotic about him at all.\n\nAfter debuting in 2014 at the Mark Taper Forum, Marjorie Prime had its New York premiere at Playwrights Horizons in 2015; a 2017 film featured Jon Hamm as Walter and Lois Smith reprising her stage role as Marjorie. A decade ago, the play seemed like a fascinating experiment. This remarkable revival, once again directed by Anne Kauffman, feels so much more potent. Perhaps it's because we're so much more conversant with AI today.\n\nThe pragmatic Tess is suspicious, and maybe a bit jealous, of Walter Prime. \"It bothers me that you're helping it be my dad—or some weird fountain of youth version of him,\" she tells Jon. Meanwhile, Jon doesn't see the harm in keeping Marjorie's memories alive, or in giving Walter details that could awaken additional memories. \"You'd rather just let everything slip away?\" he asks. \"How much does she have to forget before she's not your mom anymore?\"\n\nA Prime—and we meet more than one in the play—can serve many functions: companion, therapist, confessor… anything you need it to be. Which begs the question: Would you want your loved one to have a Prime? Would you want one for yourself? The technology, presumably, is still decades and decades away; in the meantime, how do we capture and hold those precious moments we're in danger of losing? I keep returning to something Tess says: \"I don't know how memory works. I think of it like sedimentary layers in the brain, but I'm sure that's wrong.\" Jon likes the concept: \"It means it's all still there.\" I can see it.",
  "isFullReview": true,
  "dtliExcerpt": "After debuting in 2014 at the Mark Taper Forum, Marjorie Prime had its New York premiere at Playwrights Horizons in 2015; a 2017 film featured Jon Hamm as Walter and Lois Smith reprising her stage role as Marjorie. A decade ago, the play seemed like a fascinating experiment. This remarkable revival, once again directed by Anne Kauffman, feels so much more potent. Perhaps it's because we're so much more conversant with AI today. We're that much closer to achieving this concept that Harrison imagined. Or perhaps it's because the technology is less important than the humanity of it all. The Walter onstage is first and foremost Marjorie's late husband; the fact that he's not flesh and blood is almost immaterial.",
  "originalScore": "5/5",
  "assignedScore": null,
  "source": "playwright-scraped",
  "scrapedAt": "2026-01-23T19:00:00.000Z",
  "bwwThumb": "Up",
  "dtliThumb": "Up",
  "bwwUrl": "https://nystagereview.com/2025/12/08/marjorie-prime-a-very-real-exploration-of-memory-and-loss-powered-by-ai/",
  "bwwExcerpt": "After debuting in 2014 at the Mark Taper Forum, Marjorie Prime had its New York premiere at Playwrights Horizons in 2015; a 2017 film featured Jon Hamm as Walter and Lois Smith reprising her stage role as Marjorie. A decade ago, the play seemed like a fascinating experiment. This remarkable revival,...",
  "textStatus": "complete"
}
