{
  "showId": "marjorie-prime-2025",
  "outletId": "NYSR",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2025/12/08/marjorie-prime-the-future-is-now/",
  "publishDate": "2025-12-08",
  "fullText": "December 8, 2025 9:30 pm Marjorie Prime: The Future is Now By Frank Scheck ★★★★★ June Squibb, Cynthia Nixon and Danny Burstein in this Broadway revival of Jordan Harrison&#039;s sci-fi-tinged drama. June Squibb in Marjorie Prime. Photo credit: Joan Marcus When Marjorie Prime first appeared off-Broadway ten years ago, it seemed like speculative science fiction. Surely, artificial creations couldn’t possibly stand in for deceased loved ones with whom we’re desperate to reconnect. It was a provocative idea, but too fanciful to be taken seriously. Now, in a time when people are contentedly foregoing real relationships in favor of AI-generated ones, Jordan Harrison’s play seems downright dated. It also seems sharper, more resonant, and more deeply poignant in the current Broadway revival once again directed by Anne Kaufman. Partly this is due to its first-rate cast including June Squibb, miraculously still treading the boards at age 96. And on a personal note, perhaps it’s also due to my having experienced personal losses in the last decade that made the play hit home in a more profound way. [ Read Melissa Rose Bernardo’s ★★★★★ review here. ] Set in a nondescript suburban home nearly entirely colored in pastel shades of green (Lee Jellinek did the set design), the play begins with a living room discussion between Marjorie (Squibb) and her handsome husband Walter (Christopher Lowell). It’s immediately apparent that something is a bit off, since Walter is more than a half-century younger than his wife. It turns out that Walter is in fact Walter Prime, an artificial creation who’s there to comfort Marjorie in her declining years, provided by her daughter Tess (Cynthia Nixon) and son-in-law Jon (Danny Burstein), with whom she lives. Having not yet lapsed into dementia, Marjorie is well aware that the person in front of her is not the man she married, especially when he makes mistakes concerning the facts of their life together. But she’s quite indulgent, even if his nose doesn’t look exactly as she remembers it. “You’re a good Walter, though, either way,” she says to reassure him. As the play progresses, tragedies ensue and other characters are replaced by artificial beings. It becomes clear that this is how people in the probably not so distant future cope with the loss of loved ones. It also provides the opportunity to communicate with them in perhaps better fashion than when they were alive, especially since the Primes are non-judgmental and very good listeners. They’re eager to soak up information about their real-life counterparts. And they’re endlessly patient. “I have all the time in the world,” more than one Prime assures their humans. The ingenious conceit by the playwright (who imaginatively explored similar themes in his play The Antiquities ) provides the opportunity to ponder, among other things, the indignities of aging, the unreliance of memory, the devastating effects of loss, and the intangible nature of relationships. The play does so with wit and humor, but also with wrenching emotionality. Squibb is the marquee draw, proving once again that she’s become a national treasure (check out her wonderful performance in the recent film Eleanor the Great ). She doesn’t miss a beat onstage, displaying the engaging feistiness of her screen persona but also conveying the pain of someone painfully aware of her physical and mental decline. She’s funny as well, delivering her lines with well-honed comic timing. And her sotto voce rendition of Beyonce’s “Single Ladies (Put a Ring on It)” is worth the ticket price itself. Nixon and Burstein are also superlative, with the former making us fully aware of the lingering trauma suffered by her brittle, sometimes unsympathetic character who’s desperate to be a better mother to her children than Marjorie was to her, but finding that it isn’t so easy. Burstein brings his natural warmth to his role, especially in an emotionally devastating scene toward the end of the play that makes clear the limits of artificial intelligence to replace human relationships. Lowell has less to do, but excellently conveys the frustrated efforts of a Prime desperately attempting to be as human as possible but not quite succeeding. Ending with a haunting final scene in which it becomes apparent that the Primes can function quite effectively without us, Marjorie Prime is very much a play for our times. Unfortunately. Marjorie Prime opened December 8, 2025 at the Helen Hayes Theater and runs through February 15. Tickets and information: 2st.com -->",
  "originalScore": null,
  "assignedScore": 95,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:03:10.226Z"
}