{
  "showId": "marjorie-prime-2025",
  "outletId": "NYTG",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "http://www.newyorktheatreguide.com/reviews/marjorieprime15.htm",
  "publishDate": "2025-12-08",
  "fullText": "'Marjorie Prime' Broadway review — June Squibb, Cynthia Nixon-led revival hums like a fine-tuned machineRead our review of Marjorie Prime on Broadway, a revival of Jordan Harrison's drama starring June Squibb, Cynthia Nixon, Danny Burstein, and Christopher Lowell.SummaryMarjorie Prime is a family drama about an elderly widow who receives a hologram of her late husband to help jog her failing memoryThe play features strong performances from June Squibb; Danny Burstein; Christopher Lowell; and a standout Cynthia NixonAudiences have praised how the play's themes of technology and AI have only gotten more relevant since it was written in 2014The show is recommended for fans of family dramas; shows with starry ensemble casts; and playwright Jordan Harrison's other workJoe DziemianowiczDecember 8, 2025, 00:00From power-on to shutdown, the compact family drama Marjorie Prime runs just 85 minutes. But there’s nothing small about the themes Jordan Harrison explores in his 2014 play about memories, identity, mortality, and the role of artificial intelligence in that mix. The new production with June Squibb and Cynthia Nixon as mother and daughter marks both the play’s and the author’s Broadway debut. It’s a perceptive and prescient talker. The play’s once-futuristic ideas are rapidly becoming real, from interactive AI avatars to simulations of deceased loved ones. But for all its clairvoyance and foresight about technology, Marjorie Prime’s most potent superpowers are its sensitivity and tenderness. Harrison’s spare, gently gripping script is a model of eloquent economy as the characters grapple with grief and what it means to truly love and remember someone. In the not-so-distant future, 85-year-old Marjorie (Squibb) is losing her memory. She’s given a “Prime,” a holographic companion modeled on her late husband, Walter, at 30. He’s built from curated memories — the happy ones, mostly — supplied by her daughter Tess (Nixon) and son-in-law Jon (Danny Burstein, reliably excellent). As Marjorie bonds with Walter Prime (Christopher Lowell), she begins reshaping their past, tweaking truth and invention. Other Primes eventually appear, the cycle repeats, and the memories evolve. Director Anne Kauffman, who staged the play’s 2015 Off-Broadway run, has assembled an A-list ensemble that hums like a finely tuned machine. The drama is a showcase for its women, with Squibb — newly 96 and last seen on Broadway in Waitress — infusing Marjorie with an irresistible, vinegary sass. Nixon, a two-time Tony winner with 45 years of Broadway experience, is without question in her prime: wry, vulnerable, and conflicted as Tess, who struggles to connect with the real Marjorie and her Prime. In a play that now hit me fathoms deeper than it did a decade ago, hers is the performance I can’t get out of my head. Marjorie Prime summary Marjorie Prime follows an elderly woman who receives a \"Prime,\" a hologram of her late husband, to help revive her failing memory. At its core, the play is a melancholy family drama about grief, memory and identity that asks what it means to remember someone, and whether technology can or should try to replicate our losses. A 2015 Pulitzer Prize finalist for drama, Marjorie Prime was adapted into a 2017 movie starring Lois Smith and Jon Hamm. What to expect at Marjorie Prime Harrison doesn’t directly specify a date for the play, but he drops breadcrumbs in the script. We learn early on that Marjorie is 85 and later learn she was born in 1977. Do the math, and it’s 2062, though the scenic design by Lee Jellinek looks like today. A verdant theme flows through the set, from wallpaper to upholstered seating. It’s like a green screen, a space awaiting meaning. In the final moments, the space transforms in a curious, slightly disquieting way. What audiences are saying about Marjorie Prime As of publication, the play has an 83% ranking on the review aggregator Show Score. The script, acting, and forward-thinking themes all clicked with theatregoers. “So well acted. Perfect length. So much to think about afterward. I went in mostly cold but it felt like a Twilight Zone episode.” - Show-Score user RemaD “Hard to believe this play was written in 2014, it is so prescient in anticipating what tech & AI advances would be like in the future and how it would change our lives [...] It’s funny, sad, poignant and the acting is great.” - Show-Score user Stephen18 “It’s a very humanistic story about technology, grief, and memory [...] The ending scene lagged a bit and could probably use some fine-tuning, so ended on a bit of a flat note, but overall thoroughly enjoyed.” - Show-Score user Margaret 411 “This script has aged phenomenally well considering it was written when we were all adjusting to the idea of Siri and now chatgbt rocks the masses to sleep.” - Show-Score user bluesundays Read more audience reviews of Marjorie Prime on Show-Score. Who should see Marjorie Prime Fans of family dramas will appreciate the play’s approach to the time-honored genre amid the state of current-day technology. Fans of Jordan Harrison’s work, including Maple and Vine and 2025's The Antiquities, who missed Marjorie Prime’s Off-Broadway run will want to catch it now. Audience members who’ve already seen it will enjoy how it lands today. Audiences who appreciate fine-tuned ensemble acting — with four stars with stage and screen cred — will want to see how all these parts come together. Fans of June Squibb, Cynthia Nixon, Danny Burstein, and Christopher Lowell will want to see the show. Each gets moments to shine bright. Learn more about Marjorie Prime on Broadway Jordan Harrison puts AI-powered intelligence center stage, but the ace cast generates real-deal emotions. Learn more and get Marjorie Prime tickets on New York Theatre Guide. Marjorie Prime is at the Hayes Theater through February 15. Photo credit: Marjorie Prime on Broadway. (Photos by Joan Marcus)Frequently asked questionsWhere is Marjorie Prime playing?Marjorie Prime is playing at Hayes Theater. The theatre is located at 240 West 44th Street, New York, 10036.How long is Marjorie Prime?The running time of Marjorie Prime is 1hr 30min. No Intermission.How do you book tickets for Marjorie Prime?Book tickets for Marjorie Prime on New York Theatre Guide.What is Marjorie Prime about?Marjorie Prime is an intelligent and probing drama about the curiosity and cost of Primes: human-like robots who take the place of the deceased so they never have to die.Who wrote Marjorie Prime?Jordan Harrison, who has written for Orange Is the New Black, wrote this play, which was a Pulitzer Prize finalist.Who directs Marjorie Prime?Anne Kauffman (The Bedwetter, Mary Jane) returns to direct this show after doing so off Broadway.Is Marjorie Prime good?The play is a Pulitzer finalist, sparked a Jon Hamm-led film, and was called \"beautiful\" by New York Magazine.Is Marjorie Prime appropriate for kids?The show explores darker themes like loss; Broadway audiences must be four and up to see shows.Originally published on Dec 8, 202521:30",
  "isFullReview": true,
  "bwwExcerpt": "he imagined, but perhaps some of the novelty has worn off, because the characterizations seem less sharp and the vibe more “Invasion of the Body Snatchers” unsettling than I remember feeling before. Joe Dziemianowicz, New York Theatre Guide: But for all its clairvoyance and foresight about technology, Marjorie Prime’s most potent superpowers are its sensitivity and tenderness. Harrison’s spare, gently gripping script is a model of eloquent economy as the characters grapple with grief and what it means to truly love and remember someone. Chris Jones, The New York Daily News: Nixon’s Tess is vulnerable enough for you to sense the fear in her eyes, but this is an actress with a steely core and, indeed, Nixon turns on a dime when her character realizes, as I think many of us have or will, that this brave new world is short on both guardrails and moral principles. Burstein is equally effective as husband Jon, his warm eyes dancing with empathy, although we are not always so sure about that",
  "originalScore": null,
  "assignedScore": 80,
  "source": "bww-roundup",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:03:12.529Z",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-MARJORIE-PRIME-Opens-On-Broadway-20250116",
  "textStatus": "complete",
  "textWordCount": 1135,
  "archivePath": "data/archives/reviews/marjorie-prime-2025/nytg--joe-dziemianowicz_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:09:35.061Z",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.978Z",
  "showScoreExcerpt": "\"This is a play of ideas and, as such, there is more discourse than there is dramatic action, and characterizations do not run especially deep...Time is intentionally fluid in this work but, under Anne Kauffman’s otherwise thoughtful direction, leaps of many years feel more disjointed than they should be.\"",
  "textQuality": "full",
  "sourceMethod": "bww-roundup",
  "scoreSource": "sentiment-positive",
  "scoreConfidence": "medium"
}