{
  "showId": "marjorie-prime-2025",
  "outletId": "observer",
  "outlet": "Observer",
  "criticName": "David Cote",
  "url": null,
  "publishDate": "2025-12-08T21:43:17-05:00",
  "fullText": "Still relevant after its world premiere at Playwrights Horizons, the 90-minute chamber drama sparkles and unsettles in its Broadway debut, positing that holographic avatars will remember us after we’re gone, airbrushing life’s sorrow and complexity from every snapshot. In 2025, such a message is not ahead of its time, but perfectly punctual.        Average Rating: 84.7% {   \"@context\":\"https://schema.org\",   \"@type\":\"LiveBlogPosting\",   \"@id\":\"/article/Review-Roundup-MARJORIE-PRIME-Opens-On-Broadway-Starring-Cynthia-Nixon-June-Squibb-Danny-Burstein-and-More-20251208\",   \"about\":{     \"@type\":\"Event\",     \"startDate\":\"2025-12-08T09:43:17-05:00\",          \"name\":\"Review Roundup: MARJORIE PRIME Opens On Broadway Starring Cynthia Nixon, June Squibb, Danny Burstein and More\",            \"eventAttendanceMode\": \"https://schema.org/OnlineEventAttendanceMode\",       \"location\": {         \"@type\": \"VirtualLocation\",         \"url\": \"/article/Review-Roundup-MARJORIE-PRIME-Opens-On-Broadway-Starring-Cynthia-Nixon-June-Squibb-Danny-Burstein-and-More-20251208\"         }     },   \"coverageStartTime\":\"2025-12-08T09:43:17-05:00\",      \"coverageEndTime\":\"2025-12-09T12:43:17-05:00\",   \"headline\":\"Review Roundup: MARJORIE PRIME Opens On Broadway Starring Cynthia Nixon, June Squibb, Danny Burstein and More\",      \"description\":\"Marjorie Prime, the existential drama from Jordan Harrison, opens tonight at the Helen Hayes Theater, directed by Anne Kauffman. The production stars Danny Burstein, Christopher Lowell, Cynthia Nixon, and June Squibb in the title role of Marjorie Prime. \",   \"liveBlogUpdate\":[     {       \"@type\":\"BlogPosting\",       \"headline\":\"The New York Times - ‘Marjorie Prime’ Review: A.I. Gave Her Back Her Husband. Was It Worth It?\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"CRITIC'S PICK. Harrison has a dream collaborator in Kauffman, who is a master at creating emotion without hitting an audience over the head. Her approach looks as if it is detached, almost clinical, but that only means she does not overplay her hand when navigating emotional stakes. This was obvious in her last Broadway outing, the quietly devastating “Mary Jane” (2024), and so it is here, with all four actors marvelously economical — an approach that does not necessarily win awards but that lingers in audience members’ hearts and minds.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Vulture - Return of the Replicants: Marjorie Prime\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"In our present reality, with the floodwaters of AI slop licking at the rolled cuffs of our pants, it’s a pretty sure bet that Second Stage’s elegant revival of Harrison’s play will be applauded for its (then) prescience and (now) timeliness. Yet watching Marjorie Prime — staged on Lee Jellinek’s set of crisp angles, with its green hues engineered for tranquility, by Anne Kauffman, who directs with spare, delicate rigor, as if she’s conducting Arvo Pärt’s Spiegel im Spiegel — I kept waiting to feel … well, more. More rapt, more heartbroken, more rattled by the harrowing questions presented by the long, slow, terribly seductive suicide humanity seems bent on carrying out via technology. Harrison is a formidable craftsman and Marjorie Prime is built very well, but in a way it resembles one of its own artificial humans: It’s an extremely palatable version of the thing. It has studied how to be a play, and it’s a good one — if only the feeling of study weren’t quite so palpable in that goodness. If only it didn’t place so much value on the neatness of its own construction.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Time Out New York - Marjorie Prime\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"Much of the pre-opening press about this revival has revolved around the 96-year-old Squibb, who might be the oldest actor ever to play a principal role on Broadway. She merits that attention with a remarkable performance that combines frostiness and fogginess into a firm coat of rime. But the other actors are equally good. Burstein, who radiates human tenderness, is perfectly employed as the play’s kindest character, and his final scene is devastating; Lowell finds the appropriate levels of stiffness and charm for his faux Walter. And Nixon is simply the best I’ve ever seen her onstage: As Tess labors to connect with her mother—or alternatively to give up any hope of connecting with her—Nixon invests her testiness with complex underlying notes of bitterness and exhaustion.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - Marjorie Prime: The Future is Now\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"It also seems sharper, more resonant, and more deeply poignant in the current Broadway revival once again directed by Anne Kaufman. Partly this is due to its first-rate cast including June Squibb, miraculously still treading the boards at age 96. And on a personal note, perhaps it’s also due to my having experienced personal losses in the last decade that made the play hit home in a more profound way.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Theatrely - June Squibb Finds Post-AI Humanity in MARJORIE PRIME — Review\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"Harrison’s drama is equally poignant, not only in its thematic conceit and narrative scope but in its beautiful turns of phrase: “I don’t have to get better. Just keep me from getting worse,” Marjorie begs of her Prime. The production is equally delicate, with Lee Jellinek’s Palm Springs-style home set pulling off a simple, bravura gesture in the play’s final moments, aided by Ben Stanton’s lighting and Daniel Kluger’s sound design. The clothes which Márion Talán de la Rosa has designed for Squibb are enviably cozy.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The New York Post - ‘Marjorie Prime’ review: June Squibb is a marvel in an early highlight of the Broadway season\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"Harrison’s story is topical, that’s for sure. Frighteningly so. What elevates it above the ripped-from-the-headlines hackery of, say, so many political dramas co-written by Wikipedia is that it’s also profoundly human and lump-in-the-throat relatable without ever toppling over into boo-hoo sentimentality. The play exposes its audience’s emotional weaknesses like few others do. I reckon that most ticket-buyers will silently ask themselves if they would buy a Prime if they had the chance. And they’d probably be uncomfortable with their honest answer.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Guardian - Marjorie Prime review – Cynthia Nixon steals sad, and spotty, sci-fi revival\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"Harrison, in his poetic but sometimes cliched language, suggests it is a little bit of both. Our time on Earth is terribly fleeting, and isn’t that sad? But also some part of us does linger on in those who knew us, those who tell our stories, who reach fondly for us in moments of nostalgia. If tech can somehow aid in that, perhaps we should let it. Marjorie Prime is frustratingly ambivalent about that idea, tossing it around and wanly entertaining both sides of the argument before it ventures off into what perhaps interests Harrison more. With its tech conceit set aside, Marjorie Prime is mostly a story of trauma echoing through generations of a family, which is a quite common theme within the American theater canon.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Entertainment Weekly - Marjorie Prime review: June Squibb stars in a sci-fi family drama with more questions than emotions\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"For all the grief boiling over in Marjorie Prime, I walked away yearning to be more thoroughly wounded. But Harrison's script is less interested in piercing the heart than it is the mind. It's much too busy prodding at the bounds of humanity. What makes us who we are? How much can we rely on technology? Can it soothe us, numb us, replace us completely? Marjorie Prime offers few clear-cut answers, but does make one thing clear: There is no replacement for the power of human love and connection. And the absence of that is what keeps this show from truly leaving a mark on its crowd. Grade: B\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"One-Minute Critic - June Squibb in ‘Marjorie Prime’ asks if AI can ease grief or just complicate it\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"June Squibb and a superb company turn Marjorie Prime into an acting masterclass about mortality, memory, and why we love. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Cititour - Marjorie Prime\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"Unsurprisingly, Harrison has more questions and conundrums to pose in this taut 80-minute play about the trials of aging and the nature of memory. But the work (a finalist for the Pulitzer Prize) is more than a mere intellectual exercise or adventure in science-fiction. (If you are a movie nut and very good at math, you’ll realize the work is actually set in 2062.) It’s a decidedly human drama. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - Marjorie Prime: The Future is Now\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"Squibb is the marquee draw, proving once again that she’s become a national treasure (check out her wonderful performance in the recent film Eleanor the Great). She doesn’t miss a beat onstage, displaying the engaging feistiness of her screen persona but also conveying the pain of someone painfully aware of her physical and mental decline. She’s funny as well, delivering her lines with well-honed comic timing. And her sotto voce rendition of Beyonce’s “Single Ladies (Put a Ring on It)” is worth the ticket price itself. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - Marjorie Prime: A Very Real Exploration of Memory and Loss, Powered by AI\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"After debuting in 2014 at the Mark Taper Forum, Marjorie Prime had its New York premiere at Playwrights Horizons in 2015; a 2017 film featured Jon Hamm as Walter and Lois Smith reprising her stage role as Marjorie. A decade ago, the play seemed like a fascinating experiment. This remarkable revival, once again directed by Anne Kauffman, feels so much more potent. Perhaps it’s because we’re so much more conversant with AI today. We’re that much closer to achieving this concept that Harrison imagined. Or perhaps it’s because the technology is less important than the humanity of it all. The Walter onstage is first and foremost Marjorie’s late husband; the fact that he’s not flesh and blood is almost immaterial. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Theater - Marjorie Prime Broadway Review\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"What’s most uncanny for me about “Marjorie Prime,” though, is that the new production, especially the ending, struck me as having been revised, not necessarily for the better. Yet it turns out that the script is exactly the same (I still have the old one; I went back and checked it.) The director and most of the design team are the same as well. The show is being billed as a look at “memory, loss and AI” — I didn’t realize it would be a look at my memory too. There is still much in the play that I find clever and thought-provoking. The starry four-member cast keeps us engaged.  Harrison is nothing if not prescient in the world he imagined, but perhaps some of the novelty has worn off, because the characterizations seem less sharp and the vibe more “Invasion of the Body Snatchers” unsettling than I remember feeling before.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Theatre Guide - 'Marjorie Prime' Broadway review — June Squibb, Cynthia Nixon-led revival hums like a fine-tuned machine\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"But for all its clairvoyance and foresight about technology, Marjorie Prime’s most potent superpowers are its sensitivity and tenderness. Harrison’s spare, gently gripping script is a model of eloquent economy as the characters grapple with grief and what it means to truly love and remember someone. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The New York Daily News - BROADWAY REVIEW: ‘Marjorie Prime’ revival prescient in age of AI\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"Nixon’s Tess is vulnerable enough for you to sense the fear in her eyes, but this is an actress with a steely core and, indeed, Nixon turns on a dime when her character realizes, as I think many of us have or will, that this brave new world is short on both guardrails and moral principles. Burstein is equally effective as husband Jon, his warm eyes dancing with empathy, although we are not always so sure about that, given his programming skills. “Am I supposed not to notice she is being nicer to that thing than me?” Tess snaps at one point, bringing up another salient A.I. issue.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Wrap - ‘Marjorie Prime’ Broadway Review: Cynthia Nixon and June Squibb Make the Case for Everybody Becoming a Robot\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"At its core, “Marjorie Prime” tells a simple kitchen-sink story of two adults trying to care for an aging relative. Harrison tries to up the ante by dipping into his gothic drawer of horrors to deliver not one but two suicides that push the human narrative into the contrived. In the end, the machines are more honest than the humans and, better yet, there’s none of the angst.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Observer - Review: ‘Marjorie Prime’ Tracks the Ghost in the Machine of Artificial Intelligence\",       \"datePublished\":\"2026-01-01T07:04:46-05:00\",         \"articleBody\": \"Still relevant after its world premiere at Playwrights Horizons, the 90-minute chamber drama sparkles and unsettles in its Broadway debut, positing that holographic avatars will remember us after we’re gone, airbrushing life’s sorrow and complexity from every snapshot. In 2025, such a message is not ahead of its time, but perfectly punctual.\"     }             ] }",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-MARJORIE-PRIME-Opens-On-Broadway-Starring-Cynthia-Nixon-June-Squibb-Danny-Burstein-and-More-20251208"
}