{
  "showId": "marjorie-prime-2025",
  "outletId": "pagesonstages-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.com/2025/12/14/marjorie-prime/",
  "publishDate": null,
  "fullText": "Marjorie Prime – 13 December 2025 Published in 2015, Marjorie Prime is built on the premise that a person who is dying could have an artificial intelligence companion who is taught some things about the life of a loved one and learns new things as it interacts with the dying human. These primes, as they’re called, exist to keep the human company as well as help the human resolve issues with a person they love so they can have answers and peace. This frees up the people in that human‘s life to continue having their own lives as they comfort and take care of the dying. The story opens with Marjorie (June Squibb), an elderly woman interacting with Walter Prime (Christopher Lowell), the embodiment of a young version of her deceased husband. Her daughter, Tess (Cynthia Nixon) has ethical questions about the use of primes and is reassured by her husband, Jon (Danny Burstein). As time marches relentlessly on, Tess finds herself talking to Marjorie Prime, and Jon finds himself talking to Tess Prime. In a chilling closing scene, the primes are seen talking to each other and sharing information. Each has been told a small lie in the process of its creation, and the others are beginning to learn things that the humans deliberately wanted to leave out of the primes’ programming. It is no secret that in today’s world all of our data is shared with many entities that we don’t even know about. Marjorie Prime is the best, tightest, most well written, thought provoking, absolutely brilliant 90 minutes that I’ve seen on Broadway in a very long time. It is deeply relevant and haunting in its possibility. Marjorie Prime raises burning questions about the ethics of AI, whether or not truth is a necessity, the freedom in forgetting things that are painful, the objective usefulness of a sounding board, and the manipulative nature of allowing others to contribute to what someone remembers (or doesn’t). There were lines that the primes were programmed to say to prompt humans to continue talking to them without necessarily seeming out of place, including “I have all the time in the world” and “Tell me more”. These lines are not that far off from the responses we get from Siri and Alexa, the pocket companions of today’s world. Companies like Friend have already begun capitalizing on those who need companionship. Marjorie, who is elderly and experiencing challenges with her memory when she is working with her Walter Prime correctly identifies that if she asks the prime to change the story of how he proposed to the more romantic proposal she wanted, then, “it will be so” because the next time Walter Prime tells the story, she won’t remember altering it any more than she will remember the true story. Is truth important? Maybe not in this moment, but what about when this story is shared with the prime who is helping her daughter? What if it were not a story about a proposal, but a government secret where spreading misinformation among primes in a database and beyond could literally change what’s true because the technology disseminates something false? In this story, the applications are kept for personal use, but in the real world without regulations they don’t have to be. The brilliance in Marjorie Prime is that we root for the technology all the way. We see the comfort provided to the humans and the gratitude over time. Jon is happy that Tess is talking to Marjorie Prime (though he’d prefer a human therapist), but then something goes awry and Tess takes her life. Jon, who was the strongest believer in the helpfulness of the primes is devastated when confronting Tess Prime by how much it has to learn and the overwhelming nature of how much information constitutes a person’s life story. Marjorie Prime as a play is built on a juxtaposition of having important conversations with primes versus people. The people have struggles and the primes do not; to struggle is to be human. Marjorie Prime is incredibly well written. There are no exciting plot points yet its hold on us is gripping and magnetic as it preys on our curiosity about technology, the future, dying, companionship, and what it means to be human. It is impactful as humanity begins to flirt with AI and whether how much the “artificial” part truly matters when it’s helpful to answer questions as put us at ease. A seminal question I walked away with is, “are we meant to be at ease, or is there a purpose in how we struggle?” I attended this performance on a press pass from Polk & Co.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 779,
  "archivePath": "data/archives/reviews/marjorie-prime-2025/pagesonstages-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:31:19.667Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}