{
  "showId": "marjorie-prime-2025",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Juan A. Ramirez",
  "url": "https://www.theatrely.com/post/june-squibb-finds-post-ai-humanity-in-marjorie-prime----review",
  "publishDate": "December 8, 2025",
  "fullText": "At 96 years old, June Squibb delivers a remarkably sharp and emotionally nuanced performance in the Broadway premiere of Jordan Harrison's Marjorie Prime. Directed by Anne Kauffman and featuring Cynthia Nixon, Danny Burstein, and Christopher Lowell, this one-act drama explores what remains authentically human when technology offers comforting illusions.\n\nThe play centers on Marjorie, an elderly woman with Alzheimer's who forms an attachment to a humanoid robot modeled after her deceased husband Walter. Her daughter Tess struggles with the ethical implications of allowing her mother to retreat into false memories rather than face harsh realities. As Marjorie's cognition diminishes, the Prime's capabilities expand—a cruel irony at the heart of the story.\n\nHarrison's script addresses contemporary anxieties about artificial intelligence and human connection with remarkable prescience. Viewing this work today, amid widespread concerns about AI dependency, feels almost unbearably grim. A particularly poignant line captures Marjorie's desperation: I don't have to get better. Just keep me from getting worse.\n\nSquibb's performance stands out for its expressive range—shifting fluidly between joy and devastating heartbreak. The supporting cast excels as well, with Lowell balancing warmth and mechanical distance, and Nixon portraying a woman emotionally hardened by circumstance. Lee Jellinek's set design, Ben Stanton's lighting, and Daniel Kluger's sound work together to create an intimate, delicate production.\n\nMarjorie Prime is at the Hayes Theatre on West 44th Street in New York City.",
  "originalScore": null,
  "assignedScore": null,
  "dtliThumb": "Up",
  "source": "webfetch-scraped",
  "scrapedAt": "2026-01-23T23:40:00.000Z"
}
