{
  "showId": "just-for-us-2023",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Lipton",
  "url": "https://cititour.com/NYC_Broadway/Just-for-Us/1155",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Just-for-Us/1155",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "With the proliferation of stand-up comedy specials on streaming television (yes, I mean you Netflix), it might seem outrageous to suggest you pay Broadway prices to see “Alex Edelman: Just for Us,” which has landed at the Hudson Theatre for a nine-week engagement after a year of a various Off-Broadway runs. Do it anyway!",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ALEX-EDELMAN-JUST-FOR-US-Opens-On-Broadway-20230626",
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $64\n Buy Tickets\n\nCititour.com Review\n With the proliferation of stand-up comedy specials on streaming television (yes, I mean you Netflix), it might seem outrageous to suggest you pay Broadway prices to see “Alex Edelman: Just for Us,” which has landed at the Hudson Theatre for a nine-week engagement after a year of a various Off-Broadway runs. Do it anyway!\n\nFirst, not even Chris Rock, Wanda Sykes nor Jim Gaffigan have made me laugh as consistently – or think as much about the state of the world – as Edelman does here over 80 or so minutes. And let’s not discount the importance of communal laughter! While the show – superbly directed by the late Adam Brace -- may hit harder (in good and bad ways) for Edelman’s most specific audience – white Jews – I suspect the Hudson will still be rocked with nightly laughter from members of every race, religion and gender. Except maybe white supremacists.\n\nYep, like his mentor (and producer), the great Mike Birbiglia, Edelman’s show revolves a central true-life story. In January 2017, Edelman – who was raised as an Orthodox Jew in Boston but was now living in NYC – “responded” to a tweet, telling him if he wanted to learn about his “whiteness,” he should come to a “meeting” in Queens. Edelman expected to go to a bar, not an apartment, but he was under no delusion that the other attendees would not be Jewish, and even more likely, outwardly antisemitic and virulently racist! (Guess what, he was right!) So why go? \n\nAs he explains in one of his best “bits,” growing up in Boston, a city known for racial segregation and religious hierarchies, he felt less “white” than its many WASPS and Irish Catholics. And there’s his other, supposedly valid reason, as he tells his best friend David: “It’s gonna be illuminating. I’m gonna learn so much about this perspective. Maybe I’ll come to understand their point of view. It’s gonna be intense and incredible.”\n\nThat’s a concept he claims stems from the heart of Judaism: the importance of empathy for everyone – something which is clearly lacking in our society. And, shockingly, there are moments, even after his fellow meeting-goers have spewed horrible invectives, when Edelman not only begins to feel for them as human beings but comes to believe they will accept him regardless of his religion. “I thought to myself: I’m gonna be a grand wizard before I leave here. They’re gonna fit me for a hood before I go. People love me,” he says with just a tinge of irony. (Spoiler alert: they don’t.)\n\nAs with the best comic monologues (for which this qualifies), Edelman strays often enough from the main “plot” – compelling as it is -- to share related incidents from his life that both heighten his thesis and work brilliantly on their own. His lengthy recollection of why his Orthodox family celebrated Christmas one year when he was a child – and its many after-effects – is among the funniest things I’ve ever heard. \n\nConversely, recreating a conversation with lifelong friends who have refused to vaccinate their infant – from any disease – because of their faith in God is as sobering as a slap to the face.\n\nMeanwhile, anyone with a sibling can relate to the initial lack of support Edelman offers his older brother A.J. when he sets out to be an Olympic athlete, in the little-known sport of skeleton (representing Israel, no less!). Making fun of both his brother and the endeavor after watch A.J. practice, he tartly observes: “A corpse and some duct tape would medal in this event.”\n\nLast but not least, there are also roar-inducing bits that are not so personal, including one about the reaction of Koko the Gorilla to the death of comedian Robin Williams, which nonetheless fit in seamlessly with the piece’s clever arc. You will just have to go to the Hudson to find out how. \n\n By Brian Scott Lipton\n\nVisit the Sitehttps://www.justforusshow.com/Open/Close DatesOpening 6/26/2023Closing Open-ended\nTheatre Info\nHudson Theatre139-141 West 44th StreetNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 733,
  "archivePath": "data/archives/reviews/just-for-us-2023/cititour--brian-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:05:42.808Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 733,
  "tierReason": "Full review text"
}