{
  "showId": "skeleton-crew-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2022/01/26/skeleton-crew-dominique-morisseaus-ode-to-a-shrinking-industry/",
  "publishDate": "2022-01-26T20:52:24",
  "fullText": "When it comes to all things Motor City, there’s no better historian—or more passionate advocate—than playwright Dominique Morisseau.\n\nAll of the pieces in her Detroit Project trilogy chronicle pivotal time periods for the city: Paradise Blue in 1949, before the once-vibrant Black Bottom neighborhood was destroyed in the name of so-called urban renewal; Detroit ’67 in July 1967, during the Uprising of 1967 (aka the 12th Street Riot and the Detroit Rebellion of 1967); and, now on Broadway at the Friedman Theatre, Skeleton Crew, which takes place in a stamping plant in 2008—not only the peak of the Great Recession but also the implosion of the auto industry.\n\nIf you grew up in or around Detroit, chances are someone in your family had a connection to the auto industry—be it in manufacturing, at a dealership, or at an ad agency. There was a true sense of pride in those jobs—something Morisseau knows and pours into her behind-the-assembly-line drama. “I’m building something that you can see come to life at the end. Got a motor in it and it’s gonna take somebody somewhere,” says Shanita (the excellent Chanté Adams). “Gonna maybe drive some important business man to work. Gonna get some single mama to her son’s football practice. Gonna take a family on they first trip to Cedar Point. Gonna even maybe be somebody’s first time. Who knows? But I like knowing I had a hand in it, you know?” (That feeling is real—even if you aren’t one of the people pounding out the metal. My mom still remembers Ronald Reagan’s Cadillac coming out of the laboratories in her engineering building. “And I got to sit in it before the president did!” she told me. “With the assistance of the Secret Service.”)\n\nOf course, Morisseau’s setting is 2008, so Shanita and her fellow line workers—young hothead Dez (Joshua Boone) and 29-year veteran Faye (Phylicia Rashad)—are living under the constant threat of closure. As they sip coffee, play cards, and philosophize in the break room—impeccably detailed by scenic designer Michael Carnahan, complete with tiny Detroit touches such as a box of Better Made potato chips—they talk about nearby plants that are shuttering. Robberies are happening at all of them—in-demand materials like sheet metal mysteriously going missing—even at their own. Dez sees the writing on the wall and takes out his anger on their supervisor, Reggie (Brandon J. Dirden). Faye, meanwhile, trusts him to do right by his workers. “Can’t define what a man is until he got to take an action,” she says. “You judge him befo’ we even see what the action gonna be. And me—what I know ’bout that man… what I know ’bout his mama and what he’s made of….when it come to where his heart lie, he gonna rise to the occasion.”\n\nWith the exception of casting, director Ruben Santiago-Hudson’s production is virtually the same as the terrific one he helmed in 2016 at the Atlantic Theater Company. (Thankfully, he did bring back performer-choreographer Adesola Osakalumi, whose kinetic movement between scenes illustrates the constant, precision motion of the assembly line.) Rashad is fantastic as the “tough as bricks” Faye, and Dirden—featured in Santiago-Hudson’s gorgeous revivals of August Wilson’s The Piano Lesson (2012) and Jitney (2016), not to mention in Detroit ’67 (2013)—is simply spectacular as the buttoned-up Reggie.\n\nIn a dream world, some brave Detroit-born producer would put Morisseau’s entire Detroit Trilogy in rep on Broadway, and we would be able to see them all consecutively, either on multiple nights or in a single day. But for now, if we have to get only one, I’m glad it’s Skeleton Crew, a deftly drawn portrait of skilled workers getting squeezed out of the once-vibrant business that built a state.\n\nAt the top of Act 2, Shanita is prattling on nervously to fill the air, talking about driving in on I-75: “Nobody wants to merge no more. We just gettin’ squished into smaller lanes while they make these promises to fix the freeways and don’t seem like they ever really get fixed.” Ostensibly it’s a rant about traffic, but it seems like Morisseau is talking about much, much more, doesn’t it? “And all I can think anymore is if we just merged, shit would flow so much better.”\n\nSkeleton Crew opened Jan. 26, 2022, at Samuel J. Friedman Theatre and runs through Feb. 20. Tickets and information: manhattantheatreclub.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
