{
  "showId": "the-heidi-chronicles-2015",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Melissa Maerz",
  "url": "http://www.ew.com/article/2015/03/19/elisabeth-moss-and-jason-biggs-heidi-chronicles-ew-review",
  "playbillVerdictUrl": "http://www.ew.com/article/2015/03/19/elisabeth-moss-and-jason-biggs-heidi-chronicles-ew-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "\"The Heidi Chronicles\" Elisabeth Moss and Jason Biggs\n (Joan Marcus)\n\nGenre: drama, Revival; Starring: Elisabeth Moss, Jason Biggs, Bryce Pinkham; Director: Pam MacKinnon; Author: Wendy Wasserstein; Opening Date: 03/19/2015\n\nPosted March 19 2015 — 3:33 PM EDT\n\nThe good news about the Broadway revival of The Heidi Chronicles? The famous monologue about the failures of feminism still holds up. The bad news? It still holds up. Toward the end of Wendy Wasserstein’s Pulitzer Prize-winning 1988 play, art historian Heidi Holland (Elisabeth Moss) takes the podium at the Plaza Hotel to deliver a speech on the topic “Women, Where Are We Going?” She starts by describing the ideal women who has it all, then admits that she’s not that kind of woman. She talks honestly about what it’s like to find herself single and childless in her mid-30s, feeling ambivalent about the other women who judge her and compete with her, making her feel worthless and superior at the same time. “We’re all concerned, intelligent, good women,” she admits. “It’s just that I feel stranded. And I thought that the whole point was that we wouldn’t feel stranded. I thought the whole point was that we were in this together.”\n\nFeminism has changed a lot since Wasserstein wrote that scene. Today, The Heidi Chronicles might seem like the product of second-wave issues that aren’t relevant anymore. But after nearly 30 years, that monologue is still just as powerful, and, sadly, for many women, it’s probably just as easy to relate.\n\nThroughout The Heidi Chronicles, Heidi reflects on her life within the context of the women’s movement, as we follow her from a high school dance in the 1960s through single motherhood in the 1980s. It’s a play that asks a tough question: What happens when the world is changing around you, but you’re still the same person inside? And that makes it a good fit for Moss, who has explored similar themes as Mad Men’s Peggy Olson. She brings a little bit of Peggy to Heidi, a bright young woman with a closet full of aspirational, corner-office clothes who’s making more strides with men at the office than she is in her personal life.\n\nMoss makes it easy to root for Heidi, because she makes her feel like one of us, and a strong cast reinforces that idea. Bryce Pinkham (Tony nominee for A Gentleman’s Guide to Love and Murder) stands out as Wendy’s gay best friend, Peter, a pediatrician with a devastating wit. (“You look so bored, you must be very bright,” he tells Heidi.) And Jason Biggs gets the infuriating, jerk-you-can’t-stop-loving appeal of Heidi’s onetime boyfriend and longtime tormentor, Scoop. Together with the rest of the cast, which includes the great Tracee Chimo (Bad Jews) as Heidi’s friend, they capture Wasserstein’s sad-funny voice well, with riffs on reality TV and the luxury of white-girl problems that now feel surprisingly prescient.\n\nThe only thing that’s dated is the staging, which is a shame, since it was directed by Pam MacKinnon, who won a Tony for the recent revival of Who’s Afraid of Virginia Woolf? Because The Heidi Chronicles tracks Wendy’s struggles and triumphs over three decades, it trades in broad, generational moments: teenagers doing the twist, college kids campaigning for Eugene McCarthy, women’s libbers attending support groups, gay men weathering the AIDS crisis. That time-capsule vibe might be hard to overcome, especially when Heidi lectures about feminist debates that went out of style decades ago. (Is there something “uniquely female” about women’s painting? Ugh.) But the fact that these scenes take place on a white stage that acts as a projection screen for newspaper headlines and archival photos doesn’t help; we can tell what era Heidi’s in without the history-lecture slide show.\n\nEven though this revival is clumsy about the past, its view of the future has aged well. At one point, Scoop describes Heidi’s generation as “disappointed women—interesting, exemplary, even sexy, but basically unhappy.” By the play’s end, she’s not so pessimistic. “Maybe things will be a little bit better,” she says, as she holds her newborn daughter. “So, yes, that does make me happy.” If The Heidi Chronicles doesn’t always translate for the 21st century, maybe we should be happy, too. Isn’t that a sign that some things have gotten better? B+",
  "isFullReview": true,
  "textWordCount": 714,
  "archivePath": "data/archives/reviews/the-heidi-chronicles-2015/ew--melissa-maerz_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:31:11.770Z",
  "originalScore": "B+",
  "originalScoreNormalized": 87,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20150910083930",
  "archiveOrgUrl": "http://web.archive.org/web/20150910083930/http://www.ew.com/article/2015/03/19/elisabeth-moss-and-jason-biggs-heidi-chronicles-ew-review",
  "contentTier": "complete",
  "wordCount": 714,
  "tierReason": "Full review text"
}