{
  "showId": "the-heidi-chronicles-2015",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Robert Hofler",
  "url": "http://www.thewrap.com/the-heidi-chronicles-theater-review-elisabeth-moss-brings-a-slightly-mad-woman-back-to-broadway/",
  "playbillVerdictUrl": "http://www.thewrap.com/the-heidi-chronicles-theater-review-elisabeth-moss-brings-a-slightly-mad-woman-back-to-broadway/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "If Wendy Wasserstein had lived beyond her 56 years, would she have written a sequel to “The Heidi Chronicles,” a revival of which opened Thursday at the Music Box on Broadway? The lasting power of this 1988 play is that, more than ever, we really want to know what happens to the girl Heidi Holland (Elisabeth Moss) adopts at the end of “Chronicles.”",
  "isFullReview": false,
  "textWordCount": 63,
  "archivePath": "data/archives/reviews/the-heidi-chronicles-2015/thewrap--robert-hofler_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:33:12.294Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "excerpt",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Word count too low: 69 (min: 300)"
  ],
  "contentTier": "invalid",
  "wordCount": 63,
  "tierReason": "Short text (63 words)",
  "rejectedAt": "2026-02-04T06:21:32.068Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be just an opening paragraph or excerpt that provides context about the playwright and poses a question, but contains no actual evaluation or criticism of the current Broadway production.; openai: The text provided is more of a speculative question about the possibility of a sequel rather than an evaluation of the current Broadway production.; gemini: This is an introduction to a review, but it doesn't contain any evaluative statements about the current production. It mainly discusses Wendy Wasserstein and the original play.",
  "promptVersion": "5.2.0",
  "bwwExcerpt": "...Wasserstein clearly sees TV as a big sell-out for her lead character, a revered art historian teaching at Columbia University. So why has Pam MacKinnon directed most of the supporting players around Moss as if they're on a 1980's sitcom? This approach might have worked on Broadway years ago, but in 2015 cable TV turns out far edgier fare on a weekly basis than the theater, on or off Broadway...Moss succeeds in making Heidi's dilemma vivid and crucial, even though here's an art history major who gets tons of grants, can pick between teaching at Columbia or Carleton College, and is offered a TV gig that she never pitched and rejects because it's too insignificant in light of her research on female artists of the 18th Century...Wasserstein must have known she'd turned her heroine into a whiner...",
  "bwwScore": 7
}
