{
  "showId": "the-heidi-chronicles-2015",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://variety.com/2015/legit/reviews/heidi-chronicles-review-elisabeth-moss-broadway-1201455721/",
  "playbillVerdictUrl": "http://variety.com/2015/legit/reviews/heidi-chronicles-review-elisabeth-moss-broadway-1201455721/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "A shoddy production can’t dim the lights of this long-overdue revival of Wendy Wasserstein’s Pulitzer Prize and Tony Award-winning play, “The Heidi Chronicles.” On the page (and from recollections of previous productions), this 1989 play is the writer’s bittersweet valentine to her generation of educated baby boomers who embraced the 1970s women’s emancipation movement with gusto. Elisabeth Moss (waving goodbye to “Mad Men”) is effortlessly endearing — and wonderfully real — as the brainy, mixed-up heroine, and the thesps playing her male friends pass muster. But, under the direction of Pam MacKinnon, Heidi’s girlfriends are an embarrassment.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘There Are No Heroes Here — Only Men Trapped Between the Logic of Power and the Weight of Guilt,’ Says 'The Red Hangar' Director of the Untold Story Behind Chile’s Military Coup (EXCLUSIVE) \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Bedford Park’ Review: Two Children of Korean Immigrants Make an Unlikely Connection in Touching but Slightly Contrived Drama\n\nFor a play loaded with laughs, “Heidi” has some serious things to say for herself. As mouthpiece for the scribe (who died at 55 in 2006), the title character, played with great charm and intelligence by Moss, gives voice to those burning issues important to young women coming of age in the heady days of the women’s movement: equal rights, equal wages, equal orgasms and equal standing in a male-dominated society.\n\nAs we learn from the play’s framing device, Heidi will graduate from Vassar and Yale, and mature into an assured academic in the field of feminist art history. But when we first meet her at a high school dance in 1965, she’s in that awkward stage that confounds smart girls who want to be both liked as girly-girls and accepted as the brains they are. She actually lucks out at an early age, meeting the wiseass Scoop Rosenbaum (Jason Biggs) who will be the love of her life. (“I’m arrogant and difficult. But I’m very smart. So you’ll put up with me.”) She also meets the witty Peter Patrone (Bryce Pinkham) at the punch bowl, the sensitive gay guy who will remain loyal to her through thick and thin. (“If we can’t get married, let’s be friends.”)\n\nThe more interesting relationships are those she shares with her female friends, who change (or don’t) as the decade advances. There they are at Heidi’s first Consciousness Raising Rap Group, and here they are again at a Eugene McCarthy mixer. (“Neat and clean for Eugene.”)\n\nAs volatile political trends shift underneath her feet, Heidi stands firm for what she believes in: “I think all people deserve to fulfill their potential.” So does her shallow best friend Susan (Ali Ahn), who’s always had her eye on the main chance and climbs to the top of her business profession. But over the years Heidi becomes increasingly alienated from her other women friends, who are dropping out in droves from the job market to marry, have children and move to the suburbs. The women’s liberation movement promised Heidi that a woman could have it all — career, children, a great sex life and the love of a good man — and when society decrees otherwise, she loses her direction.\n\nWasserstein’s way of resolving Heidi’s existential loneliness didn’t sit very well with Betty Friedan and other feminists we could name. But that isn’t what cheapens the play here — it’s MacKinnon’s production.\n\nEven when she’s having fun with them, Wasserstein is never condescending to Heidi’s less enlightened girlfriends. But they can’t get a break in this cheapo production. Jessica Pabst has costumed everyone in offensively ugly renderings of 1960s and 70s fashions and set designer John Lee Beatty doesn’t even give them comfortable furniture to sit on. (Not that Heidi is treated any more tenderly. Her old-maid makeup and drab outfits insult the actress forced to wear them, while perpetuating the offensive cliché that smart girls don’t know how to dress themselves.)\n\nAs for the caricatured character portraits and cartoonish acting, the less said the better.",
  "isFullReview": true,
  "textWordCount": 660,
  "archivePath": "data/archives/reviews/the-heidi-chronicles-2015/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:54:43.173Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 660,
  "tierReason": "Full review text"
}