{
  "showId": "the-encounter-2016",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "https://dougmarino.blogspot.com/2016/09/the-encounter.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"The aural delight wears off in about 25 minutes and the rest of the 2 hours is filled with his bizarre story that is at times incoherent, other times rambling, other times mildly interesting when he is effectively teaching you about these very different people and providing insights into cultures and civilizations that are unlike anything we have seen...The show was not nearly worth the advertised ticket price...It has the it's different quality going for it. That's about it.\" \n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 411,
  "archivePath": "data/archives/reviews/the-encounter-2016/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:33:33.820Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "I'm glad I got just a TDF priced ticket to see this show. And by show, I really mean performance art in a Broadway theater. I feel sorry for people buying full price tickets (Over $100 if you believe the electronic board at the box office window). Make no mistake, Simon McBurney (himself) is putting on a show. And that show is quite different, quite unique, and mostly un-Broadway-like. For the un-initiated, it is a aurally (that means sound) mesmerizing performance. You have to wear headphones. If you take them off you are basically sitting in a packed broadway theater watching a person whisper on the stage. The headphones themselves are fairly advanced and deliver a sound experience like you have never before experienced with your cheap earbuds. They involve a quite complex sound system. My novice research suggests that his main tool is known as a binaural stereo microphone that when paired with high quality headphones (and likely a sound board the size of a billiards table) produces a life-like sound simulation all around your head as if you are immersed in the action and it is happening directly next to you. This is the secret to the entire show. The show itself is the tale of a photo-journalist dropped in the amazon searching for indigenous people. While he does find them, the tale of them welcoming (or not) him into their world is harrowing, suspenseful, dangerous, and life-altering. He conveys this all thru your headphones from a stage adorned with virtually nothing but a table, water bottles and a few microphones. Props. Just props. The aural delight wears off in about 25 minutes and the rest of the 2 hours is filled with his bizarre story that is at times incoherent, other times rambling, other times mildly interesting when he is effectively teaching you about these very different people and providing insights into cultures and civilizations that are unlike anything we have seen. Several lighting effect attempt to supplement the aural presentation to limited success. There is a high ideal quality to the show - as evidenced by the appearance of the audience in attendance. Mostly the save the planet, save the whales. stop wars, eat veggies, recycle everything kind of crowd. At 2 hours and a few minutes including his heartfelt words after the curtain call, the show was not nearly worth the advertised ticket price. It has the it's different quality going for it. That's about it."
}