{
  "showId": "the-encounter-2016",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2016/09/30/theater/the-encounter-review.html?_r=0",
  "playbillVerdictUrl": "http://www.nytimes.com/2016/09/30/theater/the-encounter-review.html?_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "But the awe-struck descriptions of nature in ascendance are always secondary to what we're feeling, physically as well as emotionally. And 'The Encounter,' which has only sharpened its production values since I saw it in London in February, summons those sensations not just through sound but also through lighting (by Paul Anderson) and projections (by Will Duke) that transform a sterile stage into a phosphorescent jungle where shadow trumps substance or an American suburb illuminated by a bonfire of discarded worldly goods.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-ENCOUNTER-Opens-on-Broadway--Updating-Live-20160929",
  "fullText": "https://www.nytimes.com/2016/09/30/theater/the-encounter-review.htmlShare full article2525Advertisement\n\nSee that scruffy-looking guy up there on the stage, the one messing around with the microphones and the plastic water bottles? It turns out that he’s a world-class head shrinker — and head enlarger, too, an all-purpose mind-bender. He is going to retune, rearrange and reproportion your senses, while taking you places you never expected to visit.\n\nAll you have to do is lend him your ears.\n\nSurely, no production on Broadway has ever thrown the doors of perception open as widely as “The Encounter,” Simon McBurney’s astonishing one-man show, which opened on Thursday night at the Golden Theater. On one level, this singular piece from Complicite, a long-lived London-based troupe that regularly ventures where no actor has gone before, is simply a classic adventure story of an intrepid Western explorer lost in the Amazon rain forest.\n\nBut the plot, as exotic as it might seem, is only the point of departure for a more far-reaching journey. That’s the one in which Mr. McBurney takes what he calls a “walk across your brain.” It’s a perambulation that disassembles everything he’s saying to you and how he’s saying it, how you’re processing it and even how you’ll be thinking about it tomorrow. Your passport is the set of earphones that you’ll find attached to your seat.\n\nSounds hokey, doesn’t it, like 3-D glasses or one of those gimmicks that the moviemaker William Castle touted in the 1950s, using names like Percepto and Illusion-O. The earphones you’ve been issued don’t even look particularly sophisticated.\n\nBut almost as soon as you put them on, your sense of time and space is altered. Mr. McBurney suddenly seems to be standing right next to you, whispering and (oh, wow!) blowing into your ear. Then he’s over there, behind you, and there, in front of you, and then practically sitting in your lap. Yet your eyes tell you that he’s never left the stage. Maybe you shouldn’t trust your eyes.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 351,
  "archivePath": "data/archives/reviews/the-encounter-2016/nytimes--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:29:51.752Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203852",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203852/https://www.nytimes.com/2016/09/30/theater/the-encounter-review.html?_r=0",
  "contentTier": "needs-rescrape",
  "wordCount": 351,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T16:26:25.807Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text ends with a technical error message about retrieving article content and enabling JavaScript, indicating this is incomplete/corrupted text rather than a full review.; openai: The text includes navigation instructions and an error message about retrieving content, indicating it is not a complete review.; gemini: The review text is incomplete and contains an error message indicating that the article content could not be retrieved.",
  "promptVersion": "5.2.0"
}
