{
  "showId": "the-encounter-2016",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "http://www.nytimes.com/2016/02/27/theater/review-you-see-the-encounter-with-your-ears.html",
  "publishDate": null,
  "fullText": "https://www.nytimes.com/2016/02/27/theater/review-you-see-the-encounter-with-your-ears.htmlShare full articleAdvertisement\n\nLONDON — Someone is blowing in your ear, and it isn’t anybody in your immediate vicinity. You can feel this distant person’s breath (hot) and his urgency (hotter), and the sound of him is all over the place — behind you, before you, to either side of you, close and distant, shouting and whispering, sometimes in several voices at once.\n\nYou could make him (them) go away, you know, quite easily. All you would have to do is remove the headphones you were instructed to put on as soon as you arrived at the Barbican Theater. But why would you want to?\n\nThis man of many tongues — his name is Simon McBurney — is taking you somewhere you’ve never been before. And not just into the rain forests of the Amazon, where most of the story that’s being told here takes place.\n\nMr. McBurney’s “The Encounter,” which sold out its limited run (through March 6) at the Barbican even before it opened last week, is a journey to the center of your mind that begins in your auditory nerves and keeps burrowing deeper. Directed and performed by Mr. McBurney, this production from the genre-bending Complicite company is one of the most fully immersive theater pieces ever created.\n\nYet “The Encounter” never asks its audience to reach out and touch someone or something, or to walk through site-specific labyrinths, or to engage in conversation with a performer, as is often the way of interactive art these days. The experience of this production is utterly stationary. You simply sit down, don the headset that’s attached to your seat, and let Mr. McBurney and his extraordinary sound designers — Gareth Fry and Pete Malkin — play with your ears.\n\nInspired by Petru Popescu’s “Amazon Beaming” — a novel based on real-life accounts of an American’s adoption by the mystical Mayoruna tribe in 1969 — “The Encounter” is nominally a one-person show. The British Mr. McBurney adopts a Yankee accent and a lower pitch of voice to become the photojournalist Loren McIntyre (1917-2003), as he travels down the Amazon River and into the heart of — no, not darkness — enlightenment, deep in the jungles of Brazil.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "But the awe-struck descriptions of nature in ascendance are always secondary to what we're feeling, physically as well as emotionally. And \"The Encounter,\" which has only sharpened its production values since I saw it in London in February, summons those sensations not just through sound but also th...",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"You might think that all this meta-rumination would impose an intellectual distance between us and the show’s main narrative. Yet we follow McIntyre into the jungles as eagerly as if we were children lost in an adventure novel...On its own, much of McBurney’s script has an old-fashioned romanticism, idealizing the elemental pureness of a Rousseauvian world. It’s much more the form than the content here that truly transports us into parts unknown.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright",
    "bww-roundup",
    "playbill-verdict"
  ],
  "playbillVerdictUrl": "http://www.nytimes.com/2016/09/30/theater/the-encounter-review.html?_r=0",
  "textWordCount": 391,
  "archivePath": "data/archives/reviews/the-encounter-2016/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:33:52.542Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250221071828",
  "archiveOrgUrl": "http://web.archive.org/web/20250221071828/https://www.nytimes.com/2016/02/27/theater/review-you-see-the-encounter-with-your-ears.html",
  "wordCount": 391,
  "tierReason": "Full review text"
}