{
  "showId": "the-peewee-herman-show-2010",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://theater.nytimes.com/2010/11/12/theater/reviews/12peewee.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "But mostly this is a straight-up re-creation of the off-kilter world of the original series, which managed to succeed as both a sincere, pedagogical children's show and a winking sendup of one at the same time. It was a remarkable magic trick that won the show an avid following both among real tykes and adults who warmed to Mr. Reubens's kitschy, mildly subversive take on a vintage formula.",
  "bwwScore": 7,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-PEEWEE-HERMAN-SHOW-20101111",
  "fullText": "“The Pee-wee Herman Show”: Paul Reubens as Pee-wee with Conky 3000 at the Stephen Sondheim Theater. More Photos »\n\nThe sounds filling the Stephen Sondheim Theater on 43rd Street are not the Broadway melodies you might expect to hear in a house recently renamed for the revered master of the American musical. They are, instead, the happy gurglings and raucous cheers of a thousand reborn inner children romping around a favorite playground.\n\nPee-wee with one of his playhouse’s familiar fixtures, Chairy. More Photos »\n\nPee-wee is back, boys and girls! The adorable man-child in the skinny suit and red bow tie, the helium-voiced idol of the snark generation, the post-camp poster boy, the human exclamation point: he's been sprung from a time machine and has parked his playhouse on Broadway for a spell, bringing his fanciful menagerie of talking furniture and friendly sidekicks along for the ride.\n\n\"The Pee-wee Herman Show,\" which opened Thursday night for a limited run through Jan. 2, is nothing more and nothing less than a bubble bath of nostalgia for the many adoring fans of Pee-wee, the sweet 'n' snickery alter ego of the comic actor Paul Reubens. Created and conceived by Mr. Reubens, and directed by Alex Timbers (\"Bloody Bloody Andrew Jackson\"), the show resembles an extended episode of \"Pee-wee's Playhouse,\" the children's television show created by Mr. Reubens that had its debut in 1986 and ran for five seasons on CBS, garnering Emmy awards like a kid hoarding gifts on a big birthday.\n\nReconstituted more than two decades after its introduction, the original recipe has been left essentially unaltered. The playhouse itself has been supersized to fill a Broadway stage, but the familiar elements are all in place, from the chattering chair and window to the word of the day to the signature jig. Pee-wee may be playing it safe, but perhaps he's playing it smart too. Nobody wants to bite into a Pop Tart or a Twinkie for a surge of Proustian recollection and have it taste like a granola bar, after all.\n\nMr. Reubens and his co-authors, Bill Steinkellner and John Paragon, have added a few gadgets to the romper room, mostly drawn from the wacky world of infomercials. Among the puppet newcomers is a talking Sham Wow, and Pee-wee's plaid suit gets Bedazzled at one point. There is a wisp of plot concerning the wiring of the playhouse, in preparation for Pee-wee's first ventures into computerland.\n\nBut mostly this is a straight-up re-creation of the off-kilter world of the original series, which managed to succeed as both a sincere, pedagogical children's show and a winking sendup of one at the same time. It was a remarkable magic trick that won the show an avid following both among real tykes and adults who warmed to Mr. Reubens's kitschy, mildly subversive take on a vintage formula.\n\nThe key ingredient was — is — Pee-wee himself, a being forever arrested at the age of development when sarcasm has just been discovered — it's yummier than chocolate! — and sex remains an obscure mystery, some unnecessary adult variation on cooties. (Which does not mean that the occasional naughty double entendre cannot be lobbed over the heads of the little ones.)\n\nMr. Reubens's Silly Putty face is a little puttier, but it remains as stretchable as ever. His Popsicle-stick posture retains its comical rigidity; the flapping arms express exasperation and excitement with no loss of tone; the bopping Pee-wee dance is still beach-ball-buoyant. And of course Pee-wee's restless imagination and childish mood swings are as extravagant as ever.\n\nGrand Central gets grander, Penn Station stays penal: That is a rule of New York City, writes Lawrence Downes.\n\nOur brains are wired to confuse the real and the symbolic. And the implications are serious as war and peace.",
  "isFullReview": true,
  "textWordCount": 632,
  "archivePath": "data/archives/reviews/the-peewee-herman-show-2010/nytimes--charles-isherwood_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:50:28.658Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20120604005504",
  "archiveOrgUrl": "http://web.archive.org/web/20120604005504/http://theater.nytimes.com/2010/11/12/theater/reviews/12peewee.html",
  "wordCount": 632,
  "tierReason": "Full review text"
}