{
  "showId": "the-peewee-herman-show-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "http://www.variety.com/review/VE1117944035/",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Show has been slickly staged by director Alex Timbers, who after a long career in the downtown theater made a dynamic Broadway debut four weeks ago as author/director of 'Bloody Bloody Andrew Jackson.' Actors, voices, and video are well integrated; the last include a very funny mock-authentic film on lunchroom manners, featuring a humongous slice of chocolate cake, and a stop-motion clay animation cartoon from Nick Park of 'Wallace and Gromit' fame. However, there are moments -- like when, after almost an hour, Reubens spends two minutes blowing up and deflating a balloon -- when the ninety-minute show seems like it will never end.",
  "bwwScore": 5,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-PEEWEE-HERMAN-SHOW-20101111",
  "fullText": "Nov 11, 2010 6:42pm PT \n\n \n\n \n \n \n\n \n\n \n The Pee-wee Herman Show\n \n \n\n \n\n Fans of the art of Paul Reubens (a.k.a. Pee-wee Herman) will have a nostalgic field-day at the Broadway incarnation of \"The Pee-wee Herman Show.\"\n\nFans of the art of Paul Reubens (a.k.a. Pee-wee Herman) will have a nostalgic field-day at the Broadway incarnation of “The Pee-wee Herman Show.” Non-initiates will simply scratch their heads, look at their watches, and stare in wonder as the seemingly rational adults surrounding them scream out with joy when anyone says the secret word of the day, which — no surprise here — is “fun.” Pee-wee fans will have plenty of that at the newly monikered Stephen Sondheim Theater (formerly the Henry Miller); newcomers are unlikely to be converted, and might just as well stay home.\n\nNearly 30 years after Reubens debuted his alter ego on the L.A. stage in 1981, performer is approaching sixty but his creation seems to be timeless. Even so, Pee-wee can be hard to take. The youngster is something of a combination of Jerry Lewis, Eloise, and Lily Tomlin’s Edith Ann, only with an aggressive edge and plenty of double entendres.\n\nThe new show, which preemed in LA earlier this year, is set in what seems to be a loving recreation of the set of “Pee-wee’s Playhouse,” the culty CBS Saturday morning skein that ran in the late 1980s. Reubens is accompanied by three members of his original TV cast (although Laurence Fishburne, was presumably too busy to recreate his role of Cowboy Curtis). Pee-wee faithful not only cheer the familiar characters, songs, and phrases; they offer loud and energetic entrance hands to the props.\n\nShow has been slickly staged by director Alex Timbers, who after a long career in the downtown theater made a dynamic Broadway debut four weeks ago as author/director of “Bloody Bloody Andrew Jackson.” Actors, voices, and video are well integrated; the last include a very funny mock-authentic film on lunchroom manners, featuring a humongous slice of chocolate cake, and a stop-motion clay animation cartoon from Nick Park of “Wallace and Gromit” fame. However, there are moments — like when, after almost an hour, Reubens spends two minutes blowing up and deflating a balloon — when the ninety-minute show seems like it will never end.\n\nThe preteen fans of “Pee-wee’s Playhouse” are now card-carrying thirty- and forty-somethings — credit card-carrying, that is, and presumably happy to relive their youth with Pee-wee, Chairry the talking chair, Pterri the pterodactyl, and Miss Yvonne-the-most-beautiful-woman-in-Puppetland. Probably there are more than enough Pee-wee-ites to fill the Sondheim for this eight-week holiday booking; potential playgoers in doubt, though, are well-advised to follow their instincts.",
  "isFullReview": true,
  "textWordCount": 441,
  "archivePath": "data/archives/reviews/the-peewee-herman-show-2010/variety--steven-suskin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:51:01.875Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "wordCount": 441,
  "tierReason": "Full review text"
}