{
  "showId": "chicago-1996",
  "outletId": "hellobeautiful-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://hellobeautiful.com/2015/06/02/brandy-in-chicago-review/",
  "publishDate": null,
  "fullText": "Danielle Young boldly tells stories with heart, sass and humor. She peppers her writing with her larger-than-life personality, sharing her hilarious thoughts on pop culture, lifestyle topics and anything that affects Black women. Danielle loves words and strings them together to create multimedia content that will tug at your heart strings or give you belly-hurting laughs. Give her iced chai lattes, cheese and Netflix so she knows it&apos;s real. Danielle is pretty, witty, girl, worldly. She&apos;s one who likes to party, but comes home early. \t\t\t\t\t\t@rhapsodani\n\nThe name on everybody&#8217;s lips is going to be&#8230;&#8221;Brandy!&#8221; The R&B songstress with the angelic voice is making her mark on Broadway in the sexy musical, Chicago as the lead role of “Roxie Hart.” Brandy has been playing the starring role on Broadway for a limited engagement, starting  April 28 and ending August 2. She&#8217;s extended her role from June 21. Looks like someone is loving their starring role. And for her Broadway debut, Brandy is slaying!\n\nMUST READ: Brandy Hopes Her Role As Roxie Hart In ‘Chicago’ On Broadway Is The First Of Many & So Do We! [EXCLUSIVE]\n\n#TeamBeautiful got the chance to check her out in the sultry production and Mo to the E to the, didn&#8217;t disappoint! She sang (and did her signature Brandy runs) and danced with the best of them. Starring alongside Broadway legend, Amra-Faye Wright, Brandy held her own. Her voice sends goosebumps up your spine, or could it be that you know every woman in the cast has killed someone?\n\nSet in the swanky decadence of the 1920s, Chicago is the story of Roxie Hart, a housewife and nightclub dancer who murders her on-the-side lover after he threatens to walk out on her. Desperate to avoid conviction, she lies to the public, the media and her rival cellmate, Velma Kelly, by hiring Chicago’s slickest criminal lawyer, Billy Flynn to transform her malicious crime into a barrage of sensational headlines, the likes of which might just as easily be ripped from today’s tabloids.\n\nBrandy was lovable as the fiendish, but coy criminal. Her acting was spot-on and her voice was the cherry on top. Chicago is exciting, sexy and absolutely ridiculous and taking that ride with Brandy was one of the most enjoyable Broadway experiences I&#8217;ve had in a long time.\n\nWhen we got invited to see Brandy in a preview of the show before it&#8217;s opening night, she told us, &#8220;I want to do a play a year!&#8221; And we hope she keeps her word because Broadway could use a talent like Brandy. She&#8217;s refreshing on stage and has the kind of quality that makes you smile, even when you know she&#8217;s a murdering liar.\n\nIt&#8217;s amazing to see us on Broadway. There&#8217;s so many different types of shows and so many roles that don&#8217;t require a particular skin tone. Brandy has always been the type of actress to take on a role and completely make it her own. She was Cinderella without being the Black Cinderella. She&#8217;s Roxie Hart without being Black Roxie Hart.\n\nShe&#8217;s only starring as Roxie Hart until August 2 (she won’t be in the show for performances on June 22-23 and June 27-28, due to a scheduling conflict), so you&#8217;d better get your hands on some tickets! Chicago is the #1 longest-running American musical in Broadway history and Brandy is now a part of this history. Awesome! Black Girls Rock!\n\nCatch this sneak peek of Brandy in Chicago:",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 577,
  "archivePath": "data/archives/reviews/chicago-1996/hellobeautiful-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:45:49.523Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20160604100250",
  "archiveOrgUrl": "http://web.archive.org/web/20160604100250/http://hellobeautiful.com/2015/06/02/brandy-in-chicago-review/"
}