{
  "showId": "the-shark-is-broken-2023",
  "outletId": "pagesonstages-wordpress-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.wordpress.com/2023/10/15/shark-is-broken/",
  "publishDate": null,
  "fullText": "The Shark is Broken, 15 October 2023 I went into The Shark is Broken with low expectations. I’m not a huge fan of Jaws and everyone I spoke to (and every casual glance at reviews) suggested that the show was going to be a disappointment. It actually was not a bad show. It did not meet my expectations because my expectations from the marketing material were completely incorrect. Where I expected a funny, if somewhat campy comedy, I found instead a profound character study of the difficult life of actors who take on gigs because they need work. It’s about actors having a miserable time on a film shoot because they don’t get along with each other, don’t know where their lives are going, and are, for the most part, stuck on a boat with a lot of free time on their hands dealing with those realities. It sounds fascinating. And it was. The marketing team profoundly doomed this production. In an attempt to make sure people bought tickets, they deliberately primed people for a hilarious comedy. So the people who attended the show were waiting for jokes. They came to the theatre to laugh. A deep character study wasn’t what they expected to see or what they were mentally prepared for, so they disliked the experience. The disgruntled comments I overheard after the show were about the lack of an actual shark, the show not being funny, and how boring the plot (or lack of plot) was. To put it in terms of another medium, like television, people who wanted to watch a sitcom were instead watching a documentary. If the show had been marketed as a documentary, it would have attracted people who wanted to see a documentary, and they might have absolutely loved the existential questions, the interpersonal frustrations, and the slow progression of the endless waiting game—because that would have been what they wanted to see. The Shark is Broken simply wasn’t a comedy, and even those among the audience who would have enjoyed this kind of character study were primed for a different experience. On the day in question, they thought they had chosen laughter. Perhaps on a different day, this same audience would have chosen thought provoking psychology. A quick word on the production design. I really enjoyed the replication of the low budget, 1970s film style (and the quick shark fin swim by at top of show) as an aesthetic, but after a while, the lightness of the blue video wall became painful to look at and contributed to my ability to be attentive wavering throughout the show. The marketing material did not suggest that the production was replicating this aesthetic, which was just another inconsistency in what people were expecting and what they actually experienced. My final note is on the final moment of the show. There was a missed opportunity to send everyone home with a smile. After the monologue, the off stage crew member voice could have told the actors that they were going to have to reshoot because the shark was broken. All three characters could have sworn loudly and enthusiastically in the subsequent blackout and the whole audience would have left with a chuckle and a smile, as well as some compassion for the characters and how truly trapped they were. I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 563,
  "archivePath": "data/archives/reviews/the-shark-is-broken-2023/pagesonstages-wordpress-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:57:20.339Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}