{
  "showId": "the-shark-is-broken-2023",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/TheSharkIsBroken.html",
  "publishDate": null,
  "fullText": "Theatre Review by Howard Miller - August 10, 2023\n\nThe Shark Is Broken by Ian Shaw and Joseph Nixon. Directed by Guy Masterson. Set and costume design by Duncan Henderson. Lighting design by Jon Clark. Sound design and original music by Adam Cork. Video design by Nina Dunn. Wig design and construction by Campbell Young Associates.\nCast: Alex Brightman, Colin Donnell, and Ian Shaw.\nTheater:  Golden Theatre252 West 45th Street (Between Broadway and 8th Avenue)\nTickets: Telecharge.com\n\nThe play, with a game Colin Donnell as a kinda sorta look-alike Roy Scheider, a grandstanding Alex Brightman as a kinda sorta look-alike Richard Dreyfuss, and Ian Shaw, the show's co-writer (with Joseph Nixon), as an actual look-alike of his father Robert Shaw, places the three lead actors from the 1975 blockbuster movie Jaws aboard a mock-up of the film's fishing vessel Orca. There they brag and argue and complain and smoke and drink and play games and brag and argue some more while waiting out the numerous delays that plague the filming.\n\nProminent among the causes for delay is the repeated breakdown of the mechanical shark, which, somewhere along the line, attained the nickname of \"Bruce.\" Unfortunately, Bruce puts in but a single appearance at the very beginning of the show, in a video clip accompanied by a moment or two of John Williams' well-known two-note leitmotif of impending doom. And even then, the purpose is to feed a joking reference to the play's title, because, indeed, Bruce the shark is broken and will not be seen again for the duration.\n\nAnd that truly is a shame, because if you were to remove the identities of the movie actors, what you would have is just three men on a boat, stuck together by virtue of the situation and basically just killing time. Think of it as the equivalent of Back to the Future without the DeLorean or a plot.\n\nThere is not much else to look at other than the stylish moored boat (set design by Duncan Henderson, who also has provided the Jaws-styled costumes) and, courtesy of video designer Nina Dunn, a view of the ocean off Martha's Vineyard \"between East Chop and Oak Bluffs,\" a piece of specificity offered up in the program that likely will be of interest to a teeny minority of the audience.\n\nIn essence, The Shark Is Broken is a character study in which your level of interest will be tied to your curiosity about the trio of film actors being depicted here, all of them flummoxed by the many delays in shooting and lacking the knowledge of foresight about what ultimately will be the massive popularity and financial success of \"Jaws.\" As the character of Robert Shaw, who plays Quint, the shark-obsessed captain of the Orca in the movie, puts it: \"I think this film is destined for the dustbin of history.\"\n\nDirector Guy Masterson seems to have left the three actors to make what they can from their lines and interactions. The character of Roy Scheider, who plays the police chief in Jaws, is portrayed as the generally calm peacekeeper between the neurotic, insecure Dreyfuss and the neurotic, gruff Shaw. Scheider is a fount of pithy fun facts such as, \"honey is the only food that does not spoil\" and \"sharks have no skeletons.\" He also reads aloud from The New York Times, from which he quotes stories about then-President Richard Nixon's Watergate troubles, telling his colleagues (and setting up the audience for a predictably knowing response) that \"there will never be a more immoral president than Tricky Dicky.\"\n\nThe character of Richard Dreyfuss, whose role in Jaws is that of the marine biologist Matt Hooper, comes off as an anxious, annoying nebbish. Only in his 20s when the film was made (the other two were in their 40s), Dreyfuss is eager to boost his career and his prestige as he nervously awaits his reviews from the film The Apprenticeship of Duddy Kravitz. His use of cocaine feeds his anxiety, and he often finds himself being goaded by the less-than-supportive older Shaw, a seriously heavy drinker. Their biggest and most significant altercation happens when Dreyfuss snatches up Shaw's bottle of alcohol and tosses it overboard. Not a good idea, apparently.\n\nGiven that Ian Shaw is the playwright, it's not surprising that the character of his father is given the juiciest lines. Ian Shaw portrays Robert Shaw as a man who is always on stage, exaggerating his brusqueness and bullying, and emoting his lines as if he were in a production of King Lear. Much is made of his struggling with one of Quint's major speeches, about his experience aboard a Navy ship that was sunk during World War II. We revisit that speech several times until we get to see the final version. It's probably the most interesting moment for fans of Jaws, who will undoubtedly recall the scene, if only for the punctuating light swinging above the actors' heads.\n\nEventually, we get to the last day of filming and the final farewells. Not surprisingly, Scheider proffers his hand to the other two: \"I gotta say, I feel kind of sad. It's been a pleasure, gentlemen.\" And true to form, Shaw and Dreyfuss say goodbye by trading sarcastic barbs. I hate to carp, but while Jaws may be the ultimate fish story, The Shark Is Broken flounders to the end, with neither an engaging hook nor a line of compelling dialog to keep it afloat.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 911,
  "archivePath": "data/archives/reviews/the-shark-is-broken-2023/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:02:55.205Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}