{
  "showId": "the-shark-is-broken-2023",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.theaterscene.net/plays/broadway-plays/the-shark-is-broken/joseph-pisano/",
  "publishDate": null,
  "fullText": "Posted on August 17, 2023 by Joseph Pisano in Broadway, Plays Co-author/actor Ian Shaw as his father Robert Shaw in a scene from his and Joseph Nixon’s “The Shark Is Broken” at the John Golden Theatre (Photo credit: Matthew Murphy) Cinematic nostalgia has hit Broadway hard thanks to two recent West-End imports: Back to the Future: The Musical and The Shark Is Broken. While the former is an unreflective spectacle somnambulantly devoted to its eponymous Reagan-era source material, the latter roguishly subverts undue sentimentality for its own blockbuster audience hook, the 1975 movie Jaws that precipitously turned making a lot of money into a misbegotten form of auteurism. As Ian Shaw and Joseph Nixon, the co-writers of The Shark Is Broken, argue, Jaws was a cultural inflection point that has greatly diminished storytelling sophistication, even in the theater where people are now dumbfounded at the sight of a DeLorean twirling above the orchestra. Shunning their inner Steven Spielbergs–the one-time Hollywood wunderkind behind Jaws who has been trying to assert his adulthood ever since it premiered–Shaw, Joseph, and director Guy Masterson assiduously avoid any pandering whiz-bang theatrics in their talkative three-hander, which is held together by Adam Cork’s evocative original music and Robert Shaw’s testosterone. A rugged English actor with a Shakespearean pedigree and complete disdain for popular entertainment, Shaw’s money woes and many, many children led him to accept a hugely lucrative and unforgettable role in Jaws, one of the most adored films of all time. Life can be cruel that way. Colin Donnell as Roy Scheider, Ian Shaw as Robert Shaw and Alex Brightman as Richard Dreyfuss in a scene from Shaw and Joseph Nixon’s “The Shark Is Broken” at the John Golden Theatre (Photo credit: Matthew Murphy) As for what’s in a name, yes, Ian is Robert’s son, returning the life-giving favor not just through his words but also bodily, portraying his father in The Shark Is Broken with a candid empathy (and astonishing physical resemblance) that highlights the elder Shaw’s strengths while giving context to his weaknesses, too. Because of ongoing technical difficulties with Spielberg’s monstrous mechanical fish, known as Bruce, there was protracted downtime during the filming of Jaws, which the play fills with imagined conversations between Robert and his co-stars Richard Dreyfuss (Alex Brightman) and Roy Scheider (Colin Donnell). Despite set designer Duncan Henderson’s remarkable recreation of the Orca, the movie’s barely seaworthy boat, hardcore Jaws fans might feel as if they’ve been bait-and-switched, since, in the final tally, they only get one early image of a not-so-ominous shark fin to satiate their thrill-and-chill-seeking expectations. In keeping with what’s on the marquee, it quickly malfunctions, sinking into video designer Nina Dunn (for PixelLux)’s vast ocean backdrop, never to be seen again. Any audience disappointment aside, the title is, in fact, a metaphorically intriguing description of Robert Shaw himself, a mercurial alcoholic who much like his character in Jaws–the cantankerous, shark-hunting captain Quint–no longer had youth to romanticize his demons away. The middle-aged Robert succumbed to a massive heart attack only a few short years after Jaws splashed across the silver screen, when Ian was still a child. Regardless of how close a son has come to dramatically finding the father he’s largely known in death, the attempt to do so is lovely and deeply sad. Rounding out the theme, Dreyfuss and Scheider each also reflect on painful connections to their fathers, but it’s Ian’s relationship with Robert that always occupies center stage. Colin Donnell as Roy Scheider, Ian Shaw as Robert Shaw and Alex Brightman as Richard Dreyfuss in a scene from Shaw and Joseph Nixon’s “The Shark Is Broken” at the John Golden Theatre (Photo credit: Matthew Murphy) At least according to the advertising, The Shark Is Broken is ostensibly a comedy, with the humor almost entirely coming at the expense of a twentysomething Dreyfuss, whose familiar nasally voice and outsized gestures Brightman mimics uncannily well. While the overworked crew is engaged in a perpetual offstage battle to fix the fake shark–the movie’s real star–Robert merrily heaps contempt on Dreyfuss for his neurotic navel-gazing, unseemly obsession with achieving fame, and, most devastatingly, mannered acting style. Like a typical bully, Robert contends that his gibes are supposed to, in the long run, benefit Dreyfuss, supposedly by convincing him to take his profession more seriously; maybe that’s the occasional intent, but it’s to the play’s clear-eyed credit that we also comprehend much of Robert’s behavior as cruelty for cruelty’s sake. That doesn’t mean Dreyfuss is solely a verbal punching bag, which would make all the laughs in The Shark Is Broken guilty ones. Every now and then, Dreyfuss gives, if not as good as he gets, at least enough of a poke to signal he’s not just lying on the canvas. Meanwhile, though mostly presented as a paragon of equanimity, Scheider’s own pent-up frustrations boil to the surface when filming interrupts his sun-worshiping alone time. Judging by all the craning necks after the very buff Donnell stripped down to his skivvies, beefcake decidedly rivals a flying DeLorean in its visual appeal. But the late-in-the-play scene also facetiously suggests the psychological cost of being the cloistered referee for two egomaniacs. Alex Brightman, Ian Shaw and Colin Donnell in a scene from Shaw and Joseph Nixon’s “The Shark Is Broken” at the John Golden Theatre (Photo credit: Matthew Murphy) The play is loosely framed around Robert’s repeated attempts to will humanity out of Quint’s big monologue in Jaws, with the actor eventually shaping what he initially dismissed as abject drivel into a harrowing explanation of his character’s Ahab-like fixation. It’s a sweet tribute to Robert’s talent, one being given by a son to the father he has now passed in age, and preceded by the revelations that Robert’s own dad was not only also an alcoholic but committed suicide. Admittedly, if someone else were portraying Robert, without all of the meta undercurrents, it’s unlikely The Shark Is Broken would be as touching. But that’s a review for another day. The Shark Is Broken (through November 19, 2023) John Golden Theatre, 252 West 45th Street, in Manhattan For tickets, call 800-447-7400 or visit http://www.thesharkisbroken.com Running time: one hour and 35 minutes without an intermission With the 1975 blockbuster Jaws as his bait, a son attempts to find the father he barely knew.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 35,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1053,
  "archivePath": "data/archives/reviews/the-shark-is-broken-2023/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:09:25.760Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "scoreSource": "extracted-strong-negative",
  "scoreConfidence": "medium",
  "extractedPhrase": "avoid"
}