{
  "showId": "the-shark-is-broken-2023",
  "outletId": "theaterlife-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://theaterlife.com/the-shark-is-broken/",
  "publishDate": null,
  "fullText": "August 14, 2023: Rub a dub dub/ three men in a tub/ and who do you think they be? Richard Dreyfuss, Roy Scheider/ and Robert Shaw, all of them gone to sea. Last week, just when you thought it was safe to go back in the water, a shark took a bite out of a 65-year-old swimmer at Rockaway Beach. What better timing for the opening of The Shark Is Broken,a Broadway play about the making of Jaws, Steven Spielberg’s 1975 bloody flesh biter, starring the above-mentioned thespians? Unless you’ve been living 20,000 leagues under the sea, you’ll remember it for depicting the search for an even hungrier shark in the waters off the fictional New England town of Amity. On board a fishing boat called the Orca are its ruthless, Ahab-like captain, Quint, played by Shaw; Brody, the local sheriff, portrayed by Scheider; and Hooper, a marine biologist, taken by Dreyfuss. August 14, 2023: Rub a dub dub/ three men in a tub/ and who do you think they be? Richard Dreyfuss, Roy Scheider/ and Robert Shaw, all of them gone to sea. Last week, just when you thought it was safe to go back in the water, a shark took a bite out of a 65-year-old swimmer at Rockaway Beach. What better timing for the opening of The Shark Is Broken,a Broadway play about the making of Jaws, Steven Spielberg’s 1975 bloody flesh biter, starring the above-mentioned thespians? Unless you’ve been living 20,000 leagues under the sea, you’ll remember it for depicting the search for an even hungrier shark in the waters off the fictional New England town of Amity. On board a fishing boat called the Orca are its ruthless, Ahab-like captain, Quint, played by Shaw; Brody, the local sheriff, portrayed by Scheider; and Hooper, a marine biologist, taken by Dreyfuss. Following a tryout in Brighton, England, The Shark Is Broken appeared at the Edinburgh Fringe in 2019 before running on the West End during the 2021-2022 season. Co-authored with Joseph Nixon by Robert Shaw’s son, Ian (his mother was actress Mary Ure), who plays his own father, it’s a behind-the-camera look at how the three clashing stars dealt with each other aboard the boat when production delays caused by difficulties with the movie’s mechanical shark, nicknamed Bruce, caused one delay after the other, throwing the bored actors on their own resources. Given the legions of fans who love every bite of Spielberg’s saltwater chomper (filmed at sea, not in a studio tank), it’s a toothy idea for popular success (much as Back to the Future is discovering a few blocks away); however, director Guy Masterson is no Spielberg, allowing his otherwise talented cast to chew the scenery almost as ravenously as the great white does his victims. The Shark Is Broken commences with a nod to the film’s unforgettable thumping music (sound design and original music by Adam Cork). A chief source for its veracity—among the writers’ many references—was a drinking diary left behind by Robert Shaw. With the mustachioed Ian Shaw providing as dead a ringer for his dad as you could imagine, it’s only reasonable to expect the myriad of Jaws fans to relish this account of what it was like for Shaw, Scheider, and Dreyfuss to be bobbing about in such close quarters with precious little to occupy them as the film crew labored to fix Bruce. Designer Duncan Henderson—who also copies the film’s costumes precisely—has created a perfect replica of the Orca in cutaway, the acting area being confined to rather close quarters, which Masterson handles more adroitly than he does the actors’ emoting. The filming locale, in the waters off Martha’s Vineyard, is manifested via the magic of seaworthy projections (gulls included) by Nina Dunn (supplemented by Jon Clark’s fine lighting), even to the point of downstage water lapping at the fishing boat’s hull. Something similar was seen in the recent The Life of Pi; one wonders if, with all the other trigger warnings producers now provide, shows like this should warn viewers to bring Dramamine along. With Ian Shaw leading the way, great consideration has been given to casting actors as physically close to the originals as possible. Alex Brightman’s (Beetlejuice) Dreyfuss is a tad chubbier than the real McCoy but his gold-tinted tresses (wigs by Campbell Young Associates) and beard make him a thoroughly acceptable avatar. And Colin Donnell’s (Peacock’s “Irreverent”) Scheider, apparently not trying to copy the actor’s famously irregular nose (broken in prize fight), has a similarly lean face and chiseled torso (the latter notably showcased when he strips down to a speedo for sunbathing.) For around 90 minutes we watch the dynamics of this exaggeratedly volatile trio play themselves out. Shaw, a classically trained Brit, is a caustic alcoholic (hidden stash and all), aggressively loud and domineering (much like Quint), who’d rather be writing than acting, and certain that the movie will be a dud. Numerous references to the actors’ skepticism about the film’s potential rise to the surface so the audience can bathe in the irony provided by their knowledge of its eventual huge success. Shaw, with his gruff delivery, comes closest to sounding like the person he’s portraying. Brightman, who never really nails Dreyfuss’s voice, plays him as sniveling, panic-stricken, and clinically insecure. Impatient with the film’s technical difficulties, he’s narcissistically preoccupied with his budding career, and thrilled to read the raves for his recent work in The Apprenticeship of Duddy Kravitz. He gets a big laugh with his line, “I’m from Queens, man! Of course I’ve never seen a real live shark!” (Amusing it may be, but I’d like to remind readers that Rockaway Beach is in Queens.) Donnell’s Scheider, his attempt at the actor’s New Jersey accent being more liability than asset, is the most laidback of the three, seemingly content to patiently pass the hours reading the Times, and to offer the occasional factoid for his costars to contemplate. The conversation allows for lots of exposition about the actors’ widely disparate artistic and personal backgrounds (lots of father-related rumination), and for their occasional flare-ups. There are arguments about various things, such as their billing, the movie they’re in, and topical issues, some based on what we know the future holds in store. References to Richard Nixon, for example, are intended to get easy laughs—even applause—by immediate identification with another crooked president who came later. Each actor gets to have one or more scenes of histrionic grandstanding, the otherwise complacent Scheider’s being unlike his fellows, presented in purely physical terms. Alone on stage with baseball bat in hand, he threatens repeatedly to smash the boat’s radio. The most organic acting highlight arrives when Shaw, after repeated difficulties, ultimately masters Quint’s memorable speech about a massive shark attack during World War II. It’s a pitch-perfect recreation of his father’s performance. The audience when I attended was hungry for comic chum, swallowing it hook, line, and sinker, but the best my old jawbone could muster was about half a dozen modest chuckles. While I recognize the inherent interest in a play about the lives and personalities of famous actors, especially when making an iconic movie, a work based on such material is not unlike watching a gossip magazine come to life, with anecdote dominating drama. But what most made me critically seasick in The Shark Is Broken was the bombast of its acting, especially the excessively shouting Shaw and the frenetically paranoid Brightman. Whatever realism these actors achieve on the surface is blown out of the water by such overdone characterizations. Only Donnell—mainly because of the role’s inherent restraint—manages to keep his cool, until, as noted, he doesn’t, almost as if the playwrights and director felt it incumbent to offer him his own moment of hammy glory. Rockaway Beach is now under close surveillance to assure swimmers it’s safe to go back in the water. It’s probably a lot safer to pay a visit to the John Golden Theatre for this mildly entertaining view of movie history in the making, where the shark is broken and the actors float on a phony boat. Just don’t forget the Dramamine. The Shark Is Broken ***John Golden Theatre252 W. 45th Street, NYCOpen runPhotography: Mathew Murphy",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 85,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1368,
  "archivePath": "data/archives/reviews/the-shark-is-broken-2023/theaterlife-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:06:52.913Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "scoreSource": "extracted-strong-positive",
  "scoreConfidence": "medium",
  "extractedPhrase": "raves"
}