{
  "showId": "camelot-2023",
  "outletId": "deadline",
  "outlet": "Deadline",
  "criticName": "Greg Evans",
  "url": "https://deadline.com/2023/04/camelot-broadway-review-aaron-sorkin-phillipa-soo-lincoln-center-theater-1235323423/",
  "playbillVerdictUrl": "https://deadline.com/2023/04/camelot-broadway-review-aaron-sorkin-phillipa-soo-lincoln-center-theater-1235323423/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "nyc-theatre",
    "bww-reviews",
    "bww-roundup"
  ],
  "nycTheatreExcerpt": "went neutral, summing up the views of most the rest of the press:",
  "contentTier": "needs-rescrape",
  "tierReason": "Only aggregator excerpts available",
  "rejectedAt": "2026-02-03T20:52:38.071Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a fragment describing what a critic did rather than actual review content with evaluative language about the show; openai: The text provided is not a review but a summary of other press opinions, lacking any direct evaluation of the show.; gemini: The provided text is not a review, but rather a note indicating the critic is summarizing other reviews.",
  "promptVersion": "5.2.0",
  "showScoreExcerpt": "“The original orchestrations by Robert Russell Bennett and Philip J. Lang, here brought to life by a fine 30-piece orchestra conducted by music director Kimberly Grigsby, go a long way in explaining ‘Camelot’s’ enduring appeal.”\n\nRead more",
  "bwwExcerpt": "Aaron Sorkin works up an answer to that question in the new Lincoln Center Theater production of the 1960 Lerner & Loewe musical, and the result is an adaptation that seems at every turn to be pleading its case for its own relevance. Where the West Wing creator conjured a real sort of writerly sorcery in 2018 with his transformation of the beloved property To Kill A Mockingbird into a new, relevant and thrilling stage work, his efforts this time around often seem strained in their attempts to drag Camelot into the 21st Century.",
  "bwwScore": 5,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-CAMELOT-Opens-On-Broadway-Starring-Phillipa-Soo-Jordan-Donica-Andrew-Burnap-More-20230413"
}