{
  "showId": "camelot-2023",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/entertainment/broadway/ny-camelot-broadway-review-chris-jones-20230414-dabflhnag5ggbp5m2hg2rek3le-story.html",
  "playbillVerdictUrl": "https://www.nydailynews.com/entertainment/broadway/ny-camelot-broadway-review-chris-jones-20230414-dabflhnag5ggbp5m2hg2rek3le-story.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Just days after the assassination of John F. Kennedy in 1963, his grieving widow Jackie Kennedy quoted her late husband’s favorite Broadway musical in an interview in Life Magazine: “Don’t let it be forgot, that once there was a spot, for one brief shining moment, that was known as Camelot.”\n\nThis was an act of brilliant mythologizing, and it stuck: JFK’s short, tragically curtailed administration became cemented in the American mind with Arthurian legend and thus with justice, kindness, chivalry, eloquence and romance.\n\nHad Jackie Kennedy seen the revival of Alan Jay Lerner and Frederick Loewe’s “Camelot” now at Lincoln Center — with book by Aaron Sorkin and directed by Bartlett Sher, with Andrew Burnap as King Arthur, Phillipa Soo as Guinevere and Jordan Donica as Lancelot — she’d hardly have chosen such a connection. This 2023 “Camelot” has more the nihilistic ambiance of “Game of Thrones” than an East Wing filled with art. It’s the chilliest “Camelot” you ever did see and it embodies so many of the current neuroses surrounding the revival of classic American musicals.\n\nJordan Donica, Phillipa Soo (background), Andrew Burnap and the company in Lincoln Center Theater's production of \"Camelot.\" (Joan Marcus/Joan Marcus)\n\nThese include: unease with sex (the barely danced “Lusty Month of May” number is about as sexy as January wind chill); fear of the narrative dominance of a handsome, confident, heterosexual male, which means that Donica gets heavy eyeliner and Burnap, for all his talent, comes off as a less-than-effectual wimp half the time; and, above all, a profound distrust of the ability of people in power, like kings and queens and presidents, to do the right thing.\n\nSuch a view is perfectly valid, but begs the question: Why are you reviving “Camelot” if not just to cash in on an audience expecting something completely different?\n\nSure, gorgeous songs like “If Ever I Would Leave You” and “I Loved You Once in Silence” are there, and technically well sung with the underpinning of Lincoln Center’s typically fine orchestra, but they are shorn of belief because the production keeps running scared of love.\n\nPhillipa Soo and Andrew Burnap in Lincoln Center Theater's production of \"Camelot.\" (Joan Marcus/Joan Marcus)\n\nInstead, we get a focus on Arthurian flaws (and American ones by metaphoric extension), rather than Arthurian possibility. The Knights of the Round Table don’t even get a table, at least not one you can read on a set from Michael Yeargen that seems to eschew any kind of permanence. The dominant visual is an empty stage.\n\nAt the end of the night, though, and notwithstanding whatever changes you might want to make to the 1960 world view, what really matters is that the audience believes in, and pulls for, the love of Arthur and Genny because it is a stand-in for American democratic values.\n\nHere, you just don’t. That’s partly because neither one seems vulnerable to the charms of the other and also because they appear to be in different worlds. Burnap, for example, leans into the contemporary while Soo has a stylized, royal-like accent and delivery. Her work is more traditionally “Camelot,” but hardly au fait with the rest of this show.\n\nPhillipa Soo (center) and company in Lincoln Center Theater's production of \"Camelot.\" (Joan Marcus/Joan Marcus)\n\nAnd Donica, the most successful of these three and the only one who really blows out the thrilling score, seems very much in a fantasy world. His Lancelot is not so much a disciplined, sexual option for Ginny that she needs to avoid (albeit with difficulty the audience understands) as a fascinating visitor from another galaxy.\n\nThings in the show go especially haywire in Act Two when Arthur’s old lover Morgan Le Fey (Marilee Talkington) enters the action. Sorkin’s new book sees her as smarter and even more prophetic than Arthur, which fights the show’s original dramaturgical structure like mad, but even if you buy that idea, it gets lost in an ambitious, split-screen kind of sequence in Sher’s production that completely loses the thread of the action and confuses the audience.\n\nAnd after that, the show can’t recover, even with its famously emotional ending. Here Lerner’s brilliantly written finale feels merely rote, which, frankly, tears at the heart of anyone who deeply loves this masterpiece.\n\nJordan Donica as Lancelot du Lac in Lincoln Center Theater's production of \"Camelot.\" (Joan Marcus/Joan Marcus)\n\nThe production is, of course, a victim of its times and the deeply troubling, increasingly settled Broadway wisdom that you cannot just do these older musicals and trust the audience to put them in the context of their times, but you have to render them palatable for the moment. Which means adding political cynicism, mental confusion, fear of sex and a demonstrated distrust of American exceptionalism, even allowing for its human failings, which Broadway always, always did.\n\nYou can try. But a growing preponderance of evidence suggests it’s better to write a new musical.",
  "isFullReview": true,
  "textWordCount": 820,
  "archivePath": "data/archives/reviews/camelot-2023/nydailynews--chris-jones_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:49:17.888Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230414065950",
  "archiveOrgUrl": "http://web.archive.org/web/20230414065950/https://www.nydailynews.com/entertainment/broadway/ny-camelot-broadway-review-chris-jones-20230414-dabflhnag5ggbp5m2hg2rek3le-story.html",
  "contentTier": "complete",
  "wordCount": 820,
  "tierReason": "Full review text"
}