{
  "showId": "camelot-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2023/04/13/camelot-lerner-loewe-revisal-not-charismatic-spot/",
  "publishDate": "2023-04-13T21:23:33",
  "fullText": "As for the Lincoln Center Theater revival of the Alan Jay Lerner-Frederick Loewe-Moss Hart Camelot: The first thing to know is it’s not a revival. It’s what’s categorized these days as a ”revisal.”\n\nNothing wrong with that, as far as I’m concerned. I saw the original (1960) production, in which Lerner ran headlong into a daunting problem while adapting T. H. White’s The Once and Future King for the musical stage.\n\nWhite wrote at length, somewhere close to 700 pages. Lerner maybe managed in his first act to cover, with great whimsey and charm, approximately the first 100 or so pages of mythical King Arthur’s marriage to Guenevere and her disastrous extra-marital affair with Launcelot du Lac. The beset librettist then attempted to crowd White’s remainder into a second act that all but begged for once and future revisals.\n\nWhich is where the estimable Aaron Sorkin comes in. His last adaptation, the top-drawer To Kill a Mockingbird, had Bartlett Sher directing; he also directs the new Camelot, following up his LCT South Pacific and My Fair Lady hits. Now Sher and Sorkin are reteamed, Sorkin acknowledging in more than one interview that, while loving musicals, he’s never written the book for one.\n\nSo, how did he intend to crack this assignment? “I wanted this King Arthur to grow up to be Martin Sheen in The West Wing,” he has said. In other words, he’s going to write material harking back to material with which he’s already familiar, already comfortable. Turning The Once and Future King into a middle ages version of a dramatic television series, he starts by removing all the elements of magic that White instilled. He forgoes the notion of stage magic so he can focus on the transplanted aspects on a 21st-century White House.\n\nResult? His story lacks magic. Arthur (Andrew Burnap) is a pleasant enough young bloke who has (democratic?) notions of a unifying (never seen) round table. He meets his not cute but cold, arranged French bride Guenevere (Phillipa Soo) in a setting that designer Michael Yeargan envisions as, with its lone leafless tree, something like Samuel Beckett’s barren Waiting for Godot plain.\n\nExtolling the magic of his adopted home, he sings “Camelot,” which Guenevere quickly dismisses as a “dumb song.” That’s right. What Jackie Kennedy labeled the Kennedy administration signature anthem, is now a dumb song and, presto-chango!. establishes this Queen-to-be as the coolest of pragmatists. (It’s a good bet neither Lerner nor Loewe would have allowed this development were they able to be consulted.)\n\nGuenevere remains deep-winter chilly throughout Sorkin’s revised proceedings. That includes her introduction to Lancelot (Jordan Donica), who has already intoned “C’est Moi,” but is now to be informed in so many words by the haughty lady that his boastful “It’s me” cuts no ice with her.\n\nAs Sorkin writes her, she’s so off-putting and off-put that (spoilers heading this way) nowhere in this Camelot does chemistry between Lancelot and her intrude, this despite a truncated bedroom scene. It’s even a weird surprise when in the final sequence Guenevere confesses she’s loved Arthur from the first words he spoke to her. Really? “Dumb song”? Guenevere could’ve fooled him – and the audience.\n\nAlong the rocky Camelot way, there is some strong singing, especially from Soo, who initially proved her vocal prowess in Hamilton. The always engaging Taylor Trensch enlivens things as Arthur’s bastard son by Morgan le Fey (Marilee Talkington). He turns his Camelot-ending villainy into brief fun.\n\nEven more welcome is Dakin Matthews as Merlyn and Pellinore. Sorkin sends Merlyn into the wings after the first scene, the disappearance serving as a metaphor for Sorkin’s dismissing so offhandedly the mere thought that anything magical should occur during this nearly three-hour evening. Also, the swordplay at the Arthur and knights challenge to Lancelot (B. H. Barry the fight director) is flashy stuff, at last a few minutes of heated stage action.\n\nThe belated good revisal news is that this Camelot can boast heroes: Lerner and Loewe, of course. Whereas bookwriter Lerner couldn’t solve his book (musical lovers know the non-stop disasters plaguing the endeavor), he triumphed with his lyrics. Loewe set them equally triumphantly. Nothing can beat ‘I Wonder What the King is Doing Tonight,” “How to Handle a Woman” or ‘What Do the Simple Folk Do?” “If Ever I Would Leave You” may be the last great love song composed for a Broadway musical.\n\nNot a clinker among the tunes, certainly not as initially delivered by the magical Richard Burton, Julie Andrews, Robert Goulet, and Roddy McDowell. And yet, even the Lerner and Loewe score runs into trouble. Due to Sorkin’s undernourished scribing, the emotions the songs reveal don’t fit the emotion-deprived characters.\n\nSince, for instance, the audience gets no glimpse of the clandestine Guenevere-Lancelot romance, her “Before I Gaze at You Again” and his ”I Loved You Once in Silence” lack the required weight. Lancelot is offered so little by the no-nonsense Guenevere that he’s never viewed truly loving her, not even once in silence. Earlier, she hardly seems the best candidate to lead “The Lusty Month of May,” From this version’s start to almost the finish, Guenevere masks any lustful twinge she might feel.\n\nIn short, these Camelot revisers do not metaphorically pluck magic sword Excaliber from its stone. They leave it there. There’s simply not a more congenial spot for happily ever-aftering than here in Camelot; it’s just that this particular Camelot spot isn’t that Camelot spot.\n\nCamelot opened April 13, 2023, at the Vivian Beaumont Theater. Tickets and information: lct.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2023/04/13/camelot-revival-offers-one-and-only-one-brief-shining-moment/"
}
