{
  "showId": "camelot-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2023/04/13/camelot-revival-offers-one-and-only-one-brief-shining-moment/",
  "publishDate": "2023-04-13T21:24:28",
  "fullText": "One of the problems with producing first-class productions of classic musicals from the so-called Golden Age is that there aren’t quite enough of them to go around. Lincoln Center Theater and resident director Bartlett Sher have favored playgoers with resplendent productions of Rodgers and Hammerstein’s South Pacific and The King and I, followed by a slightly engineered but nevertheless satisfying production of Lerner and Loewe’s My Fair Lady.\n\nNow comes Lerner and Loewe’s Camelot, which alas cannot hold a candle to My Fair Lady. Director Sher has called in Aaron Sorkin, that man for all seasons, to try to fix the book. Lyricist/librettist Alan Jay Lerner spent a fair amount of time trying to fix it himself; this proved impossible, as the intertwined love stories he concocted are never, either of them, altogether convincing. One doesn’t begrudge the folks at Lincoln Center, nor the authors’ estates, from handing it over to the man from The West Wing. But Sorkin runs into the same problem Lerner did, and without new songs to go with the new characterizations, Camelot remains as disjointed as before.\n\nThis musical about “that one brief shining moment” has gone down in memory, among people who never saw it, as a classic. But Camelot—in its original 1960 production, starring the young Richard Burton and the younger Julie Andrews, as well as the relatively few major revivals starring the likes of Richard Harris or the aged-and-wobbly Burton himself—has always been a lumbering affair. Memories of the justly treasured original cast album make some folk recall it as a great show; I mean, Robert Goulet singing “If Ever I Would Leave You” has the resonance of “Younger Than Springtime” and “On the Street Where You Live” combined. Listeners are welcome to their fond memories of the score, yes. But the romantic core of the book, with its “boy gets girl, boy loses girl, boy sends girl to be burned at the stake” center, was unconvincingly unworkable in 1960 and remains so in Sorkin’s 2023 rewrite.\n\nIt is simplistic to say that the present-day King Arthur and Queen Guenevere cannot hope to compare to memories of Burton and Andrews; who can? Few of today’s playgoers likely saw Burton, who left the show after less than a year and who was the only one among Lerner, Loewe, Andrews, and the original production’s director and producers to nab a Tony. That said, the best-selling cast album makes many think they saw—and loved—that first Camelot.\n\nLincoln Center’s king (Andrew Burnap) and queen (Philippa Soo) do well enough, given that Sorkin has pulled out the underpinnings of their characters and motivations. Soo (of Hamilton among other entertainments) comes off best, shining through the befogged proceedings even though portions of her songs have been trimmed. Burnap (of The Inheritance) makes a likable Arthur, if you can forget Burton. Jordan Donica, who without that grizzly beard sang “On the Street Where You Live” in Sher’s My Fair Lady, sings up a storm as the Frenchified Lancelot, just like Goulet did sixty years back. If there is “one brief shining moment” in this production, it’s when Donica launches into “If Ever I Would Leave You.”\n\nIf Donica raises the Beaumont rafters, let it be said that nobody else does. LCT has continued its noble mission of restoring the musical splendor of its revivals, in this case with the original orchestrations (by Russell Bennett and Phil Lang) and a bulging pit orchestra (of 29). But there’s a mismatch; you might well need those 29 court musicians when you’ve got a chorus of 42 singers and dancers-who-sing, as in 1960. But here we’ve got a downsized combined ensemble of a mere dozen. Music director Kim Grigsby and her players sound great, but only point to the lack of choral power—and composer Loewe prided himself on the choral work in his scores. Compare this to the recent cornbread Oklahoma!, with its seven-piece fiddle-and-guitar band; as much as we honor Russell Bennett, that staging would not have worked so well with the full orchestration—which would have sounded, indeed, as if it was from another century.\n\nThere is a similar lack of splendiferous panoply. The original Camelot was the most luxuriously ornate musical ever to hit the Rialto, so much so that when John Shubert—the only child among the three brothers Shubert—died in 1962, his funeral was held at the Majestic on Oliver Smith’s stunning throne-room set. Up at Lincoln Center, Sher’s usually majestical set designer Michael Yeargan seems to have been restricted to two thrones stranded in a sea of open space. There’s not even one of those tents with pennants streaming they used to erect for the nobility. Burton, famously, made his entrance from up a tree (where Arthur was hiding from the approach of his bride-to-be). Here, said tree is a spindly affair that looks like it’s constructed from cardboard. So much for that star entrance. The lavish costumes called for by Camelot, and by the Arthurian legend itself, are curiously absent; instead of all those royal ermines and gold-threaded purple tunics, Jennifer Moeller attires her players in stylish and relatively inexpensive black. What fun is there in that? The far reaches of empty stage space are, at least, effectively lit by Lap Chi Chu.\n\nStruggling to keep the proceedings under three hours, Sorkin eventually resorts to a dramatically lazy overlay of three items: the meeting between Mordred and Morgan Le Fey, who in this version is not the mystical sorceress of old but what I suppose they’d call a “lady scientist” and—get this—Arthur’s first love and mother of his child; Guenevere and Lance consummating their affair and, ultimately, being caught in flagrante; and the song “Fie on Goodness,” a clumsy filler which was never much good and Lerner himself tossed out while he was trying to fix the show. Not surprisingly, this cinematic overlap bogs down.\n\nWe end up with one of those “I’ve always loved you, from the first moment” scenes between Arthur and Guenevere. That’s fine for Sorkin’s version of the book, if he feels audiences need it; but there is little in the Lerner script or the Lerner and Loewe score to support it. Guenevere’s one musical moment of honest emotion in the score, “I Loved You Once in Silence,” is unaccountably given to Lancelot, leaving Guenevere stranded.\n\nLet us add that Sorkin sees fit to have his Guenevere refer to Arthur’s signature song, “Camelot,” as “dumb” and, later, as “that stupid song about the weather.” I can’t say that I agree, personally; and I suppose that the thin-skinned Lerner would have been enraged to have that opinion of “Camelot” memorialized from the stage of his show.\n\nCamelot opened April 13, 2023, at the Vivian Beaumont Theater. Tickets and information: lct.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial"
}
