{
  "showId": "skylight-2015",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2015/04/03/theater/review-carey-mulligan-and-bill-nighy-in-skylight.html",
  "publishDate": "April 2, 2015",
  "fullText": "Ms. Mulligan and Mr. Nighy achieve something miraculous here: They make you feel as if you're eavesdropping on a real conversation between two people with a tangled history, not watching actors deliver lines.",
  "isFullReview": false,
  "dtliExcerpt": "Ms. Mulligan and Mr. Nighy achieve something miraculous here: They make you feel as if you're eavesdropping on a real conversation between two people with a tangled history, not watching actors deliver lines.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "They are hardly a well-matched pair, this couple that has been given such transfixing life in two of the most expert stage performances you're likely to see for many seasons. As embodied by Carey Mulligan and Bill Nighy in the heart-piercing revival of David Hare's 'Skylight,' Kyra Hollis and Tom Sergeant have none of the things in common that usually make for a fine romance...Yet as you watch Ms. Mulligan and Mr. Nighy move magnetically toward and away from each other in Stephen Daldry's exquisitely balanced London-born production...you can't help thinking that on some profound level these two were made to be together...The great achievement of this production from Mr. Daldry...is that it sustains each perspective with crystalline focus...As played by Ms. Mulligan...Kyra is obdurately calm and centered. But Ms. Mulligan achingly conveys just how hard-won this defensive stillness is. She has an uncommon gift for radiating complex layers of feeling by simply inhabiting a space. Mr. Nighy's Tom, in contrast, is a blinding kinetic force, a creature who never stops moving, advancing and retreating in a flurry of knife-edged angles, forever casing out and sizing up his environment.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-SKYLIGHT-Opens-on-Broadway-Updating-LIVE-20150402",
  "showScoreExcerpt": "Ms. Mulligan and Mr. Nighy achieve something miraculous here: They make you feel as if you're eavesdropping on a real conversation between two people with a tangled history, not watching actors deliver lines.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (33 words)",
  "textQuality": "truncated",
  "playbillVerdictUrl": "http://www.nytimes.com/2015/04/03/theater/review-skylight-with-carey-mulligan-and-bill-nighy-opens-on-broadway.html?partner=rss&emc=rss&_r=0",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "rejectedAt": "2026-02-03T19:54:27.223Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a brief excerpt or quote fragment, not a complete review with sufficient evaluative content to determine a recommendation; openai: The review text is about a different show featuring Ms. Mulligan and Mr. Nighy, not the target Broadway show.",
  "promptVersion": "5.2.0",
  "bwwScore": 8
}
