{
  "showId": "pass-over-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2021/08/22/pass-over-a-play-that-speaks-to-our-times/",
  "publishDate": "2021-08-22T17:50:55",
  "fullText": "Antoinette Chinoye Nwandu’s Pass Over has opened on Broadway, making it the first play to appear there since theaters were closed down as a result of the pandemic 17 months ago. That’s the good news.\n\nThe bad news is that this allegorical, racially charged drama is sadly more relevant than ever.\n\nPreviously seen in earlier, pre-pandemic productions at Lincoln Center’s Claire Tow Theater and Chicago’s Steppenwolf (that version, filmed by Spike Lee, is available to watch at Amazon Prime), the play would seem an unlikely prospect for, no irony intended, the Great White Way. An intimate, three-character piece riffing on Waiting for Godot and incorporating biblical themes, particularly from the Book of Exodus, hardly seems a likely prospect for commercial success. The fact that it’s being presented in the spacious August Wilson Theatre, more customarily a home for lavish musicals, doesn’t help. And yet, a second viewing only confirms that it’s the play we need right now.\n\nThe pandemic and the brutal murder of George Floyd (not that there was any shortage of police killings of unarmed black men before then) have only added extra resonance to this blistering, highly theatrical work. Its flaws haven’t been eradicated for this version which features a radically rewritten ending. But they’re easier to overlook, especially since this is the sort of challenging, provocative fare too rarely seen on Broadway.\n\nThe single setting is a bleak urban street dominated by a looming lamppost and featuring little more than an abandoned tire. There, two African-American men, the alpha-male Moses (Jon Michael Hill) and his sidekick Kitch (Namir Smallwood)—any relationship to Beckett’s Vladimir and Estragon is presumably purely intentional—pass their considerable time hanging out with no apparent purpose. Their profanity-laden banter, which includes a plethora of F-bombs and constant unsettling use of the N-word, at one point includes imagined calls to room service from which they order lobster rolls, caviar and champagne.\n\nThey also anxiously worry about their harsh environment’s dangers, particularly from the police, or “po-pos.” Their existential dread is frequently conveyed through ominous sound effects and sudden lighting shifts during which they momentarily freeze in terror.\n\nTheir rambling conversation is suddenly interrupted by the incongruous presence of a tall, gangly white man (Gabriel Ebert, resembling the love child of Lyle Lovett and Big Bird), clad in an all-white suit and carrying a picnic basket. Moses and Kitch assume the stranger is either a Mormon or a police officer, but he assures them that he’s simply on his way to visit his ailing mother with a supply of food. He’s endlessly enthusiastic and friendly, peppering his language with such expressions as “Gosh, golly gee!” He also offers the two men a repast from his basket, leading to one of the show’s funniest (albeit familiar) absurdist sight gags.\n\nThe initially friendly encounter eventually proves tense when Moses addresses the stranger as “Mister.”\n\n“Master,” the man corrects him. “My name is Master,” he says, in a suddenly charged moment that produces shocked gasps from audience members. Things get even more tense when Master comments disapprovingly about Moses and Kitch’s constant use of a certain word, pointing out that there seems to be a double standard. “If I don’t get to say the N-word, why do you?” he asks. Not long after, he takes his leave, wishing the men “Salutations and good evening.”\n\nLater in the play, another white man appears. He’s a police officer (Ebert, his character identified in the program as “Ossifer”), who greets the pair in friendly fashion before predictably turning menacing. He eventually leaves them alone but later returns, leading to a tense confrontation that turns violent. It doesn’t turn out the way you’d expect, as Moses suddenly displays miraculous powers akin to those sported by his biblical namesake.\n\nAs if to offer theatergoers a ray of hope amidst these perilous times, the play now features a new, more mystical and less bleak ending that provides spiritual optimism as well as a few chuckles. It also offers the opportunity for scenic designer Wilson Chin to alleviate the production’s visual drabness with a majestic visual representation of the Promised Land.\n\nWhile Pass Over marks an auspicious Broadway debut for its talented playwright, it’s not fully successful as drama. Despite its short running time, the work often feels aimless and repetitive, its poetically stylized dialogue occasionally coming across as forced and making the evening seem longer than it is. Too often, you feel Nwandu straining to weave together her numerous themes and allusions. Nonetheless, the play packs a powerful punch, abetted by Danya Taylor’s highly theatrical staging.\n\nThe three actors, repeating their Lincoln Center performances, couldn’t be better. Hill and Smallwood expertly play off each in the manner of seasoned vaudevillians, while Ebert delivers a tour-de-force turn, infused with comic physicality and an undercurrent of danger, that keeps us on edge even as we’re laughing.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
