{
  "showId": "pass-over-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2021/08/22/pass-over-waiting-for-the-po-po-hoping-for-the-promised-land/",
  "publishDate": "2021-08-22T17:51:07",
  "fullText": "It is good to be back in a Broadway theater—with an Excelsior Pass, a mask, and two (two!) exuberant rounds of applause during the pre-show announcement.\n\nIt is good to be at Pass Over—an intense and provocative new play by Antoinette Chinonye Nwandu that updates Waiting for Godot, sort of, to examine the constricted and oppressed lives of young inner-city Black men.\n\nBut it is hard being the play’s protagonists—two impoverished friends, Moses (Jon Michael Hill) and Kitch (Namir Smallwood), literally stuck on an inner-city corner, metaphorically trapped by society and history.\n\nPass Over exists on those two planes, or at least those two: The Playbill places its setting as “the river’s edge, but also a ghetto street, but also a plantation, but also a desert city built by slaves.” The passing over of the title is Moses and Kitch’s quotidian fantasy of getting out, leaving their block, making it in the world; but it is also the Exodus, or the mythical exodus they’re yearning for.\n\nThe play opens at its most Godot-ish, two men onstage, a streetlight looming over them like a tree, one of them futzing with his shoe. Boasting and joking, trash-talking and wordplay, their idle talk is its own absurdist dialogue. A recurring game is listing their “promised land top ten,” ten items they dream of, from “new Air Jordans, not thrift store new, new new” to a girlfriend to enjoy the promised land with.\n\nBut there’s also, from the start, an ominous undercurrent: Moses’s brother was killed by the “po-pos,” as was a list of other neighborhood boys. Every now and then, the boys freeze, hands up, as the light shifts—are the police passing by? Are the police stopping them? Are they imagining that the police are stopping them? Does it matter which?\n\nThings get more absurd, and arguably more profound, with the entrance of an out-of-place, out-of-time white man (Gabriel Ebert). He’s lost, “all turned around,” prone to expressions like “gosh golly gee.” He’s Pozzo to Moses and Kitch’s Vladimir and Estragon, and instead of a chicken he’s got a basket full of food. Despite his aw-shucks demeanor, he lords his affluence, his abundance, over the two Black men. He scolds them for their profligate use of the n-word. As he gets ready to depart, he mentions his name: Master. It lands like a punch. “Gosh,” he says. “It’s just a name, a family name.” Nwandu’s script describes him as “an owner, and also a billionaire, and also a planter, and also pharoah.”\n\nIn the wake of that unusual encounter, Moses and Kitch decide to bring a different outlook to a former more typical one: a visit from a cop (again Ebert). They talk like Master, behave like him, and the cop treats them well. But when Kitch accidentally slips into his usual language, things turn. A gun is drawn, abuse is hurled, the promised land seems as far away as ever. Things will not end well for Moses and Kitch.\n\nThe dialogue is sharp, funny, and unflinching, and the performances are extraordinary. Hill and Smallwood (in his Broadway debut) are deft and winning, and they imbue their talky parts with a dynamic, nearly acrobatic physicality. Ebert is unctuously oily in his two roles. And director Danya Taymor, together with designers Wilson Chin (scenery), Sarafina Bush (costumes), and Marcus Doshi (lighting), create a world that is bleak and haunting, until it suddenly and unexpectedly turns vibrant and lush.\n\nI did not see the previous New York production of Pass Over, at LCT3 in 2018, when the play ended with a character’s murder. Now, Nwandu has provided a new final section, one that provides what she has called a more “healing,” “Afro-futurist” ending. It is visually lush, but I’m not sure it’s uplifting; there is plenty of room for discussion and argument, but by my reading it shows that the two Black men can achieve happiness only in death—and even then still at risk of temptation by a poisoned apple.\n\nIt remains, as she told the Times, “a lament.” And it is an important and necessary one.\n\nBut I’m worried it won’t be a commercially successful one. After 17 months of illness and death, after lockdown and loneliness, after Trump and January 6 and wildfires and floods, amid Delta surges and mask wars, I can’t shake the feeling that what we now crave is joy and exuberance, connection and celebration. Pass Over tells the story of an exodus, and its canvas is a plague. Right now, we’re all looking to heal.\n\nPass Over opened August 22, 2021, at the August Wilson Theatre and runs through October 10. Tickets and information: passoverbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
