{
  "showId": "wicked-2003",
  "outletId": "attractions-magazine",
  "outlet": "Attractions Magazine",
  "criticName": "Quinn Rosebook",
  "url": "https://attractionsmagazine.com/theater-review-wicked-favorite/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "While this was my fourth time seeing the show, it was my fiancé's first! He said it was a fun, energetic show that had everything he expected, but also that he was surprised by some of the plot, and really loved the callbacks and references to the original Wizard of Oz story and the 1939 film. I say that it remains one of my favorites and that \"Wicked\" is a quintessential musical must for any theater fan. Straz Center - Tampa, FL Deborah Bostock-Kelley, BroadwayWorld: While Jennafer and Lissa we",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Did-Critics-Think-Of-WICKED-On-Tour-20210922",
  "contentTier": "complete",
  "fullText": "“Wicked”, one of the most “popular” musicals since its debut in 2003, is on a new North American tour. It’s one of my favorite musicals and it’s currently in Orlando, Fla., at the Dr. Phillips Center for the Performing Arts. The tour will be in multiple cities in Florida now through April. The story is that of the Wicked Witch of the West and Glinda the Good before Dorothy dropped into the land of Oz. When the soon-to-be “Wicked Witch” Elphaba (Lissa Deguzman) and Glinda “the Good” (Jennafer Newberry) first meet, they couldn’t be more at odds. When forced to room together at Shiz University, their loathing for one another gradually turns to a true friendship. But as we all know, one is destined for good, and the other, to be Wicked. “Wicked” the musical is based on the first book in “The Wicked Years” series by Gregory Maguire. A concept from this series “the clock of the time dragon” (a traveling clockwork stage that can tell stories through puppetry) is the stage that the audience is watching the musical play out on. As such, the whole show is framed in clockwork gears, and a huge metal dragon sits atop the show’s proscenium arch. Multiple members of the cast are former Walt Disney World Cast members, notably Jennafer Newberry, who portrays Glinda, used to play the titular role in “Finding Nemo: The Musical” at Disney’s Animal Kingdom. Additionally Jordan Litz (Fiyero) was formerly involved in numerous productions at the resort. While this was my fourth time seeing the show, it was my fiancé’s first! He said it was a fun, energetic show that had everything he expected, but also that he was surprised by some of the plot, and really loved the callbacks and references to the original Wizard of Oz story and the 1939 film. I say that it remains one of my favorites and that “Wicked” is a quintessential musical must for any theater fan. “Wicked” is perfect for any musical fan. It’s a great family friendly night out, and is performing now through Feb. 12, 2023 at the Dr. Phillips Center for the Performing Arts in Downtown Orlando. For more cities, tour dates, and tickets, visit wickedthemusical.com. Your email address will not be published. Required fields are marked * Δdocument.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() ); This site uses Akismet to reduce spam. Learn how your comment data is processed. I’m going to see it next Sunday! I’m very excited!",
  "isFullReview": true,
  "textWordCount": 415,
  "archivePath": "data/archives/reviews/wicked-2003/attractions-magazine--quinn-rosebook_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:41:03.070Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 415,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-05T20:51:29.215Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This is a review of the touring production of Wicked in Orlando, not the current Broadway production in New York; openai: The text reviews a touring production of 'Wicked' in Orlando, not the current Broadway run.; kimi: This review covers the North American tour production of 'Wicked' performing in Orlando, Florida, not the current Broadway run at the Gershwin Theatre.",
  "promptVersion": "5.2.0"
}
