{
  "showId": "wicked-2003",
  "outletId": "boise-weekly",
  "outlet": "Boise Weekly",
  "criticName": "Kate Noden",
  "url": "https://www.idahopress.com/boiseweekly/entertainment_events/wicked-ly-good/article_d5b377c6-cc21-41b3-8919-d10b5a7973aa.html",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "This cast was absolutely captivating, with each member contributing something essential that made the performance come to life. Glinda (Austen Danielle Bohmer) and Elphaba (Lauren Samuels) shared a magnetic connection that radiated in every shared moment. Eccles Theater - Salt Lake City, UT",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Did-Critics-Think-Of-WICKED-On-Tour-20210922",
  "contentTier": "complete",
  "fullText": "...AIR STAGNATION ADVISORY REMAINS IN EFFECT UNTIL 5 AM MST /4 AM\nPST/ MONDAY...\n\n* WHAT...An extended period of stagnant air, with light winds and\nlittle vertical mixing. This is due to an inversion near the\nsurface that will continue to trap pollutants.\n\n* WHERE...Portions of south central and southwest Idaho and\nnortheast and southeast Oregon.\n\n* WHEN...Until 5 AM MST /4 AM PST/ Monday.\n\n* IMPACTS...Poor air quality may cause issues for people with\nrespiratory problems.\n\nPRECAUTIONARY/PREPAREDNESS ACTIONS...\n\nPersons with respiratory illness should follow their physicians\nadvice for dealing with high levels of air pollution during periods\nof stagnant air.\n\n&&\n\n \n \n \n \n\nSpeak Your Peace: Submit comments on our community forum\n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n \n \n Close\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n The crowd stood for a standing ovation after the final number.\n\nThe map of the Emerald City sets the stage before the show begins.\n\nElphie's Green Elixir: vodka, green apple syrup, lemon juice and apple juice for $12.\n\nThe crowd stood for a standing ovation after the final number.\n\nThe map of the Emerald City sets the stage before the show begins.\n\nElphie's Green Elixir: vodka, green apple syrup, lemon juice and apple juice for $12.\n\nBOISE, Idaho — Treefort Music Fest has released expanded det…\n\n“One man's trash is another man's treasure” has taken on a n…\n\nThe crowd stood for a standing ovation after the final number.\n\nThe map of the Emerald City sets the stage before the show begins.\n\nElphie's Green Elixir: vodka, green apple syrup, lemon juice and apple juice for $12.\n\nThe crowd stood for a standing ovation after the final number.\n\nThe map of the Emerald City sets the stage before the show begins.\n\nElphie's Green Elixir: vodka, green apple syrup, lemon juice and apple juice for $12.\n\nBecause of “Wicked,” I have been changed for good — and you could be too.\n\nThis brilliant reimagining of a classic tale offers a new perspective on the story we think we know, showing the untold side of those we’ve been taught to see as “wicked.”\n\nThe two-hour and 45-minute Tony Award-winning production serves as a prequel to “The Wizard of Oz,” exploring the untold story of the green Elphaba, the misunderstood Wicked Witch of the West, and Glinda, the bubbly Good Witch of the South.\n\nThe story centers on themes of friendship, love, power and societal expectations, revealing how these two women form an unlikely bond, only to ultimately follow divergent paths.\n\nCurrently running at the Morrison Center through Sunday, April 13, “Wicked” features a book by Winnie Holzman, music and lyrics by Stephen Schwartz and the direction by Joe Mantello.\n\nThe story of “Wicked” has been making headlines over the past year — whether it be on screen, stage, or somewhere in-between. Unlike many, I had never seen or read any version of the adaptation, going into this performance completely blind.\n\nIt was everything I didn’t know I was hoping for — and so much more.\n\nAccompanied by a live orchestra, every musical number is mesmerizing, and the special effects and costumes are so stunning they left me completely speechless.\n\nThis cast was absolutely captivating, with each member contributing something essential that made the performance come to life. Glinda (Austen Danielle Bohmer) and Elphaba (Lauren Samuels) shared a magnetic connection that radiated in every shared moment.\n\nBohmer’s natural comedic flare makes her the perfect person for the role, and during the duo’s performance of “For Good,” sniffles echoed through the audience.\n\nAt times, Samuels stood alone on stage — no props or dramatic lighting — yet she held the space completely, consumed by the role. Samuels, from the United Kingdom, impressively masks her accent during the boisterous music numbers, and fully embodies the character with confidence and skill.\n\nThe beloved Boq (Alex Vinh) was another standout, who did an exceptional job of playing the character arc of love, sacrifice and consequences.\n\nHowever none of the characters quite hit me like the monkeys did.\n\nThe monkeys, who doubled as students, Emerald City residents, palace guards, and more, truly stole the show. Their costumes, expressive mannerisms, and the constant thrill of wire-flying elevated the experience beyond just a play — it became a breathtaking display of talent and artistry.\n\nFrom the moment you enter the theater, the stage setting immerses you into a whimsical world that feels both familiar and fantastically new at the same time. Dominating over the stage is a massive Time Dragon Clock, with its wings and gears twitching and smoke pouring out of its mouth as the curtain rises.\n\nThe props and set pieces glide in and out with precision — from Glinda’s shimmering bubble to Elphaba’s dramatic airborne moments — creating a visually rich stage that’s as magical as the story itself.\n\nThere were many moments throughout the play I thought to myself, \"how in the world are they doing that?\"\n\nSpecial shoutout to Susan Hilfery (costumes), Kenneth Posner (lighting) and Elaine J. McCarthy (projections) — I have never seen a performance use fractaling lights, bedazzling costumes and more to transform the stage into pure magic.\n\nAct one closes with a performance of “Defying Gravity,” and all I have to say is I was so impressed I had to push my mouth closed when the lights turned on.\n\nThere was not one slip up or mispronunciation — this cast is a group of true professionals. And as the final curtain dropped, a standing ovation was give from the crowd.\n\nFor all the fans, the Morrison Center offers a variety of merchandise for purchase, along with two-themed drinks: Elphie’s Green Elixir and Glinda’s Popular Punch. I tried the Green Elixir — it was absolutely delicious and, thankfully, didn’t turn me green.\n\nThis is one performance you won’t want to miss whether you're a long time fan or new to the story.\n\nAccount processing issue - the email address may already exist\n\nYour account has been registered, and you are now logged in.\n\nInvalid password or account does not exist\n\nSubmitting this form below will send a message to your email with a link to change your password.\n\nAn email message containing instructions on how to reset your password has been sent to the email address listed on your account.\n\nSecure transaction.\n Secure transaction. Cancel anytime.\n\nYour gift purchase was successful!\n Your purchase was successful, and you are now logged in.\n\nA receipt was sent to your email.\n\nThe webpage at https://eb2.3lift.com/sync? might be temporarily down or it may have moved permanently to a new web address.",
  "isFullReview": true,
  "textWordCount": 1076,
  "archivePath": "data/archives/reviews/wicked-2003/boise-weekly--kate-noden_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:42:30.327Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 1076,
  "tierReason": "Full review text"
}