{
  "showId": "wicked-2003",
  "outletId": "boston-globe",
  "outlet": "Boston Globe (Odie Henderson)",
  "criticName": "Odie Henderson",
  "url": "https://www.bostonglobe.com/2025/11/18/arts/wicked-for-good-cynthia-erivo/",
  "playbillVerdictUrl": "https://www.bostonglobe.com/2025/11/18/arts/wicked-for-good-cynthia-erivo/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "“Wicked: For Good,” the movie adaptation of the second act of the “Wicked” musical, runs 138 minutes. Combine that with the 160 minute runtime of its 2024 predecessor, and this version of “Wicked” runs 2 minutes under 5 hours. That’s twice as long as the musical runs every night on Broadway. At best, this is merely excessive; at worst, it’s yet another example of corporate greed. The follow-up to director Jon M. Chu’s massive 2024 hit is more of the same, only darker. The dark elements are written into the show’s second act, which even fans would agree is not as good as the first. Recall that “Wicked: Part One” featured the musical’s two most famous musical numbers, “Popular” and “Defying Gravity.” That film received ten Oscar nominations, including best picture, and won a deserved Oscar for costume designer, Paul Tazewell.",
  "isFullReview": false,
  "textWordCount": 141,
  "archivePath": "data/archives/reviews/wicked-2003/boston-globe--odie-henderson_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:42:46.225Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 141 (min: 300)"
  ],
  "contentTier": "truncated",
  "wordCount": 141,
  "tierReason": "Short text (141 words)",
  "wrongShow": true,
  "rejectedAt": "2026-02-06T09:37:00.952Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a review of the 2025 movie 'Wicked: For Good', not the current Broadway production of the musical 'Wicked'; openai: The text is about the movie adaptation of 'Wicked', not the current Broadway production.; gemini: This review is about the movie adaptation of Wicked, not the Broadway show.; kimi: This is a review of the 'Wicked: For Good' movie adaptation, not the Broadway musical production. The text explicitly references the film's director Jon M. Chu, Oscar nominations, and runtime comparisons to the Broadway show, confirming it is film criticism rather than theater criticism.",
  "promptVersion": "5.2.0"
}
