{
  "showId": "wicked-2003",
  "outletId": "broadwayreviewed-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.broadwayreviewed.com/7/sooo-why-not-wicked-wicked-reviewed-is-it-work-it",
  "publishDate": null,
  "fullText": "Yes.  Wicked is 100% worth the price of the tickets, however the best seats in the house for this show are actually not on the floor or front row.  Sure you can see more of the seriously detailed costumes and get to enjoy being within eyesight of the actors and actresses and even see all the hooks and ropes that let the actors fly through the air and see the amazing lifts in the songs, but you actually miss out on most of the other special effects that the people in the first and second balconies get to see.  One of those effects is probably one of the coolest stage props I&#8217;ve seen and it is the Time Clock Dragon that is hanging above the stage and the Audience.  The entire dragon moves and its eyes light up red, the wings move and the neck flies wildly and the mouth snaps opened and closed and if you are in the front row or on the floor, you miss this which is one of the reasons that I think the balconies are the best view for this show.\n\nWicked Openening Stage and Time Clock Dragon\n\nWicked is the story of the Two Wicthes of Oz, Elphaba and Galdinda,,,however it is really actually kind of the story of the Wicked Witch of the West (Elphaba) and her life growing up, going to school, her family and sister (Nessa or the Wicked Witch of the East), how she got her powers, who her family was, why she was considered evil and another version of how her life changed the world of Oz and what she actually was trying to do and how characters like the Wizard effected her.\n\nElphaba was a die hard liberal who lived to defend the rights of the Animals (animals that have the ability to talk which is why they are called Animals with a capital A and not animals with a lower case,,,,kind of like the Liza with a Z thing).   Elphaba went to school to mainly watch after her sister but there she met Madame Morrible who discovered she had powers because her dad was from our reality and world and her mother was from OZ which made her powers more powerful than anyone else in Oz, including Madame Morrible who is also the one who can control the weather and created the Tornado that killed Nessa Rose and Brought Dorothy to Oz.\n\nAt school, Elphaba met her professor and friend Dr. Dillamond who was a Goat who could speak but all of the sudden lost his powers and was no longer able to speak.   She also met Fiero who helped her save a Lion cub who they were trying to stop from being able to speak and when she finally decided to take action, she left for the Emerald City to meet with the Wizard and put an end to the destruction of the Animals and their ability to speak and teach in school and be a part of society.  (BTW the Lion she saved is also the Cowardly Lion who tries to help kill her in the end not knowing what she did to help save his life).\n\nWhen she gets to the Emerald City with her best friend Galinda who changed her name to impress Fiero to Glinda, they discover that the Wizard and Madame Morrible are actually the two people behind the desctruction of the Animals and they use Elphabas powers against her to turn the Wizards pet Monkeys to flying Monkeys who can still sort of talk but also grow wings which hurt them.\n\nWhen Elphaba realizes that the Wizard was out to harm the Animals she steals the secret spell book that the Wizard and Madame Morrible were hiding and takes off for the attic which is where the most spectacular of the songs takes place Defying Gravity.\n\nAfter the song is over, the cast goes into intermission and the theatre bursts into applause&#8230;.the scene is amazing and the rest of the show is pure fun and drama.  This is the perfect show for the whole family and also helps you to fall in love with the Wicked Witch of the West and start to see a different side of the classic movie the Wizard of Oz.  There is also a surpise ending for those of you who read the book that this show is based off of by Gregory McGuire.\n\nI give Wicked a 9 out of ten for the effects, the music, the costuming which is probably some of the best I have ever seen and the over all staging.  The reason that it misses out on a perfect 10 is because the audience misses a good portion of the effects depending on where they are siting in the theatre and some of the bubbles choke the actress that plays Glinda in the beginning scene if she breathes in to much.  This show is amazing and I highly recommend it to anyone who ever loved the Wizard of Oz, who loves broadway, who loves singing and dancing and loves to see a full stage of special effects, detailed costumes and an overall great show.\n\nI went July 3, 2012, to see it at the Gershwin on Broadway. I feel cheated. The concession clerk was so nasty to me and my wife before the show &#8211; completely uncalled for! We simply went to buy drinks and this guy was a complete snobby jerk to my wife and me&#8230;did not expect that at all! So before the show started I was in an angry frame of mind. I had waited months in anxious anticipation, and paid nearly $400 to get good seats&#8230;it was supposed to be the highlight of our NYC trip &#8211; it wasn&#8217;t! For $400 I expect the theater personnel to at least be professional. I reported it to the theater &#8211; they don&#8217;t care, why should they? They have my $400, right!?\n\nI&#8217;m sorry about your experience.  I have no affiliation with the Theaters or Shows so there isn&#8217;t anything I can do.  That is odd though that they would be rude.  I have never had a bad experience with theatre staff, especially in NYC.  I hope you don&#8217;t let one jerk ruin your view of Broadway or theatre as that is definitely not normal.  I&#8217;d call the manager of the Gershwin and ask them about it.  It would also be good if you could remember the person&#8217;s name to help them take care of it.  How was the show?  Did you and your wife enjoy it at least?  Sorry for the bad experience with the theatre staff.\n\nRecieve New Posts in Your Inbox!",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1116,
  "archivePath": "data/archives/reviews/wicked-2003/broadwayreviewed-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T05:22:51.290Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.goto: net::ERR_NAME_NOT_RESOLVED at http://www.broadwayreviewed.com/7/sooo-why-not-wicked-wicked-reviewed-is-it-work-it\nCall log:\n  - navigating to \"http://www.broadwayreviewed.com/7/sooo-why-not-wicked-wicked-reviewed-is-it-work-it\", waiting until \"domcontentloaded\"\n"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20211028074005",
  "archiveOrgUrl": "http://web.archive.org/web/20211028074005/http://www.broadwayreviewed.com/7/sooo-why-not-wicked-wicked-reviewed-is-it-work-it"
}