{
  "showId": "wicked-2003",
  "outletId": "city-pulse",
  "outlet": "City Pulse",
  "criticName": "David Winkelstern",
  "url": "https://www.lansingcitypulse.com/stories/wharton-wins-with-wicked-wharton-center-stephen-schwartz-olivia-valli-frankie-wonderful-wizard-of-oz-l-frank-baum,54860",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "Every cast member in the 30-plus troupe gives an outstanding performance. (That includes Sharon Sachs, who replaced Natalie Venetia Belcon in Thursday night's (May 11) show as Madame Morrible.) Oz's Munchkins, ensemble townspeople and exquisite principals demonstrate rare talent in singing, dancing and athleticism in the constantly evolving musical by Stephen Schwartz. Hobby Center for the Performing Arts - Houston, TX",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Did-Critics-Think-Of-WICKED-On-Tour-20210922",
  "contentTier": "complete",
  "fullText": "LANSING – The state legalized personal use of marijuana in hopes that it would … Walk into the latest art exhibit at East Lansing’s (SCENE) Metrospace, “Things … Some might think booking “Wicked” at the Wharton Center for the fifth time was a gamble. But after witnessing a packed crowd for the second performance of a run lasting until May 28, the decision seems a sure bet. After each of the musical numbers in the two-act show, the audience roared, whooped and offered thunderous hand smacks. (To call them mere “applause” would be an injustice.) All the elements of the musical’s national touring company provide numerous reasons for such reactions. Every cast member in the 30-plus troupe gives an outstanding performance. (That includes Sharon Sachs, who replaced Natalie Venetia Belcon in Thursday night’s (May 11) show as Madame Morrible.) Oz’s Munchkins, ensemble townspeople and exquisite principals demonstrate rare talent in singing, dancing and athleticism in the constantly evolving musical by Stephen Schwartz. Olivia Valli — who took over the role of Elphaba only last week — shows her passion for the part. Valli has a mighty voice with a range that gives reasons for her grandfather, Frankie Valli of the Four Seasons, to be proud. After seeing and hearing her as the green witch, it’s hard to imagine anyone else besting her singing or fluid performance. Celia Hottenstein as the good witch, Glinda, also has a powerful voice and a distinct charm of her own. The talented pair has a marvelous contrast that meshes well. When the two grand witches belt out a song and harmonize superbly together, it’s hard not to smack your hands together. Potent and seamless harmonies by multiple duos and choruses run all through the musical. The orchestra of five traveling musicians and nine local players provides a colossal accompaniment. “Wicked’s” visuals are also a momentous facet of its appeal. Towering sets by Eugene Lee — often with a Steampunk style — slide and have moving gears and parts. A massive proscenium smoke-breathing dragon has eyes that glow. Any rock star or pop diva might envy the backdrops and Kenneth Posner’s cleverly arranged, colorful and spectacular lighting. Adding dancers (and monkeys) who fly, a witch who floats on a bubble-making sphere, layers of fog, a gigantic mechanical wizard, and dazzling special effects by Chic Silber, it’s no wonder “Wicked” attracts crowds. The frequently changed, elaborate costumes, designed by Susan Hilferty, are a blend of period flair, horror movie props, and flamboyant Dr. Seuss characters. No costume is mundane. “Wicked” intertwines familiar facets of L. Frank Baum’s “The Wonderful Wizard of Oz” with a backstory of how the Wicked Witch of the West became — you guessed it — wicked. It’s more of a prequel to the original story and the many spinoffs that it spawned. “Wicked’s” attempts to include all the familiar bits of a traditional Oz story sometimes make its plot convoluted. The 2-hour-45-minute-with-intermission musical is admittedly too long. “Wicked” gives us many climaxes followed by less-potent scenes. However, the allure of the production outweighs any complaints. After debuting in 2003, “Wicked” remains popular and seems especially relevant today, with its themes of good vs. evil, how we treat those who are different from ourselves and what is accepted as truth. Although full of humor, romance, emotion and fantasy, “Wicked” deals with dilemmas we still wrestle with. Maybe such relatable topics are partly why “Wicked” has grossed over $2.5 billion worldwide. Combine that with an amazing cast, music, costumes and set, and it’s no wonder audiences will keep coming back to yet another run at Wharton. No comments on this item Please log in to comment by clicking here Get all the breaking news and latest updates right to your inbox! Sorry, we could not complete your sign-up. Please contact us to resolve this. LANSING — A second man has been charged in connection with a high-speed April 2025 crash that killed a teenager and injured more than a dozen others during the incident on South Martin Luther King … LANSING – The state legalized personal use of marijuana in hopes that it would decrease the amount of … LANSING — After significant surges in dispensary break-ins and robberies around Michigan, cannabis … A city-run transitional housing community of 50 ModPod housing units came a step closer to reality when a … As federal enforcement surges amid President Donald Trump’s crackdown on illegal immigration, the … More than 200 people came out during lunchtime on Jan. 29 to downtown Lansing’s Capitol lawn to protest … Communities throughout the Greater Lansing region have received notice of an upcoming project to install … Back in 2017, an out-of-state signature collector hanging outside the downtown bus station asked me to … 1905 E. Michigan Ave.Lansing, MI 48912 (517) 371-5600 Where to find us I’ve been writing for City Pulse since the paper started — more than 17 years. I was brought on board to write about music, but the job quickly got out of hand. By now I’ve written about everything from ants to skyscrapers and met more fascinating and wonderful people than I can count. You can reach Lawrence at: Lawrence@lansingcitypulse.com or (517) 999-5065 Get all the breaking news and latest updates, plus each issue of our digital paper, right to your inbox.",
  "isFullReview": true,
  "textWordCount": 886,
  "archivePath": "data/archives/reviews/wicked-2003/city-pulse--david-winkelstern_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:49:35.909Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 886,
  "tierReason": "Full review text"
}