{
  "showId": "wicked-2003",
  "outletId": "greenville-journal",
  "outlet": "Greenville Journal",
  "criticName": "Paul Hyde",
  "url": "https://greenvillejournal.com/arts-culture/powerful-poignant-wicked-soars-at-the-peace-center-review/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "The current cast of the national tour is stunning. Olivia Valli, who knocked our socks off a mere 18 months ago when she visited the Peace Center as Vivian Ward in “Pretty Woman,” returns in this tour as Elphaba, the green Wicked Witch of the West who is loathed by the people of Oz for the sin of being different. Durham Performing Arts Center - Durham, NC",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Did-Critics-Think-Of-WICKED-On-Tour-20210922",
  "contentTier": "complete",
  "fullText": "By bubble and broom, the witches of “Wicked” have soared back into the Peace Center in a production that’s pure magic. Equal parts grand spectacle and intimate drama, the 2003 Broadway musical both dazzles and tugs at the heartstrings as it offers a prequel and alternative vision of the 1939 film “The Wizard of Oz.” With music and lyrics by Stephen Schwartz, “Wicked” centers on the relationship of two witches-in-training, Elphaba and Glinda, as they struggle through personal differences and rivalry over the same love-interest, Fiyero. The current cast of the national tour is stunning. Olivia Valli, who knocked our socks off a mere 18 months ago when she visited the Peace Center as Vivian Ward in “Pretty Woman,” returns in this tour as Elphaba, the green Wicked Witch of the West who is loathed by the people of Oz for the sin of being different. Valli, the granddaughter of pop legend Frankie Valli, delivers Elphaba’s showstoppers like “Defying Gravity” and “No Good Deed” with passion and powerhouse vocals. Yet it’s also a nuanced portrayal, with Valli caressing a tearjerker like “I’m Not That Girl” with melting tenderness. Celia Hottenstein, as Glinda, is marvelously bubbly and funny in her early scenes as a conceited young girl of privilege. Her song “Popular” is a comic tour de force. Glinda grows the most through the course of the show, and Hottenstein is both commanding and sympathetic as the more mature Glinda, negotiating the character’s high-flying music with a sparkling soprano. Christian Thompson, as Fiyero, is a smooth actor with a suave tenor. It’s great to see a Broadway veteran like Timothy Shew (Jean Valjean on Broadway, among many other roles) in this cast as the Wizard of Oz. Shew is so appealing that one struggles to remember that the Wizard is a sinister strongman. The rest of the cast is likewise superb. The book by Winnie Holzman, loosely based on Gregory Maguire’s novel, is a brilliant riff on “The Wizard of Oz,” abounding with inside jokes for fans of the classic film. Holzman’s narrative is both epic, at 2 hours and 45 minutes, and intimate. Her “Oz” is a dystopia of censorship, authoritarianism, and gullible citizens. Those themes are likely to resonate with audiences at a time of fake news and political wrongdoing. On a more intimate level, “Wicked” extols friendship, acceptance and female empowerment. The big chorus numbers are terrific, thanks to the robust voices and tight singing of the ensemble under the direction of Evan Roider. Schwartz, the composer, writes ensemble numbers that have the intensity and forceful momentum of big operatic choruses. The sets and costumes — brightly colored steampunk with an emphasis on emerald — never fail to impress and occasionally awe The 15-piece pit orchestra, which includes nine local musicians, performs splendidly. Wayne Cilento’s fluid choreography is excellent, with some obvious nods to the “Oz” film. Veteran director Joe Mantello’s staging is so energetic that this lengthy musical never flags. It’s no surprise that “Wicked” sold out almost every show in its other visits to Greenville. Likewise, tickets are tight for this three-week run. This thrilling production of “Wicked” continues through Aug. 20. For tickets, call the Peace Center at 864-467-3000 or visit peacecenter.org. Subscribe now to our newsletter",
  "isFullReview": true,
  "textWordCount": 542,
  "archivePath": "data/archives/reviews/wicked-2003/greenville-journal--paul-hyde_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:59:35.479Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "duplicateTextOf": "gizmodo-germain-lussier--germain-lussier.json",
  "wordCount": 542,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-06T09:39:26.651Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This reviews a national tour production, not the current Broadway run; openai: The review discusses a national tour production, not the current Broadway run.; kimi: The text explicitly reviews a national tour production at the Durham Performing Arts Center in North Carolina ('The current cast of the national tour'), not the current Broadway run.",
  "promptVersion": "5.2.0"
}
