{
  "showId": "wicked-2003",
  "outletId": "moviefone",
  "outlet": "Movie Fone (James White)",
  "criticName": "James White",
  "url": "https://www.moviefone.com/news/movie-review-wicked-for-good/",
  "playbillVerdictUrl": "https://www.moviefone.com/news/movie-review-wicked-for-good/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The follow-up to last year’s smash-hit adaptation of the book and stage musical returns Cynthia Erivo and Ariana Grande’s witches to the big screen. Cynthia Erivo is Elphaba in 'Wicked For Good', directed by Jon M. Chu. Photo: Universal Pictures. In theaters on November 21 from Universal Pictures is ‘Wicked: For Good’, the second half of director Jon M. Chu’s ambitious adaptation of Gregory Maguire’s source novel and the long-running stage musical. The movie sees the return of Ariana Grande (‘Don’t Look up’), Cynthia Erivo (‘Bad Times at the El Royale’), Jeff Goldblum (‘Independence Day’), Michelle Yeoh (‘Everything Everywhere All at Once’) and Jonathan Bailey ('Jurassic World: Rebirth') with new additions including Colman Domingo (‘Sing Sing’) as the Cowardly Lion. Ariana Grande is Glinda in 'Wicked For Good', directed by Jon M. Chu. Following a pop cultural behemoth such as ‘Wicked’ was never going to be an easy feat, and the challenges were more than the simple fact that the second film was shot at the same time as the first with no room for course correction if anything didn’t click with audiences. As with the second half of the show, which doesn’t feature quite the same level of memorable music as the first (save perhaps the emotional finale which gives this new movie its name), ‘Wicked: For Good’ suffers some in comparison with the 2024 movie, but it still manages to be a fitting, heartfelt adaptation. (L to R) Ariana Grande (as Glinda), Director Jon M. Chu, and Cynthia Erivo (as Elphaba), on the set of 'Wicked For Good', directed by Jon M. Chu. Screenwriters Winnie Holzman (who wrote the book for the musical) and Dana Fox have once again expanded on the stage show’s basic plotline, taking advantage of the different medium to flesh out certain elements. Some work wonderfully –– the characters of Nessarose and Boq in particular get meatier material, while others feel less necessary, such as flashbacks that feel like filler and, in one moment, what is meant to be a callback to Elphaba’s glimpse of her younger self during “Defying Gravity” that here comes off as a repetitive rip-off. The two new songs by composer Stephen Schwartz are good but don’t really hold a candle to the original showstoppers. (L to R) Cynthia Erivo is Elphaba and Jonathan Bailey is Fiyero in 'Wicked For Good', directed by Jon M. Chu. Once again, and unsurprisingly, this is really all about Ariana Grande’s Glinda and Cynthia Erivo’s Elphaba, with the former given more of a character arc this time. Both actors are excellent, offering powerhouse musical performances but also finding the nuance when needed. Of the supporting cast, Jeff Goldblum’s Wizard is still a quirky delight, while Marissa Bode and Ethan Slater take full advantage of more to do with Nessarose and Boq. Dorothy, meanwhile, is treated much like the stage version: very much a shadow presence. Jeff Goldblum is The Wizard of Oz in 'Wicked For Good', directed by Jon M. Chu. To say ‘For Good’ isn’t as good as ‘Wicked’ is not to try and tear it down. Make no mistake, this is another soaring, spectacular trip to the land of Oz, and nails the landing. ‘Wicked: For Good’ receives 85 out of 100. Ariana Grande is Glinda in 'Wicked For Good', directed by Jon M. Chu. As an angry mob rises against the Wicked Witch, Glinda and Elphaba will need to come together one final time. With their singular friendship now the fulcrum of their futures, they will need to truly see each other, with honesty and empathy, if they are to change themselves, and all of Oz, for good. (L to R) Jeff Goldblum is The Wizard of Oz and Cynthia Erivo is Elphaba in 'Wicked For Good', directed by Jon M. Chu.",
  "isFullReview": true,
  "textWordCount": 631,
  "archivePath": "data/archives/reviews/wicked-2003/moviefone--james-white_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:01:54.670Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 631,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-06T09:40:04.247Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a review of the 2025 movie 'Wicked: For Good', not the current Broadway production of Wicked; openai: The text is a review of a film adaptation of 'Wicked', not the Broadway stage production.; gemini: This is a review of the movie 'Wicked: For Good', not the Broadway show 'Wicked'.; kimi: This text reviews the movie 'Wicked: For Good' (a film sequel releasing in theaters from Universal Pictures), not the Broadway musical 'Wicked' or any current Broadway theatrical production.",
  "promptVersion": "5.2.0"
}
