{
  "showId": "wicked-2003",
  "outletId": "new-yorker",
  "outlet": "The New Yorker",
  "criticName": null,
  "url": "http://www.newyorker.com/magazine/2003/11/10/bitches-and-witches",
  "publishDate": "November 10, 2003",
  "fullText": "The TheatreBitches and WitchesUlterior motives in “Cat on a Hot Tin Roof” and “Wicked.”By John LahrNovember 3, 2003Save this storySave this storySave this storySave this story\"I’m a peculiar blend of the Pragmatist and the Romanticist and the crocodile. The Monster,” Tennessee Williams said. After the triumph in 1947 of “A Streetcar Named Desire,” he dedicated himself to his own greatness; the result was a moral and emotional attrition, which his plays increasingly registered. “I grow less integrated,” Williams wrote to a friend in 1950. “I am more alone and more lost than I ever was, and know hundreds more people!” By the time he began to write his masterpiece of the mid-fifties, “Cat on a Hot Tin Roof,” now in a superb revival at the Music Box, his tally of losses included three consecutive critical failures—“Summer and Smoke,” “The Rose Tattoo,” and “Camino Real.” Williams’s embattled situation—his compulsion to lay claim to his literary legacy at all costs—found a fierce and funny reflection in the struggle of Maggie, “Cat on a Hot Tin Roof” ’s heroine, to seize her own sexual and financial inheritance. “My hat is still in the ring, and I am determined to win!” Maggie says. For her, endurance is everything. “Life has got to be allowed to continue even after the dream of life is—all—over,” she says. But her appetite for vindictive triumph has turned her, like Williams, into a monster—a fact that she recognizes but can’t change. To her aptly named husband, Brick, a frozen and aloof alcoholic, Maggie admits, “I’ve gone through this—hideous!—transformation, become—hard! Frantic!—cruel!!” In Maggie, “Cat on a Hot Tin Roof” offers us the first glimpse of the tortured and torturous inner terrain into which Williams had wandered (he called it “the beanstalk country”): a hell of his own making.This production, directed by Anthony Page, was first mounted in London last year. The transfer to New York has improved it: the characterizations are deeper and more rounded, the tragicomic idiom more luscious and hilarious. The linchpin of both versions is a sensational performance by Ned Beatty, who plays Brick’s father, Big Daddy Pollitt, the owner of “twenty-eight thousand acres of the richest land this side of the valley Nile.” Beatty exudes a ferocious vigor; he’s a dangerous actor, and his prickly spirit catches all the cunning and cruelty of Big Daddy’s vulgar energy. With his ivory suit and cigar, he roars his imperialism: “I made this place!” He roars his lust for life: “I’m going to cut loose and have, what is it they call it, have me a ball! . . . Hell! I slept with Big Mama till, let’s see, five years ago, till I was sixty and she was fifty-eight, and never even liked her, never did!” And when he learns that his doctor and his relatives have withheld the news that his cancer is terminal he roars his fury at death: “christ—damn all—lying sons of—lying bitches!”The play opens on Big Daddy’s sixty-fifth birthday, as his predatory family gathers at the Mississippi plantation, hoping to win his favor and his fortune. First among many is Big Mama, who is given a pitch-perfect incarnation by Margo Martindale. A large woman whose charm bracelet jiggles along with the wattles under her chin, Martindale bustles into view with wonderful, foolish brio. In a purple-and-pink floral chiffon dress and blue open-toed shoes, she turns Big Mama into a whirlwind of persiflage and pragmatism. She understands Big Mama’s hurt, and she invests her character’s bovine banality with a humanity that elevates the heartbroken blather well beyond caricature. The same is true for the shrewd performances of Michael Mastro, as the Pollitts’ unctuous older son, Gooper, and Amy Hohn, as his rapacious wife, Mae, a “monster of fertility,” who hopes, through her rapid production of children, to raise Gooper’s stock as an heir.The stage at the Music Box is dominated by a double bed in which Maggie sleeps alone. Her goal is to get her reluctant, frigid husband back between the sheets and to conceive a child, thereby clinching Brick’s inheritance of his father’s kingdom. On an elemental narrative level, the play works as a contest; here, Ashley Judd, as Maggie, and Jason Patric, as Brick, make worthy opponents. Any actress trying to play Maggie has to hit the stage in top gear and stay at speed for the entire first act. Judd acquits herself well. She is technically expert, and she brings to the role her movie-star beauty, her steeliness, and, beneath her ladylike veneer, a brave heart. Something in her metabolism, however, makes her pull back from embracing the extravagance of Williams’s speech with an extravagance of spirit. Judd understands the rhythm of Williams’s music, but she doesn’t yet swing it. She comes closest in the scene in which Maggie tries to break through the wall of Brick’s indifference by forcing him to face the possibility that his best friend, Skipper, who recently committed suicide, was in love with him. “One man has one great good true thing in his life,” Brick responds, threatening her with his crutch (he has injured himself in a drunken stunt). “One great good thing which is true!—I had friendship with Skipper.—You are naming it dirty!” As he hobbles across the room toward her, Maggie tells him how, one drunken night that culminated in a botched affair, she challenged Skipper: “stop lovin’ my husband or tell him he’s got to let you admit it to him!” Skipper, it turns out, made the call; Brick hung up on him. Brick can’t forgive Maggie for having planted the notion of homosexuality in Skipper’s mind; he can’t forgive himself for his cowardice, or face his own deeply closeted desires. “Skipper is dead!” Maggie cries out as Brick tries to wallop her with his crutch. “I’m alive! __Maggie the cat is alive!”“Mendacity is a system that we live in,” Brick tells Big Daddy. “Liquor is one way out an’ death’s the other.” Big Daddy picks up the idea. “Hell, you got to live with it,” he says. “There’s nothing else to live with except mendacity, is there?” And so it seems. Faced with Big Daddy’s imminent death, Maggie lies to him, saying that she’s pregnant with Brick’s child. Big Daddy draws her to her feet and feels her body as he embraces her. “Uh-huh, this girl has life in her body, that’s no lie!” he says, lying. In this way, the two of them arrange for Big Daddy’s favorite son to inherit his kingdom, and maybe even rise to the challenge of adulthood. Mankind, Williams seems to be saying, can’t live with too much reality or too much loss. The play ends on an ambiguous, tentative note. “Oh, you weak, beautiful people who give up with such grace,” Maggie says to Brick. “What you need is someone to take hold of you—gently, with love, and hand your life back to you, like something gold you let go of.” “Wouldn’t it be funny if that were true,” Brick replies. Unfortunately, for Williams, in the remaining twenty-eight years of his life, that redemption never materialized.\"Who am I?” Williams asked in a late poem. “A monster among angels or angel among monsters.” This is the dilemma of personality posed by the musical “Wicked” (directed by Joe Mantello, at the Gershwin), which tells the backstory of “The Wizard of Oz”: how the lion got cowardly, how the scarecrow got stuffed, how the tin man got forged, and, most specifically, how the witch got wicked. Based on a clever novel by Gregory Maguire, the musical is an exercise in high camp—a universe turned topsy-turvy, where good is bad, normal is abnormal, and the purest well yields the sourest water. “The Wizard of Oz” was dedicated to hope; “Wicked” is dedicated to irony. Happiness is dramatized as a tyranny, and the Wizard himself is presented not as a charlatan but as a fascist ruling over a principality that does not allow dissent. The Wicked Witch, Elphaba (played by the excellent Idina Menzel), turns out to be good, while Glinda the Good Witch (Kristen Chenoweth) is exposed as a smug, ambitious, manipulative bitch, with little talent for sorcery. So, you see, the emotional stakes of this show are very high indeed.For reasons both of critical responsibility and of sanity, I think this is as far as I should go with the plot, which has all the suspense of an algebraic equation. Eugene Lee has given the show a spectacular whirligig set; the costume designer, Susan Hilferty, has imposed a wryly surreal Old World look. Winnie Holzman, who wrote the crisp book, seems to have had more fun with the project than most of her collaborators; she has invented a handful of malapropisms (“confusifying,” “discoverate,” “hideoteous”) to send up the sanctimonious Glinda, borrowed some of the film’s classic lines to good comic effect, and told the intricate story with a modicum of flair. But the same can’t be said of the score. The show’s twenty-two songs were written by Stephen Schwartz, and not one of them is memorable. They leave you longing for the wit and playful precision of Yip Harburg, whose words filled the movie Oz with wonder. “Don’t be offended by my frank analysis,” Glinda sings to Elphaba. “Think of it as personality dialysis.”Kristen Chenoweth, who can hold her high C’s and twirl a magic wand like a majorette, delivers the goods. She’s a thoroughbred looking for a Broadway race to run. Here, at least, she gets a decent outing. Her extraordinary voice and her knowing humor shine through the morass of overproduction. But no amount of support from old pros like Carole Shelley, Joel Grey, and Norbert Leo Butz can get this musical soufflé to rise—although the audience sometimes does. It is only fair to report that on the night I saw “Wicked” the spectators gave this fourteen-million-dollar piece of folderol a standing ovation, a phenomenon that the musical inadvertently explains in a number called “Dancing Through Life”: “Life is painless / For the brainless.” ♦Published in the print edition of the November 10, 2003, issue.John Lahr has written for The New Yorker since 1991. His latest book “Arthur Miller: American Witness” came out November, 2022.Read MoreThe New Yorker InterviewAmanda Seyfried’s EpiphaniesThe star of “The Testament of Ann Lee” and “The Housemaid” discusses letting go of judgment, working without hierarchies, and committing to the role of a woman possessed by faith.By Rachel SymeThe Current Cinema“Young Mothers” Is a Gentle Gift from the Dardenne BrothersIn Jean-Pierre and Luc Dardenne’s latest drama, set in and around a Belgian maternity home, several teen-age moms seek to break through cycles of poverty, addiction, and neglect.By Justin ChangThe TheatreIn Tracy Letts’s “Bug,” Crazy Is ContagiousA Broadway revival arrives at a moment when paranoia plots are everywhere.By Emily NussbaumGoings OnThe Mental Pratfalls of Anne Gridley, in “Watch Me Walk”Also: Jodie Foster’s new movie, New York City Ballet’s winter season, music inspired by the poetry of the Black Arts Movement, and more.By Marina HarssPostscriptBob Weir’s Feral RadianceThe Grateful Dead guitarist had the nature of a well-meaning cowboy, and a lasting capacity to access wonder and deep engagement.By Alec WilkinsonUnder ReviewThe Perils of Killing the Already DeadFear of what the dead might do to us didn’t start with Dracula, and it didn’t end with him, either.By Rivka GalchenGoings OnJanuary Festivals Bring the Weird, Wonderful ShowsAlso: “Tartuffe” mania, the guitar stylings of William Tyler and Yasmin Williams, Justin Chang’s movies for a new year, and more.By Sheldon PearceBook CurrentsReading for the New YearThe first installment in a series of recommendations by New Yorker writers.Goings OnDances of the Georgian Court and CountrysideAlso: Bang on a Can and St. Vincent in Richard Foreman’s “What to Wear,” the celestial folk of Cassandra Jenkins, Jennifer Wilson and Richard Brody on comfort in the cold weather, and more.By Marina HarssPersons of InterestThe Gospel According to Emily HenryHow the best-selling author of “People We Meet on Vacation” channelled her love of rom-coms—and her religious upbringing—into a new kind of romance novel.By Lauren Boersma HarrisCritic’s NotebookActs of Self-DestructionOn the most irreversible form of dissent, in art and in real life.By Doreen St. FélixFiction“Deal-Breaker”When he takes her in his arms, she wants to be with him forever. She wants everyone to know that they’re together, everyone except her mother.By Allegra Goodman",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 40,
  "bucket": "Negative",
  "source": "dtli",
  "dtliThumb": "Down",
  "textStatus": "complete",
  "dataNote": "Original scraped text was from 'Cat on a Hot Tin Roof' portion of combined article, not Wicked. Score assigned based on DTLI thumb (Down). Article is paywalled.",
  "textWordCount": 2047,
  "archivePath": "data/archives/reviews/wicked-2003/new-yorker--unknown_2026-01-25.html",
  "textFetchedAt": "2026-01-25T05:34:57.460Z",
  "textQuality": "full",
  "sourceMethod": "dtli"
}
