{
  "showId": "wicked-2003",
  "outletId": "newyorker",
  "outlet": "The New Yorker",
  "criticName": null,
  "url": "http://www.newyorker.com/magazine/2003/11/10/bitches-and-witches",
  "publishDate": "November 10, 2003",
  "dtliExcerpt": "I'm a peculiar blend of the Pragmatist and the Romanticist and the crocodile. The Monster,” Tennessee Williams said. After the triumph in 1947 of “A Streetcar Named Desire,” he dedicated himself to his own greatness; the result was a moral and emotional attrition, which his plays increasingly registered. “I grow less integrated,” Williams wrote to a friend in 1950. “I am more alone and more lost than I ever was, and know hundreds more people!” By the time he began to write his masterpiece of the mid-fifties, “Cat on a Hot Tin Roof,” now in a superb revival at the Music Box, his tally of losses included three consecutive critical failures—“Summer and Smoke,” “The Rose Tattoo,” and “Camino Real.” Williams’s embattled situation—his compulsion to lay claim to his literary legacy at all costs—found a fierce and funny reflection in the struggle of Maggie, “Cat on a Hot Tin Roof” ’s heroine, to seize her own sexual and financial inheritance. “My hat is still in the ring, and I am determined to win!” Maggie says. For her, endurance is everything. “Life has got to be allowed to continue even after the dream of life is—all—over,” she says. But her appetite for vindictive triumph has turned her, like Williams, into a monster—a fact that she recognizes but can’t change. To her aptly named husband, Brick, a frozen and aloof alcoholic, Maggie admits, “I’ve gone through this—hideous!—transformation, become—hard! Frantic!—cruel!!” In Maggie, “Cat on a Hot Tin Roof” offers us the first glimpse of the tortured and torturous inner terrain into which Williams had wandered (he called it “the beanstalk country”): a hell of his own making.",
  "fullText": null,
  "isFullReview": false,
  "originalScore": null,
  "assignedScore": null,
  "dtliThumb": "Down",
  "source": "dtli"
}