{
  "showId": "wicked-2003",
  "outletId": "nuvo",
  "outlet": "Nuvo",
  "criticName": "Gauthier Mitchison",
  "url": "https://www.nuvo.net/arts/review-wicked-from-broadway-in-indianapolis/article_5aa24e0a-3cce-412b-ad1a-ca6bd10fe434.html",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "In the current tour, Zoe Jensen plays Glinda and, June 18-22, Elphaba was played by Olivia Valli (June 24-July 6, the part will be played by Jessie Davidson). No disrespectation to director Joe Mantello or Valli, but I wasn’t a fan of Elphaba’s initial portrayal. She was much too coltish -- a slightly cringy adult trying to act like a kid. However, Valli absolutely nailed “Defying Gravity,” which is notorious for being one of the most demanderating musical belts ever. From there, Valli’s Elphaba",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Did-Critics-Think-Of-WICKED-On-Tour-20210922",
  "contentTier": "complete",
  "fullText": "“Wicked” is at Old National Centre/The Murat through July 6. Go to https://indianapolis.broadway.com/shows/wicked/ for details and tickets. Zoe Jensen as Glinda and the National Touring Company of \"Wicked.\" Photo by Joan Marcus. No doubt bolstered by the success of the first installment of “Wicked” on the big screen, the musical is just as pop-uuu-lar as when it premiered in 2003. Opening night’s Wizomaniacs in the audience weren’t shy about causing a disturberance for their favorite Ozmopolitan gals, including encouragerizing catcalls and “You go, girl!” -- often considered disrespectation in the the-ah-tah, but here it is a manifestorium of how new audiences have discoverated -- and responderated to -- “Wicked,” no matter how swankified the venue. But, no matter how many times you’ve seen it, hearing those first notes and seeing the Clock of the Time Dragon coming to life are always thrillifying. In “Wicked,” the linguification is a fun, subtle reminder of its storybook origins, injecting a sort of childishness into the book/musical/film's more mature interpretation of Oz’s witches and their motivations. Like Amy’s perpetual mispronunciations in “Little Women,” our reaction is an adult’s indulgent but amused smile at a child's struggle with vocabulistics, creating the vertiginous effect of feeling old and young at the same time. Olivia Valli as Elphaba in the national tour of \"Wicked.\" Photo by Joan Marcus. In the current tour, Zoe Jensen plays Glinda and, June 18-22, Elphaba was played by Olivia Valli (June 24-July 6, the part will be played by Jessie Davidson). No disrespectation to director Joe Mantello or Valli, but I wasn’t a fan of Elphaba’s initial portrayal. She was much too coltish -- a slightly cringy adult trying to act like a kid. However, Valli absolutely nailed “Defying Gravity,” which is notorious for being one of the most demanderating musical belts ever. From there, Valli’s Elphaba showed more poise as her character’s arc played out. Jensen is a perfect personification of Galindafication; and the supporting characters and large ensemble are spot-on. Gratitution for another chance to see the musical that turns a classic story sideways so we can see it from a greenified point of view. You can check out the Ozian Glossararium online. https://indianapolistheaterreviews.wordpress.com/ Keep it Clean. Please avoid obscene, vulgar, lewd, racist or sexually-oriented language. PLEASE TURN OFF YOUR CAPS LOCK. Don't Threaten. Threats of harming another person will not be tolerated. Be Truthful. Don't knowingly lie about anyone or anything. Be Nice. No racism, sexism or any sort of -ism that is degrading to another person. Be Proactive. Use the 'Report' link on each comment to let us know of abusive posts. Share with Us. We'd love to hear eyewitness accounts, the history behind an article. Snow flurries or snow showers. High 24F. Winds SSW at 5 to 10 mph.. Cloudy skies. A few flurries or snow showers possible. Low near 20F. Winds SSW at 5 to 10 mph. Updated: February 5, 2026 @ 11:50 am Success! An email has been sent to with a link to confirm list signup. Error! There was an error processing your request. Sign up to receive daily updates! Top 10 reader's preferences from the past week",
  "isFullReview": true,
  "textWordCount": 524,
  "archivePath": "data/archives/reviews/wicked-2003/nuvo--gauthier-mitchison_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:02:47.651Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "wordCount": 524,
  "tierReason": "Full review text"
}