{
  "showId": "wicked-2003",
  "outletId": "slantmagazine",
  "outlet": "Slant Magazine",
  "criticName": "Dan Rubins",
  "url": "https://www.slantmagazine.com/film/wicked-for-good-review-cynthia-erivo-ariana-grande-jonathan-bailey/",
  "playbillVerdictUrl": "https://www.slantmagazine.com/film/wicked-for-good-review-cynthia-erivo-ariana-grande-jonathan-bailey/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "For Good is never really emotionally affecting, even on the level of nostalgia. Glinda (Ariana Grande) may be Oz’s Good Witch, but she harbors a secret from her adoring citizens: She can’t do magic. At least the conniving Madame Morrible (Michelle Yeoh) has custom-designed a “Vehicular Spherical Globule”—a bubble—that will make Glinda look like she’s generating her own magical flight, much like her estranged bestie Elphaba (Cynthia Erivo), the Wicked Witch of the West, who defies gravity on her broomstick. “This invention will disguise your deficiency,” Madame Morrible tells Glinda. And much the same could be said of the myriad inventions—visual, musical, dramaturgical—that operate overtime to disguise the central deficiency of Jon M. Chu’s Wicked: For Good, a nearly two-and-a-half-hour adaptation of the musical Wicked’s 60-minute second act. On stage, the second act hurtles along, the show’s tone sharply darkening and the plot spiraling by too quickly for audiences to take note of its holes. But like a ship blown from its mooring by a wind off the sea, that momentum can’t possibly be sustained when the story’s sailing off on detours that delay the action without fundamentally reimagining it. Early on, the screenplay—by Dana Fox and the show’s bookwriter Winnie Holzman—smartly adds definition to the political forces at play after Elphaba first flies. Having uncovered a scheme by the fraudulent Wizard (Jeff Goldblum) to scapegoat and silence Oz’s talking animals, Elphaba now zips through the skies, spreading the word about the conspiracy and ambushing construction of the Yellow Brick Road, which is powered by animal labor. Just as attention-getting is Madame Morrible’s anti-green-girl propaganda campaign. When Elphaba interrupts Glinda’s public engagement to Fiyero (Jonathan Bailey) to sky-write “Your Wizard Lies,” Morrible essentially casts a deepfake spell, transforming the words to read the threatening “Oz Dies” instead. It’s mighty hard to parse what’s true anymore in Munchkinland, but this much is clear: the heightened contemporary allegory of that moment is shrewdly subtle. But once that exposition is squared away, what to do for the duration of the film? Though he amusingly interpolates some brief reprises of the first film’s hits with new verses in an expanded opening medley, composer-lyricist Stephen Schwartz also tosses in some unnecessary new songs. One is a consciousness-raising anthem, with uplifting harmonies reminiscent of songs from his musical Pippin, offered by Elphaba to the fleeing animals. Another is a ballad in which Glinda ponders with typical Schwartzian idiomatic wordplay, “For the popular girl high in the bubble, isn’t it high time for the bubble to pop?” (Schwartz also over-tinkers existing material: Wicked stans may seek justice for the dismantled verse of the Wizard’s “Wonderful” and the once-gripping transition from “I’m Not That Girl: Reprise” into “As Long As You’re Mine.”) But there’s blame to share here. Since the grimness of the show’s second act can’t hold its own against the needs of a PG-rated holiday release, Fox and Holzman shoehorn a lot of kid-friendly comedy into the script that comes at the expense of what should be high-stakes momentum. Yeoh, never convincingly sinister, faceplants into a wedding cake during an animal stampede, a la Glenn Close in 101 Dalmations, too forcefully silly to be camp. Goldblum, goofily asserting the Wizard’s supposed magic powers, feels like he stepped out of an Austin Powers film. And For Good doesn’t seem to know what to do with the newly expanded roles for Bowen Yang and Bronwyn James as Glinda’s hangers-on, given how quickly they disappear from the story. And just to clear the air, Erivo and Grande’s high points remain strong, and “No Good Deed,” Elphaba’s epic 11-o’-clock crashout is a cinematic sensation. As Elphaba casts a spell to save Fiyero, For Good pays homage to the color schemes of Victor Fleming’s The Wizard of Oz, intercutting black-and-white shots of Fiyero’s torture in a cornfield. Reflecting on how things have gone so bad, Elphaba wanders into the scene of her arrival at Shiz University, the characters frozen in place where they stood in the first film as she ruefully reconsiders them. Just as she did with her solos in that film, Erivo triumphantly reimagines the riffs here, the melted butter of her voice solidifying into icy steel as Elphaba gives up on doing good. Grande gets to unleash a little more pop belt for Glinda, suggesting a woman growing up and finding her real voice. She and Erivo both lean successfully into the political implications of their friendship: It’s clear here, in a way that it’s not on stage, that Elphaba, having failed to gain traction as a rabble-rousing radical, deliberately sacrifices herself in order to empower Glinda to make change from within the system. When the finale returns to the first film’s shot of Glinda burning a Wicked Witch statue in effigy, Elphaba’s story has now shifted to that of a would-be hero recognizing that she needs to assume the role of the villain in order to save the day. Intellectually, that’s an impressive screenwriting feat. But for as sharp as it may sometimes be, For Good is stretched out, breathless, and never really emotionally affecting, even on the level of nostalgia. (However bloated, the first film, to quote one of Glinda’s malapropisms, is thrillifying.) It may transport audiences, especially younger ones, to the colorful Oz for the bulk of an afternoon, but it also serves as a reminder that only in its tauter, wrenching stage form can Wicked, like a handprint on your heart, really leave you changed for good. Dan Rubins is a writer, composer, and arts nonprofit leader. He’s also written about theater for CurtainUp, Theatre Is Easy, A Younger Theatre, and the journal Shakespeare. Check out his podcast The Present Stage. Your email address will not be published. document.getElementById(\"comment\").setAttribute( \"id\", \"a10ac3a4efebc4fa47fd17224874880f\" );document.getElementById(\"facec42938\").setAttribute( \"id\", \"comment\" ); Save my name, email, and website in this browser for the next time I comment.",
  "isFullReview": true,
  "textWordCount": 976,
  "archivePath": "data/archives/reviews/wicked-2003/slantmagazine--dan-rubins_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:08:21.296Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 976,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-06T09:41:13.905Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a review of the Wicked movie adaptation, not a Broadway theater production; openai: The review is about 'Wicked: For Good', a film adaptation, not the current Broadway production of 'Wicked'.; kimi: This text reviews the film adaptation 'Wicked: For Good' (directed by Jon M. Chu, starring Ariana Grande and Cynthia Erivo), not the current Broadway stage production. It evaluates cinematic elements like screenplay, cinematography, and the PG-rated film release, comparing the movie unfavorably to the stage version.",
  "promptVersion": "5.2.0"
}
