{
  "showId": "wicked-2003",
  "outletId": "soundsphere-magazine",
  "outlet": "Soundsphere Magazine (Christopher Mills)",
  "criticName": "Christopher Mills",
  "url": "https://www.soundspheremag.com/reviews/wicked-for-good-review-an-unforgettable-musical-experience-that-will-change-your-lives-for-good/",
  "playbillVerdictUrl": "https://www.soundspheremag.com/reviews/wicked-for-good-review-an-unforgettable-musical-experience-that-will-change-your-lives-for-good/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Jon M. Chu creates the best Broadway-to-screen adaptation that we’ve seen while Ariana Grande and Cynthia Erivo deliver performances that elevate Wicked: For Good. There was a bond unlike any other that was made between Ariana Grande and Cynthia Erivo when Wicked Part 1was released last year. They changed the lives of their fans and even people who weren’t originally fans, like myself, for the better. Jon M. Chu took on the massive task of adapting the Wicked theatre production for the big screen, a show loved by many which Chu had to ensure was the best adaptation it could’ve possibly been, covering all angles, providing the perfect casting, and uniting everyone across the world, and that’s exactly what he did with Wicked Part 1 and has solidified with Wicked: For Good. There have been many films that Jon M. Chu has tackled, from the allusive Now You See Me 2 to the bustling rhythms of In The Heights. Chu has proven that musicals are his forte. Wicked: For Good has become one of the most anticipated movies of the year. After the sprawling success of the first film, from its critical praise, positive box office and unforgettable Academy Award live performance, almost the entire world is now ready to see how Elphaba (Cynthia Erivo) and Glinda’s (Ariana Grande) journey comes to an end. Wicked: For Good takes place years after Wicked Part 1’s ending. Elphaba has been branded the Wicked Witch of the West and is wanted by the entire nation of Oz for her false treacherous crimes, while Glinda has been branded as Glinda the Good, the witch who Oz will go to for protection. Underneath all the false pretences, Elphaba and Glinda’s friendship is what will determine if Oz and its people can truly be saved… for good. After witnessing what was the beautiful rise and slow fall of Elphaba and Glinda’s friendship, I couldn’t force myself to wait a year to see how Jon M. Chu was going to continue the story, so instead I took it upon myself to witness the full story at the theatre show, and unfortunately the second act didn’t fully live up to the expectations that had been created by myself, and compared to its first act, it felt underwhelming and lacked the energy that came with that first act. With the disappointment of the theatre show’s second act, Chu had a lot to work with, but thankfully with his first film, he highlighted how a movie adaptation of this show can flesh out the characters further, and that’s exactly what Wicked: For Good does with the show’s second act. The movie opens with Madame Morrible (Michelle Yeoh) spreading her false propaganda against Elphaba as we watch the Emerald City Guards torture the animals into building the Yellow Brick Road, which, ironically, Glinda herself chose the colour for in the previous film (the start of all the fake news). What remains present throughout the entire film is Madame Morrible’s propaganda that she manages to spread throughout the Land of Oz. While Michelle Yeoh might not have the strongest singing voice compared to the rest of the cast, and that’s perfectly fine considering she’s not a singer like the rest, she really stands apart as Madame Morrible, a woman as horrible as her name intends. It’s difficult not to hate this character with how she manipulates Glinda into doing her deed and tricks Oz into hating Elphaba. The weakest part of Wicked: For Good might be its supporting cast. While Jonathan Bailey and Ethan Slater still give great performances as their respective characters Fiyero and Boq, and Bailey shines in his rendition of “As Long as You’re Mine” alongside Erivo, it feels like both characters lack the screentime to truly feel the turmoil that they go through. “March of the Witch Hunters“, similarly to the theatre show, doesn’t feel nearly as powerful as it should be due to the pacing of Boq’s character journey. To nobody’s surprise, Wicked: For Good’s story coincides with The Wizard of Oz, meaning that Dorothy (Bethany Weaver) makes an appearance. It’s unfortunate because her random appearances throughout the film feel jarring with their cuts and how they choose to portray the faceless character. There’s a point in the movie where they showcase Dorothy through the use of shadows, similar to how the theatre production handled it, and I only wish that Jon M. Chu had decided to also use this method throughout, as it would’ve helped her scenes feel less distracting. If Elphaba was the sole focus of Wicked Part 1, then Glinda is easily the focus of Wicked: For Good. Some time has passed, and we witness that Glinda is fighting between what’s right and wrong. Madame Morrible is offering everything she’s ever wanted since she was a child: to feel important and to feel like she was making a change, but most importantly, what she’s wanted all along, to be able to use magic. Unlike Elphaba, she’s still incapable of traditionally using magic, but thanks to a few inventions from the Wizard (Jeff Goldblum), who’s also incapable of using magic, as we found out in the last film, Glinda is able to trick the people of Oz into believing she has magical abilities through the use of her bubble. It’s not something she’s proud of considering it reflects back on her childhood, in which Scarlett Spears does a fantastic job of portraying Glinda, replicating Ariana Grande perfectly and feeling like a spitting image. “Thank Goodness/Couldn’t Be Happier” is a great song that highlights the feelings that are boiling within Glinda. She states that she “couldn’t be happier”, but all things considered, it’s a song that involves Glinda trying to mask how she truly feels. Glinda feels guilty about how all of Oz is treating Elphaba, and despite her finally being able to get the life she always dreamed of – a symbol to the people, marrying the prince – deep down, she knows that she hasn’t earned any of this. Fiyero’s inclusion in the song, stating that he’s happy if she’s happy about being married, puts their relationship all into perspective and how they both feel about Glinda. Glinda, being trapped under Madame Morrible and the Wizard’s manipulation, isn’t able to let go of the life she has been given despite Elphaba’s treatment; she’s confused and herself questions the morality of it all. Is she being selfish for allowing Oz to silence and treat the animals in a harmful manner for the illusion of a grand life? Fiyero, on the other hand, only has one thing on his mind, and that’s finding Elphaba before anyone else does. He doesn’t care for all the glamour and respect and just wants to be hand in hand with the one person he truly loves, Elphaba. Ariana Grande and Cynthia Erivo both deliver performances that are emotionally resonant, elevating their respective character journeys and the overall friendship between the two characters. They both act as the glue for Wicked Part 1 and Wicked: For Good, and without their durable chemistry, these are films that truly just wouldn’t work as well as they do. Elphaba and Glinda have a complex relationship, both being from two different worlds who finally come together but are then torn apart due to their differences and moral grounds. Grande and Erivo deliver a powerhouse performance that complements each other, adding an extra layer to a dynamic that has been going on strong for over a decade, giving us one of the best friendships seen in all of cinema. As expected, there are differences between the Wicked theatre show and Wicked: For Good. One of the main differences which was seen as an improvement upon the theatre show was the song “Wonderful“. During the theatre show, it’s a song that’s sung between Elphaba and the Wizard, but in Wicked: For Good, Glinda is also added to the mix. It might seem like a small change at first, but it’s one that connects back to how Glinda truly feels and brings it back to their friendship, which Wicked: For Good does a great job of keeping at the centre of the film. She wants to be with Elphaba and is trying to show her the positive of everything. Even after almost falling for it all, Elphaba discovers a dirty secret that only tarnishes the trust that was built between her and Glinda. It sends off the same effect as the theatre show but is deeper with its meaning, with Glinda having been included with the song and trying to persuade Elphaba. While Glinda is key in Wicked: For Good, Erivo still shines as Elphaba. Constantly trying to help people and fix the corruption that the Wizard and Madame Morrible have spread but slowly making things worse despite it not being the intention. Erivo delivers a beautiful and unforgettable rendition of “No Good Deed“, which feels like the turning point of the entire film. It’s powerful, moving and sits with you until way after the credits roll as you begin to realise that Erivo might genuinely be one of the greatest portrayals of Elphaba. If you thought that she gave her all with the climatic “Defining Gravity“, then you’re not prepared for the outstanding, emotional “No Good Deed“. There are two original songs that are added to Wicked: For Good, “No Place Like Home” and “The Girl in the Bubble“. There was some initial worry with there being original songs added to the movie, as it could’ve overstuffed the film and affected its pacing or overall just taken away from the emotional impact, but thankfully the former is a great song, connecting Elphaba with her past and the animals she’s trying to save, but it’s the latter that deserves all its flowers. Cynthia Erivo had many songs in Wicked Part 1, from “The Wizard and I” to “Defying Gravity“, but Ariana Grande finally gets her own song that explores Glinda’s vulnerability, her anger at Elphaba and Fiyero, but most importantly, her realisation that she finally has to do what’s right to stick by her best friend and the people of Oz. It’s Glinda’s turning point in the movie, and Ariana Grande while still funny and lively as ever as the character, comes full circle, grounding her with her portrayal of the character and, just like Cynthia Erivo, solidifying herself as one of the greatest Glindas in all of Wicked’s history. Overall, Wicked: For Good is a musical adaptation that concludes the two-part epic that Jon M. Chu has masterfully orchestrated and is easily one of the best Broadway-to-screen adaptations that we’ve witnessed. Ariana Grande and Cynthia Erivo return in full force, highlighting their unbelievable and impressive vocals while also delivering grounded, deeply thought-provoking performances as both Glinda and Elphaba. Wicked: For Good is a movie that will work perfectly watching it back to back with Wicked Part 1 as intended, giving an experience as close as possible to the theatre production. The film has its drawbacks, but with its small changes and original songs, it’s a great improvement over the theatre show’s second act and ever so slightly better than its predecessor, making Wicked: For Good a must-watch movie of 2025 and a cinematic event that can’t be missed!",
  "isFullReview": true,
  "textWordCount": 1881,
  "archivePath": "data/archives/reviews/wicked-2003/soundsphere-magazine--christopher-mills_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:08:38.282Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 1881,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-06T01:36:22.588Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This is a review of the Wicked movie adaptation directed by Jon M. Chu, not the current Broadway production of the stage musical; openai: The text is a review of the film adaptation 'Wicked: For Good', not the Broadway production of 'Wicked'.; kimi: This is a review of the film adaptation 'Wicked: For Good,' not the Broadway theatrical production. While it compares the movie to the stage version, the primary subject, evaluative focus, and final recommendation all concern the cinematic release rather than the current Broadway run.",
  "promptVersion": "5.2.0"
}
