{
  "showId": "wicked-2003",
  "outletId": "telegraph",
  "outlet": "The Telegraph",
  "criticName": "Robbie Collin",
  "url": "https://www.telegraph.co.uk/films/2025/11/18/wicked-for-good-review-second-part-fails-to-take-flight/",
  "playbillVerdictUrl": "https://www.telegraph.co.uk/films/2025/11/18/wicked-for-good-review-second-part-fails-to-take-flight/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "UK Edition\n \n \n \n\n \n \n \n \n\n \n\n \n \n \n \n \n\n \n \n \n\n \n \n\n \n\n \n\n \n\n \n \n \n\n \n\n \n\n \n \n \n\n \n\n \n \n \n\n \n \n \n \n\n \n\n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n\n \n \n\n \n\n \n\n \n\n \n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n \n \n\n \n\n \n\n \n \n \n \n \n\n \n \n\n \n\n \n\n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n\n \n \n\n \n \n\n \n \n \n \n \n\n \n \n \n \n \n\n \n \n \n \n Cynthia Erivo as Elphaba and Ariana Grande as Glinda in Wicked: For Good\n \n \n\n \n \n \n \n Credit: Universal Studios/Giles Keyte\n \n \n \n \n\n \n\n \n \n\n \n\n \n\n \n \n\n \n \n \n \n \n\n \n\n \n \n\n \n \n\n \n \n \n\n \n \n \n \n \n \n\n \n \n\n \n \n \n\n \n \n \n\n \n\n \n \n\n \n \n \n \n \n \n\n \n \n\n \n \n\n \n \n\n \n \n \n\n \n \n \n \n \n Robbie Collin\n \n \n\n \n \n\n \n Chief Film Critic\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n\n \n\n \n \n \n\n \n \n \n \n \n \n\n \n\n \n \n 21 November 2025 7:00am GMT\n \n \n\n \n\n \n \n\n \n \n\n \n\n \n\n \n \n\n \n\n \n \n\n \n \n\n \n \n Even the staunchest defenders of Wicked, the stage musical about the tragic origins of The Wizard of Oz’s Witch of the West, would have to concede that it peaks just before the interval. So Universal’s decision to split their screen adaptation in two always meant that even in a best-case scenario, part two was going to be a bit stingy and thin. While the end result isn’t quite the worst-case scenario some of us were dreading, it’s still a deeply annoying one.\n\nWe are back in the franchise’s strikingly unpersuasive version of Oz, with its computer-generated sunlight and Haribo colour schemes, where Cynthia Erivo’s Elphaba Thropp has just gone rogue. The green-skinned magical trainee from Shiz University – AKA woke Hogwarts – has rumbled Jeff Goldblum’s fraudulent Wizard: she’s now carrying out a one-witch campaign of guerrilla warfare against the Oz Regime, while hooking up with Jonathan Bailey’s Prince Fiyero – who is betrothed to Ariana Grande’s Glinda the Good – at her treehouse in the evenings.\n\nCynthia Erivo and Ariana Grande attend the Wicked: For Good European premiere in London earlier this month\n \n \n\n \n \n \n \n Credit: Gareth Cattermole/Getty Images Europe\n \n \n \n \n\n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n\n \n \n There’s plenty of double-crossing to get through before Dorothy’s arrival (whose appearance here turns out to be part of an Oz psychological operation to draw Elphaba out of hiding). But it doesn’t amount to two hours of story – the stage show clips through the same plot in around half the time – and the padding is as obvious as it is exhausting.\n\nGrande, in particular, often seems to be trying to walk through her scenes as slowly as possible: as a performer she has a range of four octaves and around 1.6 emotions, and as such Glinda’s smaller moments simply aren’t dramatically interesting enough to merit this moonily protracted approach.\n\nErivo is a little better – you certainly buy her inner torment – but the pair’s strained friendship rings false, and what should be piercing, impassioned moments are by turns frivolous and sappy.\n\nBoth stars have been given a new song (both by original composer Stephen Schwartz), which stand out by dint of being fully formed musical numbers, as opposed to the noodly warblings that make up much of the rest of the score. Inexplicably, though, both are wailing laments, and you find yourself gasping for a new comic number like Popular, or another barnstormer like Defying Gravity, or anything else that might have lent proceedings structure and purpose.\n\nWhat makes it so frustrating is that director Jon M Chu is an established musicals master; his In the Heights is a modern classic of the form. But the corporate stretch-it-out-and-wring-it-dry approach here has been deadening. Call the whole benighted enterprise Wicked: For Ill.\n\nTo see a list of our partners and check how your data might be used, click or tap ‘Manage’ below. You can also review where our partners claim a legitimate interest to use your data and, should you wish, object to them doing so.",
  "isFullReview": true,
  "textWordCount": 526,
  "archivePath": "data/archives/reviews/wicked-2003/telegraph--robbie-collin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:09:11.851Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 110 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 526,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-06T09:41:33.008Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a review of the Wicked movie adaptation, not the Broadway stage production. The review discusses Universal Studios' film split into two parts, computer-generated effects, and director Jon M Chu's cinematic approach.; openai: The text is a review of a screen adaptation of Wicked, not the current Broadway production.; gemini: This is a review of the Wicked movie, not the Broadway show.; kimi: This is a review of the film 'Wicked: For Good' (the movie sequel), not the Broadway musical. The text references 'screen adaptation,' 'computer-generated' visuals, film director Jon M. Chu, and film stars Cynthia Erivo and Ariana Grande, indicating it is a film criticism, not a theater review.",
  "promptVersion": "5.2.0"
}
