{
  "showId": "wicked-2003",
  "outletId": "the-jewish-chronicle",
  "outlet": "The Jewish Chronicle",
  "criticName": "Toby Tabachnick",
  "url": "https://jewishchronicle.timesofisrael.com/still-popular-wicked-soars-again-in-its-return-to-pittsburgh/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "The production at the Benedum is outstanding. Zoe Jensen plays Glinda with the over-the-top narcissism that defines the role and makes it so fun, but also delivers depth of character. She is the perfect complement to Jessie Davidson’s Elphaba, who strikes an inspired balance of nerdiness, compassion, intellect and determination. And, boy, can she sing. The show’s third number, “The Wizard and I,” left this audience member wanting more, and Davidson delivered later in the first act with a plainti",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Did-Critics-Think-Of-WICKED-On-Tour-20210922",
  "contentTier": "complete",
  "fullText": "After more than two decades on stage, “Wicked” remains, in Glinda’s words, undeniably “popular.” And it’s easy to see why. With an inventive story, resonant themes and an iconic score, the show continues to strike all the right notes. The touring production has made its sixth stop in Pittsburgh. It opened on Jan. 14 and runs through Feb. 15 at the Benedum Center as part of PNC Broadway Pittsburgh series. The fourth-longest running show in Broadway history, “Wicked” has won three Tony awards and has been performed in more than 100 cities in 16 countries around the world. Its appeal is universal, not only for its sheer entertainment value, but in its messaging about the dangers of unjust persecution. Get The Jewish Chronicle Weekly Edition by email and never miss our top stories Free Sign Up “Wicked” the musical is based on the book by Geoffrey Maguire, which delves into the hidden histories of the witches of Oz. Set years before Dorothy’s arrival, it traces the story of Elphaba, fierce and misunderstood, and Glinda, ambitious and adored, whose unexpected friendship upends Oz’s understanding of good and evil. The show has a strong Jewish history. It was co-written by two Jewish artists: Carnegie Mellon University graduate Stephen Schwartz, who wrote the music and lyrics, and Winnie Holzman, who wrote the script. On Broadway, the show was produced by Marc Platt, and its original cast included Idina Menzel and Joel Gray. The film, which was released in two parts, features Pittsburgh native Jeff Goldblum as The Wizard. While its themes are not overtly Jewish, it’s easy to draw parallels between Oz’s intolerance of those who are different — in the show, the green-skinned Elphaba and the anthropomorphic goat, Doctor Dillamond — and the prejudice Jews and other minorities have faced for millennia. As Doctor Dillamond explains, when there was a drought in Oz, and people became hungrier and angrier, they asked: “‘Whom can we blame?’ Can anyone tell me what is meant by the term ‘scapegoat’”? The production at the Benedum is outstanding. Zoe Jensen plays Glinda with the over-the-top narcissism that defines the role and makes it so fun, but also delivers depth of character. She is the perfect complement to Jessie Davidson’s Elphaba, who strikes an inspired balance of nerdiness, compassion, intellect and determination. And, boy, can she sing. The show’s third number, “The Wizard and I,” left this audience member wanting more, and Davidson delivered later in the first act with a plaintive “I’m Not That Girl,” and then the show-stopping “Defying Gravity.” The entire cast in this show is excellent. Ethan Kirschbaum plays Fiyero with a blend of bravado and warmth, and leads an exuberant rendition of “Dancing Through Life.” Other standouts include Nicolas Garza as Boq, the Munchkin tormented by unrequited love, and Blake Hammond as The Wizard, who somehow makes the villainous character almost lovable. The ensemble in this production is stellar, delivering picture-perfect choreography and bringing the scenes to life, whether portraying Shiz students, citizens of Oz or flying monkeys. A word about the flying monkeys: I have never actually seen a real flying monkey, but if they did exist, I imagine they’d move exactly as they were depicted in this show. The production is enhanced by clever costumes and inventive lighting, particularly in the Emerald City and during “Defying Gravity,” the final number before intermission. The song itself is powerful, but combined with the vivid staging and seemingly magical light effects, it’s impact is, as Elphaba might say, “unlimited.” PJC Toby Tabachnick can be reached at ttabachnick@pittsburghjewishchronicle.org.",
  "isFullReview": true,
  "textWordCount": 593,
  "archivePath": "data/archives/reviews/wicked-2003/the-jewish-chronicle--toby-tabachnick_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:37:09.838Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 593,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-06T09:41:55.396Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a touring production of 'Wicked' in Pittsburgh, not the current Broadway run.; kimi: This review explicitly covers the touring production at Pittsburgh's Benedum Center ('The touring production has made its sixth stop in Pittsburgh'), not the current Broadway production.",
  "promptVersion": "5.2.0"
}
