{
  "showId": "wicked-2003",
  "outletId": "theater-about-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://theater.about.com/od/reviewsandrecommendations/tp/Reviews-The-Book-of-Mormon-Matilda-and-Wicked.htm",
  "publishDate": null,
  "fullText": "While there's a lull in openings of new Broadway shows, I figured it might be fun to check in with some of the biggest hits of past seasons. I loved The Book of Mormon, Matilda, and Wicked the first time I saw each show. Do they hold up to repeat viewings? And are the productions still in top-notch shape?\n\nThere's no stopping The Book of Mormon. The Broadway production has been playing to packed houses for four years, and sales show no sign of softening. Does the show itself live up to the hype? Well, for me it does. I saw the show very shortly before it opened in 2011 and veritably howled with laughter. (Read my review.) This was before the cast recording came out, so I went in pretty cold. But it was almost as funny the second time, even when I knew the jokes that were coming. Sure, the lyrics are poorly crafted at times: Trey Parker and Matt Stone have never really cared about scansion and rhythmic consistency. But the show is just so smart and so deliciously profane, I'm willing to give these guys a pass. The new cast has some real standouts, particularly Christopher John O'Neill, who is very appealing and original as Elder Cunningham, the role originated by Josh Gad. Gavin Creel was a tad more problematic as Elder Price, the Andrew Rannells role. He's been playing the part for a while in London, and he comes to Broadway with just a bit too much confidence and bald-faced mugging. Nikki Renée Daniels has very little of Nikki M. James' naïve charm as Nabulungi, and the normally dynamic Daniel Breaker makes for a rather indistinct Mafala, Nabulungi's father. But the essential hilarity of the piece itself makes The Book of Mormon well worth a visit, or a revisit.  \n\t\t\t\t\t\t\t\t\tMore &raquo;\n\nAs I've been saying for a few years now, Matilda is a far superior show to Kinky Boots, although the latter inexplicably beat out the former for the 2013 Best Musical Tony Award. Thankfully, this hasn't stopped Matilda from becoming a blockbuster in its own right. (Read my review.) True, Tim Minchin's lyrics are often too dense for their own good, and the faux English accents of the cast are inconsistent and distracting. But the piece itself remains a charmer, a heartwarming story of a neglected but exceptional young girl who eventually finds her true home. It was my third time seeing the show, and I think I was even more moved this time around. Minchin picks wonderful moments to musicalize, and his music is often glorious. I don't think I will ever tire of hearing and seeing &#34;When I Grow Up&#34; and &#34;Revolting Children.&#34; The new cast members are mostly quite strong, particularly Christopher Sieber as Agatha Trunchbull. Sieber is always a delight onstage, and he bites into the meaty role of Miss Trunchbull with so much relish, it's hard not to cheer for the villain. Matt Harrington is slightly less edgy and oily than Tony winner Gabriel Ebert as Mr. Wormwood. Tony nominee Leslie Margherita is still with the show, and she seems to be taking the part a whole lot broader since last I saw the show. It still works, but she gives off the sense that she's trying to teach the newbies how to really camp it up. \n\t\t\t\t\t\t\t\t\tMore &raquo;\n\nI continually come across people who want to shame me for my abiding love for Wicked. Something this popular, they seem to say, can't possibly be good. I beg to disagree. Wicked is simultaneously an entertaining, well crafted, and intelligent show. I've defended the show in print more than once. (Read my most recent defense here.) But ultimately I really don't care what others think. I love Wicked. Stephen Schwartz's score is both tuneful and smart. Winnie Holzman's book is actually a significant improvement over the Gregory Maguire original, which I find detrimentally dense. The physical production of Wicked has just enough spectacle to keep the tourists agog, but the technology actually serves the message of the show, rather than covering up the fact that there isn't one. (&#34;The Phaaaaaaaaaaantom of the Opera is here...&#34;) The current cast members are almost universally excellent, particularly Caroline Bowman as Elphaba and Kara Lindsay as Glinda. Matt Shingledecker as Fiyero was a huge improvement over Joey McIntyre, whom I saw sleep through the role back in 2004. The only weak link was Tom McGowan as the Wizard. McGowan is normally a terrific performer, but his Wizard lacked menace, and felt far too casual for the stakes of the role. I was surprised to see numerous empty seats at the rear of the orchestra. Is Wicked starting to wane 12 years into its run? More likely the show is just feeling the February box-office chill. Come warmer weather, I fully expect Wicked to return to turn-away business. \n\t\t\t\t\t\t\t\t\tMore &raquo;",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 815,
  "archivePath": "data/archives/reviews/wicked-2003/theater-about-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:35:05.419Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.goto: net::ERR_NAME_NOT_RESOLVED at http://theater.about.com/od/reviewsandrecommendations/tp/Reviews-The-Book-of-Mormon-Matilda-and-Wicked.htm\nCall log:\n  - navigating to \"http://theater.about.com/od/reviewsandrecommendations/tp/Reviews-The-Book-of-Mormon-Matilda-and-Wicked.htm\", waiting until \"domcontentloaded\"\n"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (503): Request failed with status code 503"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20160611085643",
  "archiveOrgUrl": "http://web.archive.org/web/20160611085643/http://theater.about.com/od/reviewsandrecommendations/tp/Reviews-The-Book-of-Mormon-Matilda-and-Wicked.htm"
}