{
  "showId": "wicked-2003",
  "outletId": "time",
  "outlet": "Time",
  "criticName": "Richard Zoglin",
  "url": "http://content.time.com/time/magazine/article/0,9171,1006179,00.html",
  "publishDate": null,
  "fullText": "No one mourns the wicked,” goes one big number in the new Broadway musical Wicked. But in this shrewd and enjoyable retelling of the Wizard of Oz story from the witches’ point of view, they get something better: understanding. Turns out that Elphaba, better known to us as the Wicked Witch of the West, was born green, and that caused her to be shunned by the popular kids at school. The most popular of them all is Glinda, a perky prom queen used to getting her own way. The two become unlikely friends. But things go awry when Elphaba finds herself on the wrong side of the not-so-wonderful Wizard. He tricks her into using her spells to enslave the animals of the realm. She’s turned into a pariah–even Glinda abandons her–and, as if that weren’t enough, some farm girl’s house has fallen smack on her sister. Toto, we’re not in Kansas anymore–or at your usual Broadway musical. Wicked flouts nearly every rule of hitmaking in the post–Andrew Lloyd Webber age. The sets, despite an irrelevant smoke-breathing dragon looming at the top of the curtain, are big but blah. Stephen Schwartz’s songs are unmemorable. Splashy, dance-filled production numbers keep threatening to break out but remain elusively somewhere over the rainbow. No, Wicked works because it has something Broadway musicals, so addicted to facetiousness and camp, have largely given up on: a story that adults can take seriously. Adapted by Winnie Holzman from the 1995 novel by Gregory Maguire (whose latest novel, Mirror, Mirror, is a reworking of Snow White), the musical reimagines a children’s tale in grownup psychopolitical terms a lot more successfully than, say, Stephen Sondheim and James Lapine did for Into the Woods. Elphaba is a misunderstood social reformer who threatens the rulers of Oz; her “wickedness” is their creation, not hers. As the Wizard (Joel Grey) puts it, “The best way to bring folks together is to give them a really good enemy.” Imagine: a family musical that might make the Bush Administration squirm. Which isn’t to say Wicked, under Joe Mantello’s assured direction, lacks fun. The show gets laughs by playing off famous bits from the movie. (“What’s in the punch?” “Lemons and melons and pears.” “Oh my!”) It also provides a showcase for two fabulous Broadway stars. Kristin Chenoweth, the Kewpie doll who won a Tony for You’re a Good Man, Charlie Brown, is a perfect delight as Glinda. In the tougher role of Elphaba, Idina Menzel is possibly even better, a mix of vulnerability and feminist passion, with a rock voice to raise the roof. With an awful lot of plot to establish, the show drags in spots. But if every musical had a brain, a heart and the courage of Wicked, Broadway really would be a magical place.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"No one mourns the wicked,\" goes one big number in the new Broadway musical Wicked. But in this shrewd and enjoyable retelling of the Wizard of Oz story from the witches' point of view, they get something better: understanding.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 464,
  "archivePath": "data/archives/reviews/wicked-2003/time--richard-zoglin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:09:54.730Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 464,
  "tierReason": "Full review text"
}