{
  "showId": "wicked-2003",
  "outletId": "trib-live",
  "outlet": "Trib Live",
  "criticName": "Alexis Papalia",
  "url": "https://triblive.com/aande/theater-arts/review-latest-wicked-production-at-benedum-center-is-as-enchanting-as-ever/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "But aside from the serious stuff, “Wicked” is a bright, fizzing, sparkly spectacle of a musical. Taking cues from the original “Wizard of Oz,” much of the musical feels like it’s in Technicolor, whether in Glinda’s pink dresses or in the verdant lights of the Emerald City.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Did-Critics-Think-Of-WICKED-On-Tour-20210922",
  "contentTier": "excerpt",
  "fullText": null,
  "isFullReview": false,
  "textWordCount": 140,
  "archivePath": "data/archives/reviews/wicked-2003/trib-live--alexis-papalia_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:10:00.003Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 140 (min: 300)",
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Because you are coming from a location (Virginia) covered by a Privacy Law, many of the features of TribLIVE.com, like videos and social media elements are disabled. If you wish to proceed to the site under those conditions (doing so will effectively opt you out of the sale of your personal data) click here. However you will not experience the full features of TribLIVE.com that rely upon third party networks that may require your personal data. Click here to agree to experience the full features of TribLIVE.com and to opt in to the use of your personal data to provide that experience and advertising. Bookmark this page to manage your preferences any time in the future. If YOU ARE NOT visiting us as a resident of Virginia? Please update your location to ensure you are presented with the best experience."
}