{
  "showId": "wicked-2003",
  "outletId": "unknown",
  "outlet": "unknown",
  "criticName": "Unknown",
  "url": "http://www.apnewsarchive.com/2003/-Wicked-Musical-Shows-Another-Side-of-Oz/id-772550de6e62eaaef91c61a69808219f",
  "publishDate": null,
  "fullText": "What evokes more childlike wonder than going to the theatre? To suspend your disbelief and slough of adult cynicism? Today I won the theatre geek jackpot. I went to see Wicked (music/lyrics by Stephen Schwartz; Book by Winnie Holzman) on Broadway for the first time starring my collegiate friend, Mariand Torres, as Elphaba. As if this was not enough, I brought my 6 year-old daughter, budding theatre enthusiast, Hazel.\n\nCheryl and Mariand in CollegeLet me give you some back-story&#8230; There is a reason with all of the theatre that I&#8217;ve seen over the years that I&#8217;ve never seen Wicked (based on the book by Gregory Maguire). When I was 19, I was in theatre school and we were doing practice auditions for an upcoming show.  I finished my song and sat down feeling content with my singing, when next strutted up a raven-haired bombshell who sang with such finesse and power that I knew at that moment I was seeing a star. I also knew that I would never make it in musical theatre with that girl as competition. I knew that someday she would star as Elphaba in Wicked on Broadway and I wanted to see only her play that part.\n\nWhen I got word that Mariand would understudy Elphaba, I waited for her to be scheduled to perform and with the effervescent excitement of my 6 year-old, I purchased the tickets and off we went.\n\nHazel and Cheryl at WickedThe entire experience started with my daughter in the lobby, she was in awe of every design detail. I probably wouldn&#8217;t have even batted an eye at these things if I were alone.  She was nervous and excited. She was concerned about the spooky dark nature of the show, and although we discussed the plot line, it remains difficult for her princess-oriented mind to understand that the green witch was going to be &#8220;good.&#8221;\n\nOnce we took our seats, her nervous excitement was magnified by the dragon which she was concerned might come down and eat us. She also noted the lighting of the emerald city and wondered aloud why and how it glowed. I reminded her again that this was all for entertainment and the lighting (by Kenneth Posner) helped create an emotional experience. Once the curtain went up, cranked by spooky monkeys, Hazel leaned forward in her seat so far onto the edge that she nearly fell off.  She was immediately taken by the striking costumes (by Susan Hilferty), which transported the audience into the fantastical world that felt timeless and full of possibility.\n\nPJ Benjamin. Photo by Joan Marcus.As a mother to two small children, my precious free time requires me to be very selective about the shows I see, and I admit that I thought this show was going to be mostly cliché and fluff, without much substance. I was wrong. This show (directed by Joe Mantello) with the current political climate has more relevance now than ever before. Wicked is the story of a gifted woman in the fictitious Land of Oz with an unfavorable physical condition (green skin), who is driven to public service, fighting for minority rights against a regime who wants to silence and imprison minority members of its own society. Oh, and the Wizard of Oz (artfully portrayed by PJ Benjamin) is a nasty, slimy, lecherous, lying, snake oil salesman and talentless hack, who rules Oz through manipulation of press and fear mongering. Sound familiar?\n\nGalinda, played by Amanda Jane Cooper had not only great vocal chops, but also added a sympathetic quality to her performance with colorful acting choices adding dimension and depth. She successfully enchanted the audience into loving her and understanding the circumstances that drove her to make the choices she made. She &#8220;knows about popular&#8221; and shows in her redemption at the end of the show that she can choose to use those powers for good. Perhaps, this is a hope for our political future as well.\n\nElphaba, played by Mariand Torres, was a strong and formidable force on stage.  She demonstrates vulnerability with a touch of humor in the party scene when dancing, and is quite endearing as she accepts Galinda&#8217;s help to be popular. She clearly sets up that the problem is with how society relates to her rather than the lack of effort on her part. Throughout the show Torres successfully adds self-deprecating humor which makes her that much more likable. She is endearing and lovable in intimate moments and her voice mourns in &#8220;I&#8217;m Not That Girl&#8220;. But it is in the power ballad &#8220;Defying Gravity&#8221; that I cried the ugly cry as Hazel gripped my arm. With tears streaming down my cheeks, I couldn&#8217;t help thinking about how hard Mariand has worked all of these years, and it&#8217;s so obvious, as it was at that first audition, that she was meant to fly. I know over the years of pounding the pavement that at times she must have felt defeated, that she wasn&#8217;t enough of this, or too much of that. She has a voice not of this place and she is never coming down again.\n\nWhen the curtain came down on Act One, Hazel looked at me with those big brown eyes and said, &#8220;I love this. That was amazing.&#8221; And I had the pleasure of saying, &#8220;and it&#8217;s not over yet!&#8221;\n\nAct Two was much more plot-centric and I regretted at moments that Hazel had not yet watched The Wizard of Oz, so she missed the assumed knowledge of Dorothy, which meant she missed some funny moments. She also missed some of the references made by the set itself (by Eugene Lee). When the Boq (Jye Frasca) and Fiyaro (Ashley Parker Angel) are changed into Tinman and Scarecrow, it was a tough leap of understanding for my first-grader. I just leaned into her ear and whispered that she had to change them to save them.\n\nI laughed aloud as Elphaba yelled down the hatch at Dorothy. The final glimpse of Elphaba and Fiyero/Scarecrow walking off together was a sweet and satisfying resolution for me, but Hazel had a lot of follow-up questions:\n\nAnd my favorite question, how can she just take off her glasses and still see?\n\nAll reasonable questions for her first experience with moral ambiguity. Her first foray into the grey areas of the adult world was an overall exceptional experience and one that I can build on as a parent.\n\nI&#8217;m in love with this show; I&#8217;m in love with the message it sends and the lesson that there is perhaps wickedness thrust upon good people at times. I fully intend to teach my daughter that doing what is right and being popular are not necessarily the same thing. So, Hazel loved the show. She wants to be Elphaba for Halloween. I couldn&#8217;t be happier or prouder as a mom that she wants to be nasty, I mean Wicked.\n\nMy first experience of Wicked was as a 12 year old in 2006 and I saw it with my mom. Seeing Wicked on Broadway played an important role in my musical journey. Wicked was how I began to understand the emotional and complex side of musicals. It was able to spark my love for musicals. In all I have seen it four times and each time, the show continues to get deeper and deeper and better and better, but each time I still feel like a 12 year old\n\nThere are so many things about this that make me happy.  First is the fact that we can praise a dear friend&#8217;s hard work and talent, and then there&#8217;s the opportunity to share that praise and admiration with our daughters.   Truth be told, I&#8217;m a bit &#8220;green with envy&#8221; that I haven&#8217;t had the chance to see our Mariand star in the role (unless you count the numerous times I&#8217;ve stalked, I mean searched, for her on YouTube).    The story, much like our girl, is classic and timeless.   As for the idea of fostering in our children that same unrendering love and passion for theater that we share, my hope is if we build it, they will come.  I guess it&#8217;s sort of like broccoli (I&#8217;m committed to this green theme).  Chances are if you expose them enough, something will stick.  Bravo, mommy.\n\n[&#8230;] designed by John Doyle (CSC&#8217;s Pacific Overtures), with original music by Stephen Schwartz (Wicked, Pippen), is airy and sweet, filled with charming 1940&#8217;s style swing music (music supervisor: [&#8230;]\n\n[&#8230;] Something Rotten!) and the shy Papi, a heart-warming Etai Benson (Broadway&#8217;s Wicked) embrace the lost foreigners. Stuck in that town until the next morning&#8217;s bus, the band tries [&#8230;]\n\n[&#8230;] written all over this piece. On the white walls of the crafty set (sets: Scott Pask; lighting: Kenneth Posner; sound: Brian Ronan; video: Finn Ross & Adam Young) to the clean and precise costumes by Gregg [&#8230;]\n\n[&#8230;] knowing that my good friend is as much of a Broadway junkie as I am (she wrote the recent review of Wicked), and her husband, while being a newbie to the theatre world, is definitely on the way to joining [&#8230;]\n\n[&#8230;] March 29th at the Golden Theatre. Directed by the always amazing and interesting Joe Mantello (Wicked, The Humans), this will be the the second most exciting revival of a play on Broadway this year [&#8230;]\n\n[&#8230;] life, while the living are not so hopefully, this may be the richest line stated by William Ryall, (Wicked, an original cast member from Grand Hotel that started in a dilapidated hotel ballroom on w43rd [&#8230;]\n\n[&#8230;] (“She doesn’t even go here!“). Mean Girls feels fresh and funny, equal to the aging Wicked, and way better than the other girl power musicals that surround the show (yes, I&#8217;m talking [&#8230;]\n\n[&#8230;] FAVORITE LONG-RUNNING SHOW Anastasia Dear Evan Hansen Hamilton Waitress Wicked [&#8230;]\n\n[&#8230;] just off of 8th Ave on 51st. It&#8217;s right across the street from two hit musicals on Broadway, Wicked and Once on this Island, but Overheard in Joe’s couldn’t be more different. Created and [&#8230;]\n\n[&#8230;] a rock star anthem magistery, and thanks to the musical direction by Bryan Perri (Broadway&#8217;s Wicked) and the music supervision, orchestrations, and arrangements by Tom Kitt (Broadway&#8217;s [&#8230;]\n\n[&#8230;] and strong music supervision, arrangements, and orchestrations by Will Van Dyke (Broadway&#8217;s Wicked) with sound design by John Shivers. But somehow, the team fails to locate moments of absolute [&#8230;]\n\n[&#8230;] song and the structure, courtesy of musical supervisor and conductor Joel Fram (Broadway&#8217;s Wicked), giving movement and emotional clarity to the devastating lyrics. Bobbie&#8217;s airline [&#8230;]\n\n[&#8230;] photo and video work projected on the walls by designer Elaine J. McCarthy (Broadway&#8217;s Wicked), especially all those magazine covers, the piece feels extremely relevant and particularly [&#8230;]\n\n[&#8230;] of show]), bagel boy Rob Camilletti, delightfully played by Michael Campayno (Broadway&#8217;s Wicked) getting a quick and noble nod, and the handsome Gregg Allman wonderfully strutting forward in the [&#8230;]\n\n[&#8230;] safety zone, designed with an intrinsic eye for detail and beauty by Edward Pierce (worldwide Wicked), with spectacularly dynamic lighting by Bradley King (Broadway&#8217;s Bernhardt/Hamlet), and [&#8230;]\n\n[&#8230;] so much fun to be with when she was hypnotized by PMP&#8217;s  Annie, Broadway&#8217;s Frozen, Wicked, and Cinderella, but unfortunately for me, she had to sit this opening night performance out.  [&#8230;]\n\n[&#8230;] for the future, embodied by the well meaning and vocally adept Ryan McCartan (Broadway&#8217;s Wicked) is not exactly nudged, but full on pushed hard towards his demise by his girlfriend, Pat, a [&#8230;]\n\n[&#8230;] a rock star anthem magistery, and thanks to the musical direction by Bryan Perri (Broadway’s Wicked) and the music supervision, orchestrations, and arrangements by Tom Kitt (Broadway’s SpongeBob [&#8230;]\n\n[&#8230;] the cast as a whole gives the square space, beautifully crafted by Susan Hilferty (Broadway&#8217;s Wicked), an elusive strength. It&#8217;s tense with dignity, accentuated majestically with dynamic backlit [&#8230;]\n\n[&#8230;] and the structures, courtesy of musical supervisor and music director, Joel Fram (Broadway’s Wicked), giving new movement and emotional clarity to all of the devastatingly ironic and witty lyrics and [&#8230;]\n\n[&#8230;] girls who didn&#8217;t manage to snag a(nother) ticket to see their favorite musical of all time, Wicked, or maybe Aladdin. But that doesn&#8217;t mean it can&#8217;t be doctored into something smarter [&#8230;]\n\n[&#8230;] the Stephen Sondheim Theatre (124 West 43rd St.). The eye of that tiger will pop-please the Six and Wicked crowds with ease. That, I am sure. So “hit me baby one more time” & Juliet. I’d gladly [&#8230;]\n\n[&#8230;] piece of musical theatre, and even though & Juliet doesn’t quite reach that high mark of Wicked-ly wise, you can&#8217;t help but gulp down the music and the musical as if you were utterly [&#8230;]\n\n[&#8230;] were obviously ridiculous, sounding good thanks to music supervisor T.O. Sterrett (Broadway&#8217;s Wicked) and music director Marco Paguia (Broadway&#8217;s Girl From the North Country), but the cleverness [&#8230;]\n\n[&#8230;] Favorite Long-Running ShowWicked [&#8230;]\n\n[&#8230;] that shiver in our collective bones with those strongly felt orchestrations by William David Brohn (Wicked). Conquering oceans with such hopeful determination, brave souls, like Tateh, compassionately [&#8230;]\n\n[&#8230;] Some of the musical numbers, delivered strong by music supervisor Stephen Oremus (Broadway&#8217;s Wicked) and carried forth by sound designer Brian Ronan (Broadway&#8217;s The Great Gatsby), have so much [&#8230;]\n\n[&#8230;] Gatsby &#8211; 3Our Town &#8211; 3Pirates! The Penzance Musical &#8211; 3The Roommate &#8211; 3Wicked &#8211; 3Eureka Day &#8211; 2Good Night, and Good Luck &#8211; 2Hadestown &#8211; 2Hamilton &#8211; [&#8230;]\n\n[&#8230;] Favorite Long-Running ShowWicked [&#8230;]\n\n[&#8230;] book by Joseph Stein (Fiddler on the Roof) and music and lyrics by the legendary Stephen Schwartz (Wicked), this show is a hidden treasure, bursting with emotion, humor, and the kind of storytelling that [&#8230;]",
  "isFullReview": false,
  "dtliExcerpt": "\"'Wicked's' at its cleverest with the girl stuff; the streamlining of Maguire’s story – reducing a totalitarian allegory to an animal-rights flap – weakens the narrative logic. Catchy Stephen Schwartz songs compensate for a dreary opening number, but it’s the 'Wicked' witches who really make magic.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "sources": [
    "show-score-playwright"
  ]
}