{
  "showId": "wicked-2003",
  "outletId": "upi",
  "outlet": "UPI (Fred Topel)",
  "criticName": "Fred Topel",
  "url": "https://www.upi.com/Entertainment_News/Movies/2025/11/18/Wicked-For-Good-movie-review/5891763404911/",
  "playbillVerdictUrl": "https://www.upi.com/Entertainment_News/Movies/2025/11/18/Wicked-For-Good-movie-review/5891763404911/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "LOS ANGELES, Nov. 18 (UPI) -- Wicked: For Good, in theaters Friday, covers the second act of the stage musical Wicked, but it feels like a true sequel to the first film released last year. Like The Empire Strikes Back or Back to the Future Part II, the new movie develops and complicates the story's lore and characters. For Good opens \"12 tide turns\" later in Oz, with the Yellow Brick Road under construction. Elphaba (Cynthia Erivo) is trying to expose the Wizard (Jeff Goldblum) as a fraud, while Glinda (Arianna Grande) has become a figurehead for the Wizard and Madame Morrible (Michelle Yeoh). As the world is reintroduced, the film's score includes callbacks to songs \"The Wizard and I\" and \"Popular.\" However, both those songs are moot now that Elphaba knows the Wizard has no magic and Glinda is complicit in branding her the Wicked Witch. Glinda has been corrupted by the empty adulation of the masses, who will believe anything that validates their fear, no matter how absurd. Meanwhile, Elphaba's sister, Nessarose (Marissa Bode), has become the governor of Oz. She is pressured to sign an animal travel ban and goes further to include Munchkins, preventing Boq (Ethan Slater) from leaving the area. Based on the Gregory Maguire novel, the Wicked movies include policies that appeared in that book long before the United States enacted its real-life travel restrictions. Nessarose also feels abandoned by Elphaba, who could not attend their father's funeral. One interesting aspect of Nessarose's bitterness is how she says she wants to return to the way she felt at Shiz University with Boq and Elphaba. However, she refuses to acknowledge the events and decisions that irrevocably changed that paradigm. Nessarose blames Elphaba for leaving, but doesn't recognize her own complicity in Shiz and Oz betraying Elphaba. Likewise, she resents Boq for wanting to leave but never considers how she's become somebody who pushes Boq away. Elphaba returns and actually uses her magic to make Nessarose fly, which superficially makes her happy. But of course, there's no magic that can fix the issues Nessarose refuses to face. The dynamic becomes a microcosm for all of Oz, and of course the real world, when Nessarose keeps blaming others for her ploys backfiring. Nessarose casts a spell on Boq that fails, yet still blames Elphaba for it. The Wizard also asks Elphaba to start again, in keeping with everyone else who wants to start over without addressing how they've wronged Elphaba. Elphaba makes a deal to forgive if the Wizard promises to free the flying monkeys and other animals of Oz. Of course, like in real politics, people often don't keep their promises. The Wizard does astutely point out that even if he made a full confession about Elphaba's mistreatment, the people of Oz wouldn't believe it. Even the Wizard of Oz can't unring that bell. He calls it history, when the public keeps believing what they were told. The subtext is how people will refuse to believe they were ever fooled, and would rather keep believing the lies than admit they were ever wrong. In addition to the collective propaganda, characters in Oz are shown to make harmful assumptions. Once they have assumed, it takes massive tragedy and violence to make them question their own accountability. Even when problems are addressed, the solutions only create new problems. Real change is no easy answer, rather, the beginning of a process. It may not be as cathartic as learning to fly, but it's more empowering in the long run. Both Empire and Back to the Future knew they had a third movie in which to resolve things. Wicked: For Good ends the story in this movie, making it stand out as a conclusive second chapter. Like those and other sequels, Wicked: For Good takes a somewhat darker approach to the world of Oz. Much more of it takes place in dark forests and castles, reflecting the corruption of the land first introduced in the L. Frank Baum novel and its 1939 film adaptation. Wicked: For Good incorporates the Dorothy storyline subtly, usually picking up a scene just after Dorothy exits. Fortunately, The Wizard of Oz is so popular that most viewers will know what happened without it playing out on screen. For example, Dorothy just began walking the Yellow Brick Road or Elphaba just tried to take back her sister's shoes from Dorothy. One of Wicked: For Good's new original songs is \"No Place Like Home,\" which shows how Dorothy's catchphrase originated with Elphaba, and recontextualizes it as encouraging the persecuted to fight for their home. Since Elphaba learned to fly at the end of Wicked, there is a lot more CGI in Wicked: For Good. There are fewer physical sets and certainly no equivalent of the elaborate library dance number in the first movie. However, one climactic shot showing Elphaba and Glinda on opposite sides of a door is very theatrical and powerful. Indeed, Wicked: For Good is not just a more complicated story, but a more intimate and personal one. In making Act 2 a standalone film, it's not just the conclusion but an exponential expansion of the themes of Wicked. Fred Topel, who attended film school at Ithaca College, is a UPI entertainment writer based in Los Angeles. He has been a professional film critic since 1999, a Rotten Tomatoes critic since 2001, and a member of the Television Critics Association since 2012 and the Critics Choice Association since 2023. Read more of his work in Entertainment.",
  "isFullReview": true,
  "textWordCount": 921,
  "archivePath": "data/archives/reviews/wicked-2003/upi--fred-topel_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:10:18.210Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 921,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-05T20:52:16.356Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a review of the Wicked movie sequel, not the Broadway musical production; openai: The text is a review of the film 'Wicked: For Good,' not a Broadway theater production.; gemini: This is a review of the Wicked movie, not the Broadway show.; kimi: This text is a review of the film 'Wicked: For Good' (the movie sequel), not the Broadway stage production. It repeatedly refers to 'the new movie,' 'film's score,' and compares it to other films like 'The Empire Strikes Back.'",
  "promptVersion": "5.2.0"
}
