{
  "showId": "wicked-2003",
  "outletId": "usatoday",
  "outlet": "USA Today",
  "criticName": "Brian Truitt",
  "url": "https://www.usatoday.com/story/entertainment/movies/2025/11/18/wicked-for-good-movie-review/87258174007/",
  "playbillVerdictUrl": "https://www.usatoday.com/story/entertainment/movies/2025/11/18/wicked-for-good-movie-review/87258174007/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "MOVIESMovie reviewsAdd Topic'Wicked: For Good' brings back Cynthia Erivo, Ariana Grande at their witchy best – Review'Wicked: For Good' is a tighter, better sequel and brings more 'Wizard of Oz' goodness. Brian TruittUSA TODAYNov. 18, 2025Updated Nov. 21, 2025, 5:53 p.m. ETHear this story\n \nDeeperDiveBETADeeperDive is a GenAI Answer Engine built for trusted publishers.\nIt delivers clear answers and real-time content based on what people are reading now — showcasing various stories from the USA TODAY Network that highlight not just what happened, but why it matters.\nThis is currently a BETA being quality assessed by human beings. Mistakes may occur. Please reference surfaced articles to validate AI summaryExplore DeeperDiveAsk USA TODAY anything\n \n \n \n \n \n \n\nWhat new songs are in 'Wicked: For Good'?\n\nHow does 'Wicked: For Good' address social issues?\n\nIs Ariana Grande featured in both 'Wicked' and 'SNL'?\n\nThe magical movie sequel \"Wicked: For Good\" arrives in theaters Friday, Nov. 21.Cynthia Erivo and Ariana Grande reprise their roles as \"wicked\" witch Elphaba and her popular bestie Glinda.Elphaba and Glinda get two new songs in the film: \"No Place Like Home\" and \"The Girl in the Bubble.\"How do you follow a pop-culture extravaganza like “Wicked”? With a sequel that emphasizes feelings rather than showstoppers, a darker yet crowd-pleasing narrative, and more “Wizard of Oz” references than you can drop a house on.\n\nDirected again with much colorful pomp and magical circumstance by Jon M. Chu, “Wicked: For Good” (★★★½ out of four; rated PG; in theaters Nov. 21) is a stronger and tighter movie than its Oscar-nominated predecessor without losing any of its splendor. Comprising (and expanding) the second act of the Broadway musical, the film also brings back Cynthia Erivo and Ariana Grande better than before. They reprise their roles as “wicked” witch Elphaba and her popular bestie Glinda with new verve, and these frenemies’ relationship reveals enjoyably fresh depth in an unexpectedly relevant fantasy movie about standing up for what’s right.\n\nThe first “Wicked” closed with Elphaba defying gravity and the Wizard of Oz (Jeff Goldblum), choosing to fight for the cause of oppressed animals instead of going along with a somewhat fascist regime. \"For Good\" catches up with Elphaba and Glinda some time later after the two Shiz University classmates and their friends have gone in very different directions.\n\nElphaba has become sort of the Batman of Oz, swooping in on her broomstick and causing chaos as the Wizard’s Yellow Brick Road project nears completion. Meanwhile, Glinda has become the literal poster child for goodness, a part of the propaganda machine against Elphaba honchoed by the Wizard and the dastardly Madame Morrible (Michelle Yeoh).\n\nHowever, Elphaba and Glinda still foster a closeness amid an environment rife with fear and hate: Elphaba rages against the system but also cares for her BFF, and Glinda holds out hope she can persuade Elphaba to work with the Wizard rather than against him. There are other issues at hand, too. Glinda is about to be married to Prince Fiyero (Jonathan Bailey), captain of the Wizard’s military force tasked with capturing Elphaba, though he's got a place in his heart for the emerald-skinned fugitive. And Elphaba’s sister Nessarose (Marissa Bode) is the governor of Munchkinland, but a more jaded soul now – even when it comes to her beloved Boq (Ethan Slater).\n\nWhether you’re a fan of the “Wicked” movie or a musical theater nerd who lives for the stage show, there’s plenty to be obsessulated about. And “For Good” is definitely for the old-school “Wizard of Oz” lovers, pretty much interweaving the Technicolor plot of that classic film into this one. Not only do we get to see the Kansas girl in the gingham dress (well, glimpses at least) and a Cowardly Lion (voiced by Colman Domingo), the other members of Dorothy’s crew receive origin stories.\n\nThe first “Wicked” had more of the big song-and-dance numbers than the sequel, which leans into intimate balladry and poignant duets. (Instead of helping a scene, a few times the music actually gets in the way.) Erivo gets the powerhouse song again this time: While “Defying Gravity” was Elphaba embracing her freedom, “No Good Deed” finds her seizing a heel turn.\n\nThere are two new original songs written by OG \"Wicked\" composer Stephen Schwartz for the sequel as well, both solos for the leads. “The Girl in the Bubble” marks a key point for Glinda as she needs to choose between righteousness and popularity, but the better tune is “No Place Like Home.” Dorothy’s famous words are given new gravitas with Elphaba singing about the Oz she loves that doesn’t love her back.\n\nLike the first “Wicked,” Erivo and Grande are the belting virtuosos fueling this musical’s emotional engine. Grande benefits from Glinda having a bigger role this time, with thematic aspects of her backstory driving an impressive character arc. And Erivo is again just stunning as Elphaba, a character who runs the gamut of emotions yet always remains strongly relatable.\n\nBoosted by those two, “For Good” is all that and a pack of flying monkeys. (Yes, they're back!) Plus an insidiously wacky Goldblum, a PG romantic encounter, a teensy bit of body horror, and a pair of very in-demand shoes. Even with an overcomplicated ending and a couple of character development nitpicks, you couldn't ask for a more \"Wicked\" closer.\n\n“Wicked: For Good,” is two hours and 17 minutes long. That’s shorter than the first “Wicked” movie, which clocks in at a hefty two hours and 41 minutes.\n\nKeep on reading'Shameless': 'Melania' movie reviews, Rotten Tomatoes score are hereThe first slate of movie reviews for \"Melania\" are less than favorable, with most critics unimpressed with the Brett Ratner documentary.USA TODAYUndoHeidi Klum 2026 Grammy dress leaves nothing to imagination: See photosHeidi Klum wore what appeared to be a latex mold replica of her body on the 2026 Grammys red carpet, joining Chappell Roan in the naked dress trend.USA TODAYUndoMelania Trump documentary shocks at the box officeCritics hated it, but director Brett Ratner's first lady documentary \"Melania\" Trump outperformed box-office expectations with a $7 million opening.USA TODAYUndoFormer Prince Andrew on all fours over woman in new Epstein photosIn the latest photos released from the U.S. DOJ's Epstein investigation, King Charles' brother Andrew is seen crouching over a woman on the floor.USA TODAYUndo\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n \n '\n '\n '\n\n \n \n \n \n \n '\n '\n '\n\n'Difficult to even process': Reality show star accused of raping childDetectives later uncovered evidence that Tony McCollister and Erica Grove drugged and sexually assaulted a girl, who was less than 6 years old.USA TODAYUndoTexas Introduces New Benefit for \"Senior Drivers\"Do not pay your next car insurance bill until you read thisAuto Savings | SponsoredSponsoredLearn MoreUndoWho Charges The Least For Auto Insurance In Texas? (Check Zip Code)New Insurance Data Shows Which Zip Codes Overpay The MostOTTO Insurance | SponsoredSponsoredLearn MoreUndoGrammys red carpet – Olivia Dean, Chappell Roan, Bad Bunny, moreThe hottest names in music hit the red carpet at the Grammy Awards Feb. 1. These were the night's most eye-catching looks.USA TODAYUndoSnoop Dogg's 10-month old granddaughter has diedSnoop Dogg shared love for his daughter Cori Broadus, who recently announced the death of her 10-month old baby, born severely premature.USA TODAYUndoI fear Bad Bunny's halftime show. I choose the safety of Kid Rock.Like most Americans who watch Fox News, I am terrified about this weekend's Super Bowl halftime show featuring Bad Bunny.USA TODAYUndoMichelle Obama doc surges on Netflix amid 'Melania' movieUSA TODAYUndoUS Obesity Doctors: Take a Sip Every Night, See What Happens in a WeekTrending News | SponsoredSponsoredUndoThree San Antonio Banks Are Paying Record High Interest Rates - See the ListSavingsPro | SponsoredSponsoredUndoTrump on promise of $2,000 checks: 'I did do that?'President Trump appeared to forget about the $2,000 tariff dividend checks he had been promising for months during a New York Times interview.USA TODAYUndoMartha Stewart breaks political silence after urging from granddaughterMartha Stewart is speaking out against the Trump administration's ongoing deportation campaign after urging from her granddaughter, Jude.USA TODAYUndo\n\n \n \n\n \n \n \n \n \n \n s.amazon-adsystem.com is blocked\n \n \n This page has been blocked by an extension",
  "isFullReview": true,
  "textWordCount": 1331,
  "archivePath": "data/archives/reviews/wicked-2003/usatoday--brian-truitt_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:11:05.032Z",
  "originalScore": "3/3 stars",
  "originalScoreNormalized": 100,
  "scoreSource": "unicode-stars",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 1331,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-06T09:44:46.089Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a movie review for 'Wicked: For Good' film sequel, not a Broadway theater review; openai: The text is about the movie 'Wicked: For Good', not a Broadway theater production.; kimi: This is a film review of the movie 'Wicked: For Good' (referencing theaters, director Jon M. Chu, and cinematic elements), not a review of the Broadway musical production.",
  "promptVersion": "5.2.0"
}
