{
  "showId": "wicked-2003",
  "outletId": "wbur",
  "outlet": "WBUR (Sean Burns)",
  "criticName": "Sean Burns",
  "url": "https://www.wbur.org/news/2025/11/18/wicked-for-good-film-review",
  "playbillVerdictUrl": "https://www.wbur.org/news/2025/11/18/wicked-for-good-film-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "It’s not easy being green. When we last saw Cynthia Erivo’s ostracized outcast Elphaba, she’d discovered that Jeff Goldblum’s Wizard of Oz wasn’t so wonderful after all, and that the man behind the curtain was actually a carny huckster passing himself off as great and powerful to a land of munchkins and rubes. Donning her trademark pointy hat, Elphaba belted out the unkillable earworm “Defying Gravity” before leaving her best friend Glinda (Ariana Grande) behind, flying away on a broom to become the Wicked Witch of the West. Director Jon M. Chu’s 2024 blockbuster “Wicked” ended there, midway through Stephen Schwartz and Winnie Holtzman’s long-running musical adaptation of Gregory Maguire’s grim 1995 novel. With 160 minutes of setup and promises, “Wicked” had a “Part I” tucked discreetly in the right-hand corner of the opening title card that was notably missing from the film’s advertising campaign. This was a lot of audiences’ first clue that they were only about to see Act 1 of the musical. Half a movie at full price, “Wicked” felt both distended and abridged, top-heavy with lovestruck teen soap operatics at Shiz University — which I still keep calling Hogwarts in my head because it’s such a shameless knockoff — resulting in a movie experience that ended just as it was getting started. There was no valid artistic reason to split the show into two films. I can only think of one possible motivation. It’s also green. One year and $757 million at the box office later, “Wicked: For Good” arrives as 138 minutes of descending action and denouements, leaving one with the feeling of having wandered into the theater late. Which, in a way, you have. The breathless tumble of incident is paced very much like the second act of a Broadway musical, hurtling along trying to cram in a few more tunes and wrap things up so we can all go back to the hotel. Any fan of the show “Wicked” will tell you that the best songs are frontloaded, so the second film contains nothing as catchy as “Popular,” “Dancing Through Life” or the still-stuck-in-my-head “Defying Gravity.” What it does have is plot. Lots of it. With the Wicked Witch now an outlaw terrorist sabotaging construction of the yellow brick road — which is made with animal slave labor — Grande’s Glinda becomes the chipper spokeswoman for the Wizard’s autocratic regime, another of those blonde fascists we’ve gotten too used to seeing on TV. The parallels to current events are hardly subtle, and I must admit I had a good chortle at the signing of the Munchkin Travel Ban. “Wicked: For Good” is a lesson in anti-totalitarianism for toddlers, which might have been funny 15 years ago but seems sadly necessary now. Indeed, the most chillingly insightful moment is when Goldblum’s Wizard advises that unmasking him as a fraud will accomplish nothing. People are going to believe whatever they want, regardless of facts. The only way to win is by giving them a story they want to believe in more. The second half of “Wicked: For Good” runs concurrently with the events of “The Wizard of Oz.” It is a source of both amusement and annoyance how the film contorts what we’ve been watching in order to fit into the classic tale going on in the background, supplying unexpected and sometimes seriously strained origin stories for our old friends the Scarecrow, the Tin Man and the Cowardly Lion. This requires a sudden heel turn for Elphaba’s sister Nessarose (Marissa Bode) so we won’t feel too sad when a house from Kansas falls on her head. My favorite part of all this business is how nobody seems to like Dorothy very much. Elphaba refers to her as a “mulish farmgirl,” and even Glinda grows exasperated with how she’s always getting herself into another jam. (Dorothy’s face is kept off camera, like the daughter in “If I Had Legs I’d Kick You.”) Chu is one of the few directors of contemporary musicals who knows how to stage a number so that the camera is a participant and not just a recording device. Glinda gets a late-movie song that makes terrific use of mirrors and digital trickery, with the visuals thematically commenting on the lyrics. (Too bad the tune itself is so forgettable.) Yet Chu remains frustratingly attached to a low-contrast, soft pastel aesthetic that makes everything look faded, fuzzy and fake. It’s especially egregious whenever he’s alluding to scenes from “The Wizard of Oz,” one of the crispest and most vibrant of all Technicolor films. Grande was the best thing about the first “Wicked,” delivering a dynamite comic turn as a deeply shallow young girl slowly beginning to realize the extent of her own awfulness. She doesn’t get to be very funny in this one, and that’s another problem with the bifurcated structure. The arc of her performance was interrupted by a year, so we don’t get to feel Glinda’s full transformation. When “Wicked: For Good” was over, I didn’t feel like I had seen a movie. There’s no rising and falling action. It doesn’t have a beginning, middle and an end. It’s all falling, all end. Not to mention that splitting the show in half means characters don’t get reintroductions and important story points aren’t reiterated the way they would be in conventional sequels. We’re left muddling things together on memories from last Thanksgiving. I suppose I should have watched the first film again in preparation for this review, but the point is I shouldn’t have had to. There’s a reason Broadway intermissions aren’t a year long. “Wicked: For Good” opens in theaters on Thursday, Nov. 20. Sean Burns is a film critic for WBUR.",
  "isFullReview": true,
  "textWordCount": 950,
  "archivePath": "data/archives/reviews/wicked-2003/wbur--sean-burns_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:11:53.055Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 950,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-06T09:45:19.069Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The text is a review of the film adaptation of 'Wicked', not the current Broadway production.; gemini: This is a review of the movie 'Wicked: For Good', not the Broadway show 'Wicked'.; kimi: This is a film review of the movie 'Wicked: For Good' (2024), not a review of the Broadway stage production. The text explicitly discusses cinematic elements (director Jon M. Chu, camera work, movie pacing, theatrical release) and compares the film adaptation to the Broadway source material rather than evaluating a live theatrical performance.",
  "promptVersion": "5.2.0"
}
