{
  "showId": "redwood",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2025/02/13/redwood-idina-menzel-defies-gravity-again-in-new-musical/",
  "publishDate": "2025-02-13T21:58:09",
  "fullText": "Raise your hands, please. How many of you had Idina Menzel climbing a giant tree on your Broadway bucket list?\n\nBut that’s exactly what you get with Redwood, the new musical co-conceived by Menzel and Tina Landau about a mother who deals with the grief of losing her 23-year-old son to an overdose by climbing one of those majestic trees. If that sounds more like a Hallmark Hall of Fame drama than material ripe for musicalization, you’re not far off, since that’s exactly how this show, written and directed by Landau, comes across. It’s clearly a heartfelt effort, one that seems to be a passion project for its star, who’s also credited with “additional contributions.” But the show never reaches the heights to which it aspires, except of the vertical kind.\n\nThat’s because Menzel, playing Jesse, the owner of an art gallery specializing in female artists (she makes sure they receive “gender parity pay”), actually does some serious climbing on the massive representation of a tree that dominates the otherwise bare set. So do a terrific Michael Park and Khaila Wilcoxon, as Finn and Becca, the redwood researchers whom Jesse randomly meets in the forest. It’s an impressive showcase of the performers’ physical daring, especially when Menzel manages to sing while flinging herself on a harness like a giddy tree sprite. One hopes that the actors are being well compensated for the physical risks and that the production is keeping up with its insurance payments.\n\nLest you think that there’s only one tree in that forest, which Jesse inexplicably names Stella, rest assured that there’s a multitude of them, conveyed via Hana S. Kim’s gorgeous projections, which extend to the sides of the auditorium and make you feel like you’re in one of those immersive art exhibitions. The overall effect is undeniably visually stunning.\n\nIf you’re wondering why I’m concentrating so much on the production design, that’s because the show itself proves underwhelming. Landau’s book feels predictable in every respect, from its flashbacks in which Jesse and her wife, Mel (De’Adre Aziza), interact with their son, Spencer (Zachary Noah Piser), who aspires to be a rap singer, to Jesse overcoming her feeling of responsibility for her son’s death by communing with nature. Literally, in this case, when she spends several nights riskily sleeping on a tree platform perched high in the sky.\n\nTo pad out the running time, which already feels long at nearly two intermissionless hours, there are subplots involving Finn’s troubled relationship with his own young son (also played by Piser) and, more annoyingly, Becca’s overt hostility toward Jesse, which manifests itself in constant bitching about how much Finn is accommodating her desire to join them in their climbs. The latter is particularly a shame, since the shaven-headed Wilcoxon, fresh from Six, is such a charismatic performer that it feels like a waste that she’s saddled with such an annoying character.\n\nThe dialogue isn’t much better. It’s filled with lines like Jesse insisting, “I don’t want a pity climb!” when it’s not trafficking in cliched speeches commenting on the symbolism of the tree’s roots. (They’re shallow, but they intertwine with those of all the other trees around it, finding strength in their bonds. Get it?) And you’re completely taken out of the story when Becca refers to Jesse as a “Disney princess,” even if the star’s fans ate up the reference with appreciative laughter.\n\nRedwood might have been more effective with a powerful score, but the songs, composed by Kate Diaz and featuring lyrics by Diaz and Landau, all have a similar power-ballad sheen that quickly proves repetitious and unmemorable. That’s not to say that Menzel doesn’t sing the hell out of them, which she does. But her powerhouse vocals can only do so much with numbers that aren’t exactly “Defying Gravity” or anything from Rent, in which she appeared in the same theater nearly three decades earlier. The performer sings and acts her heart out, but you still leave the theater humming the projections.\n\nRedwood opened February 13, 2025 at the Nederlander Theatre. Tickets and information: redwoodmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
