{
  "showId": "mr-saturday-night-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2022/04/27/mr-saturday-night-billy-crystal-musicalized-vehicle-runs-smoothly-enough/",
  "publishDate": "2022-04-27T21:51:28",
  "fullText": "If you like Billy Crystal as well as a Mount Everest of one-liners, you’ll love Mr. Saturday Night. It’s the new tuner run up from the comedian’s 1992 hit movie by the film’s screenwriters Lowell Ganz, Babaloo Mandell and Crystal himself, with Jason Robert Brown adding music and Amanda Green adding lyrics.\n\nIf you like Billy Crystal—he’s tremendously hard not to like—but aren’t so certain about one-liners fired at you non-stop, you might have trouble with Mr. Saturday Night. It’s as if the authors think the only way to communicate in life is to top everything uttered with a gag. If every one of the gags landed, you might be more forgiving. Every one doesn’t, and remember that the word “gag” has more than one meaning.\n\nCrystal—in a role he created on “A Comic’s Line,” the 1984 HBO special—and a crowd of seven deft players are retelling the tale of Buddy Young, Jr. who had his own top-10 Saturday Night boobtube variety show in the 1950s. A hot, also hot-tempered, fellow then, he’s fallen on hard times by 1994, when the action, with many flashbacks, begins.\n\nReduced to playing nursing homes and the like on afternoons, he’s abiding a home life with devoted but worried wife Elaine (Randy Graff) and angry daughter Susan (Shoshana Bean). He’s estranged from brother and longtime manager Stan (David Paymer nicely repeating the role that earned him an Oscar nomination).\n\nBuddy is propelled from his doldrums when he sees himself declared dead in one of those Oscar memorial segments. Making an understanding fuss, he’s promptly interviewed on the Today show, waxes one-liner-heavy and, as a result, is wooed by a talent agency.\n\nIn comes Annie Wells (Chasten Harmon), a young agent who knows less about comedy than you’d think an agent should. Though initially mocked by Buddy, she decides to believe in his future. Predictably, she runs into trouble when joke-mongering Buddy screws up a barrage of chances. That’s until director Larry Myerson, who’s admired Buddy from boyhood, approaches his idol with a movie role all but tailored for him.\n\nHere’s where Mr. Saturday Night, directed by the forever clever John Rando, takes on important meaning. That’s to say, the heated Buddy Young family doings start feeling extraneous when Ganz, Mandel, and Crystal get to the heart of their piece; looking unflinchingly at a man who’s ruined his life by having made it all about him.\n\nBut they have done a bit of a flinch, as if confident about their jokes but uncertain about going dramatic. To keep the one-liners pop-pop-popping so Crystal is assured his laughs (even Paymer’s Stan and Graff’s Elaine have their share), the bookwriters stall the skinny on why Buddy lost his “Coleman Comedy Hour.” Finally letting the audience in on it, they pivot to their protagonist’s little-King-Lear-like behavior.\n\nAnd is Crystal ready for the challenge! Always a strong actor but perhaps underrated due to his grand comic flair (get him back to the Oscars, please), he grabs the script’s meat as if it’s prime rib steak. He nails the movie audition, although the authors can’t resist a little twist before the foreseeable result.\n\nTo underline Crystal’s powers the colorful Brown and Green have written “Any Man But Me.” Though more than vocally acceptable throughout. the show’s star (no understudy listed) brings this eleven o’clock number off with expanding fortitude. He delivers it as if this final quarter of the musical is the one he’s truly pleased to be headlining. Is it going too far to suggest Crystal might someday make a terrific Uncle Vanya?\n\nIt would be unfair to suggest that Mr. Saturday Night is any less than amiable start to finish, not only for a focal figure who has the audience eating out of his hand but for the other seven—and for Ellenore Scott’s jaunty choreography. Paymer has Stan well in hand. Graff, always marvelous, is present much of the time as a likable foil but shows her strength in the “Until Now” duet with Crystal and in the mock-sultry “Tahiti.” Though Bean is given ditties as if she’s there and so ought to have a song or two, she makes them count. Harmon shows off in the Buddy Young Jr.-taunting “What If I Said?”\n\nJordan Gelber, Brian Gonzales, and Mylinda Hull take on any number of comic-relief parts as well as the lively “We’re Live” opener and “What’s Playin’ at the Movies?” where they get to sport Paul Tazewell and Sky Switser’s movie-house refreshment counter outfits (hotdog, et cetera). Also enlivening the goings-on are the easily workable Scott Pask sets, Kenneth Posner lights, Kai Harada sound, and Jeff Suggs videos and projections.\n\nIncidentally, along with the one-liners, bookwriters Crystal, Ganz and Mandel often indulge in a current trend that stretches the word “current” into something threateningly never-ending. When not immediately locating a chuckle or guffaw, they drop in a “fuck” or “shit.” Maybe the piddling ploy is such a handy fall back because enough patrons go for it.\n\nFewer of those would be a help, but please no less of Crystal. He’s so assured—in the perhaps forgotten manner of George Burns and George Jessel—he compensates sufficiently to make himself Mr. Every Night of the Week.\n\nMr. Saturday Night opened April 27, 2022 at the Nederlander Theatre. Tickets and information: mrsaturdaynightonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-roundup"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2022/04/27/mr-saturday-night-billy-crystal-musicalized-vehicle-runs-smoothly-enough/",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "To underline Crystal's powers the colorful Brown and Green have written \"Any Man But Me.\" Though more than vocally acceptable throughout. the show's star (no understudy listed) brings this eleven o'clock number off with expanding fortitude. He delivers it as if this final quarter of the musical is the one he's truly pleased to be headlining. Is it going too far to suggest Crystal might someday make a terrific Uncle Vanya? It would be unfair to suggest that Mr",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-MR-SATURDAY-NIGHT-Opens-on-Broadway-Starring-Billy-Crystal-Updating-Live-20220427"
}
