{
  "showId": "mr-saturday-night-2022",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/mr-saturday-night-is-a-breezy-sunday-stroll-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/mr-saturday-night-is-a-breezy-sunday-stroll-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "He reunites with original screenwriters Lowell Ganz and Babaloo Mandel for the book, supplemented with music by Jason Robert Brown and lyrics by Amanda Green. The combinations are as safe and sweet as expected, yet never cloying nor sentimental. That it avoids such traps is a major win, considering the methodical plot, which includes a long-suffering wife (played with great charisma by the eternally young Randy Graff) and their somewhat estranged daughter (Shoshana Bean,",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-MR-SATURDAY-NIGHT-Opens-on-Broadway-Starring-Billy-Crystal-Updating-Live-20220427",
  "fullText": "Billy Crystal | Photo: Matthew Murphy\n\nThere are a few scenes in Mr. Saturday Night, the new musical which opened tonight at the Nederlander Theatre, where the titular star, played by Billy Crystal, performs for sleepy retirement homes. You might find that the projections behind him, depicting throngs of patrons 65-and-up, are not too different from your surrounding audience members. It shouldn’t be a surprise: Crystal is a decades-spanning comedy legend, here recreating a role first created in 1984, and immortalized in a 1992 film of the same name. What is surprising, given that no one really asked for this, and considering the general soullessness of such reboots, is how perfectly charming and entertaining the work is.\n\nMuch of that comes down to Crystal’s incredible ease with the material, and with the audience. Playing past-his-prime comedian Buddy Young Jr. as a lovable prick whose accidental inclusion in an Emmy’s “In Memoriam” segment urges him to relaunch his career, Crystal gets plenty of chances to shrink the Nederlander’s massive stage — Scott Pask did the evocative-enough set, Jeff Sugg the aforementioned projections — into an intimate comedy club: just him and the audience. A nine-time Oscars host, Crystal’s mastery of comedy doesn’t boil down to impeccable timing or perfect delivery; the man seems to be comedy incarnate.\n\nHe reunites with original screenwriters Lowell Ganz and Babaloo Mandel for the book, supplemented with music by Jason Robert Brown and lyrics by Amanda Green. The combinations are as safe and sweet as expected, yet never cloying nor sentimental. That it avoids such traps is a major win, considering the methodical plot, which includes a long-suffering wife (played with great charisma by the eternally young Randy Graff) and their somewhat estranged daughter (Shoshana Bean, terrific as always), who has recently won her 90-day chip following a long battle with addiction and now struggles to re-enter her workaholic father’s life.\n\nDavid Paymer delightfully reprises his Oscar-nominated role as Young’s brother, and Chasten Harmon plays his scrappy new agent. Jordan Gelber, Brian Gonzales, and Mylinda Hull play an array of supporting characters with dependable success. John Rando successfully directs with the laissez-faire trust in good material he’s learned from years at Encores!\n\nThe simple story and laid-bare character arcs turn out to be a great fit for Brown’s plunky earnestness, and Green’s lyrics are serviceable and likable enough. A master of pastiche, Brown gives Crystal snazzy showbiz numbers (which he knocks out of the park), and the underused Bean gets the closest to vocal explosives the musical offers. (To that end, I understand a featured player can’t “outshine” the lead, but to cast a powerhouse like Shoshana Bean and not have her belt her face off is a misdemeanor, at best.)\n\nThis new musical isn’t perfect; the first act runs far too long, and some plotlines aren’t sufficiently developed. But you’re there for Crystal and he delivers. His singing voice is as full of character as his comic delivery — imagine a male Carol Channing — and the winning team around him makes this Saturday Night a delightful evening out.\n\nMr. Saturday Night is in performance at the Nederlander Theatre on West 41st Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 643,
  "archivePath": "data/archives/reviews/mr-saturday-night-2022/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:22:18.738Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251211123641",
  "archiveOrgUrl": "http://web.archive.org/web/20251211123641/https://www.theatrely.com/post/mr-saturday-night-is-a-breezy-sunday-stroll-review",
  "contentTier": "complete",
  "wordCount": 643,
  "tierReason": "Full review text"
}
