{
  "showId": "mr-saturday-night-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2022/legit/reviews/mr-saturday-night-review-billy-crystal-broadway-1235227471/",
  "publishDate": "April 7, 2022",
  "fullText": "Sometimes being nice has its rewards.\n\nTake Buddy Young Jr., the bitter, self-centered, self-destructive comedian from the 1992 flop film \"Mr. Saturday Night,\" which Billy Crystal starred in, directed and co-wrote based on one of his '80s sketch creations. This sour pickle of an old-school comic as the basis for a musical? Don't make me laugh.\n\nBut a funny thing happened on the way to Broadway. For this new stage adaptation, Crystal and his co-screenwriters Babaloo Mandel and Lowell Ganz have re-envisioned Buddy with warmer tones and softer edges. They've also given him some self-awareness and playfulness, so an audience immediately loves rather than loathes him.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Ryan Murphy's 'Love Story: John F. Kennedy Jr. & Carolyn Bessette' Sets Release Date on FX and Hulu \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Ryan Murphy's 'The Beauty' Is Now Streaming on Hulu\n\nWith Crystal turning on the impish charm and non-stop zingers, that's an easy reach — at least until the backstory kicks in and Buddy is revealed to be a bit of a bastard. By then, though, it's too late. Buddy is near-redeemable enough for audiences to root for him to cross the nice-guy finish line.\n\nDirected by by John Rando, the musical now focuses on Buddy's family as much as his checkered career, which spans from the Borscht Belt to the early days of television to gigs at senior centers. The addition of music, too, adds dimension to the characters, allowing the audience to understand their interior lives without missing a punchline.\n\nThe end result is certainly the funniest show on Broadway in years, if not the most likable. Look for a healthy run, at least with headliner Crystal, who last packed houses with his autobiographical show \"700 Sundays.\" And with composer Jason Robert Brown and lyricist Amanda Green supplying one of the most appealing and disarming scores in some time, what's not to like?\n\nAs one of the songs in the show reminds us, it's all about timing. One could imagine Crystal, Randy Graff (who plays Buddy's supportive wife Elaine) and David Paymer (playing the comic's put-upon brother Stan, a role that earned him an Oscar nomination in the film) really killing it a decade or two earlier, with more assured singing voices and without the audience suspending their disbelief when the trio plays much younger versions of their characters.\n\nStill, it's the kind of show where verisimilitude is not the goal. It knows what it is: A great comic vehicle with a solid-though-unsurprising story — with a little love, if not schmaltz, thrown in for good measure.\n\nWith a core cast of five including a terrific trio of sketch performers — Jordan Gelber, Brian Gonzales and Mylinda Hull, playing a slew of characters — it's clearly not a show about size, scope and production values. It's about the music, the performances and, ultimately, the comedy.\n\nThe Brown/Green score — a new musical color combination that one hopes stays in fashion — is bright, breezy and smart, recalling the type of easy-going scores with which Cy Coleman used to delight audiences. Brown's ability of find a comfortable groove with an underlay of sophistication, and Green's deft lyrics are a perfect match for Crystal's wit and winks.\n\nThe uniformly fine cast plays it for laughs, but they also play it for real. As Buddy's adult daughter Susan, Shoshana Bean is both tough and tender. She also has the best pipes on stage and soars with her two solos, \"There’s a Chance\" and \"Maybe It Starts With Me.\"\n\nChasten Harmon as Buddy's exasperated agent Annie Wells shows she's more than a plot device and definitely more than a straight man. Graff's Elaine loves Buddy, so the audience also loves him through her eyes, even if their marriage made her defer her dreams (as expressed in the charming tune \"Tahiti\").\n\nMeanwhile, the chemistry between the comic and his brother is crystal clear. (As Buddy would joke, \"See what I did there?\") A seasoned veteran actor of grace and intelligence, Paymer once again brings heart and humor to his role and even some rage, which he expresses movingly in \"Broken.\"\n\nBut the show is Crystal's and he's earned it, having lived with the character for decades and skillfully recrafted this 1990s-set homage to a previous era of comedy. It was an era that wasn't always the subtlest, often offended and mostly came from a blinkered boys' club. But Crystal makes us see that even with flawed heroes, there still can be music in the laughs.",
  "isFullReview": true,
  "dtliExcerpt": "Crystal's performance is warmly engaging, and he brings a lived-in authenticity to the role that feels both natural and theatrical.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Crystal's performance is warmly engaging, and he brings a lived-in authenticity to the role that feels both natural and theatrical.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 747,
  "archivePath": "data/archives/reviews/mr-saturday-night-2022/variety--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T09:04:15.430Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "duplicateTextOf": "variety--frank-rizzo.json",
  "wordCount": 747,
  "tierReason": "Full review text"
}