{
  "showId": "six-degrees-of-separation-2017",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Robert Hofler",
  "url": "http://www.thewrap.com/six-degrees-separation-broadway-review-allison-janney-corey-hawkins-get-close/",
  "playbillVerdictUrl": "http://www.thewrap.com/six-degrees-separation-broadway-review-allison-janney-corey-hawkins-get-close/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "The good news on the Broadway revival of 'Six Degrees of Separation' is great news. Twenty-seven years after the debut of John Guare's comedy of manners and mores in Manhattan, 'Six Degrees' retains its place as one of the great American plays of the late 20th century. The revival, which opened Tuesday at the Barrymore Theatre, also is a reminder of a time in the theater when two- and three-hander dramas did not dominate the nonprofit world. True, Lincoln Center Theater, which originally produced the Guare play, is now staging a new American drama, 'Oslo,' with a cast of 18. The cast of 18 in 'Six Degrees' is especially astounding because it is possible to imagine the play with just its three principal characters: Ouisa and Flan Kittredge, the art-dealer couple living on the Upper East Side in 1990, and the young black man Paul, who is the alleged son of Sidney Poitier.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-John-Guares-SIX-DEGREES-OF-SEPARATION-Opens-on-Broadway-Tonight--Updating-Live-20170425",
  "showScoreExcerpt": "“Retains its place as one of the great American plays of the late 20th century…Guare’s insightful portrait of that high society survives even Cullman’s far too brash direction of this revival…Cullman directs ‘Six Degrees’ as a not very sophisticated farce, especially in the play’s first half. Janney and Hickey are diverting; they display razor-sharp timing, but they go for the laughs by stressing the characters’ materialism…The broadness of these performances also undercuts the role of Paul.”\n\nRead more"
}