{
  "showId": "six-degrees-of-separation-2017",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2017/legit/reviews/six-degrees-of-separation-review-1202024736/",
  "publishDate": "April 25, 2017",
  "fullText": "Despite the vitalizing presence of Allison Janney in director Trip Cullman's elegant revival, \"Six Degrees of Separation\" lacks the comic bite of the original production. In its time, John Guare's 1990 social satire about New York sophisticates who are duped by a young black con man was an amusing embarrassment for the city's various tribes of arty intelligentsia. (The story was based on a true incident.) Today, with social barriers considerably more fluid, the con seems quaint. Were sophisticated New Yorkers ever that gullible?\n\nWhen we meet them, a high-end art dealer named Flan (John Benjamin Hickey, a catch) and his very social wife, Ouisa (the incomparable Janney), are in their swanky Upper East Side apartment, proudly entertaining a rich friend who has gold mines in South Africa. Flan is a bragger. (At his next dinner party he'll be sure to bring up his friend's gold mines.) He's immensely proud of the double-sided Kandinsky painting suspended from the ceiling of their plushly upholstered living room, which scenic designer Mark Wendland has hung with rich red draperies. Besides being eye-catching, the colorful canvas could be warning us to beware of two-faced people.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nGuare has a great ear for inane small talk, and his conversational dialogue is pitilessly funny. But all this sociable chit-chat comes to a full stop when an African-American youth named Paul (the magnetic Corey Hawkins of \"24: Legacy\") suddenly lands unannounced on their doorstep, dripping blood from a knife wound. Paul says he was mugged and robbed in Central Park, and found his way to their door for help because he's close friends with their kids at Harvard and recognized the building.\n\nYoung, black, well-dressed, personable, articulate, friend of kids, Harvard student, and bleeding — what more could a rich, social, broad-minded New York couple possibly want to justify taking the kid under their wing? To further impress these credulous cosmopolites, Paul reveals that he's the son of Sidney Poitier, which causes the star-struck pair to fall all over themselves offering the lad a bed for the night.\n\nFamous father aside, Ouisa is genuinely taken with Paul, who's far more kind and considerate than her own detached children. (\"Tell us about our children,\" she begs of their fellow student, which speaks sad volumes about this disconnected family.) Hawkins, who plays Dr. Dre in \"Straight Outta Compton,\" is a total charmer who effortlessly inhabits Paul's preppy persona to win Ouisa's approval. There's something truly needy about him, even when it turns out that he's not what he seems to be. The only thing missing from Hawkins' performance is the hint of danger that in the gritty New York of 1990 would have added to Paul's allure.\n\nJanney's wicked, smart delivery is perfect for Guare's witty dialogue. But she's also uncommonly sensitive to Ouisa's desperate need for someone to care for, someone who, unlike her own spoiled brats (who appear in one funny, surreal scene to illustrate what little beasts they are), might actually pay her back with the affection she craves. \"I just loved the kid so much!\" she says, thinking back on her surge of affection when she met Paul.\n\nAlthough it seems incredible that any worldly wise New Yorker would fall for the deception, it makes sound psychological sense that a needy woman like Ouisa would reach out to someone as sympathetic as this sweet, bogus Paul. For all their material possessions, Flan and Ouisa don't have anything of true value in their privileged lives. Despite the priceless art he boldly buys, briefly owns, and quickly sells, Flan admits he's only a picker, a horse trader, a salesman.\n\nPaul doesn't have much of an impact on Flan, but he turns out to be the missing link of human connection for Ouisa, the sixth person in her orbit who sparks her dormant imagination and forces her to reassess her shallow life. Even when he's exposed as a thief and a fraud, Ouisa is quick to defend him. \"I will not turn him into an anecdote!\" she exclaims. But that's exactly what Ouisa, Flan — and Guare — will ultimately make of this tormented young man: an only-in-New-York anecdote on which they will dine out for years to come.",
  "isFullReview": true,
  "dtliExcerpt": "Allison Janney gives a performance of stunning complexity as Ouisa, the Upper East Side matron whose worldview is shaken by an encounter with a charismatic young con man.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Allison Janney gives a performance of stunning complexity as Ouisa, the Upper East Side matron whose worldview is shaken by an encounter with a charismatic young con man.",
  "contentTier": "complete",
  "contentTierReason": "Short text (28 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://variety.com/2017/legit/reviews/six-degrees-of-separation-review-allison-janney-broadway-1202395130/",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "textWordCount": 726,
  "archivePath": "data/archives/reviews/six-degrees-of-separation-2017/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:11:10.201Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (507): Request failed with status code 507"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 726,
  "tierReason": "Full review text"
}