{
  "showId": "the-outsiders-2024",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani Samuel",
  "url": "https://www.broadwaynews.com/the-broadway-review-the-outsiders-a-rival-gang-story-void-of-any-risk/",
  "publishDate": "April 12, 2024",
  "fullText": "Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “The Outsiders.” \n\nRUNDOWNBroadway has seen Shakespeare’s Capulets and Montagues, Arthur Laurents’ Sharks and Jets, and now, in “The Outsiders,” S.E. Hinton’s Greasers and Socs (short for “socialites”). The musical adaptation of the middle-school bookshelf staple uses the familiar antagonist framework found in those other works and treads closely to its original text, but book writers Adam Rapp and Justin Levine take creative (but unfortunately, not comprehensive) liberty to enhance the drama by sketching out all-white Socs and a mixed-race group of Greasers. All of our principal characters are still intact from the novel: the endearing, poetry-spinning protagonist Ponyboy (Brody Grant), his sheepish, ill-fated best friend Johnny (Sky Lakota-Lynch), his dudish brothers Sodapop (Jason Schmidt) and Darrel (Brent Comer). They are broken in some ways, deeply caring in others and wildly attractive. Case in point: A gaggle of young folks at the performance I attended squealed when Schmidt opened his shirt. (This demographic will undeniably be the lifeblood of this musical’s success.) But, scenic designers AMP and Tatiana Kahvegian’s tactile set of crunching dirt, exposed scaffolding and tire towers captures more authentic grit than any of the pugnacious characters do. That’s not to say that these actors lack talent. The production’s strenuous vocal, acting and dance demands are evident, and director Danya Taymor’s tight ensemble works like a well-oiled (well-greased?) machine. \n\n            This post is for paying subscribers only\n            Subscribe now\n            Already have an account? Sign in\n\n      Review — The Outsiders — Adam Rapp — Justin Levine — Jamestown Revival — Jonathan Clay — Zach Chance — Danya Taymor — Rick Kuperman and Jeff Kuperman — AMP — Tatiana Kahvegian — Sarafina Bush — Brian MacDevitt — Cody Spencer — Hana S. Kim — Alberto Alvarado — S.E. Hinton — Brody Grant — Sky Lakota-Lynch — Joshua Boone — Jason Schmidt — Brent Comer — Daryl Tofa\n\n                    Introductory Offer\n\n                $1/month for 3 months\n\n                Subscribe\n\n              Already have an account?\n              Log in",
  "originalScore": null,
  "assignedScore": null,
  "dtliThumb": "Meh",
  "source": "dtli",
  "scrapedAt": "2026-01-23T22:02:31.876Z"
}