{
  "showId": "the-outsiders-2024",
  "outletId": "CHTRIB",
  "outlet": "Chicago Tribune",
  "criticName": "Chris Jones",
  "url": "https://www.chicagotribune.com/2024/04/11/review-in-the-outsiders-on-broadway-what-should-be-ponyboys-story-has-a-grown-up-chill/",
  "publishDate": "2024-04-11",
  "fullText": "Things To Do Theater Review: In &#8216;The Outsiders&#8217; on Broadway, what should be Ponyboy&#8217;s story has a grown-up chill Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X Click to print (Opens in new window) Print Click to email a link to a friend (Opens in new window) Email Jason Schmidt (as Sodapop), Renni Anthony Magee (Steve), Daryl Tofa (Two-Bit), Tilly Evans-Krueger (Ace), Sky Lakota-Lynch (Johnny), Joshua Boone (Dallas) and Brent Comer (Darrel), with Brody Grant (as Ponyboy, center) in &#8220;The Outsiders&#8221; musical at the Jacobs Theatre in New York. (Matthew Murphy) By Chris Jones | cjones5@chicagotribune.com | Chicago Tribune PUBLISHED: April 11, 2024 at 8:00 PM CDT | UPDATED: April 11, 2024 at 9:55 PM CDT Getting your Trinity Audio player ready... NEW YORK — Like Jim Jacobs, who conjured up “Grease” from his 1950s experiences at Chicago’s Taft High School, S.E. Hinton penned “The Outsiders” from watching a rivalry between two rival gangs explode at her own Will Rogers High School in Tulsa, Oklahoma, a decade or so later. A 16-year-old with a keen writer’s eye, Hinton saw the sympathetic, working-class Greasers at one table and the snarky, preppy Socs at another. Her romantic, yearning novel, published in 1967, was an immediate national sensation: Hinton wasn’t just a leader in publishing’s so-called Y.A. category, a case could be made that she built the entire genre while still in her teens. A few years go by. Then a librarian and “Outsiders” fan writes to Francis Ford Coppola and he ends up making a movie of “The Outsiders” with the improbable cast of Emilio Estevez, Matt Dillon, Tom Cruise, Patrick Swayze, Ralph Macchio and Diane Lane. &#8220;The Outsiders&#8221; film, flawed as it was, thus became a kind of proto- Brat Pack experience. So no wonder the book finally has become a Broadway musical, which opened Thursday night with a book credited to Adam Rapp and Justin Levine and with a fresh roots/country score by the Austin, Texas-based Jamestown Revival (Jonathan Clay and Zach Chance) and Levine, who (if that were not enough) also is orchestrator and musical director. This new Broadway musical, originally scheduled for Chicago&#8217;s Goodman Theatre but felled by the pandemic, is not all I had hoped. The show loses its narrative thread in a second act where the requisite narrative tension dissipates instead of intensifying and the show, which lacks the humor of the structurally similar “Newsies,” gets stuck in an overly introspective and melancholic loop. It’s understandable why: the source novel is proudly reflective and ruminative but musicals invariably have to be fueled by action, emotional change and resolvable determination. The bottom line is that you are not led to feel enough for the three orphaned Curtis boys, all trying to survive here in the cruel world after losing their parents in a car crash. The oldest is Darrel (Brent Comer), the nice middle kid is Sodapop (Jason Schmidt), but the heart of Hinton’s story is Ponyboy (Brody Grant), a sensitive soul who incites trouble with the Socs merely by wanting to watch a movie on the Soc’s side of town, the only place he can see Paul Newman in “Cool Hand Luke.” function dfm_stn_player_script_id_wQoDAMss( getS2NApiForPlayer ) { if( typeof window.MNGAuthentication !== 'undefined' ){ const s2nApi = getS2NApiForPlayer( document.querySelector('.k-wQoDAMss') ); s2nApi.float = ! window.MNGAuthentication.isUserSubscriber(); } } From there, Ponyboy makes the mistake of falling for Cherry (Emma Pittman), a Socs girl, with a nasty boyfriend named Bob (Kevin William Paul), and things devolve yet further, resulting in Ponyboy and his sweet friend Johnny Cade (Sky Lakota-Lynch) being set upon by the Socs and them killing one of them, meaning Ponyboy and Johnny have to flee for their lives, following the example of Dallas Winston (Joshua Boone), the toughest but most honorable Greaser of them all. The score, which has the unity of an album rather than the diversity of an ideal theatrical score, has one truly beautiful number called “Great Expectations,” with notes that seem to come straight from the vocally excellent Comer’s gut. That song, with its Dickensian referent, sets up the central character’s hopes and dreams, but the show never again reaches those emotional heights, neither narratively or musically. And whereas “West Side Story,” also the story of two warring teenage gangs, had nuanced Jets and Sharks, “The Outsiders” presents the Socs as cartoonishly villainous, giving the show’s constituent battles very little in the way of surprise. Emma Pittman (as Cherry), Brody Grant (Ponyboy) and cast in \"The Outsiders\" musical at the Jacobs Theatre in New York. (Matthew Murphy) No one in this very committed cast is really credible as a teenager, which clearly was a conscious choice on the part of the director, Danya Tay...",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 55,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:10:34.537Z"
}
