{
  "showId": "the-outsiders-2024",
  "outletId": "EW",
  "outlet": "Entertainment Weekly",
  "criticName": "Emlyn Travis",
  "url": "https://ew.com/the-outsiders-broadway-review/",
  "publishDate": "2024-04-11",
  "fullText": "​ Page Not Found This is not the page you are looking for. We hope you can go about your business by using our menu or search option. By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Accept All Cookies",
  "isFullReview": false,
  "bwwExcerpt": "and the other is just trying not to die while crossing from the wrong side of the tracks. And this sanitization makes the musical feel oddly superficial. It approaches its subjects from the outside. Emlyn Travis, Entertainment Weekly: For many, The Outsiders is a story that not only remains as raw and relatable as when they first read it, but also pushed the very boundaries of young adult fiction with its insightful ruminations on brotherhood, identity, and the cycles of grief and violence. While its musical adaptation may have its squabbles, its heart of gold still remains firmly intact. Grade: B Chris Jones, Chicago Tribune: It also doesn’t help that the young guy’s love interest drops away from the narrative. All in all, and with all due respect to the many capable artists here and the fame of the book, the emotional landscape just has not been shaped to fit the needs of a Broadway musical. “The Outsiders” needed greater expansion of character, a gentler, simpler touch, a better se",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-OUTSIDERS-Opens-On-Broadway-20240411",
  "textStatus": "partial",
  "textWordCount": 59,
  "archivePath": "data/archives/reviews/the-outsiders-2024/ew--emlyn-travis_2026-01-25.html",
  "textFetchedAt": "2026-01-25T05:27:10.891Z",
  "textIssues": [
    "Word count too low: 59 (min: 300)",
    "Show title not found in text"
  ],
  "textQuality": "excerpt",
  "sourceMethod": "bww-roundup",
  "scoreStatus": "TO_BE_CALCULATED",
  "scoreSource": null
}