{
  "showId": "the-outsiders-2024",
  "outletId": "GUARDIAN",
  "outlet": "The Guardian",
  "criticName": null,
  "url": "https://www.theguardian.com/stage/2024/apr/11/the-outsiders-review-broadway-musical",
  "publishDate": "2024-04-11",
  "fullText": "Sorry – we haven’t been able to serve the page you asked for. You may have followed an outdated link, or have mistyped a URL. If you believe this to be an error please report it. The Guardian homepage",
  "isFullReview": false,
  "bwwExcerpt": "needs of a Broadway musical. “The Outsiders” needed greater expansion of character, a gentler, simpler touch, a better sense of authentic teenage angst and a deeper focus on the heart. Adrian Horton, The Guardian: The production is the platonic ideal of a retro classic rebooted for Broadway, broadly appealing to audiences young and old (my showing was split between boomers and kids) but not particularly searing, recognizable but not terribly distinct, sincere and competent yet not resounding. Kobi Kassal, Theatrely: What makes The Outsiders so brilliant is director Danya Taymor at the helm of the ship. Her swift yet intuitive direction is stunning and the team she has surrounded herself with both onstage and behind the curtain is a match made in heaven. Taymor’s ability to hone her storytelling while marrying it with a contemporary theatre gaze is a pure delight on stage, and we should be so lucky to experience whatever she cooks up next. For a story that centers masculinity, brotherho",
  "originalScore": null,
  "assignedScore": 60,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-OUTSIDERS-Opens-On-Broadway-20240411",
  "textStatus": "partial",
  "textWordCount": 39,
  "archivePath": "data/archives/reviews/the-outsiders-2024/guardian--unknown_2026-01-25.html",
  "textFetchedAt": "2026-01-25T05:26:44.486Z",
  "textIssues": [
    "Word count too low: 39 (min: 300)",
    "Show title not found in text"
  ]
}