{
  "showId": "the-outsiders-2024",
  "outletId": "NYTG",
  "outlet": "New York Theatre Guide",
  "criticName": null,
  "url": "https://www.newyorktheatreguide.com/reviews/the-outsiders-broadway-review",
  "publishDate": "2024-04-11",
  "fullText": "'The Outsiders' review — adaptation of the classic novel rumbles with talentRead our review of The Outsiders on Broadway, a new musical adaptation of S. E. Hinton's classic 1967 novel now playing at the Bernard B. Jacobs Theatre.Joe DziemianowiczApril 11, 2024, 00:00The Outsiders, an always earnest and intermittently gripping new musical at the Bernard B. Jacobs Theatre, boasts elements that will make you sit up and take notice. Director Danya Taymor’s energizing staging is one of them, while a choral moment so rousing it takes you by surprise is another. Brody Grant, a Broadway newcomer whose emotion-etched acting and vocals point to a bright star in the making, is another source of bragging rights. Grant does the heavy lifting as Ponyboy Curtis, an orphaned 14-year-old who’s caught in a gang war between the working-class “Greasers” and well-off “Socs” (as in socialites) in 1967 Tulsa, Oklahoma. Can this smart, sensitive teen outrun a dead-end destiny and, to quote the script, “stay gold”? S. E. Hinton’s 1967 novel and Francis Ford Coppola’s 1983 movie version asked the same question. The musical's book writers, Adam Rapp (The Sound Inside) and Justin Levine, stay close to those sources while reshaping some dramatic moments for their adaptation. One is the fate of Ponyboy’s elder pal. The storytelling earns applause for accessibility, but it can get mired in cliches. The score by Jamestown Revival (Jonathan Clay and Zach Chance) and Levine is likewise uneven. Moody folk- and bluegrass-flavored songs fit the setting. “Great Expectations,” Ponyboy’s aspirational solo amplified by other voices, is a highlight, but many songs are too heavy with exposition. Limp lyrics like “the grass is always greener” stick out for the wrong reason. Choreographers Rick and Jeff Kuperman put the show in gymnastic, muscular motion. The climactic gang war surges in such stylized, cinematic fashion that my audience actually cheered. Despite its flaws, The Outsiders is ready to rumble. The Outsiders summary The Outsiders explores class conflict, loyalty, and the search for identity among adolescents. The musical is based on Hinton’s young adult novel that’s a fixture on school reading lists, and Coppola’s film adaptation featuring C. Thomas Howell, Matt Dillon, Patrick Swayze, Ralph Macchio, Rob Lowe, and Diane Lane. Amid the many Greasers and Socs in the story, the focus is on the exceptional Ponyboy, who gets by with his brothers Sodapop (Jason Schmidt) and Darrel (Brent Comer) and besties Johnny (Sky Lakota-Lynch) and Dallas (Joshua Boone). Ponyboy makes an unexpected connection with well-to-do Cherry (Emma Pittman). What to expect at The Outsiders As The Outsiders unfolds, you can’t help but recall the Sharks and Jets from the classic musical West Side Story. But the similarities are actually superficial. Unlike Tony and Maria, romance doesn’t spark between Ponyboy and Cherry – just a warm understanding of what it’s like to be broken. The Outsiders is about brotherhood – whether blood or choice — and protecting it at all costs. The world of The Outsiders is a gritty one, and the Broadway production reflects that. The set (designed by AMP featuring Tatiana Kahvegian) is an abandoned lot strewn with old tires, blocks, and a beat-up car. The space transforms into a home, a drive-in movie, a church, a park with a fountain, a hospital through shifts in lighting and props. Against that backdrop, Taymor’s fine cast delivers. Lakota-Lynch shines as Johnny Cade. As Ponyboy’s big brother, Comer casts a strong presence – one wishes his songs were more varied. What audiences are saying about The Outsiders Prior to opening night, The Outsiders had an overall 90% rating on Show-Score. “See it if you like inspiring, socially relevant dramas with powerful scores and dynamic performance.” Show-Score user Stuontheaisle “The voices sound phenomenal and the show captures everything the book is.” Show-Score user A Sky Full of Stars “Don't see it if uncomfortable with violence (knifing, blood, murder), suicide, and dark themes thrust unceremoniously upon the shoulders of young people.” Show-Score user Girl Friday “The music really didn’t add much. I would have rather seen this story as a play.” - Audience member overheard leaving the Bernard B. Jacobs Theatre Who should see The Outsiders Fans of the novel and the movie will want to know how the work has been translated to the musical theatre stage. Theatregoers who appreciate new faces and talents: Between principals and the ensemble, the production features 10 actors making their Broadway debuts. Followers of Adam Rapp's work should see The Outsiders. He’s a Pulitzer finalist and Tony nominee known for non-musical plays like The Sound Inside and Red Light Winter. The Outsiders shows off his talents in a different medium. Learn more about The Outsiders on Broadway The Outsiders boasts terrific performances and imaginative staging. You’ll want to be inside the Jacobs Theatre to see it. Learn more and get The Outsiders tickets on New York Theatre Guide. The Outsiders is at the Bernard B. Jacobs Theatre. Additional The Outsiders content From page to stage: How bestselling books became Broadway blockbusters This Women's History Month, female theatre artists celebrate a record season Photo credit: The cast of The Outsiders on Broadway. (Photo by Matthew Murphy)Frequently asked questionsWhat is The Outsiders about?Experience a classic story of brotherhood and coming of age as a heartfelt folk musical. Inspired by S. E. Hinton's novel and Francis Ford Coppola's film, this show follows the lives of teenage have-nots whose best hope for survival and acceptance is in their brotherhood.Where is The Outsiders playing?The Outsiders is playing at Bernard B. Jacobs Theatre. The theatre is located at 242 West 45th Street, New York, 10036.How long is The Outsiders?The running time of The Outsiders is 2hr 25min. Incl. 15min intermission.What's the age requirement for The Outsiders?The recommended age for The Outsiders is Ages 10+. Children under 4 years old will not be admitted..How do you book tickets for The Outsiders?Book tickets for The Outsiders on New York Theatre Guide.Who wrote The Outsiders musical?Adam Rapp (book), Jamestown Revival (music and lyrics, composed of Jonathan Clay and Zach Chance), and Justin Levine (book, music, lyrics) wrote The Outsiders. The Broadway musical is based on the 1967 novel by S. E. Hinton.Who directed The Outsiders?Danya Taymor directs The Outsiders musical. The niece of Tony-winning director Julie Taymor, she's known for staging Pass Over on Broadway in 2021.What are the songs in The Outsiders?The songs in The Outsiders musical are by Jonathan Clay and Zach Chance of Jamestown Revival, along with Justin Levine. The tracks include \"Stay Gold,\" \"Tulsa '67,\" “Grease Got a Hold on You,” and \"Great Expectations.\"Is The Outsiders musical the same as the book?The Outsiders musical is similar to the novel and film adaptation, keeping the same characters, plot, and setting. The musical stands apart, however, due to its original score of songs by Jamestown Revival.Is The Outsiders appropriate for kids?The Outsiders on Broadway is recommended for kids 11 and older due to depictions of gang violence and themes including death and neglect. Please note that children 4 and younger are not permitted in Broadway theatres.Is The Outsiders good?Yes — The Outsiders endures as an American classic, and the musical honors that. Broadway audiences get to experience this story of brotherhood, survival, and hope in a whole new way and with moving folk music.Originally published on Apr 11, 202421:00",
  "isFullReview": true,
  "bwwExcerpt": "ng exposition to the audience and sentimental solos that stop the show in its tracks. By act two, the show felt like a mechanical procession of plot progression and teen melodrama. Joe Dziemianowicz, New York Theatre Guide: The score by Jamestown Revival (Jonathan Clay and Zach Chance) and Levine is likewise uneven. Moody folk- and bluegrass-flavored songs fit the setting. “Great Expectations,” Ponyboy’s aspirational solo amplified by other voices, is a highlight, but many songs are too heavy with exposition. Limp lyrics like “the grass is always greener” stick out for the wrong reason. Choreographers Rick and Jeff Kuperman put the show in gymnastic, muscular motion. The climactic gang war surges in such stylized, cinematic fashion that my audience actually cheered. Despite its flaws, The Outsiders is ready to rumble. Brian Scott Lipton, Cititour: While an immediate ticket to this sure-to-be-hit may be hard to come by, don’t let yourself stay an outsider. This show is worth coming into",
  "showScoreExcerpt": "\"adaptation of the classic novel rumbles with talent\"",
  "originalScore": null,
  "assignedScore": 78,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-OUTSIDERS-Opens-On-Broadway-20240411",
  "textStatus": "complete",
  "textWordCount": 1213,
  "archivePath": "data/archives/reviews/the-outsiders-2024/nytg--unknown_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:10:27.760Z",
  "textQuality": "full",
  "sourceMethod": "bww-roundup"
}
