{
  "showId": "the-outsiders-2024",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Kobi",
  "url": "https://www.theatrely.com/post/the-outsiders-finds-greatness-on-broadway-review",
  "publishDate": "April 11, 2024",
  "fullText": "The company of The Outsiders | Photo: Matthew Murphy\n\nWhen I attended a recent performance of The Outsiders at the Jacobs Theatre on Broadway, there was a certain buzz in the air. Something we don’t always see in a Broadway house… a mass of young people eagerly awaiting the start of the show. Not since Beetlejuice or Newsies-mania back in the day have I felt the energy of young audience members rallying around a musical, especially so early in the production’s life.\n\nBut that’s what happens when you have all the right ingredients to deliver what is perhaps the best new musical of this decade. Based on S.E. Hinton’s beloved novel which was adapted by Francis Ford Coppola in 1983 for the big screen, The Outsiders brings us to Tusla, Oklahoma, 1967. 14 year old Ponyboy Curtis (Brody Grant) and his two older brothers Sodapop (Jason Schmidt) and Darrel (Brent Comer) are part of the Greasers, a bonded group of working class teens with their leather jackets and greased hair who come from the east side of town. And then we have the Socs, the west side privileged kids with their new cars and perfect varsity jackets led by Bob (Kevin William Paul) and his sweetheart girlfriend Cherry (Emma Pittman). When Ponyboy’s best friend Johnny Cade (Sky Lakota-Lynch) kills one of the Socs, they find themselves on the run and have to navigate life on their own.\n\nWhat makes The Outsiders so brilliant is director Danya Taymor at the helm of the ship. Her swift yet intuitive direction is stunning and the team she has surrounded herself with both onstage and behind the curtain is a match made in heaven. Taymor’s ability to hone her storytelling while marrying it with a contemporary theatre gaze is a pure delight on stage, and we should be so lucky to experience whatever she cooks up next.\n\nFor a story that centers masculinity, brotherhood, and family, the ensemble cast shines and breathes new life to a property that is so beloved by millions across America. An ardent and impassioned Grant leads the company as Ponyboy who brings the audience along for his story. A smart retooling of the narrative by book writers Adam Rapp with Justin Levine since the show’s previous La Jolla Playhouse run last year, they now center Ponyboy as our shepherd of the story.\n\nIn a gorgeous Broadway debut, songwriting duo Jamestown Revival (Jonathan Clay & Zach Chance) and Tony winner Justin Levine have crafted a score that sonically creates the elemental world of Tulsa on stage. From rustic blues to vintage Americana with a dash of classic musical theatre, this thrilling new score (my favorite I’ve heard in a long time) brings a new sound to Broadway that I hope we get more of soon.\n\nRick and Jeff Kuperman’s impressive and striking choreography aids the narrative and never detracts from the moment at hand. Their much-talked about rumble late in Act II is just as astonishing as it was out in La Jolla and simply must be witnessed in person. When you pair that with intricate scenic design by AMP featuring Tatiana Kahvegian, wonderful lighting by Brian MacDevitt, fitting costume design by Sarfina Bush, and engaging sound design by Cody Spencer, it all fits perfectly.\n\nIn a historical theatrical season with more shows than even the critics can count opening, The Outsiders stands out far and wide—this revelatory new work is sure to be talked about for generations to come. And although it might be the ultimate cliche, S.E. Hinton wrote it best: The Outsiders is theatrical gold, and Ponyboy, you are gonna wanna stay with it.\n\n‍The Outsiders is now in performance at the Bernard B. Jacobs Theatre on West 45th Street in New York City.\n\nHailing from sunny South Florida, Kobi Kassal founded Theatrely (formerly Theatre Talk Boston) while attending Boston University. He is an avid theatre attender and can be found seeing a performance most nights of the week (in normal times!) He is interested in the cross section of theatre, popular culture, hospitality, and politics. He also loves a good bagel!\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "dtliExcerpt": "But that’s what happens when you have all the right ingredients to deliver what is perhaps the best new musical of this decade.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/the-outsiders/ -->",
  "needsScoring": true,
  "textWordCount": 726,
  "archivePath": "data/archives/reviews/the-outsiders-2024/theatrely--kobi_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:43:58.556Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee"
}