{
  "showId": "the-outsiders-2024",
  "outletId": "variety-naveen-kumar",
  "outlet": "Variety (Naveen Kumar)",
  "criticName": "Naveen Kumar",
  "url": "https://variety.com/2024/legit/reviews/the-outsiders-review-broadway-musical-1235966796/",
  "playbillVerdictUrl": "https://variety.com/2024/legit/reviews/the-outsiders-review-broadway-musical-1235966796/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Tough guys with a soft side have long held a firm grip on the American imagination. S.E. Hinton's novel \"The Outsiders,\" about a cadre of down-and-out boys, has been read by millions of restless adolescents since it was published in 1967, when the author herself was a teenager. Francis Ford Coppola's 1983 film, stacked with before-they-were-A-list hunks including Rob Lowe and Matt Dillon, ushered in the Brat Pack era of moviemaking that paid serious attention to young people and their discontents.\n\n\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\t\n\t\t\t\t\n\n\n\t\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\t\n\t\t\n\t\t\t\t\t\t\t\n\n\t\n\t\n\t\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\tIndependent Film Company Buys Joel Edgerton Psychological Thriller &#039;The Plague&#039; (EXCLUSIVE)\t\t\n\t\t\t\n\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\n\t\n\t\n\t\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\tIndie Sales Closes Deals on Momoko Seto&#039;s &#039;Dandelion&#039;s Odyssey&#039; Ahead of North American Premiere at Toronto (EXCLUSIVE)\n\nA new musical version of \"The Outsiders,\" now playing at the Jacobs Theater on Broadway, leverages the appeal of these previous iterations: the insatiable longing of youth, the triumph of integrity over adversity and, yes, a cast that smolders in vintage muscle tees (costumes courtesy of Sarafina Bush). But the production only intermittently rises to the challenge of transforming such familiar material into theater that feels both original and necessary. It packs plenty of heart and soul, but lacks a strong pulse.\n\n\n\n\t\t\t\n\t\t\tPopular on Variety\n\n\"The Outsiders\" isn't short on plot, but much of it has been seen elsewhere, particularly onstage: rival gangs of haves and have-nots, a romance that crosses enemy lines, and a second-act rumble to settle the score. (It's probable that Hinton, like so many high school students, also read \"Romeo & Juliet.\") \"The Outsiders,\" which premiered at La Jolla Playhouse last spring, could aptly be described as \"Grease\" without the fizzy pizazz or \"West Side Story\" without the passion or the pathos.\n\nThat would be underselling the considerable achievements of the creative team, artfully led by director Danya Taymor, that bolster the production with seductive aesthetic flourishes. It's to their credit that \"The Outsiders\" at least lends a distinct flavor to its many recycled elements.\n\nFraternity is the focus of the script, written by Adam Rapp with Justin Levine, which goes lighter than Coppola on retro slang in favor of naturalism and emotional development among the three orphaned brothers: the narrator Ponyboy (Brody Grant), the brawny and romantic Sodapop (Jason Schmidt) and the eldest turned father figure Darrel (Brent Comer). All three actors are excellent; a shared sense of bruised tenderness suffuses their domestic scenes, which glow beneath amber pools of light in stark contrast to street fights pierced by sudden blackouts. (Brian MacDevitt's lighting is wonderfully expressive.)\n\nThere's a baleful, country sound to the score, by the folk duo Jamestown Revival (Jonathan Clay and Zach Chance) and Levine (who is also credited with music supervision, orchestration and arrangements) suited to the Oklahoma setting and an aching desire to escape it. Nearly the whole first act is dedicated to numbers hammering that desire home, including the song \"Great Expectations,\" named for Dickens' novel, which replaces \"Gone With the Wind\" as the literary reference in Ponyboy's pocket. (Rapp also makes him the brains of the family.)\n\nAfter an opening number that accomplishes lots of heavy lifting — establishing time and place (\"Tulsa 1967\") and primary conflict (between disadvantaged \"greasers\" and monied \"socs,\" or socialites) — a wistful sense of resignation (\"that's probably how it's always gonna go\") becomes the dominant theme. That ennui weighs on the show like a lead blanket despite a back-loaded proliferation of twists, including a deadly stabbing and the rescue of children from a church fire. Even as life takes irrevocable turns, Ponyboy still feels trapped, which makes narrative sense but proves difficult to dramatize.\n\nThe raw-wood set, dominated by a barn-like wall, seems intended to reflect that imprisonment (it's by the design collective AMP featuring Tatiana Kahvegian) and serves as a muted canvas for more notable effects. A high-pitched ringing brings the audience inside Ponyboy's skull when he is knocked unconscious by a haughty rival (sound is by Cody Spencer). And that climactic fight is set in a thunderstorm and choreographed, by Rick and Jeff Kuperman, like an erotic music video (a conceit also seen in the most recent Broadway staging of \"West Side Story\").\n\nConsidering the songwriters turn \"Tulsa 1967\" into a recurring refrain, and that a notorious massacre devastated the city's Black neighborhood not 50 years earlier, the production smartly does not ignore race among its social divisions. In this version of the story, mentor and ex-con Dally (Joshua Boone) teaches Johnny (Sky Lakota-Lynch) to defend himself, a fatal bit of hard-won wisdom that leads to their tragic outcomes. Both actors deliver late-stage numbers that are among the score's high points.\n\nBut a puttering feeling pervades even these climactic moments. The infatuation between Ponyboy and Cherry (Emma Pittman), which produces a couple of serviceable duets, feels perfunctory and fades into a melange of other conflicts. Hinton's novel gallops with the muscular first-person voice of a tortured narrator, grabbing readers by the collar. \"The Outsiders\" musical takes a milder approach, peering under the hood of masculinity to the tune and pace of indie emo.",
  "isFullReview": true,
  "textWordCount": 834,
  "archivePath": "data/archives/reviews/the-outsiders/variety-naveen-kumar--naveen-kumar_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:03:10.537Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250812144804",
  "archiveOrgUrl": "http://web.archive.org/web/20250812144804/https://variety.com/2024/legit/reviews/the-outsiders-review-broadway-musical-1235966796/"
}
