{
  "showId": "fat-ham-2023",
  "outletId": "deadline",
  "outlet": "Deadline",
  "criticName": "Greg Evans",
  "url": "https://deadline.com/2023/04/fat-ham-broadway-review-deadline-1235322718/",
  "playbillVerdictUrl": "https://deadline.com/2023/04/fat-ham-broadway-review-deadline-1235322718/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "nyc-theatre",
    "bww-reviews"
  ],
  "nycTheatreExcerpt": "went neutral, summing up the views of most the rest of the press:",
  "contentTier": "needs-rescrape",
  "tierReason": "Only aggregator excerpts available",
  "rejectedAt": "2026-02-03T21:02:40.684Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be a fragment describing aggregator methodology rather than actual review content from the critic.; openai: The provided text is not an evaluative review but a summary of other press opinions.; gemini: The provided text is not a review, but rather a note that the outlet went neutral and summarized other reviews.; kimi: The provided text is a fragment describing the review's general stance ('went neutral') rather than containing actual evaluative content about the show itself. It lacks a complete sentence with critical assessment of the production, performances, or direction.",
  "promptVersion": "5.2.0",
  "showScoreExcerpt": "“Excellently performed by the entire cast...Ijames’ play resolves on an exhilarating, life-affirming note. Or, to be more precise, notes, as in song, and dance, and enough good-time gender-bending disco sparkle to win over all but the grumpiest of spirits.”\n\nRead more",
  "bwwExcerpt": "Excellently performed by the entire cast, Fat Ham is cleverly transferred to Broadway by director Saheem Ali from the smaller Off Broadway Public Theater space (the play originated in a Covid-era filmed presentation at the Wilma Theater in Philadelphia). By turns sweet and saucy (and very funny), the play stays just close enough to Hamlet to keep us off-balance. Although there will be blood (well, a little) and death, along with a fine rendition of Radiohead’s “Creep” and recitations of at least some of Hamlet‘s greatest hits – no To Be or Not To Be, though, as Juicy’s self-doubts are of a less existential sort – Ijames’ play resolves on an exhilarating, life-affirming note. Or, to be more precise, notes, as in song, and dance, and enough good-time gender-bending disco sparkle to win over all but the grumpiest of spirits.",
  "bwwScore": 10
}
