{
  "showId": "fat-ham-2023",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Gloria Oladipo",
  "url": "https://www.theguardian.com/stage/2023/apr/13/fat-ham-review-broadway-hamlet-pulitzer",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2023/apr/13/fat-ham-review-broadway-hamlet-pulitzer",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Marcel Spears and Calvin Leon Smith in Fat Ham. Photograph: Joan MarcusView image in fullscreenMarcel Spears and Calvin Leon Smith in Fat Ham. Photograph: Joan Marcus This article is more than 2 years oldReviewFat Ham review – Pulitzer-winning Hamlet revision hits BroadwayThis article is more than 2 years oldAmerican Airlines Theatre, New York\n\nJames Ijames’s electrifying take on Shakespeare’s classic, with a Black queer man at its centre, makes for a smart update\n\nJames Ijames’s Fat Ham dances on the bones of Hamlet. Make no mistake, Fat Ham is not a sequel to Hamlet. It is not “Hamlet with Black people”.\n\nFat Ham uses the silhouette of Shakespeare’s masterwork to birth something new, a vicious critique of masculinity and violence infused with a much-needed hilarity. Juicy (Marcel Spears), a Black queer man, is visited by his father’s ghost Pap (Billy Eugene Jones). Akin to Hamlet, Juicy is tasked with avenging his father’s death and killing his uncle.\n\nRead moreBut the critical ask takes place at a backyard barbecue (a lush set by scenic designer Maruti Evans), a fete celebrating the nuptials of Tedra (Nikki Crawford), Juicy’s mother, and Rev (Jones brilliantly doubles as father and uncle). Juicy isn’t a Denmark prince but heir to a barbecue joint and butcher legacy, one that he has turned his back on for an online degree in human resources. The murder is his chance to prove he isn’t what the men of the family take him for: soft, weak.\n\nUnder Saheem Ali’s direction, Fat Ham is an exhilarating example of Ijames’s world-building, his prowess for merriment and lyrical musing. Ijames crafts a tender story on Juicy navigating heaps of trauma and betrayal: the murder of his bullish father; his mother’s new marriage; being queer, Black and “soft” in the American south. But amid its tragic undertones, Fat Ham dishes a masterful balance of humor and joy throughout.\n\nThe subsequent celebration includes plenty of romp amid Juicy’s spiraling decision on whether to kill his uncle. Juicy’s cousin Tio (a hilarious Chris Herbie Holland) is the one who first spots Pap’s ghost; when urged to bring Pap’s ghost back, Tio remarks: “What I look like? Miss Cleo?” Family friend Rabby (Benja Kay Thomas) and her children, Opal (Adrianna Mitchell) and Larry (Calvin Leon Smith) also pay a visit. The trio invites chaos that launches the already tumultuous party into a new plane of antics.\n\nBut within the fest, Ijames carves out tender moments. Juicy, Opal and Larry are bonded by their individual struggles of sexuality, particularly how the older generation regards them. Spears invites infinite compassion for Juicy, especially with composed recollections on the way his father’s cruelty has harmed him (the barbecuing of his childhood doll, for example). It is a spirit he can’t quite shake, a pain that causes him to act cruelly and violently in his own right.\n\nIn Fat Ham, violence is a birthright. Juicy’s father was a homophobic bully who killed and was gruesomely murdered in kind. Rev, Juicy’s uncle turned stepdaddy, uses physical violence to taunt Juicy and his softness. Now, it’s Juicy’s turn to live out the family promise. But, unlike Hamlet, the violence in Fat Ham is often cooled with humor. It is a reminder that inherited trauma makes absurd creatures of us all.\n\n“You gotta avenge me,” Pap instructs.\n\n“I ain’t no avenger,” retorts Juicy.\n\nThe 2022 Pulitzer prize winner for drama also includes a meta-meditation on theater’s role on embracing violence, especially when it affects Black people. Juicy and other characters acknowledge the presence of an audience, one that they fear being embarrassed in front of, dying in front of. As Opal attempts to take the microphone, Juicy snatches it back with a warning: “They’re watching.”\n\nWith all Fat Ham wants to achieve, it has its stumbling blocks. Some moments of audience engagement feel like misdirections amid the rich dilemma at hand. But Ijames’s creativity and craft shines through.\n\nIjames’s writing – his lyricism, his craft – is only further buoyed by Fat Ham’s cast. Under Ali’s direction, all members soar when handed the difficult task of skating between Fat Ham’s flicks of laughter and gut punch. Moments of ensemble, particularly as the family celebrates over ribs and corn or breaks into impromptu karaoke and charades, crackle with humor and tension. A tender Crawford playing referee for her groom and son combined with Jones, gifted as the cruel and puppeteering Rev. And, Spears, delightfully in the middle.\n\nAs easy as these cycles are to repeat, Fat Ham successfully reminds us that Juicy’s real strength comes from denying the legacy of brutality that seeks to berate him into submission. The lineage of “real men” that want to straighten out the kinks that make him, him.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 806,
  "archivePath": "data/archives/reviews/fat-ham-2023/guardian--gloria-oladipo_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:17:38.899Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 806,
  "tierReason": "Full review text"
}