{
  "showId": "fat-ham-2023",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/entertainment/broadway/ny-broadway-fat-ham-review-20230413-4t4p55h7wnhbre3ifiryiabff4-story.html",
  "playbillVerdictUrl": "https://www.nydailynews.com/entertainment/broadway/ny-broadway-fat-ham-review-20230413-4t4p55h7wnhbre3ifiryiabff4-story.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "In James Ijames’ eye-popping “Fat Ham,” a malcontent named Juicy, kinda like “Hamlet,” is chilling in his North Carolina backyard when his recently deceased dad exits the presumptive fires of hell and pops up out of his patio grill.\n\nHis message? Put down your books from that correspondence course at the University of Phoenix, you lazy kid, and avenge my prison shanking at the surrogate hands of my brother. You know, the guy now married to your wild momma and a pit master about to barbecue some ribs right here, maybe even the ones left over from my recent funeral.\n\nJuicy, who has no clue what to do with this information, is dressed like a moody Dane but he’s hardly a carbon copy. Beyond still living at home, at least.\n\nFor one thing, Juicy hated his father and has little time for his abusive uncle (both played by Billy Eugene Jones). For another, he rejects this whole tragic-hero thing. Juicy’s also Black, nerdy and queer; his best pals, the Horatio-like cousin Tio (Chris Herbie Holland) and the Ophelia-esque Opal (Adrianna Mitchell) also are outsiders. So is the Laertes-like Larry (Calvin Leon Smith), a U.S. Marine who harbors a secret.\n\nIn fact, Juicy is the latest in a line of gay, non-conformist and self-doubting Black intellectuals now occupying the hero spots in Broadway plays by the likes of Michael R. Jackson, Jeremy O. Harris and Ijames himself, a trio of radical writers who have shot to prominence in the American theater and are ready, willing and able to pull apart not just their more conformist familial elders but a whole lot of once-settled Broadway wisdom.\n\nYou know, like who should be at the core of a tragedy and what they should do when they arrive there.\n\nForsooth, Ijames is going after those core Shakespearean assumptions which have echoed down the centuries on the Great White Way. The guy has guts. And a Pulitzer Prize for this very work.\n\nSo “Fat Ham” is a left-leaning deconstruction not just of “Hamlet” but of tragedy itself. That sounds like a recipe for a show that closes Friday and, for sure, there is a vain of love/hatred for atrophied Black pop culture (typically by implication, a vestige of “white supremacy”) that runs through this play, as it does through the work of Jackson, who won the Tony last year for “A Strange Loop.”\n\nSome of that runs up against ageism and a self-protected intellectual elitism on the part of hugely talented young writers still wrestling with the deeper understanding of mortality and familial forgiveness that will come with age.\n\nBut there is nothing dour nor overly academic about “Fat Ham,” which has been given a blisteringly well-acted production at the American Airliines Theatre by director Saheem Ali and staged on the wittiest of satirical sets by Maruti Evans.\n\nAt no point does this play feel like anything other than a big-fun Broadway show: It’s a smart, fearless and often wildly entertaining 90 minutes, filled not just with radical ideas but with absurdist spectacle. To his credit, Ijames is willing to blow up even his own assertions. You get musical numbers, tableaux, crazy comedic antics and a suite of outsized performances from the likes of the superb Nikki Crawford, making her Broadway debut like many in this knockout cast. I’d go so far as to say I can’t recall such a well-acted Broadway show with so many making a first Main Stem appearance.\n\nBut this is Marcel Spears’ show and his counter-intuitive work here is really something: he manages to operate on two levels, satirizing the entire convention of a star actor and yet upholding what it means to anchor a show at the same time. It’s very savvy work that totally fits the writer.\n\n“Fat Ham” focuses mostly on the early parts of “Hamlet,” and it actually feels like Ijames ran out of time to really do what he wanted with the geopolitical concerns and the parade of bodies in Act Five. And you’ll likely see Larry’s secret coming, if not its fabo theatrical manifestation. But this is still an incredibly sophisticated takeoff and takedown, replete as it is with reinvented soliloquies, laments and violent acts in service of whatever revenge means in this new young world, barbecuing Broadway boomers with hot sauce on top.\n\nThis is a show thick with resonance and, of course, cleverly self-protected from assaults from within and without. You can enjoy it on very many different levels, which (ironically) is what Broadway has tried to achieve since time immemorial.",
  "isFullReview": true,
  "textWordCount": 759,
  "archivePath": "data/archives/reviews/fat-ham-2023/nydailynews--chris-jones_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:19:07.112Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "connect ECONNREFUSED 207.241.237.3:80"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 759,
  "tierReason": "Full review text"
}