{
  "showId": "fat-ham-2023",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "https://newyorktheater.me/2023/04/12/fat-ham-broadway-review/",
  "playbillVerdictUrl": "https://newyorktheater.me/2023/04/12/fat-ham-broadway-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "showScoreExcerpt": "Sure, “Fat Ham” won the 2022 Pulitzer Prize for Drama, and the play is inspired by “Hamlet,” loosely adopting the plot and even using some verbatim soliloquys from Shakespeare’s tragedy. But I could forget about the expectations that were raised (and dashed) by these prestige signifiers the first time around and now relish the silly, sexy and surreal moments that director Saheem Ali make pop in James Ijames’s raunchy, freewheeling comedy.\n\nRead more",
  "bwwExcerpt": "“Fat Ham” is now opening on Broadway after its two-month run last summer at the Public Theater. It hasn’t changed much, but it’s better. It has the same design and stagecraft, but bigger and more elaborate to fit the larger Broadway stage; it presents the same actors, except their performances are crisper and more confident. It is essentially the same production, but I enjoyed it more on second viewing. That’s because I focused more on scenes like the one with the smiley balloon. Sure, “Fat Ham” won the 2022 Pulitzer Prize for Drama, and the play is inspired by “Hamlet,” loosely adopting the plot and even using some verbatim soliloquys from Shakespeare’s tragedy. But I could forget about the expectations that were raised (and dashed) by these prestige signifiers the first time around, and now relish the silly, sexy and surreal moments that director Saheem Ali make pop in James Ijames’s raunchy, freewheeling comedy. Even the serious concerns, peeking out from beneath the playfulness, have more impact.",
  "bwwScore": 9,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Pulitzer-Prize-Winning-FAT-HAM-Opens-On-Broadway-20230412"
}
