{
  "showId": "fat-ham-2023",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2022/05/13/theater/fat-ham-review.html",
  "publishDate": "May 13, 2022",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "Fat Ham is not just a clever concept but a fully realized work of art that uses Shakespeare's tragedy as a launching pad for its own soaring exploration of Black masculinity, queerness and family trauma.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "That “Fat Ham” achieves its happy, even joyful, ending honestly, without denying the weight of forces that make “Hamlet” feel just as honest, is a sign of how capacious and original the writing is, growing the skin of its own necessity instead of merely burrowing into Shakespeare’s. It’s also a sign of how beautifully the cast brings the writing to life. Everyone is excellent, and Thomas’s loud-lady-in-the-pew-behind-you routine is flat-out hilarious. But Spears, with his minute calibrations of feyness and fierceness, holds the whole thing together. In his scenes with Crawford, especially one in which Tedra pleads with Juicy to hold it together — “you don’t get to go crazy” — he lets us see how a character creates and re-creates himself in real time.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Fat Ham is not just a clever concept but a fully realized work of art that uses Shakespeare's tragedy as a launching pad for its own soaring exploration of Black masculinity, queerness and family trauma.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: published 312 days before show earliest date 2023-03-21",
  "playbillVerdictUrl": "https://www.nytimes.com/2023/04/12/theater/fat-ham-review.html",
  "sources": [
    "web-search",
    "playbill-verdict",
    "nyc-theatre",
    "bww-reviews"
  ],
  "nycTheatreExcerpt": "Let's start with Camelot. A classic musical from 1960 that last saw a revival on Broadway in 1980, many were anticipating good things from the Lincoln Center's newest re-imagining, following director Bartlet Sherr's successes with The King and I and My Fair Lady. However it looks like the legend of King Arthur's court may have been too much.  led the charge with their less-than-positive review, asking:",
  "bwwScore": 10
}
