{
  "showId": "the-elephant-man-2014",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2014/legit/reviews/elephant-man-review-bradley-cooper-broadway-1201373285/",
  "publishDate": "November 9, 2014",
  "fullText": "For a play about social perceptions of physical ugliness, this Williamstown Theater Festival production of Bernard Pomerance’s Tony Award-winning 1979 drama “The Elephant Man” is breathtakingly beautiful. Bradley Cooper, who stars as the grotesquely deformed John Merrick, unlikely darling of Victorian society, may well be the most beautiful feature of all. But the severely stylized nature of the production design places the character’s monstrous beauty within the context of a very dark and quite disturbing genre painting.\n\nAlthough Pomerance’s play is expressionistic in style, the substance of it is based in true historical events about the bizarre celebrity of John Merrick (Cooper), famously known as “the Elephant Man” for his thick hide and hideous birth deformities. Born in 1862 and abandoned by his mother, Merrick was warehoused in British institutions until he is taken up by a sleazy “manager” named Ross (Anthony Heald, in a wonderfully creepy Grand Guignol perf) who exhibits him in a storefront sideshow.\n\nAfter some years of inhuman mistreatment, the poor creature is again abandoned — this time to be rescued by Dr. Frederick Treves (played with earnest concern and grave compassion by Alessandro Nivola), distinguished lecturer on surgical anatomy and physician to Queen Victoria, who shelters Merrick at the London Hospital until his death in 1890.\n\nIn the most extraordinary scene of the play, Treves exhibits the virtually unclothed Merrick to his anatomy class while delivering an explicit lecture on the nature of the man’s abnormalities. After detailing such features as the “fungous skin” and “osseous growth on the forehead,” he notes that, “the deformities rendered the face utterly incapable of the expression of any emotion whatsoever.”\n\nHelmer Scott Ellis has staged the anatomy lesson by having the doctor address his students while standing in front of a full-length, larger-than-life photograph of the near-naked Merrick. (The image is composed of blown-up slides of real photographs taken by Treves, the same ones used as the physical model for John Hurt’s film performance.) What makes the scene a tour de force is Cooper’s mimed illustration of this anatomy lecture.\n\nAs Nivola’s Treves dispassionately drones on about his subject’s twisted limbs and misshapen torso, Cooper stands stock still in a cone of light and silently contorts his own perfect body into an approximation of each deformity. The piece de résistance is his depiction of the “wide slobbering aperture” that is Merrick’s mouth. Shaping his own mouth into a fleshy oval, the thesp gives expressive voice to the sensitive and intelligent human being imprisoned in his own body. It’s a stunning performance, deeply felt and very moving.\n\nDuring the years he is under the care of Dr. Treves, Merrick reveals his keen mind and artistic sensibility to the English gentry who are allowed to parade in and out of his rooms to marvel. Bearing gifts far more expensive than the two-cent admission that Ross charged at his sideshow, the high and the mighty of London society gaze at the Elephant Man for insights into their own souls. Or possibly just confirmation of their own superiority.\n\nIn effect, Merrick has escaped one sideshow only to find himself the star attraction of another.\n\nTreves is neither insensitive nor heartless, and wanting to expose Merrick to more “normal” aspects of life, the doctor engages the assistance of Mrs. Kendal, a London stage actress played with regal charm and real warmth by Patricia Clarkson. Looking stunning in Clint Ramos’ richly detailed period dress, Clarkson’s Kendal overcomes her initial revulsion and visits Merrick often, engaging him in conversation as one intelligent individual to another. The only person who sees his loneliness, she restores his dignity by regarding him as a man, rather than a freakish medical curiosity. What began as an acting exercise develops into a true, and quite extraordinary friendship.\n\nAlthough Merrick is the emotional centerpiece of the play — and Cooper’s perf its riveting focus — the scribe uses these society viewings as opportunities for meditations on his themes of the illusions of self and the tyranny of appearances. This theatrical conceit isn’t as lethal as it sounds, given the expressionistic design of this handsome production.\n\nTimothy R. Mackabee’s stylized set pieces and Philip S. Rosenberg’s expressive lighting design keep reminding us that, like beauty and ugliness, reality is all in the eye of the beholder. Merrick looks like whatever people need him to look like in order to see their own reflections mirrored back at them. So, along with the dance-like movements of the chorus figures, all those curtains and mirrors and artificial lighting effects serve the playwright’s intention of revealing us to ourselves.\n\nFill in your details below or click an icon to log in:\n\nYou are commenting using your WordPress.com account. ( Log Out / Change )\n\nYou are commenting using your Twitter account. ( Log Out / Change )\n\nYou are commenting using your Facebook account. ( Log Out / Change )\n\nYou are commenting using your Google+ account. ( Log Out / Change )\n\nNotify me of new comments via email.\n\nNotify me of new posts via email.\n\nNow looking like demoralizatio and TERROR porn\nfor the capstone EUGENICS agenda.\n\nThere will always be actors performing as Merrick but only one truely captured Merrick and that was Phillip Anglim- Anglim was very protective of Merrick in much the same way as Cumberbatch has been re:Turing and it came through his beautifully essayed portrayal.",
  "isFullReview": true,
  "dtliExcerpt": "Bradley Cooper brings his movie-star magnetism to bear on the grotesquely deformed title character in this powerful revival of Bernard Pomerance's 1979 drama.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "As Treves dispassionately drones on about his subject's twisted limbs and misshapen torso, Cooper stands stock still in a cone of light and silently contorts his own perfect body into an approximation of each deformity. The piece de résistance is his depiction of the 'wide slobbering aperture' that is Merrick's mouth. Shaping his own mouth into a fleshy oval, the thesp gives expressive voice to the sensitive and intelligent human being imprisoned in his own body. It's a stunning performance, deeply felt and very moving.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-ELEPHANT-MAN-Starring-Bradley-Cooper-Opens-on-Broadway--Updating-Live-20141207",
  "showScoreExcerpt": "Bradley Cooper brings his movie-star magnetism to bear on the grotesquely deformed title character in this powerful revival of Bernard Pomerance's 1979 drama.",
  "contentTier": "complete",
  "contentTierReason": "Short text (23 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://variety.com/2014/legit/reviews/elephant-man-review-bradley-cooper-broadway-1201373285#u=http://variety.com/2014/legit/reviews/elephant-man-review-bradley-cooper-broadway-1201373285;k=pmc-adi-31bb2464aad8b905af7a81e1d57b77ae",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 8,
  "previousUrl": "https://variety.com/2014/legit/reviews/theater-review-the-elephant-man-1201369942/",
  "urlDiscoveredAt": "2026-02-05T04:45:29.721Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 896,
  "archivePath": "data/archives/reviews/the-elephant-man-2014/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:45:29.726Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20141209050819",
  "archiveOrgUrl": "http://web.archive.org/web/20141209050819/http://variety.com/2014/legit/reviews/elephant-man-review-bradley-cooper-broadway-1201373285/",
  "wordCount": 896,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-05T09:31:04.822Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This review is of a Williamstown Theater Festival production, not a Broadway production; openai: The review is about a production at the Williamstown Theater Festival, not the current Broadway run.",
  "promptVersion": "5.2.0"
}
