{
  "showId": "amazing-grace-2015",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/amazing-grace-broadway-review-807569/",
  "publishDate": "July 17, 2015",
  "fullText": "Here are some of the lovely little tidbits you'll learn from watching E!’s Sex With Brody: The son of Caitlyn Jenner and Linda Thompson doesn't like to kiss after oral sex; he had a fivesome, and it was a \"nightmare”; and he thinks his semen tastes great.\n\nYou most likely could file all of the above under \"things you never needed to know about Brody Jenner.\" Based on Jenner's own podcast, the four-episode series also features therapist Dr. Mike Dow and comedian Stevie Ryan as co-hosts. People call in with their questions, and celebrities stop by to chat about their sex lives.\n\nThe Bottom Line\n \n \n Want to know all about Brody Jenner's sex life? Didn't think so.\n\nJenner probably aspires to be the millennial version of Dr. Ruth, but, except for his extensive experience in the bedroom, he doesn't have any credentials. Dr. Ruth came along at a time when talking about sex was taboo. That's no longer the case; it's hard to shock the Twitter/Tinder generation. Nothing is private anymore. Jenner comes across as a seventh-grader who thinks it's hilarious to use naughty words. He and Ryan seem to just want to outgross each other, while Dow is the only one imparting any actual advice or solid information.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n TV\n \n \n \n \n\n \n \n \n \n People Can't Stop Googling the 2014 Olympics and \"Boy Aquarium\" in the Wake of 'Heated Rivalry' \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Movies\n \n \n \n \n\n \n \n \n \n Fiji, and Tilda Swinton, Star in 'Heart of Light - eleven songs for Fiji.' Swinton and Her Director Share What the World Can Learn From the Island Nation\n\nFor the most part, the show is just silly. \"People who use emojis have more and better sex,\" says Dow. Ryan refers to her vagina as \"little Stevie\" and says the perfect amount of time for sex is the length of commercials during Scandal. At other times, Jenner is overtly misogynistic. One whole segment is devoted to being a \"dirty-talk translator.\" What does a woman mean when she says \"I never do this?\" asks Dow. \"Slut,\" says Jenner immediately. \"That's what all women do, by the way, just so you know. As soon as a female regrets what they do, they pretend that it never happened.”\n\nChristina Milian is the celebrity guest in the pilot episode. Her contribution to the conversation? Announcing that she's doing kegel exercises during the show and asking Dr. Dow, \"Is it possible for every girl to squirt?\" Did I mention this is not a show to watch with your grandmother?\n\nThe strongest segment is composed of questions from callers. One guy wonders what to do about the fact that his girlfriend, with whom he thought he was exclusive, is still on Tinder. He has to be honest and confront her, they all agree. A new mom wants to know how to jump-start her sex life with her husband after having a baby. \"Congratulations to you. You built a human being and then pushed it out,\" says Ryan. \"I think he should be kissing your ass for it because he didn't have to do that.\"\n\nThis is not Jenner's first time at the reality show rodeo. Before becoming a castmember on Keeping Up With the Kardashians, he was on The Hills, hung out with his friends on The Princes of Malibu and tried to search for a new best buddy on Bromance. Sometimes you can learn everything you need to know about a show just by reading its title. If you want to listen to Brody Jenner talk about his sex life while intermittently insulting and degrading women, then Sex With Brody is for you. For the rest of us, there are plenty of other TV shows out there.",
  "isFullReview": true,
  "dtliExcerpt": "Amazing Grace has an uplifting story to tell about the writing of one of the world's most beloved hymns, but Christopher Smith's musical is more workmanlike than inspired.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Amazing Grace has an uplifting story to tell about the writing of one of the world's most beloved hymns, but Christopher Smith's musical is more workmanlike than inspired.",
  "contentTier": "complete",
  "contentTierReason": "Short text (28 words)",
  "textWordCount": 610,
  "archivePath": "data/archives/reviews/amazing-grace-2015/hollywood-reporter--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:35:16.629Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wordCount": 610,
  "tierReason": "Full review text",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/amazing-grace-theater-review-809218",
  "sources": [
    "web-search",
    "playbill-verdict"
  ]
}
