{
  "showId": "amazing-grace-2015",
  "outletId": "usatoday",
  "outlet": "USA Today",
  "criticName": "Elysa Gardner",
  "url": "https://www.usatoday.com/story/life/theater/2015/07/16/amazing-grace-broadway-review/30154717/",
  "publishDate": "July 16, 2015",
  "fullText": "The musical, which opened Thursday at the Nederlander Theatre, tells the story of John Newton, the 18th-century English sailor and slave trader who wrote the beloved hymn after a spiritual awakening.",
  "isFullReview": false,
  "dtliExcerpt": "The musical, which opened Thursday at the Nederlander Theatre, tells the story of John Newton, the 18th-century English sailor and slave trader who wrote the beloved hymn after a spiritual awakening.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Sneer if you must, but it could be argued that in 2015, on Broadway, it's more irreverent to promote such beliefs than it is to satirize their practice. The much-celebrated Hand to God uses a demonic sock puppet to send up rigid distinctions between good and evil in a Christian community. And at last check, The Book of Mormon wasn't having any trouble selling tickets. If Grace has the courage of its convictions, it shows less daring, and little invention, as a creative work. With its mostly generic, sometimes bombastic score and stilted dialogue, this account of the pre-American Revolution U.K. can recall some of the more hot-air-filled musicals that invaded us from abroad (and some homegrown ones) in the '80s and '90s.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-AMAZING-GRACE-Opens-on-Broadway-Updating-Live-20150716",
  "showScoreExcerpt": "The musical, which opened Thursday at the Nederlander Theatre, tells the story of John Newton, the 18th-century English sailor and slave trader who wrote the beloved hymn after a spiritual awakening.",
  "contentTier": "invalid",
  "contentTierReason": "Short text (31 words)",
  "rejectedAt": "2026-02-05T17:29:01.419Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a brief plot summary or description with no critical evaluation of the production's quality or recommendation to audiences.; openai: This text is a plot summary with no evaluation or opinion about the production.; gemini: This is a plot summary with no evaluation or recommendation.; kimi: The text provides only biographical context and plot summary about the show's subject matter (John Newton), with no evaluation of the production quality, performances, or recommendation to see the show.",
  "promptVersion": "5.2.0",
  "textQuality": "partial",
  "bwwScore": 6,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ]
}
