{
  "showId": "amazing-grace-2015",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2015/07/theater-review-amazing-grace.html",
  "publishDate": "July 16, 2015",
  "fullText": "Amazing Grace is a musical that wants to have it both ways: to honor the slave trade's victims while also celebrating the redemption of one of its profiteers.",
  "isFullReview": false,
  "dtliExcerpt": "Amazing Grace is a musical that wants to have it both ways: to honor the slave trade's victims while also celebrating the redemption of one of its profiteers.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Amazing Grace, a new musical purporting to tell the story of the 18th-century British abolitionist John Newton, is the 'first work of professional writing' by Christopher Smith, a 45-year-old former police officer from suburban Philadelphia. (He wrote the music and lyrics himself and co-wrote the book with the more experienced playwright Arthur Giron.) What he has somehow gotten produced, and offered with good intentions to Broadway audiences and critics, is the equivalent of a child's drawing: naïve, sincere, glowing with an unimpeachable if hard-to-pin-down vision of what it wants to be. (I'd guess that it wants to be a Christian family entertainment with a bold message about the power of redemption.) It is also a confusing cartoon so lacking in craft that it ruins any chance of being taken seriously. Certainly it can't be recommended as history; it's riddled with falsehoods that alone would sink it. But it also fails as musical theater, on two counts: the music and the theater.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-AMAZING-GRACE-Opens-on-Broadway-Updating-Live-20150716",
  "showScoreExcerpt": "Amazing Grace is a musical that wants to have it both ways: to honor the slave trade's victims while also celebrating the redemption of one of its profiteers.",
  "contentTier": "invalid",
  "contentTierReason": "Short text (28 words)",
  "rejectedAt": "2026-02-05T17:22:09.821Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or pull quote, not a complete review that provides sufficient evaluative content to score; openai: The text is a brief statement about the show's thematic intentions, not an evaluative review of the production.; gemini: This is a single sentence that describes the premise of the show, but does not offer an evaluation or recommendation.; kimi: The text provides only a thematic description of the show's premise ('wants to have it both ways') without evaluating production quality, performances, or offering a recommendation verdict. It reads as plot/context summary rather than criticism.",
  "promptVersion": "5.2.0",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://www.vulture.com/2015/07/theater-review-amazing-grace.html?mid=twitter_vulture",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 5
}
