{
  "showId": "the-roommate",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2024/09/12/the-roommate-boulevard-comedy-sitcom-style/",
  "publishDate": "2024-09-12T20:55:10",
  "fullText": "At the beginning of The Roommate, Mia Farrow and Patti LuPone come onstage and acknowledge the audience’s enthusiastic clapping as the play’s credits are projected behind them. The two performers are right to bask in the adulation, since their star power and hugely enjoyable performances are the primary reasons to see Jen Silverman’s play receiving its world premiere after numerous regional productions.\n\nThe wispier-than-gossamer plot involves the Odd Couple-like pairing of two very different characters who find themselves unlikely roommates in a large Iowa house owned by empty-nester Sharon (Farrow). Sharon has apparently placed an ad somewhere that’s been answered by the tough-talking Robyn (LuPone), who’s driven there all the way from the Bronx. Why should this urbanite, lesbian, vegan, crafter of voodoo dolls, leather-jacket wearing, slam poetry performer decide to take up residence in the American heartland? Unfortunately for the purposes of this review, that’s something you’ll have to see the play to find out.\n\nResembling the pilot for an unproduced sitcom about two wacky characters who get into a series of crazy misadventures, the evening proves diverting despite the surprisingly sluggish staging by the normally reliable Jack O’Brien. It’s fun to watch the pigtail-wearing, seemingly eternally innocent Sharon respond to Robyn’s series of revelations about her urban lifestyle, which also involves frequent indulging in “medicinal herbs.” You won’t be surprised to learn that by the end of the evening, Sharon has discovered her inner pot-smoking lesbian, as well as some other naughty personality traits she’s picked up from her new roomie who has quite a few secrets to reveal.\n\nThe sort of boulevard comedy that used to appear on Broadway with regularity, The Roommate definitely benefits from the presence of its formidable leads, although it’s hard not to think that it would have been more interesting if the casting had been reversed. LuPone, wearing a wig that could charitably be described as one used by a character looking to conceal her identity, turns out to the unlikely straight man of the duo but still manages to score laughs with her bewildered reactions to her counterpart’s bottomless naivete.\n\nFarrow, easily convincing as a 65-year-old thanks to her seemingly ageless beauty, demonstrates that her many years working with Woody Allen definitely honed her comic chops (if not her peace of mind). She expertly channels Betty White’s Rose Nylund from The Golden Girls with Sharon’s amusing befuddlement and sweet eagerness to please, and is even funnier when the character comes to gleefully embrace her darker side. She’s also heartbreaking in the play’s final moments, when Sharon faces devastating feelings of loss that she never could have predicted.\n\nDespite the fine efforts of the performers and solid production values including music by an overqualified David Yazbek, The Roommate, running 100 minutes without an intermission, always feels predictable despite its procession of narrative surprises designed for easy laughs. But that’s no reason not to take advantage of the unique opportunity to watch Farrow and LuPone play off each other with the expert comic timing of seasoned vaudevillians.\n\nThe Roommate opened September 12, 2024 at the Booth Theatre and runs through December 15. Tickets and information: theroommatebway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "nyc-theatre"
  ],
  "originalScore": "3/5 stars",
  "nycTheatreExcerpt": ": \"Despite the fine efforts of the performers and solid production values including music by an overqualified David Yazbek, The Roommate, running 100 minutes without an intermission, always feels predictable despite its procession of narrative surprises designed for easy laughs. But that's no reason not to take advantage of the unique opportunity to watch Farrow and LuPone play off each other with the expert comic timing of seasoned vaudevillian.\""
}
