{
  "showId": "the-addams-family-2010",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "http://www.nytimes.com/2010/04/09/theater/reviews/09addams.html?pagewanted=1&ref=theater",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Imagine, if you dare, the agonies of the talented people trapped inside the collapsing tomb called “The Addams Family.” Being in this genuinely ghastly musical — which opened Thursday night at the Lunt-Fontanne Theater and stars a shamefully squandered Nathan Lane and Bebe Neuwirth — must feel like going to a Halloween party in a strait-jacket or a suit of armor. Sure, you make a flashy (if obvious) first impression. But then you’re stuck in the darn thing for the rest of the night, and it’s really, really uncomfortable. Why, you can barely move, and a strangled voice inside you keeps gasping, “He-e-e-lp! Get me out of here!”",
  "bwwScore": 2,
  "contentTier": "truncated",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Broadway-Blog-THE-ADDAMS-FAMILY-Review-Roundup-20100408",
  "fullText": "https://www.nytimes.com/2010/04/09/theater/reviews/09addams.htmlShare full articleAdvertisement\n\nImagine, if you dare, the agonies of the talented people trapped inside the collapsing tomb called “The Addams Family.” Being in this genuinely ghastly musical  which opened Thursday night at the Lunt-Fontanne Theater and stars a shamefully squandered Nathan Lane and Bebe Neuwirth  must feel like going to a Halloween party in a strait-jacket or a suit of armor. Sure, you make a flashy (if obvious) first impression. But then you’re stuck in the darn thing for the rest of the night, and it’s really, really uncomfortable. Why, you can barely move, and a strangled voice inside you keeps gasping, “He-e-e-lp! Get me out of here!”\n\nThat silent scream rises like a baleful ectoplasm from a production that generally offers little to shiver about, at least not in any pleasurable way. The satisfying shiver, of course, was what was consistently elicited by the gleefully macabre cartoons by Charles Addams that inspired this musical, as well as a 1960s television series and two movies in the early 1990s. It’s a rare American who isn’t familiar with the sinister little clan (which first appeared in The New Yorker magazine in 1938) for whom shrouds are the last word in fashion, and a guillotine is the perfect children’s toy.\n\nThis latest reincarnation of “The Addams Family” is clearly relying, above all, on its title characters’ high recognition factor. That such faith is not misplaced is confirmed by the audience’s clapping and snapping along with the first strains of the overture, which appropriates the catchy television theme song. When the curtain parts to reveal a Madame Tussauds-like tableau of the assembled Addamses, there is loud, salutatory applause.",
  "isFullReview": true,
  "textWordCount": 278,
  "archivePath": "data/archives/reviews/the-addams-family-2010/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T19:12:37.407Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "wordCount": 278,
  "tierReason": "Short text (278 words)"
}