{
  "showId": "les-miserables-1987",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "http://www.ew.com/ew/article/0,,20364394_20799569,00.html",
  "playbillVerdictUrl": "http://www.ew.com/ew/article/0,,20364394_20799569,00.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 472,
  "archivePath": "data/archives/reviews/les-miserables-1987/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:44:20.572Z",
  "originalScore": "A-",
  "originalScoreNormalized": 90,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140324221541",
  "archiveOrgUrl": "http://web.archive.org/web/20140324221541/http://www.ew.com/ew/article/0,,20364394_20799569,00.html",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "It's been just six years since the last (and limp) revival of Les Misérables left Broadway.\n\nBut it's also less than two since Tom Hooper’s big-screen adaptation rode the Occupy Wall Street wave to box office riches and three Academy Awards. Now uber-producer Cameron Macintosh is remounting Alain Boublil and Claude-Michel Schonberg’s blockbuster musical about income inequality in 19th-century France with a first-rate cast and a new production that nods to its recent cinematic incarnation.\n\nThe innovative turntable set of the original production is gone, replaced by Matt Kinley's simple but elegant sets and projections (by Fifty-Nine Productions) that seem to evoke the gritty street scenes of Hooper's film as well as original paintings by Les Miz author Victor Hugo.\n\nThe revelation is Ramin Karimloo, an Iranian-born Canadian who is well known in London but makes his Broadway debut here. As Jean Valjean, the petty criminal turned respected citizen still on the run from the law, Karimloo projects a masculine authority that cannily reveals hidden pockets of vulnerability. He's blessed with matinee-idol looks and a crystalline tenor that pierces the back rows of the Imperial Theatre. With apologies to Hugh Jackman, his may be the best sung, best acted Valjean I've ever seen.\n\nWill Swenson (Priscilla Queen of the Desert) has never sounded better as the by-the-book Inspector Javert, who has been chasing Valjean for decades, though his performance at times edges toward the bombastic. (Directors Laurence Connor and James Powell do pull off a neat bit of movie-style stagecraft during his final ''Soliloquy.'') Swenson’s former Hair costar Caissie Levy makes a fine Fantine, following Anne Hathaway with an acting-trumps-singing approach to ''I Dreamed a Dream'' that still makes a touching impression. And Cliff Saunders and particularly Keala Settle (Hands on a Hardbody) prove hilariously bawdy scene-stealers as the shady, dog-eat-dog Thénardiers. (Watch out for the telltale chamberpot in ''Master of the House.'')\n\nThe rest of the cast is mostly solid. Andy Mientus (Smash) brings a boyish charm to the student revolutionary Marius, but vocally he's no match for the booming baritone of Kyle Scatliffe as Enjolas or the supple soprano of Samantha Hill as his blond-haired crush  and Valjean ward  Cosette. Meanwhile, the talented Nikki M. James (The Book of Mormon) seems a little lost as Marius-fixated Éponine, wandering aimlessly about the stage during her big number ''On My Own'' without ever making the song fully hers.\n\nShe should keep an eye on Karimloo from the wings. In his solos, ''Who Am I?'' and particularly ''Bring Him Home,'' not only does he inject each phrase with feeling and musicality but he fully embodies the message of the song. There’s not a gesture, not a head bob out of place. At the end of the day, he brings the most luster to this stirring revival. A-\n\n(Tickets: Telecharge.com or 800-432-7250)",
  "contentTier": "needs-rescrape"
}