{
  "showId": "les-miserables-1987",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/les-miserables-review-smartly-cast-1.7479430",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/les-miserables-review-smartly-cast-1.7479430",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "March 23, 2014 5:14 PM\n By LINDA WINER linda.winer@newsday.com\n\nadvertisement | advertise on newsday\n\nIf we need a reason for yet-another revival of \"Les Misérables\" -- and I'm afraid some of us do -- the answer reveals itself in the first scene and stays riveting until the strenuous three-hour epic's final moments.\n\nThe reason is Ramin Karimloo. This Iranian-born, Canadian-raised, rising star from London galvanizes the newly staged production with a portrayal of Jean Valjean that might cause both the Miz-weary and the Miz-averse to soften some resistance.\n\nIn fact, this smartly cast \"Les Miz,\" directed by Laurence Connor and James Powell, has clearer, tighter storytelling and less bombast than the internationally celebrated 1987 original. The new sets, without the famous turntable, are basically dark, painted flats and videos that must facilitate touring, which this production, not surprisingly, has been doing.\n\nBut nothing in this return of the Victor Hugo popera has the musty feel of the road. The chorus has been impeccably drilled and, except for a few ragged voices at the barricades, the whores, beggars and ruffians of pre-revolutionary France keep a fine balance between robust singing and acting. And speaking of real finds, Gaten Matarazzo, who played little Gavroche at the preview I saw, is a star.\n\nAnd then there is Karimloo, whose Valjean evolves from a feral, hotheaded convict into a dashing, dignified hero without a shadow of Hugh Jackman from the 2012 movie on his brow. Karimloo's voice has a rare purity and focus and, though we would expect his low tenor to strain for the stratospheric notes in \"Bring Him Home,\" he even finds the finesse and stamina to be tender in it.\n\nWill Swenson plays angry and serious without being genuinely imposing as Javert, the investigator obsessed with recapturing his nemesis. The character is not a perfect fit for this multifaceted charmer who first became a star as Berger in \"Hair.\" The songs fall a bit low for Swenson's high baritone, which limits the dramatic contrast between the voices of the two antagonists. This Javert seems too introspective to generate scary shivers throughout the decades.\n\nadvertisement | advertise on newsday\n\nOn the other evil front, however, Cliff Saunders makes an extraordinary mean elf as the innkeeper Thenardier. As his wife, Keala Settle toys impressively with the line between cruel and just horridly coarse.\n\nNikki M. James shows vast range in her a touching, street-wise Eponine, with a lush yet piercing voice. Caissie Levy makes a poignant Fantine, though she sounded a bit rough in \"I Dreamed a Dream,\" while Samantha Hill keeps the soubrette saccharine to a minimum as Valjean's ward, Cosette.\n\nFor those of us in the minority, \"Les Miz\" remains Masterpiece Musical at its most earnest, marred by cumulative bellowing and politics so fuzzy-edged that they never get beyond a generic storm-the-barricades fervor. But if we need to have \"Les Miz\" -- and obviously, we do -- I pick this one.\n\nWHERE Imperial Theatre, 249 W. 45th St.\n\nINFO $57-$147; 212-239-6200; lesmis.com/broadway\n\nBOTTOM LINE Dazzling Ramin Karimloo as Valjean in smart restaging",
  "isFullReview": true,
  "textWordCount": 511,
  "archivePath": "data/archives/reviews/les-miserables-1987/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:44:54.133Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20141103004154",
  "archiveOrgUrl": "http://web.archive.org/web/20141103004154/http://www.newsday.com/entertainment/theater/les-miserables-review-smartly-cast-1.7479430",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 511,
  "tierReason": "Full review text"
}