{
  "showId": "picnic-2013",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2013/legit/reviews/picnic-1200016436/",
  "publishDate": "January 13, 2013",
  "fullText": "This revival reduces Inge's characters to broad caricatures and finds more comedy than pathos in their lives of quiet desperation.\n\nA case might be made for reviving “Picnic,” the play that won William Inge a Pulitzer Prize in 1953 for his bittersweet portrait of mid-century American life in a small, narrow-minded Kansas town. (Something darker, perhaps, than the swoony romanticism that Joshua Logan profitably mined from the play for his 1955 movie with William Holden and Kim Novak.) But helmer Sam Gold fails to make any case at all with this clumsy production for the Roundabout, which reduces Inge’s characters to broad caricatures and finds more comedy than pathos in their lives of quiet desperation.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Don Lemon Confirmed to Speak at On Air Fest Podcast Conference After His Recent Arrest \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Spotify Paid Out a Record $11 Billion to the Music Industry in 2025\n\nThe American heartland, circa 1950s, admittedly looks mighty pretty in Andrew Lieberman’s idealized setting of a sunny backyard shared by two adjacent clapboard houses. But, like Jill BC Du Boff’s over-bright lighting, the gaudy effect is uncomfortably close to a cartoon.\n\nOne smart design feature is the generous interior of the larger house, where Flo Owens (Mare Winningham) lives with her two daughters — Madge (the pretty one woodenly played by Maggie Grace) and Millie (the smart one played in a grating voice by Madeleine Martin) — and rents out rooms to single ladies. Although the huge bulk of the house narrows the playing area, the rambling interior lends perspective depth to this crowded house bustling with women.\n\nAs he does in all his plays, Inge takes pity on these women, whose busy activities can’t disguise the essential emptiness of their lives. The postwar era may have been a boom time for the American economy, but it held out limited options for women.\n\nOlder women like Flo and her next-door neighbor Mrs. Helen Potts (the sweet-faced Ellen Burstyn) have long resigned themselves to long nights in empty beds. And if an “old maid” like Rosemary Sydney (Elizabeth Marvel, forgetting herself and spiraling over the top) fails to trap an unwary suitor like Howard Bevans (saved from becoming ridiculous by Reed Birney‘s sincerity), she’d better resign herself to the loveless life of a schoolteacher.\n\nA brainy girl like Millie has a 50-50 chance of finding a brighter life in the nearest big city (in this play, that would be Tulsa). And if a raving beauty like Madge plays her cards right, she might make a good marriage to a nice boy like Alan Seymour (played by a disinterested-looking Ben Rappaport) before her looks fade.\n\nBut the window of opportunity for young ladies is a narrow one, as Flo advises her older daughter in a moment of insight that Winningham plays with penetrating self-awareness. A pretty girl of 18 may enjoy a carefree summer. “But next summer you’ll be nineteen and then twenty and then twenty-one and then 40” — and that’s the edge of the cliff.\n\nSo long as women stick to their designated roles, the town’s patriarchal social balance is safe. Which is why the whole neighborhood is shaken up when a dangerously handsome stranger blows into town.\n\nAs drawn by Inge, Hal Carter is a natural-born hunk who is comfortable in his manhood and discomfited by the effect he has on men and women both. In Sebastian Stan’s self-conscious performance, he’s the product of a 21st-century gym with an ill-calibrated tanning room.\n\nThe hapless thesps dutifully play their designated roles in simultaneously deifying and demonizing Hal for his potent sexuality. But instead of conveying the pathos of this charismatic but lonely stranger and the smitten women who lose their inhibitions over him, the thrust of this production is to make sure that everyone looks positively ridiculous.",
  "isFullReview": true,
  "dtliExcerpt": "Sebastian Stan brings a dangerous sexuality to the role of Hal Carter, the drifter whose raw animal magnetism disrupts the lives of the women in a small Kansas town.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Sebastian Stan brings a dangerous sexuality to the role of Hal Carter, the drifter whose raw animal magnetism disrupts the lives of the women in a small Kansas town.",
  "contentTier": "complete",
  "contentTierReason": "Short text (29 words)",
  "textQuality": "full",
  "rejectedAt": "2026-02-03T21:55:48.583Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single descriptive sentence about a performance, not a complete review with evaluative content or recommendation.; openai: The text is a brief description of a character's portrayal without any evaluative content or overall assessment of the show.",
  "promptVersion": "5.2.0",
  "textWordCount": 632,
  "archivePath": "data/archives/reviews/picnic-2013/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:22:55.557Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 632,
  "tierReason": "Full review text"
}