{
  "showId": "john-proctor-is-the-villain-2025",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Johnny Oleksinski",
  "url": "https://nypost.com/2025/04/14/entertainment/john-proctor-is-the-villain-review-stranger-things-star-sadie-sink-leads-likable-long-metoo-drama/",
  "playbillVerdictUrl": "https://nypost.com/2025/04/14/entertainment/john-proctor-is-the-villain-review-stranger-things-star-sadie-sink-leads-likable-long-metoo-drama/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright"
  ],
  "showScoreExcerpt": "\"Playwright Kimberly Belflower’s often entertaining, mostly clever, frequently phony dramedy...falls into old classroom cliches\"\n\nRead more",
  "fullText": "One hour and 45 minutes, with no intermission. At the Booth Theatre, 222 West 45th Street.\n\nThe loud title of the Broadway play “John Proctor is the Villain” reads like the rare high-school essay that wasn’t written hours before it’s due.\n\nIt’s a smart and edgy thesis about “The Crucible,” if not exactly a new idea.\n\nYet playwright Kimberly Belflower’s often entertaining, mostly clever, frequently phony dramedy that opened Monday night at the Booth Theatre could have used another draft.\n\nThe promising play set in a turbulent school plateaus about halfway through after an early dropped bomb, and then falls into old classroom cliches: Girls fighting over a guy and then turning on him, a sweet boy revealing his sensitive side to audience “awww”s and a final presentation day like we’re at “Crucible Akimbo.”\n\nSay what you will about Arthur Miller’s 1953 drama — sustaining momentum is not its problem.\n\n“Villain,” starring Sadie Sink from “Stranger Things,” is set in a Georgia English class full of hormonal teens studying Miller’s Salem witch trials classic — the main character of which is the accused farmer John Proctor.\n\nTheir teacher, Mr. Smith (Gabriel Ebert, a tad too chirpy), tells them that in the writer’s allegory for Sen. Joseph McCarthy’s infamous Communist hunt, the wronged John Proctor is our hero.\n\nThen the #MeToo movement hits. A girl named Ivy’s (Maggie Kuntz) business owner dad is brought down by a female employee for wrongdoing, and another bombshell claim is hurled at an adult who works at the school.\n\nProctor, who in Miller’s play had an affair with 17-year-old “I saw Goody Proctor with the devil!” accuser Abigail and beats his worker Mary, suddenly doesn’t look so praiseworthy to Gen Z kids surrounded by bad men of all ages.\n\nStill, not every student in the tiny Southern enclave believes the purported victims. Rifts form and clashes ensue, much as in 17th Century Salem.\n\nOf course, none of the murdered villagers in Massachusetts or “The Crucible” were actually witches.\n\nBelflower’s play says the opposite while mirroring Miller’s moral certitude about his own characters’ top-to-bottom guiltlessness. She casts zero doubt on the men being investigated. They absolutely did it.\n\nThe gifted director Dayna Taymor is back to herding adolescents after last year’s thrilling gang war musical “The Outsiders.” She’s skilled with this age group, and makes dynamic use of an unchanging desks-and-dry-erase-board set.\n\nThe energy and camaraderie of her young cast helps lift slower portions in the long and intermission-less show, even if the acting sometimes leans more “Boy Meets World” than reality.\n\nEverybody is memorable, but most believable in a backpack is Fina Strazza as Beth, a whip-smart firecracker who is chummy with Mr. Smith. Strazza was last on Broadway as the lead in “Matilda,” another precocious book lover.\n\nAnd Morgan Scott is easily funny as Nell, a girl who’s just moved to town from Atlanta and is our window into this community’s peculiarities.\n\nSink, who’s amassed a huge following since starring on Netflix’s sci-fi hit, returns to Broadway for the first time in a decade as Shelby, a rebel with a cause who reemerges after months away.\n\nComing from an ensemble series about outcasts, she fits right in here, and is a confident stage actor.\n\nShelby has a strained relationship with Raeylnn (Amalia Yoo) over a boy named Lee (Hagan Oliveras). Although Yoo is moving, I didn’t buy the sit-down conversation that resolves their tiff.\n\nSpeaking of Netflix, throughout “John Proctor is the Villain,” the streamer’s wave-making miniseries “Adolescence” kept popping into my mind. That harrowing show has scarred parents worldwide by depicting the dark underbelly of modern teenage life. Its realism has been praised.\n\n“John Proctor” also deals with big, frightening issues — OK, not murder — that are relevant to young people. But more often than not, the script and production tidy them up.\n\nFor instance, Raelynn’s troubling relationship with violent Lee, the guy she’s been seeing for eight months, is choreographed to be much easier to watch than it should be.\n\nAnd as events unfold that could break a small town apart and almost certainly make national news, the characters stick to a sit-com style.\n\nThat’s the play that Belflower wanted to write, and there’s something to be said about humor and lightness keeping the audience invested. I enjoyed myself.\n\nBut while “John Proctor” is a good time, it is not a powerful one.",
  "isFullReview": true,
  "textWordCount": 732,
  "archivePath": "data/archives/reviews/john-proctor-is-the-villain-2025/nypost--johnny-oleksinski_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:45:56.308Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250415032626",
  "archiveOrgUrl": "http://web.archive.org/web/20250415032626/https://nypost.com/2025/04/14/entertainment/john-proctor-is-the-villain-review-stranger-things-star-sadie-sink-leads-likable-long-metoo-drama/",
  "contentTier": "complete",
  "wordCount": 732,
  "tierReason": "Full review text"
}