{
  "showId": "john-proctor-is-the-villain-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2025/04/14/john-proctor-is-the-villain-a-metoo-conversation-with-the-crucible/",
  "publishDate": "2025-04-14T22:59:24",
  "fullText": "As subtle as its title, Kimberly Belflower’s play set in a high school classroom feels like it should also be performed in one. The idea behind John Proctor Is the Villain, namely applying a contemporary #MeToo sensibility to a conversation with Arthur Miller’s classic 1953 play, The Crucible, is not without merit. But this frenetic effort undercuts its provocative thesis with too-obvious situations and characters, telegraphing its messages with all the subtlety of a dance-heavy pop song. The play is geared to younger audiences, who, based on the wildly enthusiastic reactions at a recent preview performance, are clearly eating it up. It’s not surprising that it was extensively workshopped at college theater departments; on Broadway, it just seems juvenile.\n\nSet in 2018 in “the only high school in a one-stoplight town, northeast Georgia,” the play revolves around a class consisting of five girls and two boys, shepherded by their highly enthusiastic teacher Mr. Smith (Gabriel Ebert, outstanding as usual). “He’s like the teacher in an inspirational movie,” one of the girls gushes. Her admiration seems apt, since he’s the sort of charismatic instructor who says, with all sincerity, “I think it’s a gift that we get to study material like this.”\n\nThe material he’s referring to is Miller’s play, an allegory for McCarthyism whose central figure Mr. Smith refers to as “one of the best characters ever!” But it doesn’t take long for the girls, who have just formed a feminism club for which Mr. Smith happily signs onto as a sponsor, to figure out that his assessment is flawed. After all, the married Proctor did have an affair with Abigail, the teenage girl who worked for him, in what was clearly a power imbalance.\n\nThat Mr. Smith is eventually revealed to be, to put it mildly, a morally flawed figure himself, comes as no surprise. Indeed, almost none of the male figures in the play proves anything other than a sexual abuser, from the student (Hagan Oliveras) who forcibly kisses his longtime girlfriend (Amalia Yoo) to whom he’s been unfaithful and then throws a desk across the room when she makes him stop, to the (unseen) father of one of the girls, who gives “weird massages” to them during sleepovers and who’s now accused of various other indiscretions.\n\nOne of the students, Shelby (played by the production’s marquee star Sadie Sink, of Netflix’s Stranger Things and the Taylor Swift-directed music video All Too Well) has just returned after a lengthy “sabbatical” in Atlanta (cue the obligatory “You’re not Jewish” joke). She’s the play’s contemporary version of Abigail, complete with an allegation that precipitates the denouement.\n\nPlaywright Belflower reveals an obvious affinity for her teenage characters, from their natural-sounding dialogue to the name-dropping of such pop cultural touchstones as Twilight, Billie Eilish and Harry Styles. Taylor Swift provides the lyrical mic drop when one of the girls breaks up with her boyfriend, and Lorde’s song “Green Light” figures prominently in the show’s finale.\n\nThat finale, featuring an interlude of frenzied “interpretive dancing,” gets a tremendous reaction from the audience, and it’s certainly effective in a visceral if cheap way. The same can also be said for much of the play which eventually reveals Mr. Smith to be a loathsome figure who, judging by a very effective scene toward the end, will clearly not be changing his malicious ways.\n\nDirector Danya Taymor stages the proceedings with the same flash as she did The Outsiders, for better or worse. One example of her lack of subtlety comes with a scene in which a male student asks one of his classmates if she’ll go out with him, to which she agrees. In the script, she merely smiles after he leaves the room. In this production, she also does a silly, Snoopy-style happy dance.\n\nThe young performers — who also include Nihar Duvvuri, Maggie Kuntz, Morgan Scott, and Fina Strazza — are all fine, with Sink the standout as the flashiest and most troubled of the students. Molly Griggs delivers an appealing turn as the young counselor trying to protect them, while Ebert expertly displays the charm necessary to mask his character’s predatory behavior.\n\nThe Playbill cover for John Proctor Is the Villain conveys it perfectly. It features several of the young characters in a circle while appearing to be screaming their heads off. That’s exactly how you’ll feel after enduring this well-meaning but exhausting play.\n\nJohn Proctor Is the Villain opened April 14, 2025 at the Booth Theatre and runs through July 6. Tickets and information: johnproctoristhevillain.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
