{
  "showId": "john-proctor-is-the-villain-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2025/04/14/john-proctor-is-the-villain-a-fearless-gen-z-look-at-the-crucible/",
  "publishDate": "2025-04-14T23:00:05",
  "fullText": "We talk a lot about how to get young people to the theater. More targeted marketing, savvier social media, lower ticket prices: yes, yes, and a thousand times yes. Cast a popular young actor from a hit TV series—a tried and true tactic. But the best, and not always the easiest, way: Make it about them.\n\nFor proof, look no further than Broadway’s Booth Theatre, and the young audience captivated by Kimberly Belflower’s whip-smart, bitingly funny John Proctor Is the Villain. To paraphrase a movie (Field of Dreams) that’s older than most of the actors onstage, build it, and they will come.\n\nSet in rural Georgia in 2018—the height of the #MeToo movement—John Proctor centers on a curious, forward-thinking group of 16- and 17-year-old girls, plus a couple boys, studying The Crucible with everyone’s favorite teacher, Mr. Smith (Gabriel Ebert). After school, the girls are trying to start a feminism club, a group that can “spread awareness, foster dialogue, and ignite change,” explains the super-driven Beth (Fina Strazza). When the administration rejects the group’s proposal, Mr. Smith, thankfully, swoops in and saves the day. “He’s like the teacher in an inspirational movie,” gushes Nell (Morgan Scott), a newcomer from Atlanta. “He’s like the only adult I know who doesn’t treat us like elementary schoolers,” adds Ivy (Maggie Kuntz). After debating their teacher’s hotness—they are high schoolers, after all—the club members move on to other topics of great concern: Twilight, Taylor Swift (“There is a LOT to unpack!” insists Beth), and guys. Raelynn (Amalia Yoo, marvelous) asks the question on everyone’s minds: “We can be obsessed with guys and still be feminists, right?” But can they still be feminists and stand by Ivy when her dad is hit with an accusation from a former secretary?\n\n“Lately we’ve heard the term ‘witch hunt’ a lot. People love to use that phrase, right? Its usage has definitely become more casual over time,” says Mr. Smith, giving some background to The Crucible. (We can thank Woody Allen for dusting off the term in 2017 in a poor attempt to defend Harvey Weinstein.) “My dad said this whole thing feels like a witch hunt,” says Ivy. Clearly the girls’ deep dive into Arthur Miller’s play is going to be destabilizing—even more so owing to the surprise reappearance of Shelby (Stranger Things star Sadie Sink, sensational), back in school after a mysterious rumor-plagued months-long absence. When she starts reading the role of the manipulative “whore” Abigail, it quickly becomes clear that there’s a John Proctor—an adulterer in the guise of an upright, honest man—in our midst.\n\nBut this play, which premiered at Washington, D.C.’s Studio Theatre in 2022, isn’t about John Proctor, or even Belflower’s version of John Proctor. It’s about the incredible female friend group: Raelynn, who’s finally finding her voice and style now that she’s rid of her cheating ex, Lee (Hagan Oliveras); Ivy, who’s carrying more emotional weight than any 17-year-old is built to carry; Nell, smart enough take one look at Lee and know he’s not worth a second; Shelby, whose friendship with Raelynn is, fortunately, strong enough to survive her thing with Lee; the anxious, always overprepared Beth, described in the script as “kind of like if Rory Gilmore and Paris Geller had a baby and raised her in the Deep South” (+10 for the Gilmore Girls reference). Belflower and Tony-winning director Danya Taymor (The Outsiders) capture so many Polaroid-perfect moments, such as Raelynn and Shelby’s giggle fit, which moves from nervous laughter to stomach-clenching howls and back again. (And if you think that scene should be trimmed, it’s been far too long since you found yourself ROFL with your best friend.).\n\nYou might also notice that all these teenagers talk, you know, like actual teenagers. “Okay, sorry—” “Yeah, no…” “I mean—” All those interjections? The inflection rising so sentences sound like questions? Also, they sometimes talk in circles when they’re trying to form their thoughts; “okay but wait I have a point, I swear,” Shelby says, as she’s leading up to her “John Proctor is clearly the villain” declaration. Belflower is a master of teen-speak.\n\nAnd though these kids are smart as heck—holding forth on The Great Gatsby, Joan Didion, and Chimamanda Ngozi Adichie—they’re just as quick to quote their pop-culture heroes Beyoncé and Taylor Swift. (Who remembers Sink in the short film version of Taylor Swift’s All Too Well?) Related: Don’t miss the epic pre-show playlist on the show’s website, 13 power-pop anthems from the aforementioned artists, plus Rihanna, Selena Gomez, Florence & The Machine, Janelle Monáe, and more. All the music isn’t confined to the pre-show, though. Lorde’s bouncy breakup song “Green Light” plays a major part in Raelynn and Shelby’s final literature project, an imagined conversation between two Crucible characters that morphs into their own version of a dance in the woods. It’s as kooky, joyful, and unsettling as you might think, and more ecstatic, cleansing, and liberating than you could ever imagine. That’s the scene that will live rent-free in your head.\n\nJohn Proctor Is the Villain opened April 14, 2025, at the Booth Theatre, and runs through July 6. Tickets and information: johnproctoristhevillain.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars"
}
