{
  "showId": "is-this-a-room-2021",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/entertainment/broadway/ny-chris-jones-is-this-a-room-broadway-review-20211012-b3jh6m273bakpmwza7ydgd7icu-story.html",
  "playbillVerdictUrl": "https://www.nydailynews.com/entertainment/broadway/ny-chris-jones-is-this-a-room-broadway-review-20211012-b3jh6m273bakpmwza7ydgd7icu-story.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Podcasts are thriving and documentaries have been a pandemic staple. Can Broadway get into that act?\n\nTwo shows at the Lyceum Theatre are trying. Opening next week is “Dana H,” a drama by Lucas Hnath based on the experience of his mother, Dana Higginbotham. While Hnath was at New York University, his mom was kidnapped and sexually assaulted by a member of the Aryan Brotherhood (a man she knew), for five months.\n\nThe play (which features the actress Deirdre O’Connell) is made up of a recorded transcript of Higginbotham’s Stockholm syndrome story, as lip-synched by O’Connell. At director Les Waters’ production’s first outing in pre-pandemic Chicago, the performance was a stunner.\n\nBut first on Broadway comes another show based on a fact-based text: Tina Satter’s “Is This a Room” uses not a personal narrative but an FBI transcript.\n\nThe play is based on the case of Reality Winner, a 25-year-old former translator for a National Security Agency contractor who was convicted in 2018 of the felonious act of printing out a report that detailed hacking attacks by a Russian intelligence service against the American electoral process, otherwise known as democracy itself.\n\nShe told investigators that she smuggled the report out of her Georgia office in her pantyhose. It then went to The Intercept, an investigative news organization. She had no previous criminal record and was a former member of the military.\n\nGiven the subsequent history, you might well argue that Winner should be getting a medal on a podium, not languishing in jail. Watch Satter’s piece and you certainly intuit that was her view of Winner’s situation.\n\nBut the show doesn’t try to rewrite history or plead Winner’s case. It just stages what happened when the FBI showed up at her home in Augusta, Ga., to investigate, and lets the audience take it from there.\n\nIt’s a fascinating piece in every way, replete with fabulous central performances from both Emily Davis (who plays Winner) and Pete Simpson (who plays the lead FBI agent at the interrogation). You’re left with a picture of a young woman of conscience who was hardly prepared for such heavy-handed government intervention (Becca Blackwell and Will Combs play the other two agents).\n\nInterrogations are, of course, strange mixes of fact-finding and psychological pressuring. They’re both cold and perversely intimate; conversational and profoundly dangerous to the subject. Winner has no attorney present for the events taking place here, offering a confirmation of the truth that it rarely is in the interests of anyone accused of a crime to talk to the police.\n\nThis is, after all, an example of a theoretically democratic government sending one of its own citizens to jail because it wanted to protect its secrets. The transcript fails to make any kind of case that this was, in any way, fair or reasonable. We know a lot more about the dangers of hacking into the electoral process than we did in 2018; “Is This a Room” argues tacitly that Winner is a prime candidate for a commuted sentence.\n\nOne last note: “Is This a Room,” which is very much in conversation with “Dana H,” lasts just an hour or so. It would have offered better value for the theatergoer, and more artistic resonance, if both shows had landed on the same single bill.",
  "isFullReview": true,
  "textWordCount": 549,
  "archivePath": "data/archives/reviews/is-this-a-room-2021/nydailynews--chris-jones_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:33:26.444Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 549,
  "tierReason": "Full review text"
}