{
  "showId": "is-this-a-room-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2021/10/11/is-this-a-room-reality-winner-speaks-her-truth/",
  "publishDate": "2021-10-11T20:50:14",
  "fullText": "Fascination and frustration.\n\nThose are the emotions likely to overwhelm you as you leave Is This A Room, the brief but gripping dramatization of the 2017 FBI interrogation of Reality Leigh Winner, at Broadway’s Lyceum Theatre.\n\nFascination because of who she is—and yes, Reality Winner is her given name—and what she did: a 25-year-old Air Force intelligence specialist who trained as a linguist; she’s fluent in Farsi, Dari, and Pashto. Then working as an NSA intelligence contractor in Augusta, Ga., she’s accused of sending a classified document that proved Russian interference in the 2016 presidential election to the online news outlet The Intercept. And frustration because of the result: She was charged under the Espionage Act of 1917, later pleaded guilty, and ultimately received 63 months in a federal prison—the longest ever sentence for such an offense (the government was initially seeking 10 years). You might remember reading snippets of those memos from former FBI director James Comey where he bragged that he was “eager to find leakers” and talked about “putting a head on a pike.” Behold: the head.\n\nConceived and directed by Tina Satter, Is This A Room—which arrives on Broadway after a successful late 2019 run at off-Broadway’s Vineyard Theatre (Room runs in rep at the Lyceum with another Vineyard hit, Dana H.)—takes its dialogue, word for word, from the official FBI transcript. What, you don’t think a couple of cops interviewing a suspect for an hour makes for captivating stuff? You must not have seen a single episode (or 457 episodes) of Law & Order.\n\nOf course, the FBI agents who show up to “talk” with Reality Winner (played by Emily Davis, with just the right mix of intensity, self-deprecation, vulnerability, and strength)—Agent Garrick (Pete Simpson) and Agent Taylor (Will Cobbs), plus another, identified only as Unknown Male (Becca Blackwell)—aren’t nearly as smooth as the law enforcement officers you see on L&O, FBI, CSI, NCIS, or any other TV procedural. “What’s the, uh. How do we open this?” asks Taylor, staring at Reality’s smartphone. And a minute or so later: “How do we—how do we do it? Show me how to do it, or tell me how to do it.” Garrick cracks lame jokes. They all bond over CrossFit, one of Reality’s passions, along with competitive powerlifting. They display what’s probably genuine concern for Reality’s cat and rescue dog. The agents do everything possible to establish a casual, seemingly friendly rapport with her. (On stage we see only three agents; there were actually nearly a dozen at her home on June 3, 2017.)\n\n“And of course, you-completely voluntary to talk to me,” says Garrick. But is it? Especially when they ask her if there’s a room where they can talk and she describes it thus: “Oh gosh, it’s just creepy. It’s just weird. It’s like an addition to the house behind the kitchen and it’s always dirty and…” Garrick agrees just a little too quickly: “Okay. Uh, we can talk back there if you’re fine going back there.”\n\nSatter’s staging ratchets up the tension slowly, subtly. Note how Garrick creeps behind Reality’s shoulder, then inches closer and closer to her face. He throws around the word “voluntary,” but could Reality simply have left? Everything about the situation—including the redactions in the transcript, which are punctuated by blistering sounds and stark lighting shifts—screams pressure; it’s no wonder she eventually comes clean. (Side note: This is an argument for the lawyers, which she did not have. But the fact that her confession, which came before she was read her rights, was admissible is mind-boggling. If Briscoe and Logan had pulled this stunt with a perp on Law & Order, McCoy wouldn’t have gotten the confession past any judge in New York.)\n\nAnd this is perhaps the most fascinating—and frustrating—part of all: Is This A Room might be the only time we get to hear Reality Winner’s story. Though in June 2021 she was released from prison for good behavior, barring a presidential pardon (which her family is seeking) the terms of her plea agreement prevent her from ever discussing…pretty much any of this. Thankfully, for now, she can (sort of) speak for herself in Is This a Room.\n\nIs This A Room opened October 11, 2021, and runs through November 27, at the Lyceum Theatre. Tickets and information: thelyceumplays.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
