{
  "showId": "is-this-a-room-2021",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Elizabeth Foster",
  "url": "https://www.newyorktheatreguide.com/reviews/review-of-is-this-a-room-at-vineyard-theatre",
  "publishDate": null,
  "fullText": "In a rare instance, an FBI transcript was declassified. Tina Satter, who conceived and directed Is This A Room, now playing at the Vineyard Theatre, immediately realized the value of this unique moment of history and transparency in any administration. Verbatim for 70 minutes the transcript of Reality Winner (Emily Davis) being arrested by the FBI is reenacted. Every stutter, um, cough is captured on a bare stage. Although 11 agents descended on Winner's home only three are depicted in the play - which seem three too many as they corner and intimidate their target - Winner. When the agents ask her if there is anything in her office which they should be concerned about she quips, there is a picture of Cooper Andersen with a fake signature. Davis' performance is masterful. At one point realizing she has been cornered by the agents, she looks down at her sneakers visibly upset, a stream of clear mucus flows from her nose and she is forced to contend with wiping it with her hand. A powerful emotional moment. We witness an idealistic young girl turning into an adult and facing - reality. This is a noncustodial interrogation by the FBI. They act \"exceedingly\" friendly, so Miranda rights need not be read. They were careful not to detain or restrict Winner in any way. Through small talk about pets and hobbies, the FBI extract a confession. Winner lies, denying everything and then comes clean. The agents are well informed and highly skilled at their craft to catch. Winner is a complex protagonist who Satter wants us to know. In the lobby and entry to the theatre, there are pictures of Winner. Take the time to meet and get to know her. President Donald J. Trump tweeted \"Ex-NSA contractor to spend 63 months in jail over \"classified\" information. Gee, this is \"small potatoes\" compared to what Hillary Clinton did! So unfair Jeff (Sessions), double standard.\" When Winner heard of the tweet she was overcome with hope. She plans to ask the president for clemency commenting \"I just feel like I would really get along with our president,\" she said. \"He's about a year older than my late father would be. Both grew up in New York and both are conservative. Both watch Fox News every day. And we both like diet coke. It's a match made in heaven,\" The Atlanta Journal-Constitution reported. Not so quickly. There is still a missing thumb drive to contend with as in the Snowden case. Winner also used 4 cell phones and multiple sim cards making calls near impossible to track. She accessed the dark web avoiding a trace. There seems to be more to the story than one classified article about Russian election interference - or is there? If you were only going to go to one play the rest of the year make it this one. The issues raised are too important not to be a part of the conversation. Remember as we discuss and analyze events, Winner is doing the same behind bars. There are always two tracks being played, one in the mind of Winner and that which she exposes through careful semantics. \"At 70 minutes, Is This A Room begs for context, and that post-theater flier isn't enough. Satter needs a first or second act to run with this staged transcript. What she needs is a playwright.\"Robert Hofler for The Wrap Originally published on Jan 25, 202214:46",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"If you were only going to go to one play the rest of the year make it this one. The issues raised are too important not to be a part of the conversation.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 573,
  "archivePath": "data/archives/reviews/is-this-a-room-2021/nytg--elizabeth-foster_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:55:44.594Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 573,
  "tierReason": "Full review text"
}