{
  "showId": "is-this-a-room-2021",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2021/legit/reviews/is-this-a-room-review-broadway-1235098406/",
  "publishDate": "October 18, 2021",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "The show is a riveting 65-minute experience that transforms a verbatim FBI interrogation transcript into gripping theater that feels both documentary-real and mysteriously theatrical.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The show is a riveting 65-minute experience that transforms a verbatim FBI interrogation transcript into gripping theater that feels both documentary-real and mysteriously theatrical.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 554,
  "archivePath": "data/archives/reviews/is-this-a-room-2021/variety--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:00:38.159Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (507): Request failed with status code 507"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "showNotMentioned": true,
  "wrongFullText": "Controversial Malaysian singer-songwriter Namewee, who has been accused of insulting China and Chinese people with his recent viral hit ballad \"Fragile,\" and advocating independence for Hong Kong and Taiwan, says that those were not his intentions. But on Tuesday he said that he has no regret in releasing a song that got him banished from the Middle Kingdom.\n\nThe latest furor follows the release of his \"Fragile,\" a Mandarin-language song featuring Australian Chinese singer Kimberley Chen. A catchy romantic tune that with lyrics about breaking a fragile heart, the song is full of symbols, idioms and metaphors that can also be seen as mocking and criticizing the \"little pinks,\" China's volunteer army of angry digital warriors who have formed a core element in China's cyber nationalism, and who are highly sensitive to any criticism of the country's leader Xi Jinping.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Eric Dane Drops Out of Awards Gala 'Due to the Physical Realities of ALS' \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Sharon Stone Makes 'Euphoria' Season 3 Debut in First Look at Her Studio Boss Role: 'She Runs the Show'\n\n\"I am [ethnically] Chinese. Am I insulting myself?\" said Namewee (real name Wee Meng Chee) in a statement published on his Instagram account.\n\nNamewee said he is a lover of Chinese culture and that he has traveled the country as a backpacker over the years. He said he has nothing against Chinese people and claims respect for many friends in China.\n\"I do not want to go to China because there is too much censorship and restrictions, and I'm afraid that it will affect my creativity and my work. I do not want to lose the original intent of my creations. That's all,\" said the 38-year-old.\n\nBorn in Muar, Johor, Malaysia in 1983, Namewee has a long track record as a controversial figure in his Muslim-majority home country. The rapper has been arrested and detained multiple times because his songs and music videos have been deemed insulting to other religions and races.\n\nThe latest music video is saturated with pink objects, decorations and costumes. It involves a dancing panda and stuffed toys in the shape of bats, tweaking Chinese sensitivities over the origin of the COVID-19 coronavirus.\n\nAfter debuting on YouTube on Oct. 15, the video has garnered millions of views and has been trending in Chinese-speaking regions such as Hong Kong, Taiwan, Malaysia and Singapore. As of Tuesday, the music video has accumulated more than 17.6 million views.\n\nThe song was applauded by fans for its sense of humor and honesty, but quickly got Namewee and Chen banned in China. Just days after the song was released, their Weibo accounts—China's equivalent of Twitter—were blocked by Chinese censors. Namewee was then accused of insulting China and Chinese people and of promoting Hong Kong and Taiwan independence.\n\n\"I have never said anything [about Hong Kong and Taiwan independence]. If you don't believe me, you can do a search,\" Namewee said. \"Regarding this question, you should ask the people of Hong Kong and Taiwan what they think. My nationality is Malaysian. I cannot speak on their behalf.\"\n\n\"But I will definitely stand with freedom and democracy. The human rights that we were born with are universal values, and that is what [I am] after as a Malaysian. This is why people take to the street to protest over and over again.\"",
  "_showNotMentionedDiscoveryAttempted": true
}
