{
  "showId": "burn-this-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2019/04/16/burn-this-1987-dramatic-firecracker-no-longer-pops/",
  "publishDate": "2019-04-16T21:25:27",
  "fullText": "Lanford Wilson’s Burn This caused a stir when it arrived on Broadway in the fall of 1987, buoyed by a Tony Award-winning performance by the leading lady and an electrifying one by the leading man. This combination was enough to secure a full year’s run, even though the play itself did not stand out in a season dominated by M. Butterfly and Speed-the-Plow.\n\nThirty years later, a Broadway revival of the play was announced as the opening attraction of the newly restored Hudson Theatre on West 44th Street, with movie star Jake Gyllenhaal as the main attraction. Plans were ultimately scuttled and the project scrapped (with Gyllenhaal opening the Hudson in an altogether different production, Sunday in the Park with George).\n\nAfter two years, the revival has finally opened at the same theater but with a different star and different producers; the director behind the project, Michael Mayer (of Spring Awakening), remains. What is revealed is a facile but overdrawn comedy-drama which is highly entertaining much of the time, with too much of that time spent on wild theatrics and glib characters cracking wise.\n\nThe setup is familiar to anyone accustomed to Hollywood: attractive woman (Keri Russell) with on-again/off-again good-guy suitor (David Furr) meets the altogether wrong man (Adam Driver) and, yes, you know what happens. They even have a contemporary (circa 1987) Thelma Ritter character, in this place not a housekeeper but a very-much gay roommate (Brandon Uranowitz) seemingly drawn explicitly for laughs.\n\nThe curtain rises on deftly-paced dialogue with deeply humorous colors, despite funereal subject matter. This turns into a three-way, try-to-guess-the-connections light comedy until the door is more or less beaten in by a zombie from outer space. Or rather, a blue-collar Neanderthal jerk from New Jersey, who from his first roar and grumble is clearly gonna be the Guy who Gets the Girl. This turns out to be a fiery mismatched romance. The play is called Burn This, with fire references in the smoldering relationship and even the staging.\n\nThe entrance of the character Pale—who turns out to be, if you follow this, the older brother of the girl’s deceased gay-dancer-soulmate and roommate to both the girl and the resident jokemeister—sets the play spinning, as it is clearly intended to do. But Mr. Driver, who is a stage and screen actor of some repute, is left—well, spinning. As he careens from brutish to tender to comic buffoon, you might well sit there wondering: what?\n\nAt least, I did. Not having seen nor read Burn This, and not recalling the original casting, I thought: This play cannot convincingly work without an actor who can make sense of Pale, and where are you going to find someone who can do that? Which set me on the internet during intermission, where I found a satisfactory and thoroughly explanatory answer: the role was originated by, and seemingly written to order for, John Malkovich. Who at that time was an undeniably talented and undeniably eccentric actor destined for stardom. This arrived on screen the very next year, when he left Burn This after six months to star opposite Glenn Close in Dangerous Liaisons, and we have never seen him on Broadway since.\n\nNow, it is unprofitable and perhaps unfair to judge a new revival against a performance last seen three decades back. But when we consider that this role was created by Malkovich, it suddenly illuminates Driver’s all-but-impossible task. Malkovich had directed notable productions of Wilson’s Balm in Gilead at Steppenwolf in 1980 and 1984 (the latter of which, with Laurie Metcalf and Gary Sinise in the cast, transferred to a successful New York run), so the playwright was personally familiar with him when he wrote Burn This.\n\nWith an actor like Malkovich blustering around the stage engaging in wild rage mixed with instant transitions into wild comedy and even unexpected tenderness, Burn This might well work; not so much dramatically, but as entertainment. What we get at the Hudson is a Pale who does not quite connect with his character, from scene to scene, and who therefore cannot be expected to have chemistry with his counterpart. Russell—best known for her long-running role on The Americans—acquits herself well in her Broadway debut, but can’t quite counterbalance her scene-companion’s histrionics as well as Joan Allen presumably did back in 1987.\n\nThe cast is rounded out by Furr (a Tony nominee for the 2016 revival of Noises Off), who is charming enough as the rich screenwriter the girl can’t quite commit herself to; and Uranowitz, a bundle of ethnic energy who has brightened five shows in four seasons and does so once again, stereotype or no. Derek McLane gives us one of those sets—a sparsely furnished downtown loft—that you’d just like to move into on Monday. Clint Ramos takes every opportunity to make his costumes add to our enjoyment, while Natasha Katz provides her usual expert lighting.\n\nMayer stages the play efficiently, under the circumstances. What the play needs, it seems, is the severe editing and trimming that you can’t easily accomplish with a revival of a play by a deceased playwright. One gets the sense, in numerous instances, of conversations prolonged to allow the author more jokes. Said jokes are often colorful, mind you; and frequently, in the hands of Mr. Uranowitz, sharp. But they are not helpful to the play.\n\nWilson (1937-2011) created Burn This in collaboration with Marshall Mason, his longtime director and the co-founder of the Circle Rep producing organization, which originated the play. Their earlier collaboration, the 1980 Pulitzer-winner Talley’s Folly, was notable for its brevity; one of the two characters actually comes out at the beginning and tells us that the play will take 97 minutes, which it does. Burn This, at the Hudson, runs 2:30 and feels it.\n\nBurn This opened April 16, 2019, at the Hudson Theatre and runs through July 14. Tickets and information: burnthisplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-reviews"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://nystagereview.com/2019/04/16/burn-this-1987-dramatic-firecracker-no-longer-pops/",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "After two years, the revival has finally opened at the same theater but with a different star and different producers; the director behind the project, Michael Mayer (of Spring Awakening), remains. What is revealed is a facile but overdrawn comedy-drama which is highly entertaining much of the time, with too much of that time spent on wild theatrics and glib characters cracking wise.",
  "bwwScore": 6
}
