{
  "showId": "burn-this-2019",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2019/04/16/theater/burn-this-review-adam-driver-keri-russell.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup",
    "playbill-verdict"
  ],
  "bwwExcerpt": "But this 'Burn This,' which is steeped in the rich compassion for the lonely and lost that is the hallmark of works by Mr. Wilson (1937-2011), only rarely stirs the heart. In the ideal production, it creates the sense of fire meeting fire in a folie à deux between two ill-matched yet inexorably bound lovers. What we have in this case is a one-man conflagration.",
  "bwwScore": 7,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-BURN-THIS-Opens-On-Broadway-Starring-Keri-Russell-And-Adam-Driver-20190416",
  "fullText": "https://www.nytimes.com/2019/04/16/theater/burn-this-review-adam-driver-keri-russell.htmlShare full article29Advertisement\n\nAdam Driver is a great disrupter.\n\nThis volcanic actor’s entrance in the lopsided new revival of Lanford Wilson’s “Burn This,” which opened on Tuesday at the Hudson Theater, is prefaced by a fanfare of violent pounding. It is 5 a.m., in a loft in Lower Manhattan. And it sounds as if the Incredible Hulk, feeling very impatient, is in the hallway — or maybe a runaway cyclone.\n\nWhen the door opens, what is revealed behind it does not disappoint. With long, flailing limbs and a face molten with anguish, Mr. Driver explodes into view with an outsize fury that makes everyone and everything around him seem Lilliputian. And a production that has so far felt pleasant and prosaic is flooded with the anarchy of life in extremis.\n\nThe last time I can recall such an impressively violent Broadway entrance was more than 30 years ago, when a rising actor named John Malkovich appeared in the same part. Playing a coked-to-the-gills restaurant manager named Pale, Mr. Malkovich seemed to morph overnight from quirky character actor into a leading man of dangerous sex appeal.\n\nTheater lovers still talk about the excitement of that performance. And I would wager that decades from now, people will be speaking with the same gratified wonder of Mr. Driver’s very different but equally compelling Pale.\n\nThough he has appeared on Broadway before, it has been in supporting roles in period British dramas — “Mrs. Warren’s Profession” (2010) and “Man and Boy” (2011) — that fitted him like genteel straitjackets. With “Burn This,” directed by Michael Mayer and co-starring Keri Russell, he is finally allowed to unfurl onstage the distinctive energy and insight that have characterized his subsequent performances in film (the current “Star Wars” series) and television (HBO’s “Girls”).\n\nThat unleashed force is plied most artfully here to create a portrait of how grief unhinges, disarranges and heightens everyday life. Set in the late 1980s, “Burn This” assesses the impact of the death of a young dancer named Robbie, Pale’s brother, in a boating accident.\n\nThe tragedy brings Robbie’s roommates, Anna (Ms. Russell, in the part for which Joan Allen won a Tony in 1988) and Larry (Brandon Uranowitz), as well Anna’s boyfriend, Burton (David Furr), into contact with someone they might otherwise never have met. That’s Pale, a product of working-class New Jersey who has had little recent contact with the much younger, artistic-minded and gay Robbie.\n\n[Adam Driver and Keri Russell on the appeal of ‘Burn This.’]\n\nThe play begins shortly after Robbie’s funeral. Anna, who has recently made the transition from dancing to choreography, has returned to their apartment, a loft space as open as a dance studio and as lonely as a desert. (Derek McLane designed the set, lighted with a brooding clarity by Natasha Katz.) Having just met Robbie’s family for the first time, she’s marveling at how she could have known so little about someone she thought she knew so well.\n\nThe opacity of people — even to themselves — is a leitmotif in “Burn This.” So is the hunger to reach beyond the ordinary, to see and feel on an epic scale. Burton, a rich-boy screenwriter, and Anna speak of creating work that wrests them from the rut of what they’ve always done. They need, in Burton’s words, “to reach for the sun.”\n\nAs embodied by Mr. Driver, Pale isn’t reaching for the sun; he’s a solar entity unto himself. You believe him when he says his normal body temperature is about 110 degrees and that “I got like a toaster oven that I carry around in my belly someplace.”\n\nAddled with drug and drink, rabid with grief and guilt, Pale arrives — in the play’s second scene, to collect his brother’s belongings — as a flesh-and-blood example of life lived large. He’s an alien in the civilized Bohemia of the others.\n\nHe’s even an alien to himself, wrestling in exasperation with his own body, which registers emotions as physical pain, and the Armani-style duds he always wears. (Clint Ramos did the era-appropriate costumes.) Even more than Mr. Malkovich did, Mr. Driver makes us aware that real grandeur doesn’t always come in the expected, esthetically pleasing packages.\n\nIf Mr. Driver bestrides “Burn This” like a colossus — could he really be only 6-foot-2, as Wikipedia has it? — everyone else seems to shrink beneath his shadow when he’s onstage. You could argue that this is appropriate.\n\nBut earlier productions — including the 2002 Signature Theater revival, which starred Edward Norton and Catherine Keener — made it clear that this drama is indeed a “pas de quatre,” to use the language of dance, about the distance among people. In Mr. Mayer’s version, the play might be titled “Waiting for Pale.”\n\nThis is partly because Ms. Russell, a first-rate television actress (“The Americans”), never seems in any way undone — not by sorrow, not by creative frustration and not by her character’s gravitational attraction to Pale, with whom she falls into bed almost immediately. She tells Pale that he scares her.\n\nYet despite her physical daintiness in comparison to Mr. Driver’s looming heft, her Anna always seems in charge, like a nanny with an unruly, overgrown toddler. To borrow from Lady Gaga, Ms. Russell’s performance remains comfortably “in the shallow,” instead of in the deep end into which Anna is plunged.\n\nWhen she deftly swaps chummy barbs with Mr. Uranowitz — who ably fills the now shopworn role of the sardonic but ultimately wise and caring gay confidant — “Burn This” can feel like a dry run for the long-lived TV series “Will and Grace.” And the most intriguing erotic chemistry here isn’t between Pale and Anna, but between Larry and Mr. Furr’s straight (and very good) Burton.\n\nI hasten to add that Mr. Driver isn’t grandstanding at the expense of the rest of the cast. Part of the pleasure of watching him comes from seeing how this overwrought lug relates so awkwardly and unnaturally to others. When he kisses Anna goodbye, it’s with the stiffness of a little boy unaccustomed to displays of affection.\n\nBut this “Burn This,” which is steeped in the rich compassion for the lonely and lost that is the hallmark of works by Mr. Wilson (1937-2011), only rarely stirs the heart. In the ideal production, it creates the sense of fire meeting fire in a folie à deux between two ill-matched yet inexorably bound lovers. What we have in this case is a one-man conflagration.\n\n29Share full article29Advertisement",
  "isFullReview": true,
  "textWordCount": 1084,
  "archivePath": "data/archives/reviews/burn-this-2019/nytimes--ben-brantley_2026-02-05.html",
  "textFetchedAt": "2026-02-05T01:32:47.184Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240918185056",
  "archiveOrgUrl": "http://web.archive.org/web/20240918185056/https://www.nytimes.com/2019/04/16/theater/burn-this-review-adam-driver-keri-russell.html",
  "duplicateTextOf": "nytimes--jesse-green.json",
  "wordCount": 1084,
  "tierReason": "Full review text",
  "playbillVerdictUrl": "https://www.nytimes.com/2019/04/16/theater/burn-this-review-adam-driver-keri-russell.html"
}
