{
  "showId": "burn-this-2019",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Fran Rizzo",
  "url": "https://variety.com/2019/legit/reviews/burn-this-review-adam-driver-keri-russell-1203190254/",
  "playbillVerdictUrl": "https://variety.com/2019/legit/reviews/burn-this-review-adam-driver-keri-russell-1203190254/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "duplicateOf": "variety--frank-rizzo.json",
  "fullText": "Two compelling star makes sparks in a passionate dance of denial and discovery.\n\nThe ache for an absent artist permeates Lanford Wilson's \"Burn This,\" now receiving a finely-tuned Broadway revival that features incendiary performances by Adam Driver and Keri Russell, playing two lost souls in a powerful and passionate dance of denial.\n\nAIDS is never mentioned in this 1987 play, yet the epidemic and the profound grief that it caused is deeply embedded in its DNA. The pain of loss and the need for connection — even between unlikely lovers — is at the heart of this odd but appealing play, part shiva and part romcom.\n\nThough the cause of death for the play's brilliant dancer Robbie is a freak boating accident, the mourning for bright lives taken prematurely resonates strongly with the epidemic that gripped New York in the era the play was written. The effect Robbie's death (and the death of his lover Dom) has on Anna (Russell), his roommate and dance partner, and on Robbie's older, working-class brother Jimmy, nicknamed Pale (Driver) — who bears a striking resemblance to his sibling – cuts to their cores, immobilizing their actions and numbing their hearts. She's lost her muse and he's lost his way.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Charlie's Angels' 50th Anniversary Reunion, 'Pluribus,' 'Scrubs' Added to 2026 PaleyFest LA as Full Schedule Is Announced \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Jodie Foster, Chelsea Clinton and Ava DuVernay to Speak at the Making Their Mark Foundation Women's History Month Symposium (EXCLUSIVE)\n\nAlso affected by the deaths are Anna and Robbie's gay roomate, Larry (Brandon Uranowitz), a former dancer who now works unhappily as a graphic designer in an ad agency, and Anna's lover, Burton (David Furr), a successful sci-fi screenwriter who yearns to write something more meaningful. Robbie's death has shaken all of them.\n\nAt the play's start, Anna has hit an emotional and creative wall, still stunned by the recent funeral, where it became clear that Robbie's estranged family didn't know — or want to know — the details of his personal or professional lives.\n\nEnter Pale, ostensibly on a mission to retrieve Robbie's few possessions. He arrives unexpectedly, angry and wired at the loft apartment Robbie, Anna and Larry shared (and designed with downtown '80s dinginess and off-the-street decor by Derek McLane).\n\nIn this production, deftly staged by director Michael Mayer, Driver plays Pale as a man-child with mad mood swings, displaying brilliant flashes of danger, absurdity, anguish and insight. He is coarsely funny in his tirades about Manhattan parking, four-ply toilet paper and clanging heating pipes, yet he is also fastidious, down to the crease and cut of his pants and his ad-hoc tea cozy. He is seemingly homophobic and misogynistic, but also tenderhearted. He's uber-alpha yet he sobs uncontrollably when emotions get the best of him, which is often.\n\nVital to the success of this fascinating, flawed (don't peer too closely at the details) and overlong play is the casting, especially in the leads that require an audience to believe that such disparate people can find a safe haven in each other's arms.\n\nDriver, a mesmerizing presence in TV's \"Girls\" and the latest \"Star Wars\" trilogy, lives up to expectations of the showcase role originally played by John Malkovich. Driver is riveting here, and audiences will identify with Anna's dilemma of both wanting him to leave and needing him to stay.\n\nIn many ways, \"Burn This\" is Anna's play, but any actress would find it hard to compete against the monologues-as-arias that Wilson gives Pale. There are no such showcase moments for Anna, though Russell can be a spellbinder, too, as she tells the story of being in a room filled with pinned butterflies. The metaphor suits Anna all too well.\n\nRussell, whose stage credits are slim but who's proven her chops onscreen in \"The Americans,\" creates a vivid, if less flashy, performance. Still, she's a force in her own right as she summons a quiet strength beneath her fragility, a sense of groundedness under her shifting emotions and a shaky will to move on despite the hole in her heart.\n\nIn a role that could have easily veered into stereotype, Uranowitz presents the right light touch with the quips and the wisdom he shares. Furr also displays fine shadings as a writer whose artistic grasp may lie beyond his commercial reach.\n\nBut it's the two stars who give the production of this imperfect play its brilliance, showing that the brightest fires burn from within.",
  "isFullReview": true,
  "textWordCount": 742,
  "archivePath": "data/archives/reviews/burn-this-2019/variety--fran-rizzo_2026-02-06.html",
  "textFetchedAt": "2026-02-06T05:27:43.607Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "duplicateTextOf": "variety--frank-rizzo.json",
  "contentTier": "complete",
  "wordCount": 742,
  "tierReason": "Full review text"
}