{
  "showId": "the-winslow-boy-2013",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2013/10/18/theater/reviews/the-winslow-boy-is-revived-at-american-airlines-theater.html",
  "publishDate": "October 17, 2013",
  "fullText": "https://www.nytimes.com/2013/10/18/theater/reviews/the-winslow-boy-is-revived-at-american-airlines-theater.htmlShare full articleAdvertisement\n\nMuch patience is demanded from the family of Arthur Winslow, the British patriarch waging a long battle to see that justice is properly served in “The Winslow Boy,” the 1946 play by Terence Rattigan that is being splendidly revived by the Roundabout Theater Company at the American Airlines Theater.\n\nMaybe I should add that a little patience may be required of audiences, too. Rattigan was one of the most successful British playwrights of the middle years of the last century, and wrote firmly in the tradition of the “well-made” play, drama that moves cleverly and deliberately, but with no great haste, through its unruffling paces. During the sometimes languid first act of “The Winslow Boy,” I occasionally found myself wondering whether we really needed to hear so much about a character’s crack cricketing (Rattigan was an avid fan), or, indeed, whether the kernel of the plot — the question of whether a 13-year-old boy stole a “postal order” (whatever that is!) of “five shillings” (whatever that is!) — was really substantial enough to merit such expansive dramatization.\n\nBut while it would give away the game to divulge whether the Winslow family’s patience is finally rewarded, I can firmly state that the audience’s ultimately is. Rattigan was rightly lauded (if sometimes derided) for the elegance of his plays’ construction and the delicacy with which he handled questions of how men and women struggle with the sometimes conflicting demands of passion and reason. As the emotional stakes of Arthur’s campaign are gradually revealed, “The Winslow Boy” opens out to become both a stirring drama about the rights of the individual in conflict with the imperatives of the government (a topic that could hardly seem more pertinent, in the post-Edward J. Snowden era), and a moving, surprisingly ambiguous tale of the price to be paid for the relentless pursuit of even an honorable goal.\n\nThe veteran actor Roger Rees gives an impeccably judged performance in the central role of Arthur, a man who appears to wear his ethical rectitude lightly, until it is challenged when his son is expelled from the naval academy where he has been studying. Little Ronnie Winslow (Spencer Davis Milford) insists, even through terrified tears, that he did not steal the fatal five-shilling postal order (let’s just say it’s a cashier’s check for a small sum), and Arthur’s instinctive trust in his son inspires him to question the expulsion, although the school insists that there is ample proof of the boy’s guilt. (The play was inspired by an actual case.)\n\nArthur’s initial challenge is met with defiance by the authorities, but he refuses to give up, and enlists the eminent barrister Sir Robert Morton (Alessandro Nivola) to take up the cause. The climactic scene of the first act finds this stern and supercilious figure interrogating the quaking young Ronnie in the family drawing room, as his family looks on with dismay. The curtain falls on a classic Rattigan moment, perhaps slightly predictable but highly satisfying.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Mr. Suchet brings a magisterial authority to his portrait of Sir Robert Morton, the celebrated barrister who takes on the Winslows' case, transforming what could have been a stock figure of theatrical nobility into a man of recognizable flesh and blood.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mr. Suchet brings a magisterial authority to his portrait of Sir Robert Morton, the celebrated barrister who takes on the Winslows' case, transforming what could have been a stock figure of theatrical nobility into a man of recognizable flesh and blood.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Short text (41 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://www.nytimes.com/2013/10/18/theater/reviews/the-winslow-boy-is-revived-at-american-airlines-theater.html?ref=theater&pagewanted=all&_r=0",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "rejectedAt": "2026-02-07T05:57:37.772Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is truncated and ends with 'We are having trouble retrieving the article content. Please enable JavaScript in your browser settings.' - this appears to be a technical error message rather than the complete review.; openai: The review is about a 2013 production of 'The Winslow Boy' at the American Airlines Theater, not the current Broadway run.",
  "promptVersion": "5.2.0",
  "previousUrl": "https://www.nytimes.com/2013/10/18/theater/reviews/the-winslow-boy-at-the-american-airlines-theater.html",
  "urlDiscoveredAt": "2026-02-04T02:07:02.434Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 523,
  "archivePath": "data/archives/reviews/the-winslow-boy-2013/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:20:47.401Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250423042017",
  "archiveOrgUrl": "http://web.archive.org/web/20250423042017/https://www.nytimes.com/2013/10/18/theater/reviews/the-winslow-boy-is-revived-at-american-airlines-theater.html",
  "wordCount": 523,
  "tierReason": "Full review text"
}
