{
  "showId": "disgraced-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2014/10/24/theater/josh-radner-and-gretchen-mol-star-in-disgraced-on-broadway.html?_r=1",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Mr. Akhtar's play, which was first seen in New York in 2012 and went on to win the Pulitzer Prize, has come roaring back to life on Broadway in a first-rate production directed by Kimberly Senior that features an almost entirely new cast. In the years since it was first produced here, the play's exploration of the conflicts between modern culture and Islamic faith...have become ever more pertinent...Although 'Disgraced' runs under 90 minutes, with no intermission, Mr. Akhtar packs an impressive amount of smart, heated talk -- as well as a few surprising twists, including a shocking burst of violence -- into the play's taut duration. Ms. Senior...continues to find fresh currents of dramatic electricity...Most important, Mr. Dillon, who played Amir in a London production, brings a coiled intensity to his performance that makes Amir's increasing antagonism all the more unsettling. Flickering underneath his cool, crisp exterior is a pilot light of resentment that holds the key to the play's eventually devastating denouement.",
  "bwwScore": 9,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-DISGRACED-Opens-on-Broadway-Updating-LIVE-20141023",
  "fullText": "“Bon appétit!” The festive phrase announcing the start of a meal sounds more like a bell signaling another round in a prizefight when it is chirped by Gretchen Mol, playing a hostess whose dinner party has become a verbal jousting tournament in Ayad Akhtar’s terrific, turbulent drama “Disgraced.”\n\nBy this point in the play, which opened at the Lyceum Theater on Thursday night, the nerves of everyone settling down to eat have been scraped raw. It’s hard to concentrate on your fennel and anchovy salad when the conversation over cocktails has descended into a fierce debate about the rise of Islamic terrorism and the basic tenets or the meaning of the Quran.\n\nMr. Akhtar’s play, which was first seen in New York in 2012 and went on to win the Pulitzer Prize, has come roaring back to life on Broadway in a first-rate production directed by Kimberly Senior that features an almost entirely new cast. In the years since it was first produced here, the play’s exploration of the conflicts between modern culture and Islamic faith, as embodied by the complicated man at its center — a Pakistani-born, thoroughly assimilated New Yorker — have become ever more pertinent. The rise of the so-called Islamic State, and the news that radicalized Muslims from Europe and the United States have joined the conflict raging in Syria and Iraq, brings an even keener edge to Mr. Akhtar’s engrossing drama.\n\nAt first blush, Amir (Hari Dhillon) seems to be in admirable possession of an American-dream life. He’s a lawyer specializing in mergers and acquisitions, which explains the immaculate apartment with a terrace to make any New Yorker salivate. His wife, Emily (Ms. Mol), is a painter on track to be included in a new show at the Whitney. Emily has begun a portrait of Amir inspired by a Velazquez painting of his Moorish assistant. An incident with a waiter at a restaurant the night before brought Amir’s ethnic heritage to the fore, and Emily has become intrigued by the gap “between what he was assuming about you, and what you really are”: words that will prove eerily prophetic as the drama unfolds.\n\nAmir long ago left behind the Islamic faith he was raised in, but the treatment of Muslims in post-Sept. 11 America has become a fraught subject, because his young nephew Abe (Danny Ashok) has been urging Amir to help in the defense of an imam who has been accused of raising money for Hamas. Amir visited the imam but doesn’t want to get further involved. Both Emily and Abe — who, like Amir, is a smoothly assimilated American, having changed his name from Hussein to ease his way — urge him to do more.\n\nAmir’s resistance is eventually worn down, with consequences that will prove significant as Mr. Akhtar’s drama moves from a slow simmer to a hard boil. A few months have passed after the first scene, and Emily and Amir are hosting a small dinner for one of Amir’s colleagues, Jory (Karen Pittman, the lone holdover from the original New York cast), who is also an up-and-comer at the firm, and her husband, Isaac (the nerdy-sexy Josh Radnor of “How I Met Your Mother” fame). He happens to be the Whitney curator intrigued by Emily’s explorations of Islamic tradition in her work, and he opens the evening on a cheerful note by announcing that her work will be in a new show at the museum about the “sacred” in art.\n\nAmir, who has been unsettled by a recent conversation at work about his background — inspired, he suspects, by a newspaper article referring to his support for the imam — bridles when Isaac begins to opine about the difference between Islam and “Islamo-fascism.” Amir scorns the distinction, describing the Quran as “one very long hate mail letter to humanity.”\n\nAnd yet, as he downs more Scotch, brooding about his status at the firm, Amir begins to reveal that his attitude toward his Muslim heritage isn’t quite as simple as he has been presenting it. He cannot erase an atavistic sense of pride in the powerful rise of Islamism — despite the violence it has engendered. When an incensed Isaac asks if this pride swelled in his Charvet-shirt-wearing breast after the Sept. 11 attacks, Amir’s answer only raises the temperature in the room.\n\nHow to wade through the crush of culture coming your way this season? Here’s a guide to 100 events that have us especially excited, in order of appearance.\n\nAlthough “Disgraced” runs under 90 minutes, with no intermission, Mr. Akhtar packs an impressive amount of smart, heated talk — as well as a few surprising twists, including a shocking burst of violence — into the play’s taut duration. Ms. Senior, who directed the play’s New York premiere, for Lincoln Center Theater, as well as its world premiere in Chicago, continues to find fresh currents of dramatic electricity.\n\nAs Emily, whose love for Amir will be harshly tested as the play proceeds, Ms. Mol makes us feel both the depth of that affection and the inquisitive intelligence that has led her to explore the history of Islam. Ms. Pittman’s Jory is magnetic and funny, and a cool referee when the tension between Isaac and Amir explodes into animosity. Mr. Ashok makes young Abe’s own evolving attitude toward his heritage persuasive. Most important, Mr. Dhillon, who played Amir in a London production, brings a coiled intensity to his performance that makes Amir’s increasing antagonism all the more unsettling. Flickering underneath his cool, crisp exterior is a pilot light of resentment that holds the key to the play’s eventually devastating denouement.\n\nAs much as “Disgraced” is a play about the potential tensions between old faiths and the modern world, it also dramatizes the complexity of identity, the interior tug of war between the culture into which people are born and the culture they claim as their own. For all its heady talk, the play’s most moving moment for me was a silent one, as Amir contemplates Emily’s portrait of him. You sense that he’s looking beyond the painting into his soul’s opaque depths, and feeling anguish and confusion at what he sees.\n\nAn earlier version of this review misspelled, in one instance, the surname of the actor playing Amir. As the review elsewhere, and the picture captions and the listing of credits correctly note, he is Hari Dhillon, not Dillon. An earlier version of a subheading misspelled the surname of the actor playing Isaac. As the review and captions and credits note, he is Josh Radnor, not Radner.\n\nWhen we learn of a mistake, we acknowledge it with a correction. If you spot an error, please let us know at corrections@nytimes.com.Learn more",
  "isFullReview": true,
  "textWordCount": 1120,
  "archivePath": "data/archives/reviews/disgraced-2014/nytimes--charles-isherwood_2026-02-05.html",
  "textFetchedAt": "2026-02-05T01:59:09.809Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "wordCount": 1120,
  "tierReason": "Full review text"
}