{
  "showId": "a-delicate-balance-2014",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2014/09/07/theater/fall-arts-preview-glenn-close-returns-to-broadway-in-a-delicate-balance.html",
  "publishDate": "November 20, 2014",
  "fullText": "SCARBOROUGH, Me. — When Glenn Close first visited this beach town a decade ago, she walked into a kitchen and found a stuffed white bunny in a pot on the stove. It was yet another “Fatal Attraction” joke, but this time, Ms. Close laughed: She was smitten with the prankster, David Shaw, a venture capitalist she had started dating. Later, on the lawn of his waterfront home, they put on inflatable sumo wrestler suits and bumped bellies until Ms. Close was flailing like a turtle on its back. They married in 2006, and Ms. Close has since become a summertime Mainer, even mastering beach bocce ball with a zeal that would impress Patty Hewes, her cutthroat character on the cable series “Damages.”\n\nSo: Has marriage made Ms. Close the happiest she has ever been?\n\nShe took a long pause to consider that question on a recent afternoon. And no wonder. Not simply because she once said she would never marry again, after two divorces, because she felt it put too much pressure on men and women who were already “so vastly different.” Nor because, as blissed-out as life can be here, she still yearns for great film roles, if not the Academy Award that has proved elusive after six nominations.\n\nNo, happiness and marriage have become a potent topic because of her latest project, a return to Broadway this fall in Edward Albee’s “A Delicate Balance.” The play, which won the Pulitzer Prize for drama in 1967, starts preview performances on Oct. 20 and is one of theater’s most intense domestic dramas, full of emotional sinkholes that Ms. Close has some experience with.\n\n“Well, you know, every human relationship is — you are constantly working on aspects of it,” she started saying, haltingly, as she sat on a porch of Mr. Shaw’s home that they now share. (He was away that day on business.)\n\nHow to wade through the crush of culture coming your way this season? Here’s a guide to 100 events that have us especially excited, in order of appearance.\n\nShe paused again, brushing sand off the red toenail polish on her bare feet, and then became more emphatic.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Ms. Close brings a fierce intelligence and psychological acuity to Agnes that makes every line feel like a revelation. This production finds the perfect pitch for Albee's masterwork about the fragility of domestic equilibrium.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Hope arrives in the form of dread toward the end of the first act of Edward Albee's 'A Delicate Balance'...Up to that point in this production, directed by Pam MacKinnon, it's been hard to detect much feeling of any kind within the carefully color-coordinated, dust-free, energy-free environs that have been installed onstage. To be sure, the three talented and celebrated people we have been watching up there thus far -- Glenn Close, John Lithgow and Lindsay Duncan -- have been delivering their characters' zingers and stingers with crispness, clarity and, when one feels an important theme coming on, heavy italics. Yet they have the distant, flattened dimensions of specimens under glass...But then -- oh, sweet deliverance -- here come good old, miserable, intrusive Harry and Edna to shake things up...As embodied by Bob Balaban and Clare Higgins, Harry and Edna arrive like a gust of -- well, I was going to say fresh air, but what Harry and Edna bring with them is something noxious and polluted...Their acting is more subtle than anybody else's here, but it is also bone deep...Yet in this version of 'A Delicate Balance,' there is no underneath. Its stars speak the lines as if they -- I mean, the performers, not the characters -- know exactly what they're saying and why...As you would expect of these highly accomplished, multi-award-winning cast members, none of them are bad. But they're giving us the play, instead of living it.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-A-DELICATE-BALANCE-Opens-on-Broadway-Updating-LIVE-20141120",
  "showScoreExcerpt": "Ms. Close brings a fierce intelligence and psychological acuity to Agnes that makes every line feel like a revelation. This production finds the perfect pitch for Albee's masterwork about the fragility of domestic equilibrium.",
  "contentTier": "complete",
  "contentTierReason": "Short text (34 words)",
  "previousUrl": "https://www.nytimes.com/2014/11/21/theater/a-delicate-balance-with-glenn-close-opens-on-broadway.html",
  "urlDiscoveredAt": "2026-02-03T07:39:53.921Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 385,
  "archivePath": "data/archives/reviews/a-delicate-balance-2014/nytimes--ben-brantley_2026-02-03.html",
  "textFetchedAt": "2026-02-03T07:39:53.925Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250715232751",
  "archiveOrgUrl": "http://web.archive.org/web/20250715232751/https://www.nytimes.com/2014/09/07/theater/fall-arts-preview-glenn-close-returns-to-broadway-in-a-delicate-balance.html",
  "wordCount": 385,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-03T11:01:18.173Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is a profile/interview article about Glenn Close's personal life in Maine, not a review of 'A Delicate Balance.' The text mentions the Broadway show only in passing and contains no critical evaluation of the production.; openai: This text is a mix of a personal story about Glenn Close and an error message, not a review of a Broadway show.; gemini: This is an article about Glenn Close's life and upcoming role in 'A Delicate Balance,' not a review of the production itself. It's a preview/profile piece.; kimi: This is a profile/interview article about Glenn Close's personal life in Maine and her upcoming return to Broadway, not a review of the production 'A Delicate Balance.' The text contains no critical evaluation of the show's performances, direction, or quality, and was published before the production began previews.",
  "promptVersion": "5.2.0",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/11/21/theater/a-delicate-balance-revival-stars-john-lithgow-and-glenn-close.html",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 6
}
