{
  "showId": "a-delicate-balance-2014",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2014/legit/reviews/broadway-review-a-delicate-balance-with-glenn-close-and-john-lithgow-1201361571/",
  "publishDate": "November 20, 2014",
  "fullText": "“A Delicate Balance” is no play for sissies. Edward Albee won the Pulitzer but unnerved auds with his 1966 drawing-room drama about an upper-middle-class family of WASPs who are suddenly gripped by a mysterious existential malaise. All these years later, it’s still very disturbing to look this work in the eye. Pam MacKinnon (who did the scribe proud with “Who’s Afraid of Virginia Woolf?”) helms a lustrous cast toplined by Glenn Close and John Lithgow as the complacent heads of a family who lose their composure when faced to confront an undefined “terror” that has stricken their best friends.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n What Eye Mask Is Harry Styles Wearing in His 'Aperture' Promo? Our Best Guess Is This One From 111SKIN \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Kenan Thompson Says He 'Definitely' Thinks About Leaving 'SNL': 'It's Gonna Suck'\n\nAlbee sets off tremors simply by introducing the haughty folks who live in comfort (splendor, if you price the marble fireplace and crystal chandeliers) in the spacious and tastefully furnished suburban home designed by Santo Loquasto. Close, with her fine bones, imperial manner and elegant wardrobe (by Ann Roth), is positively regal as Agnes, the mistress of the house who has made herself the “fulcrum” of the rigidly controlled domestic order that keeps her combustible family from bursting into flames.\n\nAlthough Agnes admits to the all-too-human fear of losing her marbles and becoming “mad as a hatter,” she’ll brook no challenge to her authority from husband Tobias, played in Lithgow’s carefully calibrated perf as a worm of a man — but a worm who will eventually turn and deliver a blistering reckoning of the family’s alienation from the living. For now, though, Tobias is content to sit quietly in his favorite chair and try to defuse the domestic tensions by offering drinks all around and urging family members to “be kind” to one another. In one calmly delivered but astonishing speech — about a pet cat he had put down for avoiding his company and refusing to purr — he obliquely warns his fractious household to “purr” at one another.\n\nBut if Agnes doesn’t see Tobias as a threat to her power, her alcoholic sister, Claire (Lindsay Duncan), is quite another matter. It takes guts to take on a role famously played by Rosemary Murphy in the original production and by Elaine Stritch in the 1996 Broadway revival. So hats off to Duncan for the devilish joy she takes in the spiteful humor of that social rebel, a colorful scandal to the whole family, but a real menace to her sister’s domination of the household. Although Agnes will deign to apologize “for being articulate,” Claire’s mock apology has to do with the fact “that my nature is such to bring out in you the full force of your brutality.”\n\nThere are more fireworks between the imperious Agnes and Julia (Martha Plimpton, a touch too much), the overgrown brat of a daughter who comes home to roost after leaving her fourth husband and has a meltdown when she discovers “her” room currently occupied by her parents’ best friends.\n\nAnd here we have the plot development that tells us we’re not at some conventional domestic drama that will resolve itself tragically (or even comically), but the kind of existential mystery that can never be resolved — the kind of brilliantly constructed if ultimately unfathomable play that only Edward Albee can get away with writing.\n\nEdna and Harry, who are played by Clare Higgins and Bob Balaban in a comic vein that deepens and darkens until it turns positively menacing, have fled their home because of some nameless dread and taken refuge with their best friends. “We were frightened,” Edna says. “We were scared,” Harry says. “It was like being lost.”\n\nThat’s pretty much all we get from Albee about the nature of this fear, but the play turns on everyone’s reactions to this “home invasion.” Although Julia can’t get past the humiliating reality that she has lost her own refuge, Claire seems to have expected something like this. (“I was wondering when it would begin,” she says cryptically.) Agnes is the most seriously threatened, because the mere presence of these friends — now strangers — who have come to them demanding comfort and protection, has upset the “delicate balance” of the household. Only Tobias finds the courage to look down that crack in the family foundation and address the void he sees. But, of course, we’re all welcome to take our own peek into the abyss.",
  "isFullReview": true,
  "dtliExcerpt": "Glenn Close and John Lithgow lead an excellent cast in this revival of Edward Albee's 1966 Pulitzer Prize-winning drama about a family whose emotional equilibrium is disrupted by the arrival of close friends seeking refuge from their own nameless terror.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "'A Delicate Balance' is no play for sissies...All these years later, it's still very disturbing to look this work in the eye...Close, with her fine bones, imperial manner and elegant wardrobe (by Ann Roth), is positively regal as Agnes...Although Agnes admits to the all-too-human fear of losing her marbles and becoming 'mad as a hatter,' she'll brook no challenge to her authority from husband Tobias, played in Lithgow's carefully calibrated perf as a worm of a man -- but a worm who will eventually turn and deliver a blistering reckoning of the family's alienation from the living...It takes guts to take on a role famously played by Marian Seldes in the original production and by Elaine Stritch in the 1996 Broadway revival. So hats off to Duncan for the devilish joy she takes in the spiteful humor of that social rebel, a colorful scandal to the whole family, but a real menace to her sister's domination of the household.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Glenn Close and John Lithgow lead an excellent cast in this revival of Edward Albee's 1966 Pulitzer Prize-winning drama about a family whose emotional equilibrium is disrupted by the arrival of close friends seeking refuge from their own nameless terror.",
  "contentTier": "invalid",
  "contentTierReason": "Short text (40 words)",
  "rejectedAt": "2026-02-03T11:03:57.803Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is just a plot summary with cast information - no critical evaluation or opinion about the production quality; openai: The text is a brief description of the cast and play, lacking any evaluative content or critical opinion.; gemini: This is a plot summary with no evaluative content or recommendation.",
  "promptVersion": "5.2.0",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://variety.com/2014/legit/reviews/broadway-review-a-delicate-balance-with-glenn-close-and-john-lithgow-1201361571/",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews"
  ],
  "bwwScore": 8
}
