{
  "showId": "race-2009",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "Unknown",
  "url": "http://www.hollywoodreporter.com/review/disgraced-theater-review-743465",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/disgraced-theater-review-743465",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "But despite the many provocative attitudes expressed onstage, the play's ideas don't coalesce in meaningful fashion, and the characters, particularly the evasive defendant and the intern with possible motives of her own, never quite come into focus. And with the latter character, Mamet once again reveals the misogynistic attitude toward women that made such works as 'Oleanna' and 'Speed-the-Plow' so problematic.",
  "bwwScore": 6,
  "fullText": "Anyone who believes we live in an unprejudiced society obviously hasn't spent time wading through the anonymous vitriol of online comments on editorials addressing race, religion, ethnic identity and politics. And the popular liberal notion of a post-racial America gets debunked at double speed whenever radical Islam enters the discussion. Ayad Akhtar's 2013 Pulitzer Prize winner Disgraced skillfully adopts the well-worn dramatic device of the imploding dinner party to scratch beneath the surface of multicultural harmony. First seen in New York in a lauded 2012 run as part of Lincoln Center Theater's emerging artists program, this Broadway transfer is smart, spiky entertainment.\n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Lifestyle\n \n \n \n \n\n \n \n \n \n 'Moulin Rouge' to End Broadway Run in July \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Business\n \n \n \n \n\n \n \n \n \n Broadway Box Office: 'Mamma Mia!' Bids Farewell With $1.8 Million Final Tally\n\nRecast in all but one secondary role, director Kimberly Senior's production deftly modulates its way through the play's seismic mood shifts — from complacent banter through mounting prickliness and incendiary animosity to shattered aftermath. However, to get the quibbles out of the way first, any flaws are most likely to be noticed by that small handful of the audience returning to Disgraced after seeing its superior previous incarnation.\n\nThe blistering intimacy of the smaller theater where it played uptown heightened the sense of danger as Akhtar's characters traversed the drama's intellectual, moral and social minefield. And in the pivotal role of Amir Kapoor, a well-heeled New York corporate lawyer who has distanced himself from his cultural roots and fudged his Pakistani Muslim origins for professional reasons, Aasif Mandvi (of The Daily Show With Jon Stewart and HBO's upcoming The Brink) was a revelation. The actor-comedian cloaked the character's drive and hunger in defensive arrogance, while never losing sight of Amir's vulnerability as his smooth composure gave way to the cold sweat of fear and regret.\n\nThat's not to say that Hari Dhillon, who reprises the role after playing it in London last year, doesn't generate sparks. Handsome, charismatic and physically self-possessed in a way that suggests a man genetically programmed for success, his Amir is a commanding presence.\n\nRead more 'Disgraced' Honored With 2013 Pulitzer Prize for Drama\n\nAkhtar slyly introduces the lawyer posing for a portrait by his beautiful blonde artist wife Emily (Gretchen Mol). Amir wears the Masters of the Universe uniform of an expensively tailored jacket over a crisp white Charvet shirt and tie on top, with boxers, socks and bare muscular brown legs below. That image takes on amusing additional nuance when we learn that Emily's inspiration for the picture is Velazquez's Portrait of Juan de Pareja, in which the Spanish painter depicted his Moorish slave.\n\nThe chief weakness in Akhtar's construction is the diagrammatic breakdown of the two couples who clash over fennel and anchovy salad in Amir and Emily's apartment, designed by John Lee Beatty as a model of tasteful elegance and enviable terrace space. A South Asian, a WASP, a Black woman and a Jew breaking bread together could be figures out of some Upper East Side melting-pot joke, and that may well be the playwright's intention. But they occasionally become too-convenient mouthpieces for clashing cultural perspectives.\n\nAcross the table from Emily and Amir are his savvy law-firm colleague Jory (Karen Pittman, the excellent sole holdover from the play's first New York staging) and her partner Isaac (Josh Radnor), a curator at the Whitney Museum. He's putting together an exhibition that Emily hopes will include her work inspired by Islamic mosaic imagery. But the evening starts off on a strained note and goes downhill from there.\n\nWatch more Josh Radnor, Gretchen Mol on Their Complex Play 'Disgraced'\n\nAfter the latest in a series of increasingly trying days at the office, Amir is testy and already half-tanked when the guests arrive. Three months earlier, at the urging of Emily and his nephew (Danny Ashok), who changed his name from Hussein Malik to Abe Jensen to make life easier, Amir reluctantly agreed to consult on a case against a local imam suspected of terrorist involvement. While he was not appearing in court as official counsel, his skin color — not to mention the name of his powerful firm — made him the go-to guy for a quote in the New York Times coverage. That mention didn't sit well with the firm's partners, and his perch on the corporate ladder has been wobbly ever since.\n\nBoth the thematic elements of Emily's art and Amir's association with the imam's case nudge Islam into the dinner conversation. And each time Isaac chimes in with a display of liberal self-righteousness, the tightly wound Amir gets more aggressively opinionated about what he sees as the incompatibility of his ancestral faith with the modern world. Still, the lawyer's escalating anger taps into an innate conflict beneath his assimilated exterior, exposed in his shocking admission of feeling \"an unexpected blush of pride\" at violent fundamentalist actions.\n\nWhile the dinner party ends abruptly, the fallout continues over more personal revelations. Those are still reverberating several months later when the now-radicalized Abe stops by, bringing fresh legal troubles to the humbled Amir. It's one of the play's devilish ironies that the Americanized lawyer in a tight corner turns out to be the most honest character.\n\nRead more Inside Broadway's 'Disgraced': Play Portrays Pakistani Pretending to Be Indian at Jewish Law Firm\n\nWhile Disgraced has its schematic aspects, the writing effectively observes the insidious tensions that ripple through both personal and professional relationships in post-9/11 America. The play is particularly incisive in its commentary on the volatility of certain words and talking points, rendering them unsafe in any conversation. Akhtar also provides a thoughtful examination of how denial and self-loathing can distort an individual's sense of cultural identity.\n\nRadnor (How I Met Your Mother) is a standout among the accomplished cast, walking a fine line between relaxed charm and smug condescension as a man unaccustomed to self-examination. Mol (Boardwalk Empire) makes less of an impression as the least sympathetic character, though Emily's naivety appears intentional on the playwright's part, demonstrating the obliviousness of many privileged whites to the societal bias experienced by people of color. Even in the case of her husband. Ashok and Pittman are terrific in small but significant roles.\n\nIf Disgraced has sacrificed some of its edge in the move to a commercial mainstage, it's nonetheless a stimulating, sobering work from a distinctive new American playwright.\n\nCast: Hari Dhillon, Gretchen Mol, Josh Radnor, Danny Ashok, Karen PittmanDirector: Kimberly SeniorPlaywright: Ayad AkhtarSet designer: John Lee BeattyCostume designer: Jennifer von MayrhauserLighting designer: Kenneth PosnerSound designer: Jill BC Du BoffExecutive producer: Marisa SechrestPresented by the Araca Group, Lincoln Center Theater, Jenifer Evans, Amanda Watkins, Richard Winkler, Rodger Hess, Stephanie P. McClelland, Tulchin/Bartner Productions, Jessica Genick, Jonathan Reinis, Carl Levin/Ashley de Simone/TNTDynamite Productions, Alden Bergson/Rachel Weinstein, Greenleaf Productions, Darren Deverna/Jere Harris, the Shubert Organization, the David Merrick Arts Foundation",
  "isFullReview": true,
  "textWordCount": 1139,
  "archivePath": "data/archives/reviews/race-2009/hollywood-reporter--unknown_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:04:00.319Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee auth failed: Monthly API calls limit reached: 1250000"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1139,
  "tierReason": "Full review text",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/RACE-Review-Roundup-20100701",
  "isMultiShowReview": true,
  "multiShowReason": "Roundup article: 2 other shows mentioned 3+ times (disgraced, well)"
}