{
  "showId": "race-2009",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2009/legit/reviews/race-1200476842/",
  "publishDate": "December 6, 2009",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "David Mamet's 'Race' is a provocative courtroom drama that finds the playwright in characteristically blunt form, though the work feels more like an intellectual exercise than a fully realized theatrical experience.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "As one of the characters in David Mamet's teasing faux-polemic on the subject says, 'Race is the most incendiary topic in our history.' The slender play that takes its terse title from that declaration seems hatched more out of an urge to inflame arguments easily triggered in the age of Obama than out of the need to tell this particular story or even to explore the issue with any real conclusiveness. This being Mamet, however, the dialogue is tasty, the confrontations spiky and the observations more than occasionally biting. Slick but hollow, 'Race' entertains as it unfolds, but grows increasingly wobbly as it twists its way to an unsatisfying wrap-up.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "David Mamet's 'Race' is a provocative courtroom drama that finds the playwright in characteristically blunt form, though the work feels more like an intellectual exercise than a fully realized theatrical experience.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "bwwScore": 6,
  "sources": [
    "web-search",
    "bww-reviews"
  ],
  "textWordCount": 478,
  "archivePath": "data/archives/reviews/race-2009/variety--david-rooney_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:48:04.406Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Oct 14, 2009 6:16pm PT \n\n \n\n \n \n \n\n \n\n \n Ultimatum\n \n \n\n \n\n Conflict's effect on two French expats tends to twist in too many circles, with subplots that don't provide much dramatic pull.\n\nThe “Ultimatum” of the Persian Gulf War and its effect on a couple living in Israel intrigues and befuddles in writer-director Alain Tasma’s tense multinational melodrama. Adapted from Gallic author Valerie Zenatti’s 2006 novel, the pic convincingly re-creates the atmosphere that prevailed as Israelis awaited an Iraqi gas attack that never happened. But the conflict’s effect on two French expats — played by a fervid Gaspard Ulliel and Jasmine Trinca — tends to twist in too many circles, with subplots that don’t provide much dramatic pull. Timely subject matter could boost overseas interest after an anticlimactic French opening.\n\nLike Ronit Elkabetz’s recent “The Seven Days,” the pic uses the canvas of the 1990-91 war to explore conflicts between friends, families and lovers on the Israeli side. But whereas Elkabetz’s film efficiently hemmed its cast into one theatrical setting, “Ultimatum” prances across a plethora of characters and locations while never fully realizing their emotional potential.\n\nVibrant Franco-Italian student Luisa (Trinca, “Crime Novel,” “The Son’s Room”) and moody wannabe painter Nathanael (Ulliel, “A Very Long Engagement”) form a shaky couple from the start, and their clashes are soon exacerbated by the threat of an Iraqi missile attack as Gulf tensions escalate. While Luisa enjoys her history classes and part-time shopkeeper gig — despite a worrywart mom (Anna Galiena) who assails her with daily phone calls from France — Nathanael is miserable as a rent-a-cop guarding a municipal building in Jerusalem.\n\nWhen the scuds start flying, it’s not the bombs but the couple that explodes, and Luisa is pushed to decide whether she’ll support her b.f.’s bad attitude or ditch him for good.\n\nLong-winded script shifts confusingly between the protags and several other minor characters early on, though the fiery twosome sustains things for a while. But the bouts soon grow tiresome, mainly because Nathanael remains an unlikable egomaniac whose only attributes seem to be his good looks, while Luisa is both attractive and a sweetheart who clearly deserves better.\n\nTasma (“Out of the Blue”) adequately captures the eerie mood that struck Israelis as they awaited a chemical attack and possibly full-scale war. The fact that neither occurred didn’t keep them from living in fear, and key scenes are grippingly played out as characters don gas masks and hermetically seal themselves in bathrooms.\n\nUlliel’s perf is all muscle, which renders Nathanael one-dimensional as his tantrums grow louder. Trinca gives Luisa more depth and appeal while juggling three languages with ease. Israeli thesps Hanna Laszlo and Sarah Adler play a supporting mother-daughter team that’s given lots of screen time but never develops into an interesting subplot.\n\nHandheld camerawork by Dominique Bouilleret (“The New Protocol”) keeps us glued to the protags while intensifying the wartime tone.",
  "_showNotMentionedDiscoveryAttempted": true
}
