{
  "showId": "race-2009",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2009/legit/reviews/race-1200473116/",
  "publishDate": "December 6, 2009",
  "fullText": "A satisfyingly exciting monster rally that often plays like a period swashbuckler.\n\nAuds are encouraged to cheer the werewolves in \"Underworld: Rise of the Lycans,\" the third chapter in the ongoing franchise about a centuries-long battle between bloodsuckers and shape-shifters. Taking over the directorial reins from Len Wiseman, who remains onboard as a producer, first-time helmer Patrick Tatopoulos (who designed creatures for all three pics) offers a satisfyingly exciting monster rally that often plays like a period swashbuckler. Notably less frenetic (and appreciably more coherent) than its predecessors, new entry scared up $20.6 million at the B.O. on its opening weekend.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Maxima,’ Now Gearing Up for Season 2, Sold by Beta Film to 85 Territories Worldwide, Drops New Trailer (EXCLUSIVE) \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'If I Go Will They Miss Me' Review: Talent-to-Watch Walter Thompson-Hernández Weaves a Lyrical Portrait of a Boy on the Brink of Flight\n\nFirst two pics — \"Underworld\" (2003) and \"Underworld: Evolution\" (2006) — celebrated the derring-do of Selene (Kate Beckinsale), a kick-ass, leather-clad vampire warrior who sliced and diced Lycans (aka werewolves) in various contemporary European locales. But the newest chapter, a thousand-years-earlier prequel, shifts the spotlight to Lucian, the Lycan leader played, as in the first two episodes, by Michael Sheen (\"The Queen,\" \"Frost/Nixon\").\n\nIlluminating and expanding the mythos introduced in the first \"Underworld,\" scripters Danny McBride, Dirk Blackman and Howard McCain set their scenario in an unnamed land (pic was shot in New Zealand) where aristocratic vampires led by the autocratic Viktor (series regular Bill Nighy) reside in a fortified castle while ruling — and occasionally draining — humans throughout the region.\n\nOutside the castle walls, marauding werewolves prowl through the woods, feasting indiscriminately on the living and the undead. Inside, however, the vampires enslave a special breed of the lupine bogeymen known as Lycans, forcing the wretches to wear special collars that prevent them from shape-shifting into humongous wolves.\n\nLucian, a blacksmith who forges weaponry to use against werewolves, is treated with special favor by Viktor, who looks upon the Lycan as, if not a son, then a favorite pet. But their relationship sours when Viktor learns Lucian is having a forbidden affair with Sonja (Rhona Mitra), a formidable vampire warrior and Viktor's daughter.\n\nBeckinsale appears only fleetingly in \"Rise of the Lycans\" — at the very end — and her near-total absence is bound to disappoint longtime fans of the series.\n\nMitra has undeniable screen presence — she's easy on the eyes and handy with a sword — and her performance is more than adequate, but even though she's suitably spirited while hacking her way through clusters of lycanthropes, her Sonja never achieves the pop-icon impact of Beckinsale's Selene.\n\nOn the other hand, Sheen is robustly dynamic as Lucian, a character portrayed as an arch-villain in the earlier \"Underworld\" pics. Here, Lucian actually is the hero — a little like a Spartacus of the Lycans, leading enslaved humans and werewolves in a rebellion against their cruel vampire masters — and Sheen hits all the right notes in a star-powered performance that will amuse, if not amaze, anyone who only knows the actor as Tony Blair or David Frost.\n\nOnce again, Nighy offers a sly and stylish turn as Viktor, the blue-eyed vampire king whose elegant menace can quickly escalate into full-bore fury. And Steven Mackintosh, yet another three-time participant, is arrestingly ambiguous as Tannis, Viktor's devious underling.\n\nAce production design emphasizes a Dark Ages version of the black-on-black, Goth-flavored look of the earlier pics. Man-into-werewolf transformations are credibly accomplished, although there's a distinctly cartoonish quality to the big wolves that run in packs during the extended climax. There are fewer large-scale battles here than in previous \"Underworld\" adventures, and a couple of stretches are talky. But the performances are forceful enough to keep things interesting even when no one is sprouting fangs or drinking blood.",
  "isFullReview": true,
  "dtliExcerpt": "David Mamet's new play 'Race' is a typically provocative piece that uses the hot-button issue of interracial sex to explore the murkier territory of legal ethics and moral responsibility.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "David Mamet's new play 'Race' is a typically provocative piece that uses the hot-button issue of interracial sex to explore the murkier territory of legal ethics and moral responsibility.",
  "contentTier": "invalid",
  "contentTierReason": "Short text (29 words)",
  "textQuality": "truncated",
  "rejectedAt": "2026-02-04T02:25:26.457Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a brief plot summary or description without any evaluative content or critical assessment of the production; openai: The text is a brief description of the play's themes without any evaluative content or critical assessment.; gemini: This is a plot summary with no evaluation of the production's quality.; kimi: The text describes the subject matter and themes of the play but contains no evaluative content regarding the production quality, performances, or whether the critic recommends seeing it. It appears to be an excerpt of opening context or a plot summary rather than a critical assessment.",
  "promptVersion": "5.2.0"
}
