{
  "showId": "jerusalem-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2011/legit/reviews/jerusalem-1117945176/",
  "publishDate": "April 21, 2011",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "Mark Rylance gives a towering performance as Johnny 'Rooster' Byron, a dissolute charmer who lives in a trailer in the woods and holds court over a ragtag collection of social misfits.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Although it's hard to look anywhere else when Rylance is on stage, which is all the time, Mackenzie Crook manages to turn heads with his droll perf as Ginger, the faithful hanger-on who missed last night's bacchanal and may be too strung-out for today's festivities, the St. George's Day fete that is an annual rite of spring. Under Ian Rickson's smooth helming, other colorful visitors surface from the heavy human traffic at Rooster's camp, many of them from the original Royal Court production.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mark Rylance gives a towering performance as Johnny 'Rooster' Byron, a dissolute charmer who lives in a trailer in the woods and holds court over a ragtag collection of social misfits.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (31 words)",
  "textQuality": "partial",
  "rejectedAt": "2026-02-03T17:09:53.448Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or caption describing a performance, not a complete review with critical evaluation or recommendation; openai: This text is a brief character description and does not provide an evaluative opinion on the production as a whole.",
  "promptVersion": "5.2.0",
  "textWordCount": 207,
  "archivePath": "data/archives/reviews/jerusalem-2011/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:10:10.800Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Word count too low: 207 (min: 300)",
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "A sun-dappled, too loose-limbed road movie only moderately spiced up by that ever-dependable Gallic institution, the insouciant menage-a-trois.\n\nAcclaimed French helmer Patrice Leconte (“Man on the Train,” “Intimate Strangers”) seems, perhaps intentionally, to have unlearned his decades of filmmaking experience for “See the Sea,” a sun-dappled, too loose-limbed road movie only moderately spiced up by that ever-dependable Gallic institution, the insouciant menage-a-trois. However, rather than fresh, and despite a sensual and convincing cast, the film simply feels undisciplined. French media interest was fueled by the helmer’s recent autobiography, which suggested he’d retired. But without a similar marketing hook abroad, only some film-week action is likely before the pic ends up wherever generic, sexy French movies go to die.\n\nHunky brothers Clement (Clement Sibony) and Nicolas (Nicolas Giraud) travel from inland Burgundy to seaside town Saint-Jean-de-Luz with a sprightly, short-haired blonde (Pauline Lefevre) in tow. She’s never seen the sea, and they’re on their way to visit their ill mother. (“Mer” in the French title sounds like both “sea” and “mother.”) Helmer’s anything-goes attitude extends to its episodic screenplay (Leconte’s first original solo effort), hand-held and artily out-of-focus camerawork and random narrative ideas, including an extremely clumsy pursuit of the trio by the girl’s grotesque ex-husband (Gilles Cohen).",
  "bwwScore": 9,
  "sources": [
    "web-search",
    "bww-reviews"
  ],
  "_showNotMentionedDiscoveryAttempted": true
}
