{
  "showId": "allegiance-2015",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Unknown",
  "url": "http://www.theguardian.com/stage/2015/nov/08/allegiance-review-broadway-unexceptional-pledge-george-takei",
  "playbillVerdictUrl": "http://www.theguardian.com/stage/2015/nov/08/allegiance-review-broadway-unexceptional-pledge-george-takei",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Lea Salonga and George Takei in a scene from Allegiance. Photograph: Matthew MurphyView image in fullscreenLea Salonga and George Takei in a scene from Allegiance. Photograph: Matthew Murphy This article is more than 10 years oldReviewAllegiance review: George Takei can't save Broadway's mediocre pledgeThis article is more than 10 years oldMusical revisits an important and shameful past of the internment of Japanese Americans but story on stage fails to deliver distinctive and rich performances\n\nThe forced internment of 120,000 Japanese Americans during the second world war remains one of the most shameful passages in American history, a move owing less to the exigencies of war and more to racist and xenophobic assumptions.\n\nGeorge Takei, the original Sulu on Star Trek, was one of those interned. The experiences of his family have now inspired Allegiance, an unexceptional though often affecting new Broadway musical.\n\nAfter a brief prologue set in 2001, Allegiance journeys 60 years to 1941, when the Kimura clan – son Sammy, daughter Kei, father Tatsuo, and grandfather Ojii-chan – are farming in reasonable comfort and contentment in central California.\n\nIn the midst of a summer celebration, which allows both siblings their “I wish” song, the bombing of Pearl Harbor is announced.\n\nThe family is “relocated” to the dusty depths of Heart Mountain in Wyoming. Sammy (Telly Leung) resolves to enlist, proving his family’s honor by fighting for his country. Kei (Lea Salonga of Miss Saigon) is persuaded to refuse the draft until her family is free.\n\nAllegiance should be better served by its book, score and lyrics, most of which tend toward the generic. Stafford Arima’s direction does too. Composer and lyricist Jay Kuo and book writers Marc Acito and Lorenzo Thione are striving so hard for stirring nobility that individuality or particular characterization falls by the wayside.\n\nThe ballads are all sufficiently ballad-y, but none of the melodies linger once the curtain has fallen and the lyrics pile on platitude and cliché.\n\nA cute 40s-style song that develops the attraction between Sam and a principled nurse (Katie Rose Clarke) is better; so is a comic tune in which Kei’s suitor Frankie (Michael K Lee) mocks the men in power. But several of the numbers, like the one about baseball, could be cut without much loss. The book is merely workmanlike, with the occasional enjoyably dumb joke to lighten the mood.\n\nAnd that’s disappointing. Asian Americans are woefully underrepresented on Broadway, on stage and behind the scenes. They deserve a more distinctive work.\n\nMost of the characters here seem types rather than individuals. Leung is boyish and attractive, but a very standard sort of hero. Salonga’s voice is still a stunner, but Kei is similarly non-specific. Lee is the exception, both because his character is written with a quirk or two and because he is such a dynamic performer. And Takei is so helplessly likable that he fleshes out an underwritten role as the grandfather.\n\nThe show only really acquires force once the body count rises and the familiar tropes of melodrama are employed. One would have to be quite stoic or of a supremely Buddhist mindset not to weep at the final scene, when the trials and indignities of the past are finally allowed some small redemption.\n\nThe stories that Allegiance tells deserve telling and the history it describes – in however fictional a form – bears learning. But its creators might have a made a richer and more particular pledge.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 591,
  "archivePath": "data/archives/reviews/allegiance-2015/guardian--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:33:15.683Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 591,
  "tierReason": "Full review text"
}