{
  "showId": "allegiance-2015",
  "outletId": "the-three-tomatoes",
  "outlet": "The Three Tomatoes",
  "criticName": "Valerie Samaldone",
  "url": "http://thethreetomatoes.com/new-on-broadway-allegiance",
  "publishDate": null,
  "fullText": "by Valerie Smaldone · Published November 21, 2015 · Updated November 20, 2015 Allegiance is a sweet musical that chronicles a shameful time in American history, when Japanese Americans were removed from their homes and placed in internment camps on the heels of the attack on Pearl Harbor. Allegiance stars George Takei, Telly Leung and Lea Salonga, with music and lyrics by Jay Kuo, book by Marc Acito, Jay Kuo and Lorenzo Thione, choreography by Andrew Palermo, and direction by Stafford Arima. The story centers around a family taken away from their California home and placed in a camp far away. The loyalty of camp members toward the United States is tested and the conflict between a brother and sister, based on their different ideas on how to navigate their new life’s reality, heats up. Their parting of ways causes a rift in the family. There are a couple of love stories, a tragic end to one of the young lovers, and the birth of a baby. George Takei plays the grandfather of the family (who is incredibly wise and adorable) as well as the grandson as an adult. Telly Leung plays the grandson as a young man. Lea Salonga is his adoring sister. Allegiance opens with a knock on the door. Sam (Takei) is dressed in his military garb, and when he opens the door, a woman provides him with the notification that his sister, Kei (Salonga), has passed away. We find out at the end of the show who this individual that felt compelled to notify him in person was. It makes for a lovely ending. Maybe a bit schmaltzy, but heaven knows, we can all use some schmaltz these days. Lea Salonga and George Takei here Photo credit: Matthew Murphy It’s wonderful to see Lea Salonga back on a Broadway stage singing exquisitely. Telly Leung is also a fabulous singer and performer. And George Takei is clearly moved to be making his Broadway debut and relating a piece of history that he and his family actually experienced. Allegiance is a story that needs to be told. We witness the enduring spirit of people during the most trying of times, and the power of love which incites transformation and redemption. I truly enjoyed Allegiance, but worry that it is not finding its audience. Go see it. Valerie Smaldone is a 5-time Billboard Magazine Award winner and is well known for her unprecedented success holding the #1 on-air position in the New York radio market on 106.7 Life-FM, an iHeart station. She has hosted, produced, and created several award-winning nationally syndicated programs featuring in-depth interviews with stars like Paul McCartney, Celine Dion, Rod Stewart, Elton John and Mariah Carey among others. Her radio talk show \"Bagels and Broadway\" highlighted theatre and food personalities. She is an accomplished interviewer and voice artist heard on commercials, narrations, promos and audiobooks, as well as a sought after live announcer. Most recently, Valerie produced and directed a film, The Thursday Night Club, featuring pop diva Gloria Gaynor in her movie acting debut. She is one of the creators and producers of a docu-series, Divine Renovation, starring Erik Estrada, on streaming networks soon. Tags: allegiancebroadway reviewsthe three tomatoesvalerie smaldone Valerie Smaldone is a 5-time Billboard Magazine Award winner and is well known for her unprecedented success holding the #1 on-air position in the New York radio market on 106.7 Life-FM, an iHeart station. She has hosted, produced, and created several award-winning nationally syndicated programs featuring in-depth interviews with stars like Paul McCartney, Celine Dion, Rod Stewart, Elton John and Mariah Carey among others. Her radio talk show \"Bagels and Broadway\" highlighted theatre and food personalities. She is an accomplished interviewer and voice artist heard on commercials, narrations, promos and audiobooks, as well as a sought after live announcer. Most recently, Valerie produced and directed a film, The Thursday Night Club, featuring pop diva Gloria Gaynor in her movie acting debut. She is one of the creators and producers of a docu-series, Divine Renovation, starring Erik Estrada, on streaming networks soon. by Valerie Smaldone · Published November 15, 2019 by Valerie Smaldone · Published August 27, 2016 · Last modified August 28, 2016 by Valerie Smaldone · Published March 1, 2015 · Last modified July 17, 2015 by Valerie Smaldone · Published May 7, 2016 · Last modified May 6, 2016 by Valerie Smaldone · Published February 17, 2023 by Valerie Smaldone · Published January 23, 2016 · Last modified January 22, 2016 by Valerie Smaldone · Published March 13, 2020 by Valerie Smaldone · Published March 10, 2023 by Valerie Smaldone · Published October 7, 2022 by Valerie Smaldone · Published October 27, 2018 · Last modified October 26, 2018 Your email address will not be published. Required fields are marked * This site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Maybe a bit schmaltzy, but heaven knows, we can all use some schmaltz these days...'Allegiance' is a story that needs to be told. We witness the enduring spirit of people during the most trying of times, and the power of love which incites transformation and redemption...I truly enjoyed 'Allegiance,' but worry that it is not finding its audience. Go see it.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 812,
  "archivePath": "data/archives/reviews/allegiance-2015/the-three-tomatoes--valerie-samaldone_2026-02-06.html",
  "textFetchedAt": "2026-02-06T04:35:27.976Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 812,
  "tierReason": "Full review text"
}