{
  "showId": "allegiance-2015",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2015/11/theater-reviews-allegiance.html",
  "publishDate": "November 9, 2015",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nFrom Hir, at Playwrights Horizons. Photo: Joan Marcus The home that Isaac returns to at the beginning of Taylor Mac’s smart but deliberately disorienting new play Hir is not the one he left when he enlisted as a Marine three years earlier. His abusive father, Arnold, has suffered a debilitating stroke. His tomboy sister, Maxine, has begun a do-it-yourself gender transition with hormones bought on the internet, and has now emerged as his “sissy” brother, Max. Far from resenting or mourning these disruptions, Isaac’s mother, Paige, is electrified by them. Max’s escape from biology has provided a model for her own escape from the rigid control of a violent husband and housewifely expectation; she no longer cooks, cleans, or bothers to maintain any order in their nightmarishly cluttered home. (“We don’t do cupboards anymore,” she says. “We don’t do order.”) Rather, she joyfully indulges her formerly suppressed interests and preferences, from art to air-conditioning. And Arnold’s stroke has provided her with an opportunity for revenge. Drugging him into docility, she dresses him in a lavender nightgown and a bedazzled kitten sweater, with finishing touches that include elaborate drag makeup and a rainbow clown wig. He sleeps in a box on the filthy kitchen floor: “He has not earned the right to be cared for.”\n\nIf you don’t know whether to laugh or cry at this spectacle, I suspect that’s how Mac likes it; in the script he describes Hir’s genre with the oxymoron “absurd realism.” For the realism part, there is, as the title indicates, a great deal of instruction on the new prerogatives of gender: Max prefers the pronouns “ze” instead of “he” or “she,” and “hir” (pronounced “here”) instead of “his” or “her.”\n\nShow \n 0 Comments / 0 New\n \n Comment\n \n\n Theater Reviews: Hir and Allegiance\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "dtliExcerpt": "Allegiance is a musical with its heart in the right place but its craft all over the map. The show, about Japanese-American internment during World War II, has important things to say but doesn't always know how to say them theatrically.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Allegiance is a musical with its heart in the right place but its craft all over the map. The show, about Japanese-American internment during World War II, has important things to say but doesn't always know how to say them theatrically.",
  "contentTier": "complete",
  "contentTierReason": "Short text (41 words)",
  "previousUrl": "https://www.vulture.com/2015/11/theater-review-allegiance.html",
  "urlDiscoveredAt": "2026-02-03T11:25:22.555Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 337,
  "archivePath": "data/archives/reviews/allegiance-2015/vulture--jesse-green_2026-02-03.html",
  "textFetchedAt": "2026-02-03T11:25:22.565Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 337,
  "tierReason": "Full review text"
}