{
  "showId": "the-bridges-of-madison-county-2014",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2014/legit/reviews/broadway-review-the-bridges-of-madison-county-1201089953/",
  "publishDate": "February 20, 2014",
  "fullText": "Feb 20, 2014 7:00pm PT \n\n \n\n \n \n \n\n \n\n \n Broadway Review: ‘The Bridges of Madison County’\n \n \n\n \n\n Stars Kelli O'Hara and Steven Pasquale are in fine voice, but this musical adaptation of the sappy 1992 novella turns the material into a quasi-operatic beast.\n\nEverybody knows that playwrights shouldn’t direct their own plays. But composers might also think twice about doing their own orchestrations. In an intimate house, Jason Robert Brown’s lushly melodic score for “The Bridges of Madison County” would seem a proper fit for Marsha Norman’s book, which is gushy but more literate than Robert James Waller’s mawkish 1992 novella about soulful lovers in a hopeless adulterous affair. But although Kelli O’Hara and Steven Pasquale are in glorious voice as this passionate pair, the bombastic orchestrations and Bartlett Sher’s overstated helming inflate the production into some quasi-operatic beast that thinks it’s “Aida.”\n\nO’Hara’s soaring dramatic soprano (showcased in Sher-helmed musicals “South Pacific” and “Light in the Piazza”) is sweet and true enough to earn her a pass on the atrocious accent she struggles with as Francesca Johnson, an Italian war bride slowly turning to dust as a farmer’s wife in 1960s Iowa. It’s harder to reconcile her youthful bloom with the character of a middle-aged housewife and worn-out mother of two teenagers, especially when those corn-fed farm kids stand taller and look older than she does.\n\nCasting young may have won the dynamic leads, but it also cost the production the powerful emotional tug of watching two middle-aged people work up the courage to make one last grasp at happiness — as both the original novel and the subsequent film adaptation starring Clint Eastwood and Meryl Streep would have it.\n\nDespite being miscast, the lovely O’Hara is a great match with Steven Pasquale (“Rescue Me”), whose good looks and dreamy tenor make an attractive hero of Robert Kincaid, a National Geographic photographer assigned to do a feature on Iowa’s famous covered bridges. Coming upon Francesca among the alien corn, the world-weary Robert is at first intrigued and then enchanted by this exotic flower, out of her element and parched for love.\n\nOnce they fall into one another’s arms, there’s no dearth of love songs for the lovers in Brown’s swoony score. There’s real yearning in ballads like “Falling Into You,” “Who We Are & Who We Want to Be,” “One Second & a Million Miles” and “When I’m Gone,” although the histrionic approach too often shoves that tender emotion over the cliff into high tragedy.\n\nIt hardly needs saying that the covered bridge that brings Francesca and Robert together — the central image of both the book (three years on the best-seller list) and the1995 movie (an Academy Award nomination for Streep) — is a crucial visual. But there’s no covered bridge in sight here, just assorted pieces of lumber suspended in midair, along with other scraps of scenery (was that a fence?) floating around on set designer Michael Yeargan’s abstract stage.\n\nPlayed against a color-drenched cyclorama of sunrises, sunsets, endless cornfields and infinite blue skies (all of this enhanced by Donald Holder’s dramatic lighting design), the fragile intimacy of Francesca’s and Robert’s four-day love affair is in constant danger of being swallowed up by the vast emptiness of the landscape. But while the highly stylized staging best conveys Francesca’s existential loneliness — that uneasy feeling of being a lost traveler in a strange and hostile land — it doesn’t address her social alienation in the real world of 1960s rural Iowa.\n\nFrancesca is even an outsider in her own family. Her dull, stolid farmer-husband, Bud (an understandably glum Hunter Foster), and annoying children (Caitlin Kinnunen and Derek Klena, doing nothing to advance their careers) are hollow caricatures of farm folk, but at least they’re recognizably human. At the end of a long day at the Iowa State Fair with the kids, Bud gets a little drunk and calls home. Picking up on his wife’s distracted tone, he sings a deeply felt but poignantly inarticulate song (“Something From a Dream”) about the feelings he can’t express and doesn’t even seem to understand.\n\nWhile Robert’s first wife, Marian, doesn’t have a single line of dialogue, the ethereal Whitney Bashor materializes for one exquisite song, “Another Life,” sung from a broken heart. Like Bud’s cri de coeur, it’s the subdued lament of someone who loves but isn’t loved back, and it’s as painfully moving as any of the triumphal anthems (which tend to blur into one another) sung by those true soulmates Francesca and Robert. Although he seems to think he’s slumming when he writes from a still, quiet place, Brown has an intimate knowledge of such places in the heart.\n\nOutside the sanctuary of the love affair, it’s one big wasteland out there. There’s absolutely no sign of all those shopkeepers and schoolmarms and barbers and preachers and hired hands and town gossips you’d expect to find in a real town. In their place is a shadowy army of zombies, mute ciphers in drab work clothes and flour-sack dresses who mill about the stage shaking their heads and scowling in disapproval of Francesca’s adulterous affair. The obvious if debatable point is that no one in the American heartland ever gets up to any hanky-panky, and if they did, they would be ostracized by the entire community.\n\nBut the zombie population doesn’t really count as community, and the only two human characters within walking distance of the farm — garrulous neighbor Marge (Cass Morgan, overacting up a storm) and her dour farmer husband Charlie (Michael X. Martin) seem sympathetic to Francesca’s plight. Marge takes it a step further and becomes complicit in her neighbor’s romantic affair. Zombies or no zombies, she’d probably run off with Robert herself.\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice.",
  "isFullReview": true,
  "dtliExcerpt": "This is a show that knows how to break your heart without making you feel manipulated or cheated. It earns its tears the hard way, through honest storytelling and emotional truth.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This is a show that knows how to break your heart without making you feel manipulated or cheated. It earns its tears the hard way, through honest storytelling and emotional truth.",
  "contentTier": "complete",
  "contentTierReason": "Short text (31 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://variety.com/interstitial/?ref=http%3A%2F%2Fvariety.com%2F2014%2Flegit%2Freviews%2Fbroadway-review-the-bridges-of-madison-county-1201113109%2F",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "textWordCount": 1061,
  "archivePath": "data/archives/reviews/the-bridges-of-madison-county-2014/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:16:35.993Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 1061,
  "tierReason": "Full review text"
}