{
  "showId": "the-bridges-of-madison-county-2014",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2014/02/theater-review-the-bridges-of-madison-county.html",
  "publishDate": "February 21, 2014",
  "fullText": "The Bridges of Madison County is a musical that knows exactly what it wants to be: a gorgeous, grown-up love story that doesn't apologize for its sentimentality.",
  "isFullReview": false,
  "dtliExcerpt": "The Bridges of Madison County is a musical that knows exactly what it wants to be: a gorgeous, grown-up love story that doesn't apologize for its sentimentality.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "The Bridges of Madison County, though based on an insipid novel, is a very serious musical indeed, both rapturous and moral, with a gorgeous score by Jason Robert Brown. It is also one of the few recent Broadway shows to take up the challenge laid down by the great midcentury works of R&H and their cohort: to tell stories that weld important sociological upheavals to personal conflicts and somehow make them sing...the leading performances, shaped by Sher to preserve a sense of character modesty within the vocal extravagance, are exemplary. Kelli O'Hara, who plays Francesca, is never better than when working from loss and confusion; her prettiness has always contained more than a hint of hurt, which gives her voice its richest colors...And barihunk Steven Pasquale, as Robert, who starred opposite O'Hara in Far From Heaven off Broadway last spring...at last gets a chance to be heard singing on Broadway. He was worth the wait.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The Bridges of Madison County is a musical that knows exactly what it wants to be: a gorgeous, grown-up love story that doesn't apologize for its sentimentality.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (27 words)",
  "textQuality": "truncated",
  "bwwScore": 8,
  "sources": [
    "web-search",
    "bww-reviews"
  ]
}
