{
  "showId": "golden-boy-2012",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2012/legit/reviews/golden-boy-1117949065/",
  "publishDate": "December 6, 2012",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Director Bartlett Sher has staged a handsome production that captures both the period atmosphere and the universal themes of Clifford Odets' 1937 drama about a violinist who trades his music for a career in boxing.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "What are the odds of a commercial producer being able to finance the revival of a three-act straight play calling for some 20 thesps decked out in pricey period costumes and performing on a multi-unit set? That sort of reclamation work is generally left to nonprofit theaters, which operate with publicly assisted funding. A half-dozen years after honoring that mandate with his muscular Lincoln Center revival of Clifford Odets' 'Awake and Sing,' Bartlett Sher returns to the helm with a dynamite version of 'Golden Boy.' It's no act of charity, either, because the show is killer good.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Director Bartlett Sher has staged a handsome production that captures both the period atmosphere and the universal themes of Clifford Odets' 1937 drama about a violinist who trades his music for a career in boxing.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (35 words)",
  "rejectedAt": "2026-02-03T16:53:37.236Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a brief excerpt or summary sentence rather than a full review with critical evaluation and recommendation; openai: The text is a brief description of the production's staging and themes without any evaluative content or recommendation.",
  "promptVersion": "5.2.0",
  "bwwScore": 9,
  "sources": [
    "web-search",
    "bww-reviews"
  ],
  "textWordCount": 401,
  "archivePath": "data/archives/reviews/golden-boy-2012/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:58:02.229Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "There is more mood than matter to appreciate in \"Fynbos,\" a low-key suspenser that masterfully sustains tension with elliptical storytelling and evocative atmospherics, but ultimately comes across as all buildup and no payoff.\n\nThere is more mood than matter to appreciate in “Fynbos,” a low-key suspenser that masterfully sustains tension with elliptical storytelling and evocative atmospherics, but ultimately comes across as all buildup and no payoff. Despite ace production values — lensing and sound design are particularly effective — this South African-produced pic isn’t likely to travel far beyond the global fest circuit.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Battlefield 6' Launch Drives Record Sales for Electronic Arts in Latest Quarterly Earnings \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Comcast Q4 Sees Fall in Cable Revenue, Wider Peacock Losses, Despite Boost in Ads, Wireless, Theme Parks\n\nOpening scenes establish the mental instability of Meryl (Jessica Haines), who fakes her own mugging for unexplained reasons, strongly suggesting that nothing else she recounts, not even the brutality of her husband, Richard (Warrick Grier), which she references in her journal, should be accepted at face value.\n\nStill, it’s easy to believe Richard, an insolvent real-estate developer, is capable of violent rages, given his steadily increasing stress as he attempts (and fails) to hide his desperation while trying to unload the Fynbos Estate, a luxurious glass house and surrounding land near a remote township. Hoping to sell the place to two Brit siblings (Susan Danford, John Herbert), he invites the pair to spend the night at Fynbos with him, Meryl, part-time house-sitter VJ (Chad Philips) and VJ’s brazenly sexy girlfriend Renee (Cara Roberts).\n\nRichard is so intent on closing the deal that he’s slow to react when Meryl disappears from the secluded estate. That, or he hesitates to call the cops because, for one reason or another, he doesn’t want her to be found.\n\nAll the lead players convey intriguing ambiguities, some more intriguing than others, while Sthandiwe Kgoroge makes the most of a key supporting role — a politely inquisitive police officer — by hinting that she, too, may be holding a few cards close to her vest. Pacing is aptly deliberate, as helmer Harry Patramanis, working from a spare script he co-wrote with Jonathan Kyle Glatzer, makes efficient use of pregnant pauses and ambient sound.\n\nUltimately, however, “Fynbos” doesn’t come to a conclusion so much as simply end, abruptly, in a manner certain to frustrate auds who get caught up in its idiosyncratic rhythms."
}