{
  "showId": "golden-boy-2012",
  "outletId": "vulture",
  "outlet": "New York Magazine",
  "criticName": "Scott Brown",
  "url": "http://www.vulture.com/2012/12/theater-review-golden-boy.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Sher’s found a nice beachhead beyond the squabbles between irony and its discontents: It’s a place where the tune calls the piper, not to other way around. To paraphrase the Coen-ization of Odets: You’re gonna be hearing about this show. And I don’t mean a postcard.",
  "bwwScore": 8,
  "contentTier": "complete",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nTony Shalhoub, Seth Numrich, and Danny Burstein in Golden Boy.\n Photo: Paul Kolnik\n \n \n \n There are, walking around today, whole generations of theatergoers with no firsthand experience of Clifford Odets’s plays—not in-performance, anyway. Count me among ’em. Having grown up in the Jewless, right-wing suburbs of Reagan’s South, I can sum up my precollege knowledge of Clifford Odets in two words: Barton Fink. (At the time, it didn’t even sink in that Barton was an Odets caricature. Or a leftist. Or a Jew. Or anything deeper than a “random” Coen-brothers joke about a stuck-up nerd in over his eraserhead.) Sure, plenty of us read Waiting for Lefty and got a primer on the Group Theatre in college … but what we actually went and saw was Urinetown, that post-ideological, tongue-in-cheek remix of the Odets gestalt. Odets himself was relegated, by academia and the marketplace both, to the artless wastes of polemic. No reclamation was underway back when my theater tastes were being established.\n\nAs a result, it’s been damned hard to stage Odets’s hot-pink melodramas for decades: Irony levels have been too high and consumerist class-denial too entrenched, and the New Dealism that fueled the playwright’s angry, hopeful, hormonal anticipation of an egalitarian future has been extinct for a half-century. So how did Bartlett Sher pull off a 75th anniversary production of Golden Boy, Odets’s 1937 morality play about a young boxer torn between his ambition and his humanity? By tapping the Occupy movement in some superficial way? Nope. By linking the play to something hyper-topical, like, I dunno, the NFL’s concussiongate? Nyet. In fact, Sher backseats “concept” entirely, tucks it into the shadows with Michael Yeargan’s ghostly suggestion of a set, and instead amps up the sound of Odets, the musical palookaspeak that might represent his greatest contribution to the American Voice on stage and screen. For instance, this exchange:Where do you come from? The city’s full of girls who look like they never had parents.I’m a girl from across the river. My father is still alive. Shucking oysters and bumming drinks somewhere in the wilds of Jersey. I’ll tell you a secret: I don’t like you.(Yeah, there’s a reason why Hollywood wanted to co-opt Odets.) This is a Golden Boy that’s as much sung as performed, and Sher has assembled one hell of a tabernacle choir to sing it. Even better, he’s managed to keep everyone in the same mighty key. On lead power-tenor is the young Seth Numrich, in a white-hot performance as Joe Bonaparte, a gifted if “cockeyed” scrapper and even more gifted violinist. (This is Odets, so a storyline grafted off a vaudeville gag—“will I ever play the violin again, Doc?”—can be pulled off with a straight face and not even a spritz of irony.) Joe’s immigrant father (Tony Shalhoub, heartbreakingly adroop) doesn’t want him fighting; he wants to see those killer mitts caressing a Strad, not bludgeoned into blunt instruments. Tortured Lorna (Yvonne Strahovski), long-suffering moll to Joe’s schnook of a manager Tom (Danny Mastrogiorgio), eventually comes to the same conclusion: See, Lorna’s falling for Joe—not the fighter but the lover, the artist, the musician, the ennobler of the human spirit. (Again, this being Odets, those are all the same thing.) But Joe, believing himself all wised up, is under the thrall of a real wiseguy, Eddie Fuselli (Anthony Crivello), decadent animal spirit of capitalism. And the kid’s just naive enough to believe fights can be won and just cynical enough to think money can buy happiness. Yep, this is broad, brassy grand opera—and every voice on stage belts it from the gut. That’s where it’s gotta come from. These aren’t parts written for an airy head voice. Archetypes rather than characters populate Golden Boy, editorial cartoons not too different in composition (tone aside) from those in a Coen sketch. (I mean, wow: “You’re a miserable creature. You want your arm in gelt up to the elbow … But every time you turn your back your little soul kicks you in the teeth. It don’t give in so easy.”) But Sher, after a slightly sludgy adjustment period in the first (of three!) acts, hits a nice stride, establishing an interest in sincerity, not realism. We’re somewhere between Puccini and John Bunyan here, and Sher doesn’t so much direct as conduct his performers. (One wonders what he’d do with Charles Strouse’s 1964 musical version of Golden Boy—though, one is also kind of relieved not have to find out.) The tonal management on display here is tremendously impressive: Shalhoub, for instance, must deliver an entire show in a red-sauce accent, yet his performance is among the most restrained, the most meticulous. The superb Strahovski, an Australian actress in her Broadway debut, takes a tough-as-nails dame straight out of the genre nickelodeon and turns her into a tragic heroine of Toscan dimensions. Underneath all those top notes, Danny Burstein purrs an aching baritone of resignation as Joe’s trainer. Crivello’s so over-the-top as the oily Fuselli, he nearly throws off the balance—but Sher always keeps the choir together, and unleashes the full incandescent adolescence of Odets’s passion. Maybe we’re wise to the tantrums of the twentieth century’s lost youth, and maybe we’re not. But when these lost souls lift up their voices and put up their fists, we can’t help taking notice. Sher’s found a nice beachhead beyond the squabbles between irony and its discontents: It’s a place where the tune calls the piper, not to other way around. To paraphrase the Coen-ization of Odets: You’re gonna be hearing about this show. And I don’t mean a postcard.\n\nGolden Boy is at the Belasco Theatre through January 20.\n\nThings you buy through our links may earn Vox Media a commission.\n\nEditor’s Picks\n \n \n \n \n \n \n \n \n the money game\n \n A Million Electric Vehicles Were Sold This Year. Here’s Why It’s a Problem.\n A Million Electric Vehicles Sold This Year Is a Problem\n \n \n \n \n \n \n \n \n \n \n ask amy sedaris\n \n What Do I Get My Boring Father-in-Law?\n What Do I Get My Boring Father-in-Law?\n \n \n \n \n \n \n \n \n \n \n holiday gifts 2023\n \n The Gifts the Strategist Editors Will Be Giving\n The Gifts the Strategist Editors Will Be Giving\n \n \n \n \n \n\n \n\n \n \n \n Sign In to Comment\n \n\n \n \n Most Popular\n \n\n \n \n \n \n Leave the World Behind Doesn’t Know What to Do With the Apocalypse\n \n \n \n \n \n \n Sam Esmail Didn’t Mean for Leave the World Behind to Be So Timely\n \n \n \n \n \n \n In The Boy and the Heron, the ‘Lie’ Is the Point\n \n \n \n \n \n \n The 12 Best Movies and TV Shows to Watch This Weekend\n \n \n \n \n \n \n A Festive Guide to the Best New Holiday Movies and TV Specials to Watch\n \n \n \n \n\n \n \n \n \n Sam Esmail Didn’t Mean for Leave the World Behind to Be So Timely\n \n \n \n \n \n \n Leave the World Behind Doesn’t Know What to Do With the Apocalypse\n \n \n \n \n \n \n In The Boy and the Heron, the ‘Lie’ Is the Point\n \n \n \n \n \n \n A Festive Guide to the Best New Holiday Movies and TV Specials to Watch\n \n \n \n \n \n \n Brand New’s Jesse Lacey Solicited Child Pornography From a Teenager for Years\n \n \n \n \n\n \n\n \n \n \n\n \n \n\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n\n \n \n Email\n \n \n\n \n \n You\\'ll receive the next newsletter in your inbox.\n \n \n *Sorry, there was a problem signing you up.",
  "isFullReview": true,
  "textWordCount": 1173,
  "archivePath": "data/archives/reviews/golden-boy-2012/vulture--scott-brown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:58:05.552Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20231209213635",
  "archiveOrgUrl": "http://web.archive.org/web/20231209213635/https://www.vulture.com/2012/12/theater-review-golden-boy.html",
  "wordCount": 1173,
  "tierReason": "Full review text"
}