{
  "showId": "ragtime-2009",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2009/legit/reviews/ragtime-1200476227/",
  "publishDate": "November 15, 2009",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "This stirring revival of the 1998 Tony winner for best musical proves that Lynn Ahrens and Stephen Flaherty's adaptation of E.L. Doctorow's novel has lost none of its emotional power or social relevance.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This stirring revival of the 1998 Tony winner for best musical proves that Lynn Ahrens and Stephen Flaherty's adaptation of E.L. Doctorow's novel has lost none of its emotional power or social relevance.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 510,
  "archivePath": "data/archives/reviews/ragtime-2009/variety--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:55:49.846Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (507): Request failed with status code 507"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "A wacky existential riff on cause and effect.\n\nNipponese tube comedian Hitoshi Matsumoto sets out to amuse, bamboozle and enlighten in his sophomore feature, “Symbol,” a wacky existential riff on cause and effect. After his surprise Cannes 2007 debut, “Dai Nipponjin,” fans might think they’re ready for anything. But this comedic version of Shinya Tsukamoto’s “Haze” with a “2001: A Space Odyssey”-style coda, combined with a strand about a Mexican wrestler, is way out left field. Side-splitting pic will delight Japanese auds familiar with Matsumoto’s TV antics. International preem at Toronto will ensure more fest slots and the helmer’s Western ancillary cult will continue to build.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Bendita Film Sales Acquires Welf Reinhart’s Rotterdam Premiere ‘A Fading Man’: ‘It’s About a Love Story’ (EXCLUSIVE) \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Paralyzed by Hope: The Maria Bamford Story' Shares the Tears, Fears, Insights of a Unique Clown\n\nOn a dusty plain at the foothills of a Mexican mountain range, a cigarette-smoking nun (Adriana Fricke) drives a speeding pickup truck to assist a remote family in need of transport. The family is headed by a snail-masked wrestler known as Escargot Man (David Quintero) who has a major bout scheduled that afternoon.\n\nElsewhere, about a reel in, a nameless man in luminous polka-dot pajamas (helmer Matsumoto in a Beatles wig) awakens in an antiseptic white room. Unsure of his surroundings, he explores the room’s unblemished surfaces and eventually finds a button that, when, pushed, causes a fleeting heavenly apparition to appear and leaves many more buttons on the room’s surface. Like a rat in a Skinner box, the man keeps pushing buttons, triggering the automatic dispensation of apparently useless items including beach balls, chopsticks and Greek urns. Irreverence and Matsumoto’s impeccable timing skilfully exploit comic tension.\n\nLater buttons not only provide food (sushi, natch) but a possible escape hatch. The protag’s problem is that the escape hatch is on the opposite side of the room from the button that must be pushed to make it appear. The pajama man is hilarious as he exhausts himself with plans to keep the button depressed long enough for him to reach the exit.\n\nScript frequently shuffles the two apparently unrelated strands; those anticipating a link will be rewarded with an outlandish gag. But the helmer uses the connection as a toehold to go in an unexpected direction. Final reels may feel faux-profound to some, but Matsumoto has entertained sufficiently to earn trust and indulgence. Like Takeshi Kitano and Woody Allen before him, Matsumoto is determined to show his existential side; however, even in “serious” mode, an extended setup about a Kiss tribute band shows the comedian’s humor is more Buster Keaton than Samuel Beckett.\n\nAs a performer, Matsumoto is an uproarious delight, and the Mexican thesps are authentic enough to keep auds engaged in a seemingly pointless narrative.\n\nMexico scenes employ wobblecam for no apparent reason, but in the “Cube”-like scenes of the pajama man, the helmer exhibits flawless precision. Quality special effects amuse and awe in equal measure; sound effects and music are well used to embellish the comical scenario."
}