{
  "showId": "hand-to-god-2015",
  "outletId": "guardian",
  "outlet": "Guardian",
  "criticName": "Alexis Soloski",
  "url": "https://www.theguardian.com/stage/2015/apr/08/hand-to-god-review-blasphemous-puppet-show-is-a-filthy-triumph",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup",
    "playbill-verdict"
  ],
  "bwwExcerpt": "It's not a lot more irreverent than The Book of Mormon, but it is a lot dirtier and there are no dance numbers. Askins's script, directed by Moritz von Stuelpnagel, often betrays an adolescent desire to shock and scandalise. Monologues that open and close the show spell out the religious critique too baldly. Some of the motivations are explained away tidily and a lot of the humour is puerile. But the puerile bits are particularly funny. (Though be forewarned: puppet fellatio is something you can't unsee.) Askins is smart and engaged enough that even the play's most outrageous actions seem grounded in character. Speaking of characters and those who play them, if Steven Boyer's name isn't on the best actor ballot come Tony time, then those awards are broken. Boyer, a slight and moon-faced blond who looks at least a decade younger than he is, plays both Jason and Tyrone, most often at the same time.",
  "bwwScore": 8,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-HAND-TO-GOD-Opens-on-Broadway-Updating-Live-20150407",
  "playbillVerdictUrl": "http://www.theguardian.com/stage/2015/apr/08/hand-to-god-review-blasphemous-puppet-show-is-a-filthy-triumph",
  "showScoreExcerpt": "\"A savage, often hilarious, and profoundly irreligious satire...it’s not a lot more irreverent than \"The Book of Mormon\", but it is a lot dirtier and there are no dance numbers. Askin's script often betrays an adolescent desire to shock and scandalise...Some of the motivations are explained away tidily and a lot of the humour is puerile. But the puerile bits are particularly funny. Askins is smart and engaged enough that even the play’s most outrageous actions seem grounded in character.\"\n\nRead more"
}
