{
  "showId": "hand-to-god-2015",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/hand-god-theater-review-787041/",
  "publishDate": "April 7, 2015",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Steven Boyer gives a tour de force performance as Jason, the meek teenager whose hand puppet becomes a foul-mouthed, sexually aggressive id unleashed.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Bold new American plays by unestablished dramatists too seldom make it to Broadway, so this commercially risky endeavor - a challenge approached head-on by producers in their amusing marketing campaign ­- is to be applauded. The show also brings a welcome breath of fresh air via a director, Moritz von Stuelpnagel, new to the commercial theater mainstream, and a talented ensemble of five actors, only one of whom, Marc Kudisch, is a Broadway regular. The sharp production has evolved over two hit off-Broadway incarnations, increasing in size with each move, and it now sits quite snugly in the still-intimate confines of the Booth Theatre...Director von Stuelpnagel and his terrific cast tackle this darkly funny material with a shrewd balance of heightened reality, warped sitcom and underlying pathos, landing all the jokes while never denying the genuine sorrow and anger driving both Jason and Margery to such erratic behavior...The five actors couldn't be better...But the real virtuoso performance is Boyer's. Whether trembling with fear as the deeply unhappy, reedy-voiced Jason or with power-crazed tyranny, wild irreverence and thundering rage as Tyrone, he creates two entirely distinct characters that give the illusion of existing independently of one another. Together, they somehow add up to one messed-up but affectingly real kid. Forgive the pun, but Boyer deserves a big hand.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-HAND-TO-GOD-Opens-on-Broadway-Updating-Live-20150407",
  "showScoreExcerpt": "Steven Boyer gives a tour de force performance as Jason, the meek teenager whose hand puppet becomes a foul-mouthed, sexually aggressive id unleashed.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (23 words)",
  "rejectedAt": "2026-02-03T16:36:07.382Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt describing a performance, not a complete review with any evaluative verdict or recommendation.; openai: This text is a brief mention of a performance without any evaluative content about the show as a whole.",
  "promptVersion": "5.2.0",
  "textWordCount": 1180,
  "archivePath": "data/archives/reviews/hand-to-god-2015/hollywood-reporter--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:15:10.741Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "It took 15 seasons for Law & Order: SVU to make a mother out of Olivia Benson (Mariska Hargitay), but now there’s no slowing her down. Following several health crises earlier this season, baby Noah catches the measles on Wednesday’s new episode in the midst of a potentially dangerous outbreak.\n\n“Because his immune system has been compromised, Olivia delayed getting him his measles vaccine until he was healthier,” says showrunner Warren Leight. “That’s a bad setup for her.”\n\nLaw & Order: SVU is well versed at ripping from the headlines. But even Leight admits the writers “struggled to find a way” to write about the recent measles outbreak in California on a show devoted to sex crimes. In the episode, SVU begins investigating pornographic photos from a high school house party when several suspects in the case are diagnosed with the measles. “We got there,” says Leight. “But it was a journey to get there.”\n\nAnd the journey is far from over for Sgt. Benson and her team. The Hollywood Reporter spoke with Leight about the upcoming trial of Noah’s paternal father, Olivia’s search for a No. 2, and some possible romance in season 17.\n\nYou earned an early renewal in February. How has that affected your storytelling?\n\nIt let me arc out a season knowing there was another one to come, knowing that I could put seeds in for things that I hope will sprout next season as well. We still adhere to the self-contained storyline format, but we really have been doing a lot more long-form storytelling. It allowed the show to breathe a little bit.… Where will baby Noah go? What’s his storyline going to be? I could think in a different time frame about things like that. Some of it will be made more clear by the end of the season, but it allowed us to make some turns that we might not have otherwise been able to.\n\nWhat are some of these seeds that will start popping up as the season comes to a close?\n\nWe had one episode in which we found out that this horrible pimp Johnny D. is actually Noah’s father, and we’re going to be heading to the trial of Johnny D. in the final episode of the season. That trial is more complicated because we’re also heading to the adoption of baby Noah by Olivia at the end of the season.\n\nWhat is Olivia’s mind-set going into this final episode? She has had a lot of challenges with Noah this season.\n\nOlivia is fierce. She’s had, in prior seasons, foster kids taken from her care. She does not want to let that happen. She knows the system better. She’s doing everything she can, and I think she had a little bit of a reality check that you can’t work 24 hours a day and be the single parent of a one-year-old with health issues. She had to actually learn, and is still learning, to delegate a little more.… She has to prioritize, so we’ll be seeing her begin to search for a No. 2 in the station house. Is somebody going to step up and take the Sergeant’s exam is another story point that’s going to be coming up toward the end of the season – someone that she can delegate to a little more.\n\nWednesday’s episode also deals with Amaro and his son. What can you say is coming up for him?\n\nAmaro is having a tough year here. Things haven’t broken his way. That marriage is obviously gone. His wife and kid are in California, and now Gilberto’s family, we’re learning, may be moving as well. He’s looking for a change or a role in this episode and trying to connect to his son and stay connected to his son. He’s dealing with the reality of not being where you want to be in your life at 40. I think he thought everything was laid out, the way some men do, and the last thing they thought they’d be is alone at 40. That’s also part of the last third of this season: watching him try to find his place in a post-family world.\n\nDoes that mean he might be the person who applies to be Olivia’s No. 2?\n\nThat’s in play. What is everyone’s status? Can she stay on as acting commander and chief of the squad? Does she need to step up and take the Lieutenant’s exam? If she does, does anyone step up with her? We always like to play the reality as much as we can, which is they’ll stick a sergeant in that job for a while, but eventually they’re going to want somebody in there with a higher pay grade. If she doesn’t step up, does that mean an outsider is coming in? These are the questions that are being asked as the season winds down.\n\nAre you thinking about adding a new face to the show?\n\nWe’re beginning to try to have some outside influence on the squad room so it’s not quite so insular as it got over the years.… We may float a few people in from time to time next year on their way to other places.\n\nOne of those people is Tucker (Robert John Burke), and he recently took Olivia out for a drink. What can you say about Olivia and him going forward?\n\nTucker is evolving as a human being, and he has respect and affection for Olivia. At this point they’re like old warriors who’ve gone to battle so many times, they probably have more in common than she does with the young folk in her squad room.\n\nIs that a romance something you’re thinking about pursuing next season? Before Noah, fans used to speculate a lot about her love life.\n\nIn the first year of being a single parent with an immune-suppressed infant while running a squad room, the chances for romance have been few. I think it is one of the questions we have for next year: Will that turn for Olivia? I don’t think she needs a romantic partner to be complete. I think sometimes people want that for her.… Her life has changed and I think for the better, and there’s more balance. She can see Tucker as a human, and maybe there is some common ground there. He’ll be seen a bit more in the final episodes of the season.\n\nLaw & Order: SVU airs Wednesday at 9 p.m. on NBC.\n\nFilter IconClear checkbox label labelApply CancelConsent Leg.Interest checkbox label label checkbox label label checkbox label label Confirm My Choices\n \n \n \n \n \n \n\nListen nowListen to this article now6 min listenPowered byTrinity Audio00:0006:05\n\nEnglishDeutschFrançaisEspañol中文Italiano\n\n \n \n \n \n\n10101.0x0.50.60.70.80.91.01.11.21.31.41.51.61.71.81.92.0\n\n \n \n \n \n\n1.0x\n\n \n \n \n \n \n \n \n An error has occurred\n \n\n \n \n \n \n \n \n \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n Get the Today in Entertainment Newsletter\n\nA daily brief about what matters and what's interesting in Hollywood.\n\nBy providing your information, you agree to our\n Terms of Service\n and our\n Privacy Policy. We use vendors that may also process your information to help\n provide our services.\n\nYou’re signed up for the Today in Entertainment newsletter\n\nSave on The Definitive Voice of Entertainment News",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/hand-god-theater-review-786761",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 9
}
