{
  "showId": "hand-to-god-2015",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2015/04/08/theater/review-hand-to-god-features-a-foul-talking-puppet.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup",
    "show-score-playwright"
  ],
  "bwwExcerpt": "In a Broadway season dominated by the usual fodder - musicals new and old, and a healthy serving of Important British Dramas - Mr. Askins's black comedy about the divided human soul, previously seen in two separate Off Broadway runs, stands out as a misfit both merry and scary, and very welcome...Mr. Boyer's performance as Jason is tender and touching, his performance as Tyrone outlandish and hilarious; put them together and you have that rarely seen (although often hailed) acting achievement: a true tour de force...What makes the play so sneakily resonant is how Mr. Askins exposes the base impulses, the sexual, self-destructive, potentially violent ones, that just about everyone harbors to some small degree... Pick up a newspaper and you read another grim report about men and women little older than Jason succumbing to far more destructive passions. Maybe if more of the world's troubled youth discharged their demons with the help of sock puppets, things might not look so grim.",
  "bwwScore": 8,
  "contentTier": "needs-rescrape",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-HAND-TO-GOD-Opens-on-Broadway-Updating-Live-20150407",
  "fullText": "https://www.nytimes.com/2015/04/08/theater/review-hand-to-god-features-a-foul-talking-puppet.htmlShare full article45Advertisement\n\nStand down, Inspector Javert, vengeful foe of bread-snatchers. A more formidable villain now stalks the Broadway boards, one who makes you seem about as frightening as a French pastry. His name, Tyrone, is not the scariest handle, but he’s as ruthless as any dedicated evildoer, with a spectacularly foul mouth and a thirst for young flesh.\n\nOh, and he’s also made of a gray sock, some felt and a fringe of fake fur. The terrible Tyrone is, in short, a hand puppet.\n\nIf you imagine that to be merely a punch line, forget it. The fearsome critter, who takes possession of a troubled teenager’s left arm in Robert Askins’s darkly delightful play “Hand to God,” really inspires goose bumps as he unleashes a reign of terror on that teenager, Jason, and everyone in his orbit. But unlike the grim Javert, he’s also flat-out hilarious, spewing forth acid commentary that will turn those goose bumps into guffaws.\n\n“Hand to God” popped open on Tuesday at the Booth Theater like a cackling jack-in-the-box, scaring away (really) a couple of audience members at the performance I caught, but bringing peals of joy to most everyone else. In a Broadway season dominated by the usual fodder — musicals new and old, and a healthy serving of Important British Dramas — Mr. Askins’s black comedy about the divided human soul, previously seen in two separate Off Broadway runs, stands out as a misfit both merry and scary, and very welcome.\n\nThe innocuous setting is a church basement in suburban Texas, where posters on the walls chirp cheery thoughts about Jesus. Here Jason, played by the sensational Steven Boyer, sits glumly, trying (and failing) not to look mortified as his mother, Margery (Geneva Carr), prepares a small group of volunteers for a Christian puppet show.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 326,
  "archivePath": "data/archives/reviews/hand-to-god-2015/nytimes--charles-isherwood_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:34:00.027Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250715144323",
  "archiveOrgUrl": "http://web.archive.org/web/20250715144323/https://www.nytimes.com/2015/04/08/theater/review-hand-to-god-features-a-foul-talking-puppet.html",
  "duplicateTextOf": "nytimes--ben-brantley.json",
  "wordCount": 326,
  "tierReason": "Full review text",
  "showScoreExcerpt": "\"In a Broadway season dominated by the usual fodder — Mr. Askins’s black comedy about the divided human soul stands out as a misfit both merry and scary, and very welcome...You can enjoy “Hand to God” merely as a festival of filthy hilarity..but as I watched the play this year, for the third time, I found myself peering more closely into its psychological depths, and finding in it a weird mirror of our unsettling times. \"\n\nRead more",
  "rejectedAt": "2026-02-05T14:58:24.270Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is cut off mid-article with a technical error message about JavaScript and retrieving content, making it impossible to determine the critic's full verdict.; openai: The text is incomplete and includes a technical error message about retrieving article content, making it unsuitable for scoring.",
  "promptVersion": "5.2.0"
}
