{
  "showId": "the-collaboration-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2022/12/20/the-collaboration-warhol-and-basquiat-a-bit-on-the-animatronic-side/",
  "publishDate": "2022-12-20T20:58:09",
  "fullText": "As his latest theatrical effort once again demonstrates, Anthony McCarten never met a historical figure he didn’t like. The playwright/screenwriter has previously written works about such real-life figures as Freddie Mercury (Bohemian Rhapsody), Winston Churchill (The Darkest Hour), Stephen Hawking (The Theory of Everything), and Whitney Houston (the upcoming bio-pic I Wanna Dance with Somebody). He’s particularly fond of presenting notable personages interacting with each other; Pope Benedict and Pope Francis in The Two Popes, Neil Diamond and his younger self in A Beautiful Noise, and now Andy Warhol and Jean-Michael Basquiat in The Collaboration, receiving its Broadway premiere after previously being presented at London’s Young Vic. McCarten’s next work involves the friendship between Warren Buffett and Bill Gates. You begin to worry that at the rate he’s going, he’ll run out of famous people to write about.\n\nThese films and plays have varied in quality, but they generally present juicy opportunities for notable actors to show off their accent skills while donning fun costumes and elaborate make-up. It’s no accident that they frequently find themselves accepting awards. There’s something about actors playing famous people that seems to excite performers and viewers alike.\n\nThat frisson becomes evident as soon as stars Paul Bettany and Jeremy Pope make their entrances, with a whippet-thin Bettany wearing Warhol’s red glasses and blonde wig and Pope sporting Basquiat’s seemingly electrified dreadlocks that seem to stand straight up in the air. If the actors wind up winning awards for their performances, they damn well better mention wig designer Tommy Kurzman in their acceptance speeches.\n\nThe play’s high-concept conceit is to imagine the interactions between the two artists when they collaborated for several years in the 1980s at the behest of their mutual Swiss dealer Bruno Bischofberger (Erik Jensen). (It actually began as a three-way collaboration, with Italian painter Francesco Clemente, but then the production would have had to hire another actor.)\n\n“Warhol versus Basquiat!” Bruno says to Warhol as part of his sales pitch. “Versus?” replies a skeptical Warhol. “Gee, you make it sound so macho, like a contest.” The exchange certainly resonates, since the publicity for the resulting exhibition featured the two artists in a boxing match-style pose.\n\nIt’s an example of the on-the-nose dialogue illustrating both the playwright’s research skills and his tendency to emphasize points with which many audience members will be familiar. Your enjoyment of The Collaboration, as with many of McCarten’s works, will prove directly proportional to how much you already know about the subject matter. It’s a sort of intellectual pretension, like audience members at foreign films who make sure to laugh before everyone can read the subtitles. At several points, Bettany’s Warhol describes his itinerary, making sure to include exactly how much he paid for cab fare, etc. You get the joke if you’re read Warhol’s diaries, which read as if they were written for an IRS audit.\n\nThe play’s conflict stems from the very different personalities and career statuses of the two artists. Warhol has become insecure and fearful, as a result of both his declining sales and the severe physical injuries he suffered when he was shot by Valerie Solanas (no points for guessing that Bettany will take off his shirt to reveal horrific scars). He’s also become a sort of mass-market art manufacturer, having not actually done any actual painting in decades. “You mean, like paint together? With brushes?” Warhol asks Bruno in a horrified tone.\n\nBasquiat, on the other hand, is a star on the rise, and is all too aware of it. He’s also disdainful of Warhol, considering him “old hat.”\n\n“Does anyone really care about Warhol anymore?” Basquiat asks. “All that fag silk screen stuff? Marilyns, Elvis’, soup cans? He’s not a real artist anymore.”\n\nCue the next scene set at Warhol’s studio, where we indeed see those prints of Marilyn, Elvis and Campbell’s Soup cans on the wall. (See what I mean about the on-the-nose dialogue?) We watch as the two iconic artists kibbitz together while they awkwardly work out their creative and personality differences, as if we were flies on a very famous wall. The play starts to feel like one of those old Dick Cavett shows in which the wily host would interview two wildly disparate famous people simultaneously and let the fireworks fly.\n\nAs if sensing that the evening requires more in the way of a plot, McCarten throws in some dramatic developments in the second act, including the unexpected arrival of Basquiat’s ex-girlfriend Maya (Krysta Rodriguez) at his studio while Warhol is alone waiting for him. There’s also the news of the severe beating and ultimate death at the hands of the police of Basquiat’s friend and fellow graffiti artist Michael Stewart, which leads the distraught Basquiat to shoot up again. But somehow, the more that goes on, the less substantial the play feels.\n\nThough the writing is a letdown, The Collaboration nonetheless proves entertaining, thanks to the colorful figures at its center and the superb acting. Bettany had the harder assignment of not caricaturing Warhol, even though by that point Warhol had already become a caricature of himself. He handles the task beautifully, avoiding excessively overt imitation and somehow managing to convey Warhol’s underlying Andrew Warhola. Pope ­— as much a star on the rise as the character he’s portraying, thanks to his Tony-nominated work in Choir Boy and Ain’t Too Proud and his acclaimed starring role in the film The Inspection — delivers a rivetingly physical, live-wire turn, exuding restless energy and speaking in a high-pitched voice that sounds like Michael Jackson. The two actors’ mesmerizing turns, soon to be repeated in a film adaptation of the play, are, as the old saying goes, worth the price of admission alone.\n\nDirector Kwame Kwei-Armah provides some illuminating atmospheric touches, including projections of footage of NYC from the period and a film montage at intermission depicting the two characters performing various activities together. Less felicitous is the use of an onstage DJ playing disco music at deafening volume prior to the performance. It might have been a good idea at the Young Vic, but considering the average age of the Manhattan Theatre Club subscriber it borders on elder abuse.\n\nThe Collaboration opened December 20, 2022, at Samuel J. Friedman Theatre and runs through January 22, 2023. Tickets and information: manhattantheatreclub.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
