{
  "showId": "the-collaboration-2022",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Gillian Russo",
  "url": "https://www.newyorktheatreguide.com/reviews/the-collaboration-broadway-review-paul-bettany-jeremy-pope",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/the-collaboration-broadway-review-paul-bettany-jeremy-pope",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright"
  ],
  "showScoreExcerpt": "\"If one thing stands out about 'The Collaboration,' it’s that it offers the most fun on Broadway even when the play isn’t happening.\"\n\nRead more",
  "fullText": "If one thing stands out about The Collaboration, it’s that it offers the most fun on Broadway even when the play isn’t happening. A live DJ spins '80s hits before the show, with colorful dots of light, like paint splatters, spinning across the wall. At intermission, a reel plays of lead actors Jeremy Pope and Paul Bettany, in character as Jean-Michel Basquiat and Andy Warhol, painting, roller-skating, and generally having a ball. And then the actual play starts up, about the titular artistic partnership Basquiat and Warhol formed in the 1980s. It can best be described as a perfect example of Warhol's artistic philosophy, as he states it in the script: \"Why can't it just be about nothing?\" The show suffers from forgettable writing, but there are a few vibrant moments, thanks entirely to the lead performances that are a marvel (no Bettany/Vision pun intended) to witness. The artists’ collaboration actually happened, inspiring the broad strokes of the plot: Agent Bruno Bischofberger (Erik Jensen) convinced Basquiat and Warhol to work together despite neither wanting to. They developed a close friendship despite their myriad differences: art style, age, race, career trajectory, and general personality. In nailing each idiosyncrasy of Basquiat and Warhol, Pope and Bettany, who received acclaim for originating these roles in London, couldn't be better. With a little help from a wig and glasses, Bettany looks and sounds like Warhol reincarnated, achieving the difficult task of making soft-spoken aloofness compelling. It's an even more remarkable feat considering he's competing for attention with Pope's firecracker of a Basquiat. He inhabits the sardonic young upstart with overconfident swagger to spare, practically bouncing off the Samuel J. Friedman Theatre walls. Playwright Anthony McCarten supplies mostly imagined dialogue in which they hash out their differences as they work in an NYC studio. (The appropriately artsy sets and costumes are by Anna Fleischle.) Their conversations, about the purpose of art and their personal reasons for making it, offer little new insight to anyone with even a passing knowledge of Basquiat and Warhol. In the first act, the most novel thing about The Collaboration instead is the blending of various art styles on stage. I don't mean Warhol's and Basquiat's — we don't see the work they produce together — but the visual art, film, music, and dance all included in this piece of theatre. It's a testament to how art forms inform each other, how any one can inspire new creations and breakthroughs in another. The plot, on the other hand, only kicks into high gear in Act 2 with the arrival of Krysta Rodriguez, in a commanding turn of her own as Basquiat's girlfriend Maya. A conversation between her and Warhol reveals an emergency that introduces real stakes, particularly for Basquiat. Pope gets another opportunity to explode with every bit of energy he's got, though this time out of anguish rather than triumph. McCarten leaves out one major moment in the trajectory of the artists' collaboration: the part where their friendship burned out just as quickly as it began, between the failure of their exhibit and both icons' untimely deaths. Instead, it leaves them alive and working. Basquiat painting frenetically, Warhol calmly — opposites finally in harmony. In that way, The Collaboration honors one of Basquiat's most passionate onstage declarations, too: \"I'm gonna be immortal, man. Immortal.\" The Collaboration is at the Samuel J. Friedman Theatre through January 29. Get The Collaboration tickets on New York Theatre Guide. Photo credit: Paul Bettany and Jeremy Pope in The Collaboration. (Photo by Jeremy Daniel) Originally published on Dec 20, 202221:00",
  "isFullReview": true,
  "textWordCount": 595,
  "archivePath": "data/archives/reviews/the-collaboration-2022/nytg--gillian-russo_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:37:06.490Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 595,
  "tierReason": "Full review text"
}