{
  "showId": "the-collaboration-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2022/legit/reviews/the-collaboration-review-broadway-paul-bettany-jeremy-pope-1235438069/",
  "publishDate": "December 21, 2022",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "The play succeeds in capturing something essential about the creative process, the way two artists from vastly different worlds found common ground in their shared commitment to making art that mattered.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The play succeeds in capturing something essential about the creative process, the way two artists from vastly different worlds found common ground in their shared commitment to making art that mattered.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 362,
  "archivePath": "data/archives/reviews/the-collaboration-2022/variety--charles-isherwood_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:37:26.778Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "There was no denying the star power of the 2022 Latin Grammy Awards lineup. Variety caught several Latin music tastemakers on their way into the ceremony on the red carpet to ask which key players they were most excited to see on stage. Stars like Nicki Nicole, Anitta and Carlos Vives gushed over their favorites. Variety On the Carpet is presented by Toyota at the Latin Grammy Awards.\n\nA total of 18 musical performances took center stage at the Michelob Ultra Arena on Nov. 17, including some of Latin music’s hottest touring acts such as Karol G and Rosalia, plus heavy hitters Rauw Alejandro, Christina Aguilera, Romeo Santos and more.\n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Don Lemon Confirmed to Speak at On Air Fest Podcast Conference After His Recent Arrest \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Trevor Noah Mocks Donald Trump's Friendship With Jeffrey Epstein During Grammys: 'What Are You Going to Do About It?'\n\nThere was an overwhelming response for Karol G, who’s fresh off her 30-date $trip Love Tour — the Colombian singer’s biggest trek to date and her second round-about in the U.S. in the past 12 months (she's also managed to tour Latin America in between).\n\nWiplash, the budding pop-rock band from Mexico, who was celebrating their first nomination for best rock album, stuck to their roots responding with Carin León. Carlos Vives — who is now a 17-time Latin Grammy winner — sang praises of Elvis Costello, who appeared later in the video alongside his stage partner and the night’s biggest winner Jorge Drexler.\n\nArgentine artist Nicki Nicole, who appeared in several of the ceremony’s major categories for her part in Christina Aguilera’s “Pa' Mis Muchachas,” said she was most excited to see her collaborator hit the stage as she hadn’t been able to catch her before.\n\n“I want to see her tear it up,” she said before adding that she was also looking forward to catching Rosalía. “I want to see all the women saying ‘Here we are, loves!'” Anitta echoed the sentiment, calling Rosalía’s “Motomami” one of her favorite records of the year, “I love everything she does. I think she’s so innovative, and I think she’s going to be the biggest winner tonight.”"
}