{
  "showId": "the-collaboration-2022",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jackson McHenry",
  "url": "https://www.vulture.com/2022/12/theater-review-ollaboration-warhol-basquiat-broadway.html",
  "playbillVerdictUrl": "https://www.vulture.com/2022/12/theater-review-ollaboration-warhol-basquiat-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews"
  ],
  "showScoreExcerpt": "\"Looking at the faux Marilyn Monroe prints behind the actors, you start to ponder if the performances themselves are achieving anything much different. Buy a ticket and you can get the contours of something familiar and the most basic coloring of the details.\"\n\nRead more",
  "bwwExcerpt": "The Collaboration abruptly turns plot heavy in the second act — early on, Krysta Rodriguez, playing a ex-girlfriend of Basquiat’s, storms in, announces “I need the money to make rent and have an abortion,” and throws a purse for emphasis, a choice I just have to respect. But eventually it makes its way toward the idea that being reduced to a salable art brand is crushing both these men. That’s something Warhol embraced in his own art-making, but as theater, it’s as two-dimensional as a silk screen. As much as it gestures toward depth, the play’s selling the audience these same flattened versions of Warhol and Basquiat. Looking at the faux Marilyn Monroe prints behind the actors, you start to ponder if the performances themselves are achieving anything much different. Buy a ticket and you can get the contours of something familiar and the most basic coloring of the details.",
  "bwwScore": 4,
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nJeremy Pope and Paul Bettany in The Collaboration.\n Photo: Jeremy Daniel\n \n \n \n Once Paul Bettany and Jeremy Pope have walked onstage in The Collaboration in their respective Warhol and Basquiat guises, the play itself may as well be over. You’ve come to see two actors approximate personae, and here they are, approximating. The wigs are semi-convincing, and the costumes and props telegraph their styles (Warhol has clear red eyeglass frames) and the fact that we’re in the 1980s (Basquiat has a Walkman). We’re in the realm of iconography, which means you’re going to get a bunch of information with which you are already passably familiar. This is the kind of static bio-play that brings two famous figures to the stage and then stalls out. Look at Andy! Look at Jean-Michel! Further insights TBD.\n\nThe premise of The Collaboration, written by Anthony McCarten, lies in a plan cooked up by art dealer Bruno Bischofberger (played by Erik Jensen) to get Warhol, king of silk-screen Pop Art, and Basquiat, rising star of neo-Expressionism, together for an exhibition. The event, and more generally their dynamic, is framed as both a potential cross-generational teaching moment and a showdown: There is much discussion of the promotional poster of them in boxing gloves. Warhol is established but restive. “I’ve never been the same since she shot me,” he says in his first scene, as if to get the Valerie Solanas story on the table as quickly as possible. Basquiat, meanwhile, is the wary rising star. His paintings are selling for more and more money, but he’s suspicious of the Establishment. He may or may not be sleeping with Madonna, something the other characters mention nearly as often as Warhol talks about being shot. The two of them are, in the first act, tense and distrustful of each other’s worldviews and theories of art. By the second — would you believe it? — they reach a sort of rapprochement.\n\nThere are further details that complicate the neatness of this story, though The Collaboration only hints at them: The Basquiat-Warhol show opened in 1985 to negative reviews, damaging that relationship. Warhol died during gallbladder surgery soon after in 1987, at 58, and Basquiat of a heroin overdose the next year, at 27. The play treats his addiction heavy-handedly, complete with that overfamiliar moment in which a character is shocked to discover a needle lying around in a studio. It also teases the possibility of a sexual relationship between Warhol and Basquiat, a rumor that’s been going around for a long time, but the play doesn’t have the guts to stake a claim. It’s a conventional, white-glove treatment of two characters who were anything but.\n\nWith The Collaboration, McCarten is continuing to mine a vein of middlebrow bio-drama. He’s written about Stephen Hawking (The Theory of Everything), Winston Churchill (The Darkest Hour), Freddie Mercury (Bohemian Rhapsody), Neil Diamond (Beautiful Noise), and two popes (The Two Popes): They’re varyingly successful films, often depending on the caliber of the star, and each has a loose association with the facts of history. I believe McCarten is earnestly fascinated by the ways in which people are turned into symbols, but this is also undeniably a mini-industry, one designed to reap all the possible rewards of preexisting affection for familiar life stories. The Collaboration came here from London’s Young Vic (directed by its artistic director, Kwame Kwei-Armah), and there’s already a film adaptation in the can. When it hits the awards circuit next year, remember that we were here, after seeing it onstage, saying “This is really pretty meh” first.\n\nBettany and Pope are talented actors, but the problem with something like The Collaboration is that their choices are confined almost entirely to the predictable. Bettany, enjoying shore leave from the Marvel Cinematic Universe, goes all in on Warhol’s mincing pattern of speech with the elbows-in posture of someone on the defense. He’s working with the kind of virtuosity that draws you to all the surface details but doesn’t quite let you in further — in part, perhaps, because Warhol portrayed himself with such studied opacity. Pope, who has rocketed into big film and TV roles since his double Tony nomination in 2019, does a little better as a tortured Basquiat, but that’s mostly owing to choices outside the text. He has a wordless, bravura moment of panic and terror that tells you more about the character than all the references to his quirks. (Did you know he didn’t trust banks and kept tons of cash in his fridge? Spoiler alert: There’s cash in that fridge.) With all these capital-c choices, the two each want to be gravitational centers of the play, and Kwei-Armah hasn’t worked out a way to make them, well, collaborate. The two actors, both often cheating toward the audience, seem to talk past each other on the stage. It’s not a dialogue as much as it’s like watching two Pokémon communicate by endlessly restating their identities.\n\nThe Collaboration abruptly turns plot heavy in the second act — early on, Krysta Rodriguez, playing a ex-girlfriend of Basquiat’s, storms in, announces “I need the money to make rent and have an abortion,” and throws a purse for emphasis, a choice I just have to respect. But eventually it makes its way toward the idea that being reduced to a salable art brand is crushing both these men. That’s something Warhol embraced in his own art-making, but as theater, it’s as two-dimensional as a silk screen. As much as it gestures toward depth, the play’s selling the audience these same flattened versions of Warhol and Basquiat. Looking at the faux Marilyn Monroe prints behind the actors, you start to ponder if the performances themselves are achieving anything much different. Buy a ticket and you can get the contours of something familiar and the most basic coloring of the details.\n\nThe Collaboration is at the Samuel J. Friedman Theatre.\n\nShow \n \n \n Leave a Comment\n \n\n Two Kings, Not Much Pleasure: The Collaboration\n\n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.\n\nEditor’s Picks\n \n \n \n \n \n \n \n \n chapters\n \n How Rupert Murdoch Decided to Dump Tucker Carlson\n How Rupert Murdoch Decided to Dump Tucker Carlson\n \n \n \n \n \n \n \n \n \n \n art\n \n A 19th Century Masterpiece That Scandalizes Still\n A 19th Century Masterpiece That Scandalizes Still\n \n \n \n \n \n \n \n \n \n \n screen time\n \n Why Upgrading to the iPhone 15 Is Like Buying a New Car\n Why Upgrading to the iPhone 15 Is Like Buying a New Car\n \n \n \n \n \n\n \n\n \n \n \n Sign In to Comment\n \n\n \n \n Most Popular\n \n\n \n \n \n \n Taylor Swift Wants You to Google Her\n \n \n \n \n \n \n Lana Del Rey Wasn’t Working at Waffle House for Clout\n \n \n \n \n \n \n ‘This Was Simply How This Story Had to Go’\n \n \n \n \n \n \n Angelica Ross Has Receipts\n \n \n \n \n \n \n Taylor Swift and Sophie Turner Have a Lot to Talk About\n \n \n \n \n\n \n \n \n \n ‘This Was Simply How This Story Had to Go’\n \n \n \n \n \n \n The Real Housewives of Salt Lake City Recap: Tricksy Motel\n \n \n \n \n \n \n Everything We Know About the Megan Thee Stallion and Tory Lanez Shooting\n \n \n \n \n \n \n Winning Time Will Not Shoot for 3\n \n \n \n \n \n \n Only Murders in the Building Recap: Tricky Dickie\n \n \n \n \n\n \n\n \n \n \n\n \n \n\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n\n \n \n Email\n \n \n\n \n \n You\\'ll receive the next newsletter in your inbox.\n \n \n *Sorry, there was a problem signing you up.",
  "isFullReview": true,
  "textWordCount": 1189,
  "archivePath": "data/archives/reviews/the-collaboration-2022/vulture--jackson-mchenry_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:39:27.105Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230921162408",
  "archiveOrgUrl": "http://web.archive.org/web/20230921162408/https://www.vulture.com/2022/12/theater-review-ollaboration-warhol-basquiat-broadway.html",
  "duplicateTextOf": "vulture--helen-shaw.json",
  "contentTier": "complete",
  "wordCount": 1189,
  "tierReason": "Full review text"
}