{
  "showId": "macbeth-2013",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://theater.nytimes.com/2013/04/22/theater/reviews/macbeth-with-alan-cumming-at-the-barrymore-theater.html?ref=arts",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "Mr. Cumming...is a versatile performer who here gets to indulge in the kind of high-hurdle challenge (or ego trip) that can prove irresistible to actors...Watching him perform this personalized rendition of \"Macbeth,\" I was at times more intrigued by the battle going on between the serious actor and the shameless entertainer than I was by the tense struggles taking place in the divided mind of Macbeth...In terms of stamina and ingenuity, Mr. Cumming's achievement is certainly remarkable. But I c",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-MACBETH-Opens-on-Broadway-Updating-LIVE-20130421",
  "contentTier": "complete",
  "fullText": "https://www.nytimes.com/2013/04/22/theater/reviews/macbeth-with-alan-cumming-at-the-barrymore-theater.htmlShare full articleAdvertisement\n\nThe Scottish play, or “Macbeth” as it is known to laymen and superstition-free theater folk, sounds more Scottish than usual in the Broadway production that opened on Sunday night at the Barrymore Theater. The murderous general of the title is portrayed by the Scotland-born Alan Cumming, whose rich, rolling accent brings a whiff of the green highlands with it.\n\nThe real novelty of this production lies elsewhere: Mr. Cumming does not just play Macbeth but also all of the other significant roles in what is essentially a one-man, one-act hurtle through this Shakespearean tragedy of ambition, murder and soul-corroding guilt, here set in the chilly chamber of a mental institution.\n\nThe harsh lighting snaps on to reveal a man looking dazed and disoriented as two minders remove his disheveled clothing and help him into hospital garb. His clothes are sealed into brown paper bags with the ominous word “evidence” stamped upon them. His demeanor is meek and subservient, but bloody slash marks on his pale flesh suggest that this fellow has perpetrated (or been the victim of) some bloody deeds that have left his mind shattered and prey to tormenting fantasies.\n\n“When shall we three meet again?” he asks in a tone of frightened urgency as his stoic caretakers depart. This, the first line of the play’s text, spoken by one of the witches, unleashes the dark fury of Shakespeare’s tragedy, as one by one the characters take possession of this disturbed fellow, who flits manically around the green-tiled room as he snaps from one persona to the next, suggesting a swarm of bats let loose in a confined space.\n\nMr. Cumming, a Tony winner for “Cabaret” who currently appears as a canny political operative on the terrific television drama “The Good Wife,” is a versatile performer who here gets to indulge in the kind of high-hurdle challenge (or ego trip) that can prove irresistible to actors. He is also a born entertainer, who recently appeared with Liza Minnelli in a concert engagement at Town Hall. (Like many a celebrity in this era of all-platform saturation, Mr. Cumming also has his own line of fragrances.)\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 382,
  "archivePath": "data/archives/reviews/macbeth-2013/nytimes--charles-isherwood_2026-02-07.html",
  "textFetchedAt": "2026-02-07T14:02:06.217Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No usable CDX snapshots (all non-200 or non-HTML)"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 382,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T11:11:14.156Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text cuts off mid-sentence and ends with a technical error message about retrieving article content and enabling JavaScript, making it impossible to determine the critic's verdict.; openai: The text is incomplete and contains navigation and error messages, making it unscoreable.",
  "promptVersion": "5.2.0"
}