{
  "showId": "macbeth-2013",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Unknown",
  "url": "http://variety.com/2013/legit/reviews/legit-review-macbeth-1200400767/",
  "playbillVerdictUrl": "http://variety.com/2013/legit/reviews/legit-review-macbeth-1200400767/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Alan Cumming turns in a bravura performance in a solo interpretation of the Bard tragedy\n\nThe National Theater of Scotland’s production of “Macbeth,” starring Alan Cumming, opened on Broadway April 21. The following is Mark Fisher‘s original review (June 18, 2012) of the show’s initial staging as part of the Edinburgh Intl. Festival last year, prior to a Lincoln Center Festival stint later that summer. Credits have been updated to reflect changes for the Broadway version.\n\n“Canst thou not minister to a mind diseased?” cries Macbeth, when told of his wife’s worsening mental health. The answer is no, and in this radical one-man re-imagining of Shakespeare’s great tragedy, the illness is more widespread still. Arriving in a foreboding psychiatric unit, seemingly after some violent breakdown, Alan Cumming plays a man possessed by every character in “Macbeth.” In a sad, emotionally draining and bravura perf, he makes it seem as if every psychosis and hallucination in the play is an expression of one man’s fragile state of mind.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Between Brothers’ Launches Trailer as Director Talks ‘Ethical Traps’ of Following ‘A Family Affair’ With Another Family Doc (EXCLUSIVE) \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Bridgerton’ Season 4 Part 1 Succeeds Despite Benedict and Sophie’s Lackluster Romance: TV Review\n\nIt’s an audacious interpretation, not simply in the enormity of the task (Cumming is center of attention for the best part of two hours), but in the way it internalizes the wide-ranging political drama of the original and turns it into a distressing vision of mental disorder. Cumming’s entrance is not as some conquering warlord, but as a frightened and vulnerable patient, having his fingers swabbed and possessions removed by institutional attendants, preparing to leave him alone in the green-tiled bleakness of Merle Hensel’s chilling institutional set.\n\nCumming, who grew up near the Perthshire landmarks where the play is set, plays Macbeth as a man wounded and insecure. The three bloody gashes that scar his chest could have been picked up in battle, but they seem more likely to be self-inflicted. He is in shock and it is as if only Shakespeare’s characters can articulate the mental trauma he is suffering.\n\nSeen through this prism, the witches, like Banquo’s ghost, are the fevered imaginings of a disturbed mind; Lady Macbeth’s endless hand-washing is a study in obsessive-compulsive disorder; and the roll-call of murdered children seems like the consequence of severe mental illness. The darker the story becomes, the more brittle becomes the patient’s state of mind. He is on a fast-track not to defeat, but to an attempted suicide by drowning in the cold enamel sanatorium bath.\n\nIt’s an interpretation that throws a very particular light on “Macbeth” at the expense of the play’s political and social qualities, yet such are Cumming’s gifts as an actor, we also get an uncommonly rich reading of the play. Using the most subtle shifts in register, gait and dress, he switches seamlessly from character to character, giving us a robust Lady Macbeth who sensuously tastes power while naked in the bath and drinking water like champagne; an uncomplicated Banquo, cheerfully tossing the apple he will reclaim as a ghost; and a bumptious Duncan, blissfully unaware of the danger around him.\n\nJohn Tiffany, who won a Tony for his staging of “Once,” joins co-helmer Andrew Goldberg in creating a superbly paced production. Like the plangent strings and disturbing radio crackles of Max Richter’s music, it is at once beautiful and unsettling. Tiffany and Goldberg give Cumming the run of the stage, yet are not afraid to slow the production down to give us time to take stock.\n\nYou don’t exactly forget it is a one-man show, but there is such variety in technique that it never seems a limitation. Whether it is the witches appearing on television monitors above the stage, Macduff’s son appearing in the form of a child’s sweater or Cumming ripping the guts out of a raven he catches in an air vent, the production crackles with inventive details focused on a stellar central perf.\n\n(Barrymore Theater; 1,025 seats; $136 top)\n\nA Ken Davenport in association with Hunter Arnold and Carl Daikeler, Cody Lassen, Joan Raffe and Jhett Tolentino, Julia Broder, Luigi and Rose Caiola, Michael Desantis, Neil Gooding Prods., John C. Hall, Marguerite Hoffman, Ken Mahoney, Elliott Masie, Dean Roth, Bellanca Smigel Rutter and Kat White presentation of the National Theater of Scotland’s production of a play in one act by William Shakespeare. Directed by John Tiffany and Andrew Goldberg.\n\nSets and cosumes, Merle Hensel; Natasha Chivers, lights; Fergus O’Hare, sound; Iam William Galloway, video design; production stage manager, Kristen Harris. Reviewed June 18, 2012; opened on Broadway April 21, 2013. Running time: ONE HOUR, 45 MIN.\n\nWith Alan Cumming, Chris Kipiniak, Jenny Sterlin, Brendan Titley.",
  "isFullReview": true,
  "textWordCount": 788,
  "archivePath": "data/archives/reviews/macbeth-2013/variety--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:39:09.697Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 788,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-04T06:21:16.012Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is of the show's initial staging at the Edinburgh Intl. Festival, not the current Broadway production.; kimi: This text is explicitly identified as Mark Fisher's 'original review' from the Edinburgh International Festival dated June 18, 2012, with only credits updated for the Broadway production. The review content describes the 2012 Edinburgh staging ('Reviewed June 18, 2012'), not the current Broadway run that opened April 21, 2013.",
  "promptVersion": "5.2.0"
}