{
  "showId": "la-bete-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2010/legit/reviews/la-bete-1117943658/",
  "publishDate": "October 13, 2010",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "While Mark Rylance's bravura performance as the insufferable poetaster Valere provides moments of genuine hilarity, David Hirson's verbose comedy proves as much an endurance test for audiences as it is for the fictional theatrical troupe forced to accommodate the bombastic fool.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "While Mark Rylance's bravura performance as the insufferable poetaster Valere provides moments of genuine hilarity, David Hirson's verbose comedy proves as much an endurance test for audiences as it is for the fictional theatrical troupe forced to accommodate the bombastic fool.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 443,
  "archivePath": "data/archives/reviews/la-bete-2010/variety--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:30:38.875Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "The entire show plays like an old joke about how often spouses have sex.\n\nThe most interesting aspect of “Better With You” — ABC’s lone addition to its Wednesday sitcom block — is the casting of Josh Cooke and Jennifer Finnigan, reuniting them after playing a quirkier couple in the offbeat 2005 NBC sitcom “Committed.” Beyond that footnote, the entire show plays like an old joke about how often spouses have sex, predicated on the premise that passion ebbs at various stages of marriage. The well-chosen cast is game enough to deliver a few amusing moments, but for the most part spending time “With You” really isn’t much better than “Hank.”\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'How to Divorce During the War' Review: A Droll, Perceptive Look at Handling Personal Crises Amid Political Ones \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'All About the Money' Review: Capitalism and Communism Are Strange Bedfellows in a Compelling but Elusive Doc Portrait\n\nBen (Cooke) and Maddie (Finnigan) have been together for nine years without getting married, which they refer to as a “valid” choice. So it’s a bit unsettling to them when younger sister Mia (JoAnna Garcia, already a sitcom veteran) announces plans to wed goofy musician Casey (Jake Lacy) after just two months of courtship.\n\nThe pilot pivots not just on how Maddie reacts, but the prospect of breaking the news to their parents, Vicky and Joel (Debra Jo Rupp, always funny, and Kurt Fuller). Yet the show’s foundation involves scenes illustrating how the three different duos respond to the same situation by intercutting among them, with Mia and Casey madly hot for each other, Ben and Maddie’s embers cooling but still lit, and parents Joel and Vicky pretty much just waiting for death to release them from their suffering.\n\nIn theory, this provides structural parallels to “Modern Family,” but any similarities pretty much end with that description. Created by “Friends” alum Shana Goldberg-Meehan, this is family comedy of a far more banal variety.\n\nOther than a welcome sequence featuring a heart-to-heart chat between the sisters, even director James Burrows’ widely admired touch can’t do much to enliven the tired set-up/joke rhythm — an area where Cooke’s droll delivery stands out but, under the circumstances, can’t really shine.\n\nAs for matters that pertain more to commerce than romance, the reality is that ABC’s comedy quartet of 2009 produced one unqualified success in “Modern Family,” with the two other shows (“The Middle” and “Cougar Town”) surviving but hardly setting the world ablaze.\n\nFrom that practical perspective, “Better With You” fits in with that lesser two-thirds of ABC’s returning sitcom block, and while it’s by no means an eyesore, it hasn’t done anything to improve the neighborhood."
}