{
  "showId": "ink-2019",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "http://www.nydailynews.com/entertainment/indian-ink-tom-stoppard-premieres-new-york-article-1.1957166",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/indian-ink-tom-stoppard-premieres-new-york-article-1.1957166",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 365,
  "archivePath": "data/archives/reviews/ink-2019/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:11:45.650Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20220626181929",
  "archiveOrgUrl": "http://web.archive.org/web/20220626181929/https://www.nydailynews.com/entertainment/indian-ink-tom-stoppard-premieres-new-york-article-1.1957166",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "ExpandFirdous Bamji, left, is an Indian painter who has a complicated relationship with an English poet, played by Romola Garai, in 1930.\n\nIn his 1995 drama \"Indian Ink,\" now in New York for the first time, Tom Stoppard tackles a story of love, art and culture.\n\nAnd after about three hours, he comes to a pretty straight-up conclusion: It's all but impossible to truly know people.\n\nHis case in point is the fictional, free-spirited British poet Flora Crewe (Romola Garai), who treks to Jammapur in 1930, as the people of India are growing restless under British rule.\n\n\"I am in heat ...\" Flora notes as she pens a poem. She's not just taking stock of the temperature or the political climate. Flora has her portrait painted by a local artist, Nirad Das (Firdous Bamji). Their relationship is complex — England and India in miniature.\n\nFifty-plus years later, a myopic and bumbling American biographer, Eldon Pike (Neal Huff), obsessed with Flora, seeks out her adoring sister Eleanor (Rosemary Harris, solid as always) for access to their letters — and the inside scoop. Eleanor is also visited by Das' son (Bhavesh Patel). A more complete picture of 1930 comes into focus.\n\nRosemary Harris and Bhavesh Patel occupy scenes set in 1980s England in \"Indian Ink.\"\n\nAs in his play \"Arcadia,\" Stoppard ping-pongs the narrative. Scenes from the two periods unfold on the same set, with actors from each era at the same table. There's an elegance in how Stoppard imparts information — including what's driven Flora to India and a sweet moment involving Eleanor's future husband — in his own carefully metered time.\n\nDirector Carey Perloff's staging flows well, but it's a long-winded evening. What's absent is real \"rasa,\" which Das describes as \"juice.\" It's what a painting needs to really grab viewers. As written, and as played matter-of-factly by Garai, an English actress known for \"Atonement\" and the Ian McKellen \"King Lear\" at Brooklyn Academy of Music, Flora isn't half as interesting as she needs to be.\n\nDas, thanks to Bamji's sincere and quirky portrayal, is far more intriguing. But Flora never emerges as a woman who'd inspire books and a chase by a would-be biographer.",
  "contentTier": "needs-rescrape"
}