{
  "showId": "ink-2019",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "https://www.nydailynews.com/2019/04/24/review-broadways-ink-is-juicy-colorful-tale-about-the-rise-of-right-wing-media-mogul-rupert-murdoch/",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/indian-ink-tom-stoppard-premieres-new-york-article-1.1957166",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 720,
  "archivePath": "data/archives/reviews/ink-2019/nydailynews--unknown_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:39:33.261Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "archiveOrgTimestamp": "20220626181929",
  "archiveOrgUrl": "http://web.archive.org/web/20220626181929/https://www.nydailynews.com/entertainment/indian-ink-tom-stoppard-premieres-new-york-article-1.1957166",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "So how will history judge Rupert Murdoch, of Fox News fame?\n\nAs a devil from Down Under who trashed august journalistic institutions, made a mockery of the phrase “fair and balanced,” unleashed the kind of wild and reckless populism that elected Donald J. Trump, built the Brexit torture chamber, and might just kill intelligent democracy?\n\nOr as a populist mastermind who could see the cracks in the walls of the liberal elite’s country clubs, who realized great storytelling always requires distinct heroes and villains, who knew one guy’s fact always is another guy’s fiction, and who figured out long before the other dumb media titans that user-generated content and “Five hot things!” was far more profitable than the tortured copy and long sentences favored by pontificating columnists and critics?\n\nWell, as they like to say at Fox News, the new Broadway play “Ink” mostly reports the facts. You decide, dear reader, you decide.\n\nAt least you will have fun doing the deciding.\n\n“Ink,” penned by James Gresham, directed by Rupert Gould and now on Broadway at the Manhattan Theatre Club’s Samuel J. Friedman Theatre following a successful run in London, tells the juicy story of Murdoch’s takeover of the notorious British tabloid known as The Sun.\n\nFor young callow males in the early 1970s, The Sun was a guilty and sexist pleasure, with its racy copy, cash-money contests, cacophonous headlines that could swallow an entire page, football for days, and its endless features on crime, sex and lingerie, followed hard by features on lingerie, sex and crime. Most notoriously, of course, The Sun featured the so-called “Page 3 Girls” — topless glamour shots that blurred the line between news and soft porn.\n\n“Ink” focuses entirely on The Sun — the paper that represented Murdoch’s first triumph in Britain and the precursor of his stateside ambitions at the Chicago Sun-Times, a New York City tabloid and, of course, Fox. It begins with the purchase of the paper by Murdoch (the deliciously Machiavellian Bertie Carvel) and the hiring of a new editor, Larry Lamb (Jonny Lee Miller), a working-class Northerner with a chunky chip on his shoulder.\n\nLamb’s assignment? Beat the circ of the best-selling Daily Mirror, which at that point sold a whopping 4 million copies. The play follows the ascent of both Lamb and The Sun, telling the story of the reinvention of a newspaper with the kind of humorous relish that typified Ben Hecht’s “The Front Page.”\n\nFor today’s battered journos assaulted by newsroom cutbacks, diminished paychecks, no-fun-allowed venture capitalist bosses, and head-spinning competition from every two-bit website and Facebook opinionator, “Ink” is gloriously nostalgic catnip for a vanished era of newsprint and reckless behavior, of a time when a half-decent writer could expect to be poached with a hefty new contract from a rival pub, and a juicy scoop meant the competish could do nothing but stew in anger for 24 hours.\n\nMuch of the appeal of “Ink,” directed with palpable if unsubtle joy by Gould on a cheerily chaotic Bunny Christie setting, centers on that evocation of circa 1970, and on the colorful, boozy characters then found in tabloid newsrooms, fabulously evoked by the likes of Bill Buell, Tara Summers and Robin Stanton.\n\nBut Gresham also wants to explore what Murdoch meant, and it’s not a wholly unsympathetic portrait. “Ink” sets his disruptive innovations — essentially, give the people what they actually want — against the stultifying, creaking moralism of the old order, the “noble calling” crowd who were blind to their own myopia.\n\nUltimately, “Ink,” which is a lot more entertaining than its headier 1985 predecessor, Howard Brenton and David Hare’s “Pravda,” is saying that Murdoch saw the future. And it is very convincing.\n\nDid he go too far? Gresham makes the historically accurate point that Murdoch was a bit of a paradoxical prude who actually didn’t like the cheap content that he encouraged his editors to propagate. He also points out that it took time for an initially apolitical businessman to go right-wing.\n\nYet in the end, “Ink” is a bit of a morality play as Lamb’s Miller becomes an Icarus flying too close to the sun, exposing a woman in the name of attracting prurient male readers … to what, exactly?\n\nNothing helpful to democracy, that’s for darn sure. But good for Murdoch’s business.",
  "contentTier": "excerpt",
  "bwwExcerpt": "Or as a populist mastermind who could see the cracks in the walls of the liberal elite's country clubs, who realized great storytelling always requires distinct heroes and villains, who knew one guy's fact always is another guy's fiction, and who figured out long before the other dumb media titans that user-generated content and 'Five hot things!' was far more profitable than the tortured copy and long sentences favored by pontificating columnists and critics? Well, as they like to say at Fox News, the new Broadway play 'Ink' mostly reports the facts. You decide, dear reader, you decide. At least you will have fun doing the deciding.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-INK-Opens-On-Broadway--See-What-The-Critics-Are-Saying-20190424",
  "_showNotMentionedDiscoveryAttempted": true,
  "previousUrl": "http://www.nydailynews.com/entertainment/indian-ink-tom-stoppard-premieres-new-york-article-1.1957166",
  "urlDiscoveredAt": "2026-02-06T14:39:33.267Z",
  "urlDiscoveryMethod": "show-not-mentioned-recovery"
}
