{
  "showId": "ink-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2019/04/24/ink-rupert-murdoch-against-the-world-and-the-mirror/",
  "publishDate": "2019-04-24T21:46:31",
  "fullText": "The roaring lion against the timid lamb. The giant Goliath against defenseless David. The Fleet Street hierarchy against an Aussie sheep farmer. Everybody loves the underdog. James Graham, in his play Ink, spins a yarn for our times about a true underdog. A foul, grasping, immoral, and altogether despicable underdog. Against all odds, Graham gets us to vehemently root for this antihero—whose name is, yes, Rupert Murdoch—and vicariously share, from the edge of our seats, in his improbable early victory.\n\nThis is Murdoch in 1969, before—well, before everything. Having built a chain of newspapers in his native Australia, the thirtysomething small-pond magnate comes to London but finds the doors of the journalistic gentlemen’s club barred to him. So he buys a failing paper (The Sun, “a right pile of crap”) being off-loaded by its corporate owner, the top-of-the-line Mirror. He sets out to create “a popular paper to reach the forgotten people,” and—with the help of garish headlines, near-nude models, gossip about the Royals, circulation-boosting giveaways, and features on sex and kittens—proceeds within a year’s time to irremediably alter the genteel world of the fourth estate into a battlefield in which you-know-who cannot fail to win.\n\nCan Graham, and director Rupert Goold, expect us to root for him?\n\nNo, they don’t expect us to; they more or less force us to. Murdock (Bertie Carvel) joins with Larry Lamb (Jonny Lee Miller), a talented Mirror editor whose working-class Yorkshire background prevents him from getting the top job at any Establishment paper. Murdock offers Lamb control, plus carte blanche;  it’s the rough-and-tumble uncouth against the world. Lamb poaches a ragtag crew of underappreciated (and lower-class) veterans, and from the moment this “ship of undesirables” goes to press—with a blaring and unprecedented new masthead of fiery red—the tabloid wars begin.\n\nWhen the reformulated Sun’s daily circulation breaks the million mark, one fogey at the Mirror explains that there’s nothing to worry about, it’s David throwing stones at Goliath. To which owner Cudlipp (Michael Siberry) retorts “David and Goliath? Percy, do you not know how it ends in your own fucking metaphor!” We—at least, most of the audience for Ink—know how it ends, with this charmingly awkward Murdoch ultimately dominating. But Graham is interested only in the beginnings, and it makes a roisterous tale.\n\nCarvel, as always, is a marvelous chameleon of an actor. He is best known for his Olivier- and Tony-winning performance as Miss Trunchbull in Matilda, but he first came to prominence as Leo Frank in the 2007 Donmar Warehouse production of Parade. (Leo Frank, Trunchbull, Murdoch. Any other actors you can think of likely to shine in these three roles?) In Ink, which won him a second Olivier, Carvel is marvelously slimy: hunched in a forward-leaning slump, hiding behind a permanent false smile, cackling and snapping his way through the evening like Uriah Heep. And powerful: Carvel’s hands look normal enough, but when he extends his forefinger to make a point or issue a command, that finger appears to be a lethal threat and don’t you dare refuse.\n\nHe remains letter-perfect on this side of the Atlantic. But unlike this season’s other sterling London transfers, Ink has traveled with only one cast member. This might ordinarily be a source of concern, even with the complete creative team intact, given how spectacularly dynamic Graham’s play was at the Duke of York’s. But an unexpected thing has happened here at the Friedman. The London Lamb (Richard Coyle) was excellent, perfectly complementing Carvel. But Carvel thoroughly dominated Ink, despite far less stage time. We watched him in rapt fascination and eagerly awaited his next entrance, while Lamb helpfully pushed the plot along.\n\nFor Broadway, Goold has added into the mix Jonny Lee Miller, winner of a 2011 Olivier for his acclaimed performance in the National’s Frankenstein (and best known hereabouts for his starring role as Sherlock Holmes in the long-running TV series Elementary). It becomes immediately apparent that Miller is a phenomenal actor, so much so that he singlehandedly upends Ink. Which is to say that with Miller as Lamb, the character becomes equal. So instead of waiting for the marvelous Carvel to reappear, we remain thoroughly engaged by Miller as he pushes The Sun along its sinuous uphill journey.\n\nMiller is terrific; always plotting, always thinking, always suspicious of Murdoch. (When excited, Miller’s Lamb actually seems to be dancing in place to silent music.) In my view, this makes Graham’s play even more powerful than in London. The rest of the cast is equivalent to the original group: all quite good, with a few standing out. Here, these include Siberry, most recently prominent in Junk, as the Mirror owner watching his inevitable downfall at the hands of the barbarian; Rana Roy as the cheesecake model, who plays a climactic scene opposite Miller and more than holds her own; Andrew Durand, who started the season adding needed comedy to Head Over Heels, as the gold-tressed photographer called Beverley; and Bill Buell and David Wilson Barnes as ink-stained hacks. It’s Miller who in the heat of the battle finds himself literally ink-stained, a wonderful touch.\n\nDirector Goold (King Charles III) originated Ink at his artistic home, the Almeida, after which it transferred to the West End. His production team is all-round superb, led by scenic and costume designer Bunny Christie. Lights are by Neil Austin; the projections, which cascade up and down the back wall, are by Jon Driscoll; and sound and the exceptionally effective music is by Adam Cork. As an example, they all combine for a bravura sequence in which we see copy go from the reporter’s typewriter through numerous stages to the finished paper, the entire set turned into a frenzied foundry with molten lead funneling down from above and somehow resembling the Frankenstein monster. (One of the last hyper-scenic sequences we’ve seen on this scale was in designer Christie’s Curious Incident of the Dog in the Night-Time.)\n\nThe Manhattan Theatre Club hosts the Broadway run in partnership with the Almeida and Sonia Friedman. Let us add, parenthetically, that three of the supreme highlights of this New York theatergoing season—The Ferryman, The Jungle, and Ink—were produced on the West End and brought stateside by Friedman.\n\nThe evening begins with Murdoch and Lamb, prior to embarking on their venture, considering what makes a good story (or more specifically, in their expletive-laden jargon, “a good fucking story”). After all has been said and seen, the evening ends with Murdoch telling us, “It’s a good story. People like stories.” It is, and we do.\n\nInk opened April 24, 2019, at the Samuel J. Friedman Theatre and runs through July 7. Tickets and information: inkbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "The roaring lion against the timid lamb. The giant Goliath against defenseless David. The Fleet Street hierarchy against an Aussie sheep farmer. Everybody loves the underdog. James Graham, in his play Ink, spins a yarn for our times about a true underdog. A foul, grasping, immoral, and altogether despicable underdog. Against all odds, Graham gets us to vehemently root for this antihero-whose name is, yes, Rupert Murdoch-and vicariously share, from the edge of our seats, in his improbable early victory.",
  "bwwScore": 10
}
