{
  "showId": "ink-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2019/04/24/ink-springtime-for-murdoch/",
  "publishDate": "2019-04-24T21:45:43",
  "fullText": "Long before Fox News was a twinkle in his eye, an ambitious Australian named Rupert Murdoch set out to remake a British newspaper for fun and profit. He wound up forever changing the media landscape abroad and, eventually, here—and not, most readers of this review would likely agree, for the better.\n\nBut before we judge Murdoch, again, let’s pause to consider all the abettors he’s had over the past 50 years, since the time that James Graham’s Ink, the new play tracing his takeover of The Sun and its subsequent rise as a tabloid, unfolds. Some he could not have foreseen, like the digital advances that have made his give-the-people-what-they-want approach so much easier to monitor. Of course, had at least a good chunk of the people not wanted the sensationalism and bottom-feeding he sanctioned—and editors not been willing to serve it to them—Murdoch might well have become a footnote in history, rather than one of the most successful and controversial moguls of our time.\n\nAs Ink arrives on Broadway, after garnering acclaim at London’s Almeida Theatre and on the West End, Murdoch’s empire may be in a tenuous position; Disney now owns much of it. But the populist principles on which he reshaped or founded numerous news outlets are positively thriving, not only in American and British politics but throughout media—including some of the print and online publications and networks that have criticized Murdoch and the politicians and policies he’s supported, from Donald J. Trump to Brexit, most vociferously.\n\nInk opens with a thirtysomething Murdoch, played by English actor Bertie Carvel (last seen on Broadway as the cartoonishly tyrannical school headmistress Miss Trunchbull in Matilda the Musical) appealing to Larry Lamb, a veteran journalist from working-class Yorkshire stock who left another tabloid, the Mirror, after peaking as sub-editor. “All they’ve ever done is take from you,” Carvel’s stridently seductive Murdoch says, pouncing like the snake in the garden. “That’s what the Establishment does.” Sound like a familiar pitch?\n\nLamb takes the bait and, under Rupert Goold’s characteristically flashy direction (a good fit for the subject matter), begins assembling his staff. Nubile female singers in swinging ’60s garb sashay through costume and scenic designer Bunny Christie’s industrial circus of a set, which has desks stacked on top of each other, as The Sun‘s new editor combs Fleet Street, hopping from bar to bathhouse and forming a dancing line with the fellow vets and newbies who will be his charges. Their directive? “I just want something … ‘loud,'” Murdoch tells Lamb. And ideally, the arch capitalist would like to top the Mirror‘s massive circulation—within a year.\n\nLamb, played with both increasingly aggressive intensity and a palpable sense of inner conflict by an excellent Jonny Lee Miller, pursues that goal with a vengeance, encouraged by his boss. “Get the readers to become the storytellers,” Murdoch urges, again seeming eerily prescient. “Isn’t that the real endpoint of the revolution? When they’re producing their own content themselves?” He seeks a “disruption,” that most trendy of terms in 2019.\n\nBut Graham, and Carvel, know better than to make Murdoch a simple prophet of doom, or a two-dimensional villain, for that matter. When the kidnapping of Muriel McKay, the wife of Murdoch’s deputy chairman, is traced in Ink‘s second act, it’s Lamb who insists in exploiting the crime to drive up circulation, as a plainly ruffled Murdoch—who has, admittedly, fueled his editor’s ambition with both positive and negative reinforcement—contests his decisions, if never quite managing to squelch them.\n\nAnother woman’s plight haunts Ink, as the passing time is cleverly noted by supertitles atop Jon Driscoll’s headline-blasting projection design. “Page One” and “Page Two” are naturally followed by “Page Three,” which happens to be the feature launched by the new Sun on its first birthday in 1970 (and maintained until 2015), displaying a young woman posing topless. Rana Roy is cast as the first model, Stephanie Rahn, born Kahn, to an Indian father. In a nod to our times, Graham makes Rahn a key character, giving her opportunities to confront Lamb about her exploitation; Miller’s nuanced reading of his frank, not dismissive response underlines how deeply his character’s more humane impulses have been challenged.\n\nMurdoch is also humanized in part by his ironic distaste for The Sun‘s naughtier antics. In one of the play’s funniest showcases for Graham’s sharp, rapid-fire dialogue, Murdoch objects to “Knickers Week,” a pre-Page Three publicity stunt, pointing out that his then-wife, Anna, is Catholic, and that he’s uneasy with the gimmick as well. “A pair of ladies’…?” he begins, then asks Lamb, “Why did they have to be in a tin?” Like his sympathy for the McKays, though, Murdoch’s prudishness could reflect more a sense of loyalty to those who serve him than fellow feeling for the masses he claims to champion.\n\nInk‘s superb cast also prominently features Michael Siberry as Hugh Cudlipp, chairman of the Mirror Group and then the International Publishing Corporation—the face of the Establishment Murdoch lambasts. Though reluctant, Cudliff finally acknowledges the ground shifting beneath him, but not before offering Lamb, his former colleague and nemesis, a few cautionary words.\n\n“Pander to and promote the most base instincts of people all you like, fine, create an appetite, but I warn you,” Cudlipp says. “You’ll have to keep feeding it.” If it’s too late to kill the beast Murdoch has nourished over decades, Ink at least encourages us to reflect on its growth—and, if we’re fair, our own accountability in that.\n\nInk opened April 24, 2019, at the Samuel J. Friedman Theatre and runs through July 7. Tickets and information: inkbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
