{
  "showId": "ink-2019",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/2019/04/in-the-broadway-play-ink-its-rupert-all-over.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "Carvel is a devilish delight to watch as Murdoch. He hikes his shoulders up and juts his head forward, giving him a vulturish vibe even in his loose, lanky frame. His mouth is always slightly open, his tongue creepily active - he's always hungry - and his eyes are like two tiny black lasers, constantly scanning the room. The director Matthew Warchus, who directed Carvel as the hideous headmistress in Matilda (for which he won a Tony), affectionately calls him a 'nose-putty actor' - and it's true that there's something refreshingly broad and tricksterish about his style. Brits in general are more comfortable as character actors, knowingly playing games with their own bodies and voices. Americans tend to want to be serious heroes - we get stuck in our heads and our feels. Not that Murdoch and his editor-and-chief have no feelings, but Ink is in large part a story of ambition, which means that sparks of doubt, distaste, and conscience are systematically doused until it's too late.",
  "bwwScore": 7,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-INK-Opens-On-Broadway--See-What-The-Critics-Are-Saying-20190424",
  "showScoreExcerpt": "“Directed with plenty of pop and fizz by Goold, and driven by the compelling performances of Carvel and Miller, it’s both playful and thoughtful — not, perhaps, a kick-in-the-guts play, but an energetic, respectable handshake...’Ink’ is perhaps on the back-heavy side, with all of the play’s weightiest, densest episodes shoved into Act Two, whereas most of the first act is dedicated to the amusing, 'Ocean’s Eleven'–like assembling of The Sun’s ragtag team.”\n\nRead more"
}