{
  "showId": "bug-2025",
  "outletId": "4columns",
  "outlet": "4Columns",
  "criticName": "David Cote",
  "url": "https://4columns.org/cote-david/bug",
  "publishDate": "2026-01-08T20:31:45-05:00",
  "fullText": "Tracy Letts’s ’90s roadside psychodrama makes its Broadway debut. Carrie Coon as Agnes White in Bug. © Matthew Murphy. Bug, written by Tracy Letts, directed by David Cromer, Samuel J. Friedman Theatre, 261 West Forty-Seventh Street, New York City, through February 22, 2026 You who nod sagely at the mention of “gut biome” or “skin flora” already know: we are filthy creatures. Host to trillions of bacteria, fungi, and viruses, our porous bodies are thoroughly impure—in fact, must be for digestion and immunity to function. But to have insects crawling all over you, biting and sucking, laying eggs—that’s a different matter. A macro manifestation of a micro commonplace spawns disgust and panic. The collapse of the unseeable into the visible is the downfall arc powering Tracy Letts’s 1996 Bug, a compact horror romance making its Broadway debut in a vivid but lopsided production at Manhattan Theatre Club. Namir Smallwood as Peter Evans in Bug. © Matthew Murphy. Its title trading on slang for listening devices, Bug’s apex delusion, gradually reached by Gulf War veteran Peter Evans (Namir Smallwood), asserts that an international cabal has been implanting subcutaneous “biochips” to track and control citizens. How to neutralize them? Cut them out. Bunkered in an increasingly trashed motel room with his lover, coke-freebasing waitress Agnes (Carrie Coon), Peter identifies his aching tooth as the source of the nano-critters. (A toolbox figures into his orthodontic solution.) For a piece inspired by the 1995 Oklahoma City bombing, it’s remarkable how Letts’s roadside psychodrama adapts itself, sans rewrite, to our present nightmares of QAnon, microplastics, and AI psychosis. The paranoid style in American culture remains evergreen. Jennifer Engstrom as R. C. and Carrie Coon as Agnes White in Bug. © Matthew Murphy. Perhaps I’ve jumped (flea-like) too quickly to the lurid second half of Bug. The tale doesn’t begin as grand guignol, and Letts craftily ratchets up tension and stakes. At the start, it’s a character study of Agnes, forty-four and inhabiting a motel unit outside Oklahoma City. Divorced from the recently paroled petty crook Jerry Goss (Steve Key), Agnes self-medicates from a booze-filled mini fridge and frequent hits off her coke pipe. One night, her shitkicker lesbian friend, R. C. (Jennifer Engstrom), brings a new acquaintance, Peter, to Agnes’s place to party. At first dismissing the shy drifter as a “maniac DEA ax murderer, Jehovah’s Witness,” our lonely protagonist then finds herself drawn to the intense young man. He’s ex-Army, nonthreatening, just wants to share the pipe and talk. Agnes confides that she lost her six-year-old son in a supermarket almost a decade ago. She gave up looking. Peter seems to fill a maternal and erotic void in Agnes. The night after she lets him crash on her floor, Peter graduates to her bed. Carrie Coon as Agnes White and Namir Smallwood as Peter Evans in Bug. © Matthew Murphy. As the finest ’80s slasher flicks have shown, making love marks the turn into darkness. Peter wakes in the middle of the night slapping at what he thinks are aphids nibbling on his skin. Naked, he and Agnes get out of the bed and strip it, searching for evidence of infestation. During this extended scene with two actors unclothed (ticket-holders’ smartphones are consigned to Yondr pouches), one’s mind goes to the bare-all losers-in-love two-hander Frankie and Johnny in the Claire de Lune or even further back, to an Edenic twosome who found their bliss interrupted by a slithering intruder. Only, instead of being banished from paradise into the real world, Peter and Agnes are about to make a progress from trailer-trash Purgatory to body-horror hell. Namir Smallwood as Peter Evans in Bug. © Matthew Murphy. Over two galloping hours, Letts traces the swift breakdown of reason as weeks pass and Peter and Agnes drape the ceiling with flypaper rolls, amass cans of Raid, and stuff roach traps in every corner. Peter acquires a microscope to study slides of his blood. Jerry and R. C. drop by to register shock at this absurd madhouse, which finally metamorphoses into walls swathed in tin foil, bathed in the purple-blue glow of bug zappers, like a laboratory aboard a spaceship. The design for this production, which premiered at Chicago’s Steppenwolf Theatre Company in 2020, directed by David Cromer, is a model of high-def realism (sets by Takeshi Kata, lighting by Heather Gilbert, and industrial sonic rumbling by sound designer Josh Schmidt). The team’s detailing is excellent: alternating washes of natural light and fluorescent bulbs, ominous clanking from a janky AC. Even one’s olfactory senses are attuned to the ambient grunge. In the opening scene, with Agnes smoking, chugging wine, and pacing the room, I smelled stale cigarettes, unwashed sheets, and cheap perfume wafting from the stage. It’s in the acting, in all honesty, where cracks start to show. Steve Key as Jerry Goss and Namir Smallwood as Peter Evans in Bug. © Matthew Murphy. Reference to Michael Shannon is unavoidable when considering Bug—especially such a high-profile revival. Shannon played Peter in the London off–West End premiere, then followed the play to Chicago in 2001 and its Off-Broadway debut three years later, which I eagerly praised. Thirty at the time, the film actor was an ideal Peter, his uniquely blocky head and exophthalmic peepers (I’m avoiding “bug-eyed”) exuding both waifish vulnerability and a whiff of danger. Shannon’s association with the showy role was further cemented when William Friedkin cast him opposite Ashley Judd in a subsequent (middling) movie version. As Brando was to Stanley Kowalski in the decades after A Streetcar Named Desire, so Shannon is to Peter Evans. Namir Smallwood as Peter Evans and Carrie Coon as Agnes White in Bug. © Matthew Murphy. Sad to report, Smallwood stumbles in shoes he can’t fill. Keeping the 2020 Steppenwolf cast intact for the Broadway transfer demonstrates loyalty but not good judgment. Emphasizing the young-nerd aspect of Peter with a bashful, diffident approach, Smallwood gives too little deranged intensity until the glimmers that arise in the second act. Even then, he lacks manic drive, the charismatic allure of a cultish rebel who could draw another mind into his conspiracist orbit. Bug lives or dies on the sexual and neurotic chemistry of its two leads, and if half the equation is muted, terror lapses into bathos. In the penultimate scene, Peter, unable to make his tooth-bug theory cohere, snaps at Agnes, “I’m not a biologist, all right?” A line that should play demented and scary instead drew chuckles from the audience. Carrie Coon as Agnes White in Bug. © Matthew Murphy. A hardworking and very effective Coon is left to maintain dramatic tension. In her TV triumphs as plucky social climbers (The Gilded Age and The White Lotus), Coon’s fresh beauty and vivacious yet sensible vigor has elevated so-so scripts. She makes a smart and relatable protagonist either in nineteenth-century bustle or Thai resort muumuu. Adopting a Southern-Midwestern twang and artfully revealing the full depth of Agnes’s trauma and hunger for meaning, Coon relishes the scuzz and grace of Agnes, even if her dance partner’s limp. Carrie Coon as Agnes White and Namir Smallwood as Peter Evans in Bug. © Matthew Murphy. Although the Samuel J. Friedman is a midsize Broadway house, it’s still rather lofty for a claustrophobic shocker like Bug. Even so, some around me found the violence too much to bear. When Agnes tried to dig a critter out of her elbow with tweezers, Peter clamped a set of pliers on his gums, or later menaced an interloper with a curved hunting knife, more than one spectator shrieked, squealed, or audibly moaned, “No, no, no . . .” Amazing: some part of our reptile brains recoils forcefully from stage representations of gore—despite knowing it’s fake. We’re not just filthy creatures, we are credulous ones, believing in things we know are not true. David Cote is a theater critic, playwright, and librettist based in Manhattan. His work has been produced in New York, London, and around the US.",
  "isFullReview": true,
  "bwwExcerpt": "A hardworking and very effective Coon is left to maintain dramatic tension. In her TV triumphs as plucky social climbers (The Gilded Age and The White Lotus), Coon’s fresh beauty and vivacious yet sensible vigor has elevated so-so scripts. She makes a smart and relatable protagonist either in nineteenth-century bustle or Thai resort muumuu. Adopting a Southern-Midwestern twang and artfully revealing the full depth of Agnes’s trauma and hunger for meaning, Coon relishes the scuzz and grace of Agnes, even if her dance partner’s limp.",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "bwwThumb": "Up",
  "bwwUrl": "https://4columns.org/cote-david/bug",
  "textStatus": "partial",
  "textWordCount": 1329,
  "archivePath": "data/archives/reviews/bug-2026/4columns--david-cote_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:31:36.855Z",
  "textIssues": [
    "Show title not found in text"
  ],
  "textQuality": "full",
  "sourceMethod": "bww-roundup"
}
