{
  "showId": "bug-2026",
  "outletId": "culturesauce-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://culturesauce.com/2026/01/11/bug-carrie-coon-broadway-review/",
  "publishDate": null,
  "fullText": "Carrie Coon and Namir Smallwood in Tracy Letts's 'Bug' (Photo: Matthew Murphy) Tracy Letts’s Bug, making its Broadway debut three decades after its first performance, is a psychological thriller that has a timely prescience in David Cromer’s riveting production. Carrie Coon delivers a powerful performance as a working-class woman with a dead-end job who’s stuck in a dingy Oklahoma motel room. She’s hoping to stay under the radar of her physically and mentally abusive ex-husband, Jerry (Steve Key), who’s newly released from prison and barges back into her life without any sense of boundaries — including the one between his fist and her cheek. Coon, with a close-cropped hair style that underscores her girlish fragility, displays flashes of resilience but mostly she’s treading water after a troubled marriage and a painful personal loss whose details bubble to the surface over time in the play but clearly weigh on her every waking moment. She soon falls under the sway of a another troubled soul: a Gulf War veteran named Peter (Namir Smallwood) whom she meets through her hard-partying lesbian co-worker pal R.C. (Jennifer Engstrom). Smallwood approaches Peter with recessive understatement and none of the showiness that Michael Shannon brought to the original production and to William Friedkin’s 2006 film adaptation. You can see how Coon’s Agnes might be drawn to this small-voiced and gentle man — and how she might turn an attentive ear to his increasingly obsessive concerns about an infestation of bedbugs and other critters in the cramped motel room they come to share (designed in dingy detail by Takeshi Kata and creepily lit by Heather Gilbert). Faster than you can say “folie à deux” the couple has barricaded themselves into a room that has become both rabbit home and echo chamber for their increasingly unhinged anxieties about a society that’s out to get them. The fact that Smallwood is Black also deepens our appreciation when Peter cites the Tuskegee syphilis trials and other examples of secret government plots that proved to be all too true. Coon and Smallwood radiate a mutual attraction that’s based less on raw sensuality, though there is some of that and a good deal of frontal nudity, than in seeking out a partner who can support them unconditionally. As Lett’s taut story builds to its tense and graphic denouement, you begin to sense how Bug has emerged as both an acute psychological study of two damaged people inflicting damage on each other and also a parable for our age of heightened, often tribal paranoia. (Hat tip to Josh Schmidt’s sound design, which enhances the horror-story atmosphere.) According to the case study of Agnes, you just need to shut yourself up with a persuasive voice whispering fact-adjacent stories into your ear to slip into disturbing delusions that will be your undoing. ★★★★☆ BUGSamuel J. Friedman Theatre, BroadwayRunning time: 1 hour, 55 minutes (with 1 intermission)Tickets on sale through February 22 for $99 to $281 Off Broadway review: Carrie Coon in ‘Mary Jane’September 25, 2017In \"Theater\" Off Broadway review: Carrie Coon in ‘Placebo’March 16, 2015In \"Alex Hurt\" Critic’s picks: The best of Broadway and Off Broadway right nowJanuary 11, 2026In \"Theater\" Δ /* <![CDATA[ */ document.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() ); /* ]]> */",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "partial",
  "textWordCount": 541,
  "archivePath": "data/archives/reviews/bug-2026/culturesauce-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:24:54.378Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ]
}