{
  "showId": "bug-2025",
  "outletId": "daily-beast",
  "outlet": "The Daily Beast",
  "criticName": "Tim Teeman",
  "url": "https://www.thedailybeast.com/obsessed/bug-broadway-review-carrie-coon-absolutely-loses-her-mind/",
  "publishDate": "January 8, 2026",
  "fullText": "Where is Bertha Russell when you need her? While The Gilded Age’s commanding chatelaine couldn’t be more removed from her portrayer Carrie Coon’s latest role, Bertha’s coolly executed imposition of order would be welcome for the characters perilously adrift in Coon’s latest project, the Broadway play Bug. \n\nIn her husband Tracy Letts’ play, first produced in 1996, Coon (also a standout in the most recent season of The White Lotus) plays a cocaine-snorting waitress, Agnes Wilson, residing in a seedy motel room. She has a menacing ex-con of a husband (Steve Key) and a spiky lesbian friend, R.C. (Jennifer Engstrom), who fatefully introduces her to Gulf War veteran Peter Evans (Namir Smallwood).\n\nThe play—and specifically the character of Peter—was inspired by Oklahoma City bomber Timothy McVeigh, Letts recently told the New York Times, and Letts’ realization at the time that “there was a whole strata of people who were living in a different reality than we were.”\n\nIn the motel room (meaningfully situated on the outskirts of Oklahoma City), a story of delusions, paranoia, and conspiracy theories erupts, based around the supposed presence of insects in the room—how did they get there, and who put their larvae, Peter claims, in his body? (Michael Shannon originated the role of Peter in 1996 and almost a decade later off-Broadway.) \n\n“I’m not an ax murderer,” Peter breezily reassures Agnes when they first meet—but he may be just as dangerous and unbalanced.\n\nThe sharpest echoes of this Broadway revival, mounted by Manhattan Theatre Club in association with Steppenwolf Theatre Company (Samuel J. Friedman Theatre, booking to Feb. 8), are those smashing through time to the present day. We are living in an era when conspiracy theories and outrageous fabrications have traveled from the absurdist margins to the internet-addled mainstream of 2025. Authoritarian governments manipulate in their pursuit of power. Day in day out, we are all trapped in a global version of the motel room.\n\nDirected by David Cromer, Bug retains its foreboding crackle, while keeping its characters and audience uncomfortably rooted in a claustrophobic four-walls that is a petri dish for an insanity that has become so much more culturally pervasive than the individual focus Letts configured in 1996. \n\nIn this fascinating—if repetitive and oddly lethargic play—both Coon and Smallwood conjure arresting performances. Agnes is looking for someone so unlike her ex-husband that she is seduced by the merest hint of poise, charisma, and gentleness, as Peter initially seems to possess.\n\nSmallwood’s Peter is both watchful and ferocious, and as ridiculous as his railing about larvae in his body and insects seems, both he and Letts find the character’s alarming sweet-spot that has become so exploited by conspiracy theorists; that what Peter claims, what he believes, is self-embraced so devoutly that the audience, like Agnes, comes to wonder: could it be true? What else to explain the graphic body horror and terror that he perceives and physically feels?\n\n“The doctors came in and really worked us over, with shots and pills, ostensibly for inoculation, but ... there was something else going on, too,” Peter insists of his time in the military. Could the shadowy forces Peter believes are out to get him be there? The introduction of a sinister military doctor played by Randall Arney in pursuit of Peter seems to confirm elements of his story. Helicopters whirr overhead. \n\nThanks to Coon and Smallwood’s escalating intensity you buy the fever percolating in the room that has the pair imagining themselves as unjustly abused outlaws. Everything that could be an insect, or larvae, is thrust under a microscope for examination to prove Peter’s suspicions. But Bug doesn’t find a way to deepen this journey to hell, merely to repeat it—or find a useful purpose for the characters of R.C. and Jerry; both become under-utilized foils.\n\nPeter seems dangerously unhinged, yet Agnes seems both in thrall to what he believes and also too terrified to try to escape—both because of his erratic behavior and because in him she has found someone so protectively dedicated to her. \n\nIn time, the room will come to be covered in flypaper strips hanging like weeping willows from the ceiling and insulating foil covering the walls. Takeshi Kata’s design astutely combines a motel room’s threadbare cheapness with vivid signs of the madness unfolding within. But what is really happening, and what is true, is left teasingly, maybe meaningfully, ambiguous.\n\nWhile fascinating in its ambition, pretty early the momentum of the play stalls, and Bug becomes an arduous descent into loud shouting and, ultimately, no answers. Coon and Smallwood’s performances navigating this nightmare slalom are electric. The play, prophetically prescient as it may be, is not.",
  "originalScore": null,
  "assignedScore": null,
  "source": "scraped",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Carrie-Coon-Namir-Smallwood-and-More-Star-in-BUG-on-Broadway-20260108",
  "dtliThumb": "Meh",
  "scrapedAt": "2026-01-23T22:01:41.953Z"
}