{
  "showId": "bug-2026",
  "outletId": "new-yorker",
  "outlet": "The New Yorker",
  "criticName": "Emily Nussbaum",
  "url": "https://www.newyorker.com/magazine/2026/01/19/bug-theatre-review",
  "publishDate": "January 9, 2026",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "In Coon's openhearted, subtly joyful portrayal, Agnes is not a broken person who is tricked into faith; she is someone who makes a series of choices to get something she needs, a glue to fix a broken world. In her final monologue, this all becomes clear: it's liberating to see a pattern in your pain, instead of a nightmare that makes no sense. Who among us wouldn't bite at the chance?     David Cote, 4Columns: A hardworking and very effective Coon is left to maintain dramatic tension. In her TV triumphs as plucky social climbers (The Gilded Age and The White Lotus), Coon’s fresh beauty and vivacious yet sensible vigor has elevated so-so scripts. She makes a smart and relatable protagonist either in nineteenth-century bustle or Thai resort muumuu. Adopting a Southern-Midwestern twang and artfully revealing the full depth of Agnes’s trauma and hunger for meaning, Coon relishes the scuzz and grace of Agnes, even if her dance partner’s limp.        Average Rating: 80.6% {   \"@context\":\"https://schema.org\",   \"@type\":\"LiveBlogPosting\",   \"@id\":\"/article/Review-Roundup-Carrie-Coon-Namir-Smallwood-and-More-Star-in-BUG-on-Broadway-20260108\",   \"about\":{     \"@type\":\"Event\",     \"startDate\":\"2026-01-08T08:31:45-05:00\",          \"name\":\"Review Roundup: Carrie Coon, Namir Smallwood and More Star in BUG on Broadway\",            \"eventAttendanceMode\": \"https://schema.org/OnlineEventAttendanceMode\",       \"location\": {         \"@type\": \"VirtualLocation\",         \"url\": \"/article/Review-Roundup-Carrie-Coon-Namir-Smallwood-and-More-Star-in-BUG-on-Broadway-20260108\"         }     },   \"coverageStartTime\":\"2026-01-08T08:31:45-05:00\",      \"coverageEndTime\":\"2026-01-08T11:31:45-05:00\",   \"headline\":\"Review Roundup: Carrie Coon, Namir Smallwood and More Star in BUG on Broadway\",      \"description\":\"Manhattan Theatre Club is presenting the first Broadway production of Tracy Letts' Bug, the sci-fi thriller written by Tony Award and Pulitzer Prize winner Tracy Letts and directed by Tony Award winner David Cromer. Read reviews for the production!\",   \"liveBlogUpdate\":[     {       \"@type\":\"BlogPosting\",       \"headline\":\"The New York Times - ‘Bug’ Review: Carrie Coon Is Superb in an American Gothic Tale\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"CRITIC'S PICK. This new Manhattan Theater Club production, which opened Thursday at the Samuel J. Friedman Theater, is more tender and balanced, with Namir Smallwood rendering Peter as a gentler, less alien figure. The focus has shifted to his romantic partner, Agnes (Coon), a desperate sad sack haunted by a loss in her past. In a superb performance, Coon provides the alpha energy this time, her eruptive anger masking an inner conflict worn on her weary face. The director David Cromer still delivers effective jolts, yet his production feels disturbingly closer to home. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Wall Street Journal - ‘Bug’ Review: A Broadway Drama of Insidious Delusion\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Carrie Coon is unleashed from her corsets—and every other stitch of clothing—in the blistering Broadway revival of her husband Tracy Letts’s macabre thriller “Bug,” being presented by Manhattan Theatre Club roughly 20 years after it was first seen in New York off-Broadway. (Due to the prevalence of nudity, audiences must turn off their phones and have them put in secure pouches for the show’s duration.)\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Variety - ‘Bug’ Broadway Review: Carrie Coon’s Gutting Performance Elevates This Horror Thriller \",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"“Bug” is as intimate as it is intense. The set, designed by Takeshi Kata, drops the audience right into this specific place and time. The lightning, helmed by Heather Gilbert, and the sound, spearheaded by Josh Schmidt, also keep the play tightly grounded, though the production may have worked even better in a smaller theater. Additionally, midway through Act II, there is a shocking set change that reveals just how deep into their psychosis Agnes and Peter have sunk. Moreover, amid Agnes and Peter’s continued descent toward insanity, the story remains convincing because of the characters’ obvious affection and mutual obsession. It’s pretty apparent they are causing each other immense harm. However, their actions stem from a place of love, companionship, humor and understanding, which makes the tale especially heartbreaking.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Vulture - 30 Years Later, Is Bug Still Catching?\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"The performance is forceful enough for this Bug to operate chiefly as a character study. Despite the cesspits of ­conspiracy-think that pollute contemporary politics, the specific paranoia of Letts’s ­characters — bugs under the skin, brainwashing, ­nefarious doctors in government labs — feels less blazingly relevant than comparatively quaint. At the same time, because Cromer and his designers opt to keep the audience at a remove from Peter and Agnes’s folie à deux, the monsters they behold don’t ever truly spook us. They are shadows­ only, never claws and flesh. In such a production, the fantasy at the story’s center can’t become contagious. We bear witness to two sad, mad people. We don’t question our own sanity.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Time Out New York - Bug\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Although Agnes and Peter sleep together early on, their relationship isn’t primarily sexual. But there’s an element of seduction to their whole dynamic, as Peter, at first reluctantly, gets under Agnes’s skin. Letts is an actor as well as a playwright—he and Coon, who are married, met while co-starring in a revival of Who’s Afraid of Virginia Woolf?—and he knows how to craft scenes that keep performers intensely engaged with each other onstage. Smallwood and Coon, reprising their roles from the 2021 production of Bug at Chicago’s Steppenwolf Theatre, strike a compelling balance. He arrives full of secrets that he gradually reveals; she arrives empty and eager to swallow them up, spiraling ever farther away from life beyond her room. (In several ways, this role is like the flip side of the steadfast mother Coon played so indelibly in Mary Jane.) \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Entertainment Weekly - Bug review: Carrie Coon is captivating in skin-crawling rendition of Tracy Letts' cult-classic play\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Here, there's a skin-crawling effect to watching the story unfold onstage. The Broadway production capitalizes on discomfort, keeping tension taut and surprises around every corner. Grade: B+ \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Daily Beast - ‘The White Lotus’ Star Absolutely Loses Her Mind\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"While fascinating in its ambition, pretty early the momentum of the play stalls, and Bug becomes an arduous descent into loud shouting and, ultimately, no answers. Coon and Smallwood’s performances navigating this nightmare slalom are electric. The play, prophetically prescient as it may be, is not.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - Bug: It’s Back, Creepier than Ever\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"It’s the same excellent cast from Steppenwolf’s production in Chicago five years ago. But it feels even more relevant now. America’s history of conducting secret experiments on unwitting human guinea pigs planted ample seeds of doubt about our institutions. And today that distrust has only metastasized amid the acute madness of social media-fueled disinformation. Letts cites Oklahoma City bomber Timothy McVeigh as inspiration for the play. It’s terrifying to consider how many more are out there.  \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - Bug: Tracy Letts’ Shocker Lands on Broadway\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"When Bug was first seen Off-Broadway in 2004, it seemed prescient in its portrayal of mental illness and conspiracy theories. Now — after the world has gone collectively crazy with wacky notions about COVID, pedophile rings, vaccines, and 5G, among countless other things — Tracy Letts’ play practically feels quaint. Receiving its Broadway premiere in a Manhattan Theatre Club production in association with Steppenwolf Theatre Company, it nonetheless remains a grippingly unnerving thriller that feels like a waking nightmare.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"amNY - Review | ‘Bug’ Crawls onto Broadway with craft but little bite\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Seen on Broadway, with greater polish and physical distance, “Bug” lands differently. The problem isn’t that “Bug” no longer makes sense. It’s that this time, I never fully went with it. I understood what the play was doing. I respected the craft. I appreciated the performances. But I didn’t surrender to the descent. Where the play once swept me into its fever dream, I remained aware, analytical, outside the experience. The bugs never got under my skin.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Guardian - Bug review – Carrie Coon brings intensity to paranoid Tracy Letts revival\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Audiences seeing Bug for the first time, then, may well be transfixed, albeit temporarily. Anyone familiar with an earlier production or the William Friedkin film (which introduces some ambiguities to the story’s ending) might start to wonder if maybe Agnes and Peter are ultimately a little thin as characters – if they’re worth the intensity that Coon and Smallwood invest into this production. It’s probably not fair to compare a 100-minute early work from Letts to a towering masterpiece like August: Osage County, his Broadway debut from 2007. At the same time, Letts has clearly evolved as a writer since Bug, and it’s hard not to come away from this production wondering how he might address the contemporary version of this drug-addled psychological unmooring. It’s not so much that this production of Bug is outdated; more accurately, it’s got way too much competition, on stage and off.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"One-Minute Critic - Review: Carrie Coon and Namir Smallwood scratch more than an itch in Tracy Letts’ ‘Bug’\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Director David Cromer (Dead Outlaw, Meet the Cartozians) keeps the play’s focus tight and the performances brisk within the confines of scenic designer Takeshi Kata’s oppressive motel room-turned bunker. But it’s Coon and Smallwood’s performances that make us question how far we’ll go to not feel alone, regardless of the outcome. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Theatrely - Conspiracies Abound In BUG — Review\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Even as his characters destroy their world and themselves, Letts never loses sight of the strange comfort in a good conspiracy theory. (Many of the real-life examples Peter manically cites are, in fact, entirely true.) One unifying theory making sense of all the pain is, for these damaged souls, so much more comforting. Even if it means setting it all on fire. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"USA Today - Carrie Coon's 'Bug' is the most thrilling night on Broadway – Review\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"While lesser actors might veer into overwrought hysterics, Coon – with her piercing gaze and tousled mess of hair – creates a character that is fully lived-in and believable. Like the very best art, or a pesky insect, it's the kind of performance that burrows deep into your soul.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Theatre Guide - 'Bug' Broadway review — Carrie Coon and Namir Smallwood burrow into an intense drama\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Amid crafty scenic metamorphoses, blood, violence, and pyrotechnics, the show’s most special effects are performances by Coon and Smallwood. They’ve etched their forsaken characters with impressive ache and intensity that sets off sparks as bright as any bug zapper.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Chicago Tribune - Review: Once a storefront theater curiosity, ‘Bug’ opens big on Broadway\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"The scariest change, though, is that in an America where guardrails have fallen, tech-sector parasites run amok in our hands and heads, and trust in government is close to nonexistent, what seemed totally implausible in 1996 now feels like reasonable societal comment. At one point, there is worry about whether one of the characters is some kind of robot. Thirty years ago, I vividly recall laughing that off as a device of plotting and one of Letts’ signature, genre-driven games with many more yet to come. This time around? Not at all. Felt perfectly plausible.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The New Yorker - In Tracy Letts’s “Bug,” Crazy Is Contagious\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"In Coon's openhearted, subtly joyful portrayal, Agnes is not a broken person who is tricked into faith; she is someone who makes a series of choices to get something she needs, a glue to fix a broken world. In her final monologue, this all becomes clear: it's liberating to see a pattern in your pain, instead of a nightmare that makes no sense. Who among us wouldn't bite at the chance?\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"4Columns - Bug\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"A hardworking and very effective Coon is left to maintain dramatic tension. In her TV triumphs as plucky social climbers (The Gilded Age and The White Lotus), Coon’s fresh beauty and vivacious yet sensible vigor has elevated so-so scripts. She makes a smart and relatable protagonist either in nineteenth-century bustle or Thai resort muumuu. Adopting a Southern-Midwestern twang and artfully revealing the full depth of Agnes’s trauma and hunger for meaning, Coon relishes the scuzz and grace of Agnes, even if her dance partner’s limp.\"     }             ] }",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Carrie-Coon-Namir-Smallwood-and-More-Star-in-BUG-on-Broadway-20260108",
  "dtliThumb": "Up"
}
