{
  "showId": "bug-2026",
  "outletId": "new-yorker",
  "outlet": "The New Yorker",
  "criticName": "Emily Nussbaum",
  "url": "https://www.newyorker.com/magazine/2026/01/19/bug-theatre-review",
  "publishDate": "January 9, 2026",
  "fullText": "The TheatreIn Tracy Letts’s “Bug,” Crazy Is ContagiousA Broadway revival arrives at a moment when paranoia plots are everywhere.By Emily NussbaumJanuary 9, 2026Carrie Coon and Namir Smallwood build a cracked but genuine intimacy.Illustration by Jovana MugošaSave this storySave this storySave this storySave this storyThe Manhattan Theatre Club revival of Tracy Letts’s funny, ultimately heartbreaking psychological thriller “Bug” opens with Carrie Coon—who plays Agnes White, a lonely waitress holed up in an Oklahoma motel room—standing in front of a half-open door and holding a wineglass upside down, radiating isolation. Soon, someone picks up her signal: Peter Evans, a sad-sack drifter who has tagged along with Agnes’s honky-tonk buddy R.C. and then sticks around. Peter is a weird guy and a bit younger than Agnes, but he’s polite and willing to keep her company, to drink her wine and smoke some crack. (He won’t snort powder cocaine, though: that stuff is bad for you, he explains.) And then he wakes up with a bug bite. When Agnes can’t see a bug that he points at, frantically, he urges her to look closer. She does—and maybe she sees something.Agnes learns that Peter, a veteran of the Gulf War, understands certain dark realities about the world—and suddenly these two strangers have everything in common. As she soaks up Peter’s paranoia about infestation and he swats away her skepticism, their conversation lights up, at once broadening and narrowing as they obsess about “plant aphids” and “coke bugs,” egg sacs and military implants. It’s a crisis that they can face together without ever leaving the room, which begins to feel like the only real place on earth. In the director David Cromer’s spare, intelligent production, the set hovers inside an inky blackness. Together, the pair build a cracked but genuine intimacy, a bond that escalates frighteningly in the second act, in a way that brought to mind the country song “Fade Into You,” which ends with the lines “There’ll be no trace that one was once two / After I fade into you.” By the show’s unnerving final moments, Agnes and Peter don’t even have to speak to know what to do next.When “Bug” premièred, in 1996, the role of Peter was designed as a showcase for the handsome, cadaverous charisma of Michael Shannon, whom Letts met when Shannon was a sixteen-year-old launching himself into Chicago’s experimental-theatre scene. Shannon had played a trailer-trash fuckup in Letts’s early hit, the nihilist neo-noir “Killer Joe,” and for “Bug,” a more humane but equally dark-humored project, he channelled a different kind of intensity, a neuro-atypical, weirdo strength, all striated muscles and bug eyes. It made sense that Agnes couldn’t look away.Namir Smallwood, an ensemble member at Steppenwolf, the Chicago repertory company where the new production originated, plays Peter as a much softer, more recessive figure. He’s a little sluggish, his volume turned way down. In early scenes, he exudes a puppyish, confused sweetness, and there is logic to this interpretation. His Peter is unthreatening enough for it to make sense that Agnes, who is hiding from her ex-con husband, lets him get so close to her—even after they sleep together, he seems less like a lover than like a lost child. There’s no frisson when they are naked together, as they are for long periods. He’s muted compared with the other, more intense figures in Agnes’s life: the vivacious broad R.C. (played with rangy, liberating hilarity by Jennifer Engstrom) and that mean ex. Over time, his sweetness darkens, then hollows out. When, at a key moment, Coon leaps into Smallwood’s arms in abandon, it feels like watching a person jump happily into an empty pool.In Cromer’s framing, that hollowness begins to feel like the play’s sad theme: when someone is on a desperate hunt for meaning, the source of it ultimately doesn’t matter very much. It also turns the play into a story about Agnes, not Peter—her decision to believe, in “X-Files” terms. Coon, who is Letts’s wife, builds an Agnes who, despite her fragility and naïveté, also comes across as a sharp, observant woman—and the actress, with her pretty moon face and coltish legs sticking out of denim short shorts, has a natural likability, scoring laughs from a hundred tiny gestures, such as a skeptical glance in the mirror. Smallwood’s Peter gets a few deadpan comebacks, but by Act II he is less a seducer than a reply guy, a dedicated pattern finder pivoting to fend off challenges to his theories.In a crucial scene, Agnes herself wonders out loud about this imbalance. “I don’t know why I love you so much. I don’t even know you very well,” she tells Peter plaintively, as they lie in bed. “I guess I’d rather talk with you about bugs than talk about nothin’ with nobody.” The reason for this is awful: everything else she could talk about is so much worse.Maybe the strangest thing about this revival is how ordinary these characters are likely to seem to an audience in 2026, especially Peter, a figure you might stumble on in any Reddit thread. For the original production—which was staged at the Gate, the tiny experimental theatre in London—the script was written quickly by Letts as a nimble follow-up to “Killer Joe” and constructed to match the needs of an intimate space. The play has become a staple of small companies, with its one set (used brilliantly here, in ways not worth spoiling) and its series of febrile monologues, including a final one that Coon eats for breakfast. But, when “Bug” was written, it had a specific historical referent: Letts, who grew up in Oklahoma, was so shocked by Timothy McVeigh’s bombing of the Alfred P. Murrah Federal Building that he looked for answers on the then rudimentary web, where he found conspiratorial rabbit holes, freshly dug. He studied psychosis and folie-à-deux madness, investigating how mental contagions spread.Thirty years ago, Peter’s state of mind was likely bracing and exotic for audiences. Now, in the age of covid, QAnon, Pizzagate, and the Epstein files, it’s the substance we are all soaking in, our toxic Palmolive. Although it’s never remarked on in the text, casting Smallwood, a Black man, as the only actor of color in a drama set in Oklahoma works as an intensifier for Peter’s view of the world. When he talks about the Tuskegee experiment and the Jonestown massacre, these references carry extra weight—though it also seems unlikely that he wouldn’t bring up race and that his enemies, particularly Agnes’s crude ex, wouldn’t either.There are moments in “Bug” that seem eerily modern, including an encounter in which Peter insists that a human being is a robot. It mirrored the plot of the gonzo film “Bugonia,” in which a pair of wack jobs kidnap a C.E.O. they believe is an alien, and of the nutso ending of “Eddington”—I could go on. Contemporary culture is a delirium of both conspiracy-mongering and conspiracy-puncturing, in every medium. On television shows from “Severance” to “Stranger Things,” the people who believe the worst are inevitably correct, either because in a serialized thriller it makes sense for each sinister revelation to climb higher up the ladder—or because sometimes the head is where the fish is rotting from. The superfan mind-set can feel uneasily adjacent to a QAnon fixation.But mystery is just as interesting. That was the subject of HBO’s “The Leftovers,” in which Coon gave one of her best performances to date, as a woman who had lost her entire family to an inexplicable extinction event, forcing her to build a new self from scratch. Her Agnes is up to something similar, this time as a team sport. At the heart of “Bug” is a romantic craving—to be with someone and not be judged for your craziest thoughts. It’s a play about painkillers of all kinds, but also about how much easier grief is to handle when it’s reimagined as a battle to be won. Terrible things may be happening to you and your partner, but you’re at the center of it, together.Even in an era in which paranoia has become the default setting, “Bug” feels more pungent, more punishing, and—for all its perversity—more crushing than similar stories, precisely because it’s about how people “catch feelings,” not just ideas. In Coon’s openhearted, subtly joyful portrayal, Agnes is not a broken person who is tricked into faith; she is someone who makes a series of choices to get something she needs, a glue to fix a broken world. In her final monologue, this all becomes clear: it’s liberating to see a pattern in your pain, instead of a nightmare that makes no sense. Who among us wouldn’t bite at the chance? ♦Published in the print edition of the January 19, 2026, issue, with the headline “Contagion.”New Yorker FavoritesThe man who spent forty-two years at the Beverly Hills Hotel pool.After a London teen mysteriously plummeted into the Thames, his parents discovered that he’d been posing as an oligarch’s son.What happens when a bad-tempered, distractible doofus runs an empire?Why you can’t get a restaurant reservation.The pious wife of the Marquis de Sade.Personal History by Nora Ephron: to move into the Apthorp was to enter a state of giddy, rent-stabilized delirium.Emily Nussbaum, a staff writer at The New Yorker since 2011, is the magazine’s theatre critic. Her books include “Cue The Sun!: The Invention of Reality TV.”Read MoreThe Front RowErich von Stroheim’s Spectacular Art Is BackA new restoration of Stroheim’s unfinished 1929 drama “Queen Kelly” spotlights his reckless directorial career, which, though brief, is one of the greatest of all.By Richard BrodyThe New Yorker InterviewAmanda Seyfried’s EpiphaniesThe star of “The Testament of Ann Lee” and “The Housemaid” discusses letting go of judgment, working without hierarchies, and committing to the role of a woman possessed by faith.By Rachel SymeA Critic at LargeThe New York Shooting That Defined an EraOn a mild December day in 1984, a man named Bernie Goetz shot four Black teen-agers on a subway. The incident galvanized the city. Are we still living in its wake?By Adam GopnikThe Current Cinema“Young Mothers” Is a Gentle Gift from the Dardenne BrothersIn Jean-Pierre and Luc Dardenne’s latest drama, set in and around a Belgian maternity home, several teen-age moms seek to break through cycles of poverty, addiction, and neglect.By Justin ChangTakesPatrick Radden Keefe on Truman Capote’s “In Cold Blood”Capote’s journalistic transgressions were serious, but there is no denying the awesome influence of his work.By Patrick Radden KeefePersons of InterestThe Gospel According to Emily HenryHow the best-selling author of “People We Meet on Vacation” channelled her love of rom-coms—and her religious upbringing—into a new kind of romance novel.By Lauren Boersma HarrisThe LedeWhat “The Pitt” Taught Me About Being a DoctorIt’s as if the show’s creators absorbed every important conversation in health care today—and somehow transfigured it into good television.By Dhruv KhullarThe Current CinemaIn Two Films About Palestinian Struggle, Time Is of the EssenceIn “All That’s Left of You” and “The Voice of Hind Rajab,” medical emergencies beget agonizing moral conundrums.By Justin ChangUnder ReviewThe Perils of Killing the Already DeadFear of what the dead might do to us didn’t start with Dracula, and it didn’t end with him, either.By Rivka GalchenGoings OnJanuary Festivals Bring the Weird, Wonderful ShowsAlso: “Tartuffe” mania, the guitar stylings of William Tyler and Yasmin Williams, Justin Chang’s movies for a new year, and more.By Sheldon PearceCritic’s NotebookThe Delicious Anticipation–and, Yes, Release—of “Heated Rivalry”The show, a sexy romance between two closeted hockey players, began on a small Canadian streaming platform, but has become a huge, unexpected hit.By Naomi FryBook CurrentsReading for the New YearThe first installment in a series of recommendations by New Yorker writers.",
  "isFullReview": true,
  "dtliExcerpt": "In Coon's openhearted, subtly joyful portrayal, Agnes is not a broken person who is tricked into faith; she is someone who makes a series of choices to get something she needs, a glue to fix a broken world. In her final monologue, this all becomes clear: it's liberating to see a pattern in your pain, instead of a nightmare that makes no sense. Who among us wouldn't bite at the chance?     David Cote, 4Columns: A hardworking and very effective Coon is left to maintain dramatic tension. In her TV triumphs as plucky social climbers (The Gilded Age and The White Lotus), Coon’s fresh beauty and vivacious yet sensible vigor has elevated so-so scripts. She makes a smart and relatable protagonist either in nineteenth-century bustle or Thai resort muumuu. Adopting a Southern-Midwestern twang and artfully revealing the full depth of Agnes’s trauma and hunger for meaning, Coon relishes the scuzz and grace of Agnes, even if her dance partner’s limp.        Average Rating: 80.6% {   \"@context\":\"https://schema.org\",   \"@type\":\"LiveBlogPosting\",   \"@id\":\"/article/Review-Roundup-Carrie-Coon-Namir-Smallwood-and-More-Star-in-BUG-on-Broadway-20260108\",   \"about\":{     \"@type\":\"Event\",     \"startDate\":\"2026-01-08T08:31:45-05:00\",          \"name\":\"Review Roundup: Carrie Coon, Namir Smallwood and More Star in BUG on Broadway\",            \"eventAttendanceMode\": \"https://schema.org/OnlineEventAttendanceMode\",       \"location\": {         \"@type\": \"VirtualLocation\",         \"url\": \"/article/Review-Roundup-Carrie-Coon-Namir-Smallwood-and-More-Star-in-BUG-on-Broadway-20260108\"         }     },   \"coverageStartTime\":\"2026-01-08T08:31:45-05:00\",      \"coverageEndTime\":\"2026-01-08T11:31:45-05:00\",   \"headline\":\"Review Roundup: Carrie Coon, Namir Smallwood and More Star in BUG on Broadway\",      \"description\":\"Manhattan Theatre Club is presenting the first Broadway production of Tracy Letts' Bug, the sci-fi thriller written by Tony Award and Pulitzer Prize winner Tracy Letts and directed by Tony Award winner David Cromer. Read reviews for the production!\",   \"liveBlogUpdate\":[     {       \"@type\":\"BlogPosting\",       \"headline\":\"The New York Times - ‘Bug’ Review: Carrie Coon Is Superb in an American Gothic Tale\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"CRITIC'S PICK. This new Manhattan Theater Club production, which opened Thursday at the Samuel J. Friedman Theater, is more tender and balanced, with Namir Smallwood rendering Peter as a gentler, less alien figure. The focus has shifted to his romantic partner, Agnes (Coon), a desperate sad sack haunted by a loss in her past. In a superb performance, Coon provides the alpha energy this time, her eruptive anger masking an inner conflict worn on her weary face. The director David Cromer still delivers effective jolts, yet his production feels disturbingly closer to home. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Wall Street Journal - ‘Bug’ Review: A Broadway Drama of Insidious Delusion\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Carrie Coon is unleashed from her corsets—and every other stitch of clothing—in the blistering Broadway revival of her husband Tracy Letts’s macabre thriller “Bug,” being presented by Manhattan Theatre Club roughly 20 years after it was first seen in New York off-Broadway. (Due to the prevalence of nudity, audiences must turn off their phones and have them put in secure pouches for the show’s duration.)\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Variety - ‘Bug’ Broadway Review: Carrie Coon’s Gutting Performance Elevates This Horror Thriller \",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"“Bug” is as intimate as it is intense. The set, designed by Takeshi Kata, drops the audience right into this specific place and time. The lightning, helmed by Heather Gilbert, and the sound, spearheaded by Josh Schmidt, also keep the play tightly grounded, though the production may have worked even better in a smaller theater. Additionally, midway through Act II, there is a shocking set change that reveals just how deep into their psychosis Agnes and Peter have sunk. Moreover, amid Agnes and Peter’s continued descent toward insanity, the story remains convincing because of the characters’ obvious affection and mutual obsession. It’s pretty apparent they are causing each other immense harm. However, their actions stem from a place of love, companionship, humor and understanding, which makes the tale especially heartbreaking.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Vulture - 30 Years Later, Is Bug Still Catching?\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"The performance is forceful enough for this Bug to operate chiefly as a character study. Despite the cesspits of ­conspiracy-think that pollute contemporary politics, the specific paranoia of Letts’s ­characters — bugs under the skin, brainwashing, ­nefarious doctors in government labs — feels less blazingly relevant than comparatively quaint. At the same time, because Cromer and his designers opt to keep the audience at a remove from Peter and Agnes’s folie à deux, the monsters they behold don’t ever truly spook us. They are shadows­ only, never claws and flesh. In such a production, the fantasy at the story’s center can’t become contagious. We bear witness to two sad, mad people. We don’t question our own sanity.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Time Out New York - Bug\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Although Agnes and Peter sleep together early on, their relationship isn’t primarily sexual. But there’s an element of seduction to their whole dynamic, as Peter, at first reluctantly, gets under Agnes’s skin. Letts is an actor as well as a playwright—he and Coon, who are married, met while co-starring in a revival of Who’s Afraid of Virginia Woolf?—and he knows how to craft scenes that keep performers intensely engaged with each other onstage. Smallwood and Coon, reprising their roles from the 2021 production of Bug at Chicago’s Steppenwolf Theatre, strike a compelling balance. He arrives full of secrets that he gradually reveals; she arrives empty and eager to swallow them up, spiraling ever farther away from life beyond her room. (In several ways, this role is like the flip side of the steadfast mother Coon played so indelibly in Mary Jane.) \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Entertainment Weekly - Bug review: Carrie Coon is captivating in skin-crawling rendition of Tracy Letts' cult-classic play\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Here, there's a skin-crawling effect to watching the story unfold onstage. The Broadway production capitalizes on discomfort, keeping tension taut and surprises around every corner. Grade: B+ \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Daily Beast - ‘The White Lotus’ Star Absolutely Loses Her Mind\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"While fascinating in its ambition, pretty early the momentum of the play stalls, and Bug becomes an arduous descent into loud shouting and, ultimately, no answers. Coon and Smallwood’s performances navigating this nightmare slalom are electric. The play, prophetically prescient as it may be, is not.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - Bug: It’s Back, Creepier than Ever\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"It’s the same excellent cast from Steppenwolf’s production in Chicago five years ago. But it feels even more relevant now. America’s history of conducting secret experiments on unwitting human guinea pigs planted ample seeds of doubt about our institutions. And today that distrust has only metastasized amid the acute madness of social media-fueled disinformation. Letts cites Oklahoma City bomber Timothy McVeigh as inspiration for the play. It’s terrifying to consider how many more are out there.  \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Stage Review - Bug: Tracy Letts’ Shocker Lands on Broadway\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"When Bug was first seen Off-Broadway in 2004, it seemed prescient in its portrayal of mental illness and conspiracy theories. Now — after the world has gone collectively crazy with wacky notions about COVID, pedophile rings, vaccines, and 5G, among countless other things — Tracy Letts’ play practically feels quaint. Receiving its Broadway premiere in a Manhattan Theatre Club production in association with Steppenwolf Theatre Company, it nonetheless remains a grippingly unnerving thriller that feels like a waking nightmare.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"amNY - Review | ‘Bug’ Crawls onto Broadway with craft but little bite\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Seen on Broadway, with greater polish and physical distance, “Bug” lands differently. The problem isn’t that “Bug” no longer makes sense. It’s that this time, I never fully went with it. I understood what the play was doing. I respected the craft. I appreciated the performances. But I didn’t surrender to the descent. Where the play once swept me into its fever dream, I remained aware, analytical, outside the experience. The bugs never got under my skin.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The Guardian - Bug review – Carrie Coon brings intensity to paranoid Tracy Letts revival\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Audiences seeing Bug for the first time, then, may well be transfixed, albeit temporarily. Anyone familiar with an earlier production or the William Friedkin film (which introduces some ambiguities to the story’s ending) might start to wonder if maybe Agnes and Peter are ultimately a little thin as characters – if they’re worth the intensity that Coon and Smallwood invest into this production. It’s probably not fair to compare a 100-minute early work from Letts to a towering masterpiece like August: Osage County, his Broadway debut from 2007. At the same time, Letts has clearly evolved as a writer since Bug, and it’s hard not to come away from this production wondering how he might address the contemporary version of this drug-addled psychological unmooring. It’s not so much that this production of Bug is outdated; more accurately, it’s got way too much competition, on stage and off.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"One-Minute Critic - Review: Carrie Coon and Namir Smallwood scratch more than an itch in Tracy Letts’ ‘Bug’\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Director David Cromer (Dead Outlaw, Meet the Cartozians) keeps the play’s focus tight and the performances brisk within the confines of scenic designer Takeshi Kata’s oppressive motel room-turned bunker. But it’s Coon and Smallwood’s performances that make us question how far we’ll go to not feel alone, regardless of the outcome. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Theatrely - Conspiracies Abound In BUG — Review\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Even as his characters destroy their world and themselves, Letts never loses sight of the strange comfort in a good conspiracy theory. (Many of the real-life examples Peter manically cites are, in fact, entirely true.) One unifying theory making sense of all the pain is, for these damaged souls, so much more comforting. Even if it means setting it all on fire. \"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"USA Today - Carrie Coon's 'Bug' is the most thrilling night on Broadway – Review\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"While lesser actors might veer into overwrought hysterics, Coon – with her piercing gaze and tousled mess of hair – creates a character that is fully lived-in and believable. Like the very best art, or a pesky insect, it's the kind of performance that burrows deep into your soul.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"New York Theatre Guide - 'Bug' Broadway review — Carrie Coon and Namir Smallwood burrow into an intense drama\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"Amid crafty scenic metamorphoses, blood, violence, and pyrotechnics, the show’s most special effects are performances by Coon and Smallwood. They’ve etched their forsaken characters with impressive ache and intensity that sets off sparks as bright as any bug zapper.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"Chicago Tribune - Review: Once a storefront theater curiosity, ‘Bug’ opens big on Broadway\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"The scariest change, though, is that in an America where guardrails have fallen, tech-sector parasites run amok in our hands and heads, and trust in government is close to nonexistent, what seemed totally implausible in 1996 now feels like reasonable societal comment. At one point, there is worry about whether one of the characters is some kind of robot. Thirty years ago, I vividly recall laughing that off as a device of plotting and one of Letts’ signature, genre-driven games with many more yet to come. This time around? Not at all. Felt perfectly plausible.\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"The New Yorker - In Tracy Letts’s “Bug,” Crazy Is Contagious\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"In Coon's openhearted, subtly joyful portrayal, Agnes is not a broken person who is tricked into faith; she is someone who makes a series of choices to get something she needs, a glue to fix a broken world. In her final monologue, this all becomes clear: it's liberating to see a pattern in your pain, instead of a nightmare that makes no sense. Who among us wouldn't bite at the chance?\"     },           {       \"@type\":\"BlogPosting\",       \"headline\":\"4Columns - Bug\",       \"datePublished\":\"2026-01-16T09:14:26-05:00\",         \"articleBody\": \"A hardworking and very effective Coon is left to maintain dramatic tension. In her TV triumphs as plucky social climbers (The Gilded Age and The White Lotus), Coon’s fresh beauty and vivacious yet sensible vigor has elevated so-so scripts. She makes a smart and relatable protagonist either in nineteenth-century bustle or Thai resort muumuu. Adopting a Southern-Midwestern twang and artfully revealing the full depth of Agnes’s trauma and hunger for meaning, Coon relishes the scuzz and grace of Agnes, even if her dance partner’s limp.\"     }             ] }",
  "originalScore": null,
  "assignedScore": 82,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Carrie-Coon-Namir-Smallwood-and-More-Star-in-BUG-on-Broadway-20260108",
  "dtliThumb": "Up",
  "bwwExcerpt": "In Coon's openhearted, subtly joyful portrayal, Agnes is not a broken person who is tricked into faith; she is someone who makes a series of choices to get something she needs, a glue to fix a broken world. In her final monologue, this all becomes clear: it's liberating to see a pattern in your pain...",
  "llmScore": {
    "score": 82,
    "confidence": "medium",
    "range": {
      "low": 73.5,
      "high": 90.5
    },
    "bucket": "Positive",
    "thumb": "Up",
    "components": {
      "book": 82,
      "music": null,
      "performances": null,
      "direction": null
    },
    "keyPhrases": [
      {
        "quote": "feels more pungent, more punishing, and—for all its perversity—more crushing than similar stories",
        "sentiment": "positive",
        "strength": 4
      },
      {
        "quote": "precisely because it's about how people 'catch feelings,' not just ideas",
        "sentiment": "positive",
        "strength": 4
      },
      {
        "quote": "Even in an era in which paranoia has become the default setting",
        "sentiment": "neutral",
        "strength": 3
      }
    ],
    "reasoning": "Claude: The critic praises the play's unique emotional depth and distinguishes it favorably from similar works, suggesting strong appreciation for the material's psychological complexity and impact. | GPT-4o-mini: The review expresses strong appreciation for the themes and emotional depth of the play, indicating a clear recommendation despite a lack of explicit endorsement.",
    "flags": {
      "hasExplicitRecommendation": false,
      "focusedOnPerformances": false,
      "comparesToPrevious": false,
      "mixedSignals": false
    }
  },
  "llmMetadata": {
    "model": "ensemble:claude-sonnet-4-20250514+gpt-4o-mini",
    "scoredAt": "2026-01-24T04:58:03.655Z",
    "promptVersion": "2.0.0",
    "inputTokens": 0,
    "outputTokens": 0
  },
  "ensembleData": {
    "claudeScore": 78,
    "openaiScore": 85,
    "scoreDelta": 7,
    "thumbsMatch": null,
    "expectedThumb": null,
    "needsReview": false,
    "needsReviewReasons": []
  },
  "textStatus": "partial",
  "textIssue": "too_short",
  "textWordCount": 1933,
  "archivePath": "data/archives/reviews/bug-2026/new-yorker--emily-nussbaum_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:32:25.601Z",
  "textIssues": [
    "Show title not found in text"
  ],
  "textQuality": "full",
  "sourceMethod": "dtli"
}
