{
  "showId": "bug-2025",
  "outletId": "ny-stage-review",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2026/01/08/bug-tracy-letts-shocker-lands-on-broadway/",
  "publishDate": "January 8, 2026",
  "fullText": "When Bug was first seen Off-Broadway in 2004, it seemed prescient in its portrayal of mental illness and conspiracy theories. Now — after the world has gone collectively crazy with wacky notions about COVID, pedophile rings, vaccines, and 5G, among countless other things — Tracy Letts' play practically feels quaint. Receiving its Broadway premiere in a Manhattan Theatre Club production in association with Steppenwolf Theatre Company, it nonetheless remains a grippingly unnerving thriller that feels like a waking nightmare.\n\nNot that it's necessarily improved in this rendition, directed by David Cromer and starring Carrie Coon and Namir Smallwood as the lovers whose blossoming romance becomes stymied by the invasion of biting insects, equipped with transmitting devices, that have seemingly infected their cheap hotel room.\n\nThe simple storyline revolves around Agnes (Coon), a hard-boiled, cocaine-snorting waitress hiding out from her abusive ex-husband Jerry (Steve Key), who's just been released from jail. When Agnes' loyal friend R.C. (Jennifer Engstrom, making a strong impression in her brief stage time) shows up to visit accompanied by Peter (Namir Smallwood), a soft-spoken military veteran who's currently homeless, the meeting proves fateful for both of them.\n\nAfter a first act that's relatively uneventful, with the exception of the arrival of the violence-prone Jerry who's discovered where Agnes is living, the play veers into horror film territory in the second. It's eventually revealed that Peter has gone AWOL from a military mental hospital, but a visit from his doctor (Randall Arney) doesn't exactly go well.\n\nYou won't be surprised to learn that Coon is the standout of this production. The actress delivers a compellingly raw performance marked by emotional and physical boldness.\n\nBut she's not quite matched in impact by Smallwood, inheriting the role so memorably originated by Michael Shannon. The actor plays Peter in a more low-key fashion than his predecessor. It's a valid approach that makes Peter's descent into madness all the more shocking, but it removes the play of much of its intensity.\n\nCromer, so masterful at directing low-key, character-based dramas, doesn't deliver the goods here. His staging proves atypically lackluster, lacking the pacing and shock effects necessary to fully realize the play's Grand Guignol elements despite the copious amounts of gore.\n\nThe disturbing play still manages to burrow its way into your brain and is likely to haunt your dreams for nights afterwards. But it's hard to escape the feeling that on Broadway, Bug has lost some of its bite.",
  "isFullReview": true,
  "bwwExcerpt": "When Bug was first seen Off-Broadway in 2004, it seemed prescient in its portrayal of mental illness and conspiracy theories. Now — after the world has gone collectively crazy with wacky notions about COVID, pedophile rings, vaccines, and 5G, among countless other things — Tracy Letts’ play practically feels quaint. Receiving its Broadway premiere in a Manhattan Theatre Club production in association with Steppenwolf Theatre Company, it nonetheless remains a grippingly unnerving thriller that feels like a waking nightmare.",
  "originalScore": "4/5",
  "assignedScore": 80,
  "source": "playwright-scraped",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Carrie-Coon-Namir-Smallwood-and-More-Star-in-BUG-on-Broadway-20260108",
  "scrapedAt": "2026-01-24T04:20:00.000Z"
}
