{
  "showId": "bug-2026",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Joey Sims",
  "url": "https://www.theatrely.com/post/conspiracies-abound-in-bug-review",
  "publishDate": "January 8, 2026",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "This Broadway revival of Tracy Letts' 1996 psychological thriller Bug explores how conspiracy theories take root in vulnerable minds. Set in an Oklahoma motel room, the play follows Agnes and Peter, two traumatized outcasts whose budding connection gradually transforms into shared paranoid delusion.\n\nThe production opens with Agnes fleeing her abusive ex-husband, where she meets Peter, a former soldier convinced of government experimentation. As their bond deepens, Agnes becomes drawn into Peter's obsession with bugs he believes infest everything around them—and eventually, inside their own bodies.\n\nCarrie Coon brings formidable intelligence and desperation to her role as Agnes, though her strength sometimes undermines the gradual descent into delusion. Namir Smallwood achieves a remarkable balance of vigor and vulnerability as Peter, infusing the character with unspoken complexity beyond the script. Randall Arney's mysterious Dr. Sweet arrives with almost otherworldly strangeness.\n\nDavid Cromer emphasizes psychological depth and empathy over sensationalism during Act One, creating a slow-burn romantic tension. The tonal shift to psychodrama in Act Two feels somewhat abrupt, though once that descent begins, it's a perverse thrill to the end. Aided by a masterful set change (the decaying scenery is by Takeshi Kata, spookily lit by Heather Gilbert), Cromer expertly turns the dial up to 11 as Agnes becomes fully consumed by Peter's conspiratorial mind. The late arrival of the mysterious Dr. Sweet elevates the proceedings to unnervingly heightened, wholly gripping heights. Even as his characters destroy their world and themselves, Letts never loses sight of the strange comfort in a good conspiracy theory.\n\nBug is at the Samuel J. Friedman Theatre through February 8, 2026.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-23T23:50:00.000Z",
  "bwwExcerpt": "Even as his characters destroy their world and themselves, Letts never loses sight of the strange comfort in a good conspiracy theory. (Many of the real-life examples Peter manically cites are, in fact, entirely true.) One unifying theory making sense of all the pain is, for these damaged souls, so ..."
}
