{
  "showId": "bug-2026",
  "outletId": "timeout-ny",
  "outlet": "Time Out New York",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/bug-broadway-review-carrie-coon-namir-smallwood-tracy-letts-paranoia",
  "publishDate": "January 8, 2026",
  "fullText": "\"A paranoid might be defined as someone who has some idea as to what is actually going on,\" said William S. Burroughs in a 1970 interview. Viewed from the outside, it might seem that Peter (Pass Over's Namir Smallwood), an itinerant Army veteran, is out of his mind when he talks about the infinitesimal aphids hiding in his body and transmitting surveillance data to the government. But he knows what he knows. He can see the tiny insects. He can feel the hum of the machines at night. He has been through the sinister experiments; he has learned of the Oosterbeek consortium. And while most people don't believe him, at least one does: Agnes (the riveting Carrie Coon), a fortysomething divorcée who lives in a seedy motel on the edge of Oklahoma City. Others may dismiss Peter's knowledge as a disease, but not Agnes. Agnes gets it.\n\nTracy Letts's engrossing and unsettling 1996 psycho-thriller Bug—which ran Off Broadway in 2004 and has now returned at Manhattan Theatre Club's Samuel J. Friedman Theatre—puts social contagion under the microscope with a mounting sense of dread. The lonely and isolated Agnes is especially vulnerable to Peter's totalizing suspicion. She has good reason to be afraid: Her violent ex-husband, Jerry (Steve Key), has just been sprung from prison, and has made it clear that intends to get her back. She spends her free time emptying bottles of wine and snorting or freebasing coke with the leathery R.C. (Jennifer Engstrom), her coworker at a honkytonk bar. And a traumatic loss has left her with a deep hole of grief and guilt just waiting to be filled with something, anything, even creepy-crawlies. \"I guess I'd rather talk about bugs with you than talk about nothin' with nobody,\" she tells Peter. \"Not like I really got a lot to say, 'less I talk about misery, but who wants to hear that all the time?\"\n\nAlthough Agnes and Peter sleep together early on, their relationship isn't primarily sexual. But there's an element of seduction to their whole dynamic, as Peter, at first reluctantly, gets under Agnes's skin. Letts is an actor as well as a playwright—he and Coon, who are married, met while co-starring in a revival of Who's Afraid of Virginia Woolf?—and he knows how to craft scenes that keep performers intensely engaged with each other onstage. Smallwood and Coon, reprising their roles from the 2021 production of Bug at Chicago's Steppenwolf Theatre, strike a compelling balance. He arrives full of secrets that he gradually reveals; she arrives empty and eager to swallow them up, spiraling ever farther away from life beyond her room. (In several ways, this role is like the flip side of the steadfast mother Coon played so indelibly in Mary Jane.)\n\nDirector David Cromer, never one for histrionics, focuses on the characters as people and lets the play's tension boil naturally. As Agnes and Peter bug out together—one of several meanings telescoped into Bug's title (including: insect, spy device, memetic virus)—the staging reflects their enmeshment: Takeshi Kata's set, which juts into the audience like an elbow, undergoes several transformations, and Heather Gilbert's lighting and Josh Schmidt's sound suggest an increasingly blurred reality. The sense of shared psychosis culminates in a visit from a mysterious doctor (Randall Arney) who may not be what he seems, or, for all we know by then, may not exist at all.\n\nThere are horror elements in Letts's play, including a scene with pliers that triggers audible squirms, but the scariest thing about it is how easily Agnes, like a lost lamb, is led. \"You're never really safe,\" Peter tells her. \"Not anymore, not on this planet. We'll never really be safe again. We can't be, not with all the technology, and the chemicals, and the information.\" And why shouldn't she trust him? Just because insects can't be seen, that doesn't mean they aren't there (even as you read this, your eyelashes may be swarming with Demodex mites), and even stripped naked—which they are for a substantial portion of the play—they would not be free from danger, since the bugs are inside them. And as Peter points out, the government has conducted clandestine medical experiments in the past. Why not believe the worst?\n\nThe slipperiness of ostensible skepticism into utter credulity is what makes Bug continue to resonate so powerfully today. This is not just a particularly lurid folie à deux involving a peculiar variety of Ekbom Syndrome. It speaks to a larger crisis that has only expanded since Letts wrote the play: a twisted culture of conspiracy, exemplified by phenomena like QAnon and Pizzagate, that attracts broken people into collective psychosis. That's the genuine horror built into this play, and perhaps also its most soothing aspect. In Bug, at least, the contagion is contained.",
  "originalScore": "4/5",
  "assignedScore": 80,
  "dtliThumb": "Up",
  "source": "playwright-scraped",
  "scrapedAt": "2026-01-23T05:45:00.000Z"
}
