{
  "showId": "bug-2026",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/article/bug-tracy-letts-carrie-coon-review.html",
  "publishDate": "January 8, 2026",
  "fullText": "Letts’s play is a sordid, spiky creature, a two-hour descent into a pit of paranoia within the dingy walls of an Oklahoma motel room. It’s also an acting showcase, especially for its female lead, and Coon tears into the tragic arc of troubled club waitress Agnes White with her characteristic naked courage. But to really do its work, Bug needs to get under our skin, and here it never quite does. We’ve got to feel not only the ick but the itch — the ­gnawing sensation that, for all their ­delusions, the protagonists might not actually be nuts. Even if they are, their nightmarish conviction should stick with us. We should walk away struggling to shake the feeling something’s crawling up our backs.",
  "isFullReview": false,
  "dtliExcerpt": "The performance is forceful enough for this Bug to operate chiefly as a character study. Despite the cesspits of ­conspiracy-think that pollute contemporary politics, the specific paranoia of Letts’s ­characters — bugs under the skin, brainwashing, ­nefarious doctors in government labs — feels less blazingly relevant than comparatively quaint. At the same time, because Cromer and his designers opt to keep the audience at a remove from Peter and Agnes’s folie à deux, the monsters they behold don’t ever truly spook us. They are shadows­ only, never claws and flesh. In such a production, the fantasy at the story’s center can’t become contagious. We bear witness to two sad, mad people. We don’t question our own sanity.",
  "showScoreExcerpt": "\"To really do its work, Bug needs to get under our skin, and here it never quite does. Weâve got to feel not only the ick but the itch.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Carrie-Coon-Namir-Smallwood-and-More-Star-in-BUG-on-Broadway-20260108",
  "dtliThumb": "Meh",
  "bwwExcerpt": "The performance is forceful enough for this Bug to operate chiefly as a character study. Despite the cesspits of ­conspiracy-think that pollute contemporary politics, the specific paranoia of Letts’s ­characters — bugs under the skin, brainwashing, ­nefarious doctors in government labs — feels less ..."
}
