{
  "showId": "all-in-comedy-about-love-2024",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Caroline Cao",
  "url": "https://www.newyorktheatreguide.com/reviews/all-in-comedy-about-love-by-simon-rich-broadway-review",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/all-in-comedy-about-love-by-simon-rich-broadway-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "fullText": "Read our review of All In on Broadway, a new humor play currently starring John Mulaney, Fred Armisen, Richard Kind, and Renée Elise Goldsberry. Have you ever seen a well-dressed concept that still needs accessorizing? That is All In: Comedy About Love by Simon Rich, a short story compilation by the titular New Yorker humorist and Saturday Night Live writer at Broadway's Hudson Theatre. The Alex Timbers-directed All In beams with megawatt stars, who will switch out with different cast members across its run. I saw the current and first batch: John Mulaney, Fred Armisen, Richard Kind, and Renée Elise Goldsberry, each playing various roles. What if I report that they’re seated in armchairs for 95% of the show while glancing at binders? To be clear, theatricality can be spun out of minimal blocking as the actors gesture and emote from their seats, but All In remains limited as a conceptual presentation rather than a fully realized theatrical event. It’s anything but a stagnant affair, at least. As the stars pantoimine and read, their voices inhabit colorful characters. Some beats may land as treacly, but the stories contain plenty of zippy lines and outlandish, cartoon-inspired shenanigans. A short story that grabs hearty laughs is one where a talent agent (Kind) persuades the Grim Reaper (Armisen) to try acting. Projected images illustrated by Emily Flake add additional humorous imagination to the show. When the show concluded with exit music, the audience was slipping out their seats — and several were already out the door — when Armisen reappeared as a guitar-playing character, rounding out an earlier joke. The sight gag is such a silly cap-off to this night that I wished for more. Rich’s material has yet to go all the way. Simon Rich’s playwright’s note is read by an actor (John Mulaney at my performance) to note that the play contains absurdist vignettes related to love. Mulaney opens the show with a parable about a bar genie with apparent hearing issues that results in incorrectly executed wishes. Other stories are about a pirate captain (Mulaney) and first mate (Armisen) becoming an adoptive parent to an orphan (Goldsberry), and a Rugrats-inspired noir where a toddler (Mulaney) plays private detective investigating Goldsberry's stolen stuffed unicorn. Between the stories are folksy transition songs by Stephin Merritt, as performed by the Bengsons, and they are are some of the shows’ pleasures. Additionally, Lucy Mackinnon's video design illuminates images by New Yorker cartoonist Flake — an unsurprising complement to the show, as Rich has credits in writing for animation. The show deploys some smoke effects and comedic lighting flashes. Show-Score currently has 11 member reviews that average out into an audience approval rating of 71%. Read more audience reviews of All In: Comedy About Love by Simon Rich on Show-Score. It takes a starry cast to breathe life into the zany stories of All In, currently hampered as an armchair-seated concept rather than a fleshed-out show. Learn more and get All In: Comedy About Love by Simon Rich tickets on New York Theatre Guide. All In is at the Hudson Theatre through February 16. Photo credit: All In: Comedy About Love by Simon Rich on Broadway. (Photos by Emilio Madrid) Book tickets for All In: Comedy About Love by Simon Rich on Broadway on New York Theatre Guide. All In: Comedy About Love by Simon Rich on Broadway is playing at Hudson Theatre. The theatre is located at 141 West 44th Street, New York, 10036. The running time of All In: Comedy About Love by Simon Rich on Broadway is 1hr 30min. No intermission. Get All In: Comedy About Love tickets and see a new romcom with a rotating cast of stars. All In plays this winter and features Tony and Emmy winners galore. Stephin Merritt of The Magnetic Fields wrote indie rock songs performed by real-life husband and wife duo, The Bengsons, for this show. Simon Rich, son of legendary writer and HBO producer Frank Rich, wrote this script, which compiles various love stories together. Tony winner Alex Timbers directs this show and has experience with comedy specials on stage, as with Oh, Hello. With a starry cast of today's biggest entertainers written by an SNL alum, the show is sure to please and tickle your funny bone. Children must be over age four to enter Broadway theatres. No age recommendation is listed yet for the show. Originally published on Dec 22, 202420:00",
  "isFullReview": true,
  "textWordCount": 739,
  "archivePath": "data/archives/reviews/all-in-comedy-about-love-2024/nytg--caroline-cao_2026-02-04.html",
  "textFetchedAt": "2026-02-04T14:10:15.187Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 739,
  "tierReason": "Full review text",
  "bwwExcerpt": "It’s anything but a stagnant affair, at least. As the stars pantoimine and read, their voices inhabit colorful characters. Some beats may land as treacly, but the stories contain plenty of zippy lines and outlandish, cartoon-inspired shenanigans. A short story that grabs hearty laughs is one where a talent agent (Kind) persuades the Grim Reaper (Armisen) to try acting. Projected images illustrated by Emily Flake add additional humorous imagination to the sho",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ALL-IN-COMEDY-ABOUT-LOVE-on-Broadway-20241222"
}
