{
  "showId": "the-lieutenant-of-inishmore-2006",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2006/05/04/theater/reviews/04inis.html",
  "publishDate": "May 4, 2006",
  "fullText": "\"The Lieutenant of Inishmore,\" which opened at the Atlantic Theater Company in February, has moved to Broadway. It opened last night at the Lyceum Theater, 149 West 45th Street; (212) 239-6200. Following are excerpts from Ben Brantley's review, which appeared in The New York Times on Feb. 28; the full text is here.\n\nBlood winds up on pretty much every surface in \"The Lieutenant of Inishmore,\" Martin McDonagh's gleeful, gruesome play about political terrorism in rural Ireland, which won the Olivier Award (the British equivalent of the Tony) for best comedy. The red stuff is splashed, spattered and smeared over walls, floors, furniture, clothes, skin and cat's fur. The fur is the main thing. For it is a mutilated cat that sets off the Euripidean cycle of murderous revenge that occupies two fast hours of hit-and-run traffic on the stage.\n\nTheatergoers familiar with Mr. McDonagh's work (which includes the Tony-nominated \"Pillowman\" and \"Beauty Queen of Leenane\") are by now used to the acts of torture, humiliation and interfamilial skull bashing that figure in his work. But with \"Lieutenant,\" directed with a steady gaze and acute theatrical instinct by Wilson Milam, Mr. McDonagh raises the carnage factor to a level that rivals Quentin Tarantino's.\n\nUnlike Mr. Tarantino, Mr. McDonagh isn't trying to elicit the poetry in surreally stylized violence or the aesthetic content in shades of red. There's nothing pretty about the gruesome mess in which these gun- and razor-toting characters, members of splintered splinter groups of the Irish Republican Army, find themselves. And they seem to regard as merely mundane the abominations they commit in the name of causes they can't always remember.\n\nBut they might as well face it, they're addicted to blood. So, this play suggests with devilish obliqueness, are we.\n\nWe’re interested in your feedback on this page. Tell us what you think.\n\nAccess to NYTimes.com and all NYTimes apps\n\nUnlimited article access, anytime, anywhere\n\nTimes Insider Access, including behind-the-scenes stories, exclusive events, podcasts, and e-books\n\n1 complimentary digital subscription to give anyone you'd like\n\nCustomized delivery options such as Sunday only, Fri.-Sun., weekday delivery, or daily delivery\n\nThe weekly Sunday magazine and monthly T Magazine\n\n2 complimentary digital subscriptions to give anyone you'd like",
  "isFullReview": true,
  "dtliExcerpt": "This blazingly funny and equally shocking work by Martin McDonagh has been given a production that captures both its savage humor and its underlying melancholy about the futility of violence.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This blazingly funny and equally shocking work by Martin McDonagh has been given a production that captures both its savage humor and its underlying melancholy about the futility of violence.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (30 words)",
  "textQuality": "truncated",
  "sources": [
    "web-search"
  ],
  "previousUrl": "https://www.nytimes.com/2006/05/04/theater/reviews/04lieu.html",
  "urlDiscoveredAt": "2026-02-07T10:10:25.398Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 368,
  "archivePath": "data/archives/reviews/the-lieutenant-of-inishmore-2006/nytimes--ben-brantley_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:10:25.401Z",
  "designation": "Critics_Pick",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20170206225147",
  "archiveOrgUrl": "http://web.archive.org/web/20170206225147/http://www.nytimes.com:80/2006/05/04/theater/reviews/04inis.html?",
  "wordCount": 368,
  "tierReason": "Missing proper ending or other signals"
}