{
  "showId": "rabbit-hole-2006",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2006/legit/reviews/rabbit-hole-1200513546/",
  "publishDate": "February 5, 2006",
  "fullText": "David Lindsay-Abaire's \"Rabbit Hole\" is a play tailor-made for people who, as a rule, don't care for plays -- who find the theater too rarefied, artificial or remote from their everyday existence. Even in the disappointingly undernourished West Coast premiere production at the Geffen Playhouse, play's themes are durable and its appeal strong.\n\nDavid Lindsay-Abaire‘s “Rabbit Hole” is a play tailor-made for people who, as a rule, don’t care for plays — who find the theater too rarefied, artificial or remote from their everyday existence. Script’s precise and tactful exploration of a family’s grief when 4-year-old son Danny is killed in a traffic accident resonates with verbal and emotional truth, generating enormous empathy. Even in the disappointingly undernourished West Coast premiere production at the Geffen Playhouse, play’s themes are durable and its appeal strong.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\n“Rabbit Hole” was an unexpected Manhattan Theater Club triumph earlier this year for Lindsay-Abaire, known in Gotham for a string of hysterical, hyperrealistic farces in which desperate characters are seen as if in carnival funny mirrors (or “Fuddy Meers,” title of scribe’s best known work). That rep, plus Lewis Carroll-ish title, promised something knockabout and otherworldly, as if toddler’s ghost might pop in at any moment in a bunny suit.\n\nBut Lindsay-Abaire surprised everyone with his slice-of-life naturalism and characters drawn straight and true, especially the boy’s mother, Becca, whose heartbreaking struggle to regain equilibrium is the piece’s central action. Play dramatizes the vain efforts of other family members to help Becca return to normalcy.\n\nAs in any family, most of the talk centers on mundane issues: the so-called Kennedy curse, birthday gifts, baking, a bar fight. But whenever the topic seems furthest away from poor Danny, of course we need to feel that’s just a ploy and that in fact everyone is thinking of Danny and nothing else.\n\nIn this respect, new production is woefully weak. While Broadway helmer Dan Sullivan orchestrated tension like chamber music, playing Danny’s death as a wound that could — and did — reopen at any moment, Carolyn Cantor directs her actors on the most superficial level: Comfortable and easy with each other when the lines are casual, cast suddenly ratchets up the anger when the lines say to do so. Scenes that should crackle with conflict just drift by. For long stretches we lose sight of Danny altogether, which couldn’t be further from playwright’s intention.\n\nMost serious casualty of directorial approach is the Becca of Amy Ryan, a gifted actress with a wide smile far too much in evidence on the Geffen stage. She is so naturally relaxed, and her manner so forgiving, that it becomes easy to forget her supposedly ever-present grief. Sister Izzy (Missy Yager) wonders, “Why is Becca so mad at me?,” but we haven’t seen that anger, just some gentle scolding.\n\nBy contrast, Cynthia Nixon’s award-winning Becca was a woman turned to stone. She loomed over the other characters like one of those heads on Easter Island, and her refusal to even consider any offer of comfort was her particular hubris that turned her melodrama into true tragedy. Any great role is open to multiple interpretations, of course, but Ryan’s never suggests why someone playing this part might be worth consideration for a Tony.\n\nRest of cast falls victim to directorial laxness, with only Tate Donovan, as husband Howie, suggesting the depth and texture that might have pervaded. He alone seems to be preoccupied and troubled at all times, though like the others, he is occasionally directed to shout in a way that seems underprepared for.\n\nCantor’s blocking, too, does the piece a disservice. Again and again she has characters confronting each other while standing apart and in profile, as if at a gunfight, and the navigation around Alexander Dodge’s set is awkward and often unmotivated. When the youthful driver who hit Danny arrives to make amends, Becca is placed on a downstage sofa with her back to us; we have to take another character’s word for her reaction to the visitor.\n\nSetting initially impresses by presenting an impeccable suburban living room from which all traces of a child’s influence have been painstakingly eliminated. But once play begins, a huge downstage-left dinner table and chairs act as an implacable barrier that cramps movement and swallows up all the action in the upstage kitchen.\n\nInstead of using the Broadway revolve to bring on Danny’s bedroom, designer Dodge places it on the upper level, masked until the first scene there. Once the masking is removed, it might have been effective to leave the room revealed. But the set designer, like the rest of those behind this production, sees no need to give us constant reminders of the victim’s existence.",
  "isFullReview": true,
  "dtliExcerpt": "David Lindsay-Abaire's drama about a couple coping with the death of their young son is a work of uncommon maturity and sensitivity that manages to find glimmers of hope in the darkest of circumstances.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "David Lindsay-Abaire's drama about a couple coping with the death of their young son is a work of uncommon maturity and sensitivity that manages to find glimmers of hope in the darkest of circumstances.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 808,
  "archivePath": "data/archives/reviews/rabbit-hole-2006/variety--charles-isherwood_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:21:14.600Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 808,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-04T11:00:33.533Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about the West Coast premiere production at the Geffen Playhouse, not the current Broadway run.; kimi: This review covers the West Coast premiere production at the Geffen Playhouse, not a Broadway production. While it references the earlier Broadway run starring Cynthia Nixon, the critique focuses on the regional production directed by Carolyn Cantor with Amy Ryan.",
  "promptVersion": "5.2.0"
}