{
  "showId": "the-piano-lesson-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2022/10/13/the-piano-lesson-a-star-studded-revival-of-august-wilsons-pulitzer-prize-winning-drama/",
  "publishDate": "2022-10-13T20:25:32",
  "fullText": "The past literally comes back to haunt the characters in Wilson’s Pulitzer-Prize winning drama The Piano Lesson, concerning the lingering emotional scars of slavery on a Pittsburgh family in the 1930s. While the ghost of a white slaveowner figures prominently in the storyline, it’s the majestic piano sitting in the family’s living room that dominates the proceedings. Featuring intricate wooden carvings of the slaves for whom it was once traded, the musical instrument evokes a history of bloody cruelty. The play is now receiving a powerful if imperfect Broadway revival featuring a stellar cast including Samuel L. Jackson, Danielle Brooks, and John David Washington as Boy Willie, the role that Jackson originated in the original Yale Rep production.\n\nThe action, set in 1936, begins with the arrival of sharecropper Boy Willie (Washington, in the role originated by Jackson in the 1987 Yale Rep production) to the Pittsburgh home of Willie’s uncle, Doaker (Jackson). Willie co-owns the piano with his widowed sister Berniece (Danielle Brooks, The Color Purple), who lives there with her 11-year-old daughter (Jurnee Swan). He demands to take the piano and sell it, hoping to use the proceeds to buy the land on which their grandfather previously worked as a slave. Berniece, however, has no interest in dispensing with a vital family heirloom despite its ugly associations.\n\n“If Berniece doesn’t want to sell the piano, I’m gonna cut it in half and sell my half!” Boy Willie tells his uncle, who respects his niece’s wishes.\n\nBoy Willie has returned to his family home from the Deep South, accompanied by his friend Lymon (Ray Fisher), a wide-eyed country boy eager to meet a beautiful city girl. They’ve arrived with a truckload of watermelons to sell, after which Willie intends to get rid of the piano, which stubbornly refuses to be lifted by the two men.\n\nWhether or not to preserve the legacy of the past, however horrific, is the compelling theme of this elemental drama which showcases Wilson’s prodigious gifts for poetical dialogue and richly drawn characterizations. It’s filled with emotionally resonant moments, the quieter of which are the best rendered in this production. Perhaps the highlight is the scene in which the eager Lymon, newly clad in a resplendent if far too small silk suit and fancy shoes that he’s purchased from Doaker’s comically blustery brother Wining Boy (Michael Potts, terrific), nearly manages to break down Berniece’s emotional defenses by gifting her with a bottle of fancy perfume. Brooks and Fisher play the delicate scene perfectly, thoroughly winning over the audience which practically swoons.\n\nUnfortunately, the production falters in its more explosive moments, with Washington, apparently making his stage acting debut, maintaining such a high energy and decibel level throughout that his unmodulated performance becomes monotonous. Boy Willie is supposed to be the volcanic center of the drama, but here he comes across as more irritating than a force of nature.\n\nAs if to compensate, his co-stars underplay to perfection. Jackson, not always known for subtlety, keeps himself thoroughly reined-in, and only seems more authoritative as a result. Fisher practically steals the show with his amusingly naïve Lymon, garnering big laughs in the scene when he first tries on that ill-fitting suit and too-small shoes. Brooks is similarly restrained, conveying her character’s decency and self-determination with an utter lack of histrionics. Trai Byers and April Matthis make strong impressions as Berniece’s preacher suitor and a woman Boy Willie brings home for an assignation.\n\nRichardson, an extremely talented actress here making her directorial debut, reveals her inexperience in the revival’s pacing issues and an overreliance on spooky sound and lighting effects and projections that threaten to become silly, especially in the show’s climactic moments. More effective is Beowulf Boritt’s two-level set, which literally depicts the schisms of the household, and the elaborately carved piano, practically a character itself.\n\nThe production still manages to be highly effective, thanks to the brilliance of Wilson’s writing and the many first-rate performances. But the revival’s unevenness makes it pale in comparison to the 1990 original Broadway production and the superb revival staged by Off-Broadway’s Signature Theatre Company a decade ago.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2022/10/13/the-piano-lesson-a-star-studded-revival-of-august-wilsons-pulitzer-prize-winning-drama/",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
