{
  "showId": "the-piano-lesson-2022",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/the-piano-lesson-broadway-review-samuel-l-jackson-danielle-brooks",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/the-piano-lesson-broadway-review-samuel-l-jackson-danielle-brooks",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The Piano Lesson at the Barrymore Theatre has been tuned to perfection. Under the deft guidance of LaTanya Richardson Jackson, who makes her Broadway directing debut, August Wilson’s stirring story filled with richly drawn characters, family drama, humor, and beyond-this-world mystery (cue the ghost!) comes vividly to life. Bluesy poetry and musicality are hallmarks of Wilson’s scripts. It’s easy to see – and hear – that here. Over the course of 2 3/4 hours, bits of boogie-woogie, spirituals, and chants toll. Some lines are said so often they ring like refrains. History also looms large in Wilson's works, and that’s true of this 1990 Pulitzer Prize-winning chapter in his decade-by-decade deep dive into Black lives in the 20th century. The setting is 1936 in the Hill District of Pittsburgh, where self-sufficient single mom Berniece Charles (Danielle Brooks) and her young daughter Maretha (Jurnee Swan) live with her uncle Doaker (Samuel L. Jackson). It’s a modest home – well-kept, nothing fancy. Except for one furnishing: an extravagantly carved upright piano that stands in full view in the living room. It has 88 keys and holds painful history. The ornate instrument becomes the source of conflict when Berniece’s impetuous brother Boy Willie (John David Washington) arrives from Mississippi with his pal Lymon (Ray Fisher) and a truckload of watermelons. Boy Willie plans to sell the fruit and the piano in order to buy a stretch of land of his own. But anyone who knows Berniece is aware that she won’t part with the piano – no way, no how. “You can’t sell your soul for money,” she tells her brother. He already knows where she stands, like everybody else, including Wining Boy (Michael Potts), Doaker’s brother; and Avery, (Trai Byers), the preacher Berniece has dated since her husband died. The piano is carved with images of enslaved ancestors and is a reminder of what the siblings’ father endured to get it. Besides the piano, the past bleeds into the present in another way. The ghost of Sutter, a white man whose ancestors enslaved the Charleses, haunts the house. Berniece asks Avery to bless the residence to get rid of the spirit, but finally comes to realize that tapping into with her family’s past, not shunning it, is what it takes for an exorcism. The cast is uniformly wonderful. The three leads blend and harmonize, while adding individual grace notes. Brooks speaks volumes with just a glance, Washington adds spirited bluster, and Jackson’s distinct voice was made for Wilson’s words. I lost count of how many times Doaker deadpans, “Berniece ain’t gonna sell that piano” – but he made it fresh each time. (Jackson understudied Boy Willie in the 1990 Broadway run.) In their supporting roles, Fisher makes dim Lymon lovable, while Potts radiates gleeful charisma. Watching Wining Boy sell Lymon an absurdly ill-fitting suit is like taking a whiff of theatrical laughing gas. As Grace, a wise-to-the-world woman Boy Willie and Lymon try to romance, April Matthis gives a lesson in how to make a big impact with a small role. The production team also delivers. Beowulf Boritt’s set leaves room for an eerie showdown enhanced by Jeff Sugg’s projections, Toni-Leslie James’s costumes evoke mid-1930s style, and Japhy Weideman's lighting lends warmth and chill as needed. Wilson’s works sometimes take on mystical dimensions. The Piano Lesson eventually leads to a supernatural confrontation that creeps close to being fright-night over-the-top. Considering what’s at stake, though, the final moments strike just the right chord. The Piano Lesson is at the Barrymore Theatre until January 22. Get The Piano Lesson tickets on New York Theatre Guide. Photo credit: Samuel L. Jackson and Ray Fisher in The Piano Lesson. (Photo by Julieta Cervantes) Originally published on Oct 13, 202220:30",
  "isFullReview": true,
  "textWordCount": 623,
  "archivePath": "data/archives/reviews/the-piano-lesson-2022/nytg--joe-dziemianowicz_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:43:55.288Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 623,
  "tierReason": "Full review text"
}