{
  "showId": "pretty-woman-the-musical-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/08/16/pretty-woman-lady-liza-of-the-streets-goes-hollywood/",
  "publishDate": "2018-08-16T21:30:42",
  "fullText": "Theatergoers streaming into the new musical Pretty Woman, at the Nederlander, are understandably likely to do so with visions of Julia Roberts in their mind’s eye and the strains of the Roy Orbison pop hit—“Pretty woman, walkin’ down the street”—in their mind’s ear. While there are more than a few delights on display here, neither the visions of movie star magic nor the urge to hear that song are satisfactorily fulfilled. While a sizable portion of the audience is likely to enjoy the musicalized Pretty Woman, I’d wager that few are likely to walk away saying: Gosh, it’s even better than the movie!\n\nAnd in that group I’d place the two librettists, the late Garry Marshall (who directed the 1990 film) and J.F. Lawton (who wrote the screenplay). They would no doubt assert that their musical is pretty nifty; but better than their iconic movie, the whoppingly successful romantic comedy which catapulted Roberts to stardom?\n\nThe story follows the film, and closely; it seems like a good deal of dialogue is carried over verbatim, and that turns out to be wise. The plot is—at its base—smarmy, jerk of a billionaire (Andy Karl) picks up a down-and-way-out Hollywood hooker (Samantha Barks) and takes her to the Beverly Wilshire, where a fairy godmother of sorts (Eric Anderson) transforms her into Eliza Doolittle at the Embassy Ball. Thus we have a combo of Cinderella and Pygmalion—My Fair Lady, in Broadway musical terms—and everyone naturally lives happily ever after.\n\nMarshall and Lawton managed to do this magically well on the screen, and a good deal of the celluloid charm translates to the musical’s first half. Once Eliza—or, rather Vivian—is transformed at the first act finale (the song carries the not-so-subtle title of “You’re Beautiful”), the merriment all but ceases. Whether act two follows the film or not is impossible to know without calling up Pretty Woman on your favorite streaming outlet; but on stage, the latter half lacks the charm and fun of the first. This is not the first musical comedy in creation to self-deflate once the “bad” characters turn “good.”\n\nSaid charm and fun comes, in great part, from the ministrations of director-choreographer Jerry Mitchell. Mitchell has given us numerous hits over the years, including the durable Kinky Boots. His work here, though, brings to mind both Hairspray and Dirty Rotten Scoundrels, musicals in which it seemed like at least half the jokes were heightened by the canny staging. Pretty Woman is overstuffed with splendid sightgags and deliciously wry choreographic touches. What’s more, Mitchell knows how to work the actual scenery—here from Hairspray’s David Rockwell—into the fun.\n\nThe producers have eschewed the old jukebox in favor of original songs by the new-to-theater team of Bryan Adams and Jim Vallance, who have been turning out pop hits for 40 years or so. The results are encouraging, at least until repetition sets in and inspiration is dulled by that second act. What is notable about the score is the professionalism; the songs are crafted for the stage in a manner not apparent in this season’s prior musicals. Time and again, a moderately pleasing song is buoyed as Mitchell brings on the dancers.\n\nThis is not a bad way to proceed, mind you. But the pattern for hit romantic comedy transfers from screen to musical stage was set in 1968 by Promises, Promises, in which a top pop songwriting team (namely Burt Bacharach and Hal David) proved that they had something to add to the Broadway musical. Adams and Vallance aren’t nearly so successful; their score, at least, is solidly workable and by all means a classic compared to this week’s other new musical.\n\nStanding head and shoulders above all is Karl, in the role formerly essayed by—well, within moments the image of Richard Gere is altogether wiped out and unmissed. Karl is the personable fellow who quickly leapt from a chorus role (including a bit as a memorable UPS man) in Legally Blonde to the leading roles in Rocky and Groundhog Day. (Is Karl fated to appear, again and again and again, only in mediocre musical reboots of popular movies?). He gave appealing performances in these musicals, but with Pretty Woman moves past appealing to top-caliber musical comedy star.\n\nThere’s no reason that a first-time-on-Broadway leading lady can’t prove a knockout. Not this time, though. Barks is proficient and skilled, and might prove highly capable. At most moments, though, she is overshadowed by memories of Ms. Roberts. I suppose that even audience members who have never seen the film will wonder why Barks isn’t quite enough of a compelling Cinderella.\n\nIt is also unfortunate to have someone with unvarnished star quality come out near the end of the long opening number, open her mouth, and galvanize the house. Unfortunate, that is, when said performer turns out not to be the leading lady but merely her obligatory best friend. This is the one-named Orfeh, who has had this precise effect on audiences before. Anderson provides a good deal of magic as the hotel manager-with-a-heart-of-gold originally essayed by Hector Elizondo. As a musicalization device, the creators have chosen to lace this “character” throughout the evening in multiple guises, principally as a gutterside street peddler who serves as de facto narrator. Anderson pulls it off, but the “Happy Man” (as he is credited in the Playbill) has neither the flair nor fun of his alter ego.\n\nLet us also mention the contributions of Tommy Bracco as a most expressive elevator man—an idea one imagines was devised solely by director Mitchell. Watching Bracco is like watching a half-size version of Tommy Tune back in the days before he became Tommy Tune. Bracco picks up the show whenever given the chance, and it is unfortunate that the powers that be insist on using him as an anonymous chorus member whenever he’s not in his bellhop garb.\n\nPretty Woman on Broadway also serves to illustrate that age-old adage of wise producing: To wit, you will look mighty smart if you contrive to schedule your Broadway opening directly after something like Gettin’ the Band Back Together.\n\nPretty Woman opened August 16, 2018, at the Nederlander Theatre. Tickets and information: prettywomanthemusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial"
}
