{
  "showId": "red-2010",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "Franck Scheck",
  "url": "https://www.hollywoodreporter.com/movies/movie-reviews/red-theater-review-29459/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "\"Bottom Line: Superb performances enliven this fascinating drama about famed abstract expressionist Mark Rothko.\"",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Broadway-Blog-RED-Review-Roundup-20100402",
  "contentTier": "complete",
  "duplicateOf": "hollywood-reporter--frank-scheck.json",
  "previousUrl": "http://www.hollywoodreporter.com/hr/film-reviews/red-theater-review-1004080230.story",
  "urlDiscoveredAt": "2026-02-06T18:51:26.659Z",
  "urlDiscoveryMethod": "google-serp",
  "fullText": "“What do you see?” painter Mark Rothko (Alfred Molina) asks in the opening line of John Logan’s new drama, “Red.”\n\nIt indeed is the central question, as this fascinating theatrical depiction of this complex figure at work should easily make audiences re-evaluate their notions about the artistic process.\n\nNewly arrived on Broadway for a limited engagement following a recent hit run at London’s Donmar Warehouse, the play should prove similarly successful here and stands to figure prominently this awards season.\n\nThe play is set in 1958 at Rothko’s New York studio, where the master of abstract expressionism is working to complete a series of massive murals that have been commissioned by the Seagrams Company for the Four Seasons restaurant to be located in their new midtown office building. Aiding him in his work is his new assistant, Ken (Eddie Redmayne, who won an Olivier Award for his performance), a aspiring young artist from the Midwest.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Movies\n \n \n \n \n\n \n \n \n \n Rotterdam Film Festival: 'Variations on a Theme' and 'Master' Win Top Awards \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Berlinale Exclusive\n \n \n \n\n \n \n \n \n Mighty 'Mouse': Inside a Scrappy Indie Success Story\n\nThe tempestuous Rothko has no interest in niceties or his employee’s personal life. But he’s more than happy to share his sharp opinions about art and artists, particularly of such contemporaries as Jackson Pollock and Willlem de Kooning, among others.\n\nAs forcefully delivered in Molina’s volcanic performance, this torrent of observations is consistently engrossing. But where the play really shines is in its careful re-creation of the process of creating these massive works, as exemplified by a tour-de-force scene in which the two actors frenziedly prime a large canvas with red paint while opera blares in the background.\n\nAlthough it’s not strictly necessary, audience members would be well-advised to read the informative program notes beforehand, as the playwright is less interested in conveying biographical details about his subject than the essence of his mercurial personality. Some moments, for instance, achieve a greater power if one is aware that Rothko eventually reneged on the commission and returned the money or that he committed suicide 10 years after the events being depicted.\n\nAdopting an impeccable American accent, Molina is absolutely superb as the Russia-born Rothko, anchoring the proceedings with a ferocious intensity that never wavers. In a role that at first seems underwritten, Redmayne shines as well, especially late in the play, when his character dares to confront his employer about the hypocrisy of creating his works for an environment in which people will barely even bother to look at them.\n\nDirector Michael Grandage’s riveting production beautifully serves the material, and set designer Christopher Oram’s meticulous re-creation of Rothko’s famously dimly lit studio, including the pulley system he used to move his massive canvases, feels utterly authentic. Particularly impressive is Neil Austin’s lighting design, which literally forces one to look at the art in new and exciting ways.\n\nVenue: Golden Theatre, New York (Through June 27)Presented by: Arielle Tepper Madover, Stephanie P. McClelland, Matthew Byam Shaw, Neal Street, Fox Theatricals, Ruth Hendel/Barbara Whitman, Philip Hagemann/Murray Rosenthal and The Donmar WarehouseProduction: Donmar WarehouseCast: Alfred Molina, Eddie RedmaynePlaywright: John LoganDirector: Michael GrandageSet/costume designer: Christopher OramLighting designer: Neil AustinComposer/sound designer: Adam Cork",
  "isFullReview": true,
  "textWordCount": 527,
  "archivePath": "data/archives/reviews/red-2010/hollywood-reporter--franck-scheck_2026-02-07.html",
  "textFetchedAt": "2026-02-07T09:25:16.598Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "duplicateTextOf": "hollywood-reporter--david-rooney.json",
  "wordCount": 527,
  "tierReason": "Full review text"
}