{
  "showId": "red-2010",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2010/04/02/theater/reviews/02red.html",
  "publishDate": "April 2, 2010",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Mr. Logan has created a work that is both intellectually stimulating and deeply moving, a portrait of an artist whose greatest creations may have emerged from his most tormented moments.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "“Red,” which arrives as fresh, yes, as paint from its recent premiere at the Donmar Warehouse in London, initially registers as a visceral exercise in art appreciation. Fortunately though, it turns out to be more a study in artist appreciation, a portrait of an angry and brilliant mind that asks you to feel the shape and texture of thoughts.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Broadway-Blog-RED-Review-Roundup-20100402",
  "showScoreExcerpt": "Mr. Logan has created a work that is both intellectually stimulating and deeply moving, a portrait of an artist whose greatest creations may have emerged from his most tormented moments.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (30 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/03/19/theater/nina-arianda-stars-in-tales-from-red-vienna.html?ref=theater",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 8,
  "textWordCount": 444,
  "archivePath": "data/archives/reviews/red-2010/nytimes--ben-brantley_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:18:07.026Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240728042430",
  "archiveOrgUrl": "http://web.archive.org/web/20240728042430/https://www.nytimes.com/2010/04/02/theater/reviews/02red.html",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "https://www.nytimes.com/2010/04/02/theater/reviews/02red.htmlShare full articleAdvertisement\n\nEven before you see his eyes, you’re aware of the force of his gaze. Portraying the artist Mark Rothko, Alfred Molina sits with his back to the audience at the beginning of “Red,” John Logan’s intense and exciting two-character bio-drama, which opened on Thursday night at the Golden Theater. Yet the set of his neck and shoulders makes it clear that he is staring hard and hungrily, locked in visual communion with the object before him.\n\nThat’s an abstract painting, copied from Rothko, and it is indeed very red and very dramatic. But it is Mr. Molina’s stare that invests it with real drama. “What do you see?” he asks in the play’s first line, with an urgency that is part hope and part despair, with despair in the ascendant. By this time we have looked into his eyes. What we see, above all, is an artist seeing, and it’s impossible not to feel thrilled by the privilege.\n\n“Red,” which arrives as fresh, yes, as paint from its recent premiere at the Donmar Warehouse in London, initially registers as a visceral exercise in art appreciation. Fortunately though, it turns out to be more a study in artist appreciation, a portrait of an angry and brilliant mind that asks you to feel the shape and texture of thoughts. Set in a New York studio on the Bowery in the late 1950s, the play follows the initiation of Ken (the excellent Eddie Redmayne), a newly hired assistant, into the uncompromising aesthetic of Rothko (1903-1970), who at that time was working on a commissioned series of paintings for the new Four Seasons restaurant.\n\nRothko was known to be a man of fierce opinions and didactic conversation, attributes that Mr. Logan latches onto gratefully and fruitfully. Much of “Red,” directed by Michael Grandage, unfolds as a combative Socratic dialogue between teacher and pupil, a master class of questions and answers about the methods and purpose of Rothko’s art. “I am not your teacher,” Rothko says, shortly after meeting Ken. But he sure sounds like it.\n\nRothko, you see, wants to be understood. And that requires understanding the whole history of Western painting, and Nietzsche and Freud and Jung and Shakespeare, to cite just a few of the cultural names that are not so much dropped as flung here. Ken, a fast learner, is soon giving as good as he gets. Sessions in the studio become heated debates on the Apollonian and Dionysian impulses in Rothko’s painting, per Nietzsche’s “Birth of Tragedy.”\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "_showNotMentionedDiscoveryAttempted": true
}
