{
  "showId": "the-boys-in-the-band-2018",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/review/boys-band-theater-review-1113712/",
  "publishDate": "May 31, 2018",
  "fullText": "By Jay Reiner, The Associated Press \n\n \n\n October 14, 2010 9:13pm\n\nMart Crowley’s “The Boys in the Band” is one of the few plays that can honestly claim to have helped spark a social revolution. When the groundbreaking comedy appeared in 1968, gays were very much still in the closet and the door was tightly shut. A year later, the Stonewall riots in New York forever changed the way gays were perceived by society and, as importantly, how gays perceived themselves. The following year, William Friedkin successfully transferred the play to film. One can’t help but feel that “Boys” played a part in the rapid change in consciousness that took place in those politically charged years.\n\nWhat set the play apart from previous works that touched on homosexual themes was the scathing humor and penetrating insights into the gay psyche, circa 1968. Although the characters often are grounded in passe gay stereotypes that capture a particular moment in time, they also resonate with larger truths that go beyond the precincts of gayness. The boys might be in the band, but the band plays for everyone.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n TV\n \n \n \n \n\n \n \n \n \n How the 'Today' Show Is Covering Savannah Guthrie's Mom's Suspected Kidnapping \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Lifestyle\n \n \n \n \n\n \n \n \n \n Finneas Joins The Macallan for 'Diamonds Are Forever' 55th Anniversary Release Party \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n The Bottom Line\n \n \n Empty\n\nMichael (Matt McConkey) is throwing a birthday party in his Manhattan apartment for his friend Harold (Eric Roth), an older Jewish aesthete with an acid tongue dipped in equal measures of sarcasm and superciliousness. Before Harold’s entrance, the other guests are busy trading insults, barbs and anxieties in witty bursts of repartee that Oscar Wilde might envy.\n\nWe know trouble is brewing when Alan (David Stanbra), Michael’s straight roommate from college, is about to show up, and Michael warns everyone not to give away their gayness. An impossible task, to be sure, especially for Emory (Chris Sams), the party queen dressed in short seersucker pants, a bow tie and high-top work shoes. Sure enough, the clueless Alan finally catches on and ends up slugging Emory for being a “pansy.”\n\nIn Act 2, the action turns even bitchier and more confessional when Michael maneuvers the guests into a truth-telling game on the telephone (a device that hasn’t aged all that well). Meanwhile, Alan’s sexual orientation is called into question and several secrets are aired, giving the play a slightly soapy feel.\n\nMost of director Jason Crain’s cast is solid, moreso in the three roles that matter most. McConkey’s self-hating Michael, whose wicked tongue never sleeps, walks a fine line between anger, ambivalence and despair. Roth captures Harold’s distinctive brand of archness and insinuation in scintillating style. Sams’ Emory is less swishy than some who have attempted the entertaining role, but he finds the underlying sweetness in the character.\n\nOthers who contribute are Sean Galuszka and Greg Siff as Hank and Larry, respectively, who have the same problems as any card-carrying hetero couple. Kerby Joe Grubb is convincing as Michael’s depressed lover, and Stanbra wrestles the awkwardly written Alan to a draw. Darryl Stephens’ Bernard and Dustin Varpness, as Harold’s birthday-gift cowboy, need to tune up their instruments if they want to play in this classy band.\n\nBy the way, it would be nice to find the playwright’s bio in the program along with the other lavishly laid out ones. After all, he did write the play you claim to be celebrating.\n\nVenue: The Coast Playhouse, West Hollywood (Through May 16).Cast: Matt McConkey, Eric Roth, Chris Sams, Kerby Joe Grubb, David Stanbra, Greg Siff, Sean Galuszka, Darryl Stephens, Dustin Varpness.Playwright: Mart Crowley.Director: Jason Crain.Set designer: Michael Fitzgerald.Lighting designer: Ellen Monocroussos.",
  "isFullReview": true,
  "dtliExcerpt": "The all-star cast brings fresh energy and nuanced performances to Mart Crowley's landmark 1968 play about gay friendship, love and self-acceptance.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Fifty years after Mart Crowley's landmark comic drama about a group of gay men in pre-Stonewall New York first made waves, director Joe Mantello vigorously shakes the dust off The Boys in the Band. What might have been another bulletin from the distant queer past is transformed into a scintillating portrait of the self-loathing that festers in ghettoized subcultures, perhaps as much now as then. Starring a high-caliber cast of out gay actors led by Jim Parsons, Zachary Quinto, Matt Bomer and Andrew Rannells, the production is sharpest when the zingers are flying back and forth like missiles, but the anger coursing through the play's veins still scalds.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Critics-Weigh-In-on-THE-BOYS-IN-THE-BAND-on-Broadway-20180531",
  "showScoreExcerpt": "The all-star cast brings fresh energy and nuanced performances to Mart Crowley's landmark 1968 play about gay friendship, love and self-acceptance.",
  "contentTier": "complete",
  "contentTierReason": "Short text (21 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "https://www.hollywoodreporter.com/review/boys-in-the-band-theater-1116175",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 8,
  "textWordCount": 603,
  "archivePath": "data/archives/reviews/the-boys-in-the-band-2018/hollywood-reporter--david-rooney_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:23:22.374Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "misattributedFullText": true,
  "extractedByline": "Jay Reiner",
  "expectedCritic": "David Rooney",
  "wordCount": 603,
  "tierReason": "Full review text"
}