{
  "showId": "the-boys-in-the-band-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2018/05/31/the-boys-in-the-band-50-shades-of-gay/",
  "publishDate": "2018-05-31T21:21:36",
  "fullText": "The Boys in the Band invites you to attend a birthday party from the gay hell of 50 years ago, when the love that dared not speak its name really was a hush-hush affair. Mart Crowley composed his dramatic comedy in the years shortly before the Stonewall uprising, and his play sharply reflects the manners and morals of upper middle class gay male existence as it was gingerly lived in New York City back then.\n\nA long-running Off Broadway sensation in 1968 and then a controversial film (featuring its original stage actors) in 1970, The Boys in the Band eventually was dismissed, in the bright light of latter-day social change, as a rather shady depiction of gay men. Thanks to its excellent new Broadway production, which bowed tonight at the Booth Theatre, The Boys in the Band is revealed to be a trenchant period drama that dazzles contemporary viewers with a barrage of explosive laughs even as its smart staging respects the thorny past.\n\nCrowley sets his story one night in a snazzy apartment, where Michael (Jim Parsons), a 30-something writer, throws an intimate birthday bash for his best frenemy Harold (Zachary Quinto). Unexpectedly dropping into this flamboyant assembly of representative gay gents is Alan (Brian Hutchison), Michael’s presumably heterosexual friend from college days. Appalled to find himself amid such queer company, the distraught Alan inexplicably sticks around to become ensnared in a drunken truth-telling game during which most of the men own up to the deepest loves of their lives.\n\nIn terms of dramaturgy, rather than social significance and content, The Boys in the Band is a slickly-written piece of boulevard-type drama that is distinguished by the playwright’s adroit ability to create distinct characterizations of people; to say nothing of his expertise in lobbing corrosive wisecracks and crafting wickedly amusing exchanges. It is fiercely funny. Let’s also note that Crowley’s wonderfully actable dialogue can be rude in spots but it is never crude, with nary an f-bomb in it. As a frank, even fearless, time capsule of gay urban life from half a century ago, the work has acquired a certain gravitas today that poignantly underscores its remarkably entertaining qualities.\n\nJoe Mantello, one of the top directors around, delivers quite a seductive production. The playwright has trimmed some needless frou-frou from his text and eliminated the intermission, so that the show runs about 110 minutes. Mantello initially paces these proceedings quickly as the different guests arrive and then strategically modulates the tempo as the story’s dramatics flare up and wane. All the while, Hugh Vanstone’s lighting skillfully suggests the passage of time even as it gradually develops a boozy atmosphere.\n\nEmploying openly gay actors for this production pays off in several ways. First, as the show opens on the eve of Gay Pride month, it publically illustrates how significantly our social mores have evolved since the play’s original day. Secondly and more essentially, these actors appear natural in their characterizations while their body language is exceptionally expressive.  It is interesting to note how the reddish-colored velour that dominates designer David Zinn’s glossy, Sixties-chic, bi-level setting varies in many shades ranging from lavender to mauve to magenta, depending upon the lighting. So, too, do the play’s individuals represent different sorts of gay men.\n\nUnder Mantello’s astute guidance, a terrific ensemble sweeps the audience along on the story’s increasingly emotional roller-coaster ride as ribald laughter gives way to tears.\n\nA slight Southern drawl betraying the character’s provincial roots, Jim Parsons’ testy nature as Michael suggests that he’s not as sophisticated as he strains to be. So when the party he anxiously hosts goes off the rails, it seems instinctive for Michael to resort to swilling liquor, which brings out his uglier side. As Michael’s supportive buddy Donald, Matt Bomer tends to fade in the glare of flashier personalities, but he lends the character a watchful quality as one of those deferential souls who is content to observe others. Zachary Quinto, sporting mod duds and a formidable cool as Harold, the b-day boy, gives every deliberate word he slowly utters a sardonic edge that cuts deeply. Brian Hutchison’s uninvited Alan looks woefully (and appropriately) out of his square element.\n\nLounging about in tight white jeans, Andrew Rannells is every inch a pretty boy on the constant prowl who obviously chafes at his bonds to a tautly buttoned-down lover firmly depicted by Tuc Watkins. Michael Benjamin Washington’s mild-mannered African-American character endures racist ribbing in an effort to be included as simply one of the boys. Charlie Carver sweetly hangs out as the dumb bunny gift-wrapped for Harold’s delectation. Wearing be-flowered shorts and leopard-print loafers as Emory, the fey interior decorator whose bold demeanor freaks Alan into a rage, Robin de Jesus speaks in a gritty outer borough accent that indicates he can fearlessly take care of himself. Not incidentally, the period clothes designed by David Zinn offer visual clues to these assorted individuals.\n\nWhether they are camping it up to “Heat Wave” or wallowing down in the depths of self-loathing, the members of Mart Crowley’s Band embody the damaged offspring of a repressive era that has passed, hopefully never to return. And, as troubled as they may be, these boys offer splendid company on Broadway.\n\nThe Boys in the Band opened May 31, 2018, at the Booth Theatre and runs through August 11. Tickets and information: boysintheband.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
