{
  "showId": "the-boys-in-the-band-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2018/05/31/the-boys-in-the-band-parsons-quinto-crowley/",
  "publishDate": "2018-05-31T21:20:48",
  "fullText": "Even the games they don’t play sound awful. Michael, the first character we meet, is hosting a shindig that’s going rapidly off the rails, and he has decided it’s time for a party game. The Truth Game and Murder are the ominously titled options suggested and rejected, and, in his and his guests’ lubricated states, neither seems likely to have gone well.\n\nBut our host wants to play something else. It’s a new game he’s just ginned up—and he’s well on his way through a fifth of the stuff—that he calls Affairs of the Heart. There’s a complicated scoring system, but the main rule of it is this: Each man in his sunken living room must telephone the one person he has truly loved and confess his feelings. It’s emotional abuse, with points.\n\nThis game is the central action of The Boys in the Band, newly and extravagantly revived at the Booth Theatre on its 50th anniversatry. It’s playwright Mart Crowley’s device for getting under the skin of the group of bitchy, quippy gay men gathered at Michael’s. It also, as ever, makes no sense. Boys is a milestone play in the history of gay theater, a fascinating and lacerating just-pre-Stonewall take on a demimondial gay Manhattan that’s essentially alien to the well-employed, well-partnered, post-Obergefelled couples currently snapping pre-curtain Playbill selfies. The play remains compelling viewing, for its wit and its pathos and especially as a slice of historical anthropology. But there’s just no good reason, and there’s never been a good reason, why the miserable men in Michael’s living room don’t simply get up and leave. It’s the unavoidable flaw in this unavoidable work.\n\nDirector Joe Mantello—Louis in the original Angels in America, to interweave the iconic gay plays currently in revival—hasn’t solved that problem. (For the movie version, William Friedkin had the good sense to add a torrential rainstorm to keep them indoors.) But he’s otherwise given us as fine a version of Boys as we’re likely to get, one that deeply underlines it’s characters self-hatred even while reveling in their campy repartee—and one that remains very much a portrait of its time.\n\nThis production is also, quite conspicuously, a portrait of how times have changed. For its initial production, off Broadway in 1968, and for the movie, released in 1970, being involved with such a notoriously gay property was through to be a career killer. Today, its producers include high-powered gay men like Wicked maestro David Stone, Broadway-Hollywood kingpin Scott Rudin, and TV auteur Ryan Murphy; it’s directed by another one, Mantello; and it features an out-and-proud cast of uncommon star wattage. That, perhaps more than anything on stage, is a measure of how much times have changed.\n\nBut what’s on stage makes that point, too.\n\nThe usually affable and ingratiating Jim Parsons stars as Michael, the host of the birthday party and a man whose self-hatred, manifested in spending money he doesn’t have, is driven by both alcoholism and Catholicism. (By the end of the night, he’ll head out for a late Mass at St. Malachy’s.) Parsons typically plays a good guy, and here he uses that veneer to give those claws that eventually come out even more malign sharpness.\n\nThe party is for Harold, the self-described “thirty-two-year-old, ugly, pockmarked Jew fairy,” and Zachary Quinto plays this iconic role with relish. If Parsons is playing a menacing version of himself—and if Andrew Rannells, as the happily partnered and happily promiscuous Larry, is playing yet another version of the same role he always does—Quinto transforms into Billy Eichner with a cold and a Quaalude. Harold has many of the plays most famous lines — “I am turning on, and you are just turning,” he tells Michael and the host sharpens his talons — and also the group’s most obvious self-hatred. Quinto plays them masterfully, sinking into the character’s caricature but showing that the character is choosing to present himself that way.\n\nThe other friends at the boozy birthday include Douglas (Matt Bomer, spending more time than strictly necessary standing around in his briefs, and, on the evidence, well-entitled to do so), who can’t take too much of the city and commutes in from the Hamptons on Saturdays for analysis and parties; Hank (Tuc Watkins), Larry’s aspiring-to-monogamy partner, who is straight-presenting and recently separated from his wife; Emory (Robin de Jesús), a Latino interior decorator and the most stereotypically effeminate of the bunch; and Bernard (Michael Benjamin Washington), who makes minstrelsy-type jokes about himself but won’t tolerate them from others.\n\nIf today’s happy homosexuals are all alike, each of Band’s self-hating ones is self-hating in his own way.\n\nThere’s also Alan, the token straight man (Brian Hutchison, also, in real life, gay), Michael’s college roommate and a proper gentleman with a proper wife. He’s in New York for the night, insists on stopping by Michael’s party and becomes progressively more and more horrified. Why he doesn’t leave is perhaps least clear—except that eventually we learn that he may have had a same-sex affair in college, too. Hence his need to beat himself up.\n\nThe crux of the drama revolves around Alan. It’s his appearance and his gay-bashing attack on Emory that drives Michael to start turning. It’s the question of why he’s there that drives the characters to stick around, inasmuch as anything does. It’s the secret of his potential same-sex attraction that pushes Michael to play the awful game. What’s striking about all of that is how much even this classic of gay theater relies on its straight interloper as the audience’s way in. It all combines to make the play feel strictly like a museum piece. (And a museum-quality museum piece, at that. David Zinn’s set and costumes are très swinging-sixties chic.)\n\n“If we could just learn not to hate ourselves so much,” Michael says at its end, filled with regret about the terrible night he has created. “That’s it, you know. If we could just not hate ourselves just quite so very, very much.” He doesn’t finish the thought, but the idea is that maybe these men wouldn’t be so horrible to each other.\n\nThe good news is that we don’t, and so we aren’t. But it’s the creaky dramatics, not the changed mores, that make Boys in the Band feel like it’s playing such an odd tune.\n\nThe Boys in the Band opened May 31, 2018, at the Booth Theatre and runs through August 11. Tickets and information: boysintheband.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
