{
  "showId": "topdog-underdog-2022",
  "outletId": "newyorker",
  "outlet": "The New Yorker (Helen Shaw)",
  "criticName": "Helen Shaw",
  "url": "https://www.newyorker.com/magazine/2022/10/31/topdog-underdog-back-on-broadway-still-has-its-eye-on-the-american-long-con",
  "playbillVerdictUrl": "https://www.newyorker.com/magazine/2022/10/31/topdog-underdog-back-on-broadway-still-has-its-eye-on-the-american-long-con",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Save this storySave this storySave this storyA man walks into a dingy apartment wearing a big, down-filled coat. He’s bundled up against the cold, or so we think. But soon he’s doing a thief’s striptease: there’s a whole boosted suit under there, tags and all. When he turns around, we see another suit, still on its hanger, dangling down his back. He keeps unwrapping himself, finding two shirts, two jackets, two pairs of pants, two belts. Then—just when we think he couldn’t possibly be hiding anything else—he pulls out two ties.\n\n“Topdog/Underdog,” Suzan-Lori Parks’s tour de force, wears its own puffy coat: it’s a poetic Passion play in which the metaphorical crucifix is American history, dressed as a realistic two-hander about brotherly one-upmanship. Every image smuggled inside is some kind of double or inversion or mirror. This is true in a larger sense as well: the often superb Broadway revival now at the Golden can’t help being a through-the-looking-glass version of the play’s original incarnation, the one that premièred at the Public in 2001 and moved to Broadway in 2002. Expectations are high. Yahya Abdul-Mateen II and Corey Hawkins are stepping into iconic roles, which were made famous—and are still deeply stamped—by Yasiin Bey (known then as Mos Def) and Jeffrey Wright.\n\nGone is the dark fun-house quality of George C. Wolfe’s now legendary production, replaced by an engrossingly believable, even naturalistic portrait of Black men at their limits. Hawkins plays the slippery, haunted older brother, Lincoln; Abdul-Mateen is the ambitious, suit-snatching Booth. Their names tether them psychically to the historical Lincoln and Booth, but the brothers are also locked in their own kind of existential struggle. As they eat Chinese food, banter about women who left them, and add up their meagre accounts, each one takes a turn as the top dog, then the underdog, then the top dog again. It’s the “first move that separates thuh Player from thuh Played,” Lincoln, who trained his eye for suckers back when he was hustling three-card monte, says. But whose move is really first, when the American long con started hundreds of years ago?\n\nIn the show’s twisting, torrential language—it moves like white water—Parks joins a keen social insight reminiscent of James Baldwin’s (he was the first person to tell her to write plays, when she was a student at Mount Holyoke) with her own jazz-inflected dramaturgy. She exerts rhythmic control from inside the text, distinguishing between “rests” (which indicate “take a little time”) and “spells” (which are longer and have “an architectural look”):\n\nLincoln:(Rest)Goodnight.Lincoln:Booth:Lincoln:Booth:Lincoln:Booth:Lincoln: You can hustle 3-card monte without me you know.\n\nParks was the first Black woman to win the Pulitzer Prize for drama, and, in the two decades since, her prize-winning play has become a classic. The New York theatre scene is very different now from what it was in 2002, when she was the only Black writer with a play on Broadway, and she, too, is different—a Great Figure instead of a bomb-thrower. We’re currently in the middle of a Parks-a-palooza: later this fall, she’ll perform in her new work, “Plays for the Plague Year,” a sort of bereavement cabaret, at Joe’s Pub; then, in the winter, her musical adaptation of “The Harder They Come” will début at the Public, where she’s been in residence since 2008.\n\nThe director of “Topdog,” Kenny Leon—who was nominated for a Tony for directing the sensitive 2020 revival of “A Soldier’s Play”—emphasizes the dialogue’s overheard quality, the shoot-the-shit ease that the brothers have together. His work with the actors is light but sure. Abdul-Mateen—swaggering, buoyant, easily offended—reacts behind the beat, maintaining his optimism for a minute after bad news comes through. Hawkins, on the other hand, stays just ahead of the moment, his shoulders crumpling slightly, like a card that’s been thumbed too much, even when the brothers seem to be getting along. They are both wonderful, but Hawkins gives a sly, peekaboo performance that rolls up next to you like a grenade.\n\nExplosive realism, though, is only one half of the script’s double act. Lincoln’s day job is to dress up as his eponym at an arcade, smearing on whiteface and donning an old-timey coat and a stovepipe hat, all so that fun-seekers can “assassinate” him with blanks. Lincoln is a professional “faux-father”—a joke that appears in “The America Play,” another drama that Parks wrote about a Black Abraham Lincoln impersonator. Long after the character’s first, creepy entrance in his arcade costume, Honest Abe stays in our thoughts—he’s the face on every penny that anybody ever earned, the reminder of a freedom that came with conditions.\n\nParks wants us seeing double, so she fills her text with references to symmetrical or mirrored images, such as a pair of black cards in some street patter that Booth practices (“Ima show you thuh cards: 2 black cards but only one heart”) and a shiny, dented fuse box where Lincoln can see the reflections of his arcade assassins coming up behind him.\n\nBooth: Yr Best Customer, he come in today?Lincoln: Oh, yeah, he was there.Booth: He shoot you?Lincoln: He shot Honest Abe, yeah.Booth: He talk to you?Lincoln: In a whisper. Shoots on the left whispers on the right.Booth: Whatd he say this time?Lincoln: “Does thuh show stop when no ones watching or does thuh show go on?”\n\nIn case you were wondering if these doomed brothers are in the world of allegory, Arnulfo Maldonado’s set design includes a sepia-toned American-flag curtain that lifts to show us Booth’s crummy room, its single bed, and the red recliner where Lincoln sleeps. Golden scalloped drapes that frame the proscenium extend all the way around and behind the two walls of the set. When the flag curtain rises, the room rotates slightly toward us, as though it were just finishing a turn on a pedestal. Cars in showrooms get luxurious, glittering backdrops like this; so do trophies.\n\nWhen it comes to what’s in that room, though, Leon keeps the metaphor stuff tidied away. In his scene work, Leon isn’t interested in the grotesque or the uncanny, or in imparting a sense of something we cannot see. Allen Lee Hughes has his lights rise and fall on the men (it is always night, but when, say, Lincoln sings, he gets a spot), yet he doesn’t go stark and expressionistic with them, the way Scott Zielinski did twenty years ago. Leon has poured his energy into the actors and into making their interactions unhurried, unpretentious. The play is bleakly funny, but Leon makes sure that it’s funny funny, true to the moment, up to the minute. Abdul-Mateen and Hawkins certainly give performances that are cinematically fine-grained, but focussing only on their realism and plausibility leaves the work’s other stylistic cards unplayed. Leon’s transitions are hasty and a little awkward, and he misses the way the show should invoke—especially in its final moments—an unseen force, some demonic mill somewhere, grinding away at fate.\n\nYou’ll therefore need to listen, rather than watch, for the way the boundaries of Parks’s reality keep curving back on themselves. Much of what the two men say about what’s happening in the rest of their lives is unreliable, based in fantasy or in lies. The scholar Michael LeMahieu has argued that the Best Customer, the one who whispers in Lincoln’s ear, might be Booth. (I can believe it. Parks loves making points with wordplay, and when Booth asks, “Hes a brother, right?,” our Spidey senses should ping.) Whether Leon explores it or not, there’s a clear intimation that we’re seeing something more than the ruin of one small family. America won’t let these men out; Emancipation won’t let these men out; the grim, violent preoccupation with male potency won’t let these men out. Under that big, puffy coat, there is a pair of mirrors for all of us. That’s how you get a mise en abyme, after all—you point two mirrors at each other, and instead of showing you an image they reveal an infinity stretching into the dark. ♦\n\nThe hottest restaurant in France is an all-you-can-eat buffet.\n\nA heat shield for the most important ice on Earth.\n\nA major Black novelist made a remarkable début. Why did he disappear?\n\nAndy Warhol obsessively documented his life, but he also lied constantly, almost recreationally.",
  "isFullReview": true,
  "textWordCount": 1379,
  "archivePath": "data/archives/reviews/topdog-underdog-2022/newyorker--helen-shaw_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:33:04.331Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250727163553",
  "archiveOrgUrl": "http://web.archive.org/web/20250727163553/https://www.newyorker.com/magazine/2022/10/31/topdog-underdog-back-on-broadway-still-has-its-eye-on-the-american-long-con",
  "contentTier": "complete",
  "wordCount": 1379,
  "tierReason": "Full review text"
}