{
  "showId": "act-one-2014",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "David Roberts",
  "url": "https://newyorktheatreguide.com/reviews/act-one",
  "publishDate": "April 21, 2014",
  "fullText": "There are some seriously wonderful performances going on over at the Vivian Beaumont. Act One the play based on the autobiography of Moss Hart is not only an homage to theatre, it is a temporary harbor for some very good actors.\n\nThe first among these is Tony Shaloub who not only plays the Moss Hart who is authoring the story, but takes on the role of Hart's Cockney father as well as Hart's collaborator, another icon, George S. Kaufman. Mr. Shaloub is an immaculate performer who glides from one part to another with such little fanfare that it almost seems that we are time traveling.\n\nAct One is the story of how Moss, who was introduced to the theatre by his Aunt Kate (Andrea Martin), swam upstream to his first Broadway (or anywhere) hit in 1930 at the age of 26. The play was Once In A Lifetime and was to be the first of many collaborations for Kaufman and Hart. This is a charming, albeit dull, story. The key to enjoying it is not to wait for a plot, settle in and enjoy the ride. There is no protagonist or antagonist, unless you count Hart and Hart. For according to himself, Hart was his own worst enemy and best ally.\n\nBecause we all know the outcome, there is no suspense in this tale. Rather, we get to watch as Hart is tossed from one life raft to another. There are a lot of accidents that aid his determination. His first job is at the office of a B-Tour producer, Augustus Pitou (Will LeBow) where he worms his way into a position as Office Boy (remember no email or fax machines or Keurig), soon to take over as secretary and script reader. When Pitou is out of a play for a new season, Hart decides he can write something better than he has read so far. He does and Pitou takes a chance on his first play, which fails out of town in Rochester. There follows an acting job in Emperor Jones opposite Charles Gilpin (Chuck Cooper), and a stint in the Catskills and as a Social Director at a hotel in the Catskills. All the while he kept writing. When a new man by the name of Dore Schary (Will Brill), the future movie mogul, joins the small circle of the Confederation of Office Boys, he has already read Hart's most recent play, Once In A Lifetime. He happens to have the private address of a producer, Jed Harris, and sets it up for the script to be sent over. Turns out Harris likes the script although EVERYONE agrees the second and third act need work.\n\nAnother of his Confederation, Eddie Chodorov (Bill Amy) gets the same script to agent Frieda Fishbein (Andrea Martin) who brings it to another producer, Sam Harris (Bob Stillman) who calls in Kaufman (Shaloub).\n\nConfused? So was I. This play is so literal that it is like a scavenger hunt. On a spectacular revolving set by Beowulf Boritt (the stage hands should have had a curtain call for the work they do) that changes as if it were part of a magic show, these wonderful actors pace from the Bronx to Broadway, from Rochester to the Upper East Side, from agents offices to the local tavern. The blocking alone is dizzying. Combined with the trail of the tale it is easy to feel lost.\n\nThis is why the entrance of Kaufman, who is eccentric and driven, is such a boost. We have someone to latch onto when Shaloub gives us this gift of a character, who is so peculiar he crosses his arms to turn on the water faucets. A detail not overplayed and probably missed by many. Kaufman takes the helm and tries to steer the ship to safe shore. That it takes rewrite after rewrite is not surprising, but we are driven almost as mad as the two writers in wanting success and an end to this chapter because the play as written is so lifeless.\n\nThe successful production does happen, but not without a price. Because this play lacks conflict of any sort it is tedious. It is a vanity piece in a way - the story of Moss Hart told in the temple where he worshiped. But for me, that is not enough. The text as written swaps authenticity for a bland rehashing of the facts. Please! Don't bore me with the facts. Tell me a story.\n\nIt never fails to surprise me that folks take on real life and try to fit it into the glass slipper of a play. What works here is not the text, it is the actors, although watching Martin, Fontana, and Shaloub play sincere made me wince, whose love of the theatre is equal to Hart's. (As a personal note, Will Brill was outstanding in each of his three roles, vibrant, vulnerable and inventive.)\n\nAs Hart says to us in the opening scene The theatre is not so much a profession as a disease - and these actors have it bad.\n\nIn this case, however, they have it bad and that IS good.\n\n\"Mr. Shalhoub and Mr. Fontana's shimmering performances are reason enough to celebrate ... If the lively but overblown production that surrounds them isn't always up to their high standards, I'm still not grousing.\"Ben Brantley for New York Times\n\n\"Affectionate, handsome and overstuffed. Clocking in at close to three hours, this love letter to a homegrown writer and his rags-to-riches rise needs extra postage. ... Even though \"Act One\" could use pruning, there's something missing: It never reveals what made Hart special. Story structure? Colorful characters? Snappy dialogue? The basic fact should be the starting point, but it's missing in action here.\"Joe Dziemianowicz for New York Daily News\n\n\"If you think watching paint dry is boring, try watching two men edit a long-forgotten play.\"Elisabeth Vincentelli for New York Post\n\n\"Hart himself never comes into strong focus. In his life story, he naturally wrote about the many individuals he encountered. The play, which ends in 1930, with the production of his first hit, \"Once in a Lifetime,\" doesn't fill in much that's revealing about the man.\"Robert Feldberg for The Record\n\n\"If you love theater people, you will fall for 'Act One.'\"David Cote for Time Out New York\n\n\"The bitterest disappointment of the Broadway season.\"Michael Sommers for Newsroom Jersey\n\n\"Condensing into play form Moss Hart's 1959 autobiography - a peach among American theater memoirs - was probably an impossible task. However, that doesn't soften the arduousness of sitting through writer-director James Lapine's botched attempt at it.\"David Rooney for The Hollywood Reporter\n\n\"Verbose, unwieldy, overacted production.\"Marilyn Stasio for Variety\n\nExternal links to full reviews from popular press...\n\nNew York Times - New York Daily News - New York Post - The Record - Newsroom Jersey - Hollywood Reporter - Variety\n\nOriginally published on Sep 22, 201700:00",
  "isFullReview": true,
  "dtliExcerpt": "Tony Shalhoub delivers a masterful performance that captures both the humor and pathos of Moss Hart's journey from struggling playwright to Broadway success.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Tony Shalhoub delivers a masterful performance that captures both the humor and pathos of Moss Hart's journey from struggling playwright to Broadway success.",
  "contentTier": "complete",
  "contentTierReason": "Short text (23 words)",
  "textWordCount": 1151,
  "archivePath": "data/archives/reviews/act-one-2014/nytg--david-roberts_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:07:29.142Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250719104938",
  "archiveOrgUrl": "http://web.archive.org/web/20250719104938/https://www.newyorktheatreguide.com/reviews/act-one",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 1151,
  "tierReason": "Full review text"
}