{
  "showId": "act-one-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "http://www.nytimes.com/2014/04/18/theater/several-moss-harts-are-in-act-one-at-lincoln-center.html?_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "web-search",
    "bww-roundup",
    "playbill-verdict"
  ],
  "bwwExcerpt": "Since Hart is the heart of 'Act One,' which has been warmly adapted by James Lapine from Hart's 1959 memoir of the same title, Mr. Shalhoub and Mr. Fontana's shimmering performances are reason enough to celebrate -- and to heave a sigh of relief. If the lively but overblown production that surrounds them isn't always up to their high standards, I'm still not grousing...That's because whatever its flaws, 'Act One,' which Mr. Lapine also directed, brims contagiously with the ineffable, irrational and irrefutable passion for that endangered religion called the Theater...'Act One' critically reminds us, at a moment when it's easy to forget, of why so many of us fell head over heels for this cockamamie faith to begin with.",
  "bwwScore": 8,
  "contentTier": "complete",
  "fullText": "If only the Tony Awards nominating committee would see fit to expand its categories, I could confidently predict at least two eminently deserving winners. For best performance by two actors in the same role ... (hold your breath, nibble your nails) ...sorry, no suspense here, folks.\n\nThe statue goes to Tony Shalhoub and Santino Fontana, who vividly and persuasively share the part of the theater addict and artisan Moss Hart in “Act One,” which opened in a Lincoln Center Theater production on Thursday night. And for the best performance by a single actor in more than one role, it is (drum roll) Mr. Shalhoub, who plays the middle-aged Moss Hart; Moss Hart’s father; and, most unforgettably, Moss Hart’s mentor and collaborator, the great comic playwright George S. Kaufman.\n\nSince Hart is the heart of “Act One,” which has been warmly adapted by James Lapine from Hart’s 1959 memoir of the same title, Mr. Shalhoub and Mr. Fontana’s shimmering performances are reason enough to celebrate — and to heave a sigh of relief. If the lively but overblown production that surrounds them isn’t always up to their high standards, I’m still not grousing.\n\nThat’s because whatever its flaws, “Act One,” which Mr. Lapine also directed, brims contagiously with the ineffable, irrational and irrefutable passion for that endangered religion called the Theater. Or, more specifically, the exacting subset of that creed, the Theater as it is practiced in the Holy Land of Broadway, which this spring has tested the fortitude of its disciples. “Act One” critically reminds us, at a moment when it’s easy to forget, of why so many of us fell head over heels for this cockamamie faith to begin with.\n\nPublished two years before Hart’s premature death, at 57, “Act One” quickly acquired the status of a sacred text, not only among theater aficionados but also among readers who regarded Manhattan as the mecca for self-reinvention. As a practical document of a sentimental education in showbiz, it hasn’t been bettered, particularly in its account of the creation of the play that made Hart famous, the 1930 comedy “Once in a Lifetime.”\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 376,
  "archivePath": "data/archives/reviews/act-one-2014/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T13:59:48.049Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203928",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203928/https://www.nytimes.com/2014/04/18/theater/several-moss-harts-are-in-act-one-at-lincoln-center.html?_r=0",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 376,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T06:48:06.142Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text cuts off mid-sentence and ends with a technical error message about retrieving article content and enabling JavaScript, making it impossible to determine the critic's final verdict.; openai: The text is interrupted with a message about trouble retrieving the article content, indicating it is not a complete review.",
  "promptVersion": "5.2.0",
  "publishDate": "April 17, 2014",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/04/18/theater/several-moss-harts-are-in-act-one-at-lincoln-center.html?_r=0"
}