{
  "showId": "act-one-2014",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2014/04/theater-review-act-one.html",
  "publishDate": "April 18, 2014",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nSantino Fontana and Tony Shalhoub, as Moss Hart and George S. Kaufman, in Act One.\n Photo: Joan Marcus\n \n \n \n Among the most sacred texts of Broadway is Moss Hart’s Act One, an autobiography of the once-famous playwright and director that’s plenty auto but not much biography. It’s full of lies and obfuscations. Hart’s troubled Aunt Kate did not, for instance, die a happy woman in 1925 after the free tickets he obtained as a producer’s office boy enabled him to give her one “last wonderful year.” (In fact, in 1935, she was caught setting fires backstage during rehearsals for a musical that Hart was directing.) Hart himself was manic-depressive, not that you’d know it from the book. And then there’s the matter of his sexuality, conveniently obscured by nubile red herrings. Sacrilege though it may be to say so, I find Act One to be gassy and self-serving, despite the undeniable fun of its rollicking backstage tale. Indeed, the truest thing it offers is a portrait of the theater as a “howling calliope of egomania.”\n\nSo the prospect of a play version by James Lapine actually seemed thrilling. For the acolytes, it might be a chance to experience the tale in what would seem to be its natural habitat. For cynics like me, it might be a corrective. Perhaps Lapine would find a way to keep what’s exciting about the story — Hart’s beeline toward his dream, despite the dream’s elusiveness — while at the same time complicating it with what Hart left out. Promising on this score was advance word that Lapine had divided the leading role into three incarnations: the lonely kid, the ambitious young man, and the 55-year-old success. (Santino Fontana as the young man and Tony Shalhoub as the 55-year-old seemed like perfect casting.) Promising too was Lapine’s reputation. In his own experimental dramas, like Twelve Dreams, as well as in musical collaborations like Sunday in the Park With George, he had performed a kind of exploratory surgery on received texts (or paintings). Unfortunately, the production that has actually resulted will likely satisfy neither the acolytes nor the cynics. Act One, the play, is too mild for the former and too credulous for me.\n\nWhich is not to say it has no charms; charm is nearly all it has. Dozens of scenes, mostly the same length, paint pretty pictures of Hart’s life from about 1920, when he caught the theater bug, to about 1930, when he had his first hit with Once in a Lifetime. In between we watch him escape his family’s ethos of negative expectation, find likeminded friends to bull and plot with, worm his way into oddball jobs, write many bad plays, and eventually, through sheer moxie, turn his arranged collaboration with the great George S. Kaufman into a happy professional marriage. But this format of narration and illustration, enabled by Beowulf Boritt’s gigantic revolving three-story set, is the opposite of dramatic; it’s formal and repetitive like a pop-up book, about the last thing you want from Hart’s you-go-kid story. The actors strain to connect, but it isn’t until near the end of the long evening that any of them are given enough playable conflict to swing at. Then, for a moment, all the busy business thins out and Andrea Martin, who earlier played Aunt Kate but is now Kaufman’s wife Beatrice, gets her teeth on a bit of subtext and drags it around like a Doberman. It’s a beautiful moment: she and Fontana doing a dance of affection, confusion, rue, and warning. Unfortunately, it’s peripheral to the plot. Kaufman, if not Hart, would have cut it.\n\nBut then Lapine does not follow the playwriting rules he puts in the mouths of his two main characters. (The compulsive Kaufman — we see his constant hand-washing but not his womanizing — is beautifully sketched by Shalhoub, who has sensibly abandoned his narrator’s perch.) As they work to improve Once in a Lifetime, whose out-of-town tryout was only half-great, we are told the importance of not wasting time on extraneous characters. (Hart’s three loquacious buddies, and at least two of the narrators, should have been given the axe.) We learn the importance of ruthlessness in cutting whole scenes that seem appealing as spectacle but do not advance the plot. (So what’s with the dully staged party at the Kaufmans’, with Edna Ferber, Harpo Marx, and other period glitterati just standing in a clump?) A bigger problem is that these precepts, when applied to Once in a Lifetime, don’t seem to make any difference; we are shown too little of the play to understand or even notice the huge improvements Hart keeps ballyhooing.\n\nPerhaps Lapine, who also directs the production, has been too loyal to the book, preserving more of its beloved anecdotes than he could satisfyingly shape. Certainly he has been too loyal to the heirs who permitted the adaptation. His Hart is shiny and confident, a man whose tortured upbringing is nothing more than a rotogravure memory. Fontana, who carries most of the load of portraying Hart, is too attractive an actor to suggest on his own, with no textual support, the man’s twisted self-doubt and manias; even the final scene, a rampage that reads like a mental breakdown in the book, is presented here at face value, as a liberation from poverty. If the unexamined psychopathology of the original renders it floridly disagreeable, the play is oddly enervated, with no pathology at all. It’s just busy build-up and no emotional payoff, like a musical without the numbers. (There is, however, delightful live piano music, by Louis Rosen.) Act One is still a love letter to the theater: I smiled through most of it. But it’s a love letter written in disappearing ink.\n\nAct One is at the Vivian Beaumont Theatre through June 14.\n\nShow \n \n \n Leave a Comment\n \n\n Theater Review: Act One\n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "dtliExcerpt": "The problem with Act One is that it's trying to be both a biographical play and a valentine to the theater, and it succeeds better as the latter than the former.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The problem with Act One is that it's trying to be both a biographical play and a valentine to the theater, and it succeeds better as the latter than the former.",
  "contentTier": "complete",
  "contentTierReason": "Short text (31 words)",
  "textWordCount": 1001,
  "archivePath": "data/archives/reviews/act-one-2014/vulture--jesse-green_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:09:12.647Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426204032",
  "archiveOrgUrl": "http://web.archive.org/web/20250426204032/https://www.vulture.com/2014/04/theater-review-act-one.html",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 1001,
  "tierReason": "Full review text"
}