{
  "showId": "three-tall-women-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2018/03/29/three-tall-women-towering-performances-drive-albee-revival/",
  "publishDate": "2018-03-29T21:50:26",
  "fullText": "Towards the end of Angels In America, now being splendidly revived on Broadway, a gay man dying of AIDS pleads for more life, noting, “I’ve lived through such terrible times, and there are people who live through much worse, but…You see them living anyway.”\n\nCompare that philosophy to one being espoused just a few blocks away, in a stellar new production of another Pulitzer Prize-winning play, Edward Albee’s Three Tall Women, by a woman in seeming good health, and of considerable means. If the very young were told honestly what life might have in store for them, posits the character, identified simply as B, “the streets’d be littered with adolescent corpses!”\n\nThough clearly not intended as some great declaration of truth, the line has a specious ring—as does one uttered later in the play, by an older woman, A, also wealthy, who proposes that the happiest moment in life is “coming to the end of it.”\n\nIf you’re not familiar with the play, A, B, and a third character, C, are intended to represent women at different stages of life, though other aspects of their roles change. They embody, in reverse order, carefree young adulthood, jaded middle age, and advanced old age, in which we find A still proud but in substantial physical and mental decline. A young man also figures into the story, the product of a marriage that brought both added privilege and misery.\n\nThe personal struggles of the privileged, a frequent subject in Albee’s work, are not in themselves likely to inspire much sympathy in our fraught time. But the women in Women, a play informed by Albee’s own difficult relationship with his mom, also survive and even thrive in their own ways; the play is less an existential argument or lament than a canny, thought-provoking and often quite funny character study. As such, it succeeds gloriously in this staging, thanks to Joe Mantello’s simultaneously razor-sharp and tender direction and a trio of ideally cast actresses—Alison Pill, Laurie Metcalf, and the miraculous Glenda Jackson—all at the top of their game.\n\nThe multifaceted Mantello, who in his last Broadway outing offered a bold reimagining of a character based on Tennessee Williams, by Williams (in Sam Gold’s revelatory The Glass Menagerie), takes fewer liberties in returning to the director’s chair. The clean, tasteful scenic design, by Miriam Buether, perfectly serves the milieu established in the more naturalistic first act, set in A’s bedroom as death approaches. Here B is presented as A’s acerbic caretaker and C as a young woman representing A’s attorney, who has come in futile hopes of putting A’s affairs in order.\n\nThe conflicts and uneasy camaraderie forged between these women—how Metcalf’s way-past-frazzled B withstands the endless, sometimes senseless chatter of Jackson’s A, while trying to prevent Pill’s curious, confident C from encouraging her boss—foreshadow the charged interaction in Act Two, when character details are rearranged to tighten and complicate the bond between the three. C begins both acts with the breezy self-assurance particular to youth, alternately frustrated and amused by the elder figures; in an Act Two monologue, Pill adopts a flirty, almost conspiratorial air as C shares details of her first seduction.\n\nPill then expertly manages C’s transition from complacency to sheer horror, and denial, as A and B school her on some of what lies ahead, having a bit of fun themselves in the process. Metcalf savors the biting wit in her lines so thoroughly and adroitly that B can almost seem triumphant— until we come to grasp the depth of her bitterness and anger, at which point the actress shatters us.\n\nAs for Jackson, whose recent accomplishments include playing King Lear at the Old Vic, she is simply a marvel. About a decade younger than her character (the actress turns 82 in May), she allows us to see the elegant and entitled young woman—tall indeed, literally and figuratively—she once was, the ravages she has endured, and the clear line connecting them. Repulsive in her bigotry, elusive even beyond her fractured memory, Jackson’s A nonetheless exudes life, from her booming voice to the twinkle in her eye. She makes us laugh through our fear, and feel compassion as well.\n\nThe performance, in fact, refutes A’s theory that life becomes sweetest when we’re past mortal cares. Long may Jackson harbor such concerns, and share them with us.\n\nThree Tall Women opened March 29, 2018, at the Golden Theatre and runs through June 24. Tickets and information: threetallwomenbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews",
    "bww-roundup"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "The performance [Jackson], in fact, refutes A's theory that life becomes sweetest when we're past mortal cares. Long may Jackson harbor such concerns, and share them with us.",
  "bwwScore": 10,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-The-Critics-Weigh-In-on-THREE-TALL-WOMEN-on-Broadway-20180329"
}
