{
  "showId": "three-tall-women-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/03/29/three-tall-women-glenda-jackson-on-a-ripping-albee-ride/",
  "publishDate": "2018-03-29T21:50:24",
  "fullText": "Glenda Jackson! Glenda Jackson! Glenda Jackson! Oh, we’ll get back to that….\n\nHow sharper than a serpent’s tooth it is to have a thankless child, you might have heard old man Lear complain; Edward Albee, it seems, knew something about that. Three Tall Women is about three tall women, yes; but He—a character referred to with increasing vehemence by the ladies in question—is the fly in the ointment, the serpent in the pantry, the poison in the nectar. This mysterious He never gets a chance to actually defend himself, the author having chosen to leave all the talking to his title characters. Albee being Albee, though, “He” doesn’t need a defense—not when mother is hung by her own petard, or rather her own dialogue.  Strung, quartered, and lacerated, too.\n\nThree Tall Women was a revelation when it first appeared at the Vineyard in 1994, following a preliminary 1991 English-language production in Vienna. Albee was outcast at the time; the author of Who’s Afraid of Virginia Woolf? and A Delicate Balance had been box office poison since 1966. His three commercially-produced Broadway plays of the 1980s lasted forty performances combined; hence, the new work was relegated to an off-Broadway non-profit. It didn’t help that Albee waspishly labeled Broadway, in the press, as “our national disgrace.”\n\nBut Three Tall Women, with a cast headed by the little-known Myra Carter and the legendary Marian Seldes, was instantly heralded as one of the strongest and most effective dramas of the time. Albee, no, was not washed up; and he triumphed, winning him the 1994 Pulitzer Prize, his third. (A revival of the 1993 prize-winner, Tony Kushner’s Angels in America, opened four nights ago as the most dynamic production of the 2017-18 season—until tonight’s premiere, that is.)\n\nAlbee’s play transferred uptown for a successful off-Broadway run and was seen later that year on the West End (starring Maggie Smith, and wouldn’t we have like to have seen that production). Three Tall Women has never been produced on Broadway, though, until now.  While memory burnishes the original production and the original cast, the play—in this new staging by Joe Mantello—seems even more dynamic and brilliant, in the “luminous” sense of the word. One imagines that the author, who died in 2016, would love it; although knowing the prickly Albee, it’s anybody’s guess.\n\nThe play tells of a dying invalid of 92 or perhaps 91, she doesn’t care to remember. Crotchety, vulgar and all-round disagreeable, the role offers a tour de force opportunity for the right actress; and Jackson, in her fifth Broadway visit, is the right actress. She has been hurtling words on stage and screen with scalpel-like intensity since 1965, when the young actress stabbed Ian Richardson in the bathtub. (That is, while playing Charlotte Corday to Ian’s Jean-Paul Marat in Peter Brooks’ legendary Marat/Sade.) Jackson has always been a performer with commanding control, traits which make her Three Tall Women performance soar. She has two Oscars and two Emmys on her mantle, and might care to make room for a Tony come June.\n\nSharing the stage are two characters, one of whom is 52 while the other is 26; Albee cryptically calls them “B” and “C,” with Jackson essaying “A.” Describing the plot would spoil the playwright’s conceit. Let’s just say that the play is something of a nostalgic valentine to the author’s mother, as in the St. Valentine’s Day Massacre.\n\nB is played by Laurie Metcalf, an expert and powerful actress along the lines of Jackson. Metcalf seemingly underplays the role until the author gives her a lacerating passage, at which point the method of the play crystalizes. The late Seldes swooped through the role, dominating our view. Metcalf does so much more by doing so much less; another masterful performance from the actress, who triumphed on the very same stage last spring in A Doll’s House, Part 2. The cast is rounded out by Alison Pill, who remains ever memorable from The Lieutenant of Inishmore. Pill is excellent here, in a role which is by design less assured and flashy than the other two tall women.\n\nMantello once again demonstrates his sensitive touch for high drama, as in The Humans and Other Desert Cities. He and set designer Miriam Buether have some tricks up their joint sleeves, about which the less said the better the surprise. (Mantello was very much on my mind entering the Golden, having spent the prior two evenings at Angels in America—in the original Broadway production of which he vibrantly created the role of Louis Ironson.)\n\nBuether is a British designer whose stunning work you might remember from A Doll’s House, Part 2 and Cock.  (In last year’s Albion at the Almeida, she constructed a set in which the actors literally planted hundreds of potted plants during the play, climaxing with a rainstorm which turned the stage into a full mudbath.)  Here she gives us a simple, “wealthy” bedroom that sits there reeking of elegance. Until Buether and Mantello pull an intriguing sleight-of-hand on us, and later cap the evening with a final stunning burst of theatricality.\n\nFrances Cotter Albee died in 1989, after which her not-so-dutiful son set out to memorialize her (musing with filial candor that there was perhaps “too much blood under the bridge”).  A season-and-a-half after the playwright’s death, Three Tall Women stands as a riveting, acid-dipped memorial to the both of them.\n\nThree Tall Women opened March 29, 2018, at the Golden Theatre and runs through June 24. Tickets and information: threetallwomenbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars"
}
