{
  "showId": "three-tall-women-2018",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Christopher Bonanos",
  "url": "http://www.vulture.com/2018/03/theater-review-three-tall-women-three-great-actresses.html",
  "playbillVerdictUrl": "http://www.vulture.com/2018/03/theater-review-three-tall-women-three-great-actresses.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPill, Jackson, and Metcalf, in Three Tall Women.\n Photo: Brigitte Lacombe\n \n \n \n Editor’s note: New York’s regular theater critic, Sara Holdren, is on a brief medical leave. She’ll be back shortly.\n\nEven before those ubiquitous ads in your Facebook feed ruined the phrase “master class,” it had become a tired way of describing an actor, usually one with silver hair, as he or she delivers a performance sans special effects. (See also: “doyenne,” “lion in winter,” “gray eminence.”) But perhaps we can keep it out of retirement just one day longer, for this revival of Three Tall Women really is a staggering example of precisely what a dramatic actor does onstage. Actually three examples. Glenda Jackson, Laurie Metcalf, and Alison Pill — all with significant theater experience, all able to hold a room, all capable of the particular demands of Edward Albee’s simultaneously clipped and spiraling dialogue — just talk and talk and talk some more, for not quite two hours. Although they move around while they do it, there’s almost no action, barely a plot, and (apart from some unusual dynamics involving Miriam Buether’s tricky, clever set design) little that could be called a special effect. They just stand and deliver, or sometimes sit and deliver, and nearly two hours later you realize that you may not have blinked for minutes at a time while they did it.\n\nAlbee’s play, which premiered in 1991 and moved to a long Off Broadway run a few years later—this is its Broadway debut—is schematically constructed, an intermission-less two acts. The three women of the title are nameless, referred to in the script and playbill as A, B, and C (Jackson, Metcalf, and Pill, in that order). In the first half of the show, A is a cranky nonagenarian rich lady, nattering on about friends, family, her upbringing, sometimes with charm, mostly with irascibility. Her stories repeat themselves, drift into explicit racism, occasionally turn bawdy, and sometimes end with a hasty trip to the toilet. B is her caretaker, whose job consists of managing the pills and bathroom trips, and who does a lot of assuaging and soothing to manage the mood swings. C is a minion from her lawyer’s office, visiting to chase down some paperwork. They both find their client horrifying.\n\nThen, abruptly, something — one line of dialogue suggests that it’s a stroke — puts A under for the second act. At that point the three actresses all adopt the out-of-body role of A, at three stages of her life: ages 26, 52, and about 90 (but, this time, with all her marbles). Now the stories come out very differently, as the older versions of A brief their younger selves on what lies ahead, and the youngest version begins to dread what she will become. There’s also a wordless visitation by a fourth person: her son, estranged from her for decades, making a deathbed visit. They have a lot to say about him.\n\nNeedless to say, Laurie Metcalf also knows how to play a punch line. Everyone’s become a Metcalf fan since Lady Bird, but New York theatergoers — and viewers who were paying close attention to her on Roseanne, and apparently also Tom Arnold — have known, at least since her turn in A Doll’s House Part 2, just how good she really is. She really knows how to move on a stage, when to seem constrained, when to let her arms fly, when to toss away a line sideways and provoke a chuckle. Her face is terrifically mobile, leaping from hangdog and world-beaten to narrow hard stiletto gleam. As the caretaker, she is constantly smoothing over the bad moments, leaping to contain every turn of A’s mood and trying to reverse it before she falls apart, and you can see her anxiety in her shoulders. When Metcalf moves upstage to deliver a monologue later on, her posture more aggressive, you literally cannot take your eyes off her; the proscenium seems to recede and she and only she somehow fills your field of vision. She’s a tall woman, but not that tall, and it’s a hell of a trick.\n\nPill, during the first act, has somewhat less to do than the other two women. Since she’s the lawyer, newly arrived from outside the household, she’s more or less there to ask questions and draw the others out and set up the scenes. That makes her role after the break more interesting, because when she returns to the stage, having swapped her professional dark suit for a mauve print dress, she’s transformed: Suddenly she is not a 1991 junior associate with pumps and briefcase but a 1920s flibbertigibbet, a fun-time flapper talking about the boys she’s danced with (and a couple that she has, rather daringly, slept with). You don’t see the change coming, which makes it that much more pleasurable — doubly so because it’s an abrupt turn on Jackson’s characterization of A, so hateful and pinched, in the first act. I’ll admit that early on, when Pill’s role is more subordinate, I briefly wondered whether she would sort of get lost up there amid the other two performances. As soon as she got something to bite down on, that thought disappeared.\n\nAlbee wrote Three Tall Women when he was in his early 60s. It is reportedly a rumination on his relationship with his adoptive mother, a terribly difficult socialite who, from the sound of their relationship, was someone who should not have tried to raise a child. But I also see a lot of Albee’s own self-examination (of a man who has been described as a rather cold and nasty person himself) in there. The senile, wealthy A of the first act is humored by the younger women, rolling their eyes all the while, much as one suspects a famous playwright must be as he faces his own dotage surrounded by acolytes. Later on, the 52-year-old version of A is plenty embittered, looking back at her hopeful young self and forward toward her senescence, but she is also of the opinion that her current moment is the best part of her life — atop the hill, in her words, able to see in both directions, and thinking, “what a view.” A playwright who knew he had figured out how to offer his female stars a tour de force — a gray eminence, delivering an opportunity for a master class for these doyennes of the stage — might say the same.\n\nShow \n \n \n Leave a Comment\n \n\n Theater Review: Three Tall Women, Three Great Actresses\n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1117,
  "archivePath": "data/archives/reviews/three-tall-women-2018/vulture--christopher-bonanos_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:41:18.687Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241224143844",
  "archiveOrgUrl": "http://web.archive.org/web/20241224143844/https://www.vulture.com/2018/03/theater-review-three-tall-women-three-great-actresses.html",
  "contentTier": "complete",
  "wordCount": 1117,
  "tierReason": "Full review text",
  "bwwExcerpt": "Although they move around while they do it, there's almost no action, barely a plot, and (apart from some unusual dynamics involving Miriam Buether's tricky, clever set design) little that could be called a special effect. They just stand and deliver, or sometimes sit and deliver, and nearly two hours later you realize that you may not have blinked for minutes at a time while they did it.",
  "bwwScore": 8
}
