{
  "showId": "two-strangers",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2025/11/20/two-strangers-carry-a-cake-across-new-york-a-tasty-slice-of-cake/",
  "publishDate": "2025-11-20T21:59:17",
  "fullText": "Robin Rainey (Christiani Pitts) and Dougal Todd (Sam Tutty) meet cute in Two Strangers (Carry a Cake Across New York), with book and score by Jim Barne and Kit Buchan, and Tim Jackson as director/choreographer.\n\nFuriously cheerful Dougal has just arrived in New York for the first time to attend the wedding of his 57-year-old father Mark, a man he’s never met. As the sister of 30-year-old bride Melissa, Robin has been assigned to collect Dougal at the airport but is determined to complete the task of seeing the short-of-money fellow to what turns out to be a Canal Street fleabag where she can leave him to his own devices.\n\nSo there they are, two strangers, one determined to see as many sights as he can, meet his father at the next-day nuptials before heading home the following day; the other to go about pre-wedding assignments while taking time off from the coffee-shop job she hates because she’s in her late twenties and has no better prospects.\n\nTheir current situations mean in musical-comedy terms that both Dougal and Robin immediately get to sing format-traditional I-want songs.  Dougal, who’s already delivered a sensational arrival number, “New York,” intones the sensitive “Dad” about his uncertainty confronting the man who deserted his mother and him many years earlier. Robin storms angrily through “What’ll It Be,” her daily on-the-job query to customers and her own question to herself about her future.\n\nWith the back-to-back tunes, bookwriters-songsmiths Barne and Buchan have established what theater people often refer to as the “the journey” on which the focal characters are about to travel.  Dougal and Rainey much more literally carry on their own journey.\n\nIt’s not just to visit the Statue of Liberty and other must-see New York City landmarks. They don’t get to many of those. They trudge more pointedly towards confronting each other and, more significantly, themselves. Robin only slowly realizes as the two of them carry the wedding cake from Brooklyn to its destination that he isn’t entirely a human ball-and-chain.\n\nOn the trek, Dougal realizes he must confront the uncertainties he’s masked with his naturally carefree manner. He discovers he can’t dismiss his darker aspects. The change for both intensifies after a boozy shopping spree pursued with Mark’s credit card, which is not meant to be used that way.\n\nIn other words, the musical isn’t entirely a happy-go-lucky romp. Ultimately and seriously, Two Strangers is written to demonstrate that problems, such as long-held secrets coming to light, can often be solved when two people attack them together. As such, the production—first seen in 2023 at North London’s fringe Kiln Theatre with subsequent stops in the West End and at Cambridge’s American Repertory Theatre—sneaks into town as an adroitly-wrought and probing winner.\n\nBeginning with Dougal’s explosive “New York,” the score is notable for several sometimes cute, sometimes pungent numbers. There’s an amusing duet “Under the Mistletoe,” surely appropriate this Yuletide season. There’s Dougal’s worried “About to Go In,” where he’s outside the church and suddenly reluctant to attend the ceremony. There’s Robin’s potent “He Doesn’t Exist,” the impetus for which won’t be revealed here as spoiler prone as well as her “This Year,” about continually living a disillusioned life. (Ted Arthur hotly conducts the five-member band perched on a balcony high above the players.)\n\nSpeaking of the stage look: the always clever Soutra Gilmour has placed two groups of different-sized metal valises one on top of the other, some of them eventually opening to disclose a closet or a cabinet or whatever, to represent luggage piling up at the carousel where Dougal claims his valise. For the rest of the musical, the luggage heaps become a New York City skyscape the actors can circulate and climb. Here’s an installation on which lighting designer Jack Knowles can illuminate colorful neon strips. Ingenious? You bet.\n\nThen there’s the acting, singing and brief dancing. Pitts’s performance, especially svelte and stylish in Gilmour’s night-at-the-Plaza gown, is mercurial throughout, making Robin’s initial annoyance and then intelligent concern thoroughly penetrating.\n\nAs to newcomer Tutty, who took home last year’s Olivier Award for Best Actor in a Musical for his take on the imported Dear Evan Hansen: His “New York” introduction makes it dazzlingly clear that a London musical leading-man hasn’t been carried in on the local theater tide since Tommy Steele in Half a Sixpence and Anthony Newley in The Roar of the Greasepaint-The Smell of the Crowd. Tutty’s appealing looks, pure voice, comic instincts, and obvious acting skills, and somehow resemblance to a living Teletubby make him the huge plus for a vital Two Strangers (Carry a Cake Across New York) run.\n\nTwo Strangers (Carry a Cake Across New York) opened November 20, 2025 at the Longacre Theatre. Tickets and information: twostrangersmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
