{
  "showId": "suffs-2024",
  "outletId": "deadline",
  "outlet": "Deadline",
  "criticName": "Greg Evans",
  "url": "https://deadline.com/2023/10/suffs-broadway-hillary-clinton-1235576710/",
  "nycTheatreExcerpt": "Suffs is enthralling, a smart, funny and beautifully sung musical that brings its chosen moment in history to life just as surely and confidently as Hamilton did for its. That the Suffs era is female-focused and so less known, in its details, to the general public than the doings of the Founding Fathers makes Shaina Taub's creation all the more potent.",
  "source": "nyc-theatre",
  "sources": [
    "nyc-theatre"
  ],
  "contentTier": "complete",
  "fullText": "Christopher Nolan Says DGA Unlikely To Accept 5-Year Deal With AMPTP; Guild Boss Talks AI, Healthcare & More Ahead Of Labor Talks \n \n \n\n \n \n \n \n\n \n \n \n\n Read the full story\n\n \n\n \n\n \n\n \n\n \n \n \n \n\n \n\n \n \n\n \n\n \n\n \n \n\n \n\n \n\n \n\n \n\n \n\n \n \n \n \n By Greg Evans\n\nSuffs, the Shaina Taub musical about the suffragist movement that had a sold-out, extended run Off Broadway last year, will move to Broadway this spring, with former Secretary of State Hillary Rodham Clinton and Nobel Peace Prize Laureate Malala Yousafzai on the producing team as co-producers.\n\nSuffs will open at Broadway’s Music Box Theatre on Thursday, April 18.\n\n“We are elated to welcome Secretary Clinton and Malala to our Suffs producing team,” said lead producers Jill Furman and Rachel Sussman. “As powerful role models, they each inspire millions around the globe in their rigorous fight for equality, and we are honored to have two such profoundly dedicated and courageous advocates supporting us on Broadway.”\n\nSuffs, which originated at New York’s Public Theater, is set in 1913 as the women’s movement is heating up in America, anchored by the suffragists — “Suffs,” as they call themselves — and their relentless pursuit of the right to vote. The synopsis: “Reaching across and against generational, racial, and class divides, these brilliant, flawed women entertain and inspire us with the story of their hard-won victory in an ongoing fight. So much has changed since the passing of the Nineteenth Amendment over a century ago, and yet we’re reminded sometimes we need to look back, in order to march fearlessly into the future.”\n\n“I am thrilled to join with the team behind Suffs in bringing Shaina Taub’s remarkable musical about the unsung heroes of the American women’s suffrage movement to the Broadway stage – where it rightly belongs,” said Clinton. “And I can’t wait for audiences to experience this soul-stirring slice of long-overlooked American history; both entertaining and enlightening, Suffs paints a vivid picture of the necessary battles for democracy and equality that are still being fought today.”\n\n“I loved Suffs when I saw it last year at The Public Theater,” said Yousafzai. “Many women around the world are still fighting for equality — and we draw inspiration and strength through learning the stories of those who came before us. I am honored to support Shaina and this production, and I hope Suffs echoes beyond Broadway to reach audiences worldwide.”\n\nSuffs features a book, music and lyrics by Taub, direction by Leigh Silverman (Violet), choreography by Mayte Natalio (How to Dance in Ohio), scenic design by Riccardo Hernández (Jagged Little Pill), costume design by Paul Tazewell (Hamilton), lighting design by Lap Chi Chu (Camelot), sound design by Jason Crystal (Sweeney Todd) with associate Sun Hee Kil (Choir Boy), orchestrations by Michael Starobin (Next to Normal), and music supervision and music direction by Andrea Grody (The Band’s Visit).\n\nCasting and ticketing information will be announced at a later date.\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nDeadline is a part of Penske Media Corporation. © 2026 Deadline Hollywood, LLC.",
  "isFullReview": true,
  "garbageFullTextNote": "Original file had Bachelor in Paradise content from wrong URL. Cleared.",
  "textWordCount": 504,
  "archivePath": "data/archives/reviews/suffs-2024/deadline--greg-evans_2026-02-02.html",
  "textFetchedAt": "2026-02-02T23:39:07.267Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "wordCount": 504,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-03T19:57:21.227Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is a press release announcing the Broadway transfer of Suffs with producer announcements and quotes, not a critical review of the show.; openai: The text is a press release about the Broadway production of 'Suffs' with no evaluative content or critique.; gemini: This is a press release announcing the show's Broadway transfer, not a review. It includes quotes from producers and a plot synopsis, but no critical evaluation.; kimi: This is a news article announcing the Broadway transfer and new producers (Clinton and Yousafzai), not a critical review. It contains promotional quotes and production credits but no evaluative criticism or recommendation from the journalist.",
  "promptVersion": "5.2.0"
}
