{
  "showId": "suffs-2024",
  "outletId": "entertainment-weekly",
  "outlet": "Entertainment Weekly",
  "criticName": "Andrea",
  "url": "https://ew.com/theater/suffs-review-shaina-taub/",
  "publishDate": "April 6, 2022",
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nSuffs review: A rousing and inspiring story of the women's suffrage movement\nThe cast Shaina Taub’s new musical Suffs implores you not to forget their fight, and then ensures that you won't.\n\nIf you sat through history class, you likely know the story of the women's suffrage movement — the struggles, the triumphs, the successes, and the failures that led up to the enactment of the 19th Amendment in 1920. But just because you already know a story doesn't mean that it doesn't need to be re-told. After all, there are always stories we haven't heard before — and there are always people we haven't heard enough about.\n\nThat's exactly what Suffs, the new musical brainchild of Broadway visionary Shaina Taub, exists to do: tell a story we haven't heard before about people we haven't heard enough about. Suffs, which opens tonight at the Public Theater and runs until May 15th, is sharp, engaging, and downright fun — as well as a reminder that even though we can laugh at jokes about how women are treated, we still have so much to fight for. Take the show's opening number, for example: a jovial, vaudeville-like song called \"Watch Out For The Suffragette!\" where all 19 members of the femme-identifying cast poke fun at their own gender while pretending to be men. It gets you tapping your feet and rocking in your chair, and it also makes you sober when you realize the implication of the lyrics.\n\nSuffs centers on a group of women central to starting the Suffragist movement: Alice Paul (Taub), Inez Milholland (Hamilton's Phillipa Soo), Lucy Burns (Ally Bonino), Doris Stevens (Nadia Dandashi), and Ruza Wenclawska (Hannah Cruz). But rather than just having these five women tell the story of their past, Suffs goes deeper. It brings in a number of historical players who are integral to the story and gives them a much-needed voice: women such as Chicago journalist Ida B. Wells (Book of Mormon's Nikki M. James), activist Mary Church Terrell (Cassondra James), and Carrie Chapman Catt, the leader of the National American Woman Suffrage Association (Come From Away's Jenn Colella).\n\nDirector Leigh Silverman has assembled a cast that is both racially and physically diverse (keep your eyes on ensemble member Jenna Bainbridge, who lights up the stage while making history as the first wheelchair user to originate a role at the Public.) With that, Suffs is able to unravel the complicated issues that are an inherent part of the women's suffrage movement, such as generational and racial divide. The show doesn't shy away from showing its characters as complex or flawed, seeking to humanize them by delivering messages through songs that ooze humor and heart. A particular stand-out is an intense and emotional solo from James called \"Wait My Turn\", where her character sings about being relegated to march in the back of the 1913 parade.\n\nSoo, best known for originating the role of Eliza Schuyler in Hamilton, grounds the story with her poignant voice, infusing Inez Milholland with emotion and vulnerability so striking, you're reminded of why she's so closely associated with another woman who wrote herself into the narrative. But while Soo may be what grounds the show, it's Taub who is the anchor. The composer and actress pours her entire self into Alice Paul, channeling everything from her fevered dedication to the movement to her desperate love for her friends.\n\nAs such, we feel intensely for Alice's every pushback and successful accomplishment, and it's a testament to Taub's passion for her work that she can infuse so much authenticity into the character she's playing. (Lest we leave out highlighting the other incredible women who deserve accolades, it should be noted that Bonino, Cruz, and Dandashi all claim their spotlight with superb performances — a true \"girl gang\" — while Colella as the \"old fogey\" Carrie Catt provides sharp dramatic flair.)\n\nSuffs is premiering in the same off-Broadway theater that Hamilton got its start at back in 2015, and it feels easy to draw similarities between Alice Paul and the \"ten dollar founding father.\" Both characters are identifiable as fighters who feel like they always have one last battle to win, who shoulder the burdens of knowing they were given a voice for a purpose, and who feel like they always have to be strong for everyone else. Both musicals are about an unsung hero who changed the course of history with help from people who believed in them and bolstered them along the way.\n\nBut where Alice differs from Alexander is that it's not just her story that hardly gets told. Whereas the world is familiar with the names of American presidents, you'd be hard-pressed to find someone who knows the names of Wells, Stevens, Burns, Wenclawska, Milholland, and Catt. Suffs is out to change that — to make these women as much of a household name as Hamilton's key players are now.\n\nTaub originally conceived the idea for the musical back in 2014 when producer Rachel Sussman (What the Constitution Means to Me) gave her a copy of Stevens' Jailed for Freedom. And like many shows that have recently opened, her long journey to bring Suffs to the stage included multiple pandemic delays — in addition to set redesigns and script revisions brought on by the politics of 2020 and the country's (as well as the theater industry's) burgeoning racial unrest.\n\nBut like the titular character she embodies nightly, Taub's perseverance and determination to see her story through has paid off. Suffs is finally here and hopefully, like the women whose stories are being told, it's here to stay. A",
  "isFullReview": true,
  "dtliExcerpt": "Suffs, which opens tonight at the Public Theater and runs until May 15th, is sharp, engaging, and downright fun — as well as a reminder that even though we can laugh at jokes about how women are treated, we still have so much to fight for.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 939,
  "archivePath": "data/archives/reviews/suffs-2024/entertainment-weekly--andrea_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:26:22.325Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee"
}