{
  "showId": "suffs-2024",
  "outletId": "the-wrap",
  "outlet": "THE WRAP",
  "criticName": "Robert",
  "url": "https://www.thewrap.com/suffs-off-broadway-review-shaina-taub-musical/",
  "publishDate": "April 6, 2022",
  "fullText": "Skip to content\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\t\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\t\t\n\t\t\n\n\t\t\n\t\t\t\n\n\n\t\n\n\t\n\t\t\n\t\t\t\n\t\t\t\tBy Robert Hofler\n\nApril 6, 2022 @ 7:30 PM\n\n\n\n    \n\t\n\t\t\n\t\n\n\t\n\t\n\n\n\n    \n\n\n\n\n\t\t\t\t\n\n\t\t\t\t\n\n\nShaina Taub begins her stirring new musical — which opened Wednesday at the Public Theater — with a big disclaimer and an even bigger wink. The all-female and non-binary chorus dresses in male drag and sings, &#8220;She&#8217;s planning to scold you for three hours straight/Get out now before it&#8217;s too late/Watch out for the suffragette!&#8221;\n\nYes, in grand style, Taub warns us right at the top that we’re in for a lecture on women’s rights, beginning with the very first women’s march on Washington, D.C., in the year 1913. Of course, the movement didn’t begin with that public display of force led by Alice Paul (played by Taub, who also wrote the book, music and lyrics). At the time, the National American Woman Suffrage Association was being led by Carrie Chapman Catt (Jenn Colella), who found Paul’s methods divisive. Soon, Paul and others split with NAWSA to form the more in-your-face National Woman’s Party.\n\nThis history reads like pretty dry stuff, but right from that beginning chorus, “Suffs” is anything but. This sung-through musical is rousing entertainment for all of its nearly &#8220;three hours straight,&#8221; and much of the delight comes from seeing how Taub manipulates the material to make it fun.\n\nThe major problem with turning civil-rights stories into movies or pieces for the theater is their black-and-white nature. It’s always the good guys versus the bad guys. Or in the case of “Suffs,” the good women versus the male jerks.\n\nTaub neatly solves this problem by leaving the men out of the story, with two notable exceptions: Woodrow Wilson (Grace McLean) and his assistant Dudley Malone (Tsilala Brock).\n\n“Suffs” works because Taub makes her show all about the women, and she makes those women committed but very flawed individuals. Let’s not call them cat fights, but “Suffs” is filled with rivalries between the radical Paul and the much more establishment-minded Catt. Early in their disagreements, a controversy emerges about where to put the African-American leaders of the movement in that first women’s march. Black icons like Mary Church Terrell (Cassondra James) and Ida B. Wells (Nikki M. James, shedding her ingenue image to emerge as the show&#8217;s real matriarch), a founding member of the NAACP, had no interest in being pushed aside or told yet again to wait. Intriguingly, the conflict between Terrell and Wells reflects the same conservative-progressive pull going on among the white leaders of the suffragist movement. (&#8220;Suffragette&#8221; is considered derogatory.)\n\nAnd then there’s the Gloria Steinem of the early 20th century. At that first women’s march, the glamorous Inez Milholland (Phillipa Soo) gets to lead the parade riding a big white horse. Like many contemporary leaders, the main characters of “Suffs” managed to find ways to get their pictures taken and promote the cause. And when Milhholland disrupts her feminist duties to go on a honeymoon, the unmarried Paul becomes more than a little jealous. Other same-sex longings keep bubbling up from under the political surface. Paul’s hardworking comrade Lucy Burns (Ally Bonino) tires of being treated like a secretary in the poignant &#8220;Lucy&#8217;s Song.&#8221;\n\nEven in a musical about suffragists, the Devil gets all the best lyrics. McLean pulls off a real Kate McKinnon with her inspired take on Woodrow Wilson. She’s devastatingly funny in her send-up of toxic masculinity without ever getting low-down nasty. McLean neatly floats above Taub’s lyrics that put men in one box and women in another out of the spotlight.\n\nAs a performer, Taub resembles a young Fran Lebowitz without the snark. Her greatest achievement here is a terrific book that takes a sprawling subject and not only gives it real dramatic cohesion but uses recitative for startling economic effect. Too often there’s not enough contrast between the recitative and the songs. It’s what Stephen Sondheim referred to as pouring &#8220;molasses over a score,&#8221; his reason for eschewing recitative. Great opera composers made it work. Sondheim, for all his talent, did not possess the gift of melody that came so easily to Bellini, Verdi (whom Sondheim trashed), Puccini and a bunch of other Italians.\n\nSpeaking of Puccini, he also wrote an all-female opera. “Suor Angelica,” set in a convent, is as much about female repression as “Suffs&#8221; concerns female liberation. There’s a reason why the great verismo composer made his big confrontation in “Suor Angelica” a showdown between a soprano and a contralto: The contrast in voices ignites vocal fireworks. In “Suffs,” the 20 women on stage seem all to be singing within the same octave, the choral writing being monochromatic to the extreme. Fortunately, Taub delivers as a composer when she must, especially in the second act when the light tone turns very dark as Paul and others are thrown in jail, go on a hunger strike and are threatened by fascistic psychiatrists. It&#8217;s the stuff of grand opera.\n\n“Suffs” also sparkles around its edges with supporting roles that sometimes stop the show. They include Aisha de Haas’ moneybags patron, Hannah Cruz’s Broadway-bound proletariat and Brock&#8217;s Malone, a real-life official in the Wilson administration who became a powerful advocate for women&#8217;s suffrage and other progressive causes.\n\nAs director, Leigh Silverman is a master general marshaling all the disparate and competing forces of this complex story. Building on the strong material given her, Silverman manages with her talented actors to present at least a half dozen fully developed characters on stage. How many other musicals have ever achieved such a feat? (The opening night performance was canceled after Taub and other cast members tested positive for COVID.)\n\nNow, about that title “Suffs.” It sounds like a new line of perfumed paper products from Kleenex. Why not just go with “Suffragists”? Even “Get Out the Vote” is a better title.",
  "isFullReview": true,
  "dtliExcerpt": "This history reads like pretty dry stuff, but right from that beginning chorus, “Suffs” is anything but. This sung-through musical is rousing entertainment for all of its nearly “three hours straight,” and much of the delight comes from seeing how Taub manipulates the material to make it fun.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 963,
  "archivePath": "data/archives/reviews/suffs-2024/the-wrap--robert_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:31:17.226Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250521154007",
  "archiveOrgUrl": "http://web.archive.org/web/20250521154007/https://www.thewrap.com/suffs-off-broadway-review-shaina-taub-musical/"
}