{
  "showId": "suffs-2024",
  "outletId": "time-out-new-york",
  "outlet": "Time Out New York",
  "criticName": "Raven Snook",
  "url": "https://www.timeout.com/newyork/theater/suffs-review-public-theater-musical-feminism-shaina-taub",
  "publishDate": "April 6th, 2022",
  "fullText": "Although musical theater often celebrates women, few shows have turned the spotlight on feminism itself. Shaina Taub helps fill that gap with the artful and inspiring historical epic Suffs. A formidable quintuple threat, Taub wrote the show's songs and script—which chronicles the years that preceded the passage of the 19th Amendment, when American women ostensibly achieved the right to vote—and also holds center stage as the single-minded activist Alice Paul, who cofounded the National Woman's Party and helped mastermind such pivotal events as the Woman Suffrage Parade and the Silent Sentinels protests in Washington, DC. On Mimi Lien's imposing set of columns and mutable stairs, a diverse ensemble—all women or nonbinary—performs a catchy mix of jazz, Tin Pan Alley and pop earworms. The expansive narrative centers mainly on Paul and her young, snappy and hungry cohorts: no-nonsense Lucy Burns (Ally Bonino), fiery union organizer Ruza Wenclawska (Hannah Cruz), savvy socialite Inez Milholland (Phillipa Soo) and recent college grad Doris Stevens (Nadia Dandashi). Together they embrace radical action while pushing against an older feminist guard represented by the genteel and morally flexible Carrie Chapman Catt (Jenn Colella). That's a lot of groundbreaking to cover, but director Leigh Silverman and choreographer Raja Feather Kelly keep the movement moving. There are rousing anthems (and lots of them), parodies of anti-suffrage songs and several delicious vaudeville vignettes in which Grace McLean gleefully sends up President Woodrow Wilson. If Suffs sounds reminiscent of another diversely cast historical juggernaut with Phillipa Soo that started at the Public Theater—there's even a song about not being in the room where it happened—the similarities are largely superficial. Taub, whose versions of As You Like It and Twelfth Night have been crowd-pleasers at Shakespeare in the Park, composes in her own enchanting style and vernacular. Suffs is remarkably easy to follow as it presents its sheroes in all their imperfect glory, exploring the ideological, generational and racial divides that persist to this day in feminist politics. Although the show is nearly three hours long, not every pioneering woman gets her due. The production works hard to spotlight actors of color, but the Black activists Ida B. Wells and Mary Church Terrell—beautifully embodied by Nikki M. James and Cassondra James, respectively—feel sidelined, giving Wells' stirring solo \"Wait My Turn\" an unfortunate double meaning. Yet there's much to admire and enjoy in Suffs, which may well have a brilliant future ahead of it. Like its protagonists, it's a progressive work in progress. Suffs. Public Theater (Off Broadway). Book, music, and lyrics by Shaina Taub. Directed by Leigh Silverman. With Taub, Phillipa Soo, Jenn Colella, Nikki M. James, Grace McLean, Ally Bonino, Cassondra James, Hannah Cruz, Nadia Dandashi. Running time: 2hrs 45mins. One intermission. Follow Raven Snook on Twitter: @ravensnookFollow Time Out Theater on Twitter: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page Suffs | Photograph: Courtesy Joan Marcus Been there, done that? Think again, my friend. By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. Thanks for subscribing! Look out for your first newsletter in your inbox soon! All kids under 18 can watch a Broadway show for free this February 15 beautiful pictures of NYC under snow By 2030, NYC landlords may be required to provide air conditioners in all units These enormous inflatable dogs will cruise down Manhattan streets this February The best things to do in NYC this weekend Discover Time Out original video",
  "isFullReview": true,
  "showScoreExcerpt": "\"4/5 stars! An artful and inspiring historical epic...'Suffs' is remarkably easy to follow as it presents its sheroes in all their imperfect glory, exploring the ideological, generational and racial divides that persist to this day in feminist politics. Although the show is nearly three hours long, not every pioneering woman gets her due...Yet there's much to admire and enjoy.\"",
  "showScoreUrl": "https://www.show-score.com/broadway-shows/suffs",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 593,
  "archivePath": "data/archives/reviews/suffs-2024/time-out-new-york--raven-snook_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:33:10.716Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}