{
  "showId": "cult-of-love-2024",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Jesse Hassenger",
  "url": "https://www.theguardian.com/stage/2024/dec/12/cult-of-love-review-broadway-play",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2024/dec/12/cult-of-love-review-broadway-play",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Shailene Woodley, Christopher Sears, Rebecca Henderson and Zachary Quinto in Cult of Love. Photograph: Joan MarcusView image in fullscreenShailene Woodley, Christopher Sears, Rebecca Henderson and Zachary Quinto in Cult of Love. Photograph: Joan Marcus This article is more than 1 year oldReviewCult of Love review – Christmas descends into chaos in smart Broadway playThis article is more than 1 year oldHayes Theatre, New York City\n\nLeslye Headland’s 2018 play makes for a tense and timely pre-holiday watch with a starry cast, including Shailene Woodley and Zachary Quinto, giving it their all\n\nIn Cult of Love, the new play from Leslye Headland, four now-grown, semi-estranged siblings return to their childhood home for Christmas, and are confronted by a possibly ailing father, as well as various interpersonal disappointments and conflicts. That is all to say that yes, the set-up recalls Wes Anderson’s Christmas-adjacent classic The Royal Tenenbaums, and that’s even before one character practically quotes Anderson’s movie, petulantly asking the Dahl family matriarch “Why is she allowed to do that?” when learning that one sibling, along with her husband and baby, will be staying at the parents’ cozily lit, seemingly well-appointed Westchester home indefinitely. (Margot Tenenbaum demanded to know the same thing when Chas returned home with his young sons.)\n\nRead moreBut by the end of this one-act dramedy, Headland’s first Broadway production, comparisons to the superficially similar earlier film fall away with a decidedly different ratio of bitter to sweet. Cult of Love is different, too, from the movies Headland herself has written and directed: the caustically funny Bachelorette (adapted from her own play), and the gentler but no less hilarious rom-com Sleeping with Other People; this one has less banter and fewer zingers by design (though plenty of laughs remain). Oddly and interestingly, the play, first performed in 2018, shares more common ground with The Acolyte, Headland’s conspicuously underrated Star Wars TV series that sent certain fans into paroxysms of discomfort earlier this year before Disney acquiesced with a cancellation. That YA-skewing space fantasy addressed competing belief systems and the sometimes-thin line between loyalty and fanaticism. The characters in Cult of Love face a similar conflict, where a family can be as variously binding, toxic, loving and difficult to escape as any religion. Or cult.\n\nAt first, the religious roots of the Dahl family appear relatively innocuous. The show is dotted with musical performances – most overtly religious songs, but alongside snippets of pop tunes like White Winter Hymnal by Fleet Foxes, or a fleeting sample of Creep by Radiohead – by some combination of the patriarch Bill (David Rasche) on piano, the eldest son Mark (Zachary Quinto) on banjo or guitar, and the youngest sister Diana (Shailene Woodley) on beatific vocals, joined by the older sister Evie (Rebecca Henderson) as their mother Ginny (Mare Winningham) looks on, enjoying the togetherness and living in denial about everything else. Indeed, these impromptu singalongs seem to be the only real harmonies that the characters can return to, as if snapping into a trance.\n\nOutside the music, tensions rise: Evie correctly feels that some family members don’t know how to behave around her and her new wife, Pippa (Roberta Colindrez), who is spending Christmas with the Dahls for the first time. Mark’s wife, Rachel (Molly Bernard), meanwhile, is an old hand at it and hasn’t grown to find the experience any more pleasant (“You get used to it,” is the best she can offer to Pippa). No one’s eaten dinner yet, because they’re all waiting for the arrival of the younger son Johnny (Christopher Sears), a recovering addict – which means they’re also waiting on pins and needles to see if he shows up at all. Throughout, the grown children try to figure out how to talk about Bill’s obviously failing mental faculties, which Ginny refuses to even acknowledge. The director, Trip Cullman, evokes both the hominess and strangeness of a visit home, no small feat when dealing with a single stage set.\n\nMany of the Dahl family problems – individually familiar, and even, with the material involving dementia and drug addiction, bordering on cliche – circle back to religion. Not the failure of one in particular, but what amounts to a series of schism in the family’s own doctrine: some members, most vehemently Diana and her husband, James, (Chris Lowell), have kept their Christian faith; others have extricated themselves in theory but perhaps not in practice. Headland captures the circular, overlapping, interrupting dialogue of a loving but incompatible family, and at times the sheer cacophony poses a challenge for the actors; at the press preview, a couple of them seemed to stumble over interlocking lines. But the performances are uniformly excellent nonetheless, with Woodley particularly fearless in terms of making the seemingly sweet Diana at once more pitiable and less likable than she initially appears. If anyone gets shortchanged, it’s Quinto, playing a part that’s positioned as a lead but often recedes into the background, as if Headland isn’t fully certain who Mark is.\n\nMaybe that uncertainty is part of the design, however; Mark isn’t sure who he is, either. Cult of Love is at least in part about how deeply family ties can become embedded in our identities, even if it happens against our will, and/or outstays its welcome – hence the cult comparison, never over-explicated in the text of the play itself, but a brilliant running metaphor that echoes after the final curtain. Headland’s work as a playwright reflects her broader interest in the social components of religion; this play is the final entry in her Seven Deadly Sins cycle, each work addressing (if sometimes obliquely) a particular transgression. As such, she finds herself in an awkward position: Cult of Love is designated to represent the sin of pride, yet it’s a work to be proud of, nonetheless.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 986,
  "archivePath": "data/archives/reviews/cult-of-love-2024/guardian--jesse-hassenger_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:17:07.825Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "duplicateTextOf": "guardian--adrian-horton.json",
  "contentTier": "complete",
  "wordCount": 986,
  "tierReason": "Full review text"
}