{
  "showId": "hello-dolly-2017",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "https://dougmarino.blogspot.com/2017/07/hello-dolly.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"What more could you ask for in a decadent evening at the theatre?...Murphy didn't let me down with her spunk, pluck, elegance, and raw talent for playing a character. 'Wow, wow, wow' is an understatement when it comes to this show and this production does not disappoint—the lighting, the sets, the costumes and color along with the music all contribute to the nonstop feeling of exuberance and joy this show brings to the audience.\"\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 288,
  "archivePath": "data/archives/reviews/hello-dolly-2017/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:36:46.642Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 288 (min: 300)"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Wow, Wow, Wow. Dancing waiters, gorgeous gowns with gloves, gorgeous sets, fun, frivolity, and a magnificent score by Jerry Herman! What more could you ask for in a decadent evening at the theatre? Well, it only gets better when you add the delicious (this July only) Donna Murphy (Dolly Gallagher Levi), the fun and wacky David Hyde Pierce (Horace Vandergelder), the dapper and debonaire Gavin Creel (Cornelius Hackl), the darling and dashing Taylor Trensch (Barnaby Tucker) and the delightful Kate Baldwin (Irene Malloy) along with an ensemble the size of a small town. This classic made famous by the indomitable Carol Channing roars back to life on Broadway this spring to pure delight. Sure, the show is old fashioned, but isn't this just what the doctor ordered these days? The characters are silly, the songs are lush, and the dancing is delicious. Dolly plods on thru to get her man and makes a few matches along the way from Yonkers to New York City. I opted to see Ms. Murphy on purpose and she didn't let me down with her spunk, pluck, elegance, and raw talent for playing a character. Wow, Wow, Wow is an understatement when it comes to this show and this production does not disappoint - the lighting, the sets, the olios (canvases with murals painted on them), the costumes and color along with the music all contribute to the non-stop feeling of exuberance and joy this show brings to the audience. When we get to the title number in Act II the audience has already contemplated an ovation twice before and at this point it is virtually un-stoppable. Dolly, whether Ms. Murphy or Ms. Midler, is indeed back where she belongs. Wow, Wow, Wow!",
  "_showNotMentionedDiscoveryAttempted": true
}
