{
  "showId": "hello-dolly-2017",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2018/02/22/hello-dolly-bernadette-peters-is-a-divine-mrs-levi/",
  "publishDate": "2018-02-22T20:00:54",
  "fullText": "How do you follow up the gorgeous and lucrative synergy produced by pairing Bette Midler and Dolly Gallagher Levi? Not, if you’re smart, by trying to repeat it. Midler’s Tony Award-winning turn in Jerry Zaks’s exuberant Broadway revival of Hello, Dolly! was that rare instance of a performer and character, both already larger than life, providing mutual inspiration—not just goin’ strong, but growing stronger under each other’s influence.\n\nThe gale-force of will that the Divine Miss M brought to Mrs. Levi isn’t a quality you’d necessarily associate with Bernadette Peters, who stepped into the role after Midler’s departure in January. Though also a natural and beloved stage animal—with far more musical theater experience than Midler—Peters is a more delicate presence; even at 70, she retains the dainty beauty (and some of the kittenish sexiness) that allowed her to play quirky ingenues well into middle age.\n\nBut as Peters proved with her revelatory take on Momma Rose, in Sam Mendes’s 2003 production of Gypsy, there’s some steel beneath that fair skin. Here, as in that production, she takes a character legendary for her outsized resilience and also emphasizes both the feminine wiles that have served her and the pathos in her journey. And with Dolly, a widowed matchmaker determined to finally find happiness and stability again in her own life, Peters has plenty to work with.\n\nMidler, too, mined the poignance in Jerry Herman’s ravishing score and Michael Stewart’s book, but differently. When her Dolly addressed her late husband, asking his permission to move on, Midler’s hearty warmth and lusty wit underlined the enduring connection between them. In Peters’ hands, Dolly seems more fragile, and very much alone; when she sings, in “Before The Parade Passes By,” “I’m gonna get some life back into my life,” the lyric is as much a plea as it is a declaration.\n\nThat’s not to say the performance is out of sync with the buoyant tone Zaks has set for this most joyful of musicals. Long the most reliably adorable of leading ladies, Peters brings her own sweetness and warmth to the role, and her own comic panache. Like Midler, she has the audience eating out of her hands from her entrance; but where her predecessor milked applause and guffaws, playing shamelessly (and delightfully) to the crowd, Peters, an instinctive team player after decades in this most collaborative of art forms, gets her biggest and worthiest laughs engaging other cast members.\n\nAnd what a cast it is. Gavin Creel won a well-deserved Tony Award and Kate Baldwin a nomination for their effortlessly charming, beautifully sung portrayals of Cornelius Hackl and Irene Molloy, who find love as a result of Dolly’s good-hearted conniving; the eclectic Santino Fontana, a winning lead in several musical productions, steps into the role of Cornelius March 13.\n\nVictor Garber has replaced David Hyde Pierce as that (ultimately) lovable skinflint Horace Vandergelder, Cornelius’s unyielding boss and Dolly’s credulous client. In their first scene together, as Dolly prepares to whisk Horace away from his Yonkers store and off to New York City—ostensibly to bond with the widowed Irene, though we know Dolly has different plans entirely—Garber and Peters manage the easy, playful rapport you’d expect of two old pros known for their generosity. Garber’s Horace, though not as dry than Pierce’s, has his own delectably deadpan moments, and the actor traces the grumpy miser’s progress under Dolly’s glow just as winningly.\n\nOther recent additions to Dolly’s cast include Broadway newcomers Charlie Stemp and Molly Griggs, respectively cast as Cornelius’s colleague and pal, Barnaby Tucker, and Irene’s, Minnie Fay, who pair off as well. Stemp is a real find, a spry, athletic dancer who’s also wonderfully funny capturing his 17-year-old character’s gee-whiz artlessness. Griggs’s Minnie is an appealing foil, wry and decidedly more knowing; when Baldwin’s entrance at a recent performance was greeted with applause, Griggs, also on stage, pertly thanked the audience without missing a beat.\n\nIt goes without saying that Zaks’s production looks and sounds as unabashedly luscious as it did last spring, from Santo Loquasto’s sparkling sets and candy-colored costumes to the ensemble’s robust singing and dazzling execution of Warren Carlyle’s choreography. When the nattily dressed staff at Harmonia Gardens gathers to welcome Dolly home, you can still sense the chorus members’ tingling pride as a stage legend saunters in their midst. However doll-like her Dolly may be in appearance or affect, Peters is a force that no one could, or would want to, deny.\n\nHello, Dolly! opened April 20, 2017, at the Shubert Theatre, with Bernadette Peters officially debuting on February 22, 2018. Information and tickets: hellodollyonbroadway.com.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial"
}
