{
  "showId": "hello-dolly-2017",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/02/22/hello-dolly-peters-as-the-pluperfect-kewpie-dolly/",
  "publishDate": "2018-02-22T20:00:59",
  "fullText": "The resplendent production of Hello, Dolly! at the Shubert Theatre remains a living and breathing representation of the power of Golden Age American musical comedy. Not as feel-good nostalgia or a lovingly curated museum piece, heaven forbid; but as a raucous, pull-you-in-and-leave-you-prostrate-with-laughter joyride. The immediate question of the evening, perforce, must be how revered musical comedy-babe Bernadette Peters fares in the shoes (and hats) devised for that comic force of nature formerly known as the Divine Miss M. Answer: We’ll let you know when we wipe clear our blurry eyes and stop laughing.\n\nIf Midler is a fabled comic force, Peters is indeed a musical comedy doll. Not in a sexist manner, mind you; something of a Kewpie doll (which was a cupid-derived cherub, initially devised as a cartoon character in 1909 and memorialized as a popular toy). A child actor, Peters began her musical comedy career at ten as the little girl neighbor in The Most Happy Fella in 1959; achieved widespread acclaim for her wickedly wide-eyed off-Broadway parody of Ruby Keeler in the 1968 Dames at Sea, and was a full-fledged Broadway star the following year (albeit in the one-night-only fiasco, La Strada). Thus, she has been around somewhat longer than the two-year-older Midler, who first achieved notice as a bathhouse chanteuse in 1970.\n\nThis musical-comedy-in-her-plasma DNA sets Peters’ Dolly apart. Dolly Gallagher Levi has walked down that legendary Harmonia Gardens staircase many, many times since the divine Carol first made her entrance to the chorus boy fanfare in 1964. Watching Peters do it, there was something undeniably different although you couldn’t quite qualify it until she started parading around the ol’ passerelle (or ramp around the orchestra pit, to you). Channing was a starry-eyed innocent, amazed at the reaction; Midler was the beloved comic icon, lapping it up; and Donna Murphy, who did an excellent job spelling Midler two times a week throughout her run, was out there not as a star personality but as an actor representing the embodiment of Dolly-the-character herself.\n\nWhen Peters makes that second act entrance-to-end-all-entrances, something else jumps to the fore: wide-eyed, giddy, lemme-do-it-again joy. Here we have the kid (yes, at 70) at the peak of the roller coaster, bracing for the wind in her face just before the descent—and then racing around for another turn, and another! Other Dollys have brought a multitude of emotions to the role, most usually with success; but Bernadette on the catwalk is a musical comedy dream, not only for theatergoers with heart-in-mouth but seemingly for the performer herself.\n\nLet us mention in passing that the production remains the height of jaw-dropping elegance. Dolly was the greatest commercial hit of its day, yes, but few have ever placed it in Broadway’s most rarified class (South Pacific, Guys and Dolls, Gypsy, Sweeney Todd et al). The charms of the show, over many years and many productions, seemed to fade until last April, when we realized that all the Jerry Herman-Michael Stewart musical needed to shine was impeccable showmanship. Director Jerry Zaks and choreographer Warren Carlyle combined to create a perfect musical comedy world, with designer Santo Loquasto bursting the toy-theater box with an endless display of exuberantly-rendered canvas-and-flats along with a cotton-candy world of froth and tutti frutti hued costumes.\n\nThis Dolly remains the visual and comical banquet it was. Along with the star, cast changes include Victor Garber as an irascibly weary Vandergelder and the up-and-coming London song-and-dance farceur Charlie Stemp as Barnaby Tucker. The latter deserves a couple of paragraphs of his own; let’s just say that he is something of a combination of Ray Bolger, Jim Dale and—somehow—James Corden, and fills the stage whenever possible with exuberantly exaggerated dance steps and wall-to-wall teeth.\n\nBerlin once wrote a song for Jolson called “Let Me Sing and I’m Happy.” It’s that very emotion that we get when Kewpie doll Bernadette in the towering red headdress—face pale as baby powder, with a scarlet smear around the lips—takes her cue and sashays around the orchestra while everyone from the pit to the balcony goes wild.\n\nHello, Dolly! opened April 20, 2017, at the Shubert Theatre, with Bernadette Peters officially debuting on February 22, 2018. Information: hellodollyonbroadway.com.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars"
}
