{
  "showId": "hedwig-and-the-angry-inch-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2014/04/23/theater/hedwig-and-the-angry-inch-stars-neil-patrick-harris.html?ref=theater&gwh=2032BE266AE0925D15136B44FB84556D&gwt=regi",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/04/23/theater/hedwig-and-the-angry-inch-stars-neil-patrick-harris.html?ref=theater&gwh=2032BE266AE0925D15136B44FB84556D&gwt=regi",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "bwwExcerpt": "Do not be alarmed by recent reports that Neil Patrick Harris, an irresistibly wholesome television presence, has fallen deeply and helplessly into the gap that separates men from women, East from West, and celebrity from notoriety. There's no need to fear for his safety, much less his identity. Quite the contrary. Playing an 'internationally ignored song stylist' of undefinable gender in'Hedwig and the Angry Inch,' Mr. Harris is in full command of who he is and, most excitingly, what he has become with this performance. That's a bona fide Broadway star, the kind who can rule an audience with the blink of a sequined eyelid...And while Mr. Harris may let you see him sweat as he struts, slithers and leaps through this shamelessly enjoyable show, rousingly directed by Michael Mayer ('Spring Awakening,' 'American Idiot'), he never makes it feel like heavy lifting.",
  "bwwScore": 9,
  "fullText": "https://www.nytimes.com/2014/04/23/theater/hedwig-and-the-angry-inch-stars-neil-patrick-harris.htmlShare full articleAdvertisement\n\nDo not be alarmed by recent reports that Neil Patrick Harris, an irresistibly wholesome television presence, has fallen deeply and helplessly into the gap that separates men from women, East from West, and celebrity from notoriety. There’s no need to fear for his safety, much less his identity. Quite the contrary.\n\nPlaying an “internationally ignored song stylist” of undefinable gender in “Hedwig and the Angry Inch,” Mr. Harris is in full command of who he is and, most excitingly, what he has become with this performance. That’s a bona fide Broadway star, the kind who can rule an audience with the blink of a sequined eyelid.\n\nYou may have assumed that Mr. Harris had won that status already. As the indefatigably charming M.C. of the Tony Awards in recent years, he has given life and luster to a creaky ceremony. And he’s logged hours on Broadway stages before, notably in the 2004 revival of the Sondheim-Weidman musical “Assassins.”\n\nBut he has never had to carry a full-scale production on his shoulders, as he does in “Hedwig,” John Cameron Mitchell and Stephen Trask’ s 1998 rock musical memoir, which opened at the Belasco Theater on Tuesday night. And while Mr. Harris may let you see him sweat as he struts, slithers and leaps through this shamelessly enjoyable show, rousingly directed by Michael Mayer (“Spring Awakening,” “American Idiot”), he never makes it feel like heavy lifting.\n\nMr. Harris is toting more than his own persona — and a hefty assortment of diva wigs and costumes. He also carries the main responsibility for hoisting a taboo-flouting tale of life on the margins into the mainstream environs of Broadway. First staged in downtown Manhattan with Mr. Mitchell as its star, “Hedwig” tells the story of an East German “slip of a girlyboy” who becomes (almost) a woman, (almost) an American and (almost) a rock star.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 338,
  "archivePath": "data/archives/reviews/hedwig-and-the-angry-inch-2014/nytimes--unknown_2026-02-06.html",
  "textFetchedAt": "2026-02-06T16:17:09.104Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203906",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203906/https://www.nytimes.com/2014/04/23/theater/hedwig-and-the-angry-inch-stars-neil-patrick-harris.html?ref=theater&gwh=2032BE266AE0925D15136B44FB84556D&gwt=regi",
  "contentTier": "complete",
  "wordCount": 338,
  "tierReason": "Full review text"
}