{
  "showId": "hedwig-and-the-angry-inch-2014",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Unknown",
  "url": "http://variety.com/2014/legit/reviews/broadway-review-hedwig-and-the-angry-inch-starring-neil-patrick-harris-1201161271/",
  "playbillVerdictUrl": "http://variety.com/2014/legit/reviews/broadway-review-hedwig-and-the-angry-inch-starring-neil-patrick-harris-1201161271/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Harris channels Iggy Pop and Lou Reed by way of the Ramones, not to mention his inner Rockette, in this spectacular revival of the 1998 musical.\n\nThe screaming starts when a bespangled Neil Patrick Harris parachutes onstage in “Hedwig and the Angry Inch” and doesn’t stop until he’s back in his dressing room. That’s the kind of rock-star performance he gives in this spectacular revival — helmed with fabulous flash by Michael Mayer — of the 1998 musical (and later movie) by John Cameron Mitchell (book) and Stephen Trask (music & lyrics). Harris’ Hedwig is an imperfectly transformed transgender woman who grew up in East Berlin before the wall came down, resplendent in the punk drag of a nihilistic rocker but still concealing a heap of hurt under her wig.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Industry' Season 4 Premiere Viewership Jumps 20% From Season 3 \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'White Lotus' Season 4 Casts Steve Coogan, Caleb Jonte Edwards\n\nAfter touching down in a totally trash outfit (costumer Arianne Phillips’ satirical sendup of punk sartorial style), Hedwig opens the show with a loudly defiant “Tear Me Down.” “I’m the new Berlin Wall,” she howls, “Try and tear me down!”\n\nAt which point, her flunky Yitzhak (Lena Hall, adoration pooling out of her eyes) provides some deadpan background on the Berlin Wall. With respect, she informs us that Hedwig, whose botched sex-change operation left her a woman with vestiges of manhood, is “like that wall, standing before you in the divide between East and West.” Or, as howling Hedwig would have it, “Enemies and adversaries / They try and tear me down!”\n\nSo now we know where we are, in a rock concert with political as well as psychosexual overtones. What fun! But Julian Crouch’s set had already tipped us off about that. A bizarrely imaginative art installation of broken brick walls, bombed-out buildings, charred automobiles and flying debris, this scene of carnage is supposedly the detritus left from “Hurt Locker: The Musical” (a war narrative with “explosions, negligible storytelling, camouflage and tits,” according to a mock program) that opened and closed at the same Broadway theater in one night — actually, during intermission.\n\nBefore he gets down to serious rocking, Harris slips into the storyteller mode that earned him accolades (and Emmys) for the four Tony Awards ceremonies he’s hosted. After acknowledging the history (and resident ghost) of the venerable Belasco Theater by licking the floor trod by Brando and the Barrymores, he tosses off a few topical jokes, including one stinker that’s probably still bouncing off the bricks in Shubert Alley.\n\nAfter establishing his bona fides as a raunchy raconteur, Harris picks up Hedwig’s hilariously sad story with a vengeance: her deprived boyhood in East Berlin, her mother’s mythic bedtime story stolen from Aristophanes (“The Origin of Love”), her deflowering by an American G.I. (“Sugar Daddy”), the unfortunate operation (“Angry Inch”), the husband who abandoned her in a Kansas trailer park (“Wig in a Box”), and finally her bottoming out (the standout, “Wicked Little Town”).\n\nBut for all the cleverness of the book and the pathos of Hedwig the character, this is a true rock concert. The band may be wearing fashionable glam-rock costumes rather than ripped T-shirts and shredded jeans and safety pins in their nostrils, but the music (and the anger fueling it) is closer to punk rock and more in step with Hedwig’s nihilist inclinations.\n\nIt’s astonishing how polished a physical performance Harris gives. Channeling his inner Rockette, along with Iggy Pop and Lou Reed by way of the Ramones, he carries off some advanced dance and acrobatic moves, while showing a lot of shapely leg. In “Hedwig’s Lament,” the diva returns to her constant complaint of being cut up into pieces — torn from her true love, from her musical partner, from her divided homeland, from her missing penis, from her beloved wigs. But in Harris’ bravura performance, she manages to integrate about 30 years of rock musical styles. Which ain’t peanuts.",
  "isFullReview": true,
  "textWordCount": 660,
  "archivePath": "data/archives/reviews/hedwig-and-the-angry-inch-2014/variety--unknown_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:49:53.422Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 660,
  "tierReason": "Full review text"
}