{
  "showId": "oedipus",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2025/11/13/oedipus-all-about-my-mother/",
  "publishDate": "2025-11-13T23:59:11",
  "fullText": "Everything is politics, as the saying goes. The phrase is most often attributed to George Orwell, though what he actually wrote is: “All issues are political issues, and politics itself is a mass of lies, evasions, folly, hatred and schizophrenia.” True in 1946, and true, I’d wager, in the 5th century B.C., when Sophocles wrote Oedipus Rex.\n\nAnd it’s most certainly true today, as we’re watching Robert Icke’s gripping, timelier-than-ever adaptation of Oedipus, now on Broadway after an Olivier Award–winning run in London with its original stars. What, you don’t remember the Sophocles play opening with a massive video screen showing Oedipus (the splendid Mark Strong) in the middle of a rousing campaign speech?\n\nFor those with theatrical projection fatigue, fret not: That brief clip merely serves to display Oedipus’ ample charisma and prove his electability. Icke’s strikingly modern adaptation sets the play on the eve of his election to high political office, inside his corporate-feeling campaign headquarters. A clock ticks brightly the background, counting the minutes and seconds until results come in—or until the truth comes out. Tensions are running high, especially since the candidate just vowed on camera to investigate the death of his predecessor, Laius; in the face of his opponent’s malicious attacks, he also promises he’ll release his birth certificate—much to the dismay of (the woman he believes is) his mother, Merope (Anne Reid).\n\nIcke—whose last Broadway outing in 2017 was an adaptation of Orwell’s 1984, which he cowrote and codirected with Duncan Macmillan—has retained the characters’ names and the core of Sophocles’ Oedipus Rex, but otherwise, he has completely rebuilt the centuries-old tragedy from the ground up. And when a play has endured for nearly 2,500 years, it can withstand an extreme home makeover. Even the merch is up-to-the-minute: The T-shirt, coffee mug, and even direct mailings are emblazoned with the grabby tagline “Truth is a mother**ker.\n\nOur hero’s unraveling begins with a visit from a blind prognosticator, Teiresias (Samuel Brewer), who somehow infiltrated campaign HQ. (In this political climate? Security, anyone?) “He’s one of them. The sect, the cult. The future-telling ones,” says Oedipus’ brother-in-law, Creon (John Carroll Lynch), who’s also his speechwriter, strategist, spokesperson, and all-around support system. Still in stumping-for-votes mode, Oedipus welcomes the stranger and brings him a chair. Most of the seer’s words are frustratingly vague: “I came to warn you.” However, he speaks what we all know to be true, even if no one else onstage does—that Oedipus killed Laius, that he’ll murder his dad, and that he’ll sleep with his mom.\n\nOf course, in the Sophocles version, Teiresias doesn’t show up unannounced—he’s summoned; and between the priests, oracle, and the chorus, those fateful predictions carry much more weight. Here, without those traditional trappings of Greek drama, his scene feels expository, as if to refresh us on the important plot points we may have forgotten years after reading the play in high school or college.\n\nHis 13-years-older wife, Jocasta (the staggeringly good Lesley Manville), puts no stock in any of the prophecies. “Look, every man has the f**king his mother dream at some point. It is par for the course,” she says. And there are some things she’d simply rather not make public.\n\nHer first husband, Laius—the very man who held the office for which Oedipus is running—was not a good person. Someone who should have been in prison, not politics. Jocasta describes him as “a rancid man” and “a dirty animal”; we can hear the disgust dripping from Manville’s voice. After he died, “when he became a dark-blue plastic bag heavy with fat and old meat, I did not cry a single tear for him.” As for the circumstances surrounding his death, they were, well, adjusted, for the sake of appearances. Somehow, Oedipus, seems genuinely surprised to learn that people lie in politics. “You know as well as I do that we live under blankets feathered with lies,” she tells him.\n\nAs Oedipus and Jocasta slowly chip away at each other to get to the naked truth, the set is stripped of its decor, piece by piece. The table and chairs where they had dinner with their children, Antigone (Olivia Reis), Polyneices (James Wilbraham), and Eteocles (Jordan Scowen), are carried away. The carpet is rolled up and hauled off. Campaign posters, Champagne flutes, candles—all gone. Once the countdown clock hits zero, the horrifying realization washes over the couple’s faces.\n\n“You see,” Teiresias told Oedipus. “And you wish you were blind.”\n\nOedipus opened Nov. 13, 2025, at Studio 54 and runs through Feb. 8, 2026. Tickets and information: oedipustheplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
