{
  "showId": "oedipus",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2025/11/13/oedipus-fate-comes-for-us-all/",
  "publishDate": "2025-11-13T23:58:35",
  "fullText": "An onstage clock ticks urgently, both literally and metaphorically, in Robert Icke’s updating of Sophocles’ thousands-years-old Greek tragedy. (Or, as the credits have it, “Created by Robert Icke, After Sophocles). Mark Strong and Lesley Manville deliver epic performances in this version that is as much political and psychological thriller as it is an examination of fate. While this Oedipus doesn’t fully succeed in translating the original’s poetic, grandiose style into modern terms, it provides a gripping theatrical experience that will be as much of a snob hit on Broadway as it was in London.\n\nIckes isn’t coy about comparisons to recent events in this adaptation, which begins with a campaign-style video in which Oedipus (Strong), running for office as the leader of an unnamed country, declares that he’ll soon be releasing his birth certificate to fully establish his identity. He also vows to investigate the death of the previous ruler Laius, to whose widow Jocasta (Manville) he’s now married.\n\nThe action is set in the politician’s sleek campaign office (designed by Hildegard Bechtler) on election night, where he’s eagerly awaiting the election results along with his brother-in-law/campaign manager Creon (the instantly recognizable, veteran character actor John Carroll Lynch, making his New York stage debut), his daughter Antigone (Olivia Reis), sons Eteocles (Jordan Scowen) and Polyneices (James Wilbraham), and, much to his surprise, his elderly mother Merope (Anne Reid, devastating), who has arrived without warning.\n\nJust as he’s settling in for a long evening, Oedipus is confronted by a blind homeless man, Teiresias (a striking Samuel Brewer), who offers dire pronouncements about Oedipus’ fate that the politician angrily denounces, ordering his security forces to remove the interloper. It’s no spoiler alert to reveal that Oedipus should have heeded his warnings.\n\nDuring the course of the next uninterrupted two hours, Merope periodically begs for Oedipus’ attention, as she has something very important to tell him. He’s too preoccupied to pay her any attention, reserving his energy for more pressing matters as performing oral sex on Jocasta. But when Merope finally gets the chance to explain that she is not fact Oedipus’ mother but rather found him as a baby abandoned in the woods, it set off a chain of tragic events that, well, put a whole new spin on his relationship with his wife. Or, As the show’s advertising campaign cheekily puts it, “Truth is a motherf**ker” (whoever came up with line that deserves a bonus).\n\nIckes cleverly weaves in subtle and not-so-subtle allusions to the source material throughout the evening, but even those unfamiliar with the original (shame on you for skipping class) will be able to enjoy the evening on its own melodramatic, if not exactly believable, terms. The modernistic writing feels a bit clunky at times, jarring uneasily with the play’s weighty themes. And the upbeat flashback coda that ends the evening feels bizarrely out of place, as if we didn’t already know that things had gone horribly wrong.\n\nBut if the events as depicted don’t prove convincing, the performances by the two leads more than make up for it. Strong delivers a typically forceful, commanding turn, using his virile physicality to make his character’s emotional tailspin all the more powerful. (It’s interesting that his last Broadway appearance, in Arthur Miller’s A View From the Bridge, also featured him in a modern form of Greek tragedy). And Manville is simply shattering, especially in her harrowing delivery of her monologue in which she describes her tragic past as the victim of abuse that led them all into this mess. After the truth of the relationship has been revealed, the two actors engage in physical interactions, both impassioned and seemingly casual, that are more eloquent than anything that’s been said.\n\nIckes’ staging mainly proves powerful throughout, from the digital clock in the background that counts down the time, not only to the election results but also the revelation of the truth that shatters the characters’ lives (unity of time, don’t you know), to such visual devices as having a team of workmen gradually stripping the office of its furniture, mirroring the losses they endure.\n\nOedipus opened November 13, 2025, at Studio 54 and runs through February 8, 2026. Tickets and information: oedipustheplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
