{
  "showId": "jagged-little-pill-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2019/12/05/jagged-little-pill-everythings-gonna-be-fine-fine-fine/",
  "publishDate": "2019-12-05T20:41:49",
  "fullText": "Jagged Little Pill, the landmark 1995 angsty, angry, no-shits-given Alanis Morissette album, has in 2019 become Jagged Little Pill, the angsty, angry Broadway musical that somehow has a sweetly happy ending.\n\nIronic, isn’t it?\n\nLess ironic: The musical, which opened tonight at the Broadhurst Theatre, is, like the album, surpassingly excellent, if also slightly flawed.\n\nWhat makes it so good? It’s the ideal exemplar of a certain sort of jukebox musical, one that hangs an artist’s catalogue onto a fictional story, often to laughable result. (See: Everyone from the lovelorn Spring Breakers of Escape to Margaritaville to the wandering cowboy of Ring of Fire.) Here, in the hands of Oscar-winning screenwriter Diablo Cody, Jagged Little Pill fashions a story with characters that are actually compelling: A modern, seemingly all-American, upper-middle-class family, in which all the members have their own problems. A cynical theatergoer, weary of this kind of jukeboxer, might well find himself surprised to be emotionally engaged in the story.\n\nPart of that is the power of Morissette’s songs. (She wrote the lyrics; she and Glen Ballard co-wrote the music.) A lot of that is Cody’s book, which not only tells a successful story, but also succeeds at a dialogue level, with witty exchanges and ingratiating self-awareness. (“Ironic,” performed as an English-class writing workshop, is interpolated with know-it-all high schoolers noting its lack of actual irony.) And it is lovingly directed by Diane Paulus (at whose American Repertory Theater it originated), with scenic design by Riccardo Hernández, costumes by Emily Rebholz, lighting by Justin Townsend, and especially seductively shit-kicking choreography from Sidi Larbi Cherkaoui that give the production a smooth, slightly dreamlike air.\n\nBut a huge part of its success is the sensational performances from the two young female leads, Lauren Patten and, in her Broadway debut, Celia Rose Gooding. It’s to some degree an ensemble piece, and all the characters’ songs come from the Morissette catalogue (not for nothing is the mom named Mary Jane, like the ninth track on JLP). But these two young women embody where those songs came from; they’re the Alanises, and they get the big anthems.\n\nGooding is Frankie, the adopted black daughter of the central family, the Healys. She’s a social justice warrior and a more-or-less closeted bisexual, dating Patten’s Jo at the play’s start and eventually hooking up with a seemingly nice boy in her class. She wrestles with her family’s privilege and her own blackness; she’s always felt out of place, despite her comfort, in white-bread Connecticut. Patten’s Jo — not Joanne; “I am not a fucking fabric store.” — is a butch lesbian in a religious family. She is even less comfortable in this jock-and-cheerleader world than is Frankie. Her “You Ought To Know,” after she’s been dumped by Frankie, is quite literally a show-stopper.\n\nAnd just what is that successful jukebox story? Ultimately, Jagged Little Pill is Next to Normal meets American Idiot — with, this being a story at least in part about today’s teens, a dose of Dear Evan Hansen thrown in for good measure.\n\nIt’s Next to Normal in that Mary Jane (Elizabeth Stanley) is a mess and trying to hide it (the jagged pill in question is today an opioid); Mary Jane’s relationship with dad, Steve (Sean Allan Krill), is falling apart; son Nick (Derek Klena) is idealized and perfect (although in this case alive); and Frankie is the mopey, challenging child. (Tony-winning Next to Normal composer Tom Kitt is this show’s orchestrator and arranger.) It’s American Idiot in that it is a full-tilt reconstruction of the songs, with a grunge-clad chorus always surrounding our present-day principals to remind us of the time and place from which the music came. And it’s Dear Evan Hansen in that it considers the consequential impact actions taken by high schoolers — especially social-media-enabled high schoolers — can impact the rest of their lives.\n\nOn the other hand, the same omnivorousness that allows one to see connections to so many antecedent shows can also result in a plot that seems overstuffed with hot-button issues, a very-special-episode on steroids. It’s impolitic but true: After the expository first act has introduced the keeping-up-appearances pressures of a wealthy suburb, the get-into-Harvard pressure of the same, the unhappy marriage with the workaholic dia, the pill-popping, the secret lesbianism, and the cool-kid peer pressure of high-school parties, when we get to the sexual-assault plotline, well, dayenu. And when, by the show’s end, all that angst has been wrapped up in a neat bow, everything restored to happy equanimity? Well, that seems a bit much, too.\n\nBut, then again, that’s sort of the point of Alanis, isn’t it? All those emotions she sings about, they’re all a bit too much. We ought to know.\n\nJagged Little Pill opened December 5, 2019, at the Broadhurst Theatre. Tickets and information: jaggedlittlepill.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "The musical, which opened tonight at the Broadhurst Theatre, is, like the album, surpassingly excellent, if also slightly flawed. What makes it so good? It's the ideal exemplar of a certain sort of jukebox musical, one that hangs an artist's catalogue onto a fictional story, often to laughable result.(See: Everyone from the lovelorn Spring Breakers of Escape to Margaritaville to the wandering cowboy of Ring of Fire.) Here, in the hands of Oscar-winning screenwriter Diablo Cody, Jagged Little Pill fashions a story with characters that are actually compelling: A modern, seemingly all-American, upper-middle-class family, in which all the members have their own problems. A cynical theatergoer, weary of this kind of jukeboxer, might well find himself surprised to be emotionally engaged in the story.",
  "bwwScore": 8
}
