{
  "showId": "jagged-little-pill-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2019/12/05/jagged-little-pill-alanis-morissette-lavishly-broadway-ized/",
  "publishDate": "2019-12-05T20:40:56",
  "fullText": "Alanis Morissette released “Jagged Little Pill,” her third album—the first released outside of her home country Canada—in 1995. It quickly became an international bestseller and, in today’s vernacular, a significant influencer. It’s no wonder that someone had the idea to run it up into a Broadway musical via Diane Paulus’ American Repertory Theater and a Houston try-out.\n\nIndeed, bursting—as the cliché goes—onto the scene in the 2019-2020 season when David Byrne’s American Utopia is raking it in and Girl from the North Country with a Bob Dylan score is on its way from the Public Theater, Jagged Little Pill is practically a question of what-took-so-long?\n\nWhatever, here it is, announcing itself with the kind of opening sound convulsion that’s becoming familiar in Great White Way houses where jukebox musicals are the marauding thing, although the above three entries are (only momentarily) lifting the genre into somewhat more sophisticated theatrical climes.\n\nDon’t fool yourself. Jagged Little Pill is at the accommodating Broadhurst for a lengthy run, thanks to the salivating Morissette fans and also thanks to the ultimate quality of the piece, which has a book by Diablo (Oscar for Juno screenplay) Cody and is directed by Paulus, who made much a few years back of the Pippin revival and the just-about-to-close Waitress transfer from screen to stage.\n\nThe observation the pair made on listening to “Jagged Little Pill” on vinyl, cassette or digitally reproduced is that one of Morissette’s themes—perhaps the most pertinent one—is  free-floating anxiety. (To be sure, many others as well have picked up on the angst rampaging through these pungent lyrics, insistent melodies and Morissette interpretations.)\n\nPaulus and Cody realized that the loose-limbed and persuasive singer-songwriter sees the world as rife with problems, many (most?) of them further exacerbated by current events. Their more or less shrewd move was to put the powerhouse “Jagged Little Pill” material into the tale of one contemporary family—so contemporary they’re practically on the cusp of tomorrow. They’re the Healy family—mom Mary Jane (Elizabeth Stanley), dad Steve (Sean Allan Krill), son Nick (Derek Klena) and daughter Frankie (Celia Rose Gooding).\n\nAnd if you think the choice of Healy for a surname is random, you’ve got another think coming. The Catholic Healys, introduced by Mary Jane reading her latest family Christmas letter, are not so jolly as reported but are actually in deep doo-doo. They need healing fast. Although if they came by it fast, there’d be no musical, and there is one here—with, among their severe problems, an especially provocative hitch that’s tenaciously snatched from recent events.\n\nThe Healys arrive at dysfunction relief slowly and painfully as their individual problems are pursued. Mary Jane, recovering from an automobile accident, is now addicted to painkillers Oxycodone and Fentanyl. (Oh, yes, Cody and Paulus have raided the headlines with a political and social vengeance.) Don’t forget as well that “Mary Jane” is the title of a “Jagged Little Pill” track—and a longtime alternate term for marijuana. While M. J., as her friends know her, plays the perfect mother, she’s been reduced to scoring drugs in back alleys.\n\nSteve, frustrated by a sexless and otherwise unsatisfactory marriage, spends hours at the office watching porn. Frankie, adopted and black, is unhappy about fitting into a white context while testing her sexuality with BFF and gender-bending Jo (Lauren Patten). Nick, an early acceptance at Harvard, is seemingly copacetic, but he eventually follows the  coming-undone pattern. He figures into the above-mentioned provocative twist, about which a more eye-popping revelation later.\n\nAs the unhealed Healys struggle with their inner demons and each other, they and a singing-dancing-playing-other-parts chorus deliver Morissette’s songs, enhanced by Glen Ballard’s co-written melodies with additional music by Michael Farrell and Guy Sigsworth. Tom Kitt has supervised the album’s leap to the stage, and he’s imaginatively arranged Morissette for solos and groups. (Notably, they all sing the lyrics clearly, where Morissette doesn’t consistently.) Bryan Perri conducts with a firm grip on the melodic verve. The Morrisette “You Learn” title and message goes a long way to explaining all.\n\nSo how is it that Nick gets himself in trouble? He goes to a party with good buddy Andrew (Logan Hart), who gets drunk and assaults unconscious family friend Bella (Kathryn Gallagher). Nick stands by, saying nothing, allowing a he-said-she-said situation to develop with not only a #MeToo resonance but something even more contemporarily potent.\n\nIf you’re reading this and thinking the harrowing plot turn is reminiscent of the Brett Kavanaugh-Supreme Court hearings, you’re thinking exactly what Paulus and Cody want you to think. No denying that—with the Morissette songs as the springboard—there’s everything here but the most up-to-date kitchen sink.\n\nIt could be said—and will be right here and now—that with Jagged Little Pill Paulus and Cody are contriving a bit too much. It could also be said that the excesses are somewhat offset by the stagecraft: Riccardo Hernández’s set with its high gliding panels on which Lucy Mackinnon aims neatly complimentary projections, Justin Townsend’s lights and Jonathan Deans’ sound, although the often rock-concert decibel level could be modified without artistic loss.\n\nUnsurprisingly, there’s choreography—lots of it—for which Sidi Larbi Cherkaoui is responsible. He’s working with a gang of supple dancers, among whom are a few who dance the inner feelings of the story’s worried women and execute their work with tense style. Too often, however, Cherkaoui indulges in the busy-busy hands movements that appear to be in vogue now.\n\nPaulus and Cherkaoui have the six principals on their toes throughout, each of whom is impressively committed to his or her role. While they nail every moment, there is one performance that threatens to dislodge the Broadhurst roof: Lauren Patten giving Morissette’s “You Oughta Know” all the sizzle that a Peter Luger steak used to have.\n\nAs this review winds up, readers may wonder what happens when wayward Andrew gets his hearing in court. It’s not given a final gavel, but the boy does succeed in one aspect: college admission.  For all we know, he’s off to Princeton and thereby on the Supreme Court track. Talk about jagged little pills for audiences to swallow.\n\nJagged Little Pill opened December 5, 2019, at the Broadhurst Theatre. Tickets and information: jaggedlittlepill.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2019/12/05/jagged-little-pill-alanis-morissette-lavishly-broadway-ized/"
}
