{
  "showId": "american-buffalo-2008",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Juan A. Ramirez",
  "url": "https://www.theatrely.com/post/american-buffalo-doesnt-tame-its-beast-review",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Am I spending too much time on the casting choices? Maybe, but it's not like Pepe's direction commanded my attention anywhere else throughout the hour-forty play. Apparently disinterested in the text, or in showing his directorial hand, he lets the cast wander about Scott Pask's purposely messy set without any ambition, or even pointed aimlessness. He also permits what few moments the script provides for contemporary contemplation - Rockwell's character angrily calling Fishburne's a racial epithet, for example - to go uncommented. This laissez-faire directing doesn't allow the second act's mounting troubles to build or release; a fight breaks out, sort of, it gets resolved, sort of, the play ends.",
  "bwwScore": 4,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-AMERICAN-BUFFALO-Opens-On-Broadway-Starring-Darren-Criss-Sam-Rockwell-and-Laurence-Fishburne-20220414",
  "fullText": "Sam Rockwell, Darren Criss, and Laurence Fishburne | Photo: Richard Termine\n\nFollowing the non-events after a junk shop owner begins to suspect the buffalo nickel he recently sold might be worth more than the amount paid, David Mamet’s American Buffalo has given a who’s who of actors great reasons to curse and yell at each other. There’s nothing wrong with plays in which not much happens, but with Laurence Fishburne, Sam Rockwell, and Darren Criss up for sale, there’s no reason for this Neil Pepe-directed revival to lowball an audience this badly.\n\nMamet, it should come as no surprise to anyone who has seen Rockwell’s last decade’s worth of projects, is a natural fit for the actor, who has built a career out of playing an impressive assortment of vile men. Here, he plays one of the shop’s employees, and the trio’s jumpiest, most paranoid member. Surprisingly, considering Mamet’s recent turn towards right-wing embarrassment, his work gives Rockwell a fair amount to chew on and, despite the too-loud plaid pants costume designer Dede Ayite has him wear, the actor whips up something of an interesting critique as well as the production’s most watchable element.\n\nHis chemistry with the more placid Fishburne is stellar, though the older actor’s commanding voice does most of the heavy lifting for him. That recognizable boom carries him through the finish line, despite what is an otherwise uneven performance. He’s never not believable as the shop’s weathered owner, but mostly just stands around waiting for something to do.\n\nAs the junk shop’s young, seemingly naive gofer, Criss is profoundly miscast, despite trying his best. Not only do his eternally boyish good looks not fit his character’s skeeviness, but the role is simply not built to be played by a star. His white-toothed-wattage strips the role of any of the mystery it requires — of course, the innocent one winds up not being all that simple — and it doesn’t help that he’s chosen a Danny Zuko crooked grin and voice to assist with the play’s necessary greasiness.\n\nAm I spending too much time on the casting choices? Maybe, but it’s not like Pepe’s direction commanded my attention anywhere else throughout the hour-forty play. Apparently disinterested in the text, or in showing his directorial hand, he lets the cast wander about Scott Pask’s purposely messy set without any ambition, or even pointed aimlessness. He also permits what few moments the script provides for contemporary contemplation — Rockwell’s character angrily calling Fishburne’s a racial epithet, for example — to go uncommented. This laissez-faire directing doesn’t allow the second act’s mounting troubles to build or release; a fight breaks out, sort of, it gets resolved, sort of, the play ends.\n\nStaging American Buffalo in the round at Circle in the Square would appear an obvious fit. A 1981 revival starring Al Pacino, back when the theatre had a different space downtown, seems to have fared well. But whether because of a certain endlessness of chaos in Pask’s set, or Pepe allowing his characters to gaze into a distance where there should be the shop’s wall, it doesn’t provide the proper caging this wild beast requires. Instead of bulls in a china shop, we’re left with three stars in an airless planetarium.\n\n‍American Buffalo is in performance through July 10, 2022 at Circle in the Square Theatre on 50th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 675,
  "archivePath": "data/archives/reviews/american-buffalo-2008/theatrely--juan-a--ramirez_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:06:01.314Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251212004933",
  "archiveOrgUrl": "http://web.archive.org/web/20251212004933/https://www.theatrely.com/post/american-buffalo-doesnt-tame-its-beast-review",
  "wordCount": 675,
  "tierReason": "Full review text"
}