{
  "showId": "american-buffalo-2008",
  "outletId": "timeout",
  "outlet": "Time Out",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/american-buffalo-broadway-review-david-mamet-sam-rockwell-revival",
  "playbillVerdictUrl": "https://www.timeout.com/newyork/theater/american-buffalo-broadway-review-david-mamet-sam-rockwell-revival",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "showScoreExcerpt": "\"Directed by Neil Pepe with the expert eye for appraisal that the characters lack, this production is vastly superior to 'American Buffalo’s' last Broadway incarnation, which ran briefly back in 2008. The play itself, which marked Mamet’s breakthrough, is as thin as a dime, but it’s got great atmospherics. Scott Pask’s set and Dede Ayite’s costumes plunge us into the shabby world of the action; seated around the thrust stage at Circle in the Square, the audience can almost smell the mix of dirt and desperation. \"\n\nRead more",
  "bwwExcerpt": "Directed by Neil Pepe with the expert eye for appraisal that the characters lack, this production is vastly superior to American Buffalo's last Broadway incarnation, which ran briefly back in 2008. The play itself, which marked Mamet's breakthrough, is as thin as a dime, but it's got great atmospherics. Scott Pask's set and Dede Ayite's costumes plunge us into the shabby world of the action; seated around the thrust stage at Circle in the Square, the audience can almost smell the mix of dirt and desperation. Although not much happens in the play, which is less a thriller than a loiterer, it somehow seems fast-paced, thanks in large part to the three crack performers who bring it to life. They stride the stage with the game confidence of actors who know exactly how to make Mamet's monte look full.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-AMERICAN-BUFFALO-Opens-On-Broadway-Starring-Darren-Criss-Sam-Rockwell-and-Laurence-Fishburne-20220414",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: mentions director \"neil pepe\" from american-buffalo-2022 (newer production). Review likely belongs in american-buffalo-2022."
}