{
  "showId": "american-buffalo-2008",
  "outletId": "unknown",
  "outlet": "unknown",
  "criticName": "Unknown",
  "url": "https://www.nytimes.com/2022/04/14/theater/american-buffalo-review.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"When 'American Buffalo' first hit the stage, in Chicago in 1975, its portrait of lowlifes like Teach — two-bit grifters aping the realpolitik of American business — was a game changer. Though it did not quite induce sympathy for a man who would strike a kid in the face with an iron, it did make audiences queasy about the respectable entrepreneurs whose behavior Teach was translating to his own turf. In language as crass and cadenced as gunfire, Mamet turned their man-eat-man philosophy, which some call capitalism, into brutal prole poetry: a poetry of predation, you might even say.\"\n\nRead more",
  "contentTier": "invalid",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "rejectedAt": "2026-02-03T13:12:53.589Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is historical context about the original 1975 production with no evaluation of the current Broadway production. The text cuts off at 'Read more' suggesting this is just an excerpt or teaser, not an actual review of the current show.; openai: The text is a historical context and analysis of the play's themes, not an evaluative review of the current Broadway production.; gemini: This is background/context about the play's history and themes, not a review of the current production's quality. There is no evaluation of the performances, direction, or design.; kimi: The excerpt provided discusses only the original 1975 Chicago production of 'American Buffalo', describing its historical significance and themes. It contains no evaluation of the current Broadway revival's performances, direction, or staging.",
  "promptVersion": "5.2.0",
  "wrongProduction": true,
  "wrongProductionReason": "URL/date from 2022 but show opened 2008 (year gap: 14)"
}
