{
  "showId": "into-the-woods-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2022/07/10/into-the-woods-the-beloved-sondheim-lapine-musical-in-full-bloom/",
  "publishDate": "2022-07-10T20:24:09",
  "fullText": "The fabulously clever Stephen Sondheim-James Lapine Into the Woods, first seen in 1986, is so damn clever that it raises a question answered farther down in this enthusiastically positive review. The question: Is it possible for a musical to be too clever?\n\nRest easy, Sondheim acolytes. Nowhere in this column will it even be implied that the much-missed late lyricist-composer was anything less than an undisputed genius. It may, however, be suggested and/or implied that Sondheim and Lapine can stand — and withstand — the occasional critical observation.\n\nSo, let’s get to the neatly crafted nuts and bolts of Into the Woods, now transferred to Broadway from its recently acclaimed Encores! series outing. Sondheim and Lapine introduce a Narrator (David Patrick Kelly) who summons fairytale figures Cinderella (Phillipa Soo), her Stepmother (Nancy Opel) and nasty stepsisters Lucinda (Ta’Nika Gibson) and Florinda (Brooke Ishibashi) as well as Prince Charming (Gavin Creel).\n\n[Read Steven Suskin’s ★★★★☆  review of the original Encores production here.]\n\nThe Narrator commandeers long golden-braided Rapunzel (Alysia Velez) with her scheming mother-Witch (Patina Miller) and devoted Prince (Joshua Henry). He buttonholes Jack (Cole Thompson) of the beanstalk with worried mom (Aymee Garcia) and cow Milky White (Cameron Johnson the handler, at the performance I saw). He welcomes Little Red Ridinghood (Julia Lester) with Wolf (Creel doubling) and eventually indigestible Grannie (Annie Golden).\n\nThe bunch of them then jauntily interact with each other as well as with a childless Baker (Brian D’Arcy James) and the Baker’s Wife (Sara Bareilles). [Note: in this day of sudden cast illnesses, D’Arcy James — who appeared at the press performance attended — was unable to perform at the official opening.] All are gathered in the Sondheim-Lapine real (and, of course, symbolic) woods to dispatch the bundle of messages the creators have incorporated on various cogent and potent subjects.\n\nThe songsmith and bookwriter want to look at what makes a family a family and, alternatively, what alienates families. They’re intrigued by the same mistakes mythic characters make that humans make, misjudgments that get them into deep trouble. The creators are dabbling with ethics and morals — dispensing moral lessons, as fairytales tend to do. They focus on what children may learn on the theory that even if children don’t obey, they will listen.\n\nKidding around with this confection of childhood favorites, they do take impudent liberties. Little Red Ridinghood is a glutton with an especially sweet tooth. (It’s funny that after eating so much she gets eaten.) Prince Charming, a womanizer, insists he was raised to be charming, not sincere. Jack is an unfortunately gullible lad, easily talked out of his beloved Milky White by the Baker, who needs the sweet beast to complete a task the Witch has set as payment for lifting a never-to-be-parents curse.\n\nThis disparately wild bunch — each of the actors superb at what they do, as directed by the superlative Lear deBessonet and choreographed by agile Lorin Latarro — gambol around a David Rockwell set, featuring a wood consisting of thick birch trees. At the first-act finale each of them has by hook or crook achieved his or her determined goal. They’re all set to live happily ever after.\n\nBut not so fast! This is Sondheim. This is Lapine. These two are not known as happy-end fellows. They’ll do their best to see that the happy ends achieved in the first part don’t sustain. (FYI: the second act of The Fantasticks has the same reversal.)\n\nSo’s not to sully their reputation as realists, Sondheim and Lapine snatch back that happiness. To terrorize their startled woods denizens, they let loose a real (and, needless to say, symbolic) Giant wife (Golden again) of the Giant whom Jack previously slew to obtain his golden egg and golden harp.\n\nUnfortunately, in the process of maintaining their realist bona fides, Sondheim and Lapine prove to be — see initial query above — too clever. Or perhaps not clever enough. Extended and awkward dramatics eventually land with a thud that’s the equivalent of the lady giant’s thud, as supplied by sound designers Scott Lehrer and Alex Neumann and represented by a large-scale pair of wired high-heeled pumps.\n\nBut then, of all things, Sondheim sentimentally reverses himself on the happily-ever-after denial with one of his most treasured songs, the reassuring “No One is Alone.” Really? Is everyone who’d like to be reassured by the sentiment truly reassured?\n\nAgain, though, this is Sondheim and he’s packed a passel of dillies into his score, the encompassing title ditty not the least of them. Just about every other item is up to his vaunted standards — “Agony” for the two Princes, “It Takes Two” for the Baker and Wife, Jack’s haunting “Giants in the Sky,” the ensemble “Ever After.”\n\nThroughout, there’s Sondheim’s nimble rhyming — he finds a rhyme for “palette” in “carnality” — so much so that again (see above), his cleverness begins to wear. He’s always had a pronounced case of rhyme-itis. Sometimes with rhymes he doesn’t stop but has a crop that pop, pop, pop, a well-stocked shop of rhymes to drop, ker-plop, ker-plop. A listener wants to shout, “Enough already.”\n\nStill, this Into the Woods revival is eminently worth seeing, for perhaps an unusual additional reason. When I attended, the audience cheered every first-act song long and loud. Why such jubilation? Perhaps because the fave-rave musical is one of the most popular high schools attractions going. Could be the packed St. James auditorium is chockablock with former Into the Woods schooldays players who know the score backwards and forwards and are cheering it for old time’s sake. There are worse recommendations for joining them.\n\nInto the Woods opened July 10, 2022, at the St. James Theatre and runs through August 21. Tickets and information: intothewoodsbway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
