{
  "showId": "into-the-woods-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Naveen Kumar",
  "url": "https://variety.com/2022/theater/reviews/into-the-woods-review-revival-sondheim-broadway-city-center-encores-1235312251/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "The revival that opened on Broadway Sunday night is not just a glorious lifeline for fans reawakening to the wonders of live performance after a long, dark hiatus. It's a crystalline showcase for sensational performances from an all-star cast of marquee veterans, and a testament to the enduring genius of the beloved musical, now in its fourth Broadway incarnation since premiering in 1987. The biggest giant in the sky this time around is Sondheim himself, and exalting his legacy is the production",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-INTO-THE-WOODS-Opens-on-Broadway--Updating-Live-20220710",
  "contentTier": "complete",
  "fullText": "Fairy tales have always been a strange and unlikely source of comfort. Children are orphaned, cruelty is king, and happy endings lead to perpetual disappointment with real life. Stephen Sondheim and James Lapine wrestled with the weirdness and contradictions of children's stories to such brilliant and unsettling ends that \"Into the Woods\" has developed its own mythos as a balm for adults.\n\nThe revival that opened on Broadway Sunday night is not just a glorious lifeline for fans reawakening to the wonders of live performance after a long, dark hiatus. It's a crystalline showcase for sensational performances from an all-star cast of marquee veterans, and a testament to the enduring genius of the beloved musical, now in its fourth Broadway incarnation since premiering in 1987. The biggest giant in the sky this time around is Sondheim himself, and exalting his legacy is the production's unmistakable guiding principle.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n The Ring 6: How to Watch Teofimo Lopez vs. Shakur Stevenson Live Online\n\nThe streamlined simplicity of the staging by director Lear DeBessonet is due in part to its origins at New York City Center Encores!, where she is the new artistic director and where the production debuted to great acclaim this spring. (Encores! has previously been known for producing lesser known works for weeklong revivals; \"Into the Woods\" marked the first in the series' commitment to presenting one popular favorite per season.) There are no grand set changes or special effects, nor anything to distract from the score's slippery-sweet melodies and a cast that seems to be having the time of their lives.\n\nThere's more dimension to these written characters than in storybooks, but \"Into the Woods\" leaves generous room for interpretation, and this prodigious ensemble is making an absolute feast of the possibilities. They are at once familiar types who signify narrative themes — innocence, perseverance, wisdom, desire — and distinct individuals with their own ticks and quirks and inner worlds. They're relentlessly funny except when they're heartbreaking (and sometimes even then). They're mordant and hopeful and just trying to make it to the next midnight. In other words, they're even more like you and me than we may have previously thought.\n\nPhillipa Soo's Cinderella is a gentle-souled, indecisive dreamer — and a pratfalling klutz with a sharp but guileless sense of humor. Sara Bareilles lends the Baker's Wife verve and vulnerability, with a warm and assured comedic touch that suffuses her every moment. That includes, of course, her tryst with a preening and irresistibly vapid Gavin Creel, an MVP of cartoon masculinity in his double role as Cinderella's Prince and the Wolf. Creel is a clever and meticulously calibrated laugh riot, whether sniffing ladies for lunch or wooing them away from their husbands.\n\nAs his gluttonous, red-hooded mark, Julia Lester is a wry portrait of brash and naive nonchalance, a deadpan avatar of youthful disaffection. At the opposite extreme, Patina Miller's Witch dispenses her world-weary savvy with a certain gleeful relish, delighting in her role as a bully who is as needy and fragile as everyone else. Not holding herself too far apart from the others has an equalizing effect, even before the Giant (voiced by Annie Golden) starts making indiscriminate roadkill of the lot.\n\nBut the most treasured star of this revival is Sondheim himself, whose score is brought gloriously to life by the nimble Encores! orchestra. Rather than squirreled out of sight, the musicians occupy a generous portion of the stage while the action unfolds mostly down front. Hardly a word or note is missed.\n\nThe effectiveness of DeBessonet's pared-back approach is aided by refreshingly simple design. The evocative set by David Rockwell imagines a scatter of birch tree trunks and a moon that rises and falls against an ombré sky. Its colors shift like a mood ring with Tyler Micoleau's lighting, which also lends the woods delicate richness and shadow. Costumes by Andrea Hood, in earth tones and bold hues, distinguish characters without overwhelming them.\n\n\"Into the Woods\" is far from sanguine about whether happiness can ever be more than fleeting — skewering that fantasy is one of its most ruthless lessons. But people don't go to the theater to learn. They go to be entertained — to see, to hear, and maybe to think, to escape and weep and guffaw. If a production this radiant can make you laugh and laugh (and even cry a little) as the world burns, isn't that all that anyone could wish for?",
  "isFullReview": true,
  "textWordCount": 744,
  "archivePath": "data/archives/reviews/into-the-woods-2022/variety--naveen-kumar_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:55:54.138Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "duplicateTextOf": "variety--frank-rizzo.json",
  "wordCount": 744,
  "tierReason": "Full review text"
}