{
  "showId": "farinelli-and-the-king-2017",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Robert Hofler",
  "url": "https://www.thewrap.com/farinelli-king-broadway-review-handel-upstages-mark-rylance/",
  "playbillVerdictUrl": "https://www.thewrap.com/farinelli-king-broadway-review-handel-upstages-mark-rylance/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "Who thought that George Frideric Handel would ever get a jukebox musical on Broadway? Nine arias from seven of the composer’s early 18-century operas are featured in Claire van Kampen’s new play, “Farinelli and the King,” which opened Sunday at the Belasco Theatre after a run in London. The countertenor Iestyn Davies sings at evening performances; James Hall does the matinees.",
  "isFullReview": false,
  "textWordCount": 61,
  "archivePath": "data/archives/reviews/farinelli-and-the-king-2017/thewrap--robert-hofler_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:15:22.479Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "excerpt",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Word count too low: 67 (min: 300)"
  ],
  "contentTier": "truncated",
  "wordCount": 61,
  "tierReason": "Short text (61 words)",
  "rejectedAt": "2026-02-04T05:37:53.312Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is a brief descriptive summary with cast/performance details but contains no critical evaluation or recommendation about the show's quality.; openai: The text is a brief description of the play's concept and cast, without any evaluative content or critical assessment.; gemini: This is just a brief announcement of the show's opening, with no evaluative content or recommendation.; kimi: The text contains only factual description of the show's premise, cast, and opening details with no evaluative language or critical assessment of the production quality.",
  "promptVersion": "5.2.0",
  "bwwExcerpt": "Fortunately, Rylance puts his full arsenal of mannerisms on display to prevent this king from being the royal bore of Madrid. Whenever van Kampen's dialogue turns florid, he gives it a flat modern reading, and throws in an F-bomb. Elsewhere, he vocally stumbles and pauses, and lets dull phrases wither in his mouth for added comic effect. Meanwhile, Grove's queen suffers without giving much range to her desperation other than an occasional eyeball roll or nostril flare. And Crane's castrato remains glum, especially when Davies is singing. Dove delivers an appropriately spectacular entrance for the singing Farinelli at the end of Act 1, but for the most part his direction of the two Farinellis is a major waste of potentially golden opportunities.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-FARINELLI-AND-THE-KING-Arrives-on-Broadway-with-Mark-Rylance-Updating-Live-20171217"
}
