{
  "showId": "aint-no-mo-2022",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Elisabeth Vincentelli",
  "url": "https://www.nytimes.com/2022/12/02/theater/aint-no-mo-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2022/12/02/theater/aint-no-mo-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "dtli"
  ],
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 429,
  "archivePath": "data/archives/reviews/aint-no-mo-2022/nytimes--elisabeth-vincentelli_2026-02-04.html",
  "textFetchedAt": "2026-02-04T14:08:38.653Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241122120000",
  "archiveOrgUrl": "http://web.archive.org/web/20241122120000/https://www.nytimes.com/2022/12/02/theater/aint-no-mo-review.html",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Jordan E. Cooper’s new Broadway play starts with the kind of roof-raising scene most writers would have stashed away for a big bang of a finale. Pastor Freeman (Marchánt Davis) is standing by a coffin, about to give the eulogy for Brother Righttocomplain, a stalwart member of the African American community who embodied protest and grievances. Righttocomplain’s purpose has just ended, though, hence the funeral: It is Nov. 4, 2008, and Barack Obama has been elected president, ushering in a promising new era for Black Americans.\n\n“Ain’t no mo’ shot down dreams with its blood soaking the concrete outside room 306,” Pastor Freeman declares. “Ain’t no mo’ riots.” The list goes on as he revs up, whipping his congregation and the audience into a frenzy. By the time he asks, “Can I get a Chaka Khan?” it’s impossible not to answer back. Were the show a traditional musical, the scene would have been the 11 o’clock number.\n\nInstead it is the first exclamation point in an evening of many.\n\nStarting on such an expansive note is a bold move for Cooper, a 27-year-old writer making his Broadway debut, but “Ain’t No Mo’,” which opened on Thursday at the Belasco Theater, bursts with confidence. It is confident in its voice, in its beliefs, in its artistry, in its wicked humor and angry pain — or pain-laden anger. It is also confident that Stevie Walker-Webb’s production and the cast, both of which are largely unchanged from the play’s premiere at the Public Theater, in 2019, can handle it all.\n\nAs the funeral concludes, we are abruptly transported to an airport, where a gate agent named Peaches (Cooper in high drag, a feather stuck in a hat jauntily pointing up) is on a Bluetooth call, trying to get stragglers to hurry up to Gate 1619: Just as that number refers to the arrival year of the first enslaved Africans in America, the U.S. government is now offering a one-way flight to Africa to those slaves’ descendants — and it’s about to depart.\n\nPeaches, with whom we check back at regular intervals, acts as a link between the vignettes that make up “Ain’t No Mo’,” a structure borrowed from George C. Wolfe’s epochal 1986 satire “The Colored Museum.” (Cooper is also the showrunner of the BET+ sitcom “The Ms. Pat Show,” which he created with Patricia Williams; coincidently, a flight attendant in “The Colored Museum” is called Miss Pat.)\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "contentTier": "needs-rescrape",
  "_showNotMentionedDiscoveryAttempted": true,
  "dtliExcerpt": "It is confident in its voice, in its beliefs, in its artistry, in its wicked humor and angry pain — or pain-laden anger. It is also confident that Stevie Walker-Webb’s production and the cast, both of which are largely unchanged from the play’s premiere at the Public Theater, in 2019, can handle it all.",
  "dtliThumb": "UP",
  "publishDate": "December 2, 2022",
  "showScoreExcerpt": "\" 'Ain’t No Mo’ has an immediate impact, but its biting commentary on race doesn’t leave a bruise.\"\n\nRead more"
}
