{
  "showId": "the-normal-heart-2011",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2011/04/28/theater/reviews/the-normal-heart-on-broadway-theater-review.html",
  "publishDate": "April 27, 2011",
  "fullText": "More than a quarter of a century after it first scorched New York, “The Normal Heart” is breathing fire again. The passionately acted new Broadway production of Larry Kramer’s watershed drama from 1985 — an indictment of a world unwilling to confront the epidemic that would come to be known as AIDS — blasts you like an open, overstoked furnace. Your eyes are pretty much guaranteed to start stinging before the first act is over, and by the play’s end even people who think they have no patience for polemical theater may find their resistance has melted into tears. No, make that sobs.\n\nWhen it first opened at the Public Theater, “The Normal Heart” sounded like a hoarse, relentless “J’accuse!” screamed directly at a gallery of blame-worthy individuals and institutions that included Mayor Edward I. Koch, The New York Times, the American medical establishment and the majority of gay men in New York City. Surprisingly, many theatergoers — even those at whom the play’s hectoring finger was pointed — felt that Mr. Kramer was beautiful when he was angry. A focal point for people searching for vicarious venting in those early plague years, “The Normal Heart” became the longest-running hit in the history of the Public Theater.\n\nMany of the adjectives that were attached to “The Normal Heart” at that time still apply: fierce, angry, engaged, confrontational. But in the new incarnation of “The Normal Heart,” which opened Wednesday night at the Golden Theater, anger is only one note in a polyphonic chord.\n\nPolitical outrage may be what shaped this drama, inspired (very directly) by Mr. Kramer’s early days as an AIDS activist. But what emerges so stirringly from this production — which follows the shaky emergence of a political movement among gay New Yorkers to deal with AIDS — is its empathy with people lost in a war in which they have no rules, no map, no weapons. Everyone’s flailing, everyone behaves badly, and everyone is, if not likable, at least understandable. There is no rationing of compassion here, even for the enemy.\n\nDon’t let me deceive you into thinking that “Heart” has mellowed in the intervening years. As directed by Joel Grey and George C. Wolfe — and performed by a top-notch cast that includes Joe Mantello, Ellen Barkin and John Benjamin Hickey — the play remains a bruiser. This is a production, after all, in which the showstoppers are diatribes. (One delivered by Ms. Barkin, playing an endlessly frustrated doctor, receives the kind of sustained applause usually reserved for acrobatic tap dancers.)\n\nWhat this interpretation makes clear, though, is that Mr. Kramer is truly a playwright as well as a pamphleteer (and, some might add, a self-promoter). Seen some 25 years on, “The Normal Heart” turns out to be about much more than the one-man stand of Ned Weeks, the writer who takes it upon himself to warn gay men about AIDS (before it was even identified as such) and alienates virtually everyone he comes across. Ned Weeks — need I say? — is Larry Kramer, with a thoroughness that few onstage alter-egos can claim.\n\nNed is portrayed by Mr. Mantello with the centering urgency and stridency that the role demands. But he lets us feel the cold streak — of fear and loneliness — that runs through Ned’s combative style. As a leader he may be the abrasive nag that his times require, but there’s also something irresistible about his combination of confident energy and self-lacerating doubt. You can understand why Felix Turner (Mr. Hickey, excellent), a closeted style writer for The New York Times, would fall in love with him.\n\nAnd it is not for nothing that as a boy Alexander Weeks changed his name to Ned, after a character in Philip Barry’s “Holiday.” Mr. Kramer may be first and foremost an agitator, but he is also a lover of witty romantic theater. And in this production I was able to perceive the sort of sexual sparks, struck by semi-hostile banter, that I associate with Barry’s barbed dialogue of courtship. I believed in Ned and Felix as a couple here, and I never had before.\n\nFor that matter, though “The Normal Heart” can be as emotionally manipulative as “War Horse” (there’s a death-bed wedding scene), I found myself believing completely in all the relationships and caring about every character (even the snarky mayor’s aide played by Richard Topol). That includes Emma Brookner (Ms. Barkin), a paraplegic doctor who finds her patient list of fatally ill gay men growing by the day.\n\nLike Ned, Emma is perched on a soapbox, but we understand the psychological as well as the political motives that put her there. And as embodied by Ms. Barkin (in a slam-dunk Broadway debut) and Mr. Mantello, there’s plenty of chemistry between these self-created dragons. They understand each other, which means they don’t have to tread too carefully when they’re together.\n\nBefore the play ends, Ned will have shed many of his closest friends and his allies in the organization he has helped to found (which bears a close resemblance to Gay Men’s Health Crisis). Yet when those friends turn on Ned, we don’t turn on them. That’s because they are each drawn with such clarity and detail that we understand exactly why they behave as they do.\n\nPatrick Breen, Lee Pace and Jim Parsons (of “The Big Bang Theory”) are all terrific as very different types of gay men who band together and chafe and clash and ultimately explode. (Each has at least one outburst that leaves you as shaken as they are.) And Mark Harelik is superb as Ned’s brother, Ben, a stiff-backed lawyer who loves and is embarrassed by his younger sibling. There’s a lot of complicated, illuminating chemistry in this relationship too.\n\nNot that we are ever allowed to forget that there is something bigger going on than the usual dramatic soap operas of fractured families and love affairs. The walls of David Rockwell’s set — a homage to the original white box set at the Public — are carved with headlines and talismanic words that chart the rapid progress of a disease and the slow official response to it. The names of those killed by AIDS are also projected on those walls, in ever-increasing numbers.\n\nMore than any naturalistic version, this design summons the very climate of fear and uncertainty in which the characters in “The Normal Heart” lived and breathed and, too often, died. What makes this production so deeply affecting, and so much more than a warning cry from another time, is our awareness of how that element shapes and warps the people who inhabit it: how it brings them together and tears them apart and makes them noble and craven and hysterical and heroic, and, above all, so very frightened, confused and, yes, hopping mad.\n\nThe crisis depicted so vividly here is far from ended, as cases of AIDS continue to multiply internationally. And lest you leave this play thinking that you’ve had only a great cathartic night at the theater, fliers from Mr. Kramer are being handed out after the show (by Mr. Kramer himself on occasion), explaining how incomplete the fight against AIDS remains. Read one and take heed. But remember that the man who wrote it also wrote a far better play than you might have thought.\n\nBy Larry Kramer; directed by Joel Grey and George C. Wolfe; sets by David Rockwell; costumes by Martin Pakledinaz; lighting by David Weiner; projections by Batwin + Robin Productions; music and sound by David Van Tieghem; technical supervisor, Peter Fulbright; production stage manager, Karen Armstrong; general manager, 101 Productions. Presented by Daryl Roth, Paul Boskind and Martian Entertainment, in association with Gregory Rae and Jayne Baron Sherman/Alexander Fraser. At the Golden Theater, 252 West 45th Street, Manhattan; (212) 239-6200; telecharge.com. Through July 10. Running time: 2 hours 30 minutes.\n\nWITH: Ellen Barkin (Dr. Emma Brookner), Patrick Breen (Mickey Marcus), Mark Harelik (Ben Weeks), John Benjamin Hickey (Felix Turner), Luke MacFarlane (Craig Donner/Grady), Joe Mantello (Ned Weeks), Lee Pace (Bruce Niles), Jim Parsons (Tommy Boatwright), Richard Topol (Hiram Keebler/Examining Doctor) and Wayne Alan Wilcox (David).",
  "isFullReview": true,
  "dtliExcerpt": "This revival of Larry Kramer's 1985 drama about the early days of the AIDS crisis crackles with an urgency that feels both period-appropriate and entirely contemporary.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This revival of Larry Kramer's 1985 drama about the early days of the AIDS crisis crackles with an urgency that feels both period-appropriate and entirely contemporary.",
  "contentTier": "complete",
  "contentTierReason": "Short text (26 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/05/23/arts/television/mark-ruffalo-stars-in-larry-kramers-the-normal-heart.html?partner=rss&emc=rss&_r=0",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "previousUrl": "https://www.nytimes.com/2011/04/28/theater/reviews/the-normal-heart-revival-review.html",
  "urlDiscoveredAt": "2026-02-04T02:02:38.315Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1358,
  "archivePath": "data/archives/reviews/the-normal-heart-2011/nytimes--ben-brantley_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:02:38.322Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 1358,
  "tierReason": "Full review text"
}