{
  "showId": "the-normal-heart-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://www.variety.com/review/VE1117945105",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "There's so much urgency in Kramer's play that it doesn't exactly qualify as a historical artifact. It also brings up a lot of issues, like gay marriage and the right to inherit, that remain relevant outside their original context. Mostly, though, the play still works because it has the power to move and disturb us. As the play's original producer, Joe Papp, put it: 'I love the ardor of this play, its howling, its terror and its kindness.'",
  "bwwScore": 9,
  "contentTier": "complete",
  "fullText": "It's true that \"The Normal Heart,\" Larry Kramer's fiery 1985 docu-like drama about the AIDS pandemic, suffers from agit-prop agita, even in this first-rate production starring Joe Mantello and Ellen Barkin and co-helmed with enormous heart by Joel Grey and George C. Wolfe.\n\nIt’s true that “The Normal Heart,” Larry Kramer‘s fiery 1985 docu-like drama about the AIDS pandemic, suffers from agit-prop agita, even in this first-rate production starring Joe Mantello and Ellen Barkin and co-helmed with enormous heart by Joel Grey and George C. Wolfe. But Kramer’s is a fine fury, stoked by righteous anger, and even today the sobering specifics of his impassioned brief are worth recall. Especially if, as the scribe declares in printed fliers that he sometimes distributes himself after the show, AIDS is still unacknowledged as “a worldwide plague” with “no cure” and little coordination in its treatment.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Chicago Fire,’ ‘Med’ and ‘P.D.’ Set Crossover Episodes on NBC in March \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Chicago P.D.' Stars Jesse Lee Soffer and Tracy Spiridakos Set to Return for Crossover\n\nThe story is eloquently summed up by the starkly illuminated (by lighting designer David Weiner) projections (from Batwin & Robin Prods.) on the whitewashed bare-brick walls of David Rockwell‘s cube of a set. After the play opens in summer 1981 in the office of a New York doctor confounded by an “insidious killer” of a disease afflicting gay men, 41 names are projected on the back wall of the stage. As the play progresses, along with the disease, the names start climbing up the walls until, by the end of the show, the theater walls are completely covered with the names of the dead.\n\nThe only people with unclouded vision about the disease and unswerving conviction about how to stop it are Dr. Emma Brookner (Barkin) and Ned Weeks (Mantello). Like the real-life physician who inspired her character, Dr. Brookner is confined to a wheelchair with polio and must navigate the medical world with her loud mouth. In her riveting perf, Barkin finds the precise articulation for this brave doctor’s medical analysis, the exact pitch for her growing alarm, and the perfect tone of outrage for the fervent speech she delivers after being turned down once again for a grant to do research on this unpopular “gay” disease.\n\nWeeks, who was modeled after the playwright, is a downtown journalist so distressed by media apathy and government indifference to the growing epidemic that he starts the Gay Men’s Health Crisis, a volunteer service organization that will eventually oust him from power because of his alienating political tactics. Even allowing for a little image stroking on the part of the playwright, the cause-driven Weeks is unapologetically loud, abrasive and annoying in the way that messianic personalities tend to be.\n\nTo his credit, Mantello doesn’t sweeten up Weeks’ sour character, but plays him with so much sincerity and conviction that we take him exactly the way he wants to be taken: as a visionary who sees the whole picture and isn’t afraid to speak his mind, even if it does make him a pariah all over town, including in his own community.\n\nThe strong supporting cast (sturdy Patrick Breen among them) play characters representing the entire spectrum of opinion within this gay community. They range from the movers and shakers within GMHC who don’t want to spook their closeted brethren (or alienate the party boys by bringing up sex) to the young volunteer (sweetly played by Jim Parsons) who doesn’t care about the politics and just wants to help the dying.\n\nThere’s so much urgency in Kramer’s play that it doesn’t exactly qualify as a historical artifact. It also brings up a lot of issues, like gay marriage and the right to inherit, that remain relevant outside their original context. Mostly, though, the play still works because it has the power to move and disturb us. As the play’s original producer, Joe Papp, put it: “I love the ardor of this play, its howling, its terror and its kindness.”",
  "isFullReview": true,
  "textWordCount": 667,
  "archivePath": "data/archives/reviews/the-normal-heart-2011/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:41:30.943Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "duplicateTextOf": "variety--david-rooney.json",
  "wordCount": 667,
  "tierReason": "Full review text"
}