{
  "showId": "mike-birbiglia-the-old-man-and-the-pool-2022",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Mike-Birbiglia-The-Old-Man-The-Pool/1109",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Mike-Birbiglia-The-Old-Man-The-Pool/1109",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $39\n Buy Tickets\n\nCititour.com Review\n “With age comes wisdom,” said Oscar Wilde, and I think the 44-year-old master monologuist Mike Birbiglia would be the last person to argue with that legendary statement as each of his solo shows have reflected Birbiglia’s own maturity, hard won by personal experience.\n\nNow, in his latest, ultra-hilarious outing, “The Old Man & The Pool,” being presented at the Vivian Beaumont Theater under Seth Barrish’s expert direction, the older-but-wiser Birbiglia has discovered a lot of other things come with age: most specifically, the piercing realization that one’s mortality can be imminent. And if that thought doesn’t immediately strike you as a laughing matter, then you’re not Birbiglia, who first gained national fame by turning his potentially fatal sleepwalking disorder into comic gold. \n\nHere, after a routine physical uncovers that Birbiglia has a major breathing issue that stumps even his doctor, Birbiglia begins to fear he won’t live to see his young daughter’s 20th birthday. And our everyman hero is no hypochondriac: add in his prior health history (he had bladder cancer at age 21), his family’s health history (both his father and grandfather had heart attacks at 56) and his “future” health history (he develops type 2 diabetes the year after the breathing problem is diagnosed), and you can understand why he doesn’t foresee numerous birthday cakes in his future.\n\nAs is his wont, Birbiglia recounts all these details -- and some of their aftermath –mostly plainly, sometimes seriously, and often, quite humorously. For example, you may never begin to look at chicken parmigiana the same way again! And if you ever thought about seeing a nutritionist, I challenge you to do so now with a straight face. (On the other hand, any of you who, like Birbiglia, are reluctant to draw up a will, should reconsider!)\n\nAnd then there’s the issue of swimming, which you may gather from the show’s title (and Beowulf Boritt’s clever, minimalist set) is the piece’s most prominent subject. It’s the form of exercise that Birbiglia’s cardiologist recommends, which sounds like an easy-enough prescription.\nBut with Birbiglia, very little is ever simple. Some of the show’s funniest moments occur as Birbiglia recounts his reluctance to follow this sound advice (and his disbelief that anyone swims on a regular basis); some of its most poignant (yet hysterical) ones come from telling us why he was turned off from swimming at a young age; and its most surprising moment comes after he has a change of heart. As for what happens when he discovers what caused a particular sign to be posted at his local YMCA, you’ll just have to be there.\n\nAs much as the work is Birbiglia’s very personal life story, I imagine every audience member – whether they be 24, 44, 64 or 84 – will find plenty to relate to in these 85 minutes. So, dive right in! The water’s perfect!\n\nVisit the Sitehttps://mikebirbigliabroadway.com/Open/Close DatesOpening 11/13/2022Closing 1/15/2023\nTheatre Info\nVivian Beaumont Theater150 West 65th StreetNew York, NY 10023 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 553,
  "archivePath": "data/archives/reviews/mike-birbiglia-the-old-man-and-the-pool-2022/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:18:39.980Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 553,
  "tierReason": "Full review text"
}