{
  "showId": "mike-birbiglia-the-old-man-and-the-pool-2022",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/the-old-man-and-the-pool-broadway-review-mike-birbiglia",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/the-old-man-and-the-pool-broadway-review-mike-birbiglia",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Watching comedian Mike Birbiglia on stage is always a blast. It’s like reconnecting with an old friend, albeit one with infinite issues and a habit of taking the roundabout route to get to the point. Birbiglia is totally on brand in his largely delightful solo show, The Old Man and the Pool. The 44-year-old author and actor dives into the choppy waters of his own mortality and comes up not only with waves of laughs, but also deep reflections about love and appreciation for how lucky he is (and we are) to be alive. That will come as no surprise to anyone who’s seen this crafty performer’s previous pieces, in which he mined the funny from some dark situations. These include his dangerous sleep disorder (Sleepwalk with Me), bad dates (My Girlfriend’s Boyfriend), and parenting perils (The New One). Director and longtime collaborator Seth Barrish stages The Old Man and the Pool simply. Birbiglia wears blue street clothes and stands before a giant curved wall, designed by Beowulf Boritt, that recalls a pool and briefly doubles as a slip-and-slide. The story begins with a single breath that sets off recollections that dip in and out of the present. In his trademark style, Birbiglia packs his narrative with flashbacks, curlicues, non sequiturs, and one-liners. The story is here, there, everywhere. It’s how he rolls, and he overall ties things up, save for a few loose ends. Firstly, a doctor’s test reveals Birbiglia has inherited his family’s cardiac issues. His dad and granddad both suffered heart attacks in their 50s. Physicians naturally advise him to eat healthy and swim regularly. Yeah, right. He gobbles pizza by the pie, not the slice. He’s a storyteller, not Michael Phelps. “I have a drowner’s body,” quips Birbiglia, who nevertheless reluctantly heads to a Brooklyn YMCA pool. From the heart doc’s office he travels back to his youth, when his distaste for sports took root. First it was wrestling, which he hated. Then it was swimming at a Massachusetts YMCA pool, a place he associates with pee and chlorine and an unshakable odor. “It had that smell like when you’re little and a kid lets you smell under their cast.” Gross, and hilarious. Seeing elderly naked women and men – especially one ancient manspreader – haunts his memory. Later traumas come via bladder cancer and Type 2 diabetes; Birbiglia has truly been through the wringer. More health concerns float up when Birbiglia and his wife discover black mold is lurking in their daughter's bedroom. That means moving into an Airbnb. This unresolved detour simply sets up a dad joke about the lack of breakfast: “There’s no b.” This Pool has a few of these shallow dips. But this story also goes below the surface. Birbiglia shares that growing up, his family always said “Take care” instead of “I love you,” and decades later he still does that. But things change. He recalls being in a pool with his daughter, who said something unintelligible when they were goofing around underwater. When they popped up for air, he remembers, “She said, ‘I love you, Dad.’ I said, ‘I love you too, Oona.’” Birbiglia doesn’t bend toward sentimentality. When it comes to matters of the heart, poetic and cardiovascular, he simply suggests chains of family history can be broken. The Old Man and the Pool is at the Vivian Beaumont Theater through January 15. Get The Old Man and the Pool tickets on New York Theatre Guide. Photo credit: Mike Birbiglia in The Old Man and the Pool. (Photo by Emilio Madrid) Originally published on Nov 13, 202221:00",
  "isFullReview": true,
  "textWordCount": 599,
  "archivePath": "data/archives/reviews/mike-birbiglia-the-old-man-and-the-pool-2022/nytg--joe-dziemianowicz_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:19:50.716Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 599,
  "tierReason": "Full review text"
}