{
  "showId": "mike-birbiglia-the-old-man-and-the-pool-2022",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Unknown",
  "url": "https://www.vulture.com/article/mike-birbiglia-the-old-man-and-the-pool-broadway-comedy-review.html",
  "playbillVerdictUrl": "https://www.vulture.com/article/mike-birbiglia-the-old-man-and-the-pool-broadway-comedy-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Emilio Madrid\n \n \n \n This review of Birbiglia’s Broadway show was originally published on November 13, 2022. We are republishing it to mark the premiere of its debut on Netflix.\n\nOne of Mike Birbiglia’s simplest and best talents is his instinct for leaping from sprawling existential ideas to prosaic little experiences. He is a master of translating between big and small things. In his work, our darkest fears and most intense loves become visible and accessible to us through absurd little daily realities: the way chlorine smells, the nickname we call our partner, the mysteries of safety signage, the chicken Parmesan served at Christmas. It’s a rhetorical mainstay, ubiquitous across ad campaigns and news reports and fairy tales and every stand-up joke about how men are like this and women are like that. But Birbiglia’s power is to make that leap seem easy without undermining its magic: Here’s the small thing that illuminates the big abstraction.\n\nHis comedy is built on a framework that can make toggling back and forth between Death and adult swim classes feel warm and welcome. The premise rolls out, friendly and a little sharp. He moves the themes into place, anchored by particular images and rhythms (that chlorine smell, for instance, or an especially rhythmic pattern of exchange). Then, as the show crescendos, all those little narrative objects begin resonating within Birbiglia’s larger design. By the time that funny rhythmic patter comes back the third time, it feels like singing along to a song you’ve known for years. It’s not just a repeating phrase — it’s a way to come to terms with the fact that there are some things we cannot escape. And that, wouldn’t you know it, is exactly what The Old Man and the Pool aims to accomplish.\n\nBirbiglia’s last show, The New One, told the story of his reluctant journey to fatherhood, charting his development from happy childlessness to begrudging reproductive participant and finally into a giddy swoon of parental love. His new one, on Broadway, begins roughly where the previous show ended: After finding peace in his role as a father, he now has to confront all the anxiety and personal responsibility that role entails. In particular, he should probably do his best to keep himself alive and healthy, and his doctor raises concerns after Birbiglia gets alarming results on a lung-capacity test. Birbiglia realizes he needs to do all of those tedious, obvious tasks that loomed in the distance of young adulthood but now have real urgency. He needs to eat better. He should consider his family medical history. Mostly, he should exercise.\n\nLike a lot of Birbiglia’s work, The Old Man and the Pool borrows from many genres. It’s stand-up comedy at its essence, beautifully joke-dense and always working inside a context of playfulness rather than bleak self-discovery. It has a hefty dose of memoir, and it owes a great deal to that catchall stage category of the one-man show, most apparent in the way Birbiglia performs his emotional realities rather than relaying them from a comfortable remove. The staging helps stitch together Birbiglia’s combination of stand-up and the one-man-show tradition. He’s a comic standing next to a stool, but he moves that stool around with palpable care and planning. It’d feel overdetermined if it weren’t such a fitting match for the painstaking care of his writing. In this show, Birbiglia also plays with a narrative form he hasn’t deployed before: The show is a fitness journal, although it thankfully dodges the worst qualities of that form (smugness, obnoxiousness). Birbiglia’s journey toward self-improvement is stubbornly physical, and as much as The Old Man and the Pool is a show about memory and death and aging and loss, it is also just unavoidably a show about exercising. His doctor says he should swim, which means that first he needs to learn how to swim.\n\nAnd so the show loops backward, through his early memories of a grimy, unpleasant YMCA and the terrifying old men who populate it, through youth sports, through Birbiglia’s several baroque health issues. (It’s a testament to the careful way his life has been knotted together with the arc of his career that there’s a warm laugh when a doctor asks if Birbiglia has any sleep issues.) Then it rolls forward again, tracing the humiliation of adult swim lessons, the progress, the setbacks. It’s that glorious, corny, satisfying Birbiglia thing once again, those leaps from concrete to abstract. There’s a small image — a frightening memory of an old guy sitting in the locker room, rubbing lotion on his thighs — and tied to it, there’s that awareness of something immense and harder to reach. He feels himself aging. He can’t bring himself to write a will. How do you possibly cope?\n\nHe swims. He writes in his journal. He worries. He performs a show that’s about swimming and making people laugh about bodies, but it’s mostly about our need to laugh about death. And it’s beautiful: exquisitely written, performed, and designed, with all of Birbiglia’s characteristic ear for tone and rhythm. The backdrop behind him, hung deliberately askew, becomes a slide, a medical display, a gurney, and the watery, tiled bottom of a pool. All anecdotes and metaphors click neatly into one another; all the stories build and coalesce and flow from one event to the next.\n\nStill, The Old Man and the Pool is so tidy, its rhythms so precise, that it occasionally feels like Birbiglia can’t always contain the immensities he’s reaching for. There are several wells of thematic preoccupation here: aging and death, yes, but also anxiety, the nature of habits, Birbiglia’s relationship with his parents, the emotional aspects of eating. There’s a great deal of existential dread at the heart of this show, but with every idea Birbiglia offers (including a tried-and-true reminder of the magic of theater), that impulse to encapsulate those big fears by connecting them to smaller stories feels understandable but sometimes insufficient. For the sake of writerly tidiness, The Old Man and the Pool sometimes leans too far away from its own dark messiness. The very end is a clever jab, a startling shock of narrative satisfaction being withheld, for instance, but its cleverness is also suspiciously clean. “We’re not guaranteed the right to a satisfying ending” is the kind of final note that’s on just the wrong side of too pat. Yes, it’s a reminder that we cannot dodge destiny. That doesn’t mean it’s not also its own form of a dodge.\n\nBut there are moments that do capture that feeling of expansiveness, and the squirming discomfort of the interplay between humor and despair. It’s clearest in a sequence near the end of the show, which begins with Birbiglia noticing a new sign at the gym. The sign implies that at some point a YMCA member died in a way that’s tragic and absurd, and Birbiglia grabs onto that combination and will not let go. He chides the audience for laughing about it, keeps repeating the thing that makes them laugh, and then gets even more upset when they cannot pull themselves together. Eventually the show continues, and Birbiglia carefully tucks in enough rhythmic callbacks and previously established symbolic devices to bring the show back to a more comfortable place. It’s sweet. It’s blindingly, refreshingly earnest. And yet there is a ghost of a different version of this show that lingers somewhere in the background, one that worries less about translating massive fears into digestible images, and spends a little more time treading water in the deep end. The version we do have is gratifying. That other, darker one would have been messier, and might have been even better.\n\nShow \n \n \n Leave a Comment\n \n\n Mike Birbiglia’s Existential Exercises\n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1314,
  "archivePath": "data/archives/reviews/mike-birbiglia-the-old-man-and-the-pool-2022/vulture--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:22:37.946Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250722220150",
  "archiveOrgUrl": "http://web.archive.org/web/20250722220150/https://www.vulture.com/article/mike-birbiglia-the-old-man-and-the-pool-broadway-comedy-review.html",
  "contentTier": "complete",
  "wordCount": 1314,
  "tierReason": "Full review text"
}