{
  "showId": "grease-2007",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://variety.com/2016/tv/reviews/grease-live-review-fox-julianne-hough-aaron-tveit-1201693411",
  "publishDate": null,
  "fullText": "\"Grease Live!\" won't make anyone forget the original film any time soon, but that wasn't the point. The idea was to cook up a must-see event that got attention on social media and delivered a crisply executed and energetic final product. Thanks to exceptional work from director Thomas Kail and several sterling supporting performances, much of \"Grease Live!\" was as sweet and tasty as a root beer float.\n\nThe weakest links of this otherwise entertaining event were stars Julianne Hough and Aaron Tveit, who are terrific dancers but both are about as charisma-challenged as they come as actors.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Brandi Carlile and Sam Smith: A Conversation About Bravura Voices, Fashion as Queer Armor and Having a Nonbinary Headliner for Carlile's Girls Just Wanna Weekend \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n How Brandi Carlile’s Girls Just Wanna Weekend Became the World’s Warmest Music Festival: It's Not Just the Tropical Temperatures\n\nTveit has a fine voice, but it's nearly impossible for any actor to don the leather jacket that John Travolta wore so memorably in the 1978 film, in which Danny Zuko was the chick magnet to end all chick magnets. Whatever its weird gender politics (and they're plenty weird), the premise of \"Grease\" is supposed to contrast Danny's leather-clad machismo and smoldering sweetness with Sandy's white-bread innocence, but both Hough and Tveit were equally bland in \"Grease Live!\" When Danny has all the presence of a glass of milk and even the black-clad Sandy of the final scenes exudes all the sexual danger of a church choir director, well, rest assured that those concerned about the \"Grease\" legacies of Travolta and Olivia Newton-John have nothing to worry about.\n\nThough it's hard not to wonder how much better \"Grease Live!\" would have been with different leads, it was still so solidly and smartly crafted that the dullness of the central duo didn't matter all that much. Kail and fellow director Alex Rudzinski, a veteran of \"Dancing With the Stars,\" gave the affair energy and momentum, their cast was game and their commitment never lagged.\n\nThe only real dull spots were a few of the less compelling solos (and Hough's tepid rendition of \"Hopelessly Devoted to You\" was marred by audio static, one of the broadcast's few technical problems). Otherwise, by incorporating a live audience, using creative staging and employing energetic camera work, \"Grease Live!\" frequently boasted an impressive sense of momentum and even spontaneity.\n\nOccasionally it felt a little surreal that the live audience was present — it made sense for people to be sitting in bleachers during the dances and in various crowd scenes, but it was occasionally slightly odd to see them sitting there quietly at other times. But as a whole, the production breezily incorporated backstage moments with \"on stage\" moments, although the presence of Mario Lopez as both backstage host and performer didn’t quite work and ended up being jarring, in part because his acting skills were lacking.\n\nThe upside of the live audience was that it clearly energized the cast to hear applause; it's not easy to bridge the gap between live television and Broadway, but Kail's staging generally blended the two modes effectively.\n\nAll in all, \"Grease Live!\" got most of the big things right — the colorful aesthetic, the rip-roaring big dance numbers, the goofy, careening energy. If the central romance was a snooze, well, never mind — that raucous hand jive will linger in the memory much longer.\n\nIn any event, many members of he supporting cast were so terrific that they more than made up for any slow spots. Newcomer Elle McLemore walked away with most of the scenes she appeared in; she gave her character, Patty Simcox, a Tracy Flick-like manic energy. She was simply terrific.\n\nAna Gasteyer brought beautifully droll timing to her role as Principal McGee, Keke Palmer and Vanessa Hudgens delivered great renditions of their solo songs, as did Carly Rae Jepsen, whose delightful Frenchy was one of the broadcast's highlights. Kether Donahue brought infectious joy to every moment she was on screen as Jan, and Boyz II Men were so wonderful as Teen Angel that Fox should think about giving them a variety show right this minute.\n\nSeveral big set pieces simply sang, most notably the big \"Born to Hand Jive\" number in the gym, during which Rudzinski's swooping aesthetic was used to great effect. The concluding numbers — \"We Go Together\" and \"You're the One that I Want\" — were ebullient as well, though apparently part of the final sequence had to be staged indoors. However the cast exited the soundstage near the end of the broadcast, and the production concluded with a party-like atmosphere outside, some local storms having finally moved off for the moment.\n\nTV and live musicals — they go together. If Fox can get the lead casting right in future and snag Kail again, audiences will surely be hopelessly devoted to the network's next live endeavor.",
  "isFullReview": true,
  "bwwExcerpt": "The problem with the play is that there's no seismic shift when tables are turned, and the believers become doubters and the doubters find faith. In fact, both believers and doubters sort of slide over to the other side. If faith is as fundamental as Wright tells us it is, you'd think he'd have made...",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-GREASE-2007",
  "bwwThumb": null,
  "showScoreExcerpt": null,
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "playbill-verdict"
  ],
  "playbillVerdictUrl": "http://variety.com/2016/tv/reviews/grease-live-review-fox-julianne-hough-aaron-tveit-1201693411",
  "textWordCount": 818,
  "archivePath": "data/archives/reviews/grease-2007/variety--marilyn-stasio_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:36:03.586Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 818,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-06T15:19:52.104Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a review of 'Grease Live!' - a televised live musical broadcast, not a Broadway show; openai: The review is about 'Grease Live!', a live television event, not a Broadway production.; kimi: This review covers 'Grease Live!', a 2016 Fox television broadcast/live TV musical event, not a Broadway theatrical production. The text explicitly discusses camera work, broadcast technical issues, and the television medium ('on screen,' 'Fox,' 'broadcast') rather than a live stage production.",
  "promptVersion": "5.2.0"
}
