{
  "showId": "giant",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Houman Barekat",
  "url": "https://www.nytimes.com/2024/09/27/theater/giant-royal-court-roald-dahl-antisemitism.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2024/09/27/theater/giant-royal-court-roald-dahl-antisemitism.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "https://www.nytimes.com/2024/09/27/theater/giant-royal-court-roald-dahl-antisemitism.htmlShare full articleAdvertisement\n\nIn the August 1983 issue of Literary Review, a British journal, the beloved children’s author Roald Dahl reviewed an eyewitness account of Israel’s 1982 invasion of Lebanon. In a strident piece, Dahl mourned the disproportionate loss of Arab civilian life in that conflict, and appeared to crassly conflate the actions of the Israeli state with the will of the Jewish people. He also asserted that all Jews had a responsibility to denounce Israel.\n\nLater that month, in an interview in The New Statesman newsmagazine, he was asked to clarify those remarks. Dahl went further, saying, “There is a trait in the Jewish character that does provoke animosity.” He went on: “I mean, there’s always a reason why anti-anything crops up anywhere. Even a stinker like Hitler didn’t just pick on them for no reason.”\n\nThis shameful episode, which left a stain on Dahl’s reputation, is the subject of a new play, “Giant,” written by Mark Rosenblatt and directed by Nicholas Hytner, that runs at the Royal Court Theater in London through Nov. 16. It is an admirably evenhanded treatment that walks a delicate tightrope: “Giant” portrays Dahl as a rounded — and occasionally sympathetic — character while making no apology for his bigotry.\n\nWe meet Dahl (John Lithgow) and his fiancée, Felicity Crosland, (Rachael Stirling) in the living room of their countryside home, which is under renovation. (The set, with dust sheets and ladders here and there, is by Bob Crowley). Dahl is poring over the proofs for his next novel, “The Witches.” The Literary Review article has come out and Dahl is facing a backlash. His British publisher, Tom Maschler (Elliot Levey), and an emissary from its American counterpart, Farrar, Straus and Giroux, descend on Dahl and urge him to make an apology, but he’s having none of it.\n\nThe U.S. publisher’s representative, Jessie Stone (Romola Garai), who is Jewish, suggests to Dahl that “The Witches” — about a secret society of evil child-snatchers — could, in light of his offensive remarks, be interpreted as dog-whistle antisemitism, echoing the Jewish blood libel.\n\nStone is the only fictional character of the quartet, and, as a relatively junior employee charged with reining in a star author, she’s in a tight spot. Garai renders her with the right mix of helpless exasperation and dogged resolve. Stone starts off diffident, even a little star-struck, but she comes into her own as the play proceeds. When Dahl threatens to get her fired, she calls him “a belligerent, nasty child” and “a broken boy in giant’s clothing” — and we can’t help but agree.\n\nDahl provocatively likens Stone’s relationship with Israel to his own friendship with a problematic pal called Colin, who’s “always punching people and blaming the barman”; he insists his comments about Israel were motivated by the plight of children in Lebanon and accuses Stone of harboring unconscious racism toward Arabs. Against the backdrop of the current conflict between Israel and Hezbollah in Lebanon, this discussion feels all too timely.\n\nSince “Giant” is more about ideas than plot, the danger of getting bogged down in abstraction is real. But if at times the play feels a little essayistic — Dahl and Stone ventriloquizing two sides of a familiar argument — the dialogue is never less than lively, and Rosenblatt deserves credit for portraying Dahl as a complex and flawed human being rather than a cartoon villain.\n\nDahl’s humanity cuts through in a significant cameo from his groundskeeper, Wally Saunders (played with earthy bonhomie by Richard Hope). For just a few minutes, the two men engage in genial banter in tones of conspiratorial intimacy; it’s the only moment in the play where Dahl seems genuinely at ease in himself. And when Dahl learns that Stone’s teenage son has a brain tumor — Dahl’s own son, Theo, was severely disabled when his baby carriage was hit by a car — he becomes tenderly protective; his bearing toward her is unreservedly empathetic, and she is moved.\n\nLithgow — who, at six feet, four inches tall, is just two inches shy of Dahl’s towering frame — is superb as the beleaguered but unrepentant writer, blending affable, avuncular esprit with scowling, cranky prickliness and nonchalant cruelty: He’s recognizably Dahl, and also every stubborn old codger you’ve ever met.\n\nHumor keeps things ticking along. The play’s comic sensibility recalls British sitcoms from the 1970s, and an awkward dinner-table scene, in which Crosland and Maschler desperately try to make nice while Dahl and Stone needle each other, has echoes of the famous “Don’t mention the war!” sketch from “Fawlty Towers.” When Stone asks Maschler — who is also Jewish — where he would go if British people were to turn against him, he replies with mock hauteur: “Provence.”\n\nFor the generations raised on his books, Dahl’s antisemitism is hard to swallow. Somewhere deep in the collective psyche, we conflated Dahl with the kindly, eccentric beanpole he created: the Big Friendly Giant. Dahl attributed his creative genius to frontal lobe damage he suffered in an air accident while serving with the Royal Air Force in World War II, which he believed made him less inhibited; indeed, this might account not just for his creativity but also, perhaps, for the casual cruelty that was so central to the charm of his children’s stories.\n\nThat sensibility came into sharp focus in 2018, after Netflix acquired the rights to his back catalog, and during a subsequent controversy over the editing of his works to remove offensive content. For all the fine talk of separating the art from the artist, it’s hard to escape the discomforting conclusion that Dahl was so good at writing about hatefulness and cruelty precisely because he was, in some respects, a hateful and cruel man.\n\nThe play’s concluding scene, which culminates in that fateful New Statesman interview, is bleakly funny. Dahl has seemingly convinced Crosland that he will back down and make an apology; she leaves the room satisfied and relieved, whereupon he promptly calls the reporter and delivers his despicable tirade. In Lithgow’s brilliantly blithe rendering, it has the feel of a self-sabotaging prank. It leaves us wondering: Was this pure, pointless pigheadedness, or the expression of a genuine hatred? And does the difference even matter?\n\nGiantThrough Nov. 16 at the Royal Court Theater, in London; royalcourttheatre.com\n\nA picture caption with an earlier version of this article misidentified one of the actors. She is Rachael Stirling, not Romola Garai.\n\nWhen we learn of a mistake, we acknowledge it with a correction. If you spot an error, please let us know at nytnews@nytimes.com.Learn more",
  "isFullReview": true,
  "textWordCount": 1097,
  "archivePath": "data/archives/reviews/giant/nytimes--houman-barekat_2026-02-01.html",
  "textFetchedAt": "2026-02-01T18:23:14.061Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250912132015",
  "archiveOrgUrl": "http://web.archive.org/web/20250912132015/https://www.nytimes.com/2024/09/27/theater/giant-royal-court-roald-dahl-antisemitism.html"
}