{
  "showId": "violet-2014",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/violet-theater-review-693087/",
  "publishDate": "April 12, 2014",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Sutton Foster gives a powerhouse performance in this tender musical about a young woman's journey of self-discovery, bringing emotional depth and vocal prowess to the title role.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Sutton Foster gives a powerhouse performance in this tender musical about a young woman's journey of self-discovery, bringing emotional depth and vocal prowess to the title role.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (27 words)",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/sutton-foster-violet-theater-review-697787",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "textWordCount": 1023,
  "archivePath": "data/archives/reviews/violet-2014/hollywood-reporter--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:26:33.298Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "As forecast last week, the soundtrack to Disney’s Frozen scores an eighth week at No. 1 on the Billboard 200, marking the longest run atop the list since Adele‘s 21 closed out a 24-week run at No. 1 in 2012.\n \n Frozen sold another 161,000 copies in the week ending March 30, according to Nielsen SoundScan — down 20 percent compared with the week previous.\n \n Since SoundScan — and its point-of-sale data — began powering the Billboard 200 in 1991, Frozen is just the 20th album to spend at least eight weeks at No. 1. In that span of time, 21 has ruled the longest, followed by Whitney Houston‘s The Bodyguard soundtrack (with 20 weeks at No. 1) and Garth Brooks‘ Ropin’ the Wind (with 18).\n \n Adele’s mega-selling 21 (10.9 million and counting) spent its first week at No. 1 on the chart dated March 12, 2011, and its 24th week in the penthouse over a year later, on June 23, 2012.\n \n Frozen has now sold 1.8 million copies, with 1.5 million of those sold in 2014. It’s by far the biggest-selling album of this year. The No. 2 seller is Beyonce‘s self-titled album, having sold 604,000 in 2014 (out of its 1.9 million total, as it was released in 2013).\n \n At No. 2 on the latest Billboard 200 is Shakira with her own self-titled set, starting with 84,000 sold. It’s her highest-charting album ever, surpassing the No. 3 peak of 2001’s Laundry Service. On the other hand, Shakira notches her lowest sales start of all her English-language studio albums. It dips below the bow of 2009’s She Wolf, which launched at No. 15 with 89,000 in the thick of the Christmas shopping season.\n \n Johnny Cash is up next, bowing at No. 3 with Out Among the Stars. The album — consisting of newly discovered material recorded in the early 1980s — debuts with 54,000 sold, marking his sixth top 10 album. Out Among the Stars also enters at No. 1 on the Top Country Albums chart, his first leader since 2006’s American V: A Hundred Highways also opened at No. 1.\n \n Out Among the Stars is the highest-debuting posthumous release (Cash died in 2003) since Jimi Hendrix‘s People, Hell and Angels debuted at No. 2 on the chart dated March 23, 2013. It sold 72,000 copies in its first week.\n \n Rock band Memphis May Fire scores its biggest week ever, as its latest release, Unconditional, opens at No. 4 with 27,000. It easily trumps the act’s previous best frame,when Challenger started at No. 16 with 18,000 in 2012. Unconditional also gives Memphis May Fire’s record label, Rise Records, its second top 10 this year. It follows Of Mice & Men’s Restoring Force, which debuted and peaked at No. 4.\n \n Pharrell Williams‘ G I R L rises one notch to No. 5, selling 25,000 (though it’s down 26 percent). Its cumulative sales now stand at 217,000.\n \n Erica Campbell — one-half of the sister duo Mary Mary — debuts her first solo album, Help, at No. 6 with 23,000. It also jumps to No. 1 on the Gospel Albums chart. Mary Mary has visited the top 10 on the Billboard 200 three times, with a self-titled album in 2005 (peaking at No. 8), The Sound (No. 7, 2007) and Something Big (No. 10, 2011).\n \n YG‘s My Krazy Life tumbles 2-7 in its second week, selling nearly 23,000 (down 62 percent).\n \n Barry Manilow collects his 14th top 10 album as Night Songs debuts at No. 8 with 22,000. Of that sum, 94 percent were sold through the Internet. The album was not available as a download. Manilow achieved his first seven top 10 albums between 1975 and 1979. He didn’t return to the region until 2002’s greatest-hits set Ultimate Manilow reached No. 3.\n \n One year after My Chemical Romance announced its breakup, the band’s first greatest-hits compilation arrives. May Death Never Stop You starts at No. 9 with 20,000 sold. The 19-track set includes four previously unreleased cuts, including Fake Your Death. The song peaked at No. 47 on Hot Rock Songs in March.\n \n Lorde‘s Pure Heroine descends 9-10 on the Billboard 200 with almost 20,000 (down 15 percent).\n \n Over on the Digital Songschart, Pharrell’s “Happy” spends a seventh week at No. 1, selling 321,000 (down 14 percent). John Legend‘s “All of Me” remains at No. 2 with 226,000 (though it’s up 1 percent), and Idina Menzel‘s “Let It Go” continues to rise, up one spot to No. 3 (164,000; down 2 percent).\n \n Jason Derulo’s “Talk Dirty,” featuring 2 Chainz, falls 3-4 with 161,000 (down 14 percent); Katy Perry‘s “Dark Horse,” featuring Juicy J, is steady at No. 5 with 138,000 (down 8 percent); and Aloe Blacc‘s “The Man” is stationary at No. 6 with 124,000 (down 2 percent).\n\nDJ Snake & Lil Jon‘s “Turn Down for What” climbs two positions to No. 7 with 96,000 (up 9 percent), and Bastille’s “Pompeii” holds steady at No. 8 with 93,000 (down 5 percent).\n\nThe Chainsmokers’ “#SELFIE” dips 7-9 with 92,000 (down 9 percent), while Florida Georgia Line’s “This Is How We Roll,” featuring Luke Bryan,” remains at No. 10 for another week, with 77,000 (down 1 percent).\n \n Overall album sales in this past chart week (ending March 30) totaled 4.67 million units, down 1 percent compared with the sum last week (4.71 million) and down 28 percent the comparable sales week of 2013 (6.5 million). Year-to-date album sales stand at 61.7 million, down 17 percent compared with the same total at this point last year (74 million).\n \n Digital track sales this past week totaled 21.5 million downloads, down 1 percent compared with last week (21.6 million) and down 24 percent stacked next to the comparable week of 2013 (28.3 million). Year-to-date track sales are at 312 million, down 12 percent compared with the same total at this point last year (356.5 million).\n \n Next week’s Billboard 200 competes with the same week in 2013 when: Justin Timberlake’s “The 20/20 Experience” spent a third straight week at No. 1, selling 139,000 (down 56 percent). The Band Perry’s “Pioneer” was the chart’s highest debut, arriving at No. 2 with 129,000."
}