{
  "showId": "the-parisian-woman-2017",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/review/parisian-woman-theater-review-1063132",
  "playbillVerdictUrl": "https://www.hollywoodreporter.com/review/parisian-woman-theater-review-1063132",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "From the moment distinguished stage veteran Blair Brown enters Beau Willimon’s diligently up-to-the-minute Beltway play, The Parisian Woman, she creates a character who lives and breathes Washington intrigue, a leathery political survivor toughened by countless battles but still savoring the fight with salty good humor. The trouble is, Brown’s juicy role, the Trump administration nominee for Chairwoman of the Federal Reserve, is a secondary player in a drama that revolves around crafty behind-the-scenes manipulator Chloe, played with maximum glamour and minimum authority by Uma Thurman in a wholly unpersuasive Broadway debut.\n\nThe play was inspired by La Parisienne, an 1885 French boulevard farce by Henri Becque that scandalized audiences in its day with its naturalistic treatment of a married woman juggling two lovers, and using one of those relationships to secure a government position for her husband. Willimon spruced it up by transplanting the action to contemporary Washington, D.C. and stirring in a little same-sex frisson, premiering the makeover in 2013 at South Coast Rep with Dana Delany in the central role of the wily adulteress.\n\nFor his Broadway debut, the playwright has tinkered further, dragging the action into the present and liberally sprinkling the dialogue with references to the chaos of the current White House administration — those jabs are sometimes incisive but more often pandering. When all it takes is phrases like “fake news” or “locker-room talk” to generate huge laughs, perhaps the writing doesn’t require any sting?\n\nBut if you are going to set a play in a very recognizable current reality, you need a believable actor in the central role, and Thurman — whether by instinct, accident or the muddled intentions of director Pam MacKinnon — attacks the part like she’s doing bad Noel Coward in regional repertory theater. “There’s no one quite like Chloe,” says her husband Tom (Josh Lucas), a tax attorney who believes the anything-goes ethos of the Trump regime might give him an actual shot at a Virginia Appeals Court judgeship. He’s not alone in his adoration. Everyone keeps saying how clever, charming and witty Chloe is, which would account for half of Washington flinging themselves into her bed. But Thurman is not comfortable enough onstage to play a woman that comfortable in her own skin.\n\nThe comparison is particularly unfavorable when she’s held up against Claire Underwood, the icily calculating spouse with ambitions played so brilliantly by Robin Wright on Willimon’s House of Cards. For its first season or so, until it became an increasingly ludicrous vehicle for Kevin Spacey’s self-infatuated showboating, the Netflix series was a fascinating study of the duplicitous games of a Washington power couple. The Parisian Woman aims to do something similar with more pointed ties to reality, and within the frame of an old-fashioned sophisticated Broadway comedy.\n\nDesigner Derek McLane’s swanky townhouse is a classic comedy-of-manners set, suggesting impeccable taste and financial comfort but not the kind of extravagant wealth that sates the hunger for more. Chloe and Tom have an open-marriage understanding, but her dalliances with well-connected banker Peter (Marton Csokas) have become bothersome as he makes more and more desperate demands on her time, fueled by suspicions that she’s “cheating” on him with another lover. Still, Tom seizes on the opportunity of Peter’s presence in the house to court his influence with the judicial position.\n\nMeanwhile, Chloe attempts to grease the wheels with savvy Republican career politician Jeanette (Brown), who throws one last blowout drunken dinner before surrendering to the respectability of her new spot running the Fed. Though she tacitly acknowledges concerns about the new president, Jeanette reassures Chloe that everything is under control, seemingly convincing herself at the same time. “We can manage him,” she says, spouting party rhetoric about keeping shoulders to the wheel. Despite rolling her eyes at the firebrand Democratic leanings of her ambitious, fresh-out-of-Harvard Law daughter Rebecca (Phillipa Soo), Jeanette could not be prouder.\n\nThe gaping hole in plausibility that sinks The Parisian Woman comes when word leaks that Tom has been passed over for the Appeals Court. In a marriage built on mutual transparency and respect, it seems inconceivable that Chloe could be caught unawares by the hidden idealism driving this self-made farm boy from Nebraska. Having for years kissed ass and accrued favors from Republicans, Democrats, Wall Street, Big Oil and countless other spheres of influence, Tom pictured himself lying his way through Senate confirmation hearings and then finally being positioned to do something good with his life. It’s difficult to buy Chloe’s wide-eyed surprise at this revelation, but it serves to set in motion the climactic scenes, in which she steps in to fix the situation, perhaps at significant emotional cost to herself.\n\nWillimon teases the identity of Chloe’s strategic extra-extramarital liaison before unveiling a scenario that seems more mechanical than titillating. The playwright layers in wistful recollections of Chloe’s youthful amorous adventures in Paris — hence the title — to convey that there’s still a beating heart beneath her cool, stylish exterior. But the poignancy of her sacrifice doesn’t resonate because Thurman is too stiffly self-conscious to sell it. Nor is there much weight behind Willimon’s comments on a generation that stood by and watched while the political system was defiled, shifting the burden onto to the young up-and-comers to re-establish the virtues of integrity and truth.\n\nWhile Soo’s part is underwritten and lacks impact, the other performances are sturdy, from Brown’s clear-sighted pragmatist to Lucas’ slick operator with a secret moral compass and Csokas’ politically opportunistic moneybags, a whiny fop with a vindictive streak.\n\nBut this is a play with an identity crisis, exacerbated by MacKinnon’s incongruously stylized scene changes — architectural blueprints of halls of power laced with ribbons of news ticker. Visually, these fussy interludes make no sense, beyond echoing the confusion of a work that can’t decide if it’s a sly political thriller about our alarming reality or a conventional drawing-room comedy about no credible reality at all.\n\nVenue: Hudson Theatre, New York\n Cast: Uma Thurman, Josh Lucas, Marton Csokas, Phillipa Soo, Blair Brown\n Director: Pam MacKinnon\n Playwright: Beau Willimon, inspired by Henri Becque’s La Parisienne\n Set designer: Derek McLane\n Costume designer: Jane Greenwood\n Lighting designer: Peter Kaczorowski\n Music & sound designer: Broken Chord\n Projection designer: Darrel Maloney\n Presented by Mark Routh, Richard Frankel, Tom Viertel, Steven Baruch, Steve Traxler, Grad/Ragy, Jam Theatricals, Gabrielle Palitz, in association with Marvin Rosen, Andy Okoskyn/Ivanna de Benito, Peter and Susan Crampton Davis, Peggy Hill, Terence and Lori Street, Lucille Werlinich, Cecelia Joyce Johnson/Deep End Productions, Thomas Kranz/Robert Shelley, Joe Watson",
  "isFullReview": true,
  "textWordCount": 1087,
  "archivePath": "data/archives/reviews/the-parisian-woman-2017/hollywood-reporter--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:03:25.216Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 1087,
  "tierReason": "Full review text"
}