{
  "showId": "summer-1976-2023",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Sandy MacDonald",
  "url": "https://nystagereview.com/2023/04/25/summer-1976-an-odd-couple-of-midwestern-moms/",
  "publishDate": "2023-04-25T20:54:24",
  "fullText": "Relationships need not last long to have a profound impact: some prove pivotal. In his new two-hander, Summer, 1976, David Auburn limns a flash-point friendship formed in the torpid summer of the title year. Jessica Hecht plays Alice, a laid-back midwestern faculty wife who befriends her antithesis: Diana (Laura Linney), a teaching artist who’s her seeming superior in every arena, from aesthetic to intellectual – or so Diana would have Alice believe.\n\nIf their names recall a restaurant and a realm, it’s perhaps no accident. Their relationship, captured primarily one long kaleidoscopic flashback, is a study in cultural contrasts and the resulting disjunct in power dynamics. Alice is sweet, dithery, vague, but well meaning – a Edward Koren cartoon brought to life – whereas Diana is brittle and driven, intent on projecting a put-together, stylish persona. (Linda Cho’s all-purpose costume choice spans the decades: Diana in sleek, timeless black, Alice adrift in a blowsy Indian-print dress.)\n\nEach woman is the mother of a young girl. Diana, reminiscing, has the gall to note that at first she found Alice’s daughter (“Holly!” she sneers) repugnant, from her drippy nose to her very name (Diana recommends allergy shots; the name, not surprisingly, sticks). The two women initially bond over a shared joint while the girls play in Alice’s yard: Alice offers and Diana avidly accepts, if only to advertise that she’s hip. That performative bent is a tell: When, even in the hazy recesses of the 1970s, was dope-smoking a competitive sport? And even then, wouldn’t one mother abstain, in the interest of keeping an eye on the children?\n\nIn Diana’s case, ego comes first at all costs. Convinced that she has fashioned an impeccable life as a single mother by choice (she brags about keeping the unsuspecting impregnator, a “deeply not-bright glassblower,” in the dark), Diana – who admits to having “family money” – decides to take Alice on as a makeover project. Never mind that Alice is fairly content as is. Not only is her economist husband up for tenure, he has initiated a barter system that is pure ’70s – a childcare cooperative ensuring that impecunious faculty need not blow money on babysitters.\n\nSo taken with each other are Diana and Alice, however, they become a gratis co-op of two. So far, so cozy. But Auburn has odd twists up his sleeve, characterological MacGuffins that lead the viewer down various intriguing suppositional paths.\n\nWith her signature languid diction (which does not translate easily to the Midwest), Hecht’s delivery can sometimes wear, but watch her closely. Her micro-reactions are mercurial and deep. Alice appears to have a native intelligence that Diana lacks. Meanwhile, Linney keeps Diana’s mean-girl vibe in check just enough so that she’s not overtly off-putting. Diana will charm you, as she does Alice. It’s easy to see how an unsophisticated admirer might sign on as an acolyte.\n\nWith these antipodes, Auburn has seemingly come up with a way to represent the puzzling bifurcation in women’s objectives over the past half-century: glamour at all costs vs. industry, endurance, and actual power and progress.\n\nIn the case of these unlikely friends, do we see a comeuppance coming? If so, it’s subtle, a mere postscript. While it might be gratifying to observe a relentless poseuse cut down to size, Auburn blunts the blow, having already strewn the path with ambiguous omens. Diana’s efforts to maintain a façade are bound to come at a cost.\n\nThe production itself is flawless: A seemingly plain box of a set by John Lee Beatty transforms, via the lighting magic of Japhy Weideman, into a twilight patio, a museum cafe, and more, while Jill BC Du Boff’s sound design lends the illusion of intimacy. Director Daniel Sullivan deftly delineates every interaction – subdued to explosive.\n\nSummer, 1976 opened April 25, 2023, at Samuel J. Friedman Theatre and runs through June 18. Tickets and information: manhattantheatreclub.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
