{
  "showId": "the-terms-of-my-surrender-2017",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "https://dougmarino.blogspot.com/2017/08/the-terms-of-my-surrender.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "“Theater? Only in the abstract sense. Entertainment, most certainly…A blistering one-man show with a purpose and theme…Moore regales us with stories of his youth, middle age, and current time that proves that message and entertains all in his cantankerous and humorous manner we are accustomed to…In my opinion he was not as blistering or mean as I think he could be…I was pleasantly surprised and even a bit motivated myself after leaving the theater.”\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 209,
  "archivePath": "data/archives/reviews/the-terms-of-my-surrender-2017/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T19:34:44.377Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 209 (min: 300)",
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Self promotion with a purpose. Theatre? Only in the abstract sense. Entertainment, most certainly. Michael Moore, an unconventional choice for the Broadway stage, makes his debut in this blistering one-man-show with a purpose and theme. Mr. Moore's theme which binds the entire book of the show is that one man can do something small and make a big difference. Mr. Moore regales us with stories of his youth, middle age, and current time that proves that message and entertains all in his cantankerous and humorous manner we are accustomed to. Make no mistakes, the only republicans in the theatre are maybe only a reluctant spouse or two. Mr. Moore makes sure we are aware of who they are too. Of course he blisters the current Cheeto-head president. He also blisters Flint, Michigan, and Ronald Reagan, and he makes the case that everyone needs to do something and that even something small has the ability to make big change. In my opinion he was not as blistering or mean as I think he could be. His theme and stories really did try to convince people to get off their asses and do something to make change. I was pleasantly surprised and even a bit motivated myself after leaving the theatre."
}