{
  "showId": "american-buffalo-2022",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Christian Holub",
  "url": "https://ew.com/theater/theater-reviews/american-buffalo-review-sam-rockwell-laurence-fishburne-david-mamet/",
  "playbillVerdictUrl": "https://ew.com/theater/theater-reviews/american-buffalo-review-sam-rockwell-laurence-fishburne-david-mamet/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "When American Buffalo first premiered decades ago, Mamet's language was the main attraction. But the price of influence is dilution. In the 21st century, the dialogue in everything from Spider-Man comics to Judd Apatow movies is written in imitation of Mamet's fast-paced style, and curse words are no longer so alarming (which might explain why the playwright now provokes audiences by spouting absurdities on Fox News). In this era, the attraction offered by reviving American Buffalo is not just t",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-AMERICAN-BUFFALO-Opens-On-Broadway-Starring-Darren-Criss-Sam-Rockwell-and-Laurence-Fishburne-20220414",
  "showScoreExcerpt": "\"Two questions hang over the characters of 'American Buffalo,' David Mamet's iconic 1975 play now in its third Broadway revival. First: Am I being ripped off? Second: Am I ripping off other people enough? Though the novelty of the playwright's trademark fast-paced, profanity-laced dialogue has worn off a bit amid the passing decades and sprawling imitators, these concerns feel as relevant to contemporary American life as ever.\"\n\nRead more",
  "contentTier": "invalid",
  "rejectedAt": "2026-02-07T07:23:06.623Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is only an introductory paragraph with 'Read more' - it provides context about the play but contains no evaluative content or critical assessment of the production; openai: The text provided is an excerpt that primarily discusses the themes and context of the play rather than evaluating the current Broadway production.",
  "promptVersion": "5.2.0"
}
