{
  "showId": "american-buffalo-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2022/04/14/american-buffalo-mamets-classic-is-in-mint-condition/",
  "publishDate": "2022-04-14T21:55:33",
  "fullText": "There’s a reason that David Mamet’s American Buffalo has been performed innumerable times since its 1975 premiere. This drama about a trio of low-level hustlers offers a smorgasbord of acting opportunities for its three male leads, and with its central character Teach, a histrionic role to rival Mama Rose in Gypsy. Except that Teach doesn’t deliver a showstopping 11:00 number, but rather a veritable aria of four-letter words.\n\nThe current Broadway revival seems designed to showcase Sam Rockwell, who has often played fast-talking, dim-witted and often racist characters in his illustrious career, as exemplified by his Oscar-winning turn in Three Billboards Outside Ebbing, Missouri. The role of Teach seems tailor-made for him, much as it did for Al Pacino decades earlier, and, not surprisingly, he kills in the part. But what makes this production so successful — unlike its previous, mediocre Broadway revival in 2008, starring John Leguizamo, Cedric the Entertainer and Haley Joel Osment, which only lasted a week — is that his co-stars are equally up to the challenge.\n\nLaurence Fishburne’s portrayal of Donny, the larcenous junk-shop owner who sets in motion an ill-conceived plot to burglarize the home of a coin collector, is the strongest I’ve ever seen (and I’ve seen a lot). His Donny is not just a friend and foil to Teach, but a complexly enigmatic figure simmering with a rage only barely concealed by his surface geniality. Throughout the evening, Fishburne uses his richly deep voice and imposing physicality to cannily restrained effect, which makes his violent eruption near the play’s end, when Donny goes after Teach with violent ferocity, all the more frightening. And his cowering in fear every time a police car cruises by the shop all the more pathetic.\n\nBobby, the young junkie who acts as a go-fer for the other men and who repeatedly shows up asking for money, is a thinly written character by comparison. But Darren Criss, more used to being a Broadway musical leading man with his previous turns in Hedwig and the Angry Inch and How to Succeed in Business, does extremely well with the role, suppressing his heartthrob looks with a hangdog physicality and strangulated demeanor. As he previously demonstrated with his Emmy-winning turn in TV’s The Assassination of Gianni Versace, he’s got serious dramatic acting chops, and his decision to further develop them with this supporting turn proves wise.\n\nRockwell plays Teach with the requisite live-wire intensity that we’ve come to expect, and doesn’t disappoint. He’s also often hilariously funny, cutting a ridiculous-looking figure in his horrendous, period-appropriate plaid polyester pants, lavender shirt and Members Only jacket. He amusingly leans into Teach’s ineptitude at crime, shrugging off Donny’s question about how he plans to get into the house they intend to rob. “There’s always something,” he says blithely. “We’ll see when we get there.” By contrast, he takes his position in the world very seriously, serving as a symbol of the pursuit of the American dream that is all too often fruitless. “I’m a businessman,” Teach asserts with no trace of irony. “I’m here to do business.” And business, as Mamet has shown us time and time again, is a matter of dog eats dog.\n\nDirector Neil Pepe, the longtime artistic director of Atlantic Theater Company who has frequently collaborated with Mamet, proves fully attuned with the playwright’s rhythms with his taut, fast-paced staging. There are times when the production veers too heavily into the play’s humor at the expense of its menace, but it’s consistently engrossing and the actors display an ease and comfort with the material for which he obviously deserves much credit.\n\nAmerican Buffalo offers a feast not only for its performers, but also its set designers. Scott Pask has seized the opportunity with gusto, providing a richly tacky setting so laden with bric-a-brac, including many objects suspended overhead, that every thrift shop and Goodwill store in town must surely be stripped bare.\n\nMamet himself hasn’t done this production any favors with his devolution into reactionary conservatism, as demonstrated by his recent Fox News interview in which he declared that “teachers, are inclined, particularly men, because men are predators, to pedophilia.” He also appeared on Real Time with Bill Maher, where the host asked him about his assertion in his new book that it was the Left, not the Right, that had attempted a coup. Mamet unconvincingly responded that he had “misspoke” and urged readers to “skip page 2,” as if he had made a drunken outburst at a party rather than committing his views to print. There will be some, no doubt, who will choose to avoid seeing Mamet’s plays due to his current viewpoints.\n\nBut that shouldn’t stop anyone from seeing this superbly acted production of one of his most important plays. As with Richard Wagner and T.S. Eliott, among a depressingly large number of others, one has to separate the artist from his work.\n\nAmerican Buffalo opened April 14, 2022, at the Circle in the Square and runs through July 10. Tickets and information: americanbuffalonyc.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
