{
  "showId": "american-buffalo-2022",
  "outletId": "unknown",
  "outlet": "unknown",
  "criticName": "Unknown",
  "url": "https://www.nytimes.com/2022/04/14/theater/american-buffalo-review.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"When 'American Buffalo' first hit the stage, in Chicago in 1975, its portrait of lowlifes like Teach — two-bit grifters aping the realpolitik of American business — was a game changer. Though it did not quite induce sympathy for a man who would strike a kid in the face with an iron, it did make audiences queasy about the respectable entrepreneurs whose behavior Teach was translating to his own turf. In language as crass and cadenced as gunfire, Mamet turned their man-eat-man philosophy, which some call capitalism, into brutal prole poetry: a poetry of predation, you might even say.\"\n\nRead more",
  "contentTier": "invalid",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "rejectedAt": "2026-02-03T13:17:41.443Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is historical context about the original 1975 production with no evaluation of the current Broadway revival. It ends with 'Read more' indicating this is just an excerpt from a larger piece that likely contains the actual review.; openai: The excerpt provided is a historical context and analysis of the play's themes, not an evaluation of the current Broadway production.; gemini: This excerpt provides context about the play's history and themes, but it doesn't offer a direct evaluation of the current Broadway production's performances, direction, or overall quality. It's more of a historical analysis than a review.; kimi: The excerpt explicitly discusses the original 1975 Chicago production ('when American Buffalo first hit the stage, in Chicago in 1975') and evaluates that historical staging. It contains no mention of or evaluation for a current Broadway revival, its cast, direction, or staging.",
  "promptVersion": "5.2.0"
}
