{
  "showId": "holiday-inn-the-new-irving-berlin-musical-2016",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Unknown",
  "url": "https://www.theguardian.com/stage/2016/oct/06/holiday-inn-review-roundabout-theater-company-irving-berlin",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2016/oct/06/holiday-inn-review-roundabout-theater-company-irving-berlin",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "fullText": "You’ll regularly check out: Corbin Bleu, Lora Lee Gayer and Bryce Pinkham in Holiday Inn. Photograph: Joan Marcus/APView image in fullscreenYou’ll regularly check out: Corbin Bleu, Lora Lee Gayer and Bryce Pinkham in Holiday Inn. Photograph: Joan Marcus/AP This article is more than 9 years oldReviewHoliday Inn review – Irving Berlin musical full of suite nothingsThis article is more than 9 years oldRoundabout Theater Company, New YorkThe songs are a zippy treat, but the clunky dialogue and air of old-time predictability may leave audiences with reservations\n\nWith Holiday Inn, a wan jukebox musical centered on the songs of Irving Berlin, the Roundabout Theater Company has entered hostel territory. A loose adaptation of the 1942 Bing Crosby and Fred Astaire film, its plot concerns Jim (Bryce Pinkham), a nightclub song-and-dance man who dreams of forsaking the bright lights of Flatbush for the dimmer bulbs of rural Connecticut.\n\nAfter his callous fiancee, Lila (Megan Sikora), leaves him to go on the road with his dashing partner, Ted (Corbin Bleu), Jim makes a half-hearted attempt at farming, then turns his home into a show palace with the help of a shy schoolteacher, Linda (Lora Lee Gayer), and a brassy handywoman, Louise (Megan Lawrence), replacing the mammy of the film. The catch: the guesthouse is only open on holidays when Jim’s former colleagues are at liberty. Apparently chorus girls and boys never work on New Year’s Eve or the Fourth of July. Who knew?\n\nThe book, by Gordon Greenberg and Chad Hodge, has modernized the tale somewhat (the blackface routine is no more), but not too much. (Surely in this day and age it would be Jim and Ted who band together to open that B&B. And they might have decorated it more handsomely.) The story has an old-timey predictability that may delight those with more conservative tastes, but no real effort has been made to differentiate this show from the other recent Berlin offering, White Christmas, or to integrate the songs into the show. “What could be better than Broadway?” a hoofer asks. Then Jim launches into Blue Skies. You can check out anytime you like, and chances are that one will – and quite often – as the leaden dialogue trudges to its close.\n\nStill, the Berlin tunes – White Christmas, Easter Parade, Cheek to Cheek – are of course a treat, with zippy orchestrations courtesy of Larry Blank and zestful playing by the orchestra, with Andy Einhorn conducting. Several of the production numbers are lackluster, but the choreographer Denis Jones contributes two show-stoppers, a jubilant Shaking the Blues Away, in which the chorus skip rope with Christmas garlands, and a percussive tap routine for Song of Freedom.\n\nThe acting is variable, in part because the book is so thin. Greenberg’s direction doesn’t veer from the expected. Pinkham, Gayer and Lawrence are given enough lines to create recognizable characters, but Bleu doesn’t seem to have been given any character and Sikora has little to do except vamp and shimmy. It’s too much to expect a musical to provide maid service or a mint on every seat, but if a new musical ever needed fresh linens, it’s this one.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 544,
  "archivePath": "data/archives/reviews/holiday-inn-the-new-irving-berlin-musical-2016/guardian--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:29:52.592Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 544,
  "tierReason": "Full review text",
  "bwwExcerpt": "The book, by Gordon Greenberg and Chad Hodge, has modernized the tale somewhat (the blackface routine is no more), but not too much. (Surely in this day and age it would be Jim and Ted who band together to open that B&B. And they might have decorated it more handsomely.) The story has an old-timey predictability that may delight those with more conservative tastes, but no real effort has been made to differentiate this show from the other recent Berlin offering, White Christmas, or to integrate ",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-HOLIDAY-INN-Opens-on-Broadway-20161006"
}
