{
  "showId": "holiday-inn-the-new-irving-berlin-musical-2016",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Unknown",
  "url": "http://www.thewrap.com/holiday-inn-broadway-review-like-visiting-berlin-before-the-fall-of-the-wall/",
  "playbillVerdictUrl": "http://www.thewrap.com/holiday-inn-broadway-review-like-visiting-berlin-before-the-fall-of-the-wall/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "“Holiday Inn” is the kind of musical that makes you wish there were fewer holidays in the year. By the time the show’s big Fourth of July number rolls around, theatergoers will be hoping they skip Labor Day and Thanksgiving to wrap it up quickly with a Santa Claus finale. Slower than that spiritless denouement is the entire first act, which takes 50 minutes to deliver the show’s farm-saving concept that everyone knew before walking into Studio 54, where this “new Irving Berlin musical” opened Thursday under the auspices of the Roundabout.\n\nThe old 1942 Irving Berlin movie stars Bing Crosby as the crooner who retires to run a farm but instead turns his newly-bought Connecticut mansion into an inn open only on holidays. His hoofer friend Fred Astaire continues to perform professionally, and in the process keeps stealing Bing’s showbiz-possessed girlfriends, played by the unmemorable Virginia Dale and Marjorie Reynolds.\n\nOne way in which the 2016 stage musical replicates the classic movie is in its casting of the girlfriends, with neither Lora Lee Gayer nor Megan Sikora being in any way memorable. Needed for the good-girl brunette and the tough-girl blonde are Laura Benanti and Kristin Chenoweth, respectively. “Holiday Inn,” then and now, needs stars.\n\nBryce Pinkham and Corbin Bleu aren’t Crosby and Astaire, but they bring the show its few occasional sparks. Pinkham can sing and Bleu can tap. In an odd bit of a cast splicing, it’s as if Astaire has been cloned to play both roles, with Crosby’s comfy charm and sonorous baritone completely banished. Pinkham’s voice is much stronger than Astaire’s, and better yet, he honors the almost lost Broadway tradition of the romantic tenor, without trying to butch it up with a contempo twang.\n\nGordon Greenberg and Chad Hodge‘s book finds room for over 20 Berlin standards, which in typical Studio 54 fashion are delivered by a small band when a full orchestra is required.\n\n“Holiday Inn” is that “let’s put on a show in the barn” kind of musical, with “barn” being the operative word for Anna Louizos’s cardboard scenic designs. Greenberg’s direction rarely succeeds in filling the vast space.",
  "isFullReview": true,
  "textWordCount": 357,
  "archivePath": "data/archives/reviews/holiday-inn-the-new-irving-berlin-musical-2016/thewrap--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:31:25.856Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 357,
  "tierReason": "Full review text"
}