{
  "showId": "the-other-place-2013",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Scott Brown",
  "url": "http://www.vulture.com/2013/01/theater-review-the-other-place.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Metcalf supplies the gravitation that holds it all together, even as her immense centrifugal energy is, simultaneously, working to fling it all apart. Her physical and spiritual transformation over the course of this brief, intense story is total. I greatly enjoyed The Other Place in its original Off Broadway incarnation, but I wondered if Joe Mantello's exquisite, bounded-in-a-nutshell production would scale up to Broadway. It does, I'm thrilled to report, and a great deal of the credit is due Metcalf herself, who's found several clever ways-near-subliminal physicalization, megaphonic emotional projection-to turn a delicate chamber performance into a great ringing cry from the darkness, suitable for an amphitheater.",
  "bwwScore": 8,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-OTHER-PLACE-Opens-on-Broadway-Updating-LIVE-20130110",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nZoe Perry and Laurie Metcalf in The Other Place.\n Photo: Joan Marcus\n \n \n \n Theory: Laurie Metcalf is composed of what physicists call “exotic matter.” Good luck keeping track of her exact mass, her precise properties: She’s passing between dimensions right before our eyes, and daring us to keep up. In Sharr White’s haunting, yet startlingly brisk psychological drama The Other Place, Metcalf exists in a state of physical and mental flux that keeps us guessing and the play vibrating, affectingly and never affectedly, safely outside the bandwidth of melodrama. She plays Juliana, a top-tier neurological researcher-turned-drug-company shill, and we meet her in mid-lecture. Which, we instantly sense, is her natural state. (If you’re already detecting a little Wit in White’s play — a few choice threads of its DNA, perhaps — you’re not off-base.)\n\nJuliana is actually lecturing us about a lecture, a “sales pitch” for a new dementia drug she delivered at a resort hotel in St.Thomas — and about what happened next. But “next,” we soon learn, is a slippery concept in The Other Place. Juliana, hyper-conscious of the default-sexism of her field (“ … these are Old Boy events at which women usually do not appear unless to provide some sort of illicit service … ”), spies an interloper: a “buoyant” girl in a yellow string bikini, who surreally takes a seat in the convention hall alongside a pack of mostly male physicians. Offended on multiple levels, she takes aim at the scantily clad stranger, and almost instantly experiences a terrible sense of regret. Meanwhile, interspersed with this recollection, splinters of other scenes intrude: Juliana’s having a tart little sparring match with her estranged husband, Ian (Daniel Stern, patient and bruised), about her recent “episode” in St. Thomas and his recent, alleged infidelity. Juliana’s on the phone with her son-in-law, a former colleague (John Schiappa), and there’s bad blood between them: Her daughter, Lauren, won’t even come to the phone. Juliana’s seeing a neurologist (a superb Zoe Perry), whom she badgers and bullies.I give nothing away by revealing that some of these events and people are real, while others are vivid inventions of Juliana’s brilliant, actively disintegrating mind. Even compromised, she’s a formidable opponent, with a will strong enough to impose even a fragmented and unreliable reality on everyone around her. White writes with great simplicity and discipline about a situation that defies discipline, defies neatness. (There are a few plotty wrinkles that show some evidence of compression and fuss, but this is a quibble.) We’ve seen many powerful stories about the fall of a great, controlling intellect to the ineluctable forces of decline. White’s is not the most ambitious of these, but it’s one of the more piercing and tonally on-target. On a less literal level, The Other Place is a play about regret, remorse, and the extraordinary measures a powerful personality will take to sequester those toxic life-by-products from the conscious mind. But foremost, the play is Juliana, a woman who’s spent a lifetime making her case before skeptical, hostile tribunals, and always winning the day. Metcalf supplies the gravitation that holds it all together, even as her immense centrifugal energy is, simultaneously, working to fling it all apart. Her physical and spiritual transformation over the course of this brief, intense story is total. I greatly enjoyed The Other Place in its original Off Broadway incarnation, but I wondered if Joe Mantello’s exquisite, bounded-in-a-nutshell production would scale up to Broadway. It does, I’m thrilled to report, and a great deal of the credit is due Metcalf herself, who’s found several clever ways — near-subliminal physicalization, megaphonic emotional projection — to turn a delicate chamber performance into a great ringing cry from the darkness, suitable for an amphitheater. One minute she’s massive; the next, mouselike; and finally, painfully, merely person-sized. We can’t get a fix on her until she wants us to; but boy, does she have a fix on us.\n\nThings you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 678,
  "archivePath": "data/archives/reviews/the-other-place-2013/vulture--scott-brown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:26:10.169Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241225210808",
  "archiveOrgUrl": "http://web.archive.org/web/20241225210808/https://www.vulture.com/2013/01/theater-review-the-other-place.html",
  "wordCount": 678,
  "tierReason": "Full review text"
}