{
  "showId": "marvins-room-2017",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "https://dougmarino.blogspot.com/2017/06/marvins-room.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Lili Taylor and Janeane Garofalo and Celia Weston form a magnificent trio of family lost and floundering with life at large. But in their efforts. they are flat. Completely flat. Other than a few laughs and a few serious moments, I never even felt these three women were family...It seems the trend these days: strip away the costumes, the set, the makeup and glamour and lay bare the script for all. Well, it hasn't always worked in the past, and employing the gimmick this time hasn't either.\"\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 253,
  "archivePath": "data/archives/reviews/marvins-room-2017/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T17:47:46.585Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 253 (min: 300)"
  ],
  "showNotMentioned": true,
  "wrongFullText": "This revival of Marvin's Room may leave you wondering why people revive plays at all - especially when there have been a very successful movie (Leonardo DiCaprio) and had well received original off-Broadway and regional productions. It would seem that you either have to do as well as the previous two or take your toys from the sandbox and just go home. This revival is unfortunately the latter case. Don't get me wrong - Lili Taylor (Bessie) and Janeane Garofalo (Lee) and Celia Weston (Ruth) form a magnificent trio of family lost and floundering with life at large. But in their efforts - they are flat. Completely flat. Other than a few laughs and a few serious moments - I never even felt these 3 women were family. Neighbors maybe, but family no. Bring in young Hank (Jack DiFalco) and Charlie (Luca Padovan) and it seems like they all just met at the day care. No connections whatsoever. The set is lackluster at best - not a typical Roundabout production at all. Like everything about this revival - lackluster and bare. It seems the trend these days - strip away the costumes, the set, the makeup and glamor and lay bare the script for all. Well, it hasn't always worked in the past, and employing the gimmick this time hasn't either. It's a touching play (Scott McPherson) but this incarnation left me feeling empty and un-touched. I wanted the subject to move me but a juggernaut this time around this play is not."
}