{
  "showId": "cats-the-jellicle-ball-2026",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "https://www.nydailynews.com/2024/06/20/theater-review-cats-the-jellicle-ball-is-an-inspired-reimagining-of-the-broadway-classic/",
  "playbillVerdictUrl": "https://www.nydailynews.com/2024/06/20/theater-review-cats-the-jellicle-ball-is-an-inspired-reimagining-of-the-broadway-classic/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "At \"Cats: The Jellicle Ball,\" an inspired reimagining from the directors Zhailon Levingston and Bill Rauch of the adored and despised 1981 Andrew Lloyd Webber musical as a ballroom-fueled extravaganza, you get to question your 1980s musical-theater kibble and savor it anew.The kitty party's on at the Perelman Performing Arts Center at the World Trade Center, but this affair would get a big meow on Broadway if the Lord Lloyd Webber chooses to bless its well-twirled whiskers. The Runway could easily could be moved right into Circle on the Square.\n\nGreat musicals — heck, great theater — often flows from a really good idea, at once radical and obvious. Here is the central notion here: \"Cats\" doesn't have to be performed by cats. It can be a metaphor, stupid. A community of outsiders (the world of queer ballroom) that knows loss but also how to celebrate its own diversity and triumphs. And that likes to come out at night.\n\nKitties prowling the aisle is just so very much your parents' \"Cats,\" kids, especially after the disastrous 2019 movie that creeped everyone out with its scary feline CGI. That abomination took down even Taylor Swift.\n\nErgo, why not turn most of the Cats into ballroom queens, call up André De Shields and a Gandalf-like wig to end all wigs for Old Deuteronomy, and turn the show into a performative contest with some nods to \"Six The Musical,\" even as the production values make half of Broadway look cheap?\n\nWhy not, indeed. As I well remember when I first stared, open-mouthed at this show back in 1981, \"Cats\" was the original concept musical, always set up as a competition for kitty immortality, with only Grizabella headed to the Heaviside Layer (here, just living freely in New York) to live more of her nine lives. Based on a collection of T.S. Eliot poems featuring cats with different situations and personalities, it was built to be a series of bravura turns from the likes of Rum Tum Tugger (Sydney James Harcourt), Skimbleshanks (Emma Sofia), Macavity (Antwayn Hopper), Mungojerrie (Jonathan Burke) and house mother Jennyanydots (Xavier Reyes), newly and flashily choreographed with pizzazz and panache by Arturo Lyons and Amari Wills.\n\nIn this version, which begins with a DJ (Capital Kaos) blowing the dust off some \"Cats\" original soundtrack vinyl (talk about making some of us feel old) and the audience exhorted to not be trembling kitties as in the show's past but participatory party cats, the show becomes a tribute to New York's drag and queer ballroom history — even replete with vintage footage of lost ancestors, providing the Act Two some striking emotional oomph.\n\nThe show operates around a runway with De Shields' regal self sitting, Simon Cowell-like, in the seat of judgement. This entire conceit is a gift for a costume designer, of course, but even allowing for that, Qween Jean knocks it out of the litter box, time after time after time. The wigs alone cry for a Tony.\n\nThis is obviously not the first deconstruction of a classic Broadway title, but what makes this one different from say, the very chilly Daniel Fish \"Oklahoma,\" or the inuring recent \"Cabaret,\" is that this \"Cats\" doesn't shock or confront but meets audience members of different ages and persuasions wherever they may land (Rauch, especially, has a long history of knowing how to include everyone).\n\nThe show, sexy throughout, comes off as a celebration of love and resilience, timeless Broadway themes long proven to work with middle America. and what is yet more impressive (and, frankly, surprising) is how much the crew actually respects the material.\n\nYou read that right. They respect \"Cats.\" They dignify \"Cats.\" They elevate \"Cats,\" and certainly make it work for a new moment where queens now sit on thrones unimaginable in 1981.\n\nThere are some fresh, more percussive orchestrations but I know this show well, and as far as I can tell, they play every note of the score. And speak almost every line, with a few lively additions.\n\n\"Cats\" remaining \"Cats,\" of course, won't ever work for some, T.S. Eliot will be doing a few spins in his grave this summer, and there sure are subtler attractions than this one. But this four-letter title did not makes millions for decades without sticky, bop-along tunes like \"Magical Mister Mistoffeles\" and \"Jellicle Songs for Jellicle Cats.\" Those are highlights, as is the moving performance of Junior LaBeija as Gus, the old theater cat for whom I find myself having increasing sympathy.\n\nThis show has not fully wrestled with the vocal demands of \"Memory,\" the most famous song and a power ballad here performed by \"Tempress\" Chastity Moore with a highly potent emotional key (truly) but not enough of a thrilling soar to top everything else, a necessity actually baked into the structure of the show and especially applicable to this particular treatment.\n\nStill, this creative team, including set designer Rachel Hauck (deceptively brilliant here) had an idea for every moment of the show. I can't overestimate how exciting it is to see an updating that, unlike the recent \"Cabaret\" and \"Oklahoma\" revivals, actually adds meaning and gravitas to the original while respecting original authorial intent and not running afeard of offering popular entertainment. And dispensing hope.\n\n\"Look, a new day has begun,\" they sing at the end.\n\nLong live \"Cats: The Jellicle Ball.\" Tough ticket all summer, I suspect.",
  "isFullReview": true,
  "textWordCount": 900,
  "archivePath": "data/archives/reviews/cats-the-jellicle-ball-2026/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:00:42.623Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "Insufficient text in archive: 200 chars"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240621010655",
  "archiveOrgUrl": "http://web.archive.org/web/20240621010655/https://www.nydailynews.com/2024/06/20/theater-review-cats-the-jellicle-ball-is-an-inspired-reimagining-of-the-broadway-classic/",
  "contentTier": "complete",
  "wordCount": 900,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Off-Broadway run at Perelman Performing Arts Center, June 2024",
  "bwwExcerpt": "The whisker of a plot and lyrics are drawn from T.S. Eliot's 'Old Possum's Book of Practical Cats.' A posse of pusses gather to see which one gets a shot at a new life. Who could it be? The Rum Tum Tugger (Tyler Hanes), who struts like a rock star? Twinkled-toed Jennyanydots (Eloise Kropp)? The frisky and nimble Skimbleshanks (Jeremy Davis)? The amazing often airborne Mistoffelees (Ricky Ubeda)? Or a dozen others? It's not much of a spoiler that it's shunned and bedraggled outcast Grizabella (Leona Lewis). After all, she gets 'Memory.' Too bad she inspires so little sympathy. The show's first tagline was 'now and forever.' More fitting for 'Cats' 2.0 - now and whatever.",
  "bwwScore": 5
}
