{
  "showId": "schmigadoon-2026",
  "outletId": "av-club-shannon-miller",
  "outlet": "A.V. Club (Shannon Miller)",
  "criticName": "Shannon Miller",
  "url": "https://www.avclub.com/apple-tv-plus-schmigadoon-offers-grand-musical-number-1847233449",
  "playbillVerdictUrl": "https://www.avclub.com/apple-tv-plus-schmigadoon-offers-grand-musical-number-1847233449",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "There’s a duality to splashy Broadway-style musicals that garner almost equal shares of love and hate. For many, musicals are universes where conflicts arise and conclude with enviable ease, and sweeping melodies are conduits for otherwise complex expression. Whether the story ends with hope or tragedy, impactful musicals have the ability to emotionally rock audiences and offer worlds where one can truly escape or feel inspired. That said, there’s also a very vocal population that will attest, sometimes fairly, to the genre’s inherent absurdity. After all, where else can predictable character archetypes reign and large groups of strangers digress into coordinated dance troupes who sing through their issues? Even the biggest Broadway devotee can set aside their love for a moment to recognize when something is ripe for parody. Schmigadoon!, a new musical comedy executive produced by Lorne Michaels for Apple TV+, straddles the thin line between lauding and lampooning the artform with a story that harkens to the Golden Age of cinematic musicals. Equipped with a cast of comedy and live theater aces, the six-episode saga wastes no opportunity to flex with crisp numbers that aesthetically jibe with the Metro-Goldwyn-Mayer features of yore. It also digs at the subgenre of saccharine storytelling and its now-outdated approaches to love and humanity with the introduction of modern-day elements—that is, a New York couple that is magically transported from 2021 to the old-fashioned town of Schmigadoon with little hope of escaping. It’s a classic fish-out-of-water tale where two outsiders are dropped into an environment that they are invariably meant to alter with their big city ideas, like gender equality or songs without corresponding tap routines. But those newer elements don’t affect much at all. For all its fun and flair, Schmigadoon! doesn’t bring much in terms of real stakes, perspective, or even a strong comedic voice. It’s just enjoyable enough to get into the sunny, familiar music breaks, but beyond that, the first season ultimately squanders its stacked cast, fumbling a chance to enmesh two totally opposite worlds. Schmigadoon! centers on Melissa (Cecily Strong) and Josh (Keegan-Michael Key), two doctors who have been dating for years. It’s clear from the beginning that they are emotionally on different pages: Melissa is eager to advance to the next stage of their relationship whereas Michael is perpetually laid-back and much more hesitant to broach the topic of marriage. This causes enough strife for them to seek intervention in the form of a couples retreat where they hope to reconnect. Instead, they end up lost in the woods and arrive at a magical bridge. Seeking shelter from bad weather, they cross the bridge into Schmigadoon, a small town frozen in time. They are immediately confronted with an introductory musical number that presents the town, its stable of characters, and its old fashioned ideals of romance and gender. This moment also reveals the mostly static dynamic between the two newcomers and this odd community. Melissa, an ardent fan of musical theater, is delighted by the display. Josh, who clearly doesn’t share his girlfriend’s enthusiasm, mostly rolls his eyes while looking for the nearest exit. When it’s revealed that their only way to escape the town is to cross the bridge with their true love—a message delivered by a bridge leprechaun played all too briefly by Martin Short—it becomes clear that the struggling couple must interact with the townspeople in hopes of finding their tickets back to the reality they once knew. Throughout the season, Strong and Key, two comedic heavy-hitters who have more than proven their cleverness over the years, are mostly relegated to meaningless observations of their surroundings (“Yay, another song,” for Strong; “Oh no, not another song,” for Key) and the occasional circuitous argument. They don’t really influence their new home, often looking on from the sidelines as the town offers heaps of melodic exposition. In turn, the Schmigadoon residents don’t have much to sing about either. There aren’t many twists, shocking revelations, or anything that makes the story a particularly interesting one to tell. To her credit, Strong appears genuinely entertained and can hold a lovely note alongside the rest of the stage-ready cast. Still, neither the writing nor direction take advantage of the skills that Strong has honed throughout her time on Saturday Night Live. They also do no favors for Key, whose character is mainly focused on getting out of the town by any necessary means. Selfish and somewhat uncaring, Josh is, by definition, unlikable. But he isn’t engaging enough for his unpleasantness to make any lasting impact on the viewer. Key, like most of the cast, appears to hold back a lot, which makes Josh as forgettable as Melissa—the only factor that seems to bind this couple at all. Schmigadoon!’s two stars join Alan Cumming, Jaime Camil, and Fred Armisen, all of whom have their potential ultimately wasted on stilted storytelling and lackluster jokes. Cumming is especially trapped in a one-note bit as the mayor who is secretly gay. Oh, and his name is Mayor Menlove. Get it? The show’s saving grace arrives in the season’s penultimate episode, where Kristin Chenoweth is granted the space to show off her Broadway prowess in an impressively quick-paced number. Between the jaunty tune, Chenoweth’s unmatchable energy, and the singular shot that captures the major performance, “Trials And Tribulations” speaks to Schmigadoon!’s theater strengths as well as its latent potential. Ariana DeBose, who plays the town’s controversially single school teacher Emma Tate, Ann Harada as the mayor’s wife, and Dove Cameron as Schmigadoon’s pigtailed ingénue Betsy also show real promise and the production team’s eye for great casting, despite working with a story that falls short. Overall, it’s difficult to pinpoint Schmigadoon!’s intentions. It doesn’t offer a new narrative like Crazy Ex-Girlfriend or impressively catchy tracks like Netflix’s Julie And The Phantoms. It doesn’t tap into the real potential of its seasoned cast like 30 Rock or Portlandia, nor does it have anything new to say for or against musicals, in general. But if you’re looking for something breezy in which to escape the world’s heaviness for a song or two, Schmigadoon! is a watchable enough option. I’ve become so accustomed to Saturday Night Live episodes needing to get over multiple humps of weak cold opens, monologues that are often more cute or functional than laugh-out-loud funny, and/or the heavy sigh of a leadoff game-show sketch that when an episode actually starts strong, it can produce an outsized elation and inflated expectations. 20 minutes into Alexander Skarsgård’s first hosting gig, it seemed like it might be one of those weird cases where a relatively low-expectation host, in this case one where maybe you have to repeatedly look up which one is this guy and which one is his brother who also acts because they’ve both played vampires, winds up presiding over a season highlight. You know, sort of like a normie boyfriend unexpectedly delivering twisted jokes for every occasion! That’s not even to say the cold open of this week’s episode was an all-timer. But it wasn’t Trump doing stand-up, and took some actual (if belated) shots at the poisonous ICE mentality, even if the writers—can we just be real and say Colin Jost here? The helpful writing-credit Reddit thread is always mysterious blank on the cold opens, but in the past often attributed Jost—simply cannot stop themselves from assigning a Voice of Reason where none exists. In this case, it was Pete Davidson somewhat pointlessly playing border czar Tom Homan; Davidson is too naturally likable (and even, in his way, sensible) to be of much use as a guy currently best-known for being somewhat less overly Nazi-coded than his predecessor. The cold open winked a little at the fact that Homan’s philosophy doesn’t actually differ radically from all the horrible shit ICE has been up to, but to do too much of that would violate the sane-person-explains-what’s-crazy principle of so many political sketches. Still: This required seemingly more effort than usual, and what a relief to see James Austin Johnson freed from the Trump shtick that’s become his gift/curse, instead offering deadpan “probably wrong” answers to simple questions. Moreover, following a technically above-average cold open, the next few segments were top-notch, starting with a short, simple, and delightfully ridiculous monologue bit where Skarsgård, lacking some kind of immediately well-known persona to riff off, talked about wanting to put a spotlight on the house band for the show’s 1,000th (!) episode. The band pretended to be annoyed by Skarsgård pretending to care about them and pretending to play the saxophone… all together, it was the kind of loose, silly monologue you might expect to see in the late ’80s. From there, Skarsgård backed off to play a relatively quiet dad in an exceedingly well-acted lead-off sketch about a mom (Ashley Padilla) announcing to her family that she has maybe kinda-sorta finally come around on Trump being bad for the country—a potentially hoary premise that might have felt mistimed at any point in the past, what, decade? Yet here it was so well-written, and benefited so mightily from Padilla’s patience as a performer, her willingness to delay a punchline for the sake of precision, that it landed near-perfectly. The host also did fine teamwork in a Jane Wickline-centric pretape that punctured the reverence of Olympics ads, with Wickline as an athlete facing nothing but mortal terror at the prospect of competing. Again: simple premise, fantastic execution. Sadly, that high didn’t last, and the sketches got, well, sketchier after that—hit-and-miss within the sketches themselves, rather than just between them. After Skarsgård’s free-floating, do-whatever goofiness earlier in the episode, it was a little surprising to see him circle back to check off stuff from his Wikipedia bio, even if the general audience might not remember that yes, he actually played Tarzan in a movie that, yes, was actually kind of a hit. (I had forgotten this until the Tarzan sketch aired, and I, well, saw it for work, apparently.) He did a variation on his Northman character in a Viking-raid pretape, passably amusing but coasting a bit on what have become standard CG gore effects that the show brings out about three times a year. Skarsgård did bring some genuine Scandinavian experience to the Scandinavian Film Set sketch that Glen Powell did a few months ago. And there was, naturally, one sketch treating his height as a sight gag. Skarsgård didn’t fully return to his essential yet less persona-specific strangeness until the very end of the night, when he played a “funny” boyfriend cribbing his “random” quips from Cards Against Humanity. By that point, some of the episode’s heedless early joy had dissipated, though the Cards sketch delivered on its own terms. What lingered was the sense that the show doesn’t need a legacy star or old cast member for an installment that feels vaguely like a throwback (complimentary). Given the lack of ceremony in the wake of the 50th season, that was probably the right energy for SNL crossing over into the four-digit episode count. Besides, most comedies don’t really hit their stride until they’ve done at least three thousand. As mentioned, that early stretch was terrific, including Wickline finally speaking for those of us who feel strongly that doing fast sports in the cold sounds, frankly, terrible. Again, I know she’s divisive among some fans, but every time she’s the focus of a segment like that, it’s perfectly judged. While the Tarzan and Cards Against Humanity sketches weren’t quite as great as the early stuff, they both had an agreeable early ’90s vibe, especially Tarzan, even if you felt like Kevin Nealon would have played it better. It’s hard to begrudge the show an occasional recurring sketch these days, given how infrequently they go there, but back-to-back returns of the Scandinavian Film Set and Immigrant Dad Talk Show, both featuring a droll cameo from the host’s real-life dad Stellan Skarsgård, recalled a ’90s episode in a bad way, and was maybe not the best strategy. Neither made me laugh much, but I’d give the edge in unfunniness to Immigrant Dad Talk Show. It’s a much stronger recurring concept overall but already feels like it’s running on fumes after three installments, even as the Skarsgård family brought in some minor variations. Also, the sketch featuring Skarsgård as the awkwardly tall and ill-tempered Iowa transplant Agnes alienating her young peers felt like it wasn’t quite there. Everyone in it was hitting their marks, with the possible exception of the always-dicey person-to-dummy transfer timing for the slapstickiest sections. But there was also a nagging wateriness about how old these girls were supposed to be; I’m not saying there aren’t any kinds who like both Olivia Rodrigo and Bluey (I know, everyone loves Bluey) but between those details, the dialogue, and the general playdate situation, it was hard to tell where between the vast 5-to-10 spectrum the “normal” characters were supposed to be, which throws off their contrast to the outlier character. That might sound astonishingly literal-minded for a sketch where adults dress-up like kids, but that kind of uncertainty can make an outlandish premise harder to sell. The best pure performance in the episode was pretty obviously Ashley Padilla in that first sketch and some of the biggest single laughs came from Jane Wickline, but the most overall fun in the episode belonged to Sarah Sherman, whether remote-reporting in a very cold-looking dress on Weekend Update, inspiring a grudge from Skarsgård’s hulking little girl Agnes, or romantically paired with the host in two successive sketches. She also gets bonus points for plugging her recent stand-up special far fewer times than one of her colleagues has! I was about ready to say that unless I spend the next month mainlining Heated Rivalry, Connor Storrie will rep the rare SNL host where his episode will be where I see him act for the first time. But I guess he was in the Joker sequel that I reviewed for this very website, so technically that isn’t true. But close! Meanwhile, this will be the fourth musical-guest appearance from Mumford & Sons. Time! Jesse Hassenger is a contributor to The A.V. Club. Alice Monroe (Kaley Cuoco) is in near-constant peril mode in the limited series Vanished after her boyfriend of four years disappears during a dreamy French vacation. In trying to learn why he suddenly seems to have abandoned her, she discovers he’s actually a liar and a potential criminal mastermind. She also accidentally stumbles upon an international human-trafficking conspiracy that she’s determined to expose at personal risk. By the end of episode two, Alice is all over the news and labeled a murderer. Amid trying to prove her innocence and being chased by cops and thugs, she finds time to give herself a shaggy haircut. Because how else will audiences grasp that she’s in a crisis? Herein lies the issue with Vanished. It torpedoes itself by restating the plot often, not trusting viewers to follow along fairly obvious turns and losing any excitement in the process. This show might move at a crackerjack pace wover its four 45-minute installments, but its execution lacks finesse and consistency. Created by David Hamilton and Preston Thompson, who wrote the series, Vanished has similar elements to Cuoco’s quite enjoyable HBO Max dramedy The Flight Attendant, only with a decidedly darker spin. In both cases, Cuoco plays an unsuspecting woman who, because she was in the wrong place at the wrong time, gets caught up in a dangerous mess. So she has to go on the run and use nifty tricks to figure out how to get out alive. At least TFA‘s Cassie Bowden had a fleshed-out context about her family, friends, and struggle with alcoholism. Alice, on the other hand, has little interiority or history to help understand her actions and motivations. An archaeologist who travels the world for various digs, she bumps into Tom Parker (Sam Claflin) while working in Jordan. He’s employed by a global charity whose mission includes helping refugees who live in tents, are frequently attacked by bandits, and want to escape. The two hit it off while delivering vaccines to a village, and their instant attraction turns into a long-distance relationship. During a rendezvous in Paris, Alice tells him she wants to build a life together in one place instead of hopping around from city to city and meeting up in hotels. He agrees with ease, but while they’re heading to the South of France the next day, Tom gets off the train in the middle of nowhere and never returns. Confused by his departure, and assuming he didn’t just dump her, Alice seeks help from an investigative journalist who conveniently happens to be on the same train and overhears her panicked pleas to the conductor. As it turns out, Helene (Karin Viard) is along for the ride because she’s looking into the charity where Tom works, certain that something sinister is going on under their guise of helping out folks. Helene eventually convinces Alice to join forces, using their respective professions as some sort of vague connection between them. (“The pursuit of truth. That’s what I do, and that’s what you do,” she tells her.) As the two embark on an adventure, traipsing from Marseilles to Arles, director Barnaby Thompson solidly captures the gorgeous scenery in one of the show’s only highlights. If Alice is given surface-level traits, Helene is dealt an even weaker hand as a hardened crime reporter who carries around pliers to break locks and says stuff like “I haven’t slept okay since the ’90s.” French star Viard is wasted in this supporting role. The conflict of whether Alice and Tom’s relationship was ever real or built on a shaky house of lies rarely feels affecting, mostly because of the creative choice to provide little backstory about their time as a couple. Claflin and Cuoco are talented performers individually, but together, they fail to fully sell their characters’ seemingly intense dynamic. Watchable as it may be, Vanished also ends up as a relatively hollow thriller that depicts Middle Eastern countries with an annoying sepia filter. Its central suspense centers on crimes taking place against refugees, who are nameless and usually shown just huddled together in trucks or warehouses. It isn’t until Alice comes along that their precarious circumstances get the spotlight, and even then, the series focuses mainly on how her life is on the line. The finale makes a rushed attempt to address this misstep, but it’s too late because, by then, Vanished has already lost the plot. Saloni Gajjar is The A.V. Club‘s TV critic. Vanished premieres February 1 on MGM+. After the emotional roller-coaster of last week, The Pitt returns to the slower pace that has defined its sophomore year. And while I was a little confused about that pacing choice at the beginning of the season, I’m starting to understand the approach. Last season followed the doctors and nurses on what was almost certainly their worst day of the year—where they dealt with not just triaging a mass shooting but also a hate crime subway attack, a drowned little girl, a stolen ambulance, a braindead teen, and a mom who made herself sick just to get her troubled young son some help. And that’s not even mentioning Robby’s COVID flashbacks, Langdon’s drug stealing scandal, an angry patient punching Dana in the face, McKay’s ankle monitor drama, and Dr. Collins’ miscarriage. This season, however, we’re seeing the Pitt on a more “normal” day. It may be the Fourth Of July, and they may be taking in extra patients from Westbridge, but (for now at least) the chaos is manageable. This is the Pitt operating at its best, and that allows the show to emphasize how much an ER lives or dies based on the small decisions its healthcare providers make. Advocate for an extra test and you could save a patient from a brutal heart attack. Move one small piece of glass from a wound and a patient might bleed out on the table. What makes The Pitt so compelling is that its characters are hypercompetent enough to make those small yet critical decisions over and over and over again, even when they’re juggling a dozen patients at a time. But that hyper-competence is a learned skill, and “10:00 AM” makes a point of highlighting how it’s learned over the course of a doctor’s career. At the bottom of the totem pole are new student doctors like Joy Kwon (Irene Choi) and James Ogilvie (Lucas Iverson), who are brimming with book knowledge but lacking in practical experience. “10:00 AM” highlights just how dangerous that combination can be as Ogilvie’s desire to prove himself manifests in a massive ER fuck-up. High on self-confidence and a morning of wins, he assumes he can just quickly grab a small fragment of glass from a patient who Parkour-ed his way through a florist shop skylight. But when it turns out that fragment is actually a much larger piece of glass blocking a now overflowing artery, he’s suddenly like a panicked kid who has no idea what he’s doing. (“I can push it back in!”) It’s a terrifying situation but also a crucial learning one too. When Ogilvie tells Robby “it won’t happen again,” you can tell he actually means it. He’s rattled by the experience and how much worse it could have been. And that will (hopefully) inspire him to be less cocky and more cautious in his future as a doctor. Of course, you can’t lose that cockiness altogether either. It’s the blend of confidence and caution that makes our “top tier” doctors so great at their jobs. It’s why Robby, Al-Hashimi, Langdon, Samira, McKay, and Dana are able to make snap decisions and perform difficult procedures all while teaching the next generation of doctors and nurses. They may still need help in their personal lives (psych doctor Caleb Jefferson is pushing Robby to try out another new therapist), but, professionally, they’re all basically competence personified. McKay even manages to make a date with one of her patients without crossing any ethical lines. With that wide gap between the newbies and the pros, the most intriguing doctors are arguably the middle tier bridging the two groups—characters like Whitaker, Javadi, Santos, and Mel. What The Pitt understands is that the growth from newbie to pro isn’t necessarily linear. Though Javadi is now being actively requested by patients thanks to her informative TikTok videos, she still needs to be reminded not to call a psych consult on a sedated patient. Whitaker, meanwhile, has basically doubled in confidence from his experience as an overwhelmed fourth-year medical student to his new role as an intern. But Santos is experiencing the opposite arc in her transition from intern to resident. When Al-Hashimi warns her that if she doesn’t keep up with her charting, she might have to repeat her R2 year, it rattles her more than we’ve ever seen before. It’s the sort of small-scale struggle that our top-tier doctors may no longer relate to, since they’re so far removed from the start of their careers. But it’s one that Mel—who was in Santos’ shoes just last season—intimately understands. She delivers a lovely bit of both mentorship and friendship as she guides Santos toward being a more attentive doctor while also offering a supportive ear if she needs one. It’s the role Langdon served for her last season; and as Mel moves up in her own career, she now gets to pass along the favor. In a lot of ways, “10:00 AM” is a low-key episode that keeps its current patient storylines going rather than introducing any big new shockers. Our proud diabetic patient rejects the idea of a GoFundMe, our new bulimia patient asks for the help she needs, Joy gets a small blood exposure cut that requires her to officially become a patient, our romantic Walmart greeter gets a painful miracle cure, our superglue lady finally gets to open her eye again, our waitress with the infected foot is back and doing way worse, and we still don’t know exactly what’s going on with our mentally altered college student or our baby Jane Doe. But however those stories unfold from here, “10:00 AM” proves that even a slower-paced version of The Pitt can still be compelling. The daily grind of an ER may not exactly be glamorous. But it’s riveting in its own way—a place where everything can tick along perfectly until suddenly, disastrously, it doesn’t. Good thing the most competent team in Pittsburgh is here to help. Caroline Siede is a contributor to The A.V. Club.",
  "isFullReview": true,
  "textWordCount": 4107,
  "archivePath": "data/archives/reviews/schmigadoon-2026/av-club-shannon-miller--shannon-miller_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:41:12.127Z",
  "designation": "Recommended",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}