{
  "showId": "schmigadoon-2026",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Lucy Mangan",
  "url": "https://www.theguardian.com/tv-and-radio/2021/jul/16/schmigadoon-review-a-one-note-musical-and-even-that-falls-too-flat",
  "playbillVerdictUrl": "https://www.theguardian.com/tv-and-radio/2021/jul/16/schmigadoon-review-a-one-note-musical-and-even-that-falls-too-flat",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "It has a stellar cast including Keegan-Michael Key, Cecily Strong, Kristin Chenoweth and Alan Cumming. But sadly, Apple TV+’s Brigadoon parody is lacking in every other way What would you think if I told you there was a new show on Apple TV+ called Schmigadoon! (exclamation mark theirs)? If you were very young, I suppose you might think I were sneezing. If you were a Victoria Wood devotee, you might be reminded of the middle-aged women in the coffee shop sketch (“Did you go and see Macbeth?” “Mmm. Wasn’t a patch on Brigadoon”). And if you were slightly older and/or a fan of golden age musicals, you might think you were in for a loving, riotous pastiche of those happy days, an oblique run at the great American songbook, and perhaps a few heartfelt sighs over the memory of Gene Kelly (and his bottom, which should always have got separate billing) and Cyd Charisse (and her legs, ditto, although they did get their dues at the time) giving it their perfect all in the 1954 film adaptation of Lerner and Loewe’s stage hit. Schmigadoon! gives a modern spin to the Brigadoon story by sending stuck-in-a-rut couple Melissa (Cecily Strong) and Josh (Keegan-Michael Key) on a therapy weekend, during which they have to go on a bonding hike through the woods. Deep in the forest, they cross a bridge and find themselves in a 1940s-style small town – laid on, they assume, as a therapy tourist attraction – in which the inhabitants break into song-and-dance routines at the drop of a rucksack. Melissa is delighted. Josh less so. (If you side with Josh, I would query what you’re doing watching something called Schmigadoon! in the first place. We’ll proceed from here, in the interests of fairness, as if only those not predisposed to hate it are present.) Neither of them seem particularly fazed by the discovery towards the end of the first episode – via Martin Short as a Finian’s Rainbow-esque leprechaun – that they cannot cross back over the bridge and leave the town without their true loves. Which do not seem to be each other. So they must stay, and become increasingly embroiled in the lives of the good – and less good – citizens of Schmigadoon while they work out what to do. The homages come thick and fast, even for a relative musicals novice such as myself. The townsfolks’ opening chorus is straight out of Oklahoma! (like, one presumes, the titular flourish), the local bad boy Danny Bailey (Aaron Tveit) could be renamed Schmilly Schmigelow (from Schmarousel) and comes complete with a song (sung to Melissa as she wanders alone round the town after Josh falls asleep) that mirrors the sentiments of Bigelow’s famous If I Loved You. The Sound of Music gets a look-in in later episodes, mostly via an all-too-brief appearance from the mighty Jane Krakowski as a Baroness-type figure, and other standard characters abound. There is Kristin Chenoweth as the malevolently rigid wife of the town preacher; Alan Cumming as the mayor; the whipsmart, nobly self-sacrificing schoolma’am (Ariana DeBose); a cutely lisping young boy who runs on with extra vim and vigour between scenes to set things up for us (Liam Quiring-Nkindi); Dove Cameron as the blond-bombshell waitress Betsy who catches Josh’s eye, and so on. And yet … it never quite adds up to the sum of its parts – let alone more. What seems like a strength at first, of having every song and dance as a full production number, quickly becomes wearing after the initial impressiveness wears off. None has the comic spin to sustain it. Strong and Key are largely relegated to merely commenting on the quirk around them, and showing then telling isn’t any less wearisome in parodyland than it is elsewhere. Any tension that might start to build between the couple and the Schmigadooners – either because of their modern ways or because they are effectively prisoners and jailers – dissipates as soon as it arises. The stakes remain remarkably low. The only real jeopardy comes from Key’s frustration at being forced into a snarky role as a humourless, discontented straight man instead of being allowed to bust his comic chops out all over. You do start to long for the wit of any My Crazy Ex-Girlfriend number, or any three minutes from the Buffy episode Once More, With Feeling, or even the increasingly clever and extensive musical interludes that Unbreakable Kimmy Schmidt enjoyed as Jeff Richmond was given more of his druthers every season. Schmigadoon! passes the time harmlessly enough but overall, it is a one-note show and even that is too often flat. Must hit that exclamation mark harder next time. We hope you appreciated this article. Before you close this tab, we want to ask if you could support the Guardian at this crucial time for journalism in the US. In his first presidency, Donald Trump called journalists the enemy; a year on from his second victory, it’s clear that this time around, he’s treating us like one. From Hungary to Russia, authoritarian regimes have made silencing independent media one of their defining moves. Sometimes outright censorship isn’t even required to achieve this goal. In the United States, we have seen the administration apply various forms of pressure on news outlets in the year since Trump’s election. One of our great disappointments is how quickly some of the most storied US media organizations have folded when faced with the mere specter of hostility from the administration – long before their hand was forced. While private news organizations can choose how to respond to this government’s threats, insults and lawsuits, public media has been powerless to stop the defunding of federally supported television and radio. This has been devastating for local and rural communities, who stand to lose not only their primary source of local news and cultural programming, but health and public safety information, including emergency alerts. While we cannot make up for this loss, the Guardian is proud to make our fact-based work available for free to all, especially when the internet is increasingly flooded with slanted reporting, misinformation and algorithmic drivel. Being free from billionaire and corporate ownership means the Guardian will never compromise our independence – but it also means we rely on support from readers who understand how essential it is to have news sources that are immune to intimidation from the powerful. We know our requests for support are not as welcome as our reporting, but without them, it’s simple: our reporting wouldn’t exist. Of course, we understand that some readers are not in a position to support us, and if that is you, we value your readership no less. But if you are able, please support us today. All gifts are gratefully received, but a recurring contribution is most impactful, helping sustain our work throughout the year ahead (and among the great benefits, it means we’ll show you fewer fundraising requests like this). It takes just 37 seconds to give. Thank you. I hate musicals. But I have a strange, worrying notion that I might just try watching this. I hate musicals. But I have a strange, worrying notion that I might just try watching this. I hate musicals. But I have a strange, worrying notion that I might just try watching this. I hate musicals. But I have a strange, worrying notion that I might just try watching this.",
  "isFullReview": true,
  "textWordCount": 1241,
  "archivePath": "data/archives/reviews/schmigadoon-2026/guardian--lucy-mangan_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:03:41.536Z",
  "designation": "Recommended",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}