{
  "showId": "schmigadoon-2026",
  "outletId": "npr-linda-holmes",
  "outlet": "NPR (Linda Holmes)",
  "criticName": "Linda Holmes",
  "url": "https://www.npr.org/2021/07/15/1015663545/schmigadoon-review-keegan-michael-key-cecily-strong-broadway",
  "playbillVerdictUrl": "https://www.npr.org/2021/07/15/1015663545/schmigadoon-review-keegan-michael-key-cecily-strong-broadway",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "Kristin Chenoweth and the company of Schmigadoon!, premiering July 16 on Apple TV+. Apple TV+ hide caption Kristin Chenoweth and the company of Schmigadoon!, premiering July 16 on Apple TV+. Of all the things I know that I don't need to know, I probably don't need to know the words to \"(Not) Getting Married Today\" from Company the most. Knowing show tunes, and knowing Stephen Sondheim lyrics in particular, is like carrying a Birkin bag or having Tom Brady tattooed on your shoulder — it signals to other people that you, too, care way too much about something that isn't important. It is for people who fall into this category that the new Apple TV+ comedy Schmigadoon! was made. In one of those premises that make no sense until you see them, at which point they make perfect sense, Keegan-Michael Key and Cecily Strong play Josh and Melissa, long-term-dating doctors who have fallen into a bit of a relationship rut. While on a couples' retreat that she is excited about and he finds hopelessly corny, they become lost in the woods, and on the other side of a bridge, they find themselves in an idyllic (and artificial-looking) town whose sign says \"Schmigadoon.\" Now, the Lerner & Loewe musical Brigadoon, which premiered on Broadway in 1947, isn't one of the ones I find civilians most familiar with. If you're not familiar, a quick rundown: It involves two hunters in Scotland who wander into a quaint little town called Brigadoon that, they learn, only appears for one day every 100 years before vanishing into the fog. I cannot imagine what people who aren't familiar with it would make of the title Schmigadoon!, but I suppose we're about to find out. Josh and Melissa quickly realize something is amiss, as they are welcomed by the townspeople with a song that's very (very very) reminiscent of the title song from Oklahoma!. (Lyrics include: \"Where the men are men and the cows are cows/and the farmers smile as they push their plows.\") Melissa finds all of this charming; Josh finds it corny (again), and this sets the stage for their basic dynamic throughout the show. She's more of a romantic, he's more of a cynic, and he is utterly resistant to their gradual immersion into the world of 1940s Broadway musicals, where they seem to be trapped. We meet the mayor (Alan Cumming), whose first appearance calls to mind parts of The Wizard of Oz, and the town busybody/puritan (Kristin Chenoweth), and the adorable lad whose lisp is inspired by the adorable lad in The Music Man. Melissa's eye is also caught by the local bad boy (Aaron Tveit), who is almost exactly Billy Bigelow from Carousel and will eventually parody \"If I Loved You\" and \"When The Children Are Asleep\" and Billy's big song \"Soliloquy\" about what it would be like to have a son versus a daughter. The Sound Of Music shows up, Kiss Me Kate shows up, the moral panic anthem \"Ya Got Trouble\" shows up ... you get the idea. Cecily Strong and Keegan-Michael Key play a struggling couple in Apple TV+'s Schmigadoon! Apple TV+ hide caption Cecily Strong and Keegan-Michael Key play a struggling couple in Apple TV+'s Schmigadoon! If you're noticing a lot of references, it's because there are a lot of references — these are only the beginning. If you're a person who, say, wrote a substantial paper about movie musicals in college (ahem), it's a lot of fun picking over choreography flourishes and musical and lyrical flourishes as they are, in some cases, mashed up with modern life. And rather than just being broad and self-satisfied, these references are particular and aware. How many times are you going to see an extended joke about the fact that the line (referring to money), \"I'll go out and make it or steal it or take it\" (from Carousel) is redundant? That is a highly specific peeve to have saved up for years; you can only salute the deep knowledge of the genre that's on display in the writing. But what makes Schmigadoon! more easily forgotten than I hoped it would be is that it's not clear what else this show is doing other than providing those \"I understood that reference\" moments. There are efforts to wink at tropes from musicals (like women being, uh, spanked) that would no longer fly in the contexts in which they were originally presented. And you can probably tell where they're going when Alan Cumming is playing Mayor ... Menlove. To complain seems churlish: Who doesn't love the great Ann Harada doing her version of the \"oh well, what can you do with men except accept them for who they are\" song that appears in so many Broadway shows and sets so many modern viewers' teeth on edge? Ariana DeBose — who played the Bullet in Hamilton on Broadway — plays a delightful schoolteacher living in the small town of Schmigadoon. Apple TV+ hide caption Ariana DeBose — who played the Bullet in Hamilton on Broadway — plays a delightful schoolteacher living in the small town of Schmigadoon. It's not that a show like Schmigadoon! needs to make some grander point, but it aches for more of a point of view, perhaps less about musicals and more about its own characters. Even in a romantic comedy, which is essentially what the Strong-Key relationship is here, you need a little more of a dramatic spine to the relationship than most of these six episodes can deliver. Given that it is based on Broadway musicals, you know these people will find their way back to each other; the question is how. And here, the answer to that question could have used a little more of the specificity that went into writing the songs. Created and written by Cinco Paul and Ken Daurio (Paul also wrote the songs), Schmigadoon! is a sharply written parody that eerily nails the structure and the mood of musical numbers that debuted over quite a few decades, and it's a good time for show-tune people. It's just hard not to wish that this terrific cast could have gotten a little more support from the writing that comes between the singing. Come to think of it, though, you can say the same about a lot of the musicals it's sending up. Support mission-driven journalism while getting something great in return. Enjoy bonus content, early access and sponsor-free listening from your favorite NPR podcasts.",
  "isFullReview": true,
  "textWordCount": 1080,
  "archivePath": "data/archives/reviews/schmigadoon-2026/npr-linda-holmes--linda-holmes_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:41:34.591Z",
  "designation": "Recommended",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}