{
  "showId": "schmigadoon-2026",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Margaret Lyons",
  "url": "https://www.nytimes.com/2021/07/15/arts/television/review-schmigadoon.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2021/07/15/arts/television/review-schmigadoon.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "https://www.nytimes.com/2021/07/15/arts/television/review-schmigadoon.htmlShare full article4Advertisement\n\nWelcome to Schmigadoon, “where the men are men, and the cows are cows,” a magical musical land where Melissa and Josh (Cecily Strong and Keegan-Michael Key) find themselves stranded during a trip meant to rehabilitate their romance. At first they think it’s like Colonial Williamsburg, or a warped Disney experience, but they quickly buy into their new reality: They’re trapped in this wholesome, old-timey parallel universe until they learn the lessons about true love it is meant to impart.\n\nMelissa is into it. She likes musicals, and she’s thrilled to discover that when she joins in on one of the townsfolk’s numbers, she instinctively knows what to sing. Josh is not into it. He dislikes musicals, and he refuses to sing along. She wants to be in love, get married and win every argument. He wants her to accept that love is flawed and marriage is whatever, and he also wants to win every argument.\n\nI won’t say that there are only two types of people when it comes to musicals, but for our purposes: The Joshes of the world are unlikely ever to warm to “Schmigadoon!” To my fellow Melissas: Dust off your character shoes. Our time is now.\n\n“Schmigadoon!,” which debuts on Apple TV+ Friday, was created by Ken Daurio and Cinco Paul, the team behind the “Despicable Me” franchise; Paul also wrote all the songs. The show’s most obvious references are “Brigadoon,” “Carousel” and “Oklahoma!” But there is also plenty of “Annie Get Your Gun” in there, as well as “Seven Brides for Seven Brothers,” “The Music Man,” “The Sound of Music,” “South Pacific” and “The King and I.” Individual numbers have nods to dozens of other musicals. Some are direct parodies of specific songs — Melissa explains human reproduction in medical detail in a spoof of “Do-Re-Mi” — and others send up the genre in general.\n\nThe residents of Schmigadoon are also walking parodies. Kristin Chenoweth is the town grouch and main villain, a dark lipstick nightmare who turns to her fellow tut-tutters and asks, “Ladies, can I get a cackle?” Alan Cumming is the closeted mayor. Jaime Camil is the sultry, judgmental doctor, Aaron Tveit is the hunky bad boy in “Carousel” cable knit, and Ariana DeBose is the enchanting school marm. Tveit and DeBose are particularly electric, and when they are singing — or even better, singing and dancing — it’s impossible not to root for them. Everyone, go forth and win the hearts of our miserable normies.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 441,
  "archivePath": "data/archives/reviews/schmigadoon-2026/nytimes--margaret-lyons_2026-02-01.html",
  "textFetchedAt": "2026-02-01T19:08:25.031Z",
  "designation": "Critics_Pick",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250723035951",
  "archiveOrgUrl": "http://web.archive.org/web/20250723035951/https://www.nytimes.com/2021/07/15/arts/television/review-schmigadoon.html"
}