{
  "showId": "schmigadoon-2026",
  "outletId": "paste-amy-amatangelo",
  "outlet": "Paste (Amy Amatangelo)",
  "criticName": "Amy Amatangelo",
  "url": "https://www.pastemagazine.com/tv/apple-tv-plus/schmigadoon-review/",
  "playbillVerdictUrl": "https://www.pastemagazine.com/tv/apple-tv-plus/schmigadoon-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "We here at Paste TV love to joke about whether or not a show is rated for someone. For example, merely the photos of hybrid human/animal babies from Netflix’s Sweet Tooth screamed “No thank you! Rated ‘Not for Amy!’” But perhaps there’s not a show rated more for me than Apple TV+’s Schmigadoon! Not only do I love Broadway musicals, but I’ve also been deprived of musical productions for almost 16 months. Just the swell of the music in the opening credits made me a little teary. In this six episode series from executive producer Lorne Michaels, Melissa (Cecily Strong) and Josh (Keegan-Michael Key) are two New York doctors who embark on a camping trip designed to bring them closer together. They get lost along the way and find themselves stranded in the town of Schmigadoon! Despite their continued efforts, they are unable to leave until they find true love. Do the math and that means that Melissa and Josh aren’t as in love as they (particularly Melissa) thought they were. The original songs of the series, written by series creator Cinco Paul, harken back to the classic musicals of the 1940s and ‘50s. Think Oklahoma!, The King and I, Show Boat and, yes, of course, Brigadoon. The musical numbers are big and bold with fantastic dancing. The fourth episode features a tap dance number that is so enthralling and delightful I immediately rewound and watched it again. The sly lyrics are just oh-so-slightly off. When Melissa and Josh first stumble upon the town they are told in verse it’s a town where “the men are men and the cows are cows.” Danny Bailey (Aaron Tveit) is, as the show loves to tell viewers with its tongue firmly in its cheek, the town “rapscallion” and sings “You Can’t Tame Me.” (Danny Bailey is particularly funny because every musical has that bad boy with a heart of gold who just needs to find the right woman to set him straight, of course.) With its pastel colored, two dimensional faux backgrounds, Schmigadoon looks like Rodgers and Hammerstein stage set. Its residents look like they just stepped out of Carousel. The series manages to be simultaneously an adoring homage to the genre and a spot-on satire of it; every trope is lovingly upended, every plot difficulty laid bare. (Let’s be honest, women didn’t fare too well in the classic musicals. I mean there is a “what can you do but love him?” song about an abusive husband in Carousel.) Melissa explains the reproductive system in a little ditty that’s very similar to “Do-Re-Mi” from the Sound of Music. “Why are they laughing? Nothing even remotely funny just happened?” Josh wonders at the end of one number. There’s references to “color-blind casting” and at the start of a dream ballet, Melissa exclaims, “We’re not having a dream ballet. They’re annoying and stupid and slow everything down.” Will you enjoy the show if you’ve never seen a musical and have no context for what’s being spoofed? Maybe. But this truly is a series for Broadway fans. It’s also a delight to see the sheer volume of Broadway stars who are part of the cast: In addition to Tveit, Kristin Chenoweth—who gets her big show-stopping number in the fourth episode—appears as the town gossip Mildred Layton (she heads up the group “Mothers Against the Future”); Alan Cummings plays the town Mayor Menlove (guess what secret he’s hiding?); Ariana DeBose (who will play Anita in the upcoming West Side Story) is the no-nonsense school teacher with a secret; Jane Krakowski is the glamorous countess. The show is an embarrassment of Broadway riches. As for the love story at its center, the series is a fun juxtaposition of Josh and Melissa’s modern life with the antiquated world of Schmigadoon! “We’re smart. We found our way out of Ikea. We’ll find our way out of this,” Melissa says. Each 30 minute episode begins with a flashback to their previous life. These brief and efficient snippets give viewers terrific insight into Josh and Melissa’s relationship. Melissa is more immediately onboard with what’s happening. She’s thrilled when she realizes the song she is about to sing is “in my range and everything.” And knows that Josh has been cast as the “morally adrift narcissist that needs to change.” Strong has been an essential member of the Saturday Night Live cast for years and it’s great to see her taking the lead here; she’s up for the challenge dramatically, comically, and musically. Her characters on Saturday Night Live, like the chain-smoking and opinionated Cathy Anne, work because she always brings humanity into her caricatures. Although what’s happening around Melissa is often ridiculous, her reactions and emotions are very real. Key is equally adept and charming as the more reluctant Josh—he wants a quick fix to his predicament, but that’s not how musicals work. Together they ground the series in such a way that the sixth and final episode packs a surprisingly emotional punch. Along with Trying and Ted Lasso, Schmigadoon! is another entry into AppleTV+ cornering the market on uplifting, positive, smart TV. It may be a niche joy, but you can’t watch without smiling. And that’s something to sing about. The first two episodes of Schmigadoon! premiere July 16 exclusively on Apple TV+. A new episode will premiere every Friday after that until the finale on August 13. For all the latest TV news, reviews, lists and features, follow @Paste_TV. Welcome to What’s On, our weekly roundup of notable shows and streaming films. Here is what’s happening on TV from Sunday, February 1 to Saturday, February 7. All times are Eastern. Vanished (MGM+, Sunday, 9 p.m., miniseries premiere) This four-part thriller centers on a couple whose romantic getaway in the South of France takes a sinister turn when boyfriend Tom Parker (Sam Claflin) vanishes from their train, leaving Alice Monroe (Kaley Cuoco) to uncover shocking truths about her lover’s past. Karin Viard and Matthias Schweighöfer also star. Read The A.V. Club’s review. The Muppet Show (ABC and Disney+, Wednesday, 9 p.m., standalone special) This year marks the 50th anniversary of the original The Muppet Show, and who better for Kermit the Frog, Miss Piggy, and the rest of the lovably absurd gang to party it up with than Sabrina Carpenter, Seth Rogen, and Maya Rudolph? The new variety special features musical numbers, comedy bits, and plenty of chaos. Look for a piece on the Muppets this week. 2026 Winter Olympics Opening Ceremony (NBC and Peacock, Friday, 2 p.m.) Kicking off 17 days of athletic excellence, national pride, and hideous team uniforms, the opening ceremony in Milan promises live performances from Andrea Bocelli and Mariah Carey, a Giorgio Armani tribute, and the lighting of two separate Olympic cauldrons (a first for the spectacle). The 68th Annual Grammy Awards (CBS and Paramount+, Sunday, 8 p.m.) Trevor Noah is back as the host of this year’s Grammys, which will be the last to air on CBS after more than a half century. (The 2027 show will move to ABC and Disney+ as part of a new 10-year deal.) Along with performances from Sabrina Carpenter, Olivia Dean, SOMBR, Addison Rae, and Alex Warren, the ceremony introduces two new categories: Best Traditional Country Album and Best Album Cover. A Knight Of The Seven Kingdoms (HBO, Sunday, 10:03 p.m.) Fallout (Prime Video, Tuesday, 9 p.m., season two finale) Hijack (Apple TV, Wednesday, 12 a.m.) The Pitt (HBO Max, Thursday, 9 p.m.) The Traitors (Peacock, Thursday, 9 p.m.) Frieren: Beyond Journey’s End (Crunchyroll, Friday, 10 a.m.) The Great American Baking Show: Celebrity Big Game (Roku Channel, Sunday, 3 a.m., season two premiere) Below Deck Down Under (Bravo, Monday, 8 p.m., season four premiere) Father Brown (BritBox, Tuesday, 7 a.m., season thirteen premiere) Summer House (Bravo, Tuesday, 8 p.m., season ten premiere) The Lincoln Lawyer (Netflix, Thursday, 3 a.m., season four premiere) The Night Manager (Prime Video, Sunday, 3 a.m., season two finale) Wolf (AMC+ and Shudder, Tuesday, 9 p.m., season one finale) The Boyfriend (Netflix, Tuesday, 3 a.m., season two finale) Spartacus: House Of Ashur (Starz, Saturday, 9 a.m., season one finale) I’ve become so accustomed to Saturday Night Live episodes needing to get over multiple humps of weak cold opens, monologues that are often more cute or functional than laugh-out-loud funny, and/or the heavy sigh of a leadoff game-show sketch that when an episode actually starts strong, it can produce an outsized elation and inflated expectations. 20 minutes into Alexander Skarsgård’s first hosting gig, it seemed like it might be one of those weird cases where a relatively low-expectation host, in this case one where maybe you have to repeatedly look up which one is this guy and which one is his brother who also acts because they’ve both played vampires, winds up presiding over a season highlight. You know, sort of like a normie boyfriend unexpectedly delivering twisted jokes for every occasion! That’s not even to say the cold open of this week’s episode was an all-timer. But it wasn’t Trump doing stand-up, and took some actual (if belated) shots at the poisonous ICE mentality, even if the writers—can we just be real and say Colin Jost here? The helpful writing-credit Reddit thread is always mysterious blank on the cold opens, but in the past often attributed Jost—simply cannot stop themselves from assigning a Voice of Reason where none exists. In this case, it was Pete Davidson somewhat pointlessly playing border czar Tom Homan; Davidson is too naturally likable (and even, in his way, sensible) to be of much use as a guy currently best-known for being somewhat less overly Nazi-coded than his predecessor. The cold open winked a little at the fact that Homan’s philosophy doesn’t actually differ radically from all the horrible shit ICE has been up to, but to do too much of that would violate the sane-person-explains-what’s-crazy principle of so many political sketches. Still: This required seemingly more effort than usual, and what a relief to see James Austin Johnson freed from the Trump shtick that’s become his gift/curse, instead offering deadpan “probably wrong” answers to simple questions. Moreover, following a technically above-average cold open, the next few segments were top-notch, starting with a short, simple, and delightfully ridiculous monologue bit where Skarsgård, lacking some kind of immediately well-known persona to riff off, talked about wanting to put a spotlight on the house band for the show’s 1,000th (!) episode. The band pretended to be annoyed by Skarsgård pretending to care about them and pretending to play the saxophone… all together, it was the kind of loose, silly monologue you might expect to see in the late ’80s. From there, Skarsgård backed off to play a relatively quiet dad in an exceedingly well-acted lead-off sketch about a mom (Ashley Padilla) announcing to her family that she has maybe kinda-sorta finally come around on Trump being bad for the country—a potentially hoary premise that might have felt mistimed at any point in the past, what, decade? Yet here it was so well-written, and benefited so mightily from Padilla’s patience as a performer, her willingness to delay a punchline for the sake of precision, that it landed near-perfectly. The host also did fine teamwork in a Jane Wickline-centric pretape that punctured the reverence of Olympics ads, with Wickline as an athlete facing nothing but mortal terror at the prospect of competing. Again: simple premise, fantastic execution. Sadly, that high didn’t last, and the sketches got, well, sketchier after that—hit-and-miss within the sketches themselves, rather than just between them. After Skarsgård’s free-floating, do-whatever goofiness earlier in the episode, it was a little surprising to see him circle back to check off stuff from his Wikipedia bio, even if the general audience might not remember that yes, he actually played Tarzan in a movie that, yes, was actually kind of a hit. (I had forgotten this until the Tarzan sketch aired, and I, well, saw it for work, apparently.) He did a variation on his Northman character in a Viking-raid pretape, passably amusing but coasting a bit on what have become standard CG gore effects that the show brings out about three times a year. Skarsgård did bring some genuine Scandinavian experience to the Scandinavian Film Set sketch that Glen Powell did a few months ago. And there was, naturally, one sketch treating his height as a sight gag. Skarsgård didn’t fully return to his essential yet less persona-specific strangeness until the very end of the night, when he played a “funny” boyfriend cribbing his “random” quips from Cards Against Humanity. By that point, some of the episode’s heedless early joy had dissipated, though the Cards sketch delivered on its own terms. What lingered was the sense that the show doesn’t need a legacy star or old cast member for an installment that feels vaguely like a throwback (complimentary). Given the lack of ceremony in the wake of the 50th season, that was probably the right energy for SNL crossing over into the four-digit episode count. Besides, most comedies don’t really hit their stride until they’ve done at least three thousand. As mentioned, that early stretch was terrific, including Wickline finally speaking for those of us who feel strongly that doing fast sports in the cold sounds, frankly, terrible. Again, I know she’s divisive among some fans, but every time she’s the focus of a segment like that, it’s perfectly judged. While the Tarzan and Cards Against Humanity sketches weren’t quite as great as the early stuff, they both had an agreeable early ’90s vibe, especially Tarzan, even if you felt like Kevin Nealon would have played it better. It’s hard to begrudge the show an occasional recurring sketch these days, given how infrequently they go there, but back-to-back returns of the Scandinavian Film Set and Immigrant Dad Talk Show, both featuring a droll cameo from the host’s real-life dad Stellan Skarsgård, recalled a ’90s episode in a bad way, and was maybe not the best strategy. Neither made me laugh much, but I’d give the edge in unfunniness to Immigrant Dad Talk Show. It’s a much stronger recurring concept overall but already feels like it’s running on fumes after three installments, even as the Skarsgård family brought in some minor variations. Also, the sketch featuring Skarsgård as the awkwardly tall and ill-tempered Iowa transplant Agnes alienating her young peers felt like it wasn’t quite there. Everyone in it was hitting their marks, with the possible exception of the always-dicey person-to-dummy transfer timing for the slapstickiest sections. But there was also a nagging wateriness about how old these girls were supposed to be; I’m not saying there aren’t any kinds who like both Olivia Rodrigo and Bluey (I know, everyone loves Bluey) but between those details, the dialogue, and the general playdate situation, it was hard to tell where between the vast 5-to-10 spectrum the “normal” characters were supposed to be, which throws off their contrast to the outlier character. That might sound astonishingly literal-minded for a sketch where adults dress-up like kids, but that kind of uncertainty can make an outlandish premise harder to sell. The best pure performance in the episode was pretty obviously Ashley Padilla in that first sketch and some of the biggest single laughs came from Jane Wickline, but the most overall fun in the episode belonged to Sarah Sherman, whether remote-reporting in a very cold-looking dress on Weekend Update, inspiring a grudge from Skarsgård’s hulking little girl Agnes, or romantically paired with the host in two successive sketches. She also gets bonus points for plugging her recent stand-up special far fewer times than one of her colleagues has! I was about ready to say that unless I spend the next month mainlining Heated Rivalry, Connor Storrie will rep the rare SNL host where his episode will be where I see him act for the first time. But I guess he was in the Joker sequel that I reviewed for this very website, so technically that isn’t true. But close! Meanwhile, this will be the fourth musical-guest appearance from Mumford & Sons. Time! Jesse Hassenger is a contributor to The A.V. Club. Catherine O’Hara died yesterday, ending the life and career of one of the most celebrated comedic performers of both the 20th and the 21st centuries. It’s no surprise, then, that tributes to O’Hara have been flowing freely all weekend, from fans as well as the numerous people who’ve shared the stage with her over the years, as the casts of SCTV, Schitt’s Creek, Home Alone, Apple TV+’s recent The Studio, and more have stepped forward to share memories and fond feelings toward their friend and co-star. (Apple itself, meanwhile, is clearly having to adjust a few things in the wake of the unfortunate news; The Studio was scheduled for a panel at the company’s big press day for its various TV shows next week, but THR reports that that portion of the event has now been canceled. At the same time, shooting on the show’s second season had reportedly just begun less than two weeks ago, so it remains to be seen how creators Seth Rogen and Evan Goldberg will adjust things now that O’Hara, who played movie executive Patty Leigh in the series, is gone.) Many of the tributes stretched all the way back to O’Hara’s start on SCTV, with Andrea Martin memorializing her friend as “the greatest,” while Martin Short took out time during a comedy show with Steve Martin in Austin this weekend to toast his old friend. “Catherine O’Hara,” Short began. “I met her when she was 18 years of age, and all these years later, she’s been the greatest, most brilliant, kindest, sweetest angel that any of us worked with.” (Steve Martin didn’t chime in in that particular moment, merely clinking glasses respectfully—although his presence did put us in mind of an old Letterman clip that the host’s social media resurfaced as a tribute yesterday, in which O’Hara charmingly noted that she’d biffed an audition for Martin’s 1984 film The Lonely Guy because she’d been too distracted by how “cute” he was.) Short’s comments were reflected by Eugene Levy, who starred with O’Hara in numerous productions dating all the way back to their Second City days. “Words seem inadequate to express the loss I feel today,” Levy wrote in a statement. “I had the honor of knowing and working with the great Catherine O’Hara for over fifty years. From our beginnings on the Second City stage, to SCTV, to the movies we did with Chris Guest, to our six glorious years on Schitt’s Creek, I cherished our working relationship, but most of all our friendship. And I will miss her. My heart goes out to Bo, Matthew, Luke, and the entire O’Hara family.” (O’Hara was married for 34 years to production designer Bo Welch, who she met on the set of Beetlejuice in 1988; the pair had two children.) Levy’s words were echoed by the rest of the Schitt’s cast, including Annie Murphy, Chris Elliott, and Levy’s son Dan, who wrote, “What a gift to have gotten to dance in the warm glow of Catherine O’Hara’s brilliance for all those years… Catherine was extended family before she ever played my family.” Numerous co-stars from O’Hara’s films also chimed in, including Home Alone‘s Macaulay Culkin (“Mama. I thought we had time. I wanted more. I wanted to sit in a chair next to you. I heard you. But I had so much more to say. I love you. I’ll see you later”), Beetlejuice‘s Michael Keaton (“We go back before the first Beetlejuice. She’s been my pretend wife, my pretend nemesis and my real life, true friend. This one hurts. Man am I gonna miss her”), and Christopher Guest himself (“I am devastated. We have lost one of the comic giants of our age. I send my love to her family”). Both Apple and The Studio cast and crew released their own statements about O’Hara this weekend, with the tech giant writing (in a joint statement with Lionsgate), “We are all heartbroken by the loss of Catherine O’Hara. An undeniable legend, icon, and incomparable talent, Catherine elevated every project she was a part of, including the singular genius she brought to her role on The Studio, and every transcendent performance she gifted to us.” O’Hara’s more direct co-workers on the series, meanwhile, wrote, “We are at a loss for words at the passing of our friend Catherine O’Hara. She was a hero to all of us, and we pinched ourselves every day that we got to work with her on The Studio. She was somehow classy, warm, and hilarious all at the same time. We’re unbelievably saddened she is gone and send our deepest sympathy to Bo and all her family.” O’Hara died on Friday, January 30, after what’s been described as a “short illness.”",
  "isFullReview": true,
  "textWordCount": 3479,
  "archivePath": "data/archives/reviews/schmigadoon-2026/paste-amy-amatangelo--amy-amatangelo_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:41:49.939Z",
  "designation": "Recommended",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "assignedScore": 81,
  "llmScore": {
    "score": 81,
    "confidence": "medium",
    "range": {
      "low": 76,
      "high": 86
    },
    "bucket": "Positive",
    "thumb": "Up",
    "components": {
      "book": null,
      "music": null,
      "performances": null,
      "direction": null
    },
    "keyPhrases": [],
    "reasoning": "[ensemble-majority] | 2/3 models agree: Positive | Claude: The review is overwhelmingly positive about Schmigadoon!, praising the musical numbers, performances, writing, and cast. Despite some setup about being deprived of musicals, the critic delivers clear enthusiasm and recommendation. | GPT-4o: The review is filled with praise for the show's homage to Broadway musicals, its humor, and the performances of the cast. Despite the truncated text, the positive tone and enjoyment expressed suggest a strong recommendation. | Gemini: Despite the truncated text warning, the review is overwhelmingly positive, highlighting the show's delightful nature and appeal to Broadway fans. The closing statement suggests a strong recommendation.",
    "flags": {
      "hasExplicitRecommendation": false,
      "focusedOnPerformances": false,
      "comparesToPrevious": false,
      "mixedSignals": false
    }
  },
  "llmMetadata": {
    "model": "ensemble:claude-sonnet-4-20250514+gpt-4o+gemini-2.0-flash",
    "scoredAt": "2026-02-02T02:29:08.591Z",
    "promptVersion": "5.1.0",
    "inputTokens": 0,
    "outputTokens": 0
  },
  "ensembleData": {
    "claudeScore": 89,
    "openaiScore": 82,
    "geminiScore": 80,
    "claudeBucket": "Rave",
    "openaiBucket": "Positive",
    "geminiBucket": "Positive",
    "scoreDelta": 9,
    "thumbsMatch": null,
    "expectedThumb": null,
    "needsReview": false,
    "needsReviewReasons": [],
    "ensembleSource": "ensemble-majority",
    "modelAgreement": "2/3 models agree: Positive"
  }
}
