{
  "showId": "schmigadoon-2026",
  "outletId": "tv-line-dave-nemetz",
  "outlet": "TV Line (Dave Nemetz)",
  "criticName": "Dave Nemetz",
  "url": "https://tvline.com/2021/07/06/schmigadoon-review-apple-tv-plus-musical-cecily-strong/",
  "playbillVerdictUrl": "https://tvline.com/2021/07/06/schmigadoon-review-apple-tv-plus-musical-cecily-strong/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "How would you like to find yourself living inside a classic movie musical? Your answer to that may very well determine how much you'll enjoy Apple TV+'s new comedy Schmigadoon! (premiering Friday, July 16). It's a very affectionate, very specific parody of Golden Age musicals, and theater nerds will undoubtedly adore it... but others might be put off by all the excessive cheer. (The exclamation point in the title is there for a reason.) [pmc_inline_gallery] After watching all six episodes, though, I can say that it fully won me over: The cast is top-to-bottom fantastic, the enthusiasm is infectious, and the sharp jabs it takes at the genre's wheezy old clichés give it a distinctly meta edge. Sketch comedy veterans Cecily Strong (SNL) and Keegan-Michael Key (Key & Peele) star as Melissa and Josh, a pair of doctors who fell in love but have since drifted into an unhappy rut. They go on a couples' retreat to revive their romance, and while they're backpacking in the woods, they stumble upon a magical land where the peppy citizens greet them with an elaborate song-and-dance number. She's a musical fan, so she's charmed... but he's not. And there's a creepy, Twilight Zone-y twist, too: They can't leave the town and get back to their lives without finding true love. (And they haven't found it with each other, apparently.) Inspired by the likes of Brigadoon, Oklahoma! and The Music Man, the town of Schmigadoon is a triumph of imagination — and of production design. Its citizens are familiar types, from the mustached mayor (Alan Cumming) and the whip-smart schoolmarm (Ariana DeBose) to the bad-boy bachelor who can't be tamed (Aaron Tveit) and the little kid with an adorable lisp (Liam Quiring-Nkindi). The colorfully elaborate sets and costumes are worth the price of admission alone; they're an absolute feast for the eyes. (The sets are both wonderfully immersive and slightly artificial, with a faint whiff of theatricality to them; we can almost see the seams.) The original songs mimic beloved showtunes, and the townsfolk happily perform them in zesty, full-scale dance numbers. So for fans of classic musicals, it's a delight just taken at face value. This town has decidedly old-fashioned values, though... which is a nice way of saying they're all painfully regressive. (They can't believe Melissa is actually a doctor: \"But you're a girl.\") Kristin Chenoweth plays town scold Mildred Layton, who won't even allow Melissa and Josh to stay in the same room at the local inn, since they're (gasp!) unmarried. Luckily, Melissa is a musical expert, so she knows what to expect, and through her eyes, the show gleefully takes aim at the musical genre's problematic clichés, with lots of knowing winks to the audience. (\"Women were so underwritten in early musicals,\" she sighs.) Schmigadoon! manages to dissect the genre and celebrate it at the same time, pointing out its glaring flaws while still embracing its virtues. The actors are clearly having a ball, too. Strong is great and goofy here, in one of her best roles yet. (The Sound of Music-esque tune that Melissa sings to teach the locals about a woman's reproductive anatomy is a hilariously naughty highlight.) We know Key is a tremendously gifted comedian, so it's frustrating to watch him mostly play the humorless straight man here, but he does have a few zany moments. And the supporting cast is almost embarrassingly stacked: Tveit and Cumming are especially good, as are Jane the Virgin's Jaime Camil as the dashing town doctor and 30 Rock's Jane Krakowski as the glamorous Countess. Most of them only get a scant few minutes of screen time, though, unfortunately. I almost wanted the show to be longer than six episodes, just so we could see more of these great actors inhabiting this weird world. The story does get a little cutesy and simplistic at times, almost like a kids' movie. (Co-creators Cinco Paul and Ken Daurio are best known for their work on the Despicable Me franchise, which makes a lot of sense.) Most of the songs end up being too faithful to the genre: They could fit right into a classic musical soundtrack, but they lack an inspired comedic spin. I found myself wishing the show would go further, hit harder, follow through on its more savage instincts. But it does build to a satisfying finish, echoing Pleasantville as the two outsiders kick off a chain reaction of chaos in town with their new-fangled ways. It just goes to show you: Even old stories can always be rewritten. THE TVLINE BOTTOM LINE: Apple TV+'s Schmigadoon! is a colorful treat for fans of classic musicals, with enough satirical bite to cut through the sweetness. When \"Lost\" premiered on ABC in 2004, the mind-blowing pilot was an instant hit, garnering 18.6 million viewers. It would be natural to assume series co-creator Damon Lindelof was ecstatic about the success ... but he was not. In the book \"The Revolution Was Televised,\" Lindelof recounted how the blockbuster ratings left him feeling three very negative emotions: \"Terror, depression, anxiety, anxiety attacks. I'm not exaggerating. Everybody who was around me at the time knows I pretty much wanted to die, and knowing that wasn't going to happen unless I took matters into my hands, I just wanted to quit. But there was literally no one to quit to.\" Lindelof said he felt \"totally creatively crippled\" because the writers had moved so fast through the show's development process that they only had time to iron out the details for the expansive cast of characters. For example, just about from the start, the writers knew why John Locke (Terry O'Quinn) doesn't want to leave the Island. But they had no explanations for the mythological weirdness happening on the periphery of the pilot episode. They only knew that the survivors unknowingly came to the Island for some kind of nebulous battle between good and evil. After the first season was completed, Lindelof and the other minds behind \"Lost\" got together to flesh out the philosophical underpinnings of the Island, ultimately creating Jacob, the Dharma Initiative, and the entire history of the Island that the show's first season only hints at. In its day, the final episode of \"M*A*S*H\" broke TV viewership records with a sendoff fondly remembered. In the years to come, it would prove to be the exception rather than the rule. It seems these days that series finales are virtually guaranteed to polarize at best, and outrage at worst. Frequently, however, knee-jerk hate is a short-sighted take, and there's more to those shows than may meet the eye initially. In the following list, we've identified 10 series finales that deserved better than what many gave them at the time. Some were deemed inconsistent with stronger episodes that came before; others felt like misdirection, or attempts to provoke rather than please; and a couple were just really depressing bummers, though we've since had a chance to realize why they had to be that way. \"Twin Peaks\" didn't make this list because it finally got a third season more than 20 years later. Its finale-finale was still weird, but David Lynch fans gave him grace and assumed it was them, not him. As we'll see below, that's something viewers ought to do more often, even for shows not run by famous filmmakers. We might as well start with the dragon in the room. David Benioff and D.B. Weiss potentially lost a \"Star Wars\" trilogy over the backlash the \"Game of Thrones\" finale got. As another major franchise might say, however, they were in a Kobayashi Maru no-win scenario. \"Game of Thrones\" was adapted from George R. R. Martin's fantasy novels on the implied condition that he would continue writing the books on schedule and have them all done by the time the show was ready to end. Not only did this not happen, but it still hasn't happened. Doing what they could, Benioff and Weiss at least got him to reveal the key plot points he had in mind for the ending... then they went straight to those plot points. We don't disagree that the ending feels rushed. Arya (Maisie Williams) kills the Night King (Vladimir Furdik) pretty suddenly; Daenerys' (Emilia Clarke) heel turn is quick; and Bran (Isaac Hempstead Wright) is a surprising choice for the Iron Throne. Yet these are the right plot points. Daenerys was set up as a false savior, Arya trained to be the world's best assassin, Cersei (Lena Headey) and Jaime (Nikolaj Coster-Waldau) needed to die together, and a show that began with Bran getting pushed out of a window found symmetry in his ascent at the end. The complaint is that this didn't happen slowly, but without Martin's dialogue to go on, would Benioff and Weiss have been as adept with the slow stuff? We're not so sure. In its final season, \"Lost\" appeared to confirm the early fan theories of cynics that the mysterious island had been Purgatory all along. It hadn't, of course — only the \"flash-sideways\" scenes in the final season took place in the afterlife. They led to an ending that basically confirmed what showrunners Carlton Cuse and Damon Lindelof had been saying the whole time: It wasn't the mysteries that were the point of the show, but the character interactions and growth along the way. They needed to come into each other's lives to make their journeys complete; that it took the island equivalent of He-Man's Castle Grayskull to do it was almost incidental. There was no chance all the mysteries could have paid off in a way that satisfied everyone, but we got explanations for the smoke monster, the polar bears, the hatch, the Dharma Initiative, and a lot more, based primarily around the notion that a fount of great and mysterious power needs a designated, near-immortal guardian. Anyone who found that too far-fetched probably should have tapped out right around the time a smoke monster became a major character on the show. Or Locke (Terry O'Quinn) returned from the dead. Or the island literally moved locations with a turn of the steering wheel! James Gandolfini's Tony Soprano left our TV screens not with a bang or a whimper... just a sudden cut to black while he was eating with the family. For the saga of a gangster to end that way — neither violently like Tony Montana, nor uncharacteristically peacefully like Don Vito Corleone — felt dramatically unsatisfying to many viewers that night. Show creator David Chase has steadfastly refused to say what happened to Tony next, and has corrected anyone who dares even imply that he did. It's the dissatisfaction that's the point of the ending of \"The Sopranos.\" This is, after all, a show about a man in therapy because his career constantly stresses him out. He'll never be okay; he'll always have to look over his shoulder after all the things he's done. That's the point. Chase has made comments to the effect of Tony being doomed eventually as a result of his career in the mob, but he'll never know when and where, and always have it in the back of his mind as a possibility. So whether Tony was killed then and there at that meal or not, that ending put us in his headspace. Will it happen? Won't it? He'll never know, and neither will we. That may not feel dramatically satisfying, but it helps us to viscerally get into Tony's head better than something more melodramatic would have. For five seasons of \"Quantum Leap,\" most of us assumed that Sam Beckett (Scott Bakula) was hopping into different bodies throughout his own timeline as a result of an expensive scientific experiment gone wrong. In the series finale, something a little closer to divine intervention was suggested instead. Sam leaps to a bar in a mining town that seems to exist outside of the reality we know, as a wise bartender (Bruce McGill), who claims not to be God, nonetheless explains the parameters of the situation to him. The bartender tells him he can return home to his era any time he likes, but that he can do more good helping people with his leaps. Proving that he has the selflessness required, Sam takes a final leap — as far as we know — and rather than going home, he goes back in time to tell the wife of his best friend, Al (Dean Stockwell), that he survived Vietnam, and she should wait for him. Al's life is changed, as his marriage is saved, and he never becomes the womanizer we've come to know across five seasons. An onscreen title tells us Sam never returned home. The lack of a personal happy ending for Sam bummed fans out, but if he truly was in the hands of the divine, why wouldn't he choose a more Christ-like path of selfless service? Offered proof that faith trumped science, he went all-in on faith. Before \"E.R.\" and \"The Pitt,\" there was \"St. Elsewhere,\" a medical drama that helped launch the careers of Denzel Washington, Alfre Woodard, Howie Mandel, and Ed Begley Jr. As serious and melodramatic as it was, though, the show frequently slyly referenced other shows and movies, via names called over the PA system, previous colleague names, and even direct character crossovers, sometimes from very tonally different shows like the sitcom \"Cheers.\" In its own way, the ending finally explained all of that. Offering up one of the biggest swerves in TV history, the series finale revealed that the entire show had been imagined by an autistic child staring into a snowglobe containing a plastic model hospital. The child's father is the show's original main character, Donald Westphall (Ed Flanders), but in \"reality,\" he is younger and works in construction. Fans like Dwayne McDuffie have noted that the truly obsessed could make a case that virtually every major show on TV took place in the \"Tommy Westphall Universe,\" once you take every show \"St. Elsewhere\" ever did a crossover with, and then every show all those shows ever crossed over with, and so on. What's more likely, however, is that an autistic kid used elements of every TV show he'd ever seen to augment his own imagination. That, in turn, would explain every in-joke on the series, turning a classic WTF into an \"Aha!\" moment. U.K. sci-fi fans of the late '70s were used to science fiction adventures like \"Star Wars\" ending happily, and TV heroes like The Doctor prevailing over tyranny. \"Blake's 7,\" however, wasn't playing around. A version of the Robin Hood legend in space, with outlaw Roj Blake (Gareth Thomas) fighting a space Federation with his merry men aboard the starship Liberator, it wrapped up with a double-whammy of a downer. The third season was expected to be the last, and featured Blake going missing, replaced as lead by Paul Darrow's Avon. In the fourth season, Avon finds Blake, whom he believes to be a traitor, and kills him. Avon is promptly betrayed to the Federation, who kill the other main characters and surround Avon with their guns drawn as the final episode ends, and gunshots sound. Good guys lose, and space fascists prevail. Nowadays, fans would praise this kind of grim turn. Classic historical epics like \"The Iliad\" often featured heroic ends for heroic protagonists, and English sci-fi tended to be way more cynical and less aimed at pleasing everyone than their American counterparts. Kids back then who didn't know you could just have the good guys lose were, to say the least, taken aback. It remains controversial to this day. Technically, the classic \"Star Trek\" doesn't have a series finale as we normally know it. The show was canceled without enough notice to come up with an ending. Nevertheless, the last episode, \"Turnabout Intruder,\" is the last one chronologically, and definitely not one of the franchise's most memorable moments. In it, Captain Kirk's (William Shatner) hysterical ex, Dr. Janice Lester (Sandra Smith), angry at perceived institutional sexism in Starfleet, switches bodies with Kirk so she can become Captain of the Enterprise. Criticisms of it aren't entirely wrong. \"Trek\" creator Gene Roddenberry, while politically progressive, had a solidly sexist streak in him that surfaced from time to time. With the portrayal of Dr. Lester as an ostensible feminist who proves every anti-feminist talking point correct with her terrible behavior, he indulged it. And yet, this entire episode features Shatner pretending to be possessed by an insane woman. The pauses and the big gestures are out of control, and it may be fair to say that almost every Shatner impersonation you've ever seen is based on this episode. As science fiction, it may be bad. As utopianism, it's worse. As an example of Shatner outdoing himself with Shatnerisms, however, it's pure campy magic. \"Seinfeld\" claimed to be a show about nothing, when, in fact, it was obsessed with mundane aggravations. Jerry (Jerry Seinfeld) and his friends would regularly encounter the sort of small annoyances everybody deals with, and blow them out of proportion, often to the point of creating a new catchphrase of the week that would enter the pop culture lexicon. Not that there's anything wrong with that... For the \"Seinfeld\" finale, Jerry, Elaine (Julia Louis-Dreyfus), George (Jason Alexander), and Kramer (Michael Richards) get put on trial under an obscure \"good neighbor\" law that indicts them for selfishness. Testifying against them are many of the characters who generated those nuisances and catchphrases throughout the series' run. Looking back, this was an episode ahead of its time. The concept of \"fan service\" wasn't yet a mainstream notion. Behold Marvel and Star Wars now, and the way they keep bringing characters back — even minor ones like Jimmy Woo or Bossk. Then watch the \"Seinfeld\" finale again, looking at it as an indictment of giving the viewers what they think they want. Everything that became a recurring pop culture joke is being shoved in your face again by writer Larry David. (As it turns out, we were just beginning to scratch the surface of David's misanthropy.) The ending to \"Dinosaurs\" should maybe have been inevitable. As one of the late Jim Henson's final projects, it's arguably brilliant. Yet it's brutal as hell, especially for a show that had promoted itself to kids with an endearingly violent baby dinosaur who even put out a music cassette and had a hit single. \"Dinosaurs\" was a sitcom featuring a family of humanoid dinosaurs, all created through puppetry. The Sinclairs were in many ways a prototypical sitcom family: Earl (Stuart Pankin), the macho, simple dad; Fran (the late Jessica Walter), the loving homemaker mom; Robbie (Jason Willinger), the rebellious teenage son; Charlene (Sally Struthers), the airheaded daughter; and of course, youngest child Baby (Kevin Clash), who liked to whack his dad on the head with a frying pan, yelling, \"Not the mama!\" and \"Gotta love me!\" Henson always was an activist, and the show dealt with many hot-button issues, but usually in a manner that, like most sitcoms, set everything right by the end. But the final episode, while offering allegorical commentary on the topics of industrial pollution, climate change, and nuclear winter, ends with the dinosaurs preparing to go extinct, thanks to corporate short-sightedness, malfeasance, and incompetence. As their world begins to freeze over, the Sinclair family tries to be optimistic, as Earl insists they've been around for 150 million years and can't go away now. Any kid who knew anything about dinosaurs, however, knew what was up and felt the gut punch. It's still talked about today, now in more awe-struck terms, but it certainly ruined some nights in 1994. After nine seasons, significant diversion from the source material, and the development of many characters viewers had grown to love, it must have seemed to viewers like the \"Little House on the Prairie\" town of Walnut Grove would exist forever. Instead, in the TV movie \"Little House: The Last Farewell,\" the neighborhood fell, first into the hands of an evil land developer and then literally, as it all blew up. Well, all except for the little house itself, and the church — director (and Charles Ingalls actor) Michael Landon thought any harm coming to the latter would be a bridge too far for the many faith-based fans of the franchise. Kids may have been upset to see their favorite scenery explode, as the rebellious townspeople opted to destroy their homes rather than let them be taken. Behind the scenes, though, Landon had originally agreed to leave the Southern California land as he found it when the show ended, and destroying all the buildings saved time on hauling the remains away. James Karen, who played the evil Mr. Lassiter, was well known as a pitchman for Pathmark supermarkets. Fearing for his job after fans complained to Pathmark that they had hired a villain, Karen wrote to as many of them as he could to kindly explain he was just playing a role. It worked well enough that he kept the job. In reality, of course, Walnut Grove still exists where it always has, in Minnesota.",
  "isFullReview": true,
  "textWordCount": 3523,
  "archivePath": "data/archives/reviews/schmigadoon-2026/tv-line-dave-nemetz--dave-nemetz_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:42:14.294Z",
  "designation": "Recommended",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "assignedScore": 80,
  "llmScore": {
    "score": 80,
    "confidence": "high",
    "range": {
      "low": 75,
      "high": 85
    },
    "bucket": "Positive",
    "thumb": "Up",
    "components": {
      "book": null,
      "music": null,
      "performances": null,
      "direction": null
    },
    "keyPhrases": [],
    "reasoning": "[ensemble-unanimous] | All 3 models agree: Positive | Claude: The critic clearly states the show 'fully won me over' and calls it 'a colorful treat' despite acknowledging some flaws like being 'cutesy and simplistic at times' and wishing it would 'go further' with its satirical elements. | GPT-4o: The review praises the show for its infectious enthusiasm, fantastic cast, and clever parody of classic musicals. While it notes some minor shortcomings, the overall tone is highly positive, making it a strong recommendation for fans of the genre. | Gemini: The review is overall positive, highlighting the show's appeal to musical fans and its satirical elements. While it mentions some flaws, the bottom line is a recommendation.",
    "flags": {
      "hasExplicitRecommendation": false,
      "focusedOnPerformances": false,
      "comparesToPrevious": false,
      "mixedSignals": false
    }
  },
  "llmMetadata": {
    "model": "ensemble:claude-sonnet-4-20250514+gpt-4o+gemini-2.0-flash",
    "scoredAt": "2026-02-02T02:29:18.655Z",
    "promptVersion": "5.1.0",
    "inputTokens": 0,
    "outputTokens": 0
  },
  "ensembleData": {
    "claudeScore": 78,
    "openaiScore": 82,
    "geminiScore": 80,
    "claudeBucket": "Positive",
    "openaiBucket": "Positive",
    "geminiBucket": "Positive",
    "scoreDelta": 4,
    "thumbsMatch": null,
    "expectedThumb": null,
    "needsReview": false,
    "needsReviewReasons": [],
    "ensembleSource": "ensemble-unanimous",
    "modelAgreement": "All 3 models agree: Positive"
  }
}
