{
  "showId": "schmigadoon-2026",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Unknown",
  "url": "https://www.vulture.com/article/schmigadoon-series-review.html ",
  "playbillVerdictUrl": "https://www.vulture.com/article/schmigadoon-series-review.html ",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nMelissa (Cecily Strong) and Josh (Keegan Michael-Key) arrive in Schmigadoon, a town that’s like if The Good Place were Rodgers and Hammerstein-themed.\n                  Photo: Apple TV+\n              \n            \n              \n        The new Apple TV+ comedy Schmigadoon! is 12 kinds of absurd, excessive, self-referential, and overly winking jokes about musicals, stuffed into pastel petticoats and sent spinning out onto a TV set designed to look like a stage, complete with a false blue horizon line. There is no end to its willingness to pander to those literate in Golden Age musicals. There are jokes about thinly written female characters, and a group dance number about a weird food celebration. Alan Cumming plays a closeted character with the last name Menlove. Detailed medical lyrics about reproduction are set to the melody of a famously simplistic pedagogical musical number. Characters who are direct take-offs from Carousel, Music Man, King and I, and others keep cropping up, bumping up against one another in awkward, discombobulated genre pastiche. Most exhausting, Schmigadoon is perpetually and glibly aware of how mannered and bric-a-brac it feels. It loves the visibility of its false-stage TV set, the throwaway jokes about color-blind casting, the characters in a musical wondering aloud what musical trope is about to happen. It is so sweet, so innocently knowing, so pleased with itself. Frankly, the whole thing is mortifying.\n\nI love it. I love it with the helplessness of a musical protagonist being yanked into an indulgent, unnecessary dream ballet.\n\nFor anyone who does not immediately recognize the title, the name Schmigadoon! is the dumbest imaginable goof version of the title Brigadoon, a Lerner and Loewe musical about two American tourists who accidentally discover a lost Scottish town that only appears for one day every 100 years. In Schmigadoon!, which premieres the first two installments of its six-episode season this Friday, Keegan-Michael Key and Cecily Strong play Josh and Melissa, two physicians in a long-term relationship who go on a romantic hike to reconnect with each other, and instead find themselves in Schmigadoon, a town that’s like if The Good Place were Rodgers and Hammerstein themed. The town is in a musical, or rather, the town is in all the musicals all at once, and only Melissa and Josh notice how weird it is that everyone keeps singing and dancing. Further, the pair discover they cannot leave Schmigadoon until they find true love.\n\nThe cast is full of musical stars — Alan Cumming, but also Kristin Chenoweth, Ann Harada, Jane Krakowski, Aaron Tveit, and Ariana DeBose — and as is the case with any decent pastiche, so much of the pleasure is in how close the false version comes to replicating the original even while it’s spoofing. Not every number in Schmigadoon! is a runaway hit, but the big town-wide performance of a song called “Corn Puddin’” in the first episode is what won me over. It is buoyant in a way that feels completely airborne, silliness for silliness’s sake, except that its lyric “put the corn in belly ’cause it’s good for the soul” is so truly, naïvely cheerful that I found myself muttering it for days afterward.\n\nBecause Schmigadoon! is nothing if not corny. It is a backstage musical (like Cabaret or Follies, a musical about putting on a show) that’s stuck in the world of integrated musicals, shows like Oklahoma! or Sound of Music, where songs are naturalistic extensions of the narrative’s emotional arc. In other words, it is a show where the only real way to register your feelings about being trapped in the aesthetics and the morality of a Golden Age musical is to burst into song about how weird and frustrating it all is. And really, what could be cornier than eventually giving in and singing about the transformative power of love (and also musicals)?\n\nIn its own way, Schmigadoon! is as blinkered as the musicals it so lovingly mimics. There is never any doubt about what true love will look like in its world, nor is there much probing complexity about the challenging familial relationships it also borrows from Rodgers and Hammerstein. Melissa’s love of love and song is stereotypically female and wobbly, just as Josh’s cold, emotionally shielded loathing of musicals is obvious enough to warrant eye rolls.\n\nEven more notably, Schmigadoon! is obsessed with the bright colors and superficial lightness of Golden Age–era musicals from the mid-20th century, but it’s uninterested in how serious most of them really are. Its Carousel take-off character is a brooding ne’er-do-well carnie who becomes alarmed by the ramifications of an extramarital affair, but Schmigadoon! stops well short of Carousel’s stare-into-the-abyss approach to death, children born outside of marriage, and social shunning. Likewise with Sound of Music’s crisis-of-faith and rise-of-nationalism themes — Schmigadoon! is happy to make a crack about Nazis, but that’s as far as it goes.\n\nIf your hope for Schmigadoon! is that it skewers either its source text or the stereotypical musical audience, you will come away disappointed. Schmigadoon! has no pointy edges with which to skewer anything. Even its harshest angles are eventually wrapped in a warm, four-part harmony embrace. It is a musical pastiche, yes, but it’s mostly a bowl of corn puddin’ — wholesome and familiar and maybe a dash too sweet. I’d happily take a second helping.\n\nShow \n      \n    \n    Comment\n  \n\n\n\n      I’m Just a Girl Who Can’t Say No to Schmigadoon!\n\n\n\n    \n      \n        \n  \n\n\n      \n      \n      \n        \n  \n\n\n      \n    \n\n  \n  \n\n\n\n  \n\n\n\n        Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 914,
  "archivePath": "data/archives/reviews/schmigadoon-2026/vulture--unknown_2026-02-01.html",
  "textFetchedAt": "2026-02-01T19:11:30.432Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20260105215009",
  "archiveOrgUrl": "http://web.archive.org/web/20260105215009/https://www.vulture.com/article/schmigadoon-series-review.html"
}