{
  "showId": "kimberly-akimbo-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2022/11/10/kimberly-akimbo-the-sweet-musical-treat-we-need-right-now/",
  "publishDate": "2022-11-10T21:53:55",
  "fullText": "This show is, in a word, a honey. How refreshing to get an unabashedly good-hearted musical that again and again affirms two simple truths: that we’re all more alike than we are different, and that we flourish, rather than wither, in the presence of our differences.\n\nAh, but how it came to be; now there’s a tale. Because the source material didn’t necessarily promise the warm good time now gracing the Booth Theater stage.\n\nThere are two Kimberly Akimbo’s, you see: the straight play from 2001, and the current musical, each penned by Pulitzer winner (for Rabbit Hole) David Lindsay-Abaire. Both concern a New Jersey high schooler, Kimberly Levaco (played here by Victoria Clark), whose genetic makeup causes her to age four times as fast as everyone else. In both, the aged-looking teen has just reached her 16th birthday, which is about as old as medical science says she’ll get. Both saddle her with neglectful, narcissistic parents and a deadbeat aunt, who cynically drafts Kimberly into a dangerous check-fraud scheme. Each incarnation of lonely Kimberly harbors dreams of normalcy, tempered by full awareness of how little time she’s got left.\n\nThe five-character play, funny as it is, now seems laced with acid out of another era (and let’s face it, two decades is no small cultural divide). Brutally single-minded in their entitlement and funk, the play’s adults attack each other – and the kids – with enough open hostility to make Edward Albee recoil. There’s not enough room in the Levaco family swear jar for all the coins their four-letter words demand. Though there’s a note of liberation by the play’s end, a chill hangs over the action and dénouement, the kind one associates with Jules Feiffer and even Pinter, or early-career Christopher Durang (to whom Lindsay-Abaire is frequently compared).\n\nA remarkable alchemy was required to transform this intolerance cavalcade into the luminous celebration of life that’s setting today’s audiences to weeping and cheers.\n\nEnter Lindsay-Abaire to take on lyrics as well as libretto, and his composer partner from Shrek, Jeanine Tesori. Their score is an enchanting blend of rhymed fancy and neo-recitative à la Hair’s “Frank Mills.” And a terrific cast has been assembled. But it’s two decisions by the authors and director Jessica Stone – one a matter of subtraction, the other of addition – that merit a lot of credit for this joyous evening.\n\nFirst, they’ve given the adults more dimensions, shifting the play’s over-the-top cruelty into something less off-putting, a kind of careless self-absorption. Cranky expectant mother Pattie (Alli Mauzey) is allowed to show a tender side in a gorgeous lullaby, “Father Time.” Husband Buddy (Steven Boyer) remains a boozing, self-pitying blue collar guy, but now played for sheepish comedy. On-the-lam Aunt Debra, who’s truly monstrous in the original play, becomes in the hands of Bonnie Milligan a high-wattage showstopper, belting out confessions of sin and avarice (“How to Wash a Check,” the hilarious act two opener) with no loss of joie de vivre.\n\nSoftening the adult characters’ bite – there are many fewer trips to the swear jar – doesn’t diminish the effect on poor Kimberly. If anything her pain is intensified, because now it comes from an authentic emotional base rather than a place of caricature. She chafes at their lack of attention while reeling from the notion that she has disappointed them, and that’s an ambivalence to which most, and maybe all of us can relate.\n\nMeanwhile, whoever came up with the idea of adding a Greek chorus of four high schoolers can accept a special Tony from me. Theirs are more hearts in need: Aaron (Michael Iskander) yearns for Delia (Olivia Elease Hardy), who hungers for Teresa (Nina White), who’s hung up on Martin (Fernell Hogan), who only has eyes for, you guessed it, Aaron. That’s four charming subplots right there, offering comedy relief and movement backup. (The spare but effective choreography is by Danny Mefford.) In the play, Kimberly’s unseen fellow classmates are mentioned as either bullying or ignoring her. With this irrepressible quartet in the house, Kimberly Akimbo becomes something more than a relentless examination of one character’s distress. It encompasses the whole range of experience, elation as well as sadness, in the agonizing process of growing up.\n\nVictoria Clark’s Kimberly is a far cry from her Tony-winning steely matron in The Light in the Piazza, but no less rich in concentration and subtext. It’s easy to suspend disbelief that this actress of an age is genuinely an adolescent, gawky and uncomfortable, stubbornly staking out her individual identity while quietly conscious of her other-ness. Enter Seth Weedus (Justin Cooley), an equally neglected sad sack, possibly on the spectrum but unfailingly of good cheer. His refusal to see his friend as tainted or strange is a major agent of her taking control of her destiny.\n\nClark and Cooley have reaped just praise for their work ever since the Off Broadway premiere last year under the Atlantic Theater Company aegis (where the show copped the New York Drama Critics Circle award). There are few performers whose every entrance, every line provoke audience smiles, and Clark and Cooley are two such, the best double act in town.\n\nEschewing power ballads and repeated, explicit assertions of self-doubt and self-worth – I’m looking at you, Dear Evan Hansen – this remarkable pair of performances, and the beautifully modulated show at which they are the center, offer simple yet ringing affirmation that we need to appreciate each other and enjoy the ride, because we only get on this roller coaster once.\n\nKimberly Akimbo opened November 10, 2022, at the Booth Theatre. Tickets and information: kimberlyakimbothemusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial"
}
