{
  "showId": "a-streetcar-named-desire-2012",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/streetcar-named-desire-theater-review-314741/",
  "publishDate": "April 23, 2012",
  "fullText": "By Ray Bennett, The Associated Press \n\n \n\n July 29, 2009 1:19pm\n\nA knockout performance by Oscar winner Rachel Weisz as Blanche DuBois is the main reason to see “A Streetcar Named Desire” at London’s Donmar Warehouse, but the production has many other riches.\n\nTony-winning choreographer Rob Ashford turns director here and brings out all the poetry and drama of Tennessee Williams’ masterpiece set in sultry New Orleans just after World War II. Weisz has made herself alarmingly thin for the role of a woman whose vulnerability is as delicate as her needs are wanton and who is destroyed by a force that she can neither understand nor control.\n\nElliot Cowan is suitably muscular, loud and threatening as Stanley Kowalski, the husband of Blanche’s lovestruck sister, Stella, played well by Ruth Wilson (TV’s “Jane Eyre”), and Barnaby Kay makes her suitor Mitch appropriately stolid.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Music\n \n \n \n \n\n \n \n \n \n Netflix to Air Special BTS Comeback Performance and New Documentary \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n TV\n \n \n \n \n\n \n \n \n \n 'The Kelly Clarkson Show' to End After Seven Seasons in Syndication\n\nFrom Blanche’s arrival at her sister’s dingy two-room apartment, rendered evocatively by set designer Christopher Oram using wrought iron and a spiral staircase, it’s apparent that this dreamy lost waif will clash with her violently territorial and crude brother-in-law.\n\nWeisz is exactly the right age for Blanche, and though she can do nothing to make her radiant features appear faded, she conveys acutely the woman’s sense of loss and desperate need for emotional nourishment. She increasingly is delusional, but her love of artifice and style is apparent, and it is clear why she is catnip to certain men.\n\nAshford brings in characters from Blanche’s life to underline the grip the past has on her fragile imagination and cleverly uses the same actor (Jack Ashton) to play the delivery boy she toys with and her late husband in dream sequences.\n\nBlanche’s sorrow is the result of seeing the boy she married blow his brains out after she caught him in the intimate embrace of an older man. With her home gone and her teaching career in tatters, she arrives to sponge from her sister with lies about her past and future, only to run into the immovable Stanley.\n\nWeisz brilliantly succeeds in a role that was originated by Jessica Tandy on Broadway in 1947 and played in 1949 in the West End by Vivien Leigh, who went on to win her second Oscar for the Elia Kazan movie version opposite Marlon Brando.\n\nBrando’s shadow looms over any production of Williams’ masterpiece, making life difficult for the actor playing Kowalski, and so it is for Cowan. He gets the strutting-thug part of Kowalksi right but misses the vulnerability and insolence and doesn’t really succeed in showing why Stella loves him, nor why he finds Blanche such a threat.\n\nIt’s a stalwart performance, though, in a terrific production, and Weisz makes it unforgettable.\n\nVenue: Donmar Warehouse, London (Through Oct. 3)Cast: Rachel Weisz, Elliot Cowan, Ruth Wilson, Barnaby KayPlaywright: Tennessee WilliamsDirector: Rob AshfordSet designer: Christopher OramLighting designer: Neil AustinMusic/sound designer: Adam Cork",
  "isFullReview": true,
  "dtliExcerpt": "Blair Underwood brings a smoldering intensity to Stanley Kowalski, while Nicole Ari Parker's Blanche DuBois is a fragile creature whose descent into madness is both heartbreaking and convincing.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Blair Underwood brings a smoldering intensity to Stanley Kowalski, while Nicole Ari Parker's Blanche DuBois is a fragile creature whose descent into madness is both heartbreaking and convincing.",
  "contentTier": "complete",
  "contentTierReason": "Short text (28 words)",
  "textWordCount": 505,
  "archivePath": "data/archives/reviews/a-streetcar-named-desire-2012/hollywood-reporter--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:02:14.764Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "misattributedFullText": true,
  "extractedByline": "Ray Bennett",
  "expectedCritic": "David Rooney",
  "wordCount": 505,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-03T11:42:25.319Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production of 'A Streetcar Named Desire' at London's Donmar Warehouse, not the current Broadway run.; kimi: This review explicitly covers the 2009 production at London's Donmar Warehouse starring Rachel Weisz, not a current Broadway run. The venue and date clearly indicate this is a West End production.",
  "promptVersion": "5.2.0"
}
