{
  "showId": "a-streetcar-named-desire-2012",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/streetcar-named-desire-review-gillian-anderson-in-stripped-down-version-1.11745218",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/streetcar-named-desire-review-gillian-anderson-in-stripped-down-version-1.11745218",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Updated May 1, 2016 9:00 PM\n By Linda Winer linda.winer@newsday.com\n\nadvertisement | advertise on newsday\n\nWHAT “A Streetcar Named Desire”\n\nWHERE St. Ann’s Warehouse, 45 Water St., Brooklyn, through June 4\n\nINFO $56-$90; 718-254-8779; stannswarehouse.org\n\nBOTTOM LINE Gillian Anderson and Ben Foster in disappointing “Streetcar” from London.\n\nA modern-dress rethinking of “A Streetcar Named Desire” has arrived on the shores of Brooklyn with splendid advance word from London, especially for Gillian Anderson’s Blanche DuBois. What’s more, the production comes from the Young Vic, the adventurous British organization that coproduced the stunning, stripped-down revival of “A View from the Bridge,” directed by Ivo van Hove, that was a revelation on Broadway last fall.\n\nAlas, that’s about it for the delicious allure of anticipation. This “Streetcar,” directed by Benedict Andrews, is a shocking disappointment. Clocking in at an overheated but glacially slow three hours and 15 minutes, the production is heavy with phony rawness, look-at-me histrionics and a see-through contemporary set (by Magda Willi) on a turntable that makes sure theatergoers seated on all four sides get to watch Tennessee Williams’ iconic characters preen in beautifully-fitting underwear.\n\nadvertisement | advertise on newsday\n\nAnderson, best known internationally as Special Agent Scully in “The X-Files,” was born in America but raised both here and in England, where she has a celebrated stage career. It is painful to report that her Southern accent is arguably the most bizarre import since Vanessa Redgrave drawled through what was meant to be Williams’ “Orpheus Descending” in 1989. With Anderson discovering so many new syllables in each word, little wonder the night took so long.\n\nAndrews’ primary innovation is to toss all suggestions of the shaggy, fragrant charm of old New Orleans — which, in this case, means no atmosphere at all. The tenement where Stella and Stanley live is still tiny, but its three rooms have no walls and are on a long rectangular contraption. Until Blanche starts tossing around her fancy clothes (by Victoria Behr) and Stanley makes Stella’s nose bleed with his fist, the place has the sterile white look of modular furniture from Ikea.\n\nEveryone in the play talks about Blanche’s refined demeanor, but Anderson’s one-note portrayal is hard, shrill and slutty from the start. Did she really ever fool Mitch (Corey Johnson) into thinking she had class? As brute Stanley, film star Ben Foster (Lance Armstrong in “The Program”) admirably avoids a Brando imitation but his low-key simian presence is no match for this Blanche’s histrionics. Vanessa Kirby has an appealing, healthy, modern sensuality as Stella.\n\nFor all the intended realness, including a gratuitous urination scene for poor Stella, all the hot sex looks pretend and Blanche takes baths in her slip. Colored lights and music, often blasting electronic assaults, separate the scenes. Blanche still reaches out for kindness of strangers, but Tennessee Williams is the one here who could have used protection.\n\nComing soon: Newsday's Entertainment newsletter, for the latest on celebs, TV, more.\n\nNewsday.com now uses Facebook for our comment boards. Please read our guidelines and connect your Facebook account to comment.",
  "isFullReview": true,
  "textWordCount": 510,
  "archivePath": "data/archives/reviews/a-streetcar-named-desire-2012/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:57:35.201Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20160504095423",
  "archiveOrgUrl": "http://web.archive.org/web/20160504095423/http://www.newsday.com:80/entertainment/theater/streetcar-named-desire-review-gillian-anderson-in-stripped-down-version-1.11745218",
  "contentTier": "complete",
  "wordCount": 510,
  "tierReason": "Full review text"
}