{
  "showId": "a-streetcar-named-desire-2012",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2012/legit/reviews/a-streetcar-named-desire-1117947317/",
  "publishDate": "April 22, 2012",
  "fullText": "As long as viewers set their expectations to \"pretty good,\" the latest adaptation of Charles Dickens' seminal tale of social climbing and secret identities will satisfy.\n\nAs long as viewers set their expectations to “pretty good,” the latest adaptation of Charles Dickens‘ seminal tale of social climbing and secret identities will satisfy. Lacking the epic scope — and length — of recent BBC/PBS Dickens minis “Bleak House” and “Little Dorrit,” “Expectations” still delivers the solid performances, sturdy period allure and comforting familiarity Masterpiece audiences crave.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n '68th Annual Grammy Awards' Review: Music's Biggest Stars Found Their Own Ways to Recognize a National Crisis... In-Between the Delights of a Sabrina Carpenter and a Cher \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Golden' From 'KPop Demon Hunters' Becomes First K-Pop Grammy Winner Ever\n\nBroadcast in three parts over Christmas season on BBC, PBS has opted to air the mini over two nights — one hour the first week and two hours the second. The opening segment focuses on young orphan Pip (an appropriately precocious Oscar Kennedy), who lives as a ward with his cantankerous adult sister (Claire Rushbrook) and her good-hearted blacksmith husband (Shaun Dooley).\n\nTwo chance encounters will forever change Pip’s life: first, with fugitive criminal Abel Magwitch (Ray Winstone), who demands Pip’s assistance in evading the law, only to be touched by the boy’s unexpected kindness; and second with reclusive spinster Miss Havisham (Gillian Anderson), a woman of great wealth who essentially rents Pip as a playmate for her aloof adopted daughter Estella (Izzy Meikle-Small).\n\nAlthough the story has been adapted for TV numerous times (most recently in 1999 with Ioan Gruffudd and Charlotte Rampling) and David Lean’s 1946 Oscar-nominated version remains well regarded, director Brian Kirk (“Game of Thrones”) and writer Sarah Phelps (“EastEnders“) forge their own path by bringing Dickens into the era of 21st-century period pieces. In the mode of recent cinematic renditions of “Jane Eyre” and “Wuthering Heights,” this is a grittier, earthier “Great Expectations,” brimming with dark, portentous atmosphere and handsomely lensed by Florian Hoffmeister (“The Deep Blue Sea”) with attention to natural light.\n\nTop-billed in their supporting roles, Winstone and Anderson vividly etch their own interpretations of iconic literary characters. Winstone’s gruff intensity kick-starts the mini with a jolt of energy, and he’s equally adept playing Magwitch’s more sensitive shades when the convict’s full scope is later revealed. But it’s Anderson who proves even more inventive in embodying Dickens’ infamous old maid, first of all simply by being not so old.\n\nAnderson’s Havisham is a prisoner of youth, a ghostly woman-child who haunts her slowly deteriorating mansion like a wraith forever in search of her wedding day. With her frail appearance, ethereal movements and breathy high-pitched voice, Anderson’s performance may be a love-it-or-hate-it affair for some, but it’s indelible all the same.\n\nStill, however pivotal Magwitch and Havisham are to the story, it’s still Pip’s tale, and the duty of carrying the majority of screentime falls on relative newcomer Douglas Booth. Playing Pip as a young man, the 19-year-old actor (“The Pillars of the Earth,” Boy George in a BBC telepic) pits his male-model looks against the not-always-attractive ambition that defines the character.\n\nPart of Dickens’ lasting appeal lies in the ambiguities of his characters and his understanding that protagonists don’t need to be likable to hold our interest. The same goes for Pip’s great love, the inscrutable Estella (played with perilous magnetism as a young woman by Vanessa Kirby of “The Hour”). “Great Expectations” wouldn’t pass muster in the studio system today, but its status as an established classic makes it a safe bet for Masterpiece.",
  "isFullReview": true,
  "dtliExcerpt": "Blair Underwood brings a welcome note of intelligence to Stanley Kowalski, but Nicole Ari Parker's Blanche DuBois never finds her tragic center in this well-intentioned but dramatically inert revival.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Blair Underwood brings a welcome note of intelligence to Stanley Kowalski, but Nicole Ari Parker's Blanche DuBois never finds her tragic center in this well-intentioned but dramatically inert revival.",
  "contentTier": "complete",
  "contentTierReason": "Short text (29 words)",
  "textWordCount": 597,
  "archivePath": "data/archives/reviews/a-streetcar-named-desire-2012/variety--marilyn-stasio_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:03:48.612Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 597,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-03T11:45:15.005Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a review of a BBC/PBS television adaptation of 'Great Expectations', not a Broadway theater production; openai: The review is about a TV adaptation of 'Great Expectations', not a Broadway production.; gemini: This review is for a BBC/PBS miniseries adaptation of Great Expectations, not a Broadway stage production.; kimi: This is a review of a BBC/PBS television miniseries adaptation of 'Great Expectations,' not a Broadway theater production. The text references broadcast schedules, screentime, cinematic qualities, and TV actors (Gillian Anderson, Ray Winstone), confirming it is about a screen adaptation rather than a stage show.",
  "promptVersion": "5.2.0"
}
