{
  "showId": "torch-song-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2018/11/01/torch-song-fiersteins-epic-shorter-but-fierce-and-funny-as-ever/",
  "publishDate": "2018-11-01T19:45:24",
  "fullText": "Decades before “marriage equality” was a household concept, Harvey Fierstein dared to imagine a world in which an unapologetically flamboyant drag queen could yearn, at least, for the kind of settled domestic life that, it was then widely assumed, homosexuals neither merited nor really wanted.\n\nEven more miraculously, Fierstein managed, in 1982, to parlay that vision into a Broadway epic, Torch Song Trilogy, that proved just as popular with matinee crowds as it did with the more predictably receptive audiences who had flocked to see it, first in separate installments and then as a three-act play, off-off and off-Broadway. The semi-autobiographical work established Fierstein, who won Tony Awards for both his writing and his leading performance, as a playwright, actor and inimitable personality; the only questions were whether it could endure as times changed and, given Fierstein’s indelible persona, if other actors could successfully put their own stamp on Arnold Beckoff, the nice, wisecracking Jewish boy who just happens to love mascara and men.\n\nBoth queries have, happily, already been answered in the affirmative, but that doesn’t make the new Broadway staging of Harvey Fierstein’s Torch Song, a cannily condensed version of Trilogy featuring just two acts, any less of a revelation. First presented off-Broadway last fall, the Second Stage production, directed with profound tenderness and rigorous wit by Moisés Kaufman, has as its leading man Michael Urie, one of the most comedically dexterous, effortlessly charming and frankly adorable stage performers to emerge in the past decade.\n\nBut Kaufman and Urie’s triumph is not simply in making Arnold funny and lovable, foibles and all. The first act of Torch Song certainly milks Urie’s strengths as a pure entertainer, segueing from Arnold’s delectably witty introductory monologue to the gay bar (based on the actual downtown establishment “The International Stud,” as the play’s first section is still named) where Arnold meets Ed, an apparently not-too-conflicted bisexual who, in Ward Horton’s deft performance, shows us how Arnold could find him endearing despite his cavalier airs.\n\n“Fugue in a Nursery,” also the title of Trilogy’s original second act, completes the first act here, playing out in David Zinn’s spare but fanciful set on an enormous bed, where Arnold and Ed are joined by Laurel, the woman Ed will marry (Roxanna Hope Radja, slowly and sharply revealing her character’s painful knowing) and Alan, the young man Arnold will come to love and lose, tragically and brutally, his dearness captured in a lovely, tender performance by Michael Hsu Rosen.\n\nBut the real emotional meat of this Torch Song lies in the second act, introduced (as the third part of the initial trilogy was) as “Widows and Children First.” The opening music is Fanny Brice singing “Cooking Breakfast for the One I Love,” and Zinn’s scenic design has become fuller and distinctly domestic. It’s 1980, and Ed is still in Arnold’s life—cooking breakfast at this moment, as it turns out—but our protagonist’s focus is now David, a gay teenager he had planned to adopt with Alan but is now raising alone.\n\nArnold, in bunny slippers, is anxiously awaiting the arrival of a fourth party, his mother—”the Sylvia Sydney of Brighton Beach,” as he refers to her, now widowed and living in Florida, where she can keep her son’s homosexuality at a safe distance for the most part. But as played by a fully fanged, movingly human and altogether magnificent Mercedes Ruehl, Mrs. Beckoff turns up loaded for bear, packing (along with her oranges and home-baked cookies) insensitive questions and hurtful comments that inevitably lead to a showdown, in which Urie makes shatteringly clear the depths of anger and sadness caused by his mother’s refusal, or inability, to truly engage or understand him.\n\nBut Torch Song is still, ultimately, a comedy, and a hopeful one, in which the potential for progress—that is, in the simplest terms, love—is not left in doubt. Ed shows plain signs of growth towards the end, and David emerges, in Jack DiFalco’s wonderfully impish portrayal, as a ray of light pointing solidly towards Arnold’s future. More than 35 years after its premiere, and stripped down substantially, Fierstein’s breakthrough work remains an uplifting study of a highly imperfect world, and thus as relevant and timely as ever.\n\nTorch Song opened November 1, 2018, at the Helen Hayes Theater and runs through January 6, 2019. Tickets and information: torchsongbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
