{
  "showId": "torch-song-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2018/11/01/torch-song-harvey-fiersteins-view-of-gay-life-not-always-gay/",
  "publishDate": "2018-11-01T19:50:16",
  "fullText": "Imagine it’s 1972, and Harvey Fierstein who’s been acting for some time at La Mama in the East Village, is about to appear in what is evidently the first play he’s written for La MaMa founder Ellen Stewart. It’s a one-act called International Stud. The lights go to black and when they come up, Fierstein is center stage bent over, facing front. Mildly bobbing up and down in that provocative position, he introduces himself as Arnold Beckoff and starts chatting amiably about his drag-queen life.\n\nWhoa, you think, this is new. Perhaps spectators familiar with what goes on in the back room at certain New York City gay bars will recognize this as a familiar sight, but they’ve got to be in a minority. All others will be getting a view of a certain culture they most likely haven’t previously enjoyed.\n\nThe humorous nonchalance with which Fierstein recounts his story as he’s being penetrated by an unseen companion is highly appealing. You’re way impressed by it. If you’re a Village Voice reviewer—which I was then—you praise it in print and never forget it.\n\nWaiting for what the fearless Fierstein does next, you make sure to attend Fugue in a Nursery and Widows and Children First in 1979. They’re the second and third one-acts that, in 1982, were collected as Fierstein’s so-honest-you-could-laugh-and-cry-at-the-same-time Torch Song Trilogy, which won that year’s Tony for best play.\n\nAnd now the folks at Second Stage have very successfully moved the 2017 revival from their 43rd Street off-Broadway theater to the Helen Hayes, their 44th Street Broadway house, as Torch Song. Don’t ask why the property is no longer tagged a trilogy, since all three plays are included but with only a pause between the first two and an intermission before the third. Perhaps the answer is that these days producers don’t particularly like giving audiences two intermissions.\n\nThat’s not the only change between now and then. International Stud—now identified in neon on David Zinn’s niftily changing set, as The International Stud 1971—is told from a dressing table before which this Arnold Beckoff (Michael Urie, working hard to enormous swishy avail) is prepping for a performance.\n\nArnold does get to the International Stud locale later, though Urie doesn’t strike quite so radical a pose as Fierstein did back in the La MaMa day. Now Arnold is getting down to business there only after he’s been shown meeting and falling for Ed (Ward Horton), a bisexual man who can’t make his mind up between homo- and heterosexuality. It’s his indecision that gives Arnold the reason to live a torch song, if not literally to sing one.\n\nEd is so uncertain that he marries Laurel (Roxanna Hope Radia), and the two of them have Arnold and new, very young boyfriend Alan (Michael Hsu Rosen) up for a weekend. This farrago makes up Fugue in a Nursery 1974 and is presented in a large bed. During the segment the four agitated participants keep popping up from down under the sheets as changing twosomes. What’s examined is the tentative nature of the Ed-Laurel union as well as Arnold’s sincere feelings for Alan while he still harbors an unfaded attraction to Ed. Also, there’s Ed’s sudden interest in Alan.\n\nAnd then it’s Widows and Children First 1980, with Zinn revealing a live-in-looking apartment with four doors that can be slammed loudly. Arnold, now on the verge of adopting precocious almost-15-year-old David (Jack DiFalco), is hosting Ed, who’s separated from Laurel. Arnold is also expecting mom, Mrs. Beckoff (Mercedes Ruehl, smart and stinging in matron coiffeur from wig designer Charles G. LaPointe).\n\nHere, Fierstein offers a well-made play about a mother-son clash with others sometimes looking on and sometimes pulled smack-dab in. Whereas emotions have run large in the two previous pieces, they overflow here like lava down a Pompeii mountainside. The attitudes Arnold has been somewhat able to suppress between his mother and him and between Ed and him get a rigorous workout before the entanglements come to their satisfyingly inconclusive conclusions.\n\nFierstein’s Torch Song has its flaws. The four-way, seated-upright-lying-down Fugue in a Nursery operates on a cute conceit, but its cleverness palls after an extended while. Ed’s uncertainty, pursued further in this one-act—and further still in Widows and Children First—does eventually reach the enough-already stage.\n\nThere’s also a drawback with Widows and Children First, which Fierstein has written as a comedy-drama probing family relationships. Since he has a great gift for comic lines, he’s peppered them throughout. Perhaps my memory of the 2017 revival is fooling me, but I don’t recall the action—under Moisés Kaufman’s otherwise tender-tough direction—allowing Urie, Ruehl, Horton and diFalco to indulge themselves in so much over-the-top laugh-cajoling emoting. The histrionics may be effective, but they go some distance towards cheapening the tone\n\n(Incidentally, if truth were told, DiFalco has a hard time passing for a 14-going-on-15 adolescent, but let’s not tell the truth. He’s too much on a par with Urie’s appealing Arnold, Ruehl’s tough Mrs. Beckoff and Horton’s properly vacillating Ed. The excellent Radia and Rosen only populate the middle play and do their strong bit enhancing it.)\n\nAt a time when a standing ovation is accorded just about anything in which the cast gets to the end of the play breathing, Torch Song absolutely earns this one. Sure, this is a script wherein a nervous gay man and his extended family flounder, flail and fight, but while he’s at it, Fierstein deals honestly and profoundly with universal themes. He communicates his understanding of recognizable human-condition aspects so easily and so sincerely that it’s the hardhearted audience member who won’t be endlessly grateful.\n\nTorch Song opened November 1, 2018, at the Helen Hayes and runs through January 6, 2019. Tickets and information:  torchsongbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
