{
  "showId": "torch-song-2018",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2018/legit/reviews/torch-song-review-broadway-michael-urie-1203014846/",
  "publishDate": "November 1, 2018",
  "fullText": "A trim new version of the 1980s trilogy gets a sweet, imperfect staging that can't erase memories of Harvey Fierstein in the original.\n\nFollowing an Off Broadway run at Second Stage Theater last year, “Harvey Fierstein‘s Torch Song” opened on Broadway Nov. 1 with the same cast and creative team. The following is Marilyn Stasio’s review, dated Oct. 20, 2017, of the Off Broadway production.\n\nIn \"Torch Song,\" an affectionate if ill-considered revival of Harvey Fierstein's \"Torch Song Trilogy,\" Michael Urie makes a brave but bizarre effort to channel the playwright's own groundbreaking star performance as a lovelorn drag queen in Manhattan's 1970s gay society. Everyone fell in love with Fierstein when he played himself (a.k.a. protagonist Arnold Beckoff) in the three plays of his beloved \"Torch Song Trilogy.\" But as imperfectly directed here by Moises Kaufman, Urie has made little attempt to make the role of Arnold his own. Arnold may be a professional performer, but he doesn't deserve to be played as a professional puppet.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Lisa Rinna Says 'Karma Is Coming' for Rob on 'The Traitors,' Addresses Controversial Colton Underwood Comment: 'He Wanted a Housewife, So I Gave Him a Housewife' \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Grammys Hit 14.4 Million Viewers, Down 6% From Last Year\n\nAt more than an hour less than its original four-hour run time, the trimmed-down show has kept its basic storyline but lost some of its grace notes. It seems strange, for instance, that both playwright and the director should retain certain references that are pure Harvey Fierstein, like the chubby jokes and the broad stage gestures that defined his quirky charm, but hardly apply to the trim new star. Even more grating is Urie's strained attempt to imitate the writer's distinctive voice, which sounds something like a frog being scrambled in an eggbeater.\n\nArnold's story is as sweet as ever. A success as a drag performer (handsomely costumed by Clint Ramos) known as Virginia Ham, but shy and awkward at matters of the heart, Arnold is desperate for true love and all its trappings — marriage, kids, hot sex — but doesn't know how to find it. Lucky for him, he meets a sweetheart of a guy named Ed (a wonderfully honest performance from Ward Horton) at a gay bar notorious for its luridly lighted (by David Lander) backroom. Urie has fun in these backroom bar scenes, especially when Arnold is taken in hand by person or persons unknown.\n\nYou have to love Arnold. Ed does, but he happens to have a nice, steady girlfriend named Laurel (nice, steady Roxana Hope Radja), which complicates things. But this is 1979, after all, and Arnold wants to show how up-to-date and au courant he can be. So, in a funny scene that unfolds on a gigantic bed designed with tongue in cheek by David Zinn, Arnold and his very young new boyfriend, Alan (Michael Rosen), are staying with Laurel and Ed for the weekend in their country place.\n\nIt's frankly unbelievable that a straight woman would be so gracious about sharing her man with his sometime male lover. But Laurel is the playwright's fantasy, a good sport and profoundly understanding. \"There was no fight,\" she says about her own relationship with Arnold. \"I just pulled back enough to let Ed feel his freedom. No commitments. No pressure.\"\n\nThis kind of relationship just isn't in the cards for Arnold, who wants those very commitments and stubbornly persists in looking for real love, lasting love, faithful love — with great sex. As the play progresses, he loses a true love but acquires an adopted son, David (Jack DiFalco), to show off to his overbearing mother, (\"the Sylvia Sidney of Brighton Beach\") played by a strangely stiff Mercedes Ruehl. And eventually, yes! He finds true love.\n\nDoes this history piece hold up? Yes, in the sense that the show is kind to its characters and true to its dated sensibilities. No, in the sense that the characters are unbelievably sweet and its sensibilities are dated. But the playwright is nothing if not generous to Arnold, who is a real mensch after all. If you want to take him to your heart, you really have to imagine someone like... well, Harvey Fierstein, in the lead role.",
  "isFullReview": true,
  "dtliExcerpt": "Michael Urie gives a powerhouse performance as Arnold Beckoff, the drag queen with a heart as big as his hair, in this revival of Harvey Fierstein's groundbreaking play.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Michael Urie gives a powerhouse performance as Arnold Beckoff, the drag queen with a heart as big as his hair, in this revival of Harvey Fierstein's groundbreaking play.",
  "contentTier": "complete",
  "contentTierReason": "Short text (28 words)",
  "textQuality": "full",
  "previousUrl": "https://variety.com/2018/legit/reviews/torch-song-review-michael-urie-mercedes-ruehl-1203015016/",
  "urlDiscoveredAt": "2026-02-04T02:03:32.219Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 705,
  "archivePath": "data/archives/reviews/torch-song-2018/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:03:32.225Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 705,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-04T06:31:16.954Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is of the Off Broadway production from 2017, not the current Broadway run.; kimi: This text explicitly identifies itself as a review of the 2017 Off-Broadway production at Second Stage Theater ('The following is Marilyn Stasio's review, dated Oct. 20, 2017, of the Off Broadway production'), not the current Broadway run.",
  "promptVersion": "5.2.0"
}
