{
  "showId": "this-is-our-youth-2014",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2014/09/theater-review-this-is-our-youth.html",
  "publishDate": "September 12, 2014",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nTavi Gevinson and Michael Cera in This Is Our Youth, at the Cort. Photo by Brigitte Lacombe\n Photo: Brigitte Lacombe\n \n \n \n Michael Cera, he of the turtle face and pipe-cleaner arms, has cornered the market on screen nerdism to the point you would think there was nothing left for him to mine from the indignations of the socially awkward. Turns out, given material deep enough, there is. He’s found that material in Kenneth Lonergan’s This Is Our Youth, and under Anna D. Shapiro’s superlative direction uses it to fuel an unforgettable performance, the more so for marking his New York stage debut. As the overliteral, quasi-Asperger’s lost-soul 19-year-old Warren Straub — Cera is 26 but passes just fine — he digs so far into the character’s drugged-out disappointment you see only the shadows of it rippling the surface. Surprisingly that’s enough; he’s a triumph.\n\nThe rest of the production — which also stars Kieran Culkin and Tavi Gevinson — does not quite live up to that level, but then the play’s level is a hard one to calibrate. For that reason, bringing This Is Our Youth to Broadway was not an obvious move; despite its apparently sociological title and its drug-dealing milieu, it’s actually very intimate and quiet. With just the three characters and one grotty set, it’s at best a Petite Guignol, with all the blood offstage. Indeed, within the (slightly bloated) two-and-a-half-hour running time you can still sense the late-’90s Off Broadway modesty of its scope and, behind that, its origins as a 1993 one-act called Betrayed by Everyone. It’s about little people learning to accept that little is all they’re likely to be. And even though the characters’ betrayers, per the original title, include figures as consequential as their loathed president (Reagan — the play is set in 1982), the scale of their awakening is strictly local. Their monsters are needy girlfriends and materialistic fathers. Were it not for a terrific scenic design by Todd Rosenthal, in which a small studio apartment is dominated by the photorealistic back walls of a block of Upper West Side white-bricks, the story might have been swamped, even at the smallish Cort.\n\nInstead, it rises to the space. The writing is astonishingly fine. Lonergan was part of the generation he was describing; he, too, was 19 in 1982; you feel he has directly observed and transcribed these characters and their milieu of wasted privilege. There’s something uncannily accurate about the way Warren hero-worships the charismatic but possibly sociopathic petty drug dealer Dennis Ziegler (Culkin) and crushes on Jessica Goldman (Gevinson), a nervous, defensive girl whose defenses exacerbate rather than ameliorate her nerves. And though not much happens (hardly a surprise in a play about anomie) the result is that the details of the interactions loom proportionately larger. A lot of stage time is taken up watching Dennis destabilize Warren with his fast-and-loose dealings as well as his passive-aggressive you’re-a-moron-pal poses, but somehow you come to care quite deeply whether Warren will ever rescue himself from this cycle of disregard. Likewise, Warren’s painfully sincere and hilariously inept attempts to court Jessica make the fate of their misbegotten romance seem earth-shaking.\n\nIt’s earth-shaking to them, of course, as perhaps it would be to any teenager. Gevinson, who actually is 18, may not have stage chops but she nails that quality: She makes the stakes for Jessica (whatever they are — it’s hard to say) desperately high and never lets up. A little more variety in her performance, especially vocally, would not have been amiss; it takes a while to understand what Warren sees in her, aside from her wide-eyed prettiness. (She’s dressed in perfect period fashion by Ann Roth.) Culkin, too, has yet to inhabit the full size of his character: the size required to encompass both his bonhomie and what Lonergan describes as his “dark cult god of high school” magnetism. Also, at 31, Culkin is pushing the part’s sell-by date; with his red-lidded seediness, he looks like the mill has already spit him out. Still, both actors succeed, not only because they play all their scenes with Cera but because Shapiro’s direction is so sure-footed. Every beat and emotional crosscurrent is tangible; the jokes land and the sorrows shudder; and the pacing, except toward the end, when Lonergan works too hard to tie up loose ends and make parting announcements, is as fleet as that of the best comedies. Which is what you want in a play that, for all its belly laughs, is basically a punch in the gut.\n\nIn any case, what finally makes This Is Our Youth worth staging on Broadway, with all the production values a first-class mounting can provide, is not any moral or message it might offer. It’s the theatricality of its mechanisms that matters. We do not need a lesson about the bankruptcy of Reaganism or the perpetual cycle by which young people come to understand how much of the world is built on lies. It’s enough to see those ideas enacted, as we do, for instance, when Dennis excuses his constant bullying by telling Warren: “We all talk that way, it doesn’t mean anything.” We know that’s untrue in life as on the stage; we’ve seen how much it means. We’ve also seen that Warren never bullies Dennis. He may miss social cues, he may fail to keep up with his hero’s hyper-speed montage of idle thoughts and emotions, but he’s strictly honest within his limitations:\n\nWARREN: What are you crying about?DENNIS: What do you think I’m crying about?WARREN: I assume you feel bad about something you think has happened to you.\n\nIt’s a laugh line but not glib. What This Is Our Youth dramatizes so tenderly is the way, for some people, a world of disaffection may not quite render affection impossible.\n\nThis Is Our Youth is at the Cort Theatre through January 4.\n\nShow \n \n \n Leave a Comment\n \n\n Theater Review: This Is Our Youth\n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "dtliExcerpt": "The three young stars — Michael Cera, Kieran Culkin, and Tavi Gevinson — bring different strengths to their roles, but together they create a convincing portrait of privileged kids adrift in their own lives.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Michael Cera, he of the turtle face and pipe-cleaner arms, has cornered the market on screen nerdism to the point you would think there was nothing left for him to mine from the indignations of the socially awkward. Turns out, given material deep enough, there is. He's found that material in Kenneth Lonergan's This Is Our Youth, and under Anna D. Shapiro's superlative direction uses it to fuel an unforgettable performance, the more so for marking his New York stage debut. As the overliteral, quasi-Asperger's lost-soul 19-year-old Warren Straub...he digs so far into the character's drugged-out disappointment you see only the shadows of it rippling the surface. Surprisingly that's enough; he's a triumph.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The three young stars — Michael Cera, Kieran Culkin, and Tavi Gevinson — bring different strengths to their roles, but together they create a convincing portrait of privileged kids adrift in their own lives.",
  "contentTier": "complete",
  "contentTierReason": "Short text (34 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://www.vulture.com/2014/09/theater-review-this-is-our-youth.html",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews"
  ],
  "rejectedAt": "2026-02-03T20:24:34.498Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a brief excerpt or fragment describing cast performances, but lacks any overall evaluation, recommendation, or critical verdict about the show.; openai: The text is a brief mention of the cast's performance without any evaluative content or overall assessment of the show.",
  "promptVersion": "5.2.0",
  "textWordCount": 1015,
  "archivePath": "data/archives/reviews/this-is-our-youth-2014/vulture--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:05:14.011Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250402073450",
  "archiveOrgUrl": "http://web.archive.org/web/20250402073450/https://www.vulture.com/2014/09/theater-review-this-is-our-youth.html",
  "wordCount": 1015,
  "tierReason": "Full review text",
  "bwwScore": 9
}
