{
  "showId": "fish-in-the-dark-2015",
  "outletId": "new-jersey-newsroom",
  "outlet": "New Jersey Newsroom",
  "criticName": "Unknown",
  "url": "http://www.newjerseynewsroom.com/movies/fish-in-the-dark-broadway-review-larry-david-swims-through-a-brackish-new-comedy",
  "playbillVerdictUrl": "http://www.newjerseynewsroom.com/movies/fish-in-the-dark-broadway-review-larry-david-swims-through-a-brackish-new-comedy",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "A dandy time on Broadway for people who don’t like seeing theater, “Fish in the Dark” is a new, um, play written by and starring Larry David.\n\nPremiering on Thursday at the Cort Theater, the undeniably amusing “Fish in the Dark” is more-and-less a two-hour TV sitcom done on stage in which David essentially reprises the same grumpy middle-aged guy that he played in his popular “Curb Your Enthusiasm” HBO series.\n\nPresumably there is nothing wrong with that, since many people enjoy seeing what they already know, and David is in typically snarky good form.\n\nA tall and lean figure, David assumes the role of Norman, a Los Angeles manufacturer of urinals. The shamelessly self-centered Norman and his brother Arthur (Ben Shenkman), a swinging attorney -- plus a swarm of squabbling Jewish relatives -- witness the hospital demise of their aged father, whose dying wish is that his widow Gloria (Jayne Houdyshell) should not live alone but reside in future with them.\n\nNeither brother cares to host the cranky Gloria but somehow she moves in with Norman, whose wife (Rita Wilson) promptly moves out. Further complications arise when the family’s longtime maid (Rosie Perez) reveals that she has a teenaged son (Jake Cannavale) by the dead patriarch and demands that they both be supported.\n\nAnd so forth, yada yada, as the brothers bicker and the other relations carp, kvetch and quarrel. The disgruntled humor tends to be scattershot but thanks in part to a proficient company, the laughs arise frequently. As a play with plausible characters and story, “Fish in the Dark” is merely tinned TV fare but as a sketchy showcase for David’s brand of brackish comedy, it’s pretty tasty.\n\nDirector Anna D. Shapiro, who usually serves more substantial content, has assembled a topnotch 17-actor company around David and positions them front and center to deliver the goods. Houdyshell adeptly depicts the peevish Gloria as unlovable but not unlikable, and other especially droll turns are registered by Marylouise Burke and Lewis J. Stadlen. Designer Ann Roth dresses everyone insightfully.\n\nShrugging, grimacing and slow-burning through the show with easy confidence, David portrays Norman with his trademark anti-charm. As long as David cares to play in it, “Fish in the Dark” undoubtedly will satisfy customers. The show is not going to win any critics’ awards, but it will make plenty of money.\n\n“Fish in the Dark” continues through June 7 at the Cort Theater, 138 W. 48th Street, New York. Call (212) 239-6200 or visit www.fishinthedark.com.",
  "isFullReview": true,
  "textWordCount": 415,
  "archivePath": "data/archives/reviews/fish-in-the-dark-2015/new-jersey-newsroom--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:04:38.606Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Insufficient text: 0 chars"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 0 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20150308200110",
  "archiveOrgUrl": "http://web.archive.org/web/20150308200110/http://www.newjerseynewsroom.com:80/movies/fish-in-the-dark-broadway-review-larry-david-swims-through-a-brackish-new-comedy",
  "contentTier": "complete",
  "wordCount": 415,
  "tierReason": "Full review text"
}