{
  "showId": "la-cage-aux-folles-2010",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Miriam Gillinson",
  "url": "https://www.theguardian.com/stage/2023/aug/10/la-cage-aux-folles-review-regents-park-open-air-theatre-london",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2023/aug/10/la-cage-aux-folles-review-regents-park-open-air-theatre-london",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The choreography is slick but – even better – funny … La Cage aux Folles. Photograph: Mark SeniorView image in fullscreenThe choreography is slick but – even better – funny … La Cage aux Folles. Photograph: Mark Senior This article is more than 2 years oldReviewLa Cage aux Folles review – dazzling revival is hilarious and heartfeltThis article is more than 2 years oldRegent’s Park Open Air theatre, LondonThis adaptation of the classic musical is a joy, from the faded nightclub set to Carl Mullaney’s showstopping I Am What I Am\n\nTim Sheader’s revival of the 1983 musical about a gay nightclub owner and his drag queen partner is a total joy. Ryan Dawson Laight’s costumes dazzle; one skirt has its own set of wheels, another its own set of legs. Stephen Mear’s choreography is slick but – even better – very funny. Harvey Fierstein’s witty book still crackles 40 years on from the Broadway premiere and Jerry Herman’s heartfelt score (so pure and romantic) seduces us all.\n\nYet what is most striking about this memorable production, led by an all-queer creative team, is how authentic and truthful it feels. This is a show that has taken Herman’s astute lyric “what we are is an illusion” utterly to heart. La Cage aux Folles – a popular 70s St Tropez nightclub that has seen better days – is a little raggedy around the edges. Gold fades to green. Shrubs creep through the cracked windows. The singers pant and groan at the end of their big numbers and, when they’re done, watch the action from the wings. They’re bored, tired, perhaps a little lonely.\n\nView image in fullscreenExtraordinary vulnerability … Carl Mullaney as Albin in La Cage aux Folles. Photograph: Cages Aux Folles, Photo: Mark SeniorPlaying the central role of Albin, the nightclub’s headline drag act, is Carl Mullaney, an actor with cabaret in his blood. His patter is excellent, his singing better yet. Above all, there’s an extraordinary vulnerability in Mullaney’s performance. After he is shunned by his son – who is desperate to make a good impression on his ultra conservative in-laws – Albin takes to the stage to sing I Am What I Am, that open heart of a song. He is a wounded animal sheathed in gold, howling into the night in pain and sorrow.\n\nThere are a few dips – particularly in the second half, when the life and colour is drained from the show as Albin and nightclub owner, Georges (Billy Carter), try to “straighten” up their act for their son. But the relationship between Georges and Albin lights up the show. Their partnership is laced through with tender moments: a loving glance here; a stroked shoulder there. For all the madcap costumes, flashes of leather, trilling singers and eccentric cabaret acts, this is a simple and moving love story that gives two men their chance to stride off into the sunset.\n\nAt Regent’s Park Open Air theatre, London, until 16 September\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 514,
  "archivePath": "data/archives/reviews/la-cage-aux-folles-2010/guardian--miriam-gillinson_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:33:16.236Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 514,
  "tierReason": "Full review text",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2023 outside valid range 2007–2012 for show opening 2010"
}