{
  "showId": "spring-awakening-2015",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/deaf-wests-spring-awakening-theater-799300/",
  "publishDate": "September 28, 2015",
  "fullText": "Spring Awakening Production Still - H 2015\n\nWhen singer-songwriter Duncan Sheik shot to stardom in 1996, it was with \"Barely Breathing,\" a bittersweet ballad of romantic confusion. At the time it was associated with the teen drama Dawson's Creek, and seemed to perfectly capture the hyperbolic emotions associated with adolescent love. It's the kind of song that made Sheik a perfect fit for Spring Awakening, the 2006 musical based on Frank Wedekind's scandalous 1891 play about teen rebelliousness and hormones run amok in repressive Weimar Germany.\n\nDeaf West Theatre's unique revival had a successful premiere last fall and is back in a return engagement at the Wallis Annenberg Center for the Performing Arts in Beverly Hills. The production features exceptional performances, inspired staging and brilliant use of sign language to overcome the Tony-winning musical's inherent flaws.\n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Business\n \n \n \n \n\n \n \n \n \n Broadway Box Office: 'Hamilton' Celebrates 10 Years, 'Mamma Mia' Keeps Climbing \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Business\n \n \n \n \n\n \n \n \n \n Broadway Box Office: Crowds Say \"Gimme, Gimme\" to First Preview of 'Mamma Mia'\n\nWhen we first meet Wendla (Sandra Mae Frank voiced by Katie Boeck), her mother scolds her for wearing a child's dress, which she has clearly outgrown. The young woman's questions about her body and matters of the heart go unanswered by her prudish guardian, an omission that comes back to haunt her in the second act. The hearing-impaired Frank mimes a stirring performance, married seamlessly with Boeck's voice as she sings \"Momma Who Bore Me,\" the play's opening number, which firmly establishes the show's tone and conflict.\n\nAt school, bright young student Melchior (Austin McKenzie) has modern ideas about sex, civilization and restrictive social mores. But he quickly learns that questioning authority is frowned upon in the classroom. His best friend, Moritz (Daniel N. Durant voiced by Alex Boniello), is under considerable pressure from his father and overbearing school administrators to ace his exam, despite erotic daydreams that steal his attention. Although he passes the test, his professors fail him anyway, leading to tragic consequences.\n\nRead more Duncan Sheik on Deaf West’s ‘Spring Awakening’ and the Movie Adaptation\n\nStirred by Melchior, revolution is in the air, leading another student, Hanschen (Andy Mientus), to act on his homosexual impulses. Meanwhile, Wendla, intrigued by a friend's confession that her father beats her regularly, asks Melchior to spank her with a switch. It's meant to disturb and titillate, but because the scene is motivated merely by curiosity, it plays as kink for kink's sake. When Wendla and Melchior finally consummate their relationship, they do so armed with little knowledge of basic biology, and even less protection, yielding predictable results.\n\nSoft rock is Sheik's specialty, notably in the anthemic strains of \"Touch Me\" and \"The Word of Your Body,\" where cello and viola are bowed with befitting bathos. But when it comes to hard rock, tunes like \"The Bitch of Living\" and \"Don't Do Sadness\" sound more like the Jonas Brothers than Led Zeppelin.\n\nCombining deaf and hearing-able actors on the same stage could potentially be distracting, but Deaf West’s best productions long ago put those concerns to rest. In Spring Awakening, portions of the dialogue are projected onto designer Dane Laffrey's battleship-gray set, an expansive wall topped with a catwalk and a recess containing the string players, complemented by bass, drum and guitars on the stage.\n\nRead more ‘Satchmo at the Waldorf’: Theater Review\n\nWorking with director Michael Arden (who played Tom Sawyer in Deaf West’s Tony-winning Big River), choreographer Spencer Liff has replaced Bill T. Jones' Broadway dance steps with moves that incorporate sign language, weaving it into the natural flow of the production. At times this is almost unnoticeable. But at its best, it enhances the drama with a poetically expressive dimension one would normally associate with avant-garde director Robert Wilson.\n\nArden admirably keeps the show's many disparate elements in sync, eliciting moving portrayals from his principal actors. And while Steven Sater's book could use more plotting and better character development, Sheik's mellifluous melodies carry the material. Cynics may say the music is sappy, and it is. But because sappy is the de facto language of tragic teen romance, Spring Awakening can proudly wear its heart on its sleeve.\n\nCast: Joey Antonio, Hillary Baack, Miles Barbee, Sean Barna, Katie Boeck, Alex Boniello, Joshua Castille, Julian Comeau, Daniel N. Durant, Treshelle Edmond, Sandra Mae Frank, Kathryn Gallagher, Gabrielle Garza, Sean Grandillo, Karla Gutierrez, Amelia Hensley, Lauren M. Luiz, Austin McKenzie, Daniel Marmion, Andy Mientus, Krysta Rodriguez, Howie Seago, Daniel David Stewart, Ali Stroker, Natacha Roi, Alexandra Winter, Alex Wyse\n Director: Michael Arden\n Book and lyrics: Steven Sater, based on the play by Frank Wedekind\n Music: Duncan Sheik\n Set and costume designer: Dane Laffrey\n\nHair and makeup designer: Carol F. Doran\n\nSound designers: Brian Hsieh, John Nobori\n Choreographer: Spencer Liff\n Presented by: Wallis Annenberg Center for the Performing Arts, Deaf West Theatre, The Forest of Arden, Cody Lassen, Ken Davenport, John C. Hall",
  "isFullReview": true,
  "dtliExcerpt": "The staging is often visually striking, with the cast moving fluidly between the hearing and deaf worlds, signing and singing simultaneously in scenes that acquire touching layers of meaning.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "It's an admirable undertaking and I wish I could get behind it. But arriving on Broadway so soon after Michael Mayer's viscerally impactful premiere production won the 2007 Tony Award for best musical, this underpowered, unexceptionally sung post-Glee version seems more of a special presentation tha...",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The staging is often visually striking, with the cast moving fluidly between the hearing and deaf worlds, signing and singing simultaneously in scenes that acquire touching layers of meaning.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "bww-roundup",
    "playbill-verdict"
  ],
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/deaf-wests-spring-awakening-theater-827479",
  "textWordCount": 814,
  "archivePath": "data/archives/reviews/spring-awakening-2015/hollywood-reporter--david-rooney_2026-02-07.html",
  "textFetchedAt": "2026-02-07T09:33:24.977Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "wrongFullText": "\"A red lip is like the little black dress of makeup,\" says Chanel celebrity makeup artist Rachel Goodwin, who was responsible for January Jones' glam look at the Emmys on Sunday night. And considering how well the LBD did on the red carpet, it's not surprising red lips were equally well represented. Zoe Kazan was the picture of red-lipped perfection, and Padma Lakshmi (wearing Temptu Color True Lipstick in Imperial Red, $24) proved there's no such thing as colors clashing with her crimson and chartreuse combo.\n\nSee more Emmys 2015: The Top 10 Best-Dressed Men\n\nChristina Hendricks, Elisabeth Moss, and Morena Baccarin were just a handful of the other stars who rocked the timeless look. \"It's always going to exist, I think on the red carpet especially. It never fails to make us stop, pause and gasp for how perfect it is,\" Goodwin tells Pret-a-Reporter.\n\nRead more Emmys Beauty: Subtle Lips Make A Strong Showing\n\nTatiana Maslany's crimson pout was the perfect accompaniment to her pristine white tuxedo, while Taylor Schilling's Charlotte Tilbury Matte Revolution in 1975 Red ($32) looked fantastic with her sunny yellow frock. Amanda Peet was another who wore red lips well. Says Goodwin: \"Red screams 'This is an important moment, look at me!' It does that like no other color does. It says, 'I feel beautiful and bold and empowered.’ \"",
  "_showNotMentionedDiscoveryAttempted": true,
  "archiveOrgTimestamp": "20250815192201",
  "archiveOrgUrl": "http://web.archive.org/web/20250815192201/https://www.hollywoodreporter.com/news/general-news/deaf-wests-spring-awakening-theater-799300/",
  "wordCount": 814,
  "tierReason": "Full review text",
  "previousUrl": "https://www.hollywoodreporter.com/news/general-news/spring-awakening-theater-review-825584/",
  "urlDiscoveredAt": "2026-02-07T09:33:24.984Z",
  "urlDiscoveryMethod": "show-not-mentioned-recovery",
  "wrongProduction": true,
  "rejectedAt": "2026-02-07T11:26:50.279Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production at the Wallis Annenberg Center for the Performing Arts in Beverly Hills, not the current Broadway run.; kimi: The review explicitly states it covers the production at the Wallis Annenberg Center for the Performing Arts in Beverly Hills ('back in a return engagement at the Wallis Annenberg Center'), not the Broadway transfer. This is the pre-Broadway/Los Angeles production, not the current Broadway run.",
  "promptVersion": "5.2.0"
}
