{
  "showId": "mrs-doubtfire-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2021/12/05/mrs-doubtfire-musical-comedy-misfire-from-something-rotten-team/",
  "publishDate": "2021-12-05T21:50:33",
  "fullText": "Mrs. Doubtfire, the 1993 Robin Williams box-office nugget with screenplay by Randi Mayem Singer and Leslie Dixon has been adapted (that’s usually the appropriate word) as a musical comedy by bookwriters Karey Kirkpatrick and John O’Farrell, with music and lyrics by Karey Kirkpatrick and Wayne Kirkpatrick.\n\nThe tuner (using the term loosely) has two elements going for it: 1) its realistic view of one bittersweet consequence that families may face when divorce intervenes; and 2) the always remarkable Rob McClure pulling out multitudinous stops as the title character.\n\nOtherwise: Good Grief! Here’s a musical comedy that ruthlessly kicks the form back to the 1950s, way back to the era’s second- and third-rate 1950s musical comedies. And get this: The time-travel trip (in two senses of the word) is happening at, of all places, the Stephen Sondheim Theatre.\n\nThis Mrs. Doubtfire travesty does follow relatively closely the screenplay wherein Daniel Hillard, a doting but tiresomely hyperkinetic father of precocious children Lydia (Analise Scarpaci), Christopher (Jake Ryan Flynn), and Natalie (Avery Sell) finally tries the patience of wife Miranda (Jenn Gambatese) so severely that she files for divorce.\n\nAnd gets it, plus full custody of the children, which means that to see them as regularly as he’d like, Daniel contrives to become their elderly Scottish nanny, Effie Doubtfire. As this, uh, redoubtable figure he must jump through figurative hoops to keep his true identity hidden.\n\nAlthough elder daughter Lydia initially resists Mrs. Doubtfire’s often stern charms, she eventually succumbs. So does Miranda, claiming she’s never been so happy in her adult life. Her happiness is further bolstered by tall, muscular Stuart Dunmire (Mark Evans), whom she meets as sole investor in the successful MBody sportswear company she forms as an enterprising single mother. (Partial spoiler: Dunmire is involved in the major change O’Farrell, Karey and Wayne Kirkpatrick make to the screenplay.)\n\nSo far, so good, or would be so far, so good if the adaptors—also involved in the 2015 Something Rotten!—hadn’t expressly signed on to turn the movie into a musical comedy. (Readers are asked to remember that the word “comedy” has been dropped from the category some time back, in line with the “serious musicals” that had become sanctified under Stephen Sondheim, Harold Prince, Fred Ebb, John Kander, William Finn, James Lapine et al.)\n\nBookwriters O’Farrell and Karey Kirkpatrick have lifted some of the lame Singer-Dixon jokes for repetition here and added their own, their additions as feeble as what they’ve kept. But it’s not the jokes that are the sizable problem, or the largely unpleasant character Daniel becomes during the lengthy first-act introduction to his marriage-challenging self.\n\nSo, forget the jokes for the moment. What propels any sentient musical comedy or musical comedy lover into the depths of despair as the show evidently must go on is the Karey Kirkpatrick and Wayne Kirkpatrick score. And, it follows, how director Jerry Zaks, choreographer Lorin Latarro, and music supervisor Ethan Popp must do their damnedest to make the whole expensive shebang connect.\n\nClearly, the Kirkpatrick brothers understand the musical sine qua non: a musical requires songs. What they apparently haven’t yet twigged to is that the songs should be good. (In all fairness, they’re not alone among many songwriters turning out contemporary musicals.)\n\nNo need to go into a slew of the Kirkpatrick shortcomings. Thus, only one example of an annoying off-rhymed lyric: Tissue/pissed you [off]. (The song, “What the Hell,” is sung by the precocious children). No examples will be offered here of the forgettable songs mostly handed to Daniel/Mrs. Doubtfire, though occasionally assigned to others like Miranda (the valiant Gambatese) and children’s television show host Mr. Jolly (the always affable Peter Bartlett). Almost without exception they lie as dormant as throw rugs.\n\nThe sole exception is sung at the show’s end and is called “As Long as There Is Love.” It’s meant to be the Mrs. Doubtfire jump-out ditty, as if today’s musicals contain such things. Nonetheless, It might catch on or not, according to whether listeners take to it for its sounding like every song of its type even composed, or resist it for the same reason. A few lines of the lyric go: “Just remember what you’ve got/’Cause you’ve really got a lot/If you  start, with a heart/In the right spot.” Nuff said?\n\nGiven this to deal with, the collaborators mentioned above (as well as set designer David Korins, costume designer Catherine Zuber, lighting designer Philip S. Rosenberg, sound designer Brian Ronan, hair designer David Brian Brown, and conductor Zachary Dietz) do their considerable utmost to bring joy and pizzazz to the proceedings.\n\nNot easy to do when every time there’s the least provocation for an eye-popping-ear-popping number, it’s exploited to the bursting point. There’s a routine in which Mrs. Doubtfire is taught by a squad of chefs to make a meal from scratch. There’s gym number featuring stout-hearted men who lift hand weights. There’s a fashion show during which Miranda’s all-red MBody line is paraded. (Audience members who recall Cecil Beaton’s all-red Coco Chanel-like runway show in Coco might appreciate the reminder.)\n\nNone of the routines seem anything more than greatly inflated. McClure works himself to the finger-elbow-knee-toe-bone from the instant he enters (as a pirate). He’s his own phenomenon. Maybe his greatest achievements are the multiple times he changes in front of the ticket buyers from Daniel to Mrs. Doubtfire and back again and then back again. Still, he also shines via his voice mimicry (a few Donald J. Trump seconds), his spirited terping, and his you-name-it as a reliably inspired performer.\n\nAll of McClure’s versatility operates to some avail but not enough. (Perhaps enough to nail down the 2021-22 Tony nomination for leading actor in a musical.) The producers are lucky to have him but hardly lucky enough to make this Mrs. Doubtfire not come across more like Mrs. Doubt[mis]fire.\n\nMrs. Doubtfire opened December 5, 2021, at the Stephen Sondheim Theatre, and is on hiatus until March 15. Tickets and information: mrsdoubtfirebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars"
}
