{
  "showId": "mrs-doubtfire-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2021/12/05/mrs-doubtfire-dad-turns-nanny-comes-to-broadway-manic-charm-intact/",
  "publishDate": "2021-12-05T21:51:20",
  "fullText": "Rob McClure faces a daunting task.\n\nEight times a week at the Stephen Sondheim Theatre, he must put on the fat suit and the wig, the granny glasses and the makeup, and play the title role in Mrs. Doubtfire. It’s not simply that he’s carrying the fate of a multi-million-dollar, years-in-the-making Big Broadway Musical on his prosthetically enhanced shoulders—he is, but that’s the job—it’s that he must also fill a set of falsies memorably incarnated on film by Robin Williams, who was both hilarious and inimitable, and who died by suicide in 2014. Somehow, McClure must recreate that beloved character, deliver a performance that recalls the original (no point in leveraging existing IP, after all, if not to take advantage of that build-in goodwill), and yet make the character his own, all while standing under a towering comedic shadow that’s also tinged with sadness.\n\nThe good news, poppets, is that he actually pulls it off.\n\nThe stage musical take on Mrs. Doubtfire, which opens tonight at the Sondheim after a less-than-blockbuster tryout in Seattle fully two years ago and a preview period interrupted for 18-plus months by the pandemic, was written by the creators of Something Rotten!, one of the silliest, funniest Broadway musicals in recent memory. It is directed by Jerry Zaks, the four-time Tony-winning master of the old-fashioned musical comedy. (His last major outing was the Bette Midler Hello, Dolly; his next on deck is the Hugh Jackman-Sutton Foster Music Man.) It’s got all that good will. And it’s got McClure, who ably pulls off the requisite clowning and the requisite quick shifts to sincerity, and sings and dances his way through innumerable, equally requisite, quick changes of costume. He makes the whole thing work.\n\nThe story centers, as you’ll recall, on the plight of Daniel Hillard (McClure), a won’t-grow-up, happy-go-lucky actor who is the endearingly goofball father of three sweet kids. When Miranda, his wife and a demanding perfectionist (Jenn Gambatese, in a somewhat thankless role), grows tired of his shenanigans and files for divorce, Daniel is denied joint custody because he has neither a job nor a home. Desperate to spend time with the kids, Daniel masquerades as an aged Scottish nanny and gets the job as keeper of his now-ex-wife’s house. Hilarity ensues, as does personal growth, naturally.\n\nThe specifics of the story are largely but not entirely the same as in the 1993 movie. Karey Kirkpatrick and John O’Farrell, who wrote the book, and Kirkpatrick and his brother, Wayne, who wrote the songs, update things to account for changing tolerance for jokes about men wearing dresses and gay people being outrageous makeup artists. The script doesn’t rise to the dizzying goofiness of Something Rotten!, but it’s still very funny. The songs aren’t especially memorable, but they’re perfectly enjoyable. And if not all of the plot and character updates quite work, what has ended up on stage is still a very entertaining, very successful, very good time.\n\nOnce it gets going, that is. The necessary introductory exposition is a little clunky, and at first you can’t quite shake the manic-slash-depressive ghost of Williams hovering in the background. But by the third number, “Make Me a Woman”—in which Daniel’s brother, Frank (Brad Oscar, in a role perfect for him), and Frank’s partner, Andre (J. Harrison Ghee, equally amusing), make over Daniel in a rousing, let’s-put-on-a-show fantasia that includes an ensemble of imposters styled as Cher, Donna Summer, Eleanor Roosevelt, Julia Child, Margaret Thatcher, and several other icons—it all clicks into place. Mrs. Doubtfire is best in these newly created moments; it’s weakest when it’s too dutifully mirroring the movie. (The “run-by fruiting” line, probably the best known from the film, shows up here, as it must. But this time it’s much more laboriously set up, and it lands less well in a world where drive-by shootings no longer make headlines.)\n\nThe sets by David Korins pay pastel-hued homage to picture-postcard images of San Francisco. (The Hillards are still in that Pacific Heights Victorian, a real estate triumph that has become only more implausible in the intervening 18 years, during which time the internet happened and the Bay Area was transformed.) Catherine Zuber has fun with the costumes. The actors playing the three kids (Analise Scarpaci, Jake Ryan Flynn, and Avery Sell) bring real charm to their roles. And Peter Bartlett manages to stand out as the kooky comic relief of this comedy, as the past-his-prime kids’-show host Daniel eventually replaces.\n\nMrs. Doubtfire is a silly confection, with a standard-issue heartwarming point. But it works. Which so many screen-to-stage adaptations seem not to.\n\nIndeed, two and a half years ago, the stage musical version of Tootsie flopped. At least some of the blame was directed at a world more enlightened than the one in which the original movie was made: It had become less funny to watch a man who was kind of an asshole pretend to be a woman in order to take a job shouldn’t have gone to him. That had to have worried this creative team. But Mrs. Doubtfire avoids that problem because Daniel’s goals are more noble—and because the writers consciously turned Miranda into a more sympathetic character.\n\nIt’s worth noting that those rewrites come from a trio of men. And nowhere does the Playbill note the screenwriters of the hit movie, or the author of the novel on which it was based: Mayem Singer and Leslie Dixon, and Anne Fine, three women.\n\nMrs. Doubtfire opened December 5, 2021, at the Stephen Sondheim Theatre, and is on hiatus until March 15. Tickets and information: mrsdoubtfirebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
