{
  "showId": "magicbird-2012",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://theater.nytimes.com/2012/04/12/theater/reviews/magic-bird-at-the-longacre-theater.html",
  "publishDate": "April 11, 2012",
  "fullText": "Get unlimited access to NYTimes.com and NYTimes apps.\n\nAll print options include free unlimited access to NYTimes.com and NYTimes apps.\n\nAbout a third of the way through “Magic/Bird,” a new play about the basketball greats Magic Johnson and Larry Bird that opened on Broadway Wednesday night at the Longacre Theater, a moment of conflict, that crucial building block of drama, finally arrives.\n\nMagic/Bird Kevin Daniels, left, and Tug Coker at the Longacre Theater.\n\nFollow @NYTimestheater for theater news and reviews from Broadway and beyond.\n\nVideo clips projected onstage display dramatic highlights from the careers of Larry Bird (Tug Coker, left) and Magic Johnson (Kevin Daniels), who met three times in the N.B.A. finals.\n\nTaunting insults are exchanged. Simmering hostility is heated to a boil. Words are flung like fists, and violence threatens to erupt.\n\nUnfortunately this tense encounter does not involve either of the play’s nice-guy central characters but anonymous fans in a bar, rooting for their favorite teams and displaying the Rottweiler instincts of sports maniacs the world over. Their brief, volatile encounter turns out to be the most dramatic moment in “Magic/Bird,” an efficiently informative but uninspired trek through the lives of two towering (forgive the pun) figures in sports history.\n\nWritten by Eric Simonson and directed by Thomas Kail, the team behind the modest popular hit “Lombardi,” about the celebrated football coach Vince Lombardi, “Magic/Bird” represents another workmanlike attempt to colonize a small patch of Broadway for the underserved straight male constituency, which now has something to drag wives and girlfriends to in exchange for attendance at, say, “Wicked.”\n\nBefore digital brickbats come flying my way, I should acknowledge that there are plenty of women and gay men with a passion for basketball too (and no doubt plenty of straight men who’ve happily made return visits to “Wicked”).\n\nIn any case, while none who followed the concurrent N.B.A. careers of Mr. Bird and Mr. Johnson are likely to learn anything revelatory in “Magic/Bird,” they may be content to relive the highlights reel presented here, which is amplified by scenes that attempt to portray the human side of the superhuman athletes.\n\nBut as depicted by Mr. Simonson, and portrayed by Kevin Daniels (Mr. Johnson) and Tug Coker (Mr. Bird), the dual heroes never emerge as nuanced or magnetic stage figures, and the celebrated rivalry between them — which revived the flagging fortunes of the N.B.A. in the 1980s — stirs little more excitement, since their relationship off the court was one of mutual respect but minimal interaction, and hardly intimate friendship. (Although hoops occasionally descend from above, and a few balls are thrown, only video clips give us a sense of the players’ particular skills.)\n\nAdmittedly Mr. Simonson faced a particular challenge in manufacturing excitement from the clipped mutterings of the ambitious but reserved Mr. Bird, the self-described “hick from French Lick,” a small town in southern Indiana, who is presented here as laconic to the point of catatonic.\n\nMr. Coker’s dour expression and minimalist responses to attempts by coaches and others to draw him out are amusing at first, but men of few words are not what appealing drama is generally made of. (Mr. Coker is also saddled with a wig that makes him look like Frankenstein’s monster with a bad dye job.)\n\nMr. Johnson was the more outgoing figure, and his dramatic (albeit temporary) retirement from basketball in 1991, when he announced that he had contracted H.I.V., provides a dramatic frame for “Magic/Bird.” The play opens with this arresting moment in both the history of professional sports and of the AIDS epidemic, and includes video clips from the news conference during which a gallant and charming Mr. Johnson made the announcement, confirming rumors that had been whipping through the sports and media worlds.\n\nThe play then flashes back through the years of the players’ competitive careers, beginning when Mr. Johnson’s Michigan State team took the college championship over Mr. Bird’s Indiana State. Recruited by Red Auerbach (Peter Scolari), the determined general manager of the dormant Boston Celtics, Mr. Bird soon becomes a sensation, and the Celtics begin making regular appearances in the N.B.A. playoffs.\n\nTheir chief rivals are the Los Angeles Lakers, where Mr. Johnson is brought aboard to join a lineup already including Kareem Abdul-Jabbar. Mr. Johnson’s flashy style and terrific skills turn him into both a star player and a media darling, and the Celtics and the Lakers meet in a series of N.B.A. championship matchups that Mr. Simonson uses to juice the drama.\n\nBy engaging more directly with Iran, Room for Debate asks, could the U.S. defuse the situation in Syria?\n\nBefore drinking the hemlock, Socrates banished the weeping women so the men could be left to philosophize.",
  "isFullReview": true,
  "dtliExcerpt": "About a third of the way through “Magic/Bird,” a new play about the basketball greats Magic Johnson and Larry Bird that opened on Broadway Wednesday night at the Longacre Theater, a moment of conflict, that crucial building block of drama, finally arrives.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "DOWN",
  "dtliUrl": "https://didtheylikeit.com/shows/magic-bird/",
  "bwwExcerpt": "“Magic/Bird,” [is] an efficiently informative but uninspired trek through the lives of two towering (forgive the pun) figures in sports history. ... But as depicted by Mr. Simonson, and portrayed by Kevin Daniels (Mr. Johnson) and Tug Coker (Mr. Bird), the dual heroes never emerge as nuanced or magn...",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-MAGICBIRD-Opens-on-Broadway-Updating-LIVE-20120411",
  "showScoreExcerpt": null,
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "dtli",
    "bww-roundup"
  ],
  "textWordCount": 785,
  "archivePath": "data/archives/reviews/magicbird-2012/nytimes--charles-isherwood_2026-02-07.html",
  "textFetchedAt": "2026-02-07T15:16:28.478Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20131010035246",
  "archiveOrgUrl": "http://web.archive.org/web/20131010035246/http://theater.nytimes.com/2012/04/12/theater/reviews/magic-bird-at-the-longacre-theater.html",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 785,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T11:11:36.718Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The text appears to be corrupted with navigation menus, subscription prompts, and unrelated content mixed in with fragments of a review; openai: The text appears to be a mix of navigation instructions, social media prompts, and unrelated content, rather than a coherent review.",
  "promptVersion": "5.2.0"
}