{
  "showId": "magicbird-2012",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2012/legit/reviews/magic-bird-1117947058/",
  "publishDate": "April 12, 2012",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "The play works best when it focuses on the personal rivalry between the two athletes, exploring how their contrasting styles and backgrounds fueled their competitive fire.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Lacking an actual basketball game on an actual basketball court, Eric Simonson's \"Magic/Bird\" has zip drama. But techno-savvy designers make terrific use of classic NBA footage, and the actors playing Magic and Bird are cute enough to carry it off. Basketball fans are the obvious target aud, but the...",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-MAGICBIRD-Opens-on-Broadway-Updating-LIVE-20120411",
  "showScoreExcerpt": "The play works best when it focuses on the personal rivalry between the two athletes, exploring how their contrasting styles and backgrounds fueled their competitive fire.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (26 words)",
  "textQuality": "partial",
  "rejectedAt": "2026-02-03T18:24:25.692Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence fragment or excerpt without any clear recommendation or overall evaluation of the show; openai: The text is a plot summary with no evaluation or opinion on the show's quality.",
  "promptVersion": "5.2.0",
  "sources": [
    "web-search",
    "bww-roundup"
  ],
  "textWordCount": 215,
  "archivePath": "data/archives/reviews/magicbird-2012/variety--marilyn-stasio_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:49:40.403Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Word count too low: 215 (min: 300)",
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Feb 11, 2012 8:55am PT \n\n \n\n \n \n \n\n \n\n \n Winter Nomads\n \n \n\n \n\n \"Winter Nomads\" provides a closeup of two people who've chosen to continue the tradition of shepherd-led flock migrations.\n\nShepherd-led flock migrations aren’t common in Western Europe these days, and Manuel von Stuerler’s engaging “Winter Nomads” provides a closeup of two people who’ve chosen to continue the tradition. Vet shepherd Pascal Eguisier and younger colleague Carole Noblanc steer 800 sheep, three donkeys, three grown dogs and one puppy across Swiss fields during the early winter months in the annual shift, or transhumance, to new grazing grounds. Offering a more scaled-down intimacy than “Sweetgrass,” von Stuerler’s debut showcases nature, but its real theme is its subjects’ engagement with their work. Fests will benefit before certain migration to Euro satcasters.\n\nWhen tradition-minded Eguisier and Noblanc set out in November, they’re faced with unusually heavy snowdrifts on top of the ever-increasing problem of diminishing open pasture. There’s something incongruous about seeing such a large flock crossing a highway overpass, the sound of rushing traffic below, before they arrive at fields where the shepherds set up sleeping tents each night. What’s so unusual is that Eguisier and Noblanc don’t come from shepherd families, but chose this profession; Noblanc’s independent streak adds an extra layer to the journey. Visuals don’t skimp on the adorable."
}