{
  "showId": "tina-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2019/11/07/tina-better-than-all-the-rest-of-the-jukebox-musicals/",
  "publishDate": "2019-11-07T21:46:39",
  "fullText": "There is only one Tina Turner.\n\nThat’s really two statements in one. First: There is only one Tina Turner. It’s a comment on the inimitable talent and singular power of the beloved singer, dancer, and survivor. She’s an icon, and she should be. But also: There is only one Tina Turner. It’s notable that unlike in the recent Summer and The Cher Show, which each required three actresses to portray their titular divas, the new Tina: The Tina Turner Musical stars just one Turner.\n\nAnd Adrienne Warren, as it turns out, needs no assistance.\n\nTina, which opened tonight at the Lunt-Fontanne, is, surprisingly, pretty good. Warren, its star, is spectacular. She sings beautifully and she dances ecstatically. She nails that raspy, growling, wide-vowelled Tina voice. (There is, one notices, something a little Cher-y about Tina’s drawl.) And she does the whole thing with a focused ferocity that demonstrates how little Anna Mae Bullock could grow up to a legend. Warren’s “River Deep—Mountain High,” late in Act One, makes you stop, take notice, and settle in for whatever else she has to offer.\n\nTina’s story, if you don’t know it: Born to poor sharecroppers in Tennessee, abandoned by her parents, she was married off to the singer Ike Turner, who gave her a new name and a career and abused her, both emotionally and physically. When she finally found the courage to walk away, she was left with almost nothing—until the global success of her 1984 solo album, Private Dancer. That’s when she became a star.\n\nIt’s a triumphant tale that comes pre-packaged with a catalogue of beloved hits, and as such is obvious grist for a biomusical. But, then, such would also seem to be true of Summer and Cher … and Ain’t Too Proud and On Your Feet and Motown The Musical and a million others. It’s an ever-replenished genre, fed by memories of the dollar signs that emerged from the August Wilson for the dozen years Jersey Boys played there. Most of the recent crop have not been very good. Tina is. How did that happen?\n\nWarren is a big part of that. She played the role in London, too, where the show originated and where she won raves. She’s a gifted performer and a dynamite Turner. But that’s not all of it: Cher had Stephanie J. Block, who won a Tony; Summer had LaChanze. Tina has a book by a serious and respected playwright, Katori Hall. But that’s not it, either: Summer’s was by Rick Elice, who previously scripted Jersey Boys. Tina is competently staged (by Phyllida Lloyd—of Mamma Mia, of all things!), well-acted, and features fun choreography (by Anthony Van Laast) inspired by the Ikette originals. But parts of that are true for all those recent so-so jukebox shows: those Mackie costumes for Cher, that Sergio Trujillo take on the classic Temps moves for Ain’t Too Proud, an unmatchable score for Motown.\n\nTina works, I think, exactly because it has all that, and it’s content with what it has. Turner’s story is ultimately a simple and classic one, and it’s told simply but dramatically. No three-perspective Cubism, no direct-address narration. It also tells the truth, more or less. It’s an occupational hazard of life-rights stories that the protagonists (or their estates) are also producers. Motown didn’t work, for example, because Berry Gordy’s saccharine take on his own story could never be compelling. Tina Turner is a producer of Tina, but the story appears to pull no—well, let’s say it doesn’t hide the bad parts. Horror after horror befalls our immensely talented heroine, and we watch, engrossed, as she surmounts them all. The bumpin’ score doesn’t hurt, either.\n\nThis is not to say that Tina is perfect. Hall’s script resorts to frequent cliches, in dialogue as frequently as in story. (Truth be told, Tina does have its own tripartite late moment, when young Anna Mae, played by an excellent Skye Dakota Turner, and Grandma Georgeanna, Myra Lucretia Taylor, appear just before Tina reaches megastardom to release her from her past.) The costumes are often surprisingly shapeless; bathrobes and sweatsuits, I suppose, make for easy quick-changes into those sparkly concert minis underneath. And as much as I enjoyed the choreography—those iconic nice-girl-group-gets-down-and-dirty backup moves—I’d have loved to know more about how they developed.\n\nBut despite those complaints, the show works. Turner had—has!—an amazing talent and a tough life. She earned her success. Powered by Warren’s hard-charging performance, Tina makes us feel that. It’s joyous. And when during the bows and encore Warren pulls out Turner, the young Anna Mae actress, for her own verse of “Proud Mary”—and when the kid kills it—you can’t help but recognize there’s something pretty magical going on.\n\nIt’s nice—and rough.\n\nTina opened November 7, 2019, at the Lunt-Fontanne Theatre. Tickets and information: tinaonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-roundup"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "Tina, which opened tonight at the Lunt-Fontanne, is, surprisingly, pretty good. Warren, its star, is spectacular. She sings beautifully and she dances ecstatically. She nails that raspy, growling, wide-vowelled Tina voice. (There is, one notices, something a little Cher-y about Tina's drawl.) And she does the whole thing with a focused ferocity that demonstrates how little Anna Mae Bullock could grow up to a legend. Warren's \"River Deep-Mountain High,\" late in Act One, makes you stop, take notic",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-TINA--THE-TINA-TURNER-MUSICAL-Opens-On-Broadway--See-What-The-Critics-Are-Saying-20191107"
}
