{
  "showId": "tina-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2019/11/07/tina-trying-too-hard-to-catch-fire/",
  "publishDate": "2019-11-07T21:45:20",
  "fullText": "It’s impossible not to be inspired by the story of Anna Mae Bullock, a girl who suffered abandonment to become a woman who endured abuse to emerge as one of the 20th century’s most prominent music figures and survivors, as one Tina Turner. It was only a matter of time before this rock and soul goddess got her own jukebox hagiography; and given the U.K.’s fondness for such things, and Turner’s fondness for Europe in general—she currently lives in Switzerland, with her German husband—it seems fitting that the show should have premiered in London, then spawned another production in Hamburg.\n\nNow Tina: The Tina Turner Musical arrives on Broadway, with all the subtlety of a sledgehammer. Even by jukebox standards, Tina is a garish spectacle, with overwrought performances—under the direction of Phyllida Lloyd, whose stage successes here and abroad range from Mamma Mia! to an all-female The Taming of the Shrew—and banal dialogue, by Katori Hall (best known for the Martin Luther King, Jr.-inspired fantasia The Mountaintop) with Frank Ketelaar and Kees Prins. It’s also an undeniable crowd-pleaser, which at the preview I attended drew an extended standing ovation, with nary a person seated from my vantage point in the orchestra section.\n\nWere the audience members embracing the theatrical pyrotechnics (which extend to the design, particularly Jeff Sugg’s psychedelic lighting) and emotional clichés being tossed at them, I wondered, or cheering at least in part for Turner herself? I suspect it was a little of both—though frankly, I found leading lady Adrienne Warren, a dynamic singer and actress who won an Olivier Award for originating the role of Turner in London, less than convincing as a stand-in.\n\nUnlike Jessie Mueller in Beautiful: The Carole King Musical or Stephanie J. Block in The Cher Show, to cite a pair of recent Tony winners, Warren seems reluctant to put her own virtuosity aside in service of capturing the distinctive quirks of a popular voice. To the contrary, Warren’s singing here is a bombastic caricature of Turner’s (not the subtlest of singers, admittedly); the actress emphasizes her subject’s distinctive rasp and growl while ramping up her use of vibrato and melisma, so that her readings of hits from “River Deep—Mountain High” to “We Don’t Need Another Hero” suggest an overzealous contestant on “American Idol” or “The Voice.”\n\nIf Warren’s acting is a bit more nuanced, it’s likely not because of Lloyd’s guidance, judging by the other performances here. Several of the principals cast as Turner’s female relatives in rural Tennessee, and the women she meets after moving to St. Louis and beginning to sing with Ike Turner, speak with accents so exaggerated that I sometimes had trouble making out what they were saying. Given the obviousness of the dialogue, that wasn’t always a bad thing. “Don’t let that man make you his puppet,” the father of Tina’s first child (musician Raymond Hill, pleasantly played by Gerald Caesar) tells her about their bandleader and her soon-to-be husband, Ike Turner. “Why do you stay? It’s not too late to fix this mistake,” urges Ike’s (and later Tina’s) manager Rhonda, played with curious woodenness by Jessica Rush.\n\nThe actor cast as Ike, Daniel J. Watts, has little opportunity to give us a sense of what drew Tina in before he starts to slap her around—just as Anna Mae’s dad did her mother, portrayed here (by a forceful Dawnn Lewis) as a bitter, withholding woman who shows signs early on of envying her gifted daughter. Australian manager/producer Roger Davies and German record company executive Erwin Bach (Turner’s current spouse) are the nice guys who help Tina find herself. “Are you staying in London long? Forever maybe?!(sic)” Erwin (a puppyish Ross Lekites) asks, seconds after meeting her.\n\nIt’s Roger—played by Charlie Franklin as a sort of happy-clown antidote to Simon Cowell—who matches a reluctant Turner to the song that will relaunch her career, “What’s Love Got To Do With It?” The opening bars of that comeback hit are teased several times, as if to prepare the audience for the unveiling of the Holy Grail, before Warren’s Turner digs in and belts it out to the rafters. Tina‘s score also features songs stretching back to her early days with Ike, as well as tunes made famous by other artists that she has covered, from the Al Green classic “Let’s Stay Together” to “Disco Inferno.”\n\nHaving been lucky enough to catch Tina Turner in concert before she essentially retired from touring, I can report that Tina, for all its huffing and puffing, doesn’t capture the force of nature she was in live performance. That’s not a criticism of Warren; it’s just a reminder that a better, truer and generally less expensive way to appreciate our favorite artists is through their own work. Though if Tina were to lead a few uninitiated audience members to Turner’s, I’d be the first to stand up and cheer.\n\nTina opened November 7, 2019, at the Lunt-Fontanne Theatre. Tickets and information: tinaonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-roundup"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2019/11/07/tina-trying-too-hard-to-catch-fire/",
  "bwwExcerpt": "Having been lucky enough to catch Tina Turner in concert before she essentially retired from touring, I can report that Tina, for all its huffing and puffing, doesn't capture the force of nature she was in live performance. That's not a criticism of Warren; it's just a reminder that a better, truer and generally less expensive way to appreciate our favorite artists is through their own work. Though if Tina were to lead a few uninitiated audience members to Turner's, I'd be the first to stand up ",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-TINA--THE-TINA-TURNER-MUSICAL-Opens-On-Broadway--See-What-The-Critics-Are-Saying-20191107"
}
