{
  "showId": "the-mountaintop-2011",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "http://www.hollywoodreporter.com/review/mountaintop-theater-review-248274",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "While it begins as a deceptively simple fictionalized account of Martin Luther King Jr.’s final night on Earth, Katori Hall’s The Mountaintop literally explodes into metaphysical magic realism, ruminating on race and politics, life and death in ways that connect King’s legacy to every person in the audience. Bottom line: Samuel L. Jackson and Angela Bassett ignite this provocative play, which is slow to reveal itself but ultimately packs a punch.",
  "bwwScore": 9,
  "contentTier": "complete",
  "fullText": "NEW YORK – While it begins as a deceptively simple fictionalized account of Martin Luther King Jr.’s final night on Earth, Katori Hall’s The Mountaintop literally explodes into metaphysical magic realism, ruminating on race and politics, life and death in ways that connect King’s legacy to every person in the audience. Such bold writing requires actors with inarguable authority, and Kenny Leon’s supple production has them in Samuel L. Jackson and Angela Bassett.\n\nThe playwright and director hoodwink us into believing this is a straight-up serving of historical realism packaged in a modest two-character drama. That agenda is also pushed by David Gallo’s boxed-in set, a meticulously detailed replica of Room 306 at the Lorraine Motel in Memphis, to which the civil rights leader retired on the night of April 3, 1968, after delivering his “I’ve been to the mountaintop” speech to striking black sanitation workers.\n\nThe play starts with King (Jackson) entering out of a thunderstorm and padding around the room in his socks, trying out different approaches for a planned sermon on American arrogance. He calls room service for coffee, which arrives swiftly via Camae (Bassett), a gorgeous new maid in her first day on the job.\n\nAs a dramatic set-up, this could hardly be more conventional, and many will be wondering what all the fuss is about. The play arrives on Broadway after critical plaudits for its off-the-radar 2009 London premiere propelled it to the West End and then to a surprise win for best play at the Olivier Awards.\n\nMuch of the early action seems designed expressly to show King not as an exalted icon but as a flesh-and-blood man, with flaws, weaknesses, fears and self-doubts like any other. He flirts with Camae, bumming Pall Malls off her while finding excuses to keep her talking. Starstruck and unworldly but by no means intimidated by “Preacher King,” Camae slyly challenges his patriarchal views and mocks his “bougie black folk” ways. She questions the efficacy of his non-violent methods, suggesting it might be time to stop marching and start fighting.\n\nThis is all engrossing, especially with the surprisingly humorous dialogue batted back and forth by two such charismatic pros as Jackson and Basset. But prolonging the tease for a full half of the intermissionless 95-minute play is excessive. Whether or not King is hitting on Camae is far less interesting than the enigmatic maid’s real identity and the true purpose of her visit.\n\nRevealing those mysteries would undercut the play’s capacity to beguile and stimulate. But Hall deftly transforms the scenario into a reflection on mortality that’s both specific to King and universal, acknowledging our strengths and frailties, our accomplishments and failings, while pondering what we contribute and what we leave behind.\n\nSome of the clues concerning the play’s grander intentions are subtler than others, and anachronistic winks such as mentions of a cell phone and dropped calls are a little too easy. But the writing is tethered to a moment in the past and to a milestone of the recent present, with the election of a black U.S. president. It also taps into the here and now, as the battle lines in the war on poverty, class and racial inequality are again being etched into the national psyche like fresh scars.\n\nLeon responds to the magic tricks of Hall’s writing with his own virtuoso coup de theatre to the accompaniment of composer Branford Marsalis’ soulful horns, while Bassett lets fly in a fiery poetry slam that time-travels through half a century of black American life.\n\nJackson maintains an easy swagger for much of his performance, holding back to explore the fissures within the man only as King’s moment of reckoning draws nearer. His final, solemn address to the audience closes the play on a stirring note.\n\nHowever, the performance people will be talking about is Bassett’s. She’s brash and funny, cozying up to a familiar sassy stereotype as she demonstrates how to take a drag on a cigarette “like it’s going out of style.” But it becomes increasingly clear that Camae’s amusement hides a secret sense of grave responsibility, allowing Bassett to unleash all of her powers as this intimate yet epic play builds to its bracing conclusion.\n\nVenue: Bernard B. Jacobs Theatre, New York (runs through Jan. 15)\n Cast: Samuel L. Jackson, Angela Bassett\n Playwright: Katori Hall\n Director: Kenny Leon\n Set designer: David Gallo\n Costume designer: Constanza Romero\n Lighting designer: Brian MacDevitt\n Sound designer: Dan Moses Schreier\n Music: Branford Marsalis\n Presented by Jean Doumanian, Sonia Friedman Productionsm Ambassador Theatre Group, Raise the Roof 7, Ted Snowdon, Alhadeff Productions/LaurenDoll, B Square – 4 Productions/Broadway Across America, Jacki Barlia Florin/Cooper Federman, Ronnie Planalp/Moellenberg Taylor, Marla Rubin Productions/Blumenthal Performing Arts\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice.",
  "isFullReview": true,
  "textWordCount": 891,
  "archivePath": "data/archives/reviews/the-mountaintop-2011/hollywood-reporter--david-rooney_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:08:21.344Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 891,
  "tierReason": "Full review text"
}