{
  "showId": "the-inheritance-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2019/11/17/the-inheritance-gay-life-in-america-then-and-now/",
  "publishDate": "2019-11-17T21:45:53",
  "fullText": "Life is short, and some plays are long—and such is The Inheritance, a six-plus-hour-long epic regarding gay life in America, then and now, crafted as two full-length dramas that opened tonight at the Barrymore.\n\nA vivid, highly ambitious work by Matthew Lopez, a rising American playwright, The Inheritance premiered to acclaim in London last year. Yet do not expect to see the gay Cavalcade here, but rather an entertaining, if exceedingly overlong, study in cultural change and the power of human compassion.\n\nFive actors from the original company recreate their roles in this Broadway production as the leading figures among an excellent 14-member ensemble nimbly directed by Stephen Daldry. He wisely stages Lopez’s weighty work with a deceptively light hand that swiftly delivers its often engrossing story.\n\nThe Inheritance is inspired by Howards End, a 1910 English novel about two sisters in London whose lives go different ways during the Edwardian era. Lopez develops his two-part drama so that viewers need not be familiar with Howards End or its 1992 film version to appreciate The Inheritance.\n\nAnyone conversant with the original, however, will be able to see how Lopez cleverly retains portions of its plot even as he updates his Americanized story to the years 2015-2018. Supplementing these times are flashbacks to the closing decades of the 20th century.\n\nIn Lopez’s modern-day situation, the sisters are reinvented as a 30-something gay couple. The kindly Eric (Kyle Soller) and tempestuous Toby (Andrew Burnap) are smart New Yorkers whose longtime relationship goes bust and diverts them along contrasting paths.\n\nEric gets emotionally involved with an older man, Henry (John Benjamin Hickey), a cool billionaire whose neoconservative values ignites conflicts with Eric and his liberal friends. Toby writes a smash Broadway play, but his thwarted hots for Adam (Samuel H. Levine), his twinkling leading man, drives him instead to Leo (Levine again), a pensive sex worker with a troubled past.\n\nKey to the story is a venerable country house in upstate New York that later is revealed to have been a refuge for a generation of men dying in the AIDS nightmare.\n\nNearly all of the drama’s multiple characters are gay men, notably the magical figure of E.M. Forster (1879-1970), the author of Howards End.  A gray-suited Goodbye Mister Chips sort of kindly English don, Forster (Paul Hilton) annotates his story to the others who depict his characters. Later they question Forster harshly about why he lived a closeted existence.\n\nThe play has been composed by Lopez—brilliantly in some places—as a fluent blend of realistic dialogue, third person narration, direct address, and easy chitchat. The ensemble, barefooted and dressed casually, collectively portray the story’s principal and many incidental characters atop a blond wooden deck cunningly designed by Bob Crowley that subtly shifts its shape to evoke numerous spots from a swimming pool on Fire Island to a swank townhouse in the West Village.\n\nA thoughtful, at times even insightful, study in the changing manners and mindsets of Eastern Seaboard-type gay male culture over the last 40 years, The Inheritance ultimately proves to be more or less a high-grade soap opera.\n\nExpect some steamy scenes, explosive face-offs, confessional monologues, considerable humor, and snappy aphorisms such as “To fall in love is to make an appointment with heartbreak.” Among the play’s Queer as Folk-style doings, a Sunday brunch gathering goes terribly sour, a sex party turns nasty, a wedding gets crashed, and later so does a car, fatally. There’s even a dose of backstage intrigue as the troublesome Toby is ejected from rehearsals of his own show.\n\nIf some of The Inheritance is surprisingly glib, it nevertheless remains a mostly well-written and observant work that successfully studies contrasts in generational attitudes—and socio-political awareness—even as it features several poignant sequences. The concluding scene of the first play, which cannot be described here but is the finest episode in the entire production, is genuinely moving through the breathtaking simplicity of its evocation of a lost generation.\n\nA great director, Daldry strategically employs top of the line designers to realize the production with effectively minimalist visuals. Paul Englishby’s original musical further enhances the drama. But it is the keen acting—confident, animated, expressive—that makes the production such a vital experience. In addition to the actors previously cited, all of whom deliver fine portrayals of their characters, a luminous Lois Smith arrives late in the second play’s action to sweeten an increasingly bitter storyline.\n\nAlthough the drama’s two-part length is questionable, the fluency of Lopez’s skillful writing, the scope of his intergenerational narrative, and the immediacy of Daldry’s sterling staging of its production make The Inheritance an important event of the Broadway season.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
