{
  "showId": "the-inheritance-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2019/11/17/the-inheritance-a-magnificent-look-at-the-post-angels-in-america-world/",
  "publishDate": "2019-11-17T21:46:58",
  "fullText": "Yes, Matthew Lopez’s magnificent The Inheritance is performed in two separate parts, clocking in at over six hours, which is a not inconsequential commitment in time and dollars. But after no more than 20 minutes, you are likely to lean back contentedly in your seat, eager to spend six hours with Lopez, director Stephen Daldry, and their impressive ensemble of (mostly) young men.\n\nThat “(mostly) young men” is, indeed, the point. The Inheritance has, since its initial performance at the Young Vic in March 2018, been repeatedly compared to Angels in America, Tony Kushner’s two-part masterpiece from 1991-93. The plays are comparable in terms of scope, length, excellence, and the subject matter at its base, which is the effects of AIDS on a group of New Yorkers.\n\nThe difference is that so many of the generation Kushner was writing about yesterday, in Angels, did not survive to become the middle age generation of today. One of the peaks of the play comes when a young firebrand attacks conservative industrialist Henry Wilcox (John Benjamin Hickey) and “men your age” for standing on the sidelines in the present-day fight for equality. “There are no gay men my age,” Wilcox barks back. “Men my age paid for your rights with their lives.”\n\nLopez writes of the fight for equality, today (his play begins in 2015 and ends in 2018); Kushner was writing about the fight for life, in the epidemic years of 1985-90. But Lopez purposely links the times and the fights, addressing the notion of inheritance from one generation of men to the next. Several inheritances, actually: social freedom, disease, and even the right of existence over the course of a century.\n\nIt is this last which enhances The Inheritance and lifts it to something extra-ordinary and positively Stoppardian. Lopez has built upon the notion—or, apparently, was inspired by the notion—of building his story of social change and inheritance on E.M. Forster’s 1910 novel Howards End. Transplanted a century, and from England to New York State, yes; and with a virtually all-male dramatis personae.\n\nBut industrialist Wilcox remains central to the tale, as well as the ethereal Mrs. Wilcox now in the person of Walter Poole (Paul Hilton). Sisters Margaret and Helen Schlegel become nearly penniless lovers Eric Glass (Kyle Soller) and Toby Darling (Andrew Burnap), facing eviction in a majestic rent-controlled Upper West Side aerie. The New York domiciles of Eric and Henry correspond with Forster’s London flats, while the two country manor houses are identical, complete with the illness-healing pig’s teeth in the tree bark.\n\nLopez is not interested in a mere literary trick, though; and audience familiarity with the novel or its celebrated 1992 film version is not required. The playwright makes a central character of displaced novelist Forster, famously a closeted gay man whose other books include the classic A Room with a View. Forster directly followed Howards End with Maurice, a 1914 novel so uncompromising that he forbid its publication until after his death in 1970 (at the age of 91).\n\nForster’s participation as something of a guide to aspiring novelist Leo (Samuel H. Levine) allows us to see the present not only through the lens of the Stonewall generation but through Forster’s 19th century eyes as well, accentuating the “inheritance” that he (and his secretive society) passed on to the present day.\n\nThe novelist’s presence—and his hidden life, which made him such a keen observer of pre-Great War English society as both insider and outsider—is lucidly explained and adds to the emotional pull of The Inheritance. Let us add that while the play premiered at the Young Vic in London, Lopez is a Floridian of Puerto Rican descent. He won an Obie Award for his 2011 drama The Whipping Man (at Manhattan Theatre Club), and made his last local appearance in 2018 with the extremely funny and curiously heart-warming Legend of Georgia McBride (at MCC). Neither of which suggest the overwhelming power of his new play.\n\nThere are no less than six astonishing performances on display. Let’s qualify that; the entire 14-person cast seems to contribute cracklingly vibrant moments when called upon. Leading the group are three young American actors. Levine, who spends most of his stage time not as the aspiring writer Leo—who, in the course of the evening, “writes” the novel-within-the-play—but as Adam, an idealized and privileged version of Leo (and perhaps Lopez himself); Soller, as the present-day stand-in for Forster’s heroine Margaret; and Burnap, as the latter’s wildly uncontrollable partner who plays a central role until he literally burns out.\n\nLevine is stunning. There are a handful of moments across the six hours where Adam seems to drop his guard and reveal a frighteningly real inner self. It is not uncommon for an accomplished actor to play disparate roles, of course; but in these cases, it seems not to be the actor but the character making these lightning transitions. Soller plays the straight man (figuratively) throughout the evening, with increasing strength as the story takes its unexpected turns. Burnap, meanwhile, threatens to consume the entire piece as the self-invented playwright-within-the-novel with his own personal, and shattering, inheritance.\n\nEnglish actor Hilton offers a special and spectral presence as the ghostly Walter and the uncomfortable time-traveler Forster. (The other four principal men in the London cast where imported from the United States, a sign of the artistically fruitful present-day cooperation of British and American Actors’ Equity.) It is no surprise to find that stage veteran Hickey—a Tony winner for The Normal Heart—thoroughly commands the stage in the somewhat smaller but no less important role of Wilcox. Also offering a galvanic performance is Lois Smith, who only comes on in the final act of Part Two as the dedicated caretaker of Howards End. Or, rather, of Walter’s House in Upstate New York. Smith, who last week turned 89, is the only one of the major players who did not appear in the London production, where the role was played by Vanessa Redgrave.\n\nOne can’t overestimate the vision of director Daldry (of An Inspector Calls, Billy Elliot, and The Jungle). The Inheritance is a massive undertaking, and he has staged it with focus, clarity, and welcome touches of humor. He is abetted by British designer Bob Crowley, whose usually massive and mostly brilliant designs have won him seven Tony Awards thus far. For The Inheritance, he has come up with what is basically a bare stage with an enormous rectangular stage lift in its midsection. (Much of the action takes place with cast members figuratively “sitting around a table,” which Daldry and Crowley contrive masterfully.) There are dynamic surprises along the way, not to mention a breathtaking—and altogether heart-stopping—coup de théâtre at the end of Part One which left a large swath of the audience thoroughly devastated and literally in need of a break before Part Two.\n\nTheatergoers fortunate enough to have seen the original cast in the original productions of such two-part dramas as Nicholas Nickleby and Angels in America will likely tell you that those experiences remain unforgettable. The Inheritance hereby joins that list. Pure theatrical magnificence.\n\nThe Inheritance opened November 17, 2019, at the Ethel Barrymore Theatre and runs through March 15, 2020. Tickets and information: theinheritanceplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "Theatergoers fortunate enough to have seen the original cast in the original productions of such two-part dramas as Nicholas Nickleby and Angels in America will likely tell you that those experiences remain unforgettable. The Inheritance hereby joins that list. Pure theatrical magnificence.",
  "bwwScore": 10
}
