{
  "showId": "the-inheritance-2019",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2019/11/17/theater/the-inheritance-review-broadway-matthew-lopez.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2019/11/17/theater/the-inheritance-review-broadway-matthew-lopez.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Ambition and achievement are not entirely commensurate in 'The Inheritance.' Its breadth doesn't always translate into depth. As fine as the acting is throughout - and quietly brilliant when the extraordinary veteran Lois Smith takes the stage, toward the very end, as the show's sole female character - none of the characters here have the textured completeness of those created by Forster and Kushner. Ultimately, the play twists itself into ungainly pretzels as it tries to join all the thematic dots on its immense canvas. Yet even by the end of the overwrought second half of 'The Inheritance,' you're likely to feel the abiding, welcome buzz of energy that comes from an unflagging will to question, to create, to contextualize, to - oh, why not? - only connect.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-INHERITANCE-Opens-on-Broadway-Updating-Live-20191117",
  "showScoreExcerpt": "\"‘The Inheritance’ Review: So Many Men, So Much Time:Breadth doesn’t always equal depth in Matthew Lopez’s supersize, vividly painted portrait of gay life in the 21st century, featuring E.M. Forster as a spirit guide.\"\n\nRead more",
  "fullText": "Ardent aspiration glows in every moment of Matthew Lopez’s “The Inheritance,” which opened on Sunday at the Ethel Barrymore Theater. That is, to be sure, a whole lot of moments.\n\nThis two-part, novelistic doorstop of a play, a portrait of 21st-century gay men in search of their collective past, occupies more than six hours of stage time. And everything about it — its themes, its form, its frame of reference and the desires of its characters — is of a scale with its length.\n\nConsider, to begin with, that Lopez — whose earlier, respectfully received plays (“The Whipping Man,” “The Legend of Georgia McBride”) scarcely anticipated a blockbuster like this one — is making his Broadway debut with a work that courts direct comparison with two daunting predecessors. They would be “Howards End,” E.M. Forster’s 1910 novel of England at a moral crossroads, and “Angels in America,” Tony Kushner’s two-part, Pulitzer Prize-winning drama from the early 1990s about the beleaguered soul of gay America (which was spectacularly revived only last year).\n\nThe young New Yorkers who populate “The Inheritance,” directed with a forward-charging breathlessness by Stephen Daldry (“Billy Elliot”), all dream big as well. At their noblest, they’re searching to summon the gay pioneers of the past who made their present lives possible.\n\nAnd whom should they enlist as their spirit guide in this endeavor but Forster himself? Portrayed with wide-eyed curiosity and a diffident mien by the British actor Paul Hilton, Forster steps out of the past and into the play’s opening scene like a tutelary don strolling through a campus quad, where clean-cut acolytes sprawl and frolic like models for a J. Crew back-to-college catalog.\n\nForster generously gives the boys of “The Inheritance” his blessing to use “Howards End” as the template for the story they’re telling. He even lets them construct a variation on its opening line for their starting point, so that “One may as well begin with Helen’s letters to her sister,” becomes, “One may as well begin with Toby’s voice mails to his boyfriend.”\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 364,
  "archivePath": "data/archives/reviews/the-inheritance-2019/nytimes--ben-brantley_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:25:10.925Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250722051511",
  "archiveOrgUrl": "http://web.archive.org/web/20250722051511/https://www.nytimes.com/2019/11/17/theater/the-inheritance-review-broadway-matthew-lopez.html",
  "contentTier": "complete",
  "wordCount": 364,
  "tierReason": "Full review text"
}