{
  "showId": "beetlejuice-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2019/04/25/beetlejuice-tim-burtons-1988-cult-film-kinda-musicalized/",
  "publishDate": "2019-04-25T20:45:23",
  "fullText": "Alex Brightman—a chunky lad with a twinkle in his eye and a surname that only begins to describe his abilities—revels in entertaining. He could easily be dubbed our new Master of the Revels. In School of Rock, he ruled the raucous, yet relatively mild proceedings as an obstreperous music teacher. Now he’s back at the Winter Garden (undoubtedly in the dressing room he only vacated some short time ago) as a trouble-making fellow from the netherworld who’s hoping to gain some traction in this world.\n\nHe’s doing his hot thing in the Scott Brown-Anthony King musical adaptation—songs by Eddie Perfect—of Tim Burton’s 1988 flick with the same catchy name. (On the show curtain it’s spelled “Betelgeuse,” if you want to get fussy). Brightman is so good at what he does that bookwriters Brown and King were wise to adjust their script from the one Michael McDowell and Larry Wilson carpentered so that Beetlejuice, wearing his frayed black-and-white striped outfit (suggesting the jailed-criminal aspect of his personality) doesn’t make a late entrance to the shenanigans.\n\nBeetlejuice starts the action with a meta-theatrical address to the audience during which he says things like any cellphone users will die at his hand. He then goes on to lead cast members in “The Whole ‘Being Dead’ Thing,” a rousing Perfect number that promises several coffins full of eventual fun that, as it turns out, is only partially met. No discredit to the effervescent Brightman, who relishes informing the ticket buyers more than once that “this is a show about death.”\n\nMovie-goers making up the Beetlejuice cult (many of them obviously present at the performances I attended) know the initial storyline has it that happily-married Barbara and Adam, in their capacious semi-Victorian home get, themselves deceased in a car accident but stay incorporeally on to see with great chagrin new homeowners Charles, Delia and daughter Lydia move in.\n\nAdam and Barbara are so outraged in their understated way that they consult The Book of the Recently Deceased, hoping to find a way to dislodge the interlopers. It’s a strategy that to their eventual dismay leads to the calculating Beetlejuice joining them. It also transpires that gloomy Lydia, who can see Barbara and Adam, whereas Charles and Delia can’t, is caught up in the ridding-the-new-family scheme.\n\nFooling around with the McDowell-Wilson plot, Brown and King have decided to shift the storyline’s weight around so that Lydia (Sophia Anne Caruso) is equal, if not more so, to Barbara (Kerry Butler) and Adam (Rob McClure) in realizing their disparate needs. (Check the billing of the three to see how that falls out.) Lydia now is mourning her mother, whose burial figures in the kick-off sequence.\n\nHer dad Charles (Adam Dannheiser) and Delia (Leslie Kritzer) are now only affianced. (Incidentally, Beetlejuice mavens: Barbara and Adam meet their end in this telling not by drowning when their car drops into ol’ man river but by falling through their living room floor. How’s that for a surprise double demise?).\n\nSo with the adjusted book, audiences are now treated to this watered down, gussied up Beetlejuice. The production seesaws somewhat precariously between the dead Adam and Barbara, and the spots-the-dead Lydia. Adam and Barbara, sometimes throwing sheets over themselves to appear as traditional ghosts, seem to be fighting for attention with Lydia’s wanting to resurrect her mother. All the while, the comically desperate Beetlejuice contrives to do his handwringing worst.\n\nPut another way, Beetlejuice becomes a hodge-podge of events and numbers, some amusing, some not so amusing. Fans of the flick are likely to recall that Barbara and Adam decide one way to get the staunch Charles and the slinky Delia to flee the place is to have them ruin a supper for business guests by segueing into a version of the Jamaican folk song “Day-O (The Banana Boat Song),” Harry Belafonte’s 1956 hit—with the two of them channeling Belafonte’s voice. It’s a sequence that becomes an impromptu group dance, and it retains the capacity to rouse observers—but maybe not so much here as it does in the film, and not just because Dick Cavett is one of the celluloid participants but not present on stage.\n\nThe other first-rate number is “That Beautiful Sound,” which starts act two and refers to the screams ghouls regularly elicit when they’re on form. Otherwise, the Eddie Perfect songs are hit-or-miss, many of the hits in large part due to how they’re sung. Several times Caruso accounts for those with bell-ringers; “Dead Mom” and “Home,” prominent among them. (N.B.: If the number of off-rhymed lyrics were to be tallied, Perfect—who also supplied the ditties for this season’s King Kong—could henceforth become known as Eddie Imperfect.)\n\nAlex Timbers directs Beetlejuice, and lives up to his (sometimes overrated) reputation. Among other savvy moves, he hires a handful of the above-mentioned Broadway sparkplugs, as well as additional sparkplugs like Danny Rutigliano and Jill Abramovitz, who plays not one, but two chuckle-inducing drop-ins.\n\nDirector Timbers has also relied on the creative team to come across with all sorts of eye-catching and funny-bone tickling special effects. This lengthy and worthy list features choreographer Connor Gallagher, set designer David Korins, costumer William Ivey Long (who from show to show can’t stop topping himself), lighting designer Kenneth Posner, sound designer Peter Hylenski, projection designer Peter Nigrini, puppet designer Michael Curry, special effects designer Jeremy Chernick, and magic and illusion designer Michael Weber. Thanks be to all of them for toiling above and beyond the call of duty.\n\nThose identified directly above can be considered responsible for what passes by with much more allure than might be attributed to yet another of the many, many popular movies endlessly brought to the stage for nothing more cogent than its being a popular film and therefore impressing producers as a marquee temptation for movie lovers.\n\nBy the way, at the end of a scene wherein the manipulative Beetlejuice hasn’t successfully wheedled what he was after, he goes to exit through a door but before he completes the departure, he swivels to the audience and says, “Fuck Brigadoon.”\n\nPutting aside the obscenity—always an easy laugh about which Brown and King should be embarrassed—think of what this at-best-mediocre tuner has to say of a predecessor musical comedy that can rightfully boast a top-drawer Alan Jay Lerner-Frederick Loewe score, top-drawer Agnes de Mille choreography, a charming and clever Lerner book, and top-drawer Robert Lewis direction. To play with another cliché: Beetlejuice isn’t worthy to shine the earlier musical’s singing-and-dancing shoes.\n\nBeetlejuice opened April 25, 2019, at the Winter Garden Theatre. Tickets and information: beetlejuicebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
