{
  "showId": "beetlejuice-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2019/04/25/beetlejuice-these-ghosts-are-gonna-live-forever/",
  "publishDate": "2019-04-25T20:46:48",
  "fullText": "It’s showtime at the Winter Garden.\n\nIn fact, if we’re being technical, it’s showtime and then showtime again, because the very wink-wink-nudge-nudge stage version of Tim Burton’s Beetlejuice gives us the iconic line once, first from the titular ne’er-do-well ghost, and then again, later on, from the square ghoul Adam, mocking him. In fact, if we’re really being honest, the line is there three times, starting out on an undersling hanging from the marquee out front.\n\nIn other words: It’s showtime! It’s showtime! It’s showtime!\n\nAnd thus is conjured a very enjoyable, very self-aware, very slick, very tuneful, very constructed-to-please-the-crowds new Broadway musical. It opened tonight at the Winter Garden, that frequent home to now-and-forever-running staples, and it’s nearly guaranteed to follow suit.\n\nAnd the best part is: It’s a really good tourist show.\n\nThe extravaganza begins well before the curtain goes up. The house lighting is all in purples and greens, to match the show’s colors, and the ushers are in themed neckties, instead of the usual collage of Shubert marquee. A version of the Danny Elfman movie theme plays. Green and purple spotlights sweep the audience. You’re in for a show.\n\nAnd that is what’s delivered. From the first notes of “Day-O” that kick off the story even before the houselights go down, to the charmingly frenetic lead performance from Alex Brightman (last seen on Broadway, on this very stage, as Dewey in School of Rock, another successful film-to-stage transfer), to the catchy, pastichey score from the Australian composer-lyricist Eddie Perfect, to the over-the-top set and staging by designer David Korins (who has a Tony for Hamilton) and director Alex Timbers (who has brought us such wonders as Bloody Bloody Andrew Jackson and Peter and the Starcatcher) — all of it builds to a perfectly, wonderfully, showbizzy good time.\n\nThe script, from Scott Brown and Anthony King, manages to entirely rework the movie’s story while keeping its essence, and hitting all of the required high points. (Brown and King’s previous musical was the downtown charmer Gutenberg! The Musical, directed by Timbers. Brown went on to spend several years as the theater critic at New York magazine, at which point I — and likely every other reviewer — developed a friendly, nod-across-the-aisle acquaintance with him.) The chain-smoking functionary who runs the underworld is still there, and so are the dead football players and the guy with the shrunken head. The sandworm is still there, though more as a warning than a real threat. (No greenscreen here.) Harry Belafonte tunes are played prominently, as the good time we are to have demands they must.\n\nBut much of these things appear not quite where you expect them. Brown and King turn Beetlejuice into Lydia’s story; it’s driven forward by the sad goth teen who moves into the house Beetlejuice is haunting. It opens at her mother’s funeral (gorgeously staged in purples and blacks, nodding nicely at a Burtonesque world), and it’s her journey to reconnect with her father. (It helps that she’s played by Sophia Anne Caruso, who’s terrific.) And yet despite that opening, and despite Beetlejuice’s repeated, fourth-wall-breaking insistence that this is a musical about death, it actually removes most of the movie’s notes of melancholy. The sudden death of Adam and Barbara, the kind couple who own the Victorian house that Lydia (and Beetlejuice) eventually move into, can’t be a surprise anymore, but here it’s also played for laughs.\n\nThey’re probably the weakest part of the show, a sort of dull backup chorus. They’re played by two fine and funny actors, Rob McClure and Kerry Butler, but their characters are too milquetoast to register. (In the movie, it’s their story.) On the other hand, Lydia’s daffy stepmom, Delia — she’s now a life coach having an affair with dad — is here even daffier, and, as portrayed by Leslie Kritzer, a scene-stealer.\n\nIt’s those big performances that work best here — Jill Abramovitz, wonderfully ridiculous in a bit part as an investor’s vacant wife, is a standout — because the whole show is so big. William Ivey Long’s costumes are exaggerated and hilarious; Connor Gallagher’s choreography almost gets lost among all the movement and exuberance. The movie had some nuance; this pull-out-the-stops musical doesn’t.\n\nAnd if this Beetlejuice has a flaw, it’s that: In its insistence on entertaining you, it’s a story about death with tons of life but maybe not quite as much soul.\n\nBeetlejuice opened April 25, 2019, at the Winter Garden Theatre. Tickets and information: beetlejuicebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-roundup"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "And thus is conjured a very enjoyable, very self-aware, very slick, very tuneful, very constructed-to-please-the-crowds new Broadway musical. It opened tonight at the Winter Garden, that frequent home to now-and-forever-running staples, and it's nearly guaranteed to follow suit.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-BEETLEJUICE-Begins-Its-Broadway-Haunt--See-What-The-Critics-Had-To-Say-20190425"
}
