{
  "showId": "beetlejuice-2019",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2019/04/review-beetlejuice-is-best-when-its-at-its-most-antic.html",
  "publishDate": "April 25, 2019",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nAlex Brightman and Sophia Anne Caruso in Beetlejuice. Photo: Matthew Murphy The Haunted Mansion vibe is on full blast at the Winter Garden, where spooky-carnival pre-show music plays while chartreuse searchlights semi-periodically blind you on your way to your seat and theater staff hawk “It’s showtime!” T-shirts and booze in recognizably striped sippy cups. My usher was sporting a neon-green manicure complete with black-and-white accent nails on each ring finger. (That’s commitment.) Beetlejuice, the rowdy, raunchy musical adapted from Tim Burton’s 1988 horror-comedy, openly embraces the theme park-y aspects of an enterprise like the one it’s engaged in. True to its source material, it’s loud, it’s cheeky, and it’s all about excess. It’s also — thanks in large part to Alex Brightman’s spot-on performance as the incorrigible titular ghoul — a pretty fun time.\n\n“Wait a minute,” you may be saying, “Didn’t you just write about putting a moratorium on male-centric musicals made out of male-centric 1980s films?” Yes. But my issue with so many projects that fall into that category is with the effortful, hypocritical way they tend to shove fundamentally backwards stories into progressive, even preachy modern containers. Beetlejuice is too rude, too gleefully irreverent to preach, and its book by Scott Brown (one of my predecessors in this job) and Anthony King manages for the most part simply to live in its moment rather than protesting too much about it. It’s a cartoon, but a decently smart one, and while the demon at its center is still as brazen and bawdy as ever, he’s an equal opportunity creeper (whose creepiness is even delightfully sent up in the show’s penultimate song, “Creepy Old Guy”).\n\nShow \n 0 Comments / 0 New\n \n Comment\n \n\n Theater: Beetlejuice Is Best When It’s at Its Most Antic\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "dtliExcerpt": "The musical manages to be both faithful to Burton's film and its own beast, a raucous, irreverent comedy that works surprisingly well as a Broadway show.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The musical manages to be both faithful to Burton's film and its own beast, a raucous, irreverent comedy that works surprisingly well as a Broadway show.",
  "contentTier": "complete",
  "contentTierReason": "Short text (26 words)",
  "previousUrl": "https://www.vulture.com/2019/04/theater-review-beetlejuice-on-broadway.html",
  "urlDiscoveredAt": "2026-02-03T15:58:01.901Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 333,
  "archivePath": "data/archives/reviews/beetlejuice-2019/vulture--jesse-green_2026-02-03.html",
  "textFetchedAt": "2026-02-03T15:58:01.910Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "connect ECONNREFUSED 207.241.237.3:80"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 333,
  "tierReason": "Full review text"
}