{
  "showId": "misery-2015",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "http://www.nytimes.com/2015/11/16/theater/review-in-misery-with-bruce-willis-and-laurie-metcalf-the-ghost-of-productions-past.html?_r=1",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup",
    "playbill-verdict"
  ],
  "bwwExcerpt": "Misery' the play is saturated in what feels like an amused, nostalgic distance from its source material. It's as if Mr. Willis and Ms. Metcalf had shown up at the behest of a 'Misery' fan club to share memories of our enjoyment of the book and movie and to chuckle over how they once scared the wits out of us. Even the requisite dark-and-stormy atmospherics (with lighting by David Weiner, sound by Darron L West and creepy music by Michael Friedman) register as gentle, teasing reminders of guilty thrills past.",
  "bwwScore": 6,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Bruce-Willis-Led-MISERY-Officially-Creeps-Onto-Broadway--Updating-LIVE-20151115",
  "showScoreExcerpt": "\"'Misery' the play is saturated in what feels like an amused, nostalgic distance from its source material. It’s as if Mr. Willis and Ms. Metcalf had shown up at the behest of a 'Misery' fan club to share memories of our enjoyment of the book and movie and to chuckle over how they once scared the wits out of us. Even the requisite dark-and-stormy atmospherics register as gentle, teasing reminders of guilty thrills past.\"\n\nRead more",
  "playbillVerdictUrl": "http://www.nytimes.com/2015/11/16/theater/review-in-misery-with-bruce-willis-and-laurie-metcalf-the-ghost-of-productions-past.html?_r=0",
  "fullText": "https://www.nytimes.com/2015/11/16/theater/review-in-misery-with-bruce-willis-and-laurie-metcalf-the-ghost-of-productions-past.htmlShare full articleAdvertisement\n\nThough it is based on one of Stephen King’s most terrifying novels, the stage version of “Misery” will not, I promise, leave you cold with terror. The production that opened on Sunday night at the Broadhurst Theater, which stars a vacant Bruce Willis (in his Broadway debut) and a hardworking Laurie Metcalf, sustains a steady, drowsy room temperature throughout.\n\nNever mind that we start off in darkest, deepest winter in an isolated gothic farmhouse as thunder cracks and lighting flashes. You’re more likely to experience chills sitting in a tepid bath at home.\n\nThis lack of shivers may not bother theatergoers who have bought their tickets simply to see an action hero of the screen in the flesh. Portraying Paul Sheldon, a best-selling novelist who finds himself held captive by a deranged fan who wields a mean mallet, Mr. Willis behaves in much the same way as he does as the indestructible Detective McClane while being tortured, shot at and nearly blown to oblivion in the “Die Hard” film series, for which he is best known.\n\nThat is, he’s a wisecracking, sleepily charming stoic who occasionally flinches or roars when he is subjected to severe pain, but never, ever lets us see that he might be afraid. Even when he’s strapped to a bed, with both his legs broken while the psychopath, played by Ms. Metcalf, hovers over him with a hypodermic needle, we do not doubt that good old John McClane — I mean Paul Sheldon — will prevail.\n\nThe sense of security that such confidence inspires perhaps is not the best foundation for a show meant to be if not outright scary, then at least suspenseful. Mr. King’s original 1987 novel, which I read for the first time only recently, had me on edge for days after I’d finished it. And I knew what was coming, having seen (and leapt out of my seat during) Rob Reiner’s 1990 film, which starred Kathy Bates in an Oscar-winning turn as Annie Wilkes, the role assumed here by Ms. Metcalf.\n\nThe movie was a pretty good fright flick; the novel is something else — an airless, claustrophobic portrait of an egotistic writer pushed to the edge of madness by pain, pills, incarceration, the expectations of his reading public and a deadline like he’s never known before. In the book, our hero is as threatened by the demons within as he is by the madwoman beside his bed. Like him, you the reader can’t wait to escape; yet you can no more walk away from Mr. King’s tightly spun yarn than Paul can walk away from his captor.\n\n“Misery” runs through Feb. 14 at the Broadhurst Theater, 235 West 44th Street, Manhattan; 212-239-6200, miserybroadway­.com. Running time: 1 hour 30 minutes.",
  "isFullReview": true,
  "textWordCount": 461,
  "archivePath": "data/archives/reviews/misery-2015/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T17:23:27.878Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee auth failed: Monthly API calls limit reached: 1250000"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "duplicateTextOf": "nytimes--unknown.json",
  "wordCount": 461,
  "tierReason": "Full review text"
}