{
  "showId": "the-velocity-of-autumn-2014",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "http://www.hollywoodreporter.com/review/velocity-autumn-theater-review-697976?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+thr%2Fnews+%28The+Hollywood+Reporter+-+Top+Stories%29",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "At 86, Estelle Parsons is almost too sprightly and vigorous to fully convey the indignities of aging in The Velocity of Autumn, Eric Coble's two-hander play now receiving its Broadway premiere after a previous engagement at Washington, D.C.'s Arena Stage. Playing Alexandra, a 79-year-old woman armed with dozens of homemade Molotov cocktails who has barricaded herself in her well-appointed Brooklyn brownstone rather than accede to her children's desire for her to move into a nursing home, the Oscar-winning actress delivers a memorable turn in an otherwise forgettable, schematic play.",
  "bwwScore": 7,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-VELOCITY-OF-AUTUMN-Opens-on-Broadway-Updating-LIVE-20140421",
  "fullText": "The Velocity of Autumn Still - H 2014\n\nNEW YORK – At 86, Estelle Parsons is almost too sprightly and vigorous to fully convey the indignities of aging in The Velocity of Autumn, Eric Coble‘s two-hander play now receiving its Broadway premiere after a previous engagement at Washington, D.C.’s Arena Stage. Playing Alexandra, a 79-year-old woman armed with dozens of homemade Molotov cocktails who has barricaded herself in her well-appointed Brooklyn brownstone rather than accede to her children’s desire for her to move into a nursing home, the Oscar-winning actress delivers a memorable turn in an otherwise forgettable, schematic play.\n\nAppearing opposite her is the estimable, two-time Tony Award winner Stephen Spinella as Chris, Alexandra’s long-estranged gay son, who is forced to climb a tree and enter through a window in order to talk some sense into her.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Business\n \n \n \n \n\n \n \n \n \n Broadway Box Office: 'Mamma Mia!' Bids Farewell With $1.8 Million Final Tally \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Lifestyle\n \n \n \n \n\n \n \n \n \n Stephanie Hsu, Michaela Jaé Rodriguez and More Join 'Rocky Horror Picture Show' on Broadway\n\nSTORY: Neil Patrick Harris Scolds Fan During ‘Hedwig and the Angry Inch’ Performance\n\nIt’s not an easy task, as the determined Alexandra is threatening to blow up the building (beautifully represented in Eugene Lee‘s set design, complete with a looming, burnt orange-leaf tree), not to mention possibly many of the others nearby, rather than leave her home. The 90-minute one-act play basically consists of their extended confrontation, during which long-simmering issues rise to the surface.\n\nIt’s a feeble, contrived conceit, albeit one dealing with substantial and sadly relevant issues about the indignities of aging and refusing to go gentle into that good night. Although Alexandra still clearly has her wits about her, she’s all too aware that her body is failing and that her mind is not what it used to be. But she has the wit and good humor to see the bright side, pointing out that she can reread her favorite mysteries without remembering whodunit.\n\nThe play uneasily alternates between jokey, one-liner filled banter — “I will set myself on fire!” threatens Alexandra, only to have her son retort, “I'll bring the marshmallows” — and such darker moments as Chris’ anguished monologue about his recently having failed to act in a crisis involving a horrible accident; hence his desire to make up for it by intervening here.\n\nThat the play staged by Arena Stage’s artistic director Molly Smith works to the extent it does is a testament to the two performers, whose presence no doubt accounts for this slight work’s Broadway mounting.\n\nBoth bring wonderful grace notes, both comic and dramatic, to their roles: Parsons, besides delivering her snappy one-liners with the expert timing of a seasoned vaudevillian, movingly conveys the elderly woman’s vulnerability and frustration over no longer being able to do things that were important to her such as painting and visiting art museums. And although his character is less well-defined — it’s never quite clear why Chris has stayed away from his mother, who considers him her favorite of her three children, for 20 years — Spinella matches her note for note.\n\nBy the time the evening reaches its predictable conclusion (what, you were expecting a fiery explosion?), these wonderful performers have fully invested us in their characters’ emotional reconciliation.\n\nVenue: Booth Theatre, New York (runs indefinitely)\n\nCast: Estelle Parsons, Stephen Spinella\n\nPresented by Larry Kaye & Hip Hop Theatricals, Van Dean & the Broadway Consortium, Joan Raffe & Jhett Tolentino, Michael J. Morit, Jr., Catherine & Fred Adler, Rob Hinderliter & Dominic Laruffa Jr. and Kirn Productions in association with Neal Rubinstein, James Simon & Stephen Ganns/Jonathan Demar and R. Erin Craig & Seilder-Smith/Franklin Theatrical & James Valenti",
  "isFullReview": true,
  "textWordCount": 612,
  "archivePath": "data/archives/reviews/the-velocity-of-autumn-2014/hollywood-reporter--david-rooney_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:11:33.488Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "duplicateTextOf": "hollywood-reporter--thr-staff.json",
  "wordCount": 612,
  "tierReason": "Full review text"
}