{
  "showId": "the-velocity-of-autumn-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2014/04/22/theater/estelle-parsons-with-explosives-in-velocity-of-autumn.html?_r=0",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/04/22/theater/estelle-parsons-with-explosives-in-velocity-of-autumn.html?_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "https://www.nytimes.com/2014/04/22/theater/estelle-parsons-with-explosives-in-velocity-of-autumn.htmlShare full articleAdvertisement\n\nEstelle Parsons, the great actor who stars as an embattled but indomitable Brooklyn painter in “The Velocity of Autumn,” a new play by Eric Coble, seems to be living an eternal springtime. Now 86, Ms. Parsons has lost little, if any, of her energy, and absolutely none of her ability to bring sustained, animated life to a well-drawn character. She never leaves the stage during this 90-minute, two-character play, which opened on Monday night at the Booth Theater, and yet she seems daisy-fresh at the curtain call, as if ready to run a half-marathon as an encore.\n\nIn her determination to continue living her life on her own terms, Ms. Parsons has much in common with Alexandra, the woman she portrays in Mr. Coble’s wispy but amiable comedy-drama about the ravages of getting older, directed by Molly Smith, the artistic director of the Arena Stage in Washington, where this production was first seen. As the curtain rises on a large, lived-in-looking room in Alexandra’s Brooklyn home, it’s hard not to notice one oddity about the décor: Scattered around the floor in clusters are dozens of liquid-filled bottles from which white rags sprout like flowers.\n\nAlexandra, it seems, has decided that if she’s going to be forced by her pesky son and daughter to vacate the premises, she’s going to take the premises with her, after a fashion, by blowing herself up and spreading chunks of brownstone all over Park Slope. Recruited by said son and daughter to foil this desperate act is Alexandra’s other son, Chris (Stephen Spinella), who clambers in through the window as the play opens, while his mother calmly looks on, offering no assistance.\n\nIf you set aside the artificial whimsy of the play’s conceit — the notion that homemade Molotov cocktails would bring down a building, let alone a chunk of the neighborhood, as it is suggested, is a little absurd — it’s possible to enjoy the testy give-and-take between Alexandra and Chris, who have much history to hash over, because he’s been out of touch for the past 20 years.\n\nWhile the conversation occasionally strays into unprofitable byways, the play passes by breezily because Ms. Parsons is such fun to watch, the birdlike squawk in her distinctive voice rising and falling as Alexandra jousts with her son, showing few signs of the mental and physical fragility that have supposedly been of such concern.\n\nYes, she admits to a certain incident at a bridge game, when Alexandra believed players were cheating, and she grew a little violent. And there was something upsetting at the grocery store that Alexandra can’t actually recall. Alexandra also admits that since food doesn’t have much taste anymore, she sometimes goes a day without eating.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 480,
  "archivePath": "data/archives/reviews/the-velocity-of-autumn-2014/nytimes--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:04:50.633Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203843",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203843/https://www.nytimes.com/2014/04/22/theater/estelle-parsons-with-explosives-in-velocity-of-autumn.html?_r=0",
  "contentTier": "needs-rescrape",
  "wordCount": 480,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-04T06:30:18.407Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is truncated and ends with a technical error message about retrieving article content and enabling JavaScript, making it impossible to assess the critic's final verdict.; openai: The text is a mix of a review and a website error message indicating issues with retrieving the full article content.",
  "promptVersion": "5.2.0"
}
