{
  "showId": "9-to-5-2009",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "https://www.newsday.com/news/9-to-5-the-musical-review-with-sally-struthers-f80985",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/little-miss-sunshine-review-good-humor-1.6431169",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "previousUrl": "http://www.newsday.com/entertainment/theater/little-miss-sunshine-review-good-humor-1.6431169",
  "urlDiscoveredAt": "2026-02-04T01:19:49.621Z",
  "urlDiscoveryMethod": "google-serp",
  "fullText": "Ed Staudenmeyer and Sally Struthers in a scene from \"9 to 5: The Musical,\" a Gateway Playhouse production at the Patchogue Theater running from July 18 through Aug. 4, 2012. Credit: Jeff Bellante\n\nWe don't need to guess that Dolly Parton has endured more than her share of leering. It's evident in her show. Inspired by the 1980 film, \"9 to 5\" -- the 2009 Broadway musical now playing in Patchogue -- remains embedded in the '70s, when there was no such thing as a female CEO and men who guarded the glass ceiling were sexist pigs.\n\nThe modern women's liberation movement summoned courage. But \"9 to 5\" treats it as a joke. Picture a civil rights musical comedy in blackface. Take it down a few notches to appreciate the subtlety of Parton and Patricia Resnick, who wrote the rambling \"9 to 5\" book.\n\nThe musical plot re-enacts the movie's. Three unappreciated office \"girls\" bond in revulsion against their boss, played by Edward Staudenmayer like a loathsome Will Ferrell character -- unaware but also unlikable. Carrie McNulty as Violet, the indispensable supervisor without title or equal pay, brings what little distaff dignity the show begins with. Still, she's incomplete without a man, as in the \"Let Love Grow\" duet with an admirer (Peter Carrier). Erica Aubrey as newly divorced Judy finally gets a spine on \"Get Out and Stay Out.\" But for Becky Gulsvig as Dolly alter-ego Doralee, the transformation is problematic. Female colleagues hate her because they buy the boss' claim that he's bedding her. It should earn our sympathy on \"Backwoods Barbie.\" But Gulsvig tries too hard to be country. Overmilking and overmiking conspire to steal her authenticity.\n\nSally Struthers, like a regional theater veteran famous for her TV past (\"All in the Family\"), knows how to milk shtick for all it's worth. In this case, it's worthless until she goes far, far over-the-top. Struthers plays Roz, the sycophant assistant to the boss who'd rather hit on a corpse. But that doesn't discourage Roz's fantasizing, brought to broad (multiple meanings apply) comic effect in \"Heart to Hart\" and a sad confessional about the hours of \"5 to 9.\"\n\nThis busy diversion -- directed by Keith Andrews, choreographed by Gerry McIntyre and accompanied by Andrew Austin's orchestra -- unfolds under the eye of Dolly herself in a projection hanging like a ballroom crystal. She asks that if we don't like the show, \"Keep your mouth shut.\"\n\nWHAT \"9 to 5: The Musical,\" Gateway Playhouse and Long Island premiere\n\nWHEN|WHERE 8 Tuesday night, tomorrow and Friday nights, 2 and 8 p.m. Thursday, 3 and 8:30 p.m. Saturday, 7 p.m. Sunday through Aug. 4, Patchogue Theatre, 71 E. Main St.\n\nINFO 631-286-1133, gatewayplayhouse.com\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nPolice seize $20M worth of cocaine ... Man sentenced in Adventureland stabbing ... Woman pleads guilty to embezzling nonprofit ... Long Beach swimmer\n\nGet more on these and other NewsdayTV stories\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nPolice seize $20M worth of cocaine ... Man sentenced in Adventureland stabbing ... Woman pleads guilty to embezzling nonprofit ... Long Beach swimmer\n\nGet more on these and other NewsdayTV stories\n\nMost Georgia Drivers Have No Idea They Could Do This\n\nThe Newsday app makes it easier to access content without having to log in.\n\nUnlimited Digital AccessOnly 25¢for 6 months",
  "isFullReview": true,
  "textWordCount": 566,
  "archivePath": "data/archives/reviews/9-to-5-2009/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:19:49.625Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 566,
  "tierReason": "Full review text"
}