{
  "showId": "9-to-5-2009",
  "outletId": "timeout",
  "outlet": "Time Out",
  "criticName": "Unknown",
  "url": "http://www.timeout.com/newyork/theater/little-miss-sunshine",
  "playbillVerdictUrl": "http://www.timeout.com/newyork/theater/little-miss-sunshine",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 368,
  "archivePath": "data/archives/reviews/9-to-5-2009/timeout--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:22:02.041Z",
  "originalScore": "2/5",
  "originalScoreNormalized": 40,
  "scoreSource": "star-icon",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140109163350",
  "archiveOrgUrl": "http://web.archive.org/web/20140109163350/http://www.timeout.com:80/newyork/theater/little-miss-sunshine",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Little Miss Sunshine. Second Stage Theatre (see Off Broadway). Book by James Lapine. Music and lyrics by William Finn. Directed by Lapine. With Will Swenson, Stephanie J. Block, Hannah Nordberg. Running time: 1hr 45mins. No intermission.\n\nWilliam Finn and James Lapine reunite to adapt the 2006 family-road-trip indie-film hit Little Miss Sunshine. Will Swenson and Stephanie J. Block are the adult leads; nine-year-old Hannah Nordberg plays their pageant-aspiring daughter.\n\nLittle Miss Sunshine: theater review by Adam Feldman\n\nNot long into their misadventurous 500-mile journey from New Mexico to California, the squabbling members of the Hoover family are forced to disembark and push their malfunctioning van until it gets moving again. The cast of Little Miss Sunshine can surely relate; yet no matter how hard the actors push—sometimes too hard—their musical vehicle stays broken. “When you have very few expectations, things that were once enormous frustrations no longer are,” sings the hapless father, Richard (Swenson), in the first number. “The key to contentment is to lower the bar.” But it’s hard not to expect something better from the team of composer William Finn and writer-director James Lapine, whose previous collaborations have included Falsettos and A New Brain. Both of those shows, however, were written from scratch; here, trying to put the likable 2006 indie film onstage, the authors have failed to adapt.\n\nOne problem is that Finn’s distinctive style, with its choppy rhythms and amusing verbosity, seems inorganic in the mouths of most of the characters (except the heartbroken gay Proust scholar played by Rory O’Malley). Hannah Nordberg is suitably cute as Olive, a spunky elementary-schooler bent on winning a kiddie beauty pageant, but her parents, Richard and Sheryl (Block), are blandly drawn and chemistry-free. And the smallness that makes the movie’s comedy work, the sense of people enclosed together in a rolling room, is defeated by staging that loses any sense of the van as a physical space. Everything is broader and louder—Richard’s miscreant father (David Rasche) now does coke instead of heroin—but the staginess just adds clunk to the exposition. The movie was a quirky hit; the musical’s a big miss.—Theater review by Adam Feldman\n\nTHE BOTTOM LINE This eagerly anticipated new show never clicks into gear.",
  "contentTier": "needs-rescrape",
  "_showNotMentionedDiscoveryAttempted": true
}
