{
  "showId": "9-to-5-2009",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2009/legit/reviews/9-to-5-1200474053/",
  "publishDate": "April 30, 2009",
  "fullText": "In her quiet but deeply moving drama \"Inked Baby,\" Christina Anderson applies a feather-light touch to the tender topic of surrogate child-bearing. Anything heavier than a feather and her fragile characters would surely shatter. In her quiet but deeply moving drama “Inked Baby,” Christina Anderson applies a feather-light touch to the tender topic of surrogate child-bearing. Anything heavier than a feather and her fragile characters — a good man, his unhappy wife and the selfless young woman who agrees to bear a child for her barren sister — would surely shatter. Play’s difficult subject and mercurial moods are mostly respected by Kate Whoriskey (“Ruined”), who helms a tight ship in this Playwrights Horizons premiere, and by a sterling cast that seems to have taken these decent characters right into their hearts. Andromache Chalfant’s austere set of rigidly boxed-off rooms tells us exactly where we are in this bleak emotional landscape — a divided domestic setting where everyone lives in his or her own private little world, safely isolated from everyone else’s suffering. If it weren’t for Jason Lyons’ neon tube lights signaling periodic shifts in the atmosphere, the whole play might be taking place in the womb that Lena (Angela Lewis) has generously agreed to loan out to her older sister, Gloria (LaChanze). Lewis’ open-faced radiance as the younger sister plays beautifully off LaChanze’s guarded take on Gloria, a proud and handsome but damaged woman who has miscarried enough times to mistrust her own last hopes for salvation. Anderson, a 2007 Susan Smith Blackburn Award nominee, writes with a keen sense of the shared intimacy — and unspoken rivalry — in sister relationships. And for all the awkwardness of their roles in this difficult life drama, there is never anything forced about the way Lena and Gloria communicate as siblings. But for all the naturalness of the dialogue and the honesty of the family relationships, this is not exactly a realistic play. That’s apparent from the very first scene, in which Lena and her brother-in-law Greer (played with extraordinary sweetness by Damon Gupton), grapple with the tricky physical logistics of impregnating Lena. Although written and performed with the utmost sensitivity, the tender scene ends with a highly stylized dance of sexual consummation. The same aura of unreality hangs over a subplot in which an industrial waste dump is identified as the source of the long-standing medical problems (multiple miscarriages among them) plaguing the hard-luck black neighborhood where Gloria and Greer have lived all their lives. Whoriskey’s surreal staging of these abstract medical scenes heightens the fear that grips the family when they realize the impact the environmental toxins could have on Lena’s unborn baby. But these eerie sequences are so blatantly bizarre (that stuff coming out of open wounds is … sand?) that they distance us from the hyper-real characters of whom we have grown fond. The dual stylistic strains are more unsettling when they force these finely drawn people to do something out of character. While it’s understandable there would be some household tensions during the long months of Lena’s confinement, Gloria’s early and abrupt mood shift from eager mother-to-be to cranky complainant comes out of left field. And while that plot turn leads to some provocative scenes in which LaChanze (a Tony winner for “The Color Purple”) can strut her stuff as a sexually awakened adulteress, Gloria’s initial discontent is unconvincingly motivated. Anderson is a gifted playwright you want to pay attention to. She has the voice of a poet, and she is generous in lending it to characters who can’t easily articulate the thoughts and feelings that create conflict and pain in their lives. And while she seems a bit self-conscious about writing too realistically, the honesty of her voice and the integrity of her characters should stand her in good stead. A Variety and iHeartRadio Podcast",
  "isFullReview": true,
  "dtliExcerpt": "The show is big, brassy and determinedly upbeat, with a game cast led by Allison Janney that throws itself wholeheartedly into the high-energy proceedings.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The show is big, brassy and determinedly upbeat, with a game cast led by Allison Janney that throws itself wholeheartedly into the high-energy proceedings.",
  "contentTier": "complete",
  "contentTierReason": "Short text (24 words)",
  "textWordCount": 640,
  "archivePath": "data/archives/reviews/9-to-5-2009/variety--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T07:22:27.885Z",
  "fetchMethod": "browserbase",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 1.5,
      "method": "browserbase",
      "success": true
    }
  ],
  "fetchTier": 1.5,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "browserbase",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 640,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-03T10:28:09.095Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "openai: The review is about 'Inked Baby' by Christina Anderson, not the target Broadway show.; kimi: This review covers the Off-Broadway premiere of 'Inked Baby' at Playwrights Horizons, not a Broadway production. The text explicitly identifies the venue as Playwrights Horizons and describes it as a premiere at that Off-Broadway theater.",
  "promptVersion": "5.2.0"
}
