{
  "showId": "living-on-love-2015",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Alexis Soloski",
  "url": "http://www.nytimes.com/2014/07/21/theater/in-living-on-love-renee-fleming-moves-beyond-opera.html?_r=0",
  "publishDate": null,
  "fullText": "https://www.nytimes.com/2014/07/21/theater/in-living-on-love-renee-fleming-moves-beyond-opera.htmlShare full article1515Advertisement\n\nWILLIAMSTOWN, Mass. — When Renée Fleming tweets, she doesn’t confine herself to 140 characters. In the second act of “Living on Love,” a fun and flimsy entertainment at the Williamstown Theater Festival here, she glides into the room warbling sweetly. “Did I just hear the birds singing?” she asks. Then she looses several more soaring notes. “Oh no,” she says, as if surprised, “that was me.”\n\nMs. Fleming, a renowned soprano in her first role in a play, portrays Raquel, an opera diva whose career is crashing. Raquel frets over her declining powers. “How soon till age renders your instrument unexceptional?” she asks herself. “When will you become a mezzo?” Ms. Fleming pronounces the word “mezzo” in the sort of horrified whisper that most people reserve for “cancer” or “syphilis.”\n\nThe playwright Joe DiPietro and the director Kathleen Marshall, who worked together on the Broadway musical “Nice Work If You Can Get It,” have reteamed for this screwball showbiz comedy, an update of Garson Kanin’s 1985 play “Peccadillo.”\n\nIn a Manhattan penthouse so opulent it must give other luxury suites inferiority complexes, Raquel lives with her husband, Vito (Douglas Sills), a hot-tempered Italian conductor with a tendency to hurl silverware when riled. Actually, most characters in the play fling cutlery.\n\nAs Vito’s work has similarly stalled, he’s resolved to make some money and noise by writing his memoir. The publishing house has sent along a ghostwriter, Robert (Justin Long of the “Get a Mac” ads). Problem is, the distractible Vito can’t progress much beyond Page 2, where he reveals how he “made love to the entire humming chorus of ‘Madama Butterfly.’ ”\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"You could call the play featherweight, except that down can get pretty heavy...Right now, there’s no real sense of what Raquel and Vito have meant to each other over the years, so the threats of divorce don’t ratchet up the tension as they ought to. If Ms. Fleming and Mr. Sills could communicate this bond the merrymaking might just matter. It would also help if this oddly chaste sex comedy became rather sexier. In the meantime, though, there’s plenty to divert and amuse. \"\n\nRead more",
  "contentTier": "truncated",
  "contentTierReason": "Only aggregator excerpts available",
  "playbillVerdictUrl": "http://www.nytimes.com/2015/04/21/theater/review-renee-fleming-plays-against-type-in-living-on-love.html?_r=0",
  "sources": [
    "show-score-playwright",
    "playbill-verdict"
  ],
  "textWordCount": 299,
  "archivePath": "data/archives/reviews/living-on-love-2015/nytimes--alexis-soloski_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:03:00.438Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250419032404",
  "archiveOrgUrl": "http://web.archive.org/web/20250419032404/https://www.nytimes.com/2014/07/21/theater/in-living-on-love-renee-fleming-moves-beyond-opera.html?_r=0",
  "textIssues": [
    "Word count too low: 299 (min: 300)"
  ],
  "wordCount": 299,
  "tierReason": "Short text (299 words)"
}