{
  "showId": "bernhardthamlet-2018",
  "outletId": "chicagotribune",
  "outlet": "Chicago Tribune",
  "criticName": "Chris Jones",
  "url": "http://www.chicagotribune.com/entertainment/theater/broadway/sc-ent-bernhardt-hamlet-broadway-review-0926-story.html",
  "playbillVerdictUrl": "http://www.chicagotribune.com/entertainment/theater/broadway/sc-ent-bernhardt-hamlet-broadway-review-0926-story.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "dtli",
    "bww-roundup"
  ],
  "dtliExcerpt": "Bernhardt’s audacious act on both stage and film — then a work of creative sedition that caused critics and patriarchs to splutter with righteous indignation — is the topic of playwright Theresa Rebeck’s lively, weaponized, often confusing and richly caustic new Broadway play, “Bernhardt/Hamlet,” now by the Roundabout Theatre Company with the remarkable classical actress Janet McTeer in the leading role. When the play sticks to the words that reside on the marquee — that would be “Bernhardt-slash-Hamlet” — the work is a fascinating reminder that before any social change becomes mainstream, someone has to be a pioneer, and that someone often twists painfully in a storm until there’s enough supportive wind beneath her wings. So it went with the French-born Bernhardt, who leveraged her own singular stardom to make her Hamlet possible, reminding us that the previously empowered often are in the best spot to do seditious stuff. But only if, like Bernhardt, they have enough guts.",
  "dtliThumb": "MEH",
  "publishDate": "September 25, 2018",
  "showScoreExcerpt": "“Rebeck’s lively, weaponized, often confusing and richly caustic new Broadway play...When the play sticks to the words that reside on the marquee...the work is a fascinating reminder that before any social change becomes mainstream, someone has to be a pioneer...McTeer mostly makes mincemeat of her pliant co-stars...The problem there is that everyone seems so cowed by Bernhardt/McTeer that this works against the main theme of the play.\"\n\nRead more",
  "bwwExcerpt": "Perhaps everyone was worried that would have limited the play's appeal, rendering it nerdy and overly Shakespearean. Come on, it's only the greatest play, ever. I say it would only have deepened its truths, and it would have freed McTeer in the process.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-The-Critics-Weigh-In-on-BERNHARDTHAMLET-on-Broadway-20180925"
}
