{
  "showId": "bernhardthamlet-2018",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Leah Greenblatt",
  "url": "https://ew.com/theater/2018/09/25/bernhardt-hamlet-review/",
  "playbillVerdictUrl": "https://ew.com/theater/2018/09/25/bernhardt-hamlet-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "dtli",
    "bww-roundup"
  ],
  "dtliExcerpt": "It’s enough to know, in other words, that the actress who inhabits her in Bernhardt/Hamlet has serious shoes (or more specifically, suede thigh-high riding boots) to fill. And when Janet McTeer strides in, she feels completely right. Not because the Tony winner and Oscar nominee necessarily resembles her muse: Blond, British, and over 6 feet tall, she hardly could. But at 57, she crackles with the vitality, sensuality, and flytrap wit of a genuinely lived-in diva. And, of course, the vanity: “No one upstages me,” she coos early on, batting away even the idea with a wave of her hand.",
  "dtliThumb": "UP",
  "publishDate": "September 25, 2018",
  "showScoreExcerpt": "“The play’s not really the thing in Theresa Rebeck’s bright, lushly executed showpiece. It’s the first half of her slashed equation: Sarah Bernhardt...Von Steulpnagel keeps the action moving with brisk, chamber-piece choreography...The glue in it all is McTeer...She’s a natural force beneath her leonine pile of gold curls - by turns anxious and imperious, vulnerable and funny and fierce. She’s also the best, most vivid thing in nearly every scene.”\n\nRead more",
  "bwwExcerpt": "Writer Rebeck (Seminar) and director Moritz von Steulpnagel (Present Laughter) keeps the action moving with brisk, chamber-piece choreography: The ingenious set (by Tony winner Beaowulf Borrit) makes the most of its two-plus sides, and supporting players (including Brittany Bradford and Dylan Baker ...",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-The-Critics-Weigh-In-on-BERNHARDTHAMLET-on-Broadway-20180925"
}