{
  "showId": "bernhardthamlet-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2018/09/25/bernhardt-hamlet-what-a-piece-of-work/",
  "publishDate": "2018-09-25T21:52:26",
  "fullText": "In her roughly two dozen plays, Theresa Rebeck has written, in no particular order, a riff on The Oresteia (The Water’s Edge), a takedown of reality TV (Our House), a thriller about stamp-collecting (Mauritius), a backstage comedy built on Kafka and prop-banana jokes (The Understudy), a sexism-in-the-workplace satire (What We’re Up Against), a post-9/11 treatise (Omnium Gatherum, coauthored with Alexandra Gersten-Vassilaros) and a one-woman show about looking for love and the perfect pair of shoes (Bad Dates). Now, continuing her pattern of unpredictability, Rebeck is taking on one of history’s most iconic actresses taking on perhaps theater’s most iconic role in Bernhardt/Hamlet on Broadway.\n\nRebeck could hardly have picked a richer subject: Sarah Bernhardt was charismatic and colorful; she lived large and she loved fame. And, like so many of the most fascinating celebrities in entertainment history (see: Liz Taylor, Judy Garland, and more), she made headlines for not only her onstage performances but also her offstage behavior. Her romance with the decades-younger, married-with-children playwright Edmond Rostand (Jason Butler Harner, saddled with an unfortunate mustache that gives the impression of a perpetual sneer), to which Rebeck devotes a considerable amount of time, could inspire an entire play of its own.\n\nAnd there’s simply no one better suited to embody Bernhardt than Janet McTeer, who first took Broadway by storm more than a decade ago with her titanic Tony-winning turn in A Doll’s House. As soon as the lights go up and she begins soliloquizing—“Oh what a rogue and peasant slave am I!”—we are immediately, completely, utterly, spellbound.\n\nBeyond the inherent allure of dramatizing a play-within-a-play, the Bernhardt that Rebeck shows us is a woman full of fascinating contradictions: she was extremely famous, but famously broke; she had star power to spare, but she still couldn’t write her own ticket.\n\n“She’s a great actress, but Hamlet? It’s grotesque,” sniffs Louis (Tony Carlin), a self-important critic. “If Shakespeare meant for Hamlet to be a woman, he would have named the play Hamlet princess of Denmark.” The hopelessly-devoted Rostand offers a weak explanation: “It is the greatest part ever written and she the greatest actress ever born.”\n\nWhat gets everyone in a tizzy is not that Bernhardt is more than 50 years old and Hamlet, well, isn’t—there’s a long-running joke about Hamlet’s age, something that’s still debated to this day. It’s simply that she’s a woman. No matter how well-reasoned her arguments—“Why shouldn’t I play Hamlet. I am perfectly suited. Nobody cares about his masculinity. So called. They care about the magnificent nuance of his heart”—the idea is not just incomprehensible; it’s actually incendiary.\n\nIn one of the play’s ugliest, and most truthful, moments, Louis puts his finger on it: “A woman with power is a freak. A freak of nature, perhaps, but a freak nonetheless. Shakespeare himself acknowledged it. ‘Unsex me here’ is one of his mightiest condemnations. A woman reaching for power? It’s unholy.” The audience will gasp, but can anyone argue otherwise? He makes this proclamation in a merry, wine-soaked setting: a dinner in Sarah’s dressing room—a gilded boho-glam fantasy, swathed in rich tapestries and draped in sumptuous velvets, courtesy of Tony winner Beowulf Boritt (Act One)—among VIPs including Rostand; her costar, Constant Coquelin (Dylan Baker), who will soon famously originate the role of Cyrano de Bergerac; and the Czech Art Nouveau painter/theatrical portrait-maker Alphonse Mucha (Matthew Saldivar). Nothing kills a party like a critic.\n\nAnd as if Bernhardt versus the world weren’t enough, Rebeck sets up another conflict: Bernhardt versus the Bard. The Divine Sarah seems to be struggling to find her voice within Shakespeare’s multitudes of words. Of course there’s no doubt that McTeer could play Hamlet—or any other breeches role—if she wanted to. Recall her leather-jacket-clad Petruchio, where she whipped Cush Jumbo’s Kate into submission, in Phyllida Lloyd’s 2016 Taming of the Shrew in Central Park. Which raises the question: Why don’t we see more women in traditionally male roles these days? Go ahead. I’ll wait.\n\nAs much as Rebeck’s drama deifies Hamlet—“It’s prayer; it’s incantation. It’s enchantment. It’s a hymn. It’s grace itself,” sighs Rostand dreamily—Bernhardt/Hamlet is less about a great actress playing the Dane than it is about a woman forging her legacy in, put plainly, a man’s world. It may not be the 19th century anymore, but some things never change.\n\nBernhardt/Hamlet opened September 25, 2018, and runs through November 18 at the American Airlines Theatre. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2018/09/25/bernhardt-hamlet-what-a-piece-of-work/"
}
