{
  "showId": "bernhardthamlet-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2018/09/25/bernhardt-hamlet-janet-mcteer-in-teresa-rebecks-almost-ready-play/",
  "publishDate": "2018-09-25T21:50:10",
  "fullText": "Theresa Rebeck was the subject of a recent article in which it was implied that reviewers resisting her output were merely being snarky.  So I’ll have to accept that what is about to be declared here may be received as just some more snark-asm. So be it. It may be, however, that Bernhardt/Hamlet, Rebeck’s latest work, is one of her better plays.\n\nIt isn’t yet, but that may have to do with its being vastly overwritten. What it needed before being put into production was someone like its director, Moritz von Stuelpnagel, or a strong dramaturge to work more closely with Rebeck at maximizing its potential.\n\nRebeck’s title pretty much signals what will go on. In 1897 the great and belovedly histrionic Sarah Bernhardt (no understated Eleonora Duse, she) occasionally played pants roles but nonetheless shocked Paris by announcing she would tackle William Shakespeare’s durable Hamlet—not as Ophelia, whom she’d already embodied numerous times, and not as Gertrude, a role at which she evidently turned up her straight nose.\n\nPortrayed here by the peerless Janet McTeer (Shakespeare’s Petruchio in The Taming of the Shrew is on her resumé), Bernhardt has decided she’ll be Hamlet. As Rebeck writes, the decision doesn’t thrill everyone, and certainly not the married Edmond Rostand (Jason Butler Harner) with whom she is having an affair and whom she pressures to rewrite Hamlet because she thinks the script is in need of improving(!). She couldn’t care less that she’s forcing him to suspend work on his imminent masterpiece, Cyrano de Bergerac.\n\nOther friends and relatives she annoys as she determinedly strides on include the famous illustrator Alphonse Mucha (Matthew Saldivar), who can’t get a handle on the poster for the production, and son Maurice (Nick Westrate), who manages her affairs and worries that their financial straits might only worsen.\n\nMaurice is also not overjoyed about the Bernhardt/Rostand alliance, even as the adulterous couple attempts to keep the bruited scandal quiet. It takes Rostand’s indignantly dignified wife, Rosamond (Ito Aghayere), to see what she can do.\n\nBut that development doesn’t kick in until late in Act Two and after Bernhardt’s intentions are repeatedly argued by her and those around her who are troubled about where things might lead. So as backstage life courses, the to-be-or-not-to-be-Hamlet quarrels go on and on while the lovers tiff, separate temporarily, and reunite for the nonce.\n\nRebeck does distinguish herself with dialogue that frequently zings by. Bernhardt observes that “All theater is ego,” and that amuses the show-biz spectators in the crowd. Defending her estimation of Shakespeare, the actress—who may be the only female Hamlet who’s ever worn a doublet with a pronounced bust line—declaims, “Anybody who writes as often as he did is bound to slip up once in a while.” And Rebeck does know the right moment to have Bernhardt tell Rostand, “I want you to rewrite Hamlet,” a demand that may require the world’s largest exclamation point.\n\nBecause Rebeck can blithely scatter lines like those as she unfolds her intriguing tale, it behooves a reviewer exhausted by the repetitious action to suggest that she rethink the comedy-drama. She might consider either ruthlessly editing it herself or finding someone who can. Were she to come up with a 90-minute redaction, she would likely have herself a potent piece.\n\nAt the moment, her major asset is McTeer, who moves around the stage with the grace and steadfastness of a ripple crossing a stream. With hair cropped and tousled until she puts on a Prince Valiant wig copied by Matthew B. Armentrout from the one Bernhardt sported, she radiates such confidence and authority that she almost makes Rebeck’s excesses evaporate. That’s to say she does what the best actors do under these conditions: she raises the dramaturgical level without entirely saving the proceedings. Bernhardt herself undoubtedly couldn’t have done better.\n\nThe supporting cast—notably Dylan Baker as all-purpose player Constant Coquelin, Tony Carlin (replacing Paxton Whitehead) as critic Louis, Brittany Bradford as Bernhardt’s Ophelia—are strong.\n\nBeowulf Boritt’s notion of a 19th-century backstage is elegant and evocative, especially as lighted by Bradley King. Toni-Leslie James hasn’t spared the expense—or the look of expense—on the costumes. When Bernhardt entertains admirers in her dressing room and therefore needn’t appear in tights, McTeer is in a glittery period gown that Paul Poiret might have concocted at the beginning of his career.\n\nA few years back, Rebeck created the two-season television series Smash. It wasn’t one, but with the proper attention, this one might be.\n\nBernhardt/Hamlet opened September 25, 2018, at the American Airlines Theatre and runs to November 18. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
