{
  "showId": "plaza-suite-2022",
  "outletId": "ap",
  "outlet": "Associated Press",
  "criticName": "Mark Kennedy",
  "url": "https://apnews.com/article/entertainment-travel-arts-and-entertainment-neil-simon-music-reviews-80467519aedcc7b155695ad057fb8e0e?utm_source=Twitter&utm_campaign=SocialFlow&utm_medium=APEntertainment",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "Aside from the odd dated reference - Dr. Joyce Brothers, hello? - and some unfortunate reminders of our current time - like that powerful Hollywood producers using hotel rooms for seduction isn't very funny anymore - 'Plaza Suite' definitely feels more than 50 years old. It's stuck in the mid-20th century with its privileged elites, offering pre-feminist musings on midlife crises and the elusiveness of marital bliss, all over a room service double scotch. It is being staged for the very people who feel the need to burst into applause when they first see John Lee Beatty's gorgeous Plaza set, complete with chandeliers, sconces and timelessly elegant chairs. They know they'll be gently taken care of in here, like guests at a stuffy, hyper-expensive hotel living off its legacy, that has endured. Not challenged or stretched. It is an elegant looking past, yes, but it's time for the new. Today, it has to be new.",
  "bwwScore": 4,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PLAZA-SUITE-Starring-Sarah-Jessica-Parker-and-Matthew-Broderick-Opens-On-Broadway-20220328",
  "showScoreExcerpt": "\"Even the starry union of Matthew Broderick and Sarah Jessica Parker — giving the trio of tales an extra bit of electricity since they are, in fact, married — couldn’t conceal its infirmities...It’s stuck in the mid-20th century with its privileged elites, offering pre-feminist musings on midlife crises and the elusiveness of marital bliss, all over a room service double scotch. It is being staged for the very people who feel the need to burst into applause when they first see John Lee Beatty’s gorgeous Plaza set, complete with chandeliers, sconces and timelessly elegant chairs.\"\n\nRead more",
  "publishDate": "March 29, 2022"
}