{
  "showId": "plaza-suite-2022",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Plaza-Suite/984",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Plaza-Suite/984",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $112\n Buy Tickets\n\nCititour.com Review\n As the saying goes, you truly never know what goes on behind closed doors, Still, few writers had more “thoughts” on this subject than the late Neil Simon, as proven by his 1970 comedy “Plaza Suite.” This triptych of short plays about the vagaries of marriage -- each set in the same suite in the legendary Plaza Hotel (spectacularly designed by John Lee Beatty) -- is now being given an often-uproarious and unquestionably crowd-pleasing revival at the Hudson Theatre, with Sarah Jessica Parker and Matthew Broderick effortlessly embodying the main characters in each work.\n\nIn the show’s original Broadway production, the same strategy was used, with George C. Scott and Maureen Stapleton tackling all three roles. But, as great as those now-legendary actors reportedly were back then, the inspired casting of this real-life married couple does give the production an extra bonus: the pair’s onstage chemistry is both undeniable (whether they’re fighting or kissing) and remarkably authentic.\n\nSadly, there is one major downside to this casting choice, as the audience must engage in a major suspension of disbelief for the first two playlets. In the bittersweet, slightly overlong “Visitor from Mamaroneck,” the rail-thin Parker is supposed to be a blowsy 47-year-old housewife insecure about her desirability, while the now-paunchy Broderick is supposed to be a super-fit 51-year-old businessman. While the pair nail the divisions that can occur between a long-married couple, one wishes the references to both of their weights and ages had somehow been excised. (Parker, who is a decade older than her character, Karen, looks much younger than 47, even from the fifth row!)\n\nMeanwhile, in the very funny second sketch, “Visitor from Hollywood,” the couple play former New Jersey high school sweethearts – she’s now a Hollywood-obsessed housewife and he’s a mega-successful film producer -- who reunite for an afternoon of “catch-up.” But here’s the catch: they are not only supposed to be in their late 30s but are dressed in super-mod fashions. Clad in a Pucciesque dress (by Jane Greenwood) and long blonde wig, Parker actually comes close to pulling this off, while Broderick basically looks like he dressed up as Austin Powers for Halloween.\n\nNonetheless, Parker is a revelation in these two playlets, throwing off Simon’s zesty zingers with pinpoint accuracy while also finding the damaged heart of her characters, and perfectly executing some truly inspired bits of physical comedy (smartly created by director John Benjamin Hickey). \n\nBroderick, while a fine foil for Parker in the first two playlets, truly comes into his own during the last (and most famous) section of the play, “Visitor from Forest Hills.” He is perfection, both verbally and physically, as Roy Hubley, the grumpy, overly money-conscious father of the bride -- who has locked herself in the suite’s bathroom on her wedding day.\n\nIndeed, it’s pure hilarity watching Broderick’s Roy ultimately go to extraordinary physical and emotional lengths to convince his beloved daughter Mimsey (Molly Ranson) to marry her intended groom Borden (Cesar J. Rosado, stepping in for an ill Eric Weigand) – while alternately arguing and teaming up with his beleaguered wife Norma (Parker, still fabulous). \n\nIn fact, if this playlet was presented on its own, it might even arguably be worth the extremely high price many audience members have paid to witness these stars return to the stage and these precious moments of sweet comic genius. \n\n By Brian Scott Lipton\n\nVisit the Sitehttps://plazasuitebroadway.com/CastMatthew Broderick and Sarah Jessica Parker Open/Close DatesOpening 3/28/2022Closing 7/10/2022\nTheatre Info\nHudson Theatre139-141 West 44th StreetNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 643,
  "archivePath": "data/archives/reviews/plaza-suite-2022/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:40:40.727Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 643,
  "tierReason": "Full review text"
}