{
  "showId": "plaza-suite-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2022/03/28/plaza-suite-feels-like-very-old-times/",
  "publishDate": "2022-03-28T20:55:17",
  "fullText": "Fairly early in the endless first playlet of Plaza Suite, the Neil Simon comedy now in revival at the Hudson Theatre, the annoyed executive Sam Nash is showing off his new dental implants to his unhappy wife, Karen. “You don’t think they’re too white, do you?” he asks. “Do they look too white to you?”\n\nThe line jumps out, because, yes, Sam, 50-odd years after its Broadway debut, Plaza Suite is definitely too white.\n\nI don’t mean that purely in the ethnic composition of its characters. With certainly notable exceptions, nearly all theater from before the last few decades is about white people, which means nearly all revivals are. And, sure, there are actors of color working here. (One was an understudy, Cesar J. Rosado, stepping in for some minor characters at the performance I saw.)\n\nBut Plaza Suite feels remarkably, almost obliviously, a product of its era, full of jokes about the demolition of the Savoy Plaza (across the street, where the General Motors Building now stands), secretarial hanky-panky, and lecherous producers jetting in from The Coast. It reflects a different world, a different New York, and even a different Broadway, and it’s hard to think of one good reason why it should have been revived.\n\nBut it’s easy to see two reasons: Its stars, Matthew Broderick and Sarah Jessica Parker.\n\nThe acting couple has appeared on stage together only once before—for a four-month stint in How to Succeed in Business Without Really Trying, when Broderick returned to the lead role. Announced in late 2019, you could see why this pairing seemed so delicious: proud New Yorkers, married for nearly 25 years, playing three different New York couples in three state-of-marriage vignettes, crafted by an iconic New York playwright. They’re even directed by another New York actor, their friend John Benjamin Hickey, in his Broadway directorial debut.\n\nBut as Broderick should have learned from his painfully unfunny post-Producers turn in The Odd Couple, hoary old Neil Simon shtick does not age well. Paired then with his other famous partner, Nathan Lane, the jokes didn’t land and the two divorced men drove no one crazy.\n\nIn Plaza Suite, Simon considers relationships by showing us three pairings, each one checked into Suite 719 of the famed grand hotel. (No word on whether that room still exists after the 2008 renovation that turned most of the building into condos for oligarchs.) The first couple, Sam and Karen, have been married for 23 or 24 years and aren’t holding up well. In the second, a Jersey-born Hollywood poobah returns to New York and tries to spark a romance, or at least a one-night stand, with his high-school sweetheart. And in the final one, Roy and Norma Hubley try desperately to get their daughter, Mimsey, to unlock the bathroom door and head downstairs for her wedding.\n\nBoth Broderick and Parker have worked for many years on stage and screen, but, generally speaking, Broderick is today known as the stage actor of the couple, with two Tony Awards, while Parker is the TV star. And yet it’s Parker who acquits herself best through this trio of one-acts, reminding us that she is a gifted physical performer, as good with the broad strokes of sell-it-to-the-back-row vaudevillian comedy as she is in HBO closeup. Broderick, on the other hand, seems almost miscast in the first two segments.\n\nBut in the third, when the two actors become the desperate Hubleys, Plaza Suite finally hits its stride. (This was true, apparently, even 54 years ago, when Clive Barnes wrote in the Times that “the evening, after a slow start with the first [farce], warms up with the second and ends with an all-stops-out, grandstand finish with the third.”) Finally, Broderick’s slow burn has its fitting subject, Parker’s mugging and timing pays off (as does Jane Greenwood’s outrageous mother-of-the-bride costume for it), and even John Lee Beaty’s characteristically sumptuous, applause-earning set gets in on the action, as beds are hopped upon, chairs are nearly thrown, and Mr. Hubley may or may not careen down seven stories of the Plaza’s facade.\n\nIn the end, Mimsey does leave the bathroom, and Simon’s story has a more-or-less happy ending. Thanks to the well-executed face of this final section, so does the experience of watching it. But, like Mimsey in that bathroom, it’s not quite clear why we’re even doing this in the first place.\n\nPlaza Suite opened March 27, 2022, at the Hudson Theatre and runs through June 26. Tickets and information: plazasuitebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
