{
  "showId": "harry-potter-2021",
  "outletId": "amny-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.amny.com/entertainment/harry-potter-and-the-cursed-child-review-1.18207087",
  "publishDate": null,
  "fullText": "‘Harry Potter and the Cursed Child, Parts One and Two’ plays an open run at the Lyric Theatre. 214 W. 43rd St., harrypottertheplay.com.\n\n“The boy who lived” has made it to New York City with “Harry Potter and the Cursed Child, Parts One and Two,” an unexpected bonus chapter in the extremely popular “Harry Potter” series. Unlike the original seven books by J.K. Rowling and their subsequent film adaptations, it takes the form of an elaborate stage spectacle.\n\nThe play comes to Broadway after premiering in London two years ago. To suit the show, the Lyric Theatre in Times Square has been meticulously renovated to resemble a traditional playhouse.\n\nWritten by Jack Thorne — and based on a story by Rowling, Thorne and director John Tiffany — the freewheeling script resembles a polished piece of “Harry Potter” fan fiction inspired by “Back to the Future Part II.” Some fans may find it to be derivative in nature, but the play still makes for a rousing adventure narrative.\n\nSet approximately two decades after the Battle of Hogwarts, it picks up after the epilogue of “Harry Potter and the Deathly Hallows,” in which Harry (Jamie Parker), Hermione (Noma Dumezweni), Ron (Paul Thornley), Ginny (Poppy Miller) and Draco (Alex Price) watch their children board the Hogwarts Express at Platform 9 3⁄4.\n\nWhereas Harry and Draco were bitter rivals during their school days, Harry’s son Albus (Sam Clemmett) and Draco’s son Scorpius (Anthony Boyle) are close friends who both have strained relationships with their fathers. They set out to improve upon the past by using an illegal Time-Turner to travel in time to save Harry’s classmate Cedric Diggory from death at the hands of He Who Must Not Be Named, which unleashes severe unintended consequences upon the world.\n\nThere are return visits from characters both major and minor — living and dead. Even Moaning Myrtle, guardian of the girls’ bathroom, makes a showstopping cameo.\n\nThe countless special effects — both old-fashioned and high-tech in nature — are stunning, such as when Dementors levitate over the audience (think “Spider-Man”) and when the students morph into adults using Polyjuice Potion.\n\nAside from being able to easily grasp the numerous references in the dialogue, a theatergoer with no prior “wizarding” experience should still be able to have a great time — and may even find the show more enthralling than would a longtime fan who already knows the “Harry Potter” universe inside and out.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 407,
  "archivePath": "data/archives/reviews/harry-potter-2021/amny-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:36:57.597Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250806062801",
  "archiveOrgUrl": "http://web.archive.org/web/20250806062801/https://www.amny.com/entertainment/harry-potter-and-the-cursed-child-review-1.18207087/"
}