{
  "showId": "harry-potter-2021",
  "outletId": "broadway-news",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://broadway.news/2018/04/22/review-harry-potter-cursed-child-brings-magic-broadway/",
  "publishDate": null,
  "fullText": "If massive success on Broadway could ever be a foregone conclusion, “Harry Potter and the Cursed Child” would indubitably be the show to bet on. The two-part play has arrived on Broadway after a West End run, where it is a continuing critical and popular hit. The play has reaped a record nine Olivier Awards in London and continues to run at capacity business with no sign that the ticket-buying juggernaut will ever slow down. So it seems the producers made a sound investment in stunningly retrofitting the Lyric Theatre where “Cursed Child” opened on Sunday to provide a purpose-built home for Harry and friends.\n\nThe commercial success of the production is assured and unsurprising given the international strength of the J.K. Rowlings’ Potter brand in best-selling books, films and video games since the boy wizard made his debut in 1997. What is a complete revelation, and was by no means assured, is the sheer scope and integrity of the accomplished storytelling the authors and entire creative team bring to “Harry Potter and the Cursed Child.” (Rowling, Jack Thorne and director John Tiffany share story credit on the play written by Thorne.)\n\nSet 19 years after the ending of the final book in the series, the play picks up the story with our original hero, Harry (likably played by Jamie Parker), now a middle-aged family man.\n\nPreceded by his older brother, James (who does seem to disappear from the plot), Harry’s younger son, Albus (Sam Clemmett, in a resourceful and varied performance) is off to his first year at Hogwarts. Following in Dad’s epoch-defining footsteps proves to be no fun for Albus who is not yet a natural upholder of his father’s shining legacy. Albus kindheartedly, if somewhat perversely, begins his time at Hogwarts by befriending Scorpius, the son of Harry’s former archrival, Malfoy.\n\nA convincing Anthony Boyle plays the younger Malfoy as someone whose only wickedness is being wickedly bright and loyal to a fault. It is a neat twist to upend our assumptions and make this character central to fulfilling the moral compass of the play. That compass comes into play with the show’s central theme of escaping both the sins and saintliness of fathers. This appears throughout both parts of the play alongside tropes of the time-honored adolescent angst about not fitting in, the repercussions thereof, and what kind of reprehensible grown-up emerges as a result of childhood exclusion from the pack. Spotty parenting bears some blame too, of course.\n\nAnother thematic riff is the idea, courtesy of time travel, that we can alter our fates or at least better understand the impact of our choices — for good or ill. With echoes of “It&#8217;s a Wonderful Life,” the plot bifurcates parts of the narrative, and shakes characters and time periods together into a swirling snow globe of mixed-up adventures. (A well-chosen cast of 40 spins the yarn.) The multigenerational plot is almost Shakespearean in its complications. Luckily for the uninitiated, or merely those who could use a refresher, the program contains a helpful summary of Harry’s world.\n\nHarry’s childhood best friend, Hermione Granger (Noma Dumezweni) is now a collected head of state. (In a nice touch, Harry works for her.) Dumezweni is persuasive as a terse commander leading the good wizard opposition against the encroaching forces of darkness. It did seem a little improbable that both here, and as laid out in the novels, ultracompetent Hermione would end up with Ron Weasley (Paul Thornley), who has aged into an amiable, bumbling jokester. But from time to time we need the comic relief and perhaps Hermione does too. Unfortunately, not all the empowered and engaging female characters are entirely what they seem, as Delphi Diggory (Jessie Fisher) cunningly demonstrates while flirting dangerously with the much younger Albus. However, the parade of super smart women of virtue, which includes Harry’s stalwart and plucky wife, Ginny (Poppy Miller), is fun while it lasts. Even erstwhile villain Draco Malfoy (Alex Price) is driven to bad behavior only through grief for his lost wife.\n\nThe supreme feat that the play pulls off is that none of the stagecraft, gob-smackingly wondrous as it is, forfeits the privilege of us being taken somewhere of our own conjuring. The theatrical magic that unfolds is neither literal nor excessive. (I won’t be describing the treats that await audiences further, having been honorably inducted into the “no spoilers” society.)\n\nThis is largely thanks to director John Tiffany. Since his American debut off Broadway with the indelible “Black Watch,” Tiffany has established himself as a director of singular prowess. His work illustrates impeccable control, and unflagging inventiveness. His longtime collaborator, Steven Hoggett, who is responsible for multiple instances of exquisite stage choreography, once again flanks him here. (We really believe that an inescapable reign of evil is upon us as the cast goose steps amid their swirling cloaks.)\n\nThere is a &#8220;rightness&#8221; to this entirely fantastical world — every element of the staging reinforces our sense that the conventions and rules that govern and advance the story are in accord. I was especially impressed by the use of sound as designed by Gareth Fry, another veteran member of Tiffany’s creative army. The production is so visually stunning, (sets are by Christine Jones, illusions and magic by Jamie Harrison, and video designs by Finn Ross and Ash Woodward) that the stage pictures could entirely steal focus.\n\nInstead, the underscoring of the action through sound and music was so exquisitely deployed (Imogen Heap was the composer and arranger for the play) that the aural surround became inextricable from the overall impact.\n\nThe creative team had high stakes in giving life to Harry Potter on the stage, as they were going up against decades of Potter fandom. When J.K. Rowling created Potter’s world she did so by writing compulsively readable stories for young people that were published in hefty volumes. Single-handedly, she made protracted reading cool for the generations lucky enough to grow up under Harry’s spell. Youngsters lined up with their grudging parents in the wee hours to acquire the latest book in a frenzy unmatched since Dickens was serialized.\n\nThe films that followed pleased the Potter hordes well enough, but cinema makes fantasy explicit, rather than stretching the imagination of the watcher. Making “magic” tangible is harder to achieve in the theater and begs the question of whether it should even be attempted. Blissfully and brilliantly, the creators of “Harry Potter and the Cursed Child” spent millions to achieve unprecedented special effects, but in employing them avoided stripping away an essential sense of almost primitive make-believe.\n\nFollowing the example of the novels, how fitting it is that this two-part play runs a total of five hours and fifteen minutes, including intermissions. (Emancipate yourselves from your screens, young fry!) The time will fly like the wind. How I wish I could once again be that person of nine and three quarters so that “Harry Potter and the Cursed Child” could be my first experience at the theater. My wager is that the lucky young ones who see these plays will be hooked on the theater for life. What could be better than that?\n\n&#8220;Harry Potter and the Cursed Child&#8221; opened at the Lyric Theatre on Sun., April 22, 2018.\n\nCreative: Written by Jack Thorne; Based on an original new story by J.K. Rowling, Jack Thorne and John Tiffany; Music by Imogen Heap; Music arranged by Imogen Heap and Martin Lowe; Directed by John Tiffany; Movement Director: Steven Hoggett; Scenic Design by Christine Jones; Costume Design by Katrina Lindsay; Lighting Design by Neil Austin; Sound Design by Gareth Fry; Video Design by Finn Ross and Ash Woodward.\n\nProducers: Produced by Sonia Friedman Productions, Colin Callender and Harry Potter Theatrical Productions.\n\nCast: David Abeles, Brian Abraham, Shirine Babb, Jess Barbagallo, Olivia Bond, Anthony Boyle, Stephen Bradbury, Lauren Nicole Cipoletti, Sam Clemmett, Will Coombs, Joshua De Jesus, Noma Dumezweni, Jessie Fisher, Richard Gallagher, Susan Heyward, Geraldine Hughes, Edward James Hyland, Bryon Jennings, Katie Kreisler, Joey LaBrasca, Andrew Long, Landon Maas, Kathryn Meisle, Poppy Miller, Jamie Parker, Alex Price, Angela Reed, Dave Register, Adeola Role, James Romney, Nathan Salstone, Malika Samuel, Alanna Saunders, Brooklyn Shuck, David St. Louis, Paul Thornley, Stuart Ward, Madeline Weinstein, Alex Weisman, Benjamin Wheelwright.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1375,
  "archivePath": "data/archives/reviews/harry-potter-2021/broadway-news--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:39:28.852Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.goto: net::ERR_NAME_NOT_RESOLVED at https://broadway.news/2018/04/22/review-harry-potter-cursed-child-brings-magic-broadway/\nCall log:\n  - navigating to \"https://broadway.news/2018/04/22/review-harry-potter-cursed-child-brings-magic-broadway/\", waiting until \"domcontentloaded\"\n"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20180424000510",
  "archiveOrgUrl": "http://web.archive.org/web/20180424000510/https://broadway.news/2018/04/22/review-harry-potter-cursed-child-brings-magic-broadway/"
}