{
  "showId": "harry-potter-2021",
  "outletId": "chicagotribune-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.chicagotribune.com/entertainment/theater/broadway/sc-ent-harry-potter-broadway-review-0422-story.html",
  "publishDate": null,
  "fullText": "“Harry, there’s never a perfect answer in this messy, emotional world,” says the deceased Dumbledore, his portrait talking from the stage. “Perfection is beyond the reach of humankind, beyond the reach of magic. In every shining moment of happiness is that drop of poison: the knowledge that pain will come again.”\n\nYes, dear reader, it surely will. Better, then, to heed Professor Dumbledore and head to the theater.\n\nAs based on a story by J.K. Rowling, Jack Thorne and John Tiffany, written by Thorne and directed by Tiffany with organic, still-magical movement by Steven Hoggett, “Harry Potter and the Cursed Child” opened Sunday night inside Broadway’s gorgeously renovated Lyric Theatre, the second production of a peerless international rollout. It is, at once, a feast of epic theatricality in celebration of the imagination; an immersive coda to the most powerful literary brand of a generation; and a must-see, totally enveloping, thoroughly thrilling chance to experience the global power of shared storytelling at its most robust.\n\nBut what’s the real reason that people are fighting for costly tickets and clamoring to see the leading members of the original London cast perform two consecutive shows with a total running time of more than five hours? What are the real secrets of “Harry Potter and the Cursed Child, Parts One and Two”?\n\nNo, they’re not the plot points and revelations that the producers exhort the audience to keep secret, understandably trying to extend one of the great delights of this show, which is to watch diverse peoples from all over the world around you squirm and cry out with pleasurable surprise as they hear the answers to questions lingering from their youth, back when they still read books with flashlights under the covers. Back before phones killed so much familial feeling. Nor do those secrets involve the plethora of theatrical tricks within a show filled with Jamie Harrison’s magic, which (remarkably) manages to be both extraordinary and old-fashioned theatrical fun for the Muggles.\n\nThe real secrets are of the heart, and they are revealed by Dumbledore, deep in Part Two. They explain everything about why the Potter phenomenon is so intense, long-lasting and, incredibly for these times, still capable of rising above all the usual divisions of race, gender, class and economic circumstance.\n\nMost kids’ literature for the past couple of generations has focused on telling children that they are safe. But as adults well know, even if they usually pretend otherwise, children are not safe in our world. Children learn this fast. By admitting the presence of danger — the inevitability of pain — the great J.K. Rowling signaled to the smart children of the world that she was willing to tell them the truth. And they loved her for it, and they only love her more as they have become adults, many with kids of their own.\n\nOf course, Dumbledore doesn’t stop there. He comes with advice, Rowling’s advice, this show’s advice, on how to be a parent and how to be a kid, which, weirdly enough, involves most of the same stuff: “Be honest to those you love. Show them your pain. To suffer is as human as to breathe.”\n\nIt’s all a version of Lin-Manuel Miranda’s “love is love is love is love is love is love is love is love.” It’s why we go to the theater, and it explains why “Harry Potter and the Cursed Child” will be on Broadway for years, if not decades.\n\nActually, Edward James Hyland’s Dumbledore is just a minor character, really, in a next-generation sequel that begins with a 37-year-old Harry (Jamie Parker) and Ginny (Poppy Miller), along with their friends, Hermione (Noma Dumezweni) and Ron (Paul Thornley), and their frenemy Draco Malfoy (Alex Price), all sending their own kids off to Hogwarts, the parents fearing for the safety and happiness of their children, as parents do, and the kids worrying about how they will live up to their parents’ expectations.\n\nThe two boys at the core of the story — Albus Potter (Sam Clemmett) and Scorpius Malfoy (Anthony Boyle) carry especially heavy burdens, which might explain why Albus is sorted by the all-knowing hat into Slytherin House and why his dad keeps having nightmares about his own youth, staring out at his childhood self. “Cursed Child” does not restrict itself, like the famous novels, to a single year of school. Time is more pliant now. Albus and Scorpius look for allies — maybe Delphi Diggory (Jessie Fisher), will be one, maybe not. But they learn that parentage means everything and nothing. Any more plot than that will just spoil your experience.\n\nI saw “Cursed Child” prior to its opening in London and, in terms of the acting, the principal cast only has improved, especially the fabulous Boyle, whose emotional energy empowers the production, and Dumezweni, whose complexity and moral authority have only risen. This is very much a generous, ensemble experience, as of course were the films. Harry Potter does not fight alone. Inevitably, the New York audience felt slightly less engaged last Wednesday, a consequence of more being now known about the show than originally was the case. But the level of engagement still is astonishing when compared with any other show.\n\nAnd all the things that make “Cursed Child” so theatrically remarkable are only intensified now. The list begins with how Tiffany, Hoggett and the designer Christine Jones carved out a theatrical playing space for the storytelling, something that interacts with what you have in your head and does not compete with the images of the movies. That is, Snape still looks like Snape, Dolores Umbridge like Dolores Umbridge, but when Albus and Scorpius stare out at the intimidating sight of Hogwarts, all Tiffany and his lighting designer, Neil Austin, choose to do is turn on the houselights.\n\nAt that moment, you see Hogwarts inside your mind and you’re struck by the great beauty of both the theater and the people inside, all thinking and feeling as one about the power and limits of love.\n\nChris Jones is a Tribune critic.\n\nJessie Mueller stars in a Broadway ‘Carousel’ that reminds us life is all too short “\n\nFrom 2017: Want Broadway ‘Harry Potter’ tickets? It’s complicated “\n\n‘Dear Evan Hansen,’ ‘Hello, Dolly!’ in Broadway in Chicago’s upcoming season “\n\nRead all of the Tribune’s recent Broadway reviews “\n\n.galleries:after {\n    content: ”;\n    display: block;\n    background-color: #144A7C;\n    margin: 16px auto 0;\n    height: 5px;\n    width: 100px;\n\n}\n.galleries:before {\n    content: “Entertainment Photos and Video”;\n    display: block;\n    font: 700 20px Georgia,serif;\n    text-align: center;\n    color: #1e1e1e;\n\nvar playlist = ‘ct-theater’,\nlayout = ‘autoblurb’,\niu = ‘%2F4011%2Ftrb.chicagotribune%2Fent%2Ftheater’;\nai = ‘0’;",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1105,
  "archivePath": "data/archives/reviews/harry-potter-2021/chicagotribune-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:40:31.452Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "sourceMethod": "scrapingbee"
}