{
  "showId": "harry-potter-2021",
  "outletId": "dctheatrescene",
  "outlet": "DC Theatre Scene",
  "criticName": "Deb Miller",
  "url": "https://dcmetrotheaterarts.com/2018/04/28/review-harry-potter-and-the-cursed-child-at-the-lyric-theatre/",
  "publishDate": "April 28, 2018",
  "fullText": "Amazing bursts of magic that dazzle in the darkness, distinctive characterizations of a host of eccentric, endearing, and evil personalities by an enthralling cast, a complex and compelling tale of spellbinding supernatural phenomena that teaches momentous life lessons for Wizards and “Muggles” alike, and a fully immersive design that transforms the theater and transports the audience into the wondrous world of J.K. Rowling’s beloved children’s stories – Harry Potter and the Cursed Child has it all! Following a spectacular award-winning world premiere in London, the new play by Jack Thorne, based on an original new story by Rowling, Thorne, and Director John Tiffany, makes its blockbuster Broadway debut at the Lyric Theatre after a $33-million themed revamping of the house and a record-breaking $68-million price tag for the production – a two-part five-and-a-half-hour epic that’s well worth every penny spent on it and every second spent at it.\n\nEighth in the Harry Potter series and the first to be presented on stage, the imaginative sequel follows the lives of the well-known figures from Rowling’s preceding novels and film adaptations nineteen years hence, as the 37-year-old Harry, now married to Ginny and the father of three children, sends his teenage son Albus off to study at his old alma mater. The reluctant Albus is joined by his cousin Rose, the daughter of Hermione Granger (Head of the Ministry of Magic, for which Harry also works) and Ron Weasley (Ginny’s brother), all of whom have remained the best of friends since their own school days at Hogwarts. En route aboard the Hogwarts Express, Albus befriends the adorably awkward Scorpius (son of Harry’s long-time adversary Draco Malfoy), both of whom have rocky relationships with their legendary fathers and trouble fitting in at school. Their growing bond leads to a thrilling time-traveling journey, filled with twists and turns, mystery and illusion, didactic messages and moral principles, as the boys attempt to right a wrong from the past (a past that still haunts Harry), battle the forces of darkness, decipher the meaning of the secret prophecy, and come to terms with their paternal legacy.\n\nIn order to maintain all of the surprises and unexpected plot points that unfold, audience members are advised not to read the program’s full list of characters, and, upon exiting the theater, viewers (and reviewers) are handed buttons that urge everyone to #KeeptheSecrets. So as not to spoil anyone’s firsthand experience, suffice it to say that there are appearances by a readily-recognizable roster of favorites from earlier episodes in the saga (uncanny in their resemblance to the ones in the movies, in costumes by Katrina Lindsay and hair, wigs, and make-up by Carole Hancock) and an inventive set (by Christine Jones) that cleverly recreates the familiar locales in the ongoing narrative (along with hidden designs of fantastic faces and monograms to be found in the refurbished theater’s wallpaper and carpeting, and an imposing installation on the building’s exterior). In addition, there is an ingenious use of suitcases and capes (movement by Steven Hoggett); dark and evocative lighting (by Neil Austin), enveloping sound (by Gareth Fry), and eerie music (music and arrangements by Imogen Heap; music supervision and arrangements by Martin Lowe) that create a mood of mystery; and astonishing entrances, exits, and transformations of the figures, and mind-boggling illusions on both the stage and throughout the house that will leave you asking “How’d they do that?” (illusions and magic by Jamie Harrison) – all to the delight of devoted ‘Potterheads’ (who are at an advantage with their extensive knowledge) and newbies who are not as well versed in the subject (but are aided by a synopsis of the seven past installments and a glossary of terms and names included in the program).\n\nThe seven lead characters are portrayed by a stellar team of actors from the original London production. Jamie Parker as Harry Potter, Noma Dumezweni as Hermione Granger, Paul Thornley as Ron Weasley, Poppy Miller as Ginny Potter, and Alex Price as Draco Malfoy deliver spot-on adult versions of the developing personality types and traits that were already discernible in the younger incarnations of their roles in the books and films, and Sam Clemmett as Albus Potter and Anthony Boyle as Scorpius Malfoy bring all the teenage angst and adolescent uncertainty required for their second-generation protagonists. Thornley and Boyle also provide outstanding comic relief with their amusingly geeky characterizations and expressive voices, as does Lauren Nicole Cipoletti, in her hilarious scene as Moaning Myrtle. Other standouts in the supporting cast are Brian Abraham and David St. Louis, and the terrific Jessie Fisher, who skillfully capture the essence of their characters and help to set the otherworldly tone.\n\nUnder Tiffany’s masterful direction, the depth and richness of the characters’ emotions and psychology are never lost amidst the captivating spectacle. There is a fine balance between surreal fantasy and universal feelings, with the important themes of love, family, friendship, and support underlying all of the story’s dramatic action and staggering illusion. With Harry Potter and the Cursed Child you will not only relish the unsurpassed production values, you will also take away from this truly superlative work a valuable moralizing lesson that is not just limited to the illustrious students of Hogwarts.\n\nRunning Time: Part One approximately two hours and 40 minutes, including a 20-minute intermission; Part Two approximately two hours and 35 minutes, including a 20-minute intermission.\n\nHarry Potter and the Cursed Child plays at the Lyric Theatre – 214 West 43rd Street, NYC. For tickets, purchase them online.",
  "showScoreExcerpt": "\"Amazing bursts of magic that dazzle in the darkness, distinctive characterizations of a host of eccentric, endearing, and evil personalities by an enthralling cast...Under Tiffany's masterful direction, the depth and richness of the characters' emotions and psychology are never lost amidst the captivating spectacle. There is a fine balance between surreal fantasy and universal feelings...unsurpassed production values...truly superlative work.\"",
  "originalScore": null,
  "source": "show-score",
  "sourceMethod": "archive",
  "scoreSource": "sentiment-strong-positive",
  "scoreConfidence": "medium",
  "archivePath": "data/archives/reviews/harry-potter-2021/dctheatrescene--deb-miller_2026-02-03.html",
  "textFetchedAt": "2026-02-03T02:02:20.282Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "contentTier": "complete",
  "wordCount": 918,
  "truncationSignals": [],
  "garbageFullText": "newsfast on January 2, 2026 The University of Warwick has announced the launch of a new spin-out company, VerIQ Limited, to transform how medical device and health technology clinical trials are designed, initiated and delivered across the UK. Formed in partnership with University Hospitals Coventry and Warwickshire (UHCW) NHS Trust, VerIQ will combine Warwick Medical School’s world-leading academic and clinical research expertise, providing an integrated national clinical trial platform that enables faster, higher-quality, and more cost-efficient evaluation of novel medical technologies. “VerIQ harnesses the success and strength of our scientific leadership and showcases the impact that academic–industry collaboration can achieve,” said Dr Tim Hart, Director of Warwick Innovations. “By enabling this new company to commercially leverage Warwick’s existing capabilities and expertise, we can help position the region and UK at the forefront of global Medtech innovation and evidence generation.” The launch of VerIQ supports the UK governments’ ambitions to make the UK the destination of choice for health technology development and evaluation, accelerating the pathway for innovation adoption within the NHS and improving patient outcomes. “When having surgery, our patients want access to the best technology available,” added Warwick Medical School Professor and UHCW orthopaedic surgeon Andy Metcalfe, Chief Medical Officer at VerIQ. “We need to deliver world-class studies that makes the UK the first place to come to for medical innovation. VerIQ will deliver efficient, high-quality medical research to ensure that patients get access to new technologies quickly and safely, improving their care and outcomes.” The spin-out will create an integrated clinical ecosystem that supports Medtech innovators – from early-stage start-ups to established multinational manufacturers – to design, launch, and execute clinical studies with unprecedented speed and scientific rigour. “The UK has the talent, infrastructure, and regulatory framework to lead the world in Medtech innovation,” said Dr Joe Dupere, Chief Executive Officer of VerIQ Limited. “VerIQ Limited will transform proven research excellence into an agile commercial platform, helping to ensure that life-changing technologies reach patients faster, without compromising scientific integrity.” Warwick brings extensive experience in translational research and clinical trial design, supported by strong partnerships with NHS Trusts and national health technology evaluation programmes. Initial work through VerIQ will focus on orthopaedics and wider Medtech trials, combining Warwick’s academic leadership with the new spin-out’s dedicated operational capacity to streamline trial start-up, accelerate participant recruitment, and deliver consistent, high-quality data. For more information please contact: About the University of Warwick Founded in 1965, the University of Warwick is a world-leading institution known for its commitment to era-defining innovation across research and education. A connected ecosystem of staff, students and alumni, the University fosters transformative learning, interdisciplinary collaboration and bold industry partnerships across state-of-the-art facilities in the UK and global satellite hubs. Here, spirited thinkers push boundaries, experiment and challenge convention to create a better world. VerIQ Limited is a UK-based Medtech clinical trial accelerator built to unlock faster, higher-quality clinical research. Through a coordinated network of pre-qualified trial sites, research nurses, and clinical investigators, VerIQ enables rapid study set-up, accelerated recruitment, and consistent data quality. Backed by a leadership team with deep expertise in complex and innovative trials, VerIQ partners with Medtech developers — from early innovators to global multinationals — to design and deliver clinical studies on time and on budget",
  "garbageFullTextNote": "Wrong content: [ensemble-majority] | 2/3 models agree: Mixed | Claude: This text appears to be ",
  "contentTierReason": "Wrong content detected - cleared for re-scrape and re-score",
  "isFullReview": true,
  "textWordCount": 918,
  "textQuality": "full",
  "textStatus": "complete",
  "archiveOrgTimestamp": "20210614202558",
  "archiveOrgUrl": "http://web.archive.org/web/20210614202558/https://dcmetrotheaterarts.com/2018/04/28/review-harry-potter-and-the-cursed-child-at-the-lyric-theatre/",
  "tierReason": "Full review text"
}