{
  "showId": "harry-potter-2021",
  "outletId": "deadline-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://deadline.com/2018/04/harry-potter-and-the-cursed-child-broadway-review-j-k-rowling-jack-thorne-1202367117/",
  "publishDate": null,
  "fullText": "Like any magic worth an incantation, Harry Potter and The Cursed Child, opening on Broadway at the Lyric Theater tonight, depends on unspoiled illusions, a delight in life&#8217;s wonders and the skills to present it all as if no one had ever even considered its combinations before, much less pulled them off. I won&#8217;t spoil any illusions &#8211; the production itself handles the rest. Cursed Child is a marvel, a shape-shifting play that effortlessly incorporates music and choreographed movement, classic storytelling and fresh perspectives, a look that incorporates World War II-era Britain and Victorian spiritualism with Hollywood&#8217;s latest flash. In a Broadway season of award-worthy revivals, this tale of whatever happened to The Boy Who Lived feels bracingly, piercingly new.\n\nRelated Stories\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\n\t\n\t\n\t\t\t\t\t\n\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\n\t\t\n\t\t\n\t\t\n\t\t\t\t\t\n\n\t\n\n\tNews\n\t\n\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\t&#039;Made In Korea&#039; Renewed For Second Season At Disney+, Release Date For S1 Unveiled -- APAC Showcase\t\t\n\t\t\t\n\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\n\t\n\n\t\t\t\t\t\t\t\n\n\n\t\t\t\n\t\n\t\n\t\t\t\t\t\n\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\n\t\t\n\t\t\n\t\t\n\t\t\t\t\t\n\n\t\n\n\tNews\n\t\n\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\tKorea-Japan Series &#039;Merry Berry Love&#039; Set At Disney+, Stars Ji Chang-Wook & Mio Imada -- APAC Showcase\n\nA year after sweeping Britain&#8217;s Olivier Awards, this two-part, five-hour adventure into the Potter universe and the bonds and breaks of family and friendship arrives on Broadway with all its enchantments intact, melding intricate, spellbinding storytelling with stagecraft that brings classic illusions into line with the demands of audiences used to all sorts of convincing special effects and digital hocus pocus. Cursed Child is as much about &#8211; to quote a character from Angels in America some blocks away &#8211; the magic of theater as it is a gift to the legions who grew up (or grew old) reading and watching the Potter books and movies.\n\nAnd, frankly, those of us who didn&#8217;t. I have a just-more than passing familiarity with the film franchise starring Daniel Radcliffe, less so the J.K. Rowling seven-novel series on which it was based. Consider it part of this play&#8217;s wizardry that even a Muggle as ignorant in Potter lore as I am can follow the remarkable sweep of Cursed Child with barely a moment&#8217;s confusion, and certainly not even that much resistance.\n\nWritten by Jack Thorne, based on an original story by himself, Rowling and John Tiffany (who directs with an attention and execution that give equal force to moments intimate and spectacular), Cursed Child is the eighth story &#8211; and considered canon, for those who care about such things &#8211; in the Potter series, and the first to be presented on stage.\n\nThe Broadway staging brings the principal cast from the acclaimed West End production, and the ensemble&#8217;s chemistry and harmony is no small element of the overall magic.\n\nJamie Parker plays Harry Potter, grown now and settled into a bureaucratic gig at the Ministry of Magic, seeing off the second of his sons &#8211; the winning Sam Clemmett&#8217;s Albus Potter &#8211; to Hogwarts School of Witchcraft and Wizardry 19 years after the main events of the series (and opening with the scene that ended Harry Potter and the Deathly Hallows). Resentful of having to live up to the exalted, legendary reputation of The Boy Who Lived, Albus immediately becomes best friends (or something more? There are moments&#8230;) with Scorpius Malfoy (Anthony Boyle, star-making), the son of Harry&#8217;s old nemesis Draco Malfoy (Alex Price).\n\nWithout giving away more than anyone should, I&#8217;ll say that the main action of Cursed Child involves the time-leaping rule-breaking escapades of Albus and Scorpius, who, along with an equally rebellious friend of spirit &#8211; a blue-and-silver haired young woman named Delphi Diggory (Jessie Fisher) &#8211; set off to various pasts to right one of the series&#8217; most heartbreaking wrongs. The Butterfly Effects &#8211; ingeniously providing Rowling aficionados with several alternate realities once only imagined &#8211; get progressively worse, until the play and the Potterverse arrive at a present that can only be called a Reich That Must Not Be Named.\n\nThat&#8217;s about as much plot as I&#8217;m inclined to give away, and it&#8217;s only one thread of many unspooled over the course of five hours (the two parts can be seen on the same day or separate evenings). The play adeptly weaves together storylines and the familiar, now middle-aged, Potter characters &#8211; Hermione Granger (Noma Dumezweni), Ron Weasley (Paul Thornley), Ginny Potter (Poppy Miller) &#8211; with the offspring, a balancing act that itself seems some sort of legerdemain.\n\nAnd while we&#8217;re on the subject, the spell begins with Broadway&#8217;s Lyric Theatre itself, where a splendid renovation (reportedly at a cost of $33 million) transformed the one-time home of Spider-Man: Turn Off The Dark into something closer to a classic opera house, with deep reds, golds and royal blues, Potter-specific details everywhere the eye falls, from the symbol-laden carpeting to the winged creatures perched around the ornate interior.\n\nThe setting provides a perfect preamble to Christine Jones&#8217; set, a stark battleground of dark versus light, where vintage luggage can signify a train station (evoking, like the fascistic goon squads to come, wartime Europe), and, upended, the gravestones of a barely remembered cemetery. Ever-moving staircases &#8211; think of those wheeled contraptions used to reach upper shelves at bookstores &#8211; are pushed and pulled into an endless variety of configurations, the cast traipsing from one to another without so much as a pause or glance at the feet.\n\nThe production&#8217;s magic is hardly limited to well-choreographed transitions, though, with illusions ranging from the seemingly high-tech &#8211; lightning streams of flame, or a dreamlike effect that has the entire set shimmering with every jump in time &#8211; to age-old stage trickery modernized and perfected (unseen hands in black tote levitating actors, while some bat-wing swirls of Hogwarts cloaks all but demand a voila!). In theory, a visit from the wraithlike Dementors &#8211; relax, I&#8217;m not saying when, how or why &#8211; owes a nod to a hoary old Roger Corman gimmick, but the similarity ends with intent: The execution here is genuinely thrilling.\n\nAnd yet with all that spectacle, Cursed Child never feels like a theme park attraction, its captivating story &#8211; plot, dialogue, character development &#8211; widening to encompass the large-view scope of fantastical adventure and then shrinking to intimate moments between fathers and sons, friends and friends, wives and husbands, relationships defined by resentments and loyalties, anger and compassion, and love that can lose itself in expectation and disappointment. Harry Potter and The Cursed Child summons it all. Voila.\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nDeadline is a part of Penske Media Corporation. &copy; 2025 Deadline Hollywood, LLC. All Rights Reserved.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1073,
  "archivePath": "data/archives/reviews/harry-potter-2021/deadline-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:46:05.016Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251113162152",
  "archiveOrgUrl": "http://web.archive.org/web/20251113162152/https://deadline.com/2018/04/harry-potter-and-the-cursed-child-broadway-review-j-k-rowling-jack-thorne-1202367117/"
}