{
  "showId": "harry-potter-2021",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://ew.com/theater/2018/04/22/harry-potter-and-the-cursed-child-broadway-review/",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nHarry Potter and the Cursed Child conjures the impossible on Broadway: EW review\n\nBy\n Marc Snetiker\n \n\nMarc Snetiker\n\n\n\n\n \n\n\n \n\n \nMarc Snetiker is a former senior editor at Entertainment Weekly. He left EW in 2020.\n\n\n\nEW's editorial guidelines\n\n\n\nApril 22, 2018 8:54 p.m. ET\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nREACT\n\n\n\n\n   \n\n\n\n\n   \n\n\n\n\n   \n\n\n\n\n   \n\n\n\n\n   \n\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\n\n \n Credit: Matthew Murphy\n\n For almost a decade, J.K. Rowling’s Harry Potter series lay dormant, a completed masterwork — there would be no further tale in the saga of the courageous wizard. Rowling ended her series in 2007 with finality, not the least of which because the coda to the superior Harry Potter and the Deathly Hallows established a definitive canon with three key words: “Nineteen years later.” Rowling took Potter from 18-year-old conquerer of evil to 37-year-old father of three, a satisfying, happy, limitless ending for the maturation of the boy who lived, and that was fine. All was well. Then along comes Harry Potter and the Cursed Child, a play written by Jack Thorne based on a story by Thorne, director John Tiffany, and Rowling. It bears a loaded billing — “the eighth Harry Potter story” — and its very unlikely and unparalleled existence shook a fandom, sent ripples through three industries, and confirmed a hope for a population of fans: this story is not over yet.\n\nHarry Potter and the Cursed Child is a theatrical marvel, for so many reasons. It’s the biggest franchise title to ever come to Broadway, continuing in New York the momentum of an exorbitantly successful home run in London’s West End. It’s the most expensive non-musical play ever produced on Broadway. It’s a five-hour beast of a show, in a 1,600-seat beast of a theater, with a 40-person beast of a cast by a creative team that includes the most famous living author of our time. Fantastic beasts, there are a lot. The play, which opened Sunday at Broadway’s newly-renovated Lyric Theatre, is so massive, it’s best to examine it as two lofty halves: Parsed as a text, Cursed Child is a theme-park whirligig that dizzyingly checks all the boxes you’d expect to see of a show that bears the famous Potter name; parsed as a production, it’s a technical achievement that redefines the possibilities of theatre. Strong performances and touching themes make it a worthy play, but magical showstoppers, in lieu of musical numbers, transfigure it into something else entirely.\n\nThe play picks up during the epilogue of Deathly Hallows, as a grown Harry (Jamie Parker) is shepherding his youngest son, Albus (Sam Clemmett), off to his first year at Hogwarts. Now a stressed Ministry of Magic official, Harry teeters on vicarious enthusiasm as he loads his middle child up with expectation for the life-changing potential of the wizarding school, adding to the weight that Albus Severus Potter already shoulders from the three substantial names he resentfully bears. Joining the beleaguered teenager on his inaugural trip on the Hogwarts Express are Rose Granger-Weasley (Susan Heyward), the popular daughter of joke-shop owner Ron Weasley (Paul Thornley) and Minister for Magic Hermione Granger (Noma Dumezweni), as well as the anxiety-ridden Scorpius Malfoy (Anthony Boyle), who carries a troubling burden of his own as the outcast son of Draco (Alex Price), Harry’s perennial rival at school (and now, the office).\n\nTo say any more of what happens next, in Cursed Child’s tantalizing first sequence or otherwise, is to disobey Rowling and producers’ plea to keep the show’s many secrets — understandably so, as much of the drama is unlocked by the continued revelation of one Easter-eggy development after another — but what follows is a complex if convoluted tale of sons disobeying fathers, fathers disappointing sons, political peril, existential dread, escapes, break-ins, duels, curses, centaurs, Dementors, and a reckless magical artifact to weave it all together.\n\nThe show, for its many twisty turns, belongs squarely to its most consistent leads, its equally cursed children: Boyle and Clemmett, two fine English actors who, at 23 and 24, are as exceptional a leading pair as those Mormon boys or Wicked girls. Reprising their West End roles, both young men are formidable individually but meteoric together, specifically in their happy seizure of the central theme of this and Rowling’s saga in general: friendship. Good friendship. The kind of friendship that trounces ostracization, that vanquishes evil, that draws power from the triumph of an inside joke as much as a shared tragedy. Boyle plays Scorpius, ostensibly Hogwarts’ biggest outcast, with a ferocious nerve and mischievous wit; he’s funny and heartbreaking and applies a vexing if effective quantity of outbursts to service his character’s epiphanic moments. Clemmett, on the opposite hand, is an understated wonder; as the embittered but well-intentioned Albus, he has the less showy and perhaps more prohibitive role, but with a boyish charm Clemmett adroitly dodges pratfalls of teenage anguish and “Ugh, dad!” resentment to remain hugely likable and empathetic even as he creates disaster after disaster for himself. The sparks the two actors create together are so dynamic, their occasional absence onstage does not go unnoticed.\n\nThat’s not to say the trio of actors playing Harry, Ron, and Hermione are any less captivating when it’s the adults’ turn to [redacted for secrecy]. With lofty expectations of their own to meet bound to the titles they’ve inherited, Parker, Thornley, and Dumezweni gingerly place a layer of measured reinvention atop a firm 20-year canon to become, like it or not, your new golden trio. Reprising London roles has only strengthened the consanguinity between the performers, who believably extend the tics and ambitions of the young wizards into 40-year-olds as credible in their matured convictions as they were in their nascent teenage ones. Thornley’s Ron is the most instantly achievable, accessible, and shockingly true to established character (perhaps because here, Ron exists chiefly as comic relief). Dumezweni stuns as a Hermione who is both cold and warm, hardened by politics, softened by parenthood, a brilliant enigma dealing with the frustration of a problem she cannot solve. Parker had a hell of a time figuring out which of the many slices of Harry Potter would have risen to dominate his personality in adulthood; ultimately the actor excels at showing this grown-up Gryffindor as a brave but stunted man, outwardly successful but inwardly tormented and no less free of the trauma that defined his coming of age. Parker’s tragic performance is exquisitely classic and offers a cogent, necessary baseline for the entire production, akin to the way a troupe of England’s finest actors grounded the fantasy of the 2001-2011 Potter film series. It’s on his serious shoulders that much of the drama rests (although, in one particularly ingenious sequence, Harry, Ron, and Hermione bound around the stage like children once again, an almost miraculous change of tone that marks the show’s most wickedly gleeful moment.)\n\nElsewhere in the principal cast, Poppy Miller’s Ginny is a fine foil, sidelined but significant in fleeting adventures of parenting (very much reflective of Ginny’s supporting role in the series itself). Alex Price’s Malfoy has swapped the onetime-villain’s whines for thankless grumps; his trajectory with Scorpius is finely crafted if underserved, touching and pensive in its limited time. The rest of the cast abounds with well-conceived new characters (like Rose) and delightfully interpreted old ones (a safe reveal, let’s say, is the scene-stealing Moaning Myrtle); the adroit ensemble fills in the key gaps of Hogwarts and the wizarding world with swift, stylish tonal landgrabs, floating tableaus filled with suitcase choreography and cloak-swishing by movement director Steven Hoggett. Grammy winner Imogen Heap’s broody score is quite successful, effectively reestablishing director John Tiffany’s equal-parts eerie and nostalgic mood frequently throughout the four-part, five-hour show.\n\nOf the many remarkable aspects of Harry Potter and the Cursed Child, one of the strongest is the show’s disarming ability to evoke a previously untapped level of emotionality for Potter fans — and here’s where this review gets a bit tricky. Thorne’s equivocal script, even with Rowling’s thick brushstrokes, has been dismissed by some as a fan-fiction wonderland, yet it also unlocks new points of view, particularly in the show’s climax, that are wholly unique to this play, unable to be replicated no matter how countless one’s consumption of the books or movies. Oft-referenced elements of Harry’s life that are second-nature to fans are here reexamined in a way that will inexorably change them for deep lovers of the franchise; for this swath of audience members, the emotional revelations in the fourth act are worth the entire encyclopedic journey. There is a fundamental limitation, then, in the participatory potential for non-Potter fans attending this show. Yes, they can see it, and yes, they can enjoy it, but to what end? The universal entry points are the resplendent acts of magic and the pathos of the paternal storylines — anchors throughout the five-hour experience, but only anchors nonetheless. Between them, audiences are either in this world or out, and the show’s heavy reliance on fallen characters, familiar scenarios, and gasp-inducing name-drops has only a small likelihood of registering with an audience member who has never heard of Dumbledore, much less can spell his name. Perhaps another reviewer who falls into this category can advise whether I’m right, but the barrier of access feels more and more apparent with each passing act. And yet, with the same zeal I will say this: If you’ve purposely avoided reading or seeing any pieces of the Potter franchise, your potential alienation at Cursed Child is not reason enough for this show to be muggled down on your behalf.\n\nFar kinder than I am, though, the creative team anticipated this estrangement problem and committed powerfully to magic as the great equalizer here, the key to making sure that even the most disconnected audience member can at times be as enraptured as any major Potter fan by the wonder of Cursed Child. With every magic trick — a phrase that feels reductive and yet, is precisely accurate for the dozens of casual illusions that populate the stage — the crowd bears witness to something spectacular, something that dares you to challenge your expectations of what’s possible to be done in the theatre. Given what Cursed Child’s design team has accomplished on a technical level, Broadway will never be the same (certainly not as long as this show runs, which might be worth checking in on in another 19 years). The show’s illusion and magic designer Jamie Harrison and special effects chief Jeremy Chernick are certain geniuses. The sets are minimal but extravagant, a strange combination that shows a mark of artistry from designer Christine Jones, with game-changing lighting from Neil Austin (not so much for aesthetic as for sheer function) and well-utilized, restrained video by Finn Ross and Ash Woodward. If cleverness got Harry, Ron, and Hermione out of many a dire situation, Cursed Child carries well the Potter mantle of the importance of practical brilliance.\n\nIn the speculative years between the initial announcement of the play and the first curtain in London, Rowling insisted that this chapter in Harry’s story had to be told onstage. Cursed Child, with all its kinetic timelines, elegant theatricality, and tangible magic, confirms the author’s unique appeal (and director Tiffany’s continued innovation), but it also brings up a queer case of chicken-and-egg: if it weren’t to be told onstage, should this story even exist? Would this surprise eighth Harry Potter tale—which introduces necessary arcs for Harry and Draco’s sons but also teases and erases and truncates a canon for a singular marathon of entertainment—work as a full novel? It’s a tricky quandary, a double-edged wand, if you will, that charms and kills; and the answer, for my part, is no. But this creation does exist, and the hazard of speculating about alternate reality is clearly a key lesson worth taking from Cursed Child. We’re better off to live and luxuriate in this electric moment for Broadway, where there is real magic to do, real rarified air to breathe in the majestic Lyric Theatre, where an unprecedented extension of a beloved world is making something so impossible feel so much realer than it ever could be. It’s an experience as singular, extraordinary, and unforgettable as, say, seeing a boy with a lightning-shaped scar. A",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 2033,
  "archivePath": "data/archives/reviews/harry-potter-2021/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:46:39.869Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "sourceMethod": "scrapingbee"
}