{
  "showId": "harry-potter-2021",
  "outletId": "exeuntnyc-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://exeuntnyc.com/reviews/review-harry-potter-cursed-child/",
  "publishDate": null,
  "fullText": "Harry Potter and the Cursed Child casts a spell. But Kev Berry asks at what cost? Lessons of Hogwarts (Photo: Matthew Murphy) I would take a bullet for the entire cast of Harry Potter and the Cursed Child, the stunning new theatrical experience that opened at the Lyric Theatre. Whether this is based on childhood nostalgia for the characters these performers are portraying or simply because they’re giving fully badass performances in this truly wild play is still to be determined. Walking into the Lyric, there’s an instantaneous shift. Forget 43rd Street. It’s like you’ve apparated somewhere entirely new. Where there once was a coat check, there’s now a sweetshop selling Bertie Bott’s Every Flavor Beans. There’s a photo-op mural of various Patronuses. They’re selling butter beer. And inside the theatre, the Great Hall of Hogwarts with its arches and light fixtures extends out over the audience, immediately bringing us into the world of the play. If none of this sounds familiar to you, you might think that Harry Potter and the Cursed Child, a five-and-a-half-hour two-part epic that picks up right where J.K. Rowling’s cultural phenomenon left off, is not for you. Sure, the references that make those around you gasp might go right over your head. But when the play chooses to focus on the love of a parent for their child, or on a son’s desperation to carry out his father’s legacy, or on just being a thrilling adventure story, it’s impossible to not get drawn in. For those who might hyperventilate when Neville Longbottom’s name is mentioned, this play is definitely for you. The press has been encouraged to #KeepTheSecrets of the plot, so I’ll have to be as vague as possible here. 19 years after the end of the final novel, Harry (Jamie Parker, please adopt me) and his wife Ginny (Poppy Miller, my queen) are sending their son Albus (Sam Clemmett) off to their alma mater Hogwarts School of Witchcraft and Wizardry. Harry’s best friend and Ginny’s older brother Ron (Paul Thornley) is married to Harry’s other best friend, Hermione Granger (Noma Dumezweni) who are sending their daughter Rose (Susan Heyward) off to Hogwarts as well. On the train to Hogwarts, Albus meets and immediately connects with a boy named Scorpius (Anthony Boyle, giving a jawdropping performance), who is the son of – yep, you guessed it – Harry’s enemy from his days at Hogwarts, Draco Malfoy (Alex Price). Neither Scorpius nor Albus find themselves succeeding or fitting in at Hogwarts. From there, the play sets itself up as a sobering examination of what happens when a child doesn’t follow the path a father expects of them and the lengths to which a father will go to protect his son. The physical staging of the cinematic Potter universe by director John Tiffany is seamless, and the emotional performances are deeply specific to each character. The cast brings these familiar characters to life in a way that does not shun what we know of them in the zeitgeist, but rather brings something new. We see these characters as their lives have played out in the 19 years since the final Battle of Hogwarts, and they’ve changed. Harry’s grown into a father struggling to let his son know how much he cares for him, Ron’s become a great dad, and Draco Malfoy is willing to give the world up for his next of kin. It’s a perfectly cohesive representation of where these characters might have gone. Noma Dumezweni, Jamie Parker, and Paul Thornley (Photo: Manuel Harlan) Jamie Parker as Harry shines. There is so much tenderness and love in his performance that it allows his moments of ferocity to shine. When Clemmett’s Albus and he are fighting, it is clear how much Harry wants the best for his son, regardless of whether or not he lives up to the family name. Additionally, Anthony Boyle as Scorpius plays the loser so well. From his first lines, yelled with the jarring shriek of a kid who doesn’t have many quality social interactions, you’re rooting for him. His performance is grounded deeply in being an outsider, and it’s a joy to watch Scorpius’s character arc. Movement, by Steven Hoggett, helps communicate emotion, magic, and atmosphere in this universe. Hoggett’s choreography says so much so quickly – we see Albus physically falter in Charms class, we see Scorpius alone in Hogwarts with very few friends as he walks the hallways getting shoved and ignored. By creating a choreographic vocabulary from the seemingly random bodies crossing the stage coming together in moments of unison, Hoggett gives Hogwarts a unique physicality that flows as smoothly as the school’s famously mobile floating staircases. Hoggett has provided the production the most exciting use of a magician’s robe since Elphaba ascended above Oz for the first time. Robes are flung by the ensemble skyward and by the time the performers’ arms have reached their sides again, a set change has occurred and a suitcase or table has appeared or disappeared. This is all set to Imogen Heap’s gorgeous electronic score where the music highlights a thrilling magic duel or a small emotional moment between Harry and Ginny. Gareth Fry’s sound design must be given credit for making sure we can hear every single word crisply and clearly for the entire production and still feel like the cavernous Lyric is functioning as an intimate playhouse. But the greatest of the creative collaborations is between lighting designer Neil Austin, set designer Christine Jones, and illusionist Jamie Harrison. Austin shrouds much of Jones’s set in upstage shadow to hide whatever Harrison needs to pull off his stage sorcery. Even from a seat pretty close to the stage, I could not figure out how much of the illusion work happened. Jones’s design is simple, deceptive, and expands well beyond the limits of the proscenium arches. Her Hogwarts extends from the upstage wall all the way out to the theater’s balcony. With Gothic arches and little details like tiny gargoyles holding lanterns in their mouths, the design relies on little more than suitcases, moving doorframes, and a pair of gliding staircases all manipulated by the actors to define the space. Interior of the refurbished Lyric Theatre (Photo: Manuel Harlan) However, her most brilliant imagery occurs only in our heads. When Scorpius and Albus approach Hogwarts for the first time, they look out into the audience, and the houselights fade up for about 30 seconds, taking in the massive expanse of the theatre. As the audience shifted to see what would be revealed, I realized we were all thinking about our own image of Hogwarts, be it that of the iconic castle made famous by the films and Universal Studios amusement parks or an idea of the school painted by the novels when we first read them twenty-years ago. Here the production makes space for the audience’s imagination much as the books did. Jack Thorne’s playscript, after an original story created along with J.K. Rowling and John Tiffany, sets out to give Potterheads everything they want – the script has every single Harry Potter reference and character imaginable, even where it doesn’t quite make sense. The play gives us our tried and true favorite characters, and new characters to love (with Scorpius leading the pack here). But in its accumulation, the play does become a bit unwieldy at times. While the heart of the story provides a lot of fun with the characters we adore, the script itself is noticeably insipid in its assemblage. Structurally it is a strange balance of short cinematic scenes brimming over with tepid, often predictable dialogue and the absolutely beautiful movement-heavy transition sequences. This adds up to a great idea, but a textually weak play. This is not to say that the production is less than strong. But to conflate the physical production and the playscript makes for a messier conversation. The production is a game-changer which redefines spectacle and what plays on Broadway can be, but it left me wondering whether this is what Broadway should be. While it recalibrates an audiences’ understanding of epic theater, the reported budget for the renovation of the theater and the design elements of the play is over $68 million dollars. What does it say about the state of Broadway that producers and investors alike are willing to spend this type of money on a well-established and recognizable brand for a new play, and yet, original new plays like Indecent (arguably the most exciting to play on Broadway since the premiere production of Angels in America) and Sweat (which won the 2017 Pulitzer Prize) disappeared from Broadway in the blink of an eye? I’m wondering what it would take to convince a producer to take a leap of faith like this on a new, riskier work. While Cursed Child is enjoyable to watch, I couldn’t help but think what if just seven or eight of those $68 million had been invested towards creating space for exciting new work on Broadway, be it written by artists like Nottage and Vogel or by emerging artists still climbing the ladder? Although I was swept away by the production, was I letting my own nostalgia blind me to significant problems in the script? Were audience members who had shelled out $600 a ticket embracing it with fervor because the alternative is some serious buyer’s remorse? At this budget level how can you not be carried away by the expensive and luxurious production? But is this where we want theater to be going? Harry Potter and the Cursed Child is magic. I sat in my seat giggling giddily for most of the play. I was so happy to be there. It was a wonderful experience to leave behind the stress of my day job to travel back to Hogwarts and my childhood, to go on one more adventure with Harry and the gang, and to have my breath stolen by lightning-fast illusion work. I left the theater smiling wide and feeling uplifted and depleted and full. Yes, Harry Potter and the Cursed Child casts a spell. But after the nostalgia rush dissipated, I wondered at what cost? Kev Berry is a contributor to Exeunt Magazine Read more articles by Kev Berry",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1707,
  "archivePath": "data/archives/reviews/harry-potter-2021/exeuntnyc-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:47:24.106Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}