{
  "showId": "harry-potter-2021",
  "outletId": "hollywoodreporter-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.hollywoodreporter.com/review/harry-potter-cursed-child-theater-review-1104812",
  "publishDate": null,
  "fullText": "5:30 PM PDT 4/22/2018\n\nby\n\n\nTHR Staff\n \n\n\nFACEBOOK\n\n\n\n\nTWITTER\n\n\n\n\nEMAIL ME\n\nBack when it was first announced, plenty of observers rolled their eyes in skepticism at the idea of a play that would continue J.K. Rowling's globally popular wizardry saga, a series of books that singlehandedly turned entire generations on to the joys of reading imaginative fiction. But anyone still ready to dismiss Harry Potter and the Cursed Child as a cynical brand extension, or a theme-park ride on stage, clearly hasn't experienced the thrilling theatricality, the pulse-pounding storytelling vitality and the unexpected emotional richness of this unmissable two-part production. The ecstatic hype that accompanies the smash London import to Broadway is amply justified, and then some.\n\nPlaywright Jack Thorne, director John Tiffany and his indispensable movement collaborator Steven Hoggett achieve the near impossible: They mount a persuasive case that this story we all know from novels and/or movies only now has found its nonpareil medium. The two plays have a combined running time of almost five-and-a-half suspenseful hours. And when you get a load of the illusions pulled off right before your eyes — mostly with old-fashioned sleight-of-hand and crafty lighting; only occasionally with more elaborate techno-trickery — it's not hyperbole to call the show sheer magic.\n\nSome of the genuine awe factor of movies has been lost in the digital age; CGI now makes anything possible. But witnessing elevated stagecraft applied to a time-traveling fantasy story of this nature conjures a sense of wonder and excitement that evokes vintage Saturday-matinee serials. Naturally, the storytelling is more sophisticated here and the acting infinitely superior, but the edge-of-the-seat participation is the same, the shared escapism of a packed theater gasping in unison, fueled by the writers' knowing use of cliffhangers at the end of all but the final act. The first of those is anticipatory — a character voicing a simple conclusion we've already reached by ourselves: \"This is going to be good.\" The next two are terrifying.\n\nThe production is the most expensive nonmusical ever mounted on Broadway, with a reported capitalization of $35.5 million, every cent of which can be seen onstage, plus an additional $33 million to remodel the Lyric Theatre, which is likely to remain its home for years. Formerly a show-killing barn, the theater has reduced its capacity by more than 250 seats down to 1,622, installing a new vaulted ceiling and boxes. The reconfigured house feels both grander and cozier, with custom-monogrammed Hogwarts carpeting, phoenix sconces and dragon light fixtures. The exterior also got a makeover, with the main entrance moved from the tourist hell of 42nd Street to far less choked 43rd. It's a complete rebirth, and remarkably tasteful.\n\nIs it strictly for Potterheads? Not at all, though anyone going in cold, with no prior knowledge of the stories, will miss much of the clever cross-referencing of characters and events from throughout the series. A detailed recap starting with the key prophecy that propelled the entire saga and continuing with a breakdown of each of the seven novels is provided in the program and will be helpful to the uninitiated. But there's also a universal dimension to the human drama here — the challenges of parenting, the conflict between fathers and teenage sons burdened by intimidating legacies, the sustaining force of love and friendship, the eternal grip of the past — that will prove poignant and meaningful even to audiences unversed in the wizarding wars.\n\nI'm by no means a Potter obsessive but I was amazed, watching the plays, at how vividly these characters are embedded in our cultural consciousness. You can feel the electric charge in the theater even before the action begins, and it's highly infectious, whatever your prior exposure.\n\nI read the first Harry Potter novel back in the late 1990s to see what the fuss was about, and stuck with the movies mainly for the sake of completism. The uneven series peaked with Alfonso Cuaron's towering third entry, Harry Potter and the Prisoner of Azkaban, but became more pedestrian in the later chapters, with the material outshining the filmmaking craft. The consistent pleasure of the movies, however, was watching the young cast grow up onscreen along with their characters, surrounded by a deep pool of top British acting talent. The faces are new but that welcome sense of familiarity carries over in this continuation, which picks up exactly where the epilogue of Harry Potter and the Deathly Hallows left off, 19 years after the main action.\n\nThe bold strokes of the design team are in evidence from the atmospheric first image — set designer Christine Jones encloses the empty stage with the ribbed girders and ornate wooden walls of a Gothic Revival English train station, and lighting magician Neil Austin floods rays through the massive railway clock that becomes a key visual motif. That base frame lends itself with astonishing versatility to multiple locations, from the characters' homes to the Ministry of Magic, from Hogwarts School of Witchcraft and Wizardry to a nearby forest, with the girders fusing together to become trees in an enchanting flourish.\n\nHoggett turns the swift scene transitions into dizzying mini-ballets, and even the set elements dance, notably two wooden staircases that depict the labyrinthine interior at Hogwarts, used to exquisitely moving effect when two friends are forced apart into uncomprehending solitude. Along with clocks, suitcases are another motif, doubling, story-theater style, as everything from train seating to tombstones. The ingenuity on display, often using the simplest means, is dazzling.\n\nWhile the play script has been published and dissected to death by the Potterati, theater staff distribute badges at every break asking us to #KeepTheSecrets; there's even a spoiler alert advising not to look at the cast list if we don't wish to know all the characters featured. I'll do my best to stick to the basic story setup, but stop reading now if you'd prefer to know nothing.\n\nThe train station is where parents come to send their children off to Hogwarts, thus ushering in a new generation of characters. Among the first-year students is Albus Potter (Sam Clemmett), the brooding, fretful middle child of Harry (Jamie Parker) and Ginny (Poppy Miller); Rose Granger-Weasley (Susan Heyward), who has the snappish intelligence of her mother Hermione (Noma Dumezweni) and the humor of her father Ron (Paul Thornley); and Scorpius Malfoy (Anthony Boyle), a sweet-natured, studious nerd given to hilarious flights of hysterical anxiety.\n\nScorpius can't help but feel a disappointment to his chilly widowed father Draco (Alex Price), rocking a platinum ponytail and militaristic-chic wardrobe but seemingly done with the evils of his youth. Albus is no star in the wizardry department; he also feels like a terminal underachiever compared to his legendary dad, and the resentment comes off him in waves that Harry, now a paper-pusher at the Ministry of Magic, is ill-equipped to manage.\n\nThe boys' shared understanding of the weight of expectations bonds them instantly. Albus' poor performance at school and the persistent rumors that Scorpius might actually be the offspring of Voldemort, the Dark Lord himself, prompt them to try rescuing their reputation with a valiant deed. That involves using a \"Time Turner\" filched from the office of Hermione, now the Minister of Magic, to travel back and prevent a long-ago tragedy. But the porous past is slippery, and any change to it will have ripple-effect consequences, &agrave; la the Back to the Future trilogy.\n\nThe time-travel effect is a marvel of deftly deployed lights and video that yields a big wow moment, prompting a surge of anticipation whenever it's about to occur. But what's most satisfying is the way the story expands as it trips back and forth between past and present to revisit much of the known Potterverse. Along with surviving characters like the imperious headmistress Minerva McGonagall (Geraldine Hughes, perfection), figures both comforting and sinister resurface, some via time jumps and others in talking portraits, often in performances that give sly nods to their screen predecessors in the roles. It gives the plays an epic scope that goes beyond the already large-scale two-part presentation.\n\nThere's also a corresponding intimacy, however, in the way Thorne, working from a story he conceived with Rowling and Tiffany, hones in on the pains and joys of adolescence as Albus and Scorpius deal with everyday insecurities along with far more crippling threats. (The playwright and director successfully mined territory akin to this in their inventive stage adaptation of the terrific Swedish teen vampire movie, Let the Right One In.) The endangerment of Albus and Scorpius (along with the hard-won peace of the world of both wizards and non-magical muggles) also weaves in the ultimate fears of parenthood, a factor worsened by regrettable words Harry has spoken in the heat of an argument.\n\nThe decision to bring over the seven actors who originated the principal roles in London pays off tremendously in the emotional depth brought to their characters and the tender connective tissue that binds their lives.\n\nPockets of racist outrage exploded online when it was first announced that a black actress had been cast as Hermione, which Rowling shot down in her no-nonsense style by pointing out that the character's ethnicity was never mentioned in the books. In any case, only the most bigoted idiot could find fault with the brilliant Dumezweni's performance, her haughtiness, quicksilver intellect and underlying warmth tracing a line way back to the precociously clever girl Harry first met on the train all those years ago.\n\nThornley's Ron, too, is readily identifiable as the perennial joker of the trio. He's acquired substance and a charming mellowness over the years, though a glimpse of him in a time-warped present tells a heartbreakingly different story. Miller takes the early indicators of Ginny's strength and builds on them, shaping a smart, grounded woman capable of handling Harry's complicated baggage. And Price's Draco is still peevish and moody, his bitterness exploding in an entertaining clash of wands with Harry, but he's found a softer side in maturity as well.\n\nAt the center of it all is Parker's Harry, grown up and more confident but still pensive and troubled as ever, plagued by memories of the orphaned boy who slept under the stairs at his aunt and uncle's home, and the reluctant hero he was forced to become. It's a finely nuanced performance, with gravitas and heart, particularly as he wrestles with and eventually overcomes his struggles as a parent. Even with the sweet sentimentality of the closing scenes, what lingers most about Parker's characterization is the stoical knowledge he carries with him that every moment of happiness contains the promise of more pain to come.\n\nOf equal importance in the story are Albus and Scorpius, and while Clemmett is affecting in the more tortured role, at war with himself as much as his father, the discovery here is Boyle. His comic timing, nervous mannerisms and endearing awkwardness even in moments of triumph make him a quintessential Rowling character and a winning new addition. \"My geekness is a-quivering,\" he chirps at one point, probably echoing how half the audience is feeling. It's stirring watching these two young outsiders conquer their self-doubt to find courage and fortitude.\n\nFirst-rate actors flesh out other key roles, and while not much can be revealed about those characters, there's memorable work from Byron Jennings, Kathryn Meisle and Lauren Nicole Cipoletti, as well as Jessie Fisher, playing a silver-haired newcomer with considerable plot impact. The 40-member ensemble works as hard as the dance crew in any musical, whipping their wizards' capes around disappearing scenery and moving with hypnotic grace and speed through supple transitions, backed by composer Imogen Heap's propulsive underscoring.\n\nWhile the opening scenes of Part One are a master class in brisk but lucid exposition and accelerated passage of time, Part Two gets underway with stage pictures of searing power as a time jump turns the familiar world into a very grim, disturbing place. With political commentators like Madeleine Albright warning about the gathering storm clouds of Fascism across the globe, this is deeply unsettling imagery. It suggests a fantasy with a chilling grasp of potential reality.\n\nIn addition to Jones' imposing sets and Austin's chiaroscuro lighting with its splashes of cathedral-like grandeur, the work of everyone on the design team deserves kudos. That includes Katrina Lindsay's costumes, with character details ranging from subtle through flamboyant; the seamless video elements by Finn Ross and Ash Woodward; and the wraparound, nerve-jangling soundscape of Gareth Fry. The extensive magic components, overseen by illusions maestro Jamie Harrison, are superb — from the vaudevillian trick used for onstage transformations to the playful exits (through a phone box) and entrances (via a burning fireplace). And the booby-trapped bookcase in Hermione's office is a riot.\n\nBest of all though — and this probably is a spoiler, but you've read this far at your peril — are the magnificently creepy Dementors, the soul-sucking airborne demons that fly out over the audience or wrap themselves around a victim with deathly sensuality. They're scary and fabulous and I'd see the whole thing again for their killer cameos alone.\n\nVenue: Lyric Theater, New York\nCast: Jamie Parker, Noma Dumezweni, Paul Thornley, Sam Clemmett, Anthony Boyle, Poppy Miller, Alex Price, Jessie Fisher, Geraldine Hughes, Byron Jennings, Kathryn Meisle, Susan Heyward, Edward James Hyland, Brian Abraham, Lauren Nicole Cipoletti, David St. Louis, Benjamin Wheelwright\nDirector: John Tiffany\nPlaywright: Jack Thorne, based on an original story by J.K. Rowling, Thorne & Tiffany\nMovement director: Steven Hoggett\nSet designer: Christine Jones\nCostume designer: Katrina Lindsay\nLighting designer: Neil Austin\nMusic & arrangements: Imogen Heap\nSound designer: Gareth Fry\nIllusions & magic: Jamie Harrison\nMusic supervisor & arrangements: Martin Lowe\nVideo designers: Finn Ross, Ash Woodward\nPresented by Sonia Friedman Productions, Colin Callender, Harry Potter Theatrical Productions",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 2295,
  "archivePath": "data/archives/reviews/harry-potter-2021/hollywoodreporter-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:51:38.650Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20201109032417",
  "archiveOrgUrl": "http://web.archive.org/web/20201109032417/https://www.hollywoodreporter.com/review/harry-potter-cursed-child-theater-review-1104812"
}