{
  "showId": "harry-potter-2021",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2018/04/22/theater/review-harry-potter-and-the-cursed-child-raises-the-bar-for-broadway-magic.html",
  "publishDate": "2018-04-22T20:11:20-04:00",
  "fullText": null,
  "isFullReview": false,
  "bwwExcerpt": "For this slyly manipulative production knows exactly how, and how hard, to push the tenderest spots of most people's emotional makeups. By that I mean the ever-fraught relationships between parents and children, connections that persist, often unresolved, beyond death. Time-bending, it turns out, has its own special tools of catharsis in this regard. In the multiple worlds summoned here, it is possible for kids to instantly become their grown-up mentors, and for a son to encounter his forbidding father when dad was still a vulnerable sapling. \"I am paint and memory,\" a talking portrait of the long-dead wizard Dumbledore (Edward James Hyland) says to his former star pupil, Harry. Well, that's art, isn't it? Substitute theatrical showmanship for paint, and you have this remarkable production's elemental recipe for all-consuming enchantment.",
  "showScoreExcerpt": "\"Five hours of performance pass in a wizardly wink of an eye...Everything that happens onstage seems as improbably fluid as, well, time itself. It helps that what happens includes some of the most eye-boggling illusions you’ll ever witness...The new gold standard for fantasy franchise entertainment on Broadway...This slyly manipulative production knows exactly how, and how hard, to push the tenderest spots of most people’s emotional makeups.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Did-The-Critics-Think-HARRY-POTTER-AND-THE-CURSED-CHILD-Was-Magical-20180422",
  "designation": "Critics_Pick",
  "textStatus": "missing",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.962Z",
  "textQuality": "missing",
  "sourceMethod": "bww-roundup"
}
