{
  "showId": "harry-potter-2021",
  "outletId": "telegraph-co-uk",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.telegraph.co.uk/theatre/what-to-see/could-become-longest-running-broadway-play-harry-potter-cursed/",
  "publishDate": null,
  "fullText": "US Edition\n            \n        \n    \n\n\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\n\t\t\n\t\t\n\t\t\n\n\t\t\n\t\t\n\n\t\t\n\n\t\t\n\n\t\n\n\n\n\n            \n        \n    \n\n    \n\n\n\t\n\n\n\n\n\t\t\n\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\n\t\n\t\n\t\t\n\n\n\n\n\t\n\n\t\n\n\t\t\n\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\t\n    \n\n\t\n\t\n\n\t\n\n\n\n\n\n\n\t\t\n\t\t\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\n\n\n\n\t\n\t\n\n\t\n\n\t\t\n\n\n\n\n\n\t\n\n\t\n\t\n\n\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\t\n\t\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\n\t\t\t\t\n\n\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n\n\t\t\t\t\n\n   \n   \n\n    \n\t\t  \n        \n        \n          \n          \n\t\t  \n        \n        \n          \n          \n\t\t  \n        \n        \n          \n          \n\t\t  \n        \n        \n          \n          \n\t\t  \n        \n        \n          \n          \n\t\t  \n\t\t\n\t\n\n\t\t\t\n\n\t\t\t\n\t\t\n\n\t\t\n\t\t\n\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\n\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\tThe Broadway cast of Harry Potter and the Cursed Child \n\t\t\t\n\t\t\n\n\t\t\n\t\t\n\t\n\n\n\n\t\n\n\t\n\t\n\n\n\n\n\n\n\t\n\n\n\n\n\n\n\n\t\t\n\n\t\t\t\n\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t  \n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\n\n\t\n\t\n\n\t\n\t\n\n\n\n\n\n\t\n    \n    \n\n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n\n    \n        \n            \n\n            \n\n            \n                \n\n    \n    \n    \n    \n    \n    \n\n    \n    \n\n    \n    \n\n        \n        \n\n        \n        \n        \n\n        \n            \n                \n    \n        \n            Diane Snyder\n        \n    \n\n                \n    \n\n            \n\n            \n                \n    \n    \n\n            \n        \n    \n    \n    \n    \n    \n    \n    \n    \n\n        \n\n    \n        \n            \n    \n    \n    \n        \n\n\n\n\n\n\n\n\n\n\n    \n\n    \n        \n        23 April 2018 3:00am BST\n        \n    \n\n    \n\n\n        \n    \n\n            \n        \n\n        \n    \n    \n\n\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\n\t\t\t\t\n\n\t\t\t\t\n\n\n\n\n\n  \n  \n\n\t\n\n\t\n\t\n\n\t\n\t\n\n\n\n  \n  \n    That sound you hear coming from the newly renovated Lyric Theatre might be the incantations of wizards casting spells. But it could also be the thunderous applause of 1,622 Potter fans and their pals taking in the new Broadway production of Harry Potter and the Cursed Child.\n\nNot all theatrical extravaganzas transfer from London to New York, or vice versa, with winning results. But the two-part, five-hour behemoth that became a blockbuster in London in 2016 and won nine Olivier Awards in 2017 is working its incandescent magic on American audiences. It may not bring home as many trophies at this year’s Tony Awards, but it’s practically a shoo-in for best new play.\n\nIts stateside success is no surprise. The Broadway incarnation has had two years to build momentum and hype, helped by the fact that the Cursed Child script led book sales in the United States in 2016, with more than 4 million copies sold. Broadway doesn’t see many family-friendly shows that aren’t musicals, so this opens up a whole new world for kids whose previous theatrical outings have been Disney musicals.\n\nHarry Potter and the Cursed Child has opened at the Lyric Theatre in Times Square, New York\n\t\t\t\n\t\t\n\n\t\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t    Credit: Alamy\n\t\t\t   \n\t\t\t\n\t\t\n\t\n\n\n\n\t\n\n\t\n\t\n\n\n\n\n\n\n\n\n\n  \n  \n\n\t\n\n\t\n\t\n\n\t\n\t\n\n\n\n  \n  \n    For Americans, the Harry Potter phenomenon offers numerous pleasures beyond the fantasy element. The stories cater to our fascination with British boarding schools. (Yes, we know they’re not a reality for most students in the UK, but it doesn’t matter.) And Cursed Child respects the audience’s intelligence as it engulfs them in a world potentially more sinister than a lot of American children's literature.\n\nMy companion for both parts, who had already seen Cursed Child in London, said the biggest difference wasn’t onstage but in the audience. In New York, theatre-goers were audibly wowed – though not to the point of distraction –cheering, gasping and shrieking as their cherished characters faced danger, familiar faces showed up and stunning feats of &#34;how-did-they-do-that&#34; theatrical magic unfolded before their eyes. The London audience was much quieter.\n\nBut the New York audience is being trained in good theatrical manners. Although lots of snacks are for sale, an announcement before the shows instructs you not to eat during the performance, the first time I’ve ever heard such sensible request.\n\nFrom left, Alex Price, Paul Thornley, Noma Dumezweni, Jamie Parker and Poppy Miller in the West End version of Harry Potter and the Cursed Child\n\t\t\t\n\t\t\n\n\t\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t    Credit: Manuel Harlan\n\t\t\t   \n\t\t\t\n\t\t\n\t\n\n\n\n\t\n\n\t\n\t\n\n\n\n\n\n\n\n\n\n  \n  \n\n\t\n\n\t\n\t\n\n\t\n\t\n\n\n\n  \n  \n    And the Lyric, a theatre that has had numerous name changes and housed various theatrical flops, including the disastrous Spider-Man musical, finally has a production with staying power. Courtesy of Britain’s Ambassador Theatre Group, it’s received the finest of face-lifts for its new attraction. Golds, blues and reds dominate the color scheme, while Hogwarts “H’s” adorn doors, and carpets and lighting fixtures feature dragons and phoenixes.\n\nThings are just as grand onstage. The eighth story in JK Rowling’s masterful series is the theatrical and storytelling feat that it is in London. In an unusual move, and in keeping with the tradition of casting the films with British actors, producers have brought over the seven principals from the original West End cast as part of the 40-person company, even though they aren’t marquee names, including Noma Dumezweni as the ever loyal and resourceful Hermione Granger, Paul Thornley as her husband, Ron Weasley, and Poppy Miller as Harry wife, Ginny.\n\nAs the adult Harry, Jamie Parker finds reservoirs of depth in a man still suffering post-traumatic stress from events of 19 years ago and dealing with a son, Albus (Sam Clemmett) who seems out of reach and haunted by the difficulty of living in a parent’s shadow. Newcomer Anthony Boyle is a hoot as geeky but lovable Scorpius Malfoy – offspring of Harry’s former nemesis, Draco (Alex Price) – who forges a valuable friendship with fellow Hogwarts outcast Albus.\n\nThe play – whose story is credited to Rowling, playwright Jack Thorne and director John Tiffany – has an emotional honesty that, like the books, never sinks into sentimentality and guarantees its endurance. At its essence is a story about parents and children, specifically fathers and sons, struggling to connect with a loved one they can’t understand.\n\nWhile still in previews, Harry Potter has broken a couple of Broadway records. It’s the most expensive nonmusical show ever staged on Broadway, according to The New York Times, which estimates the total cost at $68.5 million. And it’s already the highest-grossing Broadway play of all time, netting $2,138,859 the first week of April. (It’s a costly day out for families, with the ticket prices for each part averaging $164.83 for that same April week. Still, each performance has 300 seats selling for $40 or less for each part.)\n\nAnd though it’s rolling out tickets gradually (seats for mid-2019 are just now going on sale), Harry Potter and the Cursed Child looks like it will be maintaining a permanent Broadway residence for some time. The longest-running nonmusical Broadway play, Life With Father, closed in 1947 after an eight-year run and 3,224 performances. Don’t be surprised if this surpasses that.\n\nBooking until May 12, 2019. Tickets: harrypottertheplay.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 873,
  "archivePath": "data/archives/reviews/harry-potter-2021/telegraph-co-uk--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:56:59.146Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "sourceMethod": "brightdata"
}