{
  "showId": "harry-potter-2021",
  "outletId": "the-mercury-news-karen-dsouza",
  "outlet": "The Mercury News (Karen D’Souza)",
  "criticName": "Unknown",
  "url": "https://www.mercurynews.com/2019/12/02/review-spellbinding-harry-potter-and-the-cursed-child-soars-into-sf/",
  "playbillVerdictUrl": "https://www.mercurynews.com/2019/12/02/review-spellbinding-harry-potter-and-the-cursed-child-soars-into-sf/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Lumos! The boy who lived must battle the fiercest enemy of all in “Harry Potter and the Cursed Child.” Potter and his family must face off against the ravages of time in this dazzling if overstuffed narrative written by Jack Thorne, John Tiffany and J.K. Rowling.\n\nAn epic epilogue of sorts, which officially kicked off an open-ended run Sunday at The Curran in San Francisco, this is the eighth Harry Potter story and it takes place 19 years after the final book ends. And once again the forces of evil are summoning up their darkest curses to destroy the heroes of Hogwarts in this much-ballyhooed West Coast premiere of the Tony-winning wizard blockbuster.\n\nMuch like plowing through the entire Potter oeuvre in paperback, this spectacle-packed two-part production is a marathon experience that involves about eight hours of your life (including the intermissions and the dinner break) if you gobble it all up on one day. Getting fully immersed in J.K. Rowling’s wonderfully weird wizard universe is definitely part of the enchantment here. Unfortunately, if you are a bit of a Muggle, someone not fully initiated in the ways of this fantastical universe, the 5-hour, 15-minute long production starts to outlast its dazzling stage magic and the plodding aspects of the show start to wear on you. Devotees of the dark arts may well find the wonder more sustained.\n\nFamed for the sublime “Black Watch” and “Once,” Tiffany is certainly a master at plunging an audience deeply inside a richly strange and intricate universe. The Tony-winner shows her genius in summoning the atmosphere of Hogwarts, while choreographer Steven Hoggett finds the soul of every movement. There’s a deeply etched sense of ritual embedded in the dance-like movement here. It’s a ballet of capes and wands and flying demons that’s quite mesmerizing, even hypnotizing, at first. But the intoxication of those spellbinding special effects wears off eventually.\n\nThe beguiling begins with Harry (John Skelley) as a middle-aged father, seeing off his youngest boy, Albus (Benjamin Papac) to take the express train to Hogwarts. Beside him are Hermione (Yanna McIntosh) and her husband, Ron Weasley (David Abeles) and their daughter, Rose (Folami Williams). Along for the ride is also Scorpius (a charismatic Jon Steiger) the son of Harry’s old nemesis Draco Malfoy (a dryly menacing Lucas Hall). The adventures in store for all of them involve the ghosts of a past that much of the audience knows by heart.\n\nNostalgia is the secret potion here. As the chatty portrait of the late great Dumbledore (Charles Janasz) notes to Harry: “I am paint and memory.” If you grew up with these books or know children who did, “Harry Potter and the Cursed Child” will surely cast its spell on you even if the bewitching may not last.\n\nAlong the way a byzantine time-loop-meets-alternative-universe plot veers into formulaic territory, the script tries to cram in far too many references to beloved characters, and there’s a lot of unnecessary exposition that saps the momentum. You may not notice this for a while as the show has considerable magnetism and charm, from Skelley’s densely-layered performance as Potter the elder to haunting aerial shadow puppets and several swashbuckling wand battles. The campy moments are also a delight, particularly a sparkling comic interlude with a ghost named Moaning Myrtle (Brittany Zeinstra).\n\nHowever, the incantation loses its luster by the final act. Not to give away too much but the play tries too hard to straddle generations and genres, leaving some key plot points underdone. One dastardly minion of the dark lord, for instance, leaves much to be desired and the female characters in general aren’t written with the same care as their male counterparts.\n\nFor all its spectacle, the conjuring of “Cursed Child” feels somehow incomplete.\n\nBy Jack Thorne, based on a story by J.K. Rowling, John Tiffany and Thorne\n\nWhen: Open-ended run, presented in two parts;\n\nWhere: The Curran theater, 445 Geary St., San Francisco\n\nTickets: On sale through June 20, tickets through July 20 will be released Dec. 6; $59-$199 per part; www.harrypotteronstage.com",
  "isFullReview": true,
  "textWordCount": 676,
  "archivePath": "data/archives/reviews/harry-potter-2021/the-mercury-news-karen-dsouza--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:25:03.767Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 676,
  "tierReason": "Full review text"
}