{
  "showId": "harry-potter-2021",
  "outletId": "thefrontrowcenter-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://thefrontrowcenter.com/2018/04/harry-potter-and-the-cursed-child/",
  "publishDate": null,
  "fullText": "Posted by Tulis McCall | Apr 30, 2018 | Reviews\n\nToday I’ve got magic on my mind.  The Harry Potter kind.  Apparently so does the rest of the world.  After seeing this spectacular Harry Potter and the Cursed Child I decided to borrow book from the Library.  I have NEVER seen a book available in so many languages.  Some of which I don’t even recognize.  But who can blame them?  Don’t we all want to take a couple of classes at Hogwarts?  Perhaps they have some adult education offerings.  And about the owls.  Henceforth I want all my mail delivered by a feathered messenger. In addition, I got my eye on a fetching fluffy white owl just like Harry’s. (Apparently there were real owls in the London production until one of them took a left turn when it should have taken a right.  Off into the audience it flew.)  I want IN.\n\nJ.K. Rowling’s writing is masterful.  Even though this play was written by Jack Thorne, it has her finger prints all over it.  Under the spectacular direction of John Tiffany we are included, indeed, we are beckoned, into the world of witches.  As observers only, of courses, but that is almost enough.\n\nThe story is richly layered, like all Rowling tales. The grown-up Harry Potter (Jamie Parker) is married to Ginny Weasley (Poppy Miller) and still friends with the entire Weasely clan because Ron (Paul Thornley) finally got his act together and married Hermione (Noma Dumezweni).  Both Harry and Hermione work at the Ministry for Magic (the same one that threatened to topple Dumbledore years back).  Today they are seeing their children off to Hogwarts.  Albus Potter (Sam Clemmett) and Rose Weasley (Susan Heyward) are first year students. Rose, being Hermione’s daughter, is thrilled and full of all the possibilities that lie ahead – like picking the right friends immediately.  She relishes the idea that because of her mother she is already someone.\n\nAlbus on the other hand is having a not-so-good-very-bad-day.  Just the idea of Hogwarts overwhelms Albus.  He does not want to be the “Son of Harry Potter.” He does not want to be anything except a hormone filled boy with a wand that should really be licensed.  Instead, he stumbles upon another misfit, Scorpius Malfoy (Anthony Boyle).  Together they become a team of two misfits.  And decide to take the past into their hands.\n\nIf certain events in the past are just tweaked, they reason, then the present would be in much better shape.  Lives would be saved, etc., etc.\n\nWhat they don’t count on is ye olde pebble tossed in the lake routine.  One event leads to another and pretty soon everything is ass over teakettle with the Dark Lord on the loose and aimed directly at the two mischief makers.\n\nThere are some serious twists and turns, of course.  But these are almost unnoticeable in the face of the special effects that are on display for our enjoyment.  These are not the fancy schmancy special effect, but they are spectacular.  They are simplicity itself, made of puppetry magic and lighting that tells us exactly where to look.  This far and no further.  The shadows are teaming with unseen life that are eager to reach out and touch someone – could even be you if you are in the right seat.  The ensemble’s choreographed movements, clean, simple and unrelenting, give the entire production a physical urgency.  Even the program tells you what to read and when.\n\nUltimately this is a tale of family.\n\nHARRY POTTER AND THE CURSED CHILD; Photo By Manuel Harlan\n\nA boy who lost his father grew up to be one and has misplaced his parenting manual.  Harry must rely on his wife, his friends and his mentors long gone.  In the process of recovering each other they also cross paths with the past, and we are touched when the friends (and even a few pests) show up in the flesh.\n\nMy friend who attended with me is a Brit and was concerned, lest the American audience was not as hooked on the Potter legend as the Brits. He needn’t have worried.  As one witch after another produced sorcery – the audience cheered.  As characters we had only read or seen on the silver screen appeared there were gasps of recognition.  We were children oohing and ahhing throughout.\n\nAnd when it came time, after 5 hours of immersion, to say good-bye to these treasured friends (all the  principals take their bows en masse) we stood up and cheered farewell, like the crowds used to do when a ship was leaving.  If given our druthers we would have put on an invisibility cloak and joined them.\n\nI mean, they do live there, right?\n\nAs to the child?  As to the curse?  I have sipped the potions and am Keeping The Secrets Safe.  As the complimentary pins request.\n\nHarry Potter and the Cursed Child &#8211; CreditsWritten by Jack Thorne, based on a story by J. K. Rowling, Jack Thorne and John Tiffany; Directed by John Tiffany\n\nCastJamie Parker, Noma Dumezweni, Paul Thornley, Poppy Miller, Sam Clemmett, Alex Price, Anthony Boyle, David Abeles, Brian Abraham, Shirine Babb, Jess Barbagallo, Stephen Bradbury, Lauren Nicole Cipoletti, Joshua De Jesus, Jessie Fisher, Richard Gallagher, Susan Heyward, Geraldine Hughes, Edward James Hyland, Byron Jennings, Katie Kreisler, Joey LaBrasca, Andrew Long, Kathryn Meisle, Angela Reed, Dave Register, Adeola Role, James Romney, Malika Samuel, Alanna Saunders, David St. Louis, Stuart Ward, Madeline Weinstein, Alex Weisman and Benjamin Wheelwright\n\nHarry Potter and the Cursed Child features movement by Steven Hoggett, set by Christine Jones, costumes by Katrina Lindsay, music & arrangements by Imogen Heap, lighting by Neil Austin, sound by Gareth Fry, illusions & magic by Jamie Harrison, music supervision & arrangements by Martin Lowe.\n\nProducers Sonia Friedman, Colin Callender and Harry Potter Theatrical Productions present the Broadway premiere of Harry Potter and the Cursed Child.  TICKETS\n\nFor my money, the theatre is up there in the ten top reasons to be human. I leave my home and go sit in a dark room with complete strangers and watch actors do their stuff because I want to be inspired. I’m asking to be involved. I’m volunteering to be led down any old path they choose as long as they don’t let go of my hand.\nAnd if I see a show, and it is NOT so very good – I will try to divert you, because I don’t want you to come to the temple when the preaching isn’t up to snuff. I will bar the door, I will swing from rafters, I will yell FIRE just to set your feet on a path that does not lead to disappointment. Do something different with your evening I will say. Save your money for dinner with a friend you haven’t seen in months because you are too frigging busy. Go take a walk with your dog or your child or your significant other. Go to bed early, I will say. Don’t come to the theatre when it is less than it can be.\nI’m an usher snob, and that’s all there is to it.\n\nOpening Night Our Criteria Get our reviews by email\n\nJoin our mailing list to receive the latest news and updates from our reviewers.\n\nJoin our mailing list to receive the latest reviews from the Front Row Center. We will email you all of the reviews twice weekly.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1238,
  "archivePath": "data/archives/reviews/harry-potter-2021/thefrontrowcenter-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T02:01:05.077Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240621150124",
  "archiveOrgUrl": "http://web.archive.org/web/20240621150124/https://thefrontrowcenter.com/2018/04/harry-potter-and-the-cursed-child/"
}