{
  "showId": "harry-potter-2021",
  "outletId": "time-out",
  "outlet": "Time Out",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/harry-potter-cursed-child-broadway-review",
  "publishDate": "2018-04-22T20:11:20-04:00",
  "fullText": "Broadway review by Adam Feldman Reducio! After 18 months, Harry Potter and the Cursed Child has returned to Broadway in a dramatically new form. As though it had cast a Shrinking Charm on itself, the formerly two-part epic is now a single show, albeit a long one: Almost three and a half hours of stage wizardry, set 20 years after the end of J.K. Rowling’s seven-part book series and tied to a complicated time-travel plot about the sons of Harry Potter and his childhood foe Draco Malfoy. (See below for a full review of the 2018 production.) Audiences who were put off by the previous version’s tricky schedule and double price should catch the magic now. Despite its shrinking, Harry Potter and the Cursed Child has kept most of its charm. The spectacular set pieces of John Tiffany’s production remain—the staircase ballet, the underwater swimming scene, the gorgeous flying wraiths—but about a third of the former text has been excised. Some of the changes are surgical trims, and others are more substantial. The older characters take the brunt of the cuts (Harry’s flashback nightmares, for example, are completely gone); there is less texture to the conflicts between the fathers and sons, and the plotting sometimes feels more rushed than before. But the changes have the salutary effect of focusing the story on its most interesting new creations: the resentful Albus Potter (James Romney) and the unpopular Scorpius Malfoy (Brady Dalton Richards), whose bond has been reconceived in a significant way. The original play hinted that their relationship might be more than just a friendship, but cloaked it in imply-and-deny evasion; in the revised version, it’s a more or less explicit romance. Aparecium! Lumos! What once was hidden has come to light, and the show shines brighter for it. Harry Potter and the Cursed Child. Lyric Theatre (Broadway). By Jack Thorne. Directed by John Tiffany. With ensemble cast. Running time: 3hrs 25mins. One intermission. Broadway review by Adam Feldman (April 22, 2018) The world of Harry Potter has arrived on Broadway, Hogwarts and all, and it is a triumph of theatrical magic. Set two decades after the final chapters of J.K. Rowling’s world-shaking kid-lit heptalogy, the two-part epic Harry Potter and the Cursed Child combines grand storytelling with stagecraft on a scale heretofore unimagined. Richly elaborated by director John Tiffany, the show looks like a million bucks (or, in this case, a reported $68 million); the Lyric Theatre has been transfigured from top to bottom to immerse us in the narrative. It works: The experience is transporting. Jack Thorne’s play, based on a story he wrote with Rowling and Tiffany, extends the Potter narrative while remaining true to its core concerns. Love and friendship and kindness are its central values, but they don’t come easily: They are bound up in guilt, loneliness and fear. Harry (Jamie Parker) is weighted with trauma dating back to his childhood, which hinders his ability to communicate with his troubled middle son, Albus (Sam Clemmett); it doesn’t help that Albus’s only friend is the bookish outcast Scorpius Malfoy (the exceptional Anthony Boyle), son of Harry’s erstwhile enemy, Draco (Alex Price). Despite the best intentions of Harry’s solid wife, Ginny (Poppy Miller), and his friends Hermione (Noma Dumezweni) and Ron (Paul Thornley), things turn dark very fast. Set designer Christine Jones and lighting designer Neil Austin keep much of the stage shrouded in mystery, the better to accommodate a continual stream of thrilling illusions and effects. Flames surge, wands flash, diaphanous Dementors hover ravishingly in the air; when characters travel through time, the entire stage seems to quiver—and the audience with it. Harry Potter and the Cursed Child is haunted by death and pain; it is often suspenseful and sometimes downright frightening. Yet amid the cinematic tumult and dazzle of the densely action-packed plot, Thorne and Tiffany carve out quiet scenes of intimacy and tenderness. Great care has gone into creating each moment of this state-of-the-art adventure. It leaves its audience awestruck, spellbound and deeply satisfied. Lyric Theatre (Broadway). By Jack Thorne. Directed by John Tiffany. With ensemble cast. Running time: 2hrs 40mins per half. One intermission per half. RECOMMENDED: A complete guide to the Harry Potter ticket lottery Follow Adam Feldman on Twitter: @FeldmanAdamFollow Time Out Theater on Twitter: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page Been there, done that? Think again, my friend. By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. Thanks for subscribing! Look out for your first newsletter in your inbox soon! Discover Time Out original video",
  "isFullReview": false,
  "bwwExcerpt": "Harry Potter and the Cursed Child is haunted by death and pain; it is often suspenseful and sometimes downright frightening. Yet amid the cinematic tumult and dazzle of the densely action-packed plot, Thorne and Tiffany carve out quiet scenes of intimacy and tenderness. Great care has gone into creating each moment of this state-of-the-art adventure. It leaves its audience awestruck, spellbound and deeply satisfied.",
  "showScoreExcerpt": "\"5/5 stars...Despite its shrinking, 'Harry Potter and the Cursed Child' has kept most of its charm. The spectacular set pieces of John Tiffany’s production remain...The plotting sometimes feels more rushed than before. But the changes have the salutary effect of focusing the story on its most interesting new creations: the resentful Albus Potter (James Romney) and the unpopular Scorpius Malfoy (Brady Dalton Richards), whose bond has been reconceived in a significant way.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Did-The-Critics-Think-HARRY-POTTER-AND-THE-CURSED-CHILD-Was-Magical-20180422",
  "textStatus": "complete",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.962Z",
  "textWordCount": 784,
  "textFetchedAt": "2026-01-25T14:26:59.639Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/harry-potter-2021/time-out--adam-feldman_2026-01-25.html"
}