{
  "showId": "harry-potter-2021",
  "outletId": "unknown",
  "outlet": "unknown",
  "criticName": "Unknown",
  "url": "https://www.amny.com/entertainment/harry-potter-and-the-cursed-child-review-1.18207087",
  "publishDate": null,
  "fullText": "On stage, one parent asks the other, &#8220;He&#8217;ll be alright, won&#8217;t he?&#8220;, and the answer to that, in regards to the most eagerly awaited new play to hit Broadway in years, is something far beyond the answer given, &#8220;Of course&#8220;.  In terms of Harry Potter and the Cursed Child, it is a resounding &#8220;YES&#8220;. This play and production is theatrical genius with layers upon layers of cape-tastic excitement and wand-elishous magic that just keep out-doing itself, raising the bar from one moment to the next. I must admit to you all that I&#8217;m just a mild to mediocre fan of the Harry Potter world.  I&#8217;ve seen all the movies but have only read a few of the books.  I absolutely loved the movies, especially as they matured into very adult themed explorations of attachment and trauma, finding them both compelling and emotionally engaging. I decided quite early on that seeing the films was good enough, and that reading the books, although very well written, would not necessarily add to my experience.  The movies were so good at inviting us into the world, that reading the same story in book form felt like a waste of time (although I&#8217;ve been told numerous times that my opinion on that matter is dead wrong).  The universe of Harry Potter is presented so well in the films, completely engrossing me in the details, the emotionality, and the magic, that when arriving at the newly reconfigured and renovated Lyric Theatre for a full day of Harry Potter and the Cursed Child, I was as excited as most to deepen the journey, but not bouncing up and down like the many fans surrounding me.\n\nThe energy in the room is contagious though.  Everyone around us seems pumped and bubbling with excitement.  The lady next to me, a very well dressed older woman, was very contained, sitting quietly with her purse politely perched on her lap, but it only took one question to open the can of thrilled worms residing inside her.  She was as stoked to be here as anyone, and I quickly realized she was a huge fan, going out of her way to be here, on her own, to continue her journey into the magical world of Harry Potter. It&#8217;s pretty amazing if you ask me, that a children&#8217;s book series has the ability to bring all these people together, and with such force.  It&#8217;s not an easy ticket to get, as I&#8217;ve been told, and I am feeling very fortunate that this blog was my ticket inside those doors, or who knows when I would have been able to get myself a ticket.  Because it takes some strong determination to get there. And she was not alone.  Sitting two or three seats down were two middle-aged men in full Hogwarts graduation drag sitting with a not-so-quiet containment, anxiously waving their newly purchased wands in the air, waiting for this show to begin.\n\nAnd then it begins, with a synchronized crack and snap of a cap, taking a simplistic image and expanding and pulling us into this magical world with a vengeance. What a magnificent adventure these talented people have created, a brilliant lesson for the theatrical world of what is fantastically possible, that even those who are arriving less informed will completely be wrapped up in the intricate and moving tale of a young man&#8217;s journey to find himself. No one can sit there and be immune to this tale. Joining me for this full day of Potter magic was my fellow theatre junkie, Antonio, who, as it turns out, has never read a Potter book nor seen any of the films about the young boy Wizard, Harry.  His only education of this universe resides in the program notes that beautifully encompasses much of what is needed to be known. Entitled Journey to the Eighth Story, it gives an edited down version of the seven years of Harry Potter, the prophecy, and a few good things to know, like what &#8216;Death Eaters&#8217; and &#8216;Dementors&#8217; are, what the &#8216;Azkaban Fortress&#8217; really is, what part does &#8216;Cedric Diggory&#8217; play in all this, and the importance of the &#8216;Ministry of Magic&#8217;. I will admit that if I had been given an entry quiz on the Potter universe, I probably would have failed, but even though all those pieces of this intricate puzzle are important, one of the great things about author J. K. Rowling, playwright Jack Thorne (Let The Right One In), and director John Tiffany&#8217;s miraculous tale is that all can enjoy this six-hour adventure, no matter what level of knowledge you have.  So much like the Moaning Myrtle moment, those in the know will revel in the connection like a good inside joke, smiling and clapping for the great job this team has done, but the true beauty of Harry Potter and the Cursed Child is that everyone can enjoy and take great pleasure in Moaning Myrtle, and this story. As meticulously directed by co-creater Tiffany (Broadway&#8217;s Once), no one is left behind; everyone is invited to this wondrous party as this production flies up high, somewhere between past visual and literary history and the present theatrical production presented here. They have found a way to give so many &#8216;tip of the hats&#8217; (thanks, Seth) to the books and the movies, sliding those staircases around the stage, totally saluting the magical creatives behind each and every one of those wondrous films, without making anyone feel left out or confused as the story pulses forward.\n\nAll I will say about this tale, is that at each and every break or intermission, the energy within the Lyric could not have been higher.  The thrill and excitement of the audience is electrifying, as the team of creators surpasses everyone&#8217;s expectations at every moment.  They have utilized every theatrical trick in the book, incorporating theatre magic that goes decades and advancing it into this modern era.  The number of &#8220;how did they do that&#8221; moments that rippled through the crowds is mind-boggling, as set designer, Christine Jones (Broadway&#8217;s American Idiot), lighting designer Neil Austin (Broadway&#8217;s Red), and Jamie Harrison (National Theatre&#8217;s Pinocchio), who is credited with illusions and magic, work overtime creating moment after moment that somehow defies gravity and realistic possibilities.  The snap of every cape, magnificently designed by costumer Katrina Lindsay (Broadway&#8217;s American Psycho) and sound designer Gareth Fry (The Encounter), together with the incredible work by movement director, Steven Hoggett (Broadway/West End&#8217;s The Curious Incident&#8230;) and his miraculous choreography, is award-worthy and sure to be celebrated along with every creative associated with this production. The dynamic wand dance, the hat sound effects, and the warped creation of time, to name only a few, makes us sit up and take notice time after time. The music department, with music supervisor and arranger Martin Lowe (Our Ladies of Perpetual Succour) and composer and arranger, Imogen Heap, a self-produced British recording artist for the last twenty years, have created a unified sound and storyline that only enhanced every minute of this non-musical, even those moments that I could have sworn the actors were on the verge of breaking into an emotional song.  Together, they all have achieved a gold standard that very few have done this season, taking a hugely entertaining and gripping story to a higher level of being, one that will go down in theatrical history. With this play and the other monolith show, the seven hour revival of Angels in America, Broadway has been gifted with a level of magic rarely seen.\n\nWith all that said, it is really what happens between the characters that matters here, and the actors are never overwhelmed by the mechanics that surround them.  They all rise to the occasion, giving us characterizations to be sucked into and be proud of. Utilizing themes of childhood emotional development and engagement to a level that I&#8217;m sure will foster thousands of theoretical papers on parent/child attachment, need, and trauma, the cast of professionals weave a story that comments on Harry&#8217;s difficult and traumatic upbringing, a story that has some direct parallels to his arch enemy, Lord Voldemort (Tom Riddle), a journey through loss and separation, that can lead a child down a path towards symbolically good or evil. The complexities of this story also draw on the very foundations of devotion and support within a child&#8217;s life, and what potential can develop from the continuous interaction between a child and their caregiver. Parenting is a difficult piece of magic in its own right, and nearly impossible to get right all the time, as seen through the upbringing of the next generations of Wizards and Witches. The offspring of the now grown heroes and heroines from the books and movies of Harry Potter are set free to create their own stories, running through the wall into that mysterious land that stands between train tracks, that hopefully will shape their souls, just as it once did with Harry, Hermoine, and Ron.\n\nHarry Potter, with a strong connection to history and past presentations is now portrayed most impressively by Jamie Parker (Old Vic&#8217;s High Society). He is now an adult, a Minister, and a loving parent, married to the wonderfully grounded Ginney, played kindly and strongly by Poppy Miller (Filter Theatre&#8217;s Twelfth Night).  They have three children, the oldest: James Jr. (Benjamin Wheelwright), the youngest: Lily Jr. (Olivia Bond/Brooklyn Shuck), and the main focus of this story, the middle child, Albus Potter, played aggressively by the talented Sam Clemmett (RSC&#8217;s Wendy & Peter Pan). Also fully present and thoroughly magnificent is Hermoine Granger, played brilliantly by the wonderfully elastic Noma Dumezweni (Young Vic&#8217;s Raison in the Sun). In some ways, she is given an amazing gift, the only one who doesn&#8217;t look like the actor who played the part in the films, freeing her to create something that resembles the aura of the film version but is more distinctive to her stature.  Hermoine, now running the show and married to her Hogwart&#8217;s sweetheart, Ron Weasley, played strongly by Paul Thornley (National Theatre&#8217;s Noises Off), they also have a child, one precocious young girl, naturally, by the name of Rose, played sassily by Susan Hayworth (MTC&#8217;s Ruined). She is worshipped, quite hilariously by Albus&#8217;s new best buddy and the unfortunate child of Harry&#8217;s childhood other nemesis, Draco Malfoy (Alex Price). His name is Scorpius Malfoy, played most heroically by Anthony Boyle (Belfast Lyric&#8217;s Herons), and he is one of the best things in this production.  His characterization of the bullied child of the legendary bully and enemy of the people is award-worthy, crafting the most engaging young man in the whole Potter universe. His budding friendship with the troubled Albus is the foundation of this whole six hours of the Cursed Child.  Is Scorpius the one cursed? Albus? or is there another child waiting in the wings to take that crown? Time will tell, and in this play&#8217;s beautiful creation where Time and the turning back of the clock, is of the essence, and plays a most important role, bending forward and backward, the six hours of Time-turning investigation into the meaning of parental love and friendship will fly by, exciting and invigorating all that are blessed with a ticket.  If you don&#8217;t have yours, do what you can to get one.  This piece of theater magic is well worth the effort.\n\n[&#8230;] most-nominated play in Broadway Tony history) and Rodgers & Hammerstein&#8217;s Carousel, with Harry Potter and the Cursed Child, Parts One and Two and My Fair Lady trailing closely behind with ten.   Mean [&#8230;]\n\n[&#8230;] Special citations were voted to Park Avenue Armory for adventurous theater programming, like the recent Yerma; to the theater company Transport Group, which just received a 2018 Drama Desk Nomination for their production of Strange Interlude; and to the staging, design, and illusions of Harry Potter and the Cursed Child. [&#8230;]\n\n[&#8230;] Harry Potter and the Cursed Child [&#8230;]\n\n[&#8230;] Tim Hatley (Broadway&#8217;s Spamalot), the lighting designer Neil Austin (Broadway&#8217;s Harry Potter&#8230;), and Adam Cork (NT&#8217;s London Road) the sound designer and composer of the original music, [&#8230;]\n\n[&#8230;] Girls leads with 15 nominations, followed by Harry Potter and the Cursed Child and SpongeBob SquarePants with 10 each. Once On This Island and Frozen were honored with nine [&#8230;]\n\n[&#8230;] most-nominated play in Broadway Tony history) and Rodgers & Hammerstein’s Carousel, with Harry Potter and the Cursed Child, Parts One and Two and My Fair Lady trailing closely behind with ten.  Winners will be announced Sunday June 10th [&#8230;]\n\n[&#8230;] that I am once again fully hooked on the Potter/Rowling universe, thanks to the miraculous play, Harry Potter and the Cursed Child currently casting its magic spell on Broadway, I&#8217;m thrilled and excited for another trip to [&#8230;]\n\n[&#8230;] Paul Castiles (NOVA&#8217;s Little Deaths), and movement director Yasmine Lee (Broadway&#8217;s Harry Potter&#8230;, Curious Incident&#8230;), that the structure of disconnection plays out in such an addictive [&#8230;]\n\n[&#8230;] Red Barn) into a tight and claustrophobic sliding room life, most delicately lit by Neil Austin (Harry Potter&#8230;), with sound design by Ian Dickinson (National&#8217;s Hangman), and illusions by Chris Fisher. [&#8230;]\n\n[&#8230;] (West End/Broadway&#8217;s King Charles III) & Christopher Reid (West End/Broadway&#8217;s Harry Potter&#8230;) and gorgeously period-crossing original music by Paul Englishby (West End/Broadway&#8217;s The [&#8230;]\n\n[&#8230;] ago&#8230;The glorious wonder of the piece remains solid and everlasting.&#8221; Full Review   Harry Potter and the Cursed Child   The company of Harry Potter and the Cursed Child. Photo Credit Matthew Murphy   &#8220;This play [&#8230;]\n\n[&#8230;] of the strong work by set designers, Christine Jones & Brett J. Banakis (Broadway&#8217;s Harry Potter), lighting by Kevin Adams (Broadway&#8217;s Head Over Heels), sound by Nevin Steinberg [&#8230;]\n\nWow great writting skill.. I really thanks to you for giving great knowledge. you can read   Harry Potter And The Cursed Child . I will Bookmark this website.  and recommend for everyone to read Top Novel books\n\n[&#8230;] Finding Neverland), intricate lighting by Neil Austin (Broadway&#8217;s Travesties, Harry Potter&#8230;), and wonderfully dynamic choreography and movement direction by Lynne Page (Broadway&#8217;s [&#8230;]\n\n[&#8230;] at the Linda Gross Theater, a new work by playwright Jack Thorne (Broadway&#8217;s King Kong, Harry Potter&#8230;) that attempts to give us a new vantage point on the lives of these young somewhat dysfunctional [&#8230;]\n\n[&#8230;] the Linda Gross Theater, a new work by playwright Jack Thorne (Broadway’s King Kong, Harry Potter…) that attempts to give us a new vantage point on the lives of these young somewhat dysfunctional [&#8230;]\n\n[&#8230;] what they do, mashing together wit with the scores of Tootsie, Ain&#8217;t Too Proud, Hamilton, Harry Potter and the Cursed Child, Oklahoma!, The Prom, A Chorus Line, and even The Ferryman. God, I hope you get [&#8230;]\n\n[&#8230;] The Lightning Thief could have been something magical. It has all the Harry Potter elements, but the producers and director Stephen Brackett (PH&#8217;s much better A Strange Loop) [&#8230;]\n\n[&#8230;] Lightning Thief could have been something magical. It has all the Harry Potter elements, but the producers and director Stephen Brackett (PH’s much better A Strange Loop) [&#8230;]\n\n[&#8230;] Arditti (West End/Broadway’s King Charles III) & Christopher Reid (West End/Broadway’s Harry Potter…) and gorgeously period-crossing original music by Paul Englishby (West End/Broadway’s The [&#8230;]\n\n[&#8230;] by the gorgeously detailed, but somewhat flat scenic design by Christine Jones (Broadway&#8217;s Harry Potter&#8230;) & Amy Rubin (Signature&#8217;s Thom Pain), with strong dramatic lighting by Jeff Croiter [&#8230;]\n\n[&#8230;] strong music supervision, orchestrations and arrangements by Martin Lowe (Broadway&#8217;s Harry Potter&#8230;) and a strong lead by music director Fred Lassen (Broadway&#8217;s Mean Girls), the band of magical [&#8230;]\n\n[&#8230;] other one, Clara, played intuitively by Madeline Weinstein (Broadway&#8217;s Harry Potter&#8230;) is what stands in Anna&#8217;s way, and in more than one manner. &#8220;She was trying to kill [&#8230;]\n\n[&#8230;] fiber presented, cloaked in garments beautifully designed by Katrina Lindsay (Broadway&#8217;s Harry Potter&#8230;), all most powerfully embodied inside the magnificent glass sectioned cube that is forever in [&#8230;]\n\n[&#8230;] with sound design by Ian Dickinson (National’s Hangman), and illusions by Chris Fisher (Harry Potter…). Specifically, Bobbie’s airline attendant boyfriend, Claybourne Elder&#8217;s Randy, wait, [&#8230;]\n\n[&#8230;] above a suburban house interior that never changes, designed by Christine Jones (Broadway&#8217;s Harry Potter&#8230;), with costuming by Toni-Leslie James (Broadway&#8217;s Come From Away), lighting by Jen Schriever [&#8230;]\n\n[&#8230;] The Sound Inside) and a few well-formulated magical illusions by Skylar Fox (Broadway&#8217;s Harry Potter&#8230;) that lead us all down the golden path to ponder the strangeness and sharpness of sickness and [&#8230;]\n\n[&#8230;] all in some wonderfully over-the-top 1970s consuming by Katrina Lindsay (West End/Broadway&#8217;s Harry Potter&#8230;). There is the scheming Jimmy Swaggart (Shepherd) and Pat Robertson (Rowe) on display, but it is [&#8230;]\n\n[&#8230;] we have his wife, played dutifully by Jessie Fisher (Broadway&#8217;s Harry Potter&#8230;), standing strong as his colorless support system, but that soon transitions to the unimaginably [&#8230;]\n\n[&#8230;] to the fine cast that has been assembled, including Brian Thomas Abraham (West End/Broadway&#8217;s Harry Potter&#8230;) as the Cook/Voice of Richard Parker; Avery Glymph (Broadway&#8217;s The Skin of Our Teeth) as [&#8230;]\n\n[&#8230;] engages, enhanced by the off-kilter dynamic choreographer of Steven Hoggett (Broadway&#8217;s Harry Potter&#8230;) that only occasionally gets in the way of itself by becoming distracting and unrequited at odd [&#8230;]\n\n[&#8230;] pile of decorations, thanks to some fine illusions work done by Skylar Fox (Broadway&#8217;s Harry Potter&#8230;). He pops up in a cloud of BBQ smoke, tasking his son with the avenging of his death. In what is a [&#8230;]\n\n[&#8230;] There is also the troubled father of Kirsten, played intently by Byron Jennings (Broadway&#8217;s Harry Potter&#8230;), who flounders a bit in the foreground, worried and angry about the road his daughter is taking, [&#8230;]\n\n[&#8230;] the other princesses; Princess Pea (Morgan Whitley), Sleeping Beauty (Ashley Chiu), Little Mermaid (Lauren Zakrin), and Rapunzel (Gabrielle Beckford), don&#8217;t even seem to know what books are, or even how to [&#8230;]\n\n[&#8230;] much like that the young man, Ryan, played to earnest perfection by Bubba Weiler (Broadway’s Harry Potter…; CSC’s Dead Poets Society), should have been able to go in that faulty truck of his, if it was [&#8230;]\n\n[&#8230;] solidly by husband Dan, embodied by the engaging Jamie Parker (Broadway&#8217;s Harry Potter&#8230;), the fractured family struggles on, isolated from one another, trying to ignore, numb, and help as [&#8230;]\n\n[&#8230;] There is also the troubled father of Kirsten, played intently by Byron Jennings (Broadway’s Harry Potter…), who flounders a bit in the foreground, worried and angry about the road his daughter is taking, [&#8230;]\n\n[&#8230;] engages, enhanced by the off-kilter dynamic choreographer of Steven Hoggett (Broadway’s Harry Potter…) that occasionally gets in the way of itself by becoming distracting and unrequited at odd moments, [&#8230;]\n\n[&#8230;] in some wonderfully over-the-top 1970s consuming by Katrina Lindsay (West End/Broadway’s Harry Potter…). The Pope in a box talking with the other two about the state of religion in America is [&#8230;]\n\n[&#8230;] high-tech, old-school theatre magic played out to perfection, like an Upside Down dark version of Harry Potter in reverse, but unlike that theatrical remodeling which takes us forward in the story of that [&#8230;]\n\n[&#8230;] The images crackle with promise, with Jefferson Mays as a coiled, calculating Salieri opposite Sam Clemmett’s mercurial, maddeningly gifted Mozart. I couldn’t help imagining what it must feel like to sit [&#8230;]\n\n[&#8230;] staging is one of the production’s great strengths. Christine Jones and Brett J. Banakis’s set assembles itself before our eyes from a pile of chairs and platforms [&#8230;]\n\n[&#8230;] by Tim Hatley (Broadway&#8217;s Life of Pi) and the lighting by Neil Austin (Broadway&#8217;s Harry Potter&#8230;) crafting a bleak, open landscape that evokes both isolation and exposure. Yet the much-touted [&#8230;]",
  "isFullReview": true,
  "dtliExcerpt": "CRITIC'S PICK\n\"It remains diamond-sharp in its staging and dazzling in its visual imagination, as magical as any spell or potion...Yet there are excisions, most of them so surgical you would never notice, though I did slightly miss the beloved Hogwarts groundskeeper Hagrid...This new version remains ravishingly entertaining, but is also, like the movie adaptations, a more obvious attempt to cash in on Pottermania.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": 79,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 407,
  "archivePath": "data/archives/reviews/harry-potter-2021/amny-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:36:57.597Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250806062801",
  "archiveOrgUrl": "http://web.archive.org/web/20250806062801/https://www.amny.com/entertainment/harry-potter-and-the-cursed-child-review-1.18207087/",
  "llmScore": {
    "score": 79,
    "confidence": "high",
    "range": {
      "low": 73,
      "high": 85
    },
    "bucket": "Positive",
    "thumb": "Up",
    "components": {
      "book": 68,
      "music": null,
      "performances": null,
      "direction": 85
    },
    "keyPhrases": [
      {
        "quote": "the play still makes for a rousing adventure narrative",
        "sentiment": "positive",
        "strength": 4
      },
      {
        "quote": "The countless special effects — both old-fashioned and high-tech in nature — are stunning",
        "sentiment": "positive",
        "strength": 4
      },
      {
        "quote": "a theatergoer with no prior \"wizarding\" experience should still be able to have a great time",
        "sentiment": "positive",
        "strength": 3
      }
    ],
    "reasoning": "Claude: Clear positive recommendation with praise for spectacle and broad appeal, despite acknowledging the script's derivative nature as 'polished fan fiction.' | GPT-4o-mini: The review expresses strong enthusiasm for the production's spectacle and adventure, with some minor reservations about the script's originality.",
    "flags": {
      "hasExplicitRecommendation": true,
      "focusedOnPerformances": false,
      "comparesToPrevious": true,
      "mixedSignals": false
    }
  },
  "llmMetadata": {
    "model": "ensemble:claude-sonnet-4-20250514+gpt-4o-mini",
    "scoredAt": "2026-01-27T02:58:53.874Z",
    "promptVersion": "3.0.0",
    "inputTokens": 0,
    "outputTokens": 0
  },
  "ensembleData": {
    "claudeScore": 78,
    "openaiScore": 80,
    "scoreDelta": 2,
    "thumbsMatch": null,
    "expectedThumb": null,
    "needsReview": false,
    "needsReviewReasons": []
  },
  "sources": [
    "show-score-playwright"
  ],
  "showScoreExcerpt": "CRITIC'S PICK\n\"It remains diamond-sharp in its staging and dazzling in its visual imagination, as magical as any spell or potion...Yet there are excisions, most of them so surgical you would never notice, though I did slightly miss the beloved Hogwarts groundskeeper Hagrid...This new version remains ravishingly entertaining, but is also, like the movie adaptations, a more obvious attempt to cash in on Pottermania.\"\n\nRead more",
  "rescoreReason": "fullText significantly longer than excerpt used for scoring",
  "previousLlmScore": 79,
  "rescoreCompletedAt": "2026-01-29T14:31:51.771Z"
}