{
  "showId": "harry-potter-2021",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": null,
  "publishDate": "2018-04-22T20:11:20-04:00",
  "fullText": null,
  "isFullReview": false,
  "bwwExcerpt": "But the additional-and perhaps the most powerful-enchantment of this particular trip to the theater is actually on our side of the footlights. Looking around me, I saw Hogwarts house colors, black robes, and wands filling the seats. When Jamie Parker made his first entrance as Harry Potter, and when Noma Dumezweni and Paul Thornley first appeared as Hermione and Ron, the already crackling energy in the dark auditorium erupted. (Later, I heard a woman actually scream in delight when a silhouette resembling that of Severus Snape began to glide forward, back to us, on the set's big central turntable.) This isn't normal entrance applause: The audience is cheering not for celebrities but for characters. Not that the actors aren't doing cheer-worthy work. On the contrary, they're turning in effective, endearing performances, from Parker's stubborn, struggling, still emotionally stunted Harry, to Thornley's dad-jokey Ron, to Dumezweni's restrained (but comically adept) Hermione and Poppy Miller's patient, not-to-be-messed-with Ginny.",
  "showScoreExcerpt": "\"Jam-packed with breakneck plot twists, charming performances, mind-bending spectacle, and, perhaps more surprisingly, moments of theatrical whimsy that feel, amidst the high-tech sorcery, delightfully simple...It effectively weaves serious themes with bouncy adventure narrative, it’s heartfelt and sometimes a touch hokey...You’re pretty much willing to forgive its shortcomings as it sweeps you along in a rush of rip-roaring, good-natured imagination.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Did-The-Critics-Think-HARRY-POTTER-AND-THE-CURSED-CHILD-Was-Magical-20180422",
  "textStatus": "missing"
}
