{
  "showId": "harry-potter-2021",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "http://www.vulture.com/2018/04/theater-review-harry-potter-and-the-broadway-spectacle.html",
  "publishDate": "2018-04-22T20:11:20-04:00",
  "fullText": "Save this article to read it later. Find this story in your account’s ‘Saved for Later’ section. “My geekness is a-quiverin’!” a teenage wizard named Scorpius yelps in excitement somewhere around hour five. He’s not the only one. If you’ve ever wanted to experience the feeling of 1,626 people’s geekness quivering in unison, you might try apparating into the Lyric Theater during a performance of the two-part, almost-six-hour-long, record-breakingly extravagant, and extravagantly entertaining Harry Potter and the Cursed Child. It’s not a cheap time to be a Harry Potter fan, but it is an exciting one. Jam-packed with breakneck plot twists, charming performances, mind-bending spectacle, and, perhaps more surprisingly, moments of theatrical whimsy that feel, amid the high-tech sorcery, delightfully simple, The Cursed Child is a remarkable and fitting addition to the Potter canon. By “fitting” I mean: It effectively weaves serious themes with bouncy adventure narrative, it’s heartfelt and sometimes a touch hokey, it could have used a more rigorous editor, and, if you have even a beginner’s taste for this kind of thing, you’re pretty much willing to forgive its shortcomings as it sweeps you along in a rush of rip-roaring, good-natured imagination. J. K. Rowling — whose progress from single parent on welfare scribbling in Edinburgh coffee shops to world’s first billionaire author is almost as well known as her tale of a boy wizard — conceived the original story for this eighth installment in the Potter saga along with the show’s director, John Tiffany, and Jack Thorne, who wrote the script (a best seller virtually as soon as it appeared in hardback, which … doesn’t happen to plays). Thorne has a definite feel for Rowling’s wordy, waggish, plot-happy sensibility, and Tiffany, along with his longtime collaborator, movement director Steven Hoggett, keeps the stage magic wheeling along at an often breathless pace. He needs to: Rowling devoted a full novel to each year her teenage hero spent at Hogwarts School of Witchcraft and Wizardry, whereas in The Cursed Child, that hero’s son speeds through the first three years at his dad’s alma mater within 15 minutes. Harry’s boy is named Albus Severus Potter, and fast-forwarding him from 12 to 15 years old in a matter of moments is only the first of the tricks the show plays with time. Mounted in the arched buttresses of Christine Jones’s shadowy, evocative set — which calls to mind a gothicized Kings Cross, the train station where young British wizards head to school — are a number of large clocks. A massive, ornate clock-face also dominated Alfonso Cuarón’s 2004 film of the third Harry Potter novel, The Prisoner of Azkaban (in my mind the first Potter movie worth paying attention to), and the parallel is no coincidence. The central device of that novel, a self-explanatory magical object called a Time-Turner, also plays a key role in The Cursed Child. We’re in for a time-hopping tale, full of butterfly effects and temporal twists. Think of it as Back to the Wizarding Future, or It’s a Wonderful Wizarding Life. But before we go any further, I should say that a few minor spoilers lie ahead. Nothing too shocking — after all, when you exit the theater, ushers hand you a pin exhorting you to #KEEPTHESECRETS. The show’s program even encourages you not to read the cast list until after the performance, if you don’t want to know which characters you’ll be encountering along the way. Well, I’ll have to name a few names below, so don’t hex me. Or you could always try obliviating yourself afterward. Rowling, Thorne, and Tiffany have done something rather brilliant in hanging their story on the ability to jump through time. The Time-Turner allows them to capitalize upon and revisit the world of the novels, the familiar terrain that fans know and love, while also crafting a new present-day narrative that’s affected by the characters’ dalliance with history. (As we’ve been taught by everyone from Bill and Ted to the X-Men, messing with the past is a tricky business.) The creators of The Cursed Child aren’t just attaching another sequel — they’re going back into the canon and making mischief in the margins, which feels deliciously naughty. Most of the play takes place 22 years after the events at the end of the final Harry Potter novel, which makes the Boy Who Lived not quite a boy anymore. You could call him Harried Potter now: The 40-something wizard is an overworked Ministry of Magic official with three kids. His boss, the Minister of Magic — his eternally type-A buddy, Hermione Granger, who else? — wants him to clear his desk of paperwork. His former rival — the still supercilious, short-fused, silver-blond Draco Malfoy — wants Harry to help quell the nasty rumors that his (Draco’s) son is actually the bastard child of the Dark Lord, Voldemort. And Harry’s wife, Ginny Weasley, wants him to try to connect with his middle child, the brooding, frustrated Albus. Poor Albus Severus seems to be the ill-starred child of the play’s title (or is he?). At any rate, he’s a classic misfit, struggling to live up to his father’s fame. Like any teenager, underneath the antisocial angst, he wants to be special, to be seen, to make his parents proud. But Albus isn’t particularly quick with spells, he hates Quidditch, his best (and only) friend is Scorpius Malfoy — Draco’s kid, the one surrounded by ominous rumors — and, worst of all, he’s a Slytherin. “What would you like me to do?” he snaps at his beleaguered father at one point, “Magic myself popular? Conjure myself into a new House? Transfigure myself into a better student? Just cast a spell, Dad, and change me into what you want me to be, okay?” Anyone who’s read The Order of the Phoenix knows that Harry himself was the reigning king of teenage angst, but age and anxiety have made it hard for the famous wizard to see just how like him his son is. He’s concerned but quick to anger, and in their clumsy efforts to connect, he and his boy end up lashing out. The Cursed Child is, at its heart, all about fathers and sons — the particular emotional blockages experienced by wizards (and muggles) of the dude persuasion — and the engine of its plot is Albus’s increasingly reckless quest both to win his father’s approval and (the essential teenage paradox) to defy/outshine him. The Time-Turner is the dangerous tool he employs in that conflicted attempt. “Everyone talks about all the brave things Dad did,” Albus tells Scorpius in a flush of stubborn conviction, “But he made some mistakes too. Some big mistakes, in fact. I want to set one of those mistakes right.” Sam Clemmett is an affecting Albus, believably teenager-ish with his tensed-up shoulders, furrowed brow, and coiled, simmering energy. Like the young Harry, Albus isn’t necessarily the most vivid character — he’s got to be average in certain ways, an audience cypher who triumphs not through extraordinary ability as much as through extraordinary will, loyalty, and courage. It’s a standard setup, but it works — due in part, as these setups often are, to the exceptional supporting work of a quirkier sidekick. As that sidekick — the homework-loving, candy-hoarding crown prince of nerds, Scorpius Malfoy — the tremendously talented Anthony Boyle carries a huge portion of the show on his skinny shoulders. Boyle, who won an Olivier for his performance in London, is channelling a young Rowan Atkinson in a chlorine-blond wig: He’s all gangly, awkward gestures, bursts of enthusiasm that come out somewhere between a snort and a shriek, and expert comic timing of the hopelessly-uncool-guy variety. He’s also — and this is critical if you’re an actor in a Rowling-based universe — incredibly skilled at converting large passages of exposition into dramatic action through the sheer energy of his delivery. He brings potentially moribund dialogue to life. Coming out of Boyle, lines like “We did it! We beat the library!” (uttered after a fight with a magical bookcase and, let’s face it, not the most compelling exclamation on the page) provoke riotous laughter. Scorpius is also compelling because he’s a genuinely new character. In Albus we’ve got a kind of Harry 2.0; in Hermione and Ron’s daughter Rose Granger-Weasley we get another, slightly snootier Hermione (though really, we have so little of Rose that the impression isn’t fully formed); in the upbeat, punky Delphi Diggory we have (at least for a while) a rebooted Tonks; and of course in the play’s adults we have, if we’re readers of the books, our old friends — with a few more gray hairs. Scorpius, however, is no reboot or variation on a theme but his own animal, and the writers know what they’re doing when, for a significant chunk of Part Two, they implement a plot twist that keeps Clemmett in the greenroom for a spell and moves Boyle to center stage. Without venturing into spoiler territory, it’s fair to say that the climax of The Cursed Child’s first part and the opening sequence of its second offer the hungry audience a generous helping of theatrical candy. Jamie Harrison — who’s first among the team credited for the show’s illusions and magic effects — is consistently working at full blast, and at the end of Part One, his visual sorcery spills out of the proscenium and takes over the room. (Great credit is also due to Neil Austin’s sharply articulated lighting design, whose deep swaths of shadow and streaks of blinding brightness facilitate much of the show’s misdirection.) Is the sudden immersive effect borderline Las Vegas–y? For sure. But it’s also pretty thrilling. And what makes The Cursed Child a continuous delight is that for every million-dollar effect (and there are plenty), there’s a piece of lo-fi stage magic that feels equally beloved by its creators. Watching the towering Brian Abraham — a human embodiment of the Sorting Hat — pluck his bowler out of the air where it seems to be floating unsupported; or seeing him sprinkle a handful of paper snow in anticipation of a flurry falling from the flies; or watching the cast ingeniously enact the effects of a transmogrifying potion: Moments like these keep the show’s makers, and we its watchers, honest. So does Tiffany’s multipurposing of objects like suitcases and steamer trunks, or his realization that actor-controlled rolling staircases offer a perfect dramatization of Hogwarts’ magically shifting internal architecture. Tiffany and Hoggett have done their share of scrappy, actor-driven theater, and they know that simple things — suitcases, stairs, an ensemble moving in unison, a well-timed cape swish — are where the real enchantment of their medium lies. But the additional — and perhaps the most powerful — enchantment of this particular trip to the theater is actually on our side of the footlights. Looking around me, I saw Hogwarts house colors, black robes, and wands filling the seats. When Jamie Parker made his first entrance as Harry Potter, and when Noma Dumezweni and Paul Thornley first appeared as Hermione and Ron, the already crackling energy in the dark auditorium erupted. (Later, I heard a woman actually scream in delight when a silhouette resembling that of Severus Snape began to glide forward, back to us, on the set’s big central turntable.) This isn’t normal entrance applause: The audience is cheering not for celebrities but for characters. Not that the actors aren’t doing cheer-worthy work. On the contrary, they’re turning in effective, endearing performances, from Parker’s stubborn, struggling, still emotionally stunted Harry, to Thornley’s dad-jokey Ron, to Dumezweni’s restrained (but comically adept) Hermione and Poppy Miller’s patient, not-to-be-messed-with Ginny. The truth, though, is that we haven’t come to see Parker: We’ve come to see Harry. And even after a star-studded movie series, our imaginary friends still remain more powerful, more solidly alive in our minds, than the famous figures who’ve erstwhile donned their robes. Though the experience we’re all engaged in is massively, knowingly commercial, it’s also a startlingly moving affirmation of the human appetite for story, and — because we’re now in a theater instead of nestled in our beds with a book — the bodily power of sharing that story with 1,000 other breathing, quivering souls in real time. Sitting in the Lyric today is like standing on the New York docks in 1841 where, legend has it, avid American readers of Dickens’ serialized novels flocked in passionate crowds, crying out to the sailors whose boats were bringing the latest installment of The Old Curiosity Shop: “Is Little Nell dead?” Harry Potter and the Cursed Child is at the Lyric Theatre.",
  "isFullReview": false,
  "bwwExcerpt": "But the additional-and perhaps the most powerful-enchantment of this particular trip to the theater is actually on our side of the footlights. Looking around me, I saw Hogwarts house colors, black robes, and wands filling the seats. When Jamie Parker made his first entrance as Harry Potter, and when Noma Dumezweni and Paul Thornley first appeared as Hermione and Ron, the already crackling energy in the dark auditorium erupted. (Later, I heard a woman actually scream in delight when a silhouette resembling that of Severus Snape began to glide forward, back to us, on the set's big central turntable.) This isn't normal entrance applause: The audience is cheering not for celebrities but for characters. Not that the actors aren't doing cheer-worthy work. On the contrary, they're turning in effective, endearing performances, from Parker's stubborn, struggling, still emotionally stunted Harry, to Thornley's dad-jokey Ron, to Dumezweni's restrained (but comically adept) Hermione and Poppy Miller's patient, not-to-be-messed-with Ginny.",
  "showScoreExcerpt": "\"Jam-packed with breakneck plot twists, charming performances, mind-bending spectacle, and, perhaps more surprisingly, moments of theatrical whimsy that feel, amidst the high-tech sorcery, delightfully simple...It effectively weaves serious themes with bouncy adventure narrative, it’s heartfelt and sometimes a touch hokey...You’re pretty much willing to forgive its shortcomings as it sweeps you along in a rush of rip-roaring, good-natured imagination.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Did-The-Critics-Think-HARRY-POTTER-AND-THE-CURSED-CHILD-Was-Magical-20180422",
  "textStatus": "complete",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.963Z",
  "textWordCount": 2108,
  "textFetchedAt": "2026-01-25T14:27:07.092Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/harry-potter-2021/vulture--sara-holdren_2026-01-25.html",
  "textQuality": "full",
  "sourceMethod": "bww-roundup"
}
