{
  "showId": "ohio-state-murders-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Naveen Kumar",
  "url": "https://variety.com/2022/legit/reviews/ohio-state-murders-review-audra-mcdonald-broadway-1235454379/",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "McDonald is also performing a double role — playing both present-day and college-age Suzanne, where previous productions have cast two actors. It’s another means of showing how fresh decades-old wounds can feel, and their lifelong reverberations, while taking full advantage of McDonald’s versatility. Leon’s production presents a bold, and unmistakable, visual representation of Kennedy’s argument for literature and imagination as both proof of human horror and an essential escape from it. The set design by Beowulf Boritt, a suspended cascade of bookshelves, sharply lit by Allen Lee Hughes, might be too on the nose were it not so startlingly beautiful. By any obvious measure, Kennedy’s arrival on Broadway in her ninth decade is long overdue. Commercial theater has not generally been the most fertile ground for daring, confrontational work that spotlights the voices and experiences of the most marginalized. But when an exception takes root, with a team of artists as visionary as these, it’s certainly worth the wait.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Audra-McDonald-Stars-In-OHIO-STATE-MURDERS-On-Broadway-20221208",
  "showScoreExcerpt": "“ 'Ohio State Murders' is not a mystery, nor is it structured around conventions of suspense — the crimes are right there in the title, and disclosures about its victims and perpetrator occur almost incidentally.\"\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "playbillVerdictUrl": "https://variety.com/2022/legit/reviews/ohio-state-murders-review-audra-mcdonald-broadway-1235454379/",
  "sources": [
    "show-score-playwright",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 10
}
