{
  "showId": "the-rose-tattoo-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2019/10/15/the-rose-tattoo-tennessee-williams-rose-isnt-a-rose-isnt-a-rose/",
  "publishDate": "2019-10-15T21:00:17",
  "fullText": "Trip Cullman—who directs the revival of Tennessee Williams’ 1951 Tony award-winning play The Rose Tattoo, headlined by Marisa Tomei—thinks this item from the playwright’s canon is a comedy. He’s not altogether wrong, but he’s not altogether right, either. In the long run of this somewhat trimmed version, his oversight makes a significant and problematic difference.\n\nFor an essay Williams inserted in a printed edition of the script, he twice refers, without speaking explicitly of The Rose Tattoo, to “plays in the tragic tradition.” On the other hand, he includes one late stage direction stating that “the scene should be played with the pantomimic lightness, almost fantasy, of an early Chaplin comedy.”\n\nSo even if it’s considered that Williams was aiming at the comic more than the tragic—which isn’t necessarily so—an  obligatory tone is missing. Another way of putting this is to maintain that Williams’ insistence on the play’s profundities is set aside for a production that skims the text’s surface and is content to do only that.\n\nWilliams is telling the story of Serafina Delle Rose, a Sicilian seamstress living on the Gulf shore somewhere between New Orleans and Mobile. Her 40-ish heart has been severely pummeled twice by her trucker husband Rosario. He gave her the rocky business for the first time when he’s killed in a road accident. He wounds her the second time when she learns (her neighbors already know this) that he had been running around with gambling-house dealer Estelle Hohengarten (Tina Benko).\n\nA Madonna-devoted Catholic of rough feelings and thin skin, Serafina isn’t the sort to live a deprived life given to superficial emotions that others regard as easily mocked, as overblown. If further proof of her inner torment is needed, it helps to remember that Williams wrote the play for the irrepressibly tragic Anna Magnani. She only turned down his offer to introduce it on stage because she feared appearing before a live audience. Nevertheless, she said she was prepared to make the movie. (She did, of course, and won the 1955 Oscar as best actress.)\n\nAllowing herself to become blowzy after Rosario’s demise and raising her rebellious 15-year-old daughter Rosa (Ella Rubin), Serafina longs from the center of her being—not the outer layers—for a transforming epiphany, a “sign” from the Madonna she worships. She receives one but only warms to it slowly when trucker Alvaro Mangiacavallo (Emun Elliott)—who also hauls, as did Rosario, bananas—shows up on her humble doorstep.\n\nA good-hearted oaf able to joke about his surname—a name holding within it the macho implication of a man who could eat a horse—Alvaro poses a quandary for Serafina. Though wary of him, she does mention that Rosario had a rose tattoo on his chest. When he returns the following day, she has difficulty resisting the eager fellow: He’s had a rose tattooed on his chest.\n\nCullman is on safe ground allowing the humor in the Serafina-Alvaro encounters to flow, and good for Tomei and Elliott making the most of it. He’s also busy at getting laughs from Rosa’s first dates with fleet’s-in sailor Jack Hunter (Burke Swanson), whose naïveté is like an aura safeguarding him but whose name is another cue to Williams’ penchant for script-populating hulks.\n\nBut with Tomei, the Williams heartbreak is elusive. She looks the neighborhood scourge in costume designer Clint Ramos’s slips and robes and Tom Watson’s wigs, but the debilitating weight of her loss and the fear that it won’t be regained is not in her eyes or in the effortful way she carries herself. Tomei is effective as far as she goes, and it’s likely she has it in her to go much farther. But she hasn’t been guided that way.\n\nWithout the deep grieving that penetrates Serafina and emanates from her, this Rose Tattoo falls short of its potential impact. Yes, the women watching her—sometimes keening in black—form a mournful Greek (Italian?) chorus. (Sound designer Fitz Patton and Jason Michael Webb supply original music.) Obstreperous children (Alexander Bello, Isabella Iannelli, Jacob Michael Laval) shoot through like omens (and foreshadow the Cat on a Hot Tin Roof no-neck monsters), but they don’t lend enough of the needed doleful thickening.\n\nMark Wendland’s set, surely in accordance with Cullman’s request, registers as a mistake. It features one window with a liftable shutter, a Madonna shine, a shelf holding a container in which Rosario’s ashes supposedly rest, and very few walls. It’s an airy space. Upstage, Lucy Mackinnon projects breaking Gulf waves.\n\nThe suggestion is that The Rose Tattoo is a memory play. It isn’t. Wendland’s contribution might be ideal if this were the Wingfield home in The Glass Menagerie. But this is the Delle Rose home that Serafina has stuffed with her paraphernalia. It’s somewhere stifling, an environ where increasingly independent Rose, ripening to 18, might not want to bring friends.\n\nWilliams did write one out-and-out comedy, Period of Adjustment. But The Rose Tattoo can’t be cited as a warm-up to it. Always to be kept in mind is that his plays, though not all of them, are to some extent autobiographical. The women in them—it’s problematic to ignore this—are fictionalized, even transgendered versions of himself. He inveterately longed for the right man to enter his life but was ambivalent about just who that man might be, how trustworthy, how kind that person might be. (His longtime companion Frank Merlo served the purpose best over the years.) The anxiety that wracked and distracted him was always there. That gnawing festers in Serafina. Without it, The Rose Tattoo can’t fully flower.\n\nThe Rose Tattoo opened October 15, 2019, at American Airlines Theatre and runs through December 8. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-reviews"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2019/10/15/the-rose-tattoo-love-aint-sweeter-the-second-time-around/",
  "bwwExcerpt": "But with Tomei, the Williams heartbreak is elusive. She looks the neighborhood scourge in costume designer Clint Ramos's slips and robes and Tom Watson's wigs, but the debilitating weight of her loss and the fear that it won't be regained is not in her eyes or in the effortful way she carries herself. Tomei is effective as far as she goes, and it's likely she has it in her to go much farther. But she hasn't been guided that way.",
  "bwwScore": 6
}
