{
  "showId": "the-rose-tattoo-2019",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Unknown",
  "url": "https://www.nytimes.com/2019/10/15/theater/the-rose-tattoo-review-marisa-tomei.html",
  "publishDate": null,
  "fullText": "https://www.nytimes.com/2019/10/15/theater/the-rose-tattoo-review-marisa-tomei.htmlShare full article49Advertisement\n\nYou thought tropical storms were disruptive? The Italian-Americans living along the Gulf Coast in the Roundabout Theater Company’s untethered revival of Tennessee Williams’s “The Rose Tattoo” are really up against the elements, and so are the actors playing them.\n\nBut it’s nothing as palpable as a hurricane that keeps knocking them off balance and making them flail like sandpipers in a heavy wind. To understand what’s sweeping through this production, which opened at the American Airlines Theater on Tuesday with a cast led by a valiant Marisa Tomei, listen to the words of Assunta, a wise old Sicilian signora.\n\n“There is something wild in the air,” says Assunta (Carolyn Mignini), in the play’s opening moments, to Serafina (Tomei), the ecstatically married wife of a virile truck driver. “No wind but everything is moving.” She adds that she can hear the noises of the stars.\n\nA skeptical Serafina, who says she sees “nothing moving,” ascribes the noise to termites. But Trip Cullman, the imaginative but erratic director here, appears to have taken Assunta’s emotional weather report to heart.\n\nJust look at Mark Wendland’s wide-open set (lushly lighted by Ben Stanton), which conjures a world without walls. Pieces of furniture, door frames, a sewing machine and a candle-laden shrine to the Virgin Mary seem to float against a video backdrop of waves lapping against a shore. (Lucy Mackinnon did the projection design). And huddled beneath the power lines that stretch above the stage is a thick congregation of pink flamingos.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Marisa Tomei Braves a Typhoon in ‘The Rose Tattoo’: Trip Cullman’s unmoored production of this atypical comedy from Tennessee Williams presents sexual attraction as a raging force of nature.\"\n\nRead more",
  "contentTier": "truncated",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "duplicateOf": "nytimes--ben-brantley.json",
  "textWordCount": 275,
  "archivePath": "data/archives/reviews/the-rose-tattoo-2019/nytimes--unknown_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:53:45.498Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251114062358",
  "archiveOrgUrl": "http://web.archive.org/web/20251114062358/https://www.nytimes.com/2019/10/15/theater/the-rose-tattoo-review-marisa-tomei.html",
  "textIssues": [
    "Word count too low: 275 (min: 300)"
  ],
  "duplicateTextOf": "nytimes--ben-brantley.json",
  "wordCount": 275,
  "tierReason": "Short text (275 words)"
}