{
  "showId": "the-rose-tattoo-2019",
  "outletId": "timeout",
  "outlet": "Time Out",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/the-rose-tattoo-review-broadway-marisa-tomei-tennessee-williams",
  "playbillVerdictUrl": "https://www.timeout.com/newyork/theater/the-rose-tattoo-review-broadway-marisa-tomei-tennessee-williams",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "The Rose Tattoo gets much more pleasurable as it opens into bloom. Tomei is not ideally cast as Serafina-her lightness works against her-and the first act is thick with Italian accents and gesticulation. (You half expect someone to step forward and say, 'Mama mia, that's a spicy drama!') Trip Cullman's staging seems to lean into the potential for camp; the back half of Mark Wendland's abstract set is crowded with dozens of lawn-ornament pink flamingos, and Tina Benko, as Rosario's mistress, looks and acts like a human pair of scissors. But Tomei's great talent for romantic comedy clicks into place in her flirtation with Mangiacavallo. Although the tone of the play and production waver too much to leave a permament impression, The Rose Tattoo has an interesting place in the Williams canon. There is no shortage, in his plays, of lustful, delusional women who fall for attractive younger men. But rarely do they have, as here, even the hope of a happy ending.",
  "bwwScore": 6,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Marisa-Tomei-Stars-In-Tennessee-Williams-THE-ROSE-TATTOO-See-What-The-Critics-Are-Saying-20191015",
  "showScoreExcerpt": "\"'The Rose Tattoo' gets much more pleasurable as it opens into bloom. Tomei is not ideally cast as Serafina-her lightness works against her-and the first act is thick with Italian accents and gesticulation. But Tomei's great talent for romantic comedy clicks into place in her flirtation with Mangiacavallo.\"\n\nRead more"
}