{
  "showId": "the-rose-tattoo-2019",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2019/legit/reviews/the-rose-tattoo-review-marisa-tomei-1203380064/",
  "publishDate": "October 15, 2019",
  "fullText": "Oscar winner Tomei plays one of Tennessee Williams’s enduring women.\n\n\"The Rose Tattoo\" is what happens when a poet writes a comedy — something strange, but kind of lovely. The same might be said of director Trip Cullman's production: Strange, if not exactly lovely. Even Marisa Tomei, so physically delicate and expressively refined, seems an odd choice to play the lusty and passionate protagonist, Serafina Delle Rose. She, too, is kind of lovely — if lost.\n\nRanks of pink flamingoes marching into the sunset at the back of the stage are the first sign that this won't be a conventional reading of Williams's bittersweet play about an Italian widow who has embraced, like some fateful lover, her all-consuming grief over her husband's death.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nThe doors and walls and windows of Serafina's little cottage on the Gulf Coast are mere suggestions in Mark Wendland's theoretical set, and the days seem to confine themselves to what Ben Stanton's lighting design renders as eternal dusk. The only hint of unforced poetry is a chorus of women dressed in black and singing mournful Italian songs, as unnoticed and uncalled-for as those pink flamingoes, but strangely moving.\n\nWhen her beloved husband is lost at sea, Serafina is inconsolable, even when another grieving woman, Estelle Hohengarten (Tina Benko) reveals herself to be his mistress. For the next three years, Serafina prays at her household shrine to the Virgin Mother (the stacked-up votive candles are a nice touch), awaiting a sign that she can return to life. Tomei is best in these quiet moments, torn between crushing grief and pulsing life — and wearing her conflicted feelings like a hairshirt.\n\nPhysically, the actress’ slender frame and refined features suggest little of Serafina's earthy presence, despite the fact that costumer Clint Ramos has draped her in unflattering 1950s-era weeds and clodhopper shoes. We'll just have to take it on faith that the widow Delle Rose — a dressmaker, no less — is incapable of running up a few pretty frocks on her nicely humming sewing machine.\n\nEmun Elliott gives the show a shot of adrenaline when he shows up as the warm-hearted if absurdly named Alvaro Mangiacavallo. In literal translation, that means \"eat a horse\" and it comes close to being an ethnic slur. But while a dialect coach is credited in the program, the real slurs are the thuggish Italian accents. (If everyone is supposedly speaking in plain English, what's with all the stereotypical inflections?)\n\nDespite a huge cast of characters, this is a very slender play — more a mood piece, really — and far from the playwright's best. Without any solid scene setting, the minimalist production provides little environmental support. In fact, the bare-boned set seems to be an actual hazard, because it forces the performers to exit down a sharply raked ramp — and then to duck at the last minute, lest they bump their heads. Theater people are such pros, they gladly suffer for their art. But this is above and beyond the call of duty.",
  "isFullReview": true,
  "dtliExcerpt": "Marisa Tomei brings a feral intensity to the role of Serafina, the Sicilian widow whose passionate nature is both her blessing and her curse.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Marisa Tomei brings a feral intensity to the role of Serafina, the Sicilian widow whose passionate nature is both her blessing and her curse.",
  "contentTier": "invalid",
  "contentTierReason": "Short text (24 words)",
  "textQuality": "full",
  "textWordCount": 529,
  "archivePath": "data/archives/reviews/the-rose-tattoo-2019/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:31:51.046Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 529,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-04T04:37:49.644Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or quote about a performance, not a complete review with any evaluative verdict or recommendation.; openai: This text is a brief description of Marisa Tomei's performance, not a full review or evaluation of the show.",
  "promptVersion": "5.2.0",
  "playbillVerdictUrl": "https://variety.com/2019/legit/reviews/the-rose-tattoo-review-marisa-tomei-1203370049/",
  "sources": [
    "web-search",
    "playbill-verdict"
  ]
}
