{
  "showId": "wit-2012",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/review/wit-theater-review-282914/",
  "publishDate": "January 26, 2012",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Cynthia Nixon brings fierce intelligence and emotional authenticity to her portrayal of Vivian Bearing, the Donne scholar facing ovarian cancer with characteristic wit and increasing vulnerability.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "A deserving winner of the 1999 Pulitzer Prize for Drama, Margaret Edson’s Wit is a work of delicately calibrated opposites. It pits detached clinical observation on one side against raw human emotion on the other, while somehow making dry humor and wrenching pathos travel hand in hand. In Lynne Meadow’s unerringly focused staging for Manhattan Theatre Club, and above all in Cynthia Nixon’s shattering performance, that balancing act is rendered with piercing accuracy.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Cynthia Nixon brings fierce intelligence and emotional authenticity to her portrayal of Vivian Bearing, the Donne scholar facing ovarian cancer with characteristic wit and increasing vulnerability.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (26 words)",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/velocity-autumn-theater-review-697976",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews"
  ],
  "textWordCount": 267,
  "archivePath": "data/archives/reviews/wit-2012/hollywood-reporter--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:48:31.218Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Word count too low: 274 (min: 300)",
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "The director's first 3D outing, a kids' adventure that also pays homage to the early days of movies, has screened for the media, the DGA and the Academy. The Paramount release drew hearty praise from viewers as diverse as Paul Thomas Anderson and Slash.\n\nMartin Scorsese will receive the Harold Lloyd Award, the International 3D Society’s highest filmmaker honor for artistic and technical achievement in 3D. The award will be presented at the Society’s Creative Arts Awards ceremony, Feb. 1 at the Beverly Hills Hotel.\n\n“Marty Scorsese has embodied Harold Lloyd’s vision and passion for captivating movie fans around the world for his entire career,” said Suzanne Lloyd, Lloyd’s granddaughter and chairman of Harold Lloyd Entertainment, who will make the presentation. “With Hugo he has shared his love of filmmaking and filmmakers, in 3D, which would also have thrilled Harold.”\n\nTHR COVER STORY: Martin Scorsese Talks ‘Hugo,’ Recurring Nightmares and How His 12-Year-Old Rules the Roost\n\n“For all of us involved in the 3D creative process, Mr. Scorsese’s contribution this year with Hugo is an artistic achievement we all celebrate,” said DreamWorks Animation’s Jim Mainard, chairman of the society.\n\nThe Harold Lloyd Award was established by the 3D Society and the Lloyd Family. “Mr. Lloyd was a life-long advocate for 3D movies, although technology never allowed him to realize his dream. But in joining last year’s recipient, James Cameron, Mr. Scorsese has not only realized that dream, but he has produced a work of art,” said Jim Chabin, president of the Society.\n\nLloyd’s great, great granddaughter, actress Jackie Lloyd, will assist presenters on-stage at this year’s honors.",
  "bwwScore": 9
}
