{
  "showId": "operation-mincemeat-2025",
  "outletId": "BWAYNEWS",
  "outlet": "Broadway News",
  "criticName": null,
  "url": "https://broadwaynews.com/2025/03/20/operation-mincemeat-broadway-review/",
  "publishDate": "2025-03-20",
  "fullText": "Skip to content < Hamilton Richard Rodgers Musical Wicked Gershwin Musical Chicago Ambassador Musical Hadestown Walter Kerr Musical Harry Potter and the Cursed Child Lyric Play The Lion King Minskoff Musical & Juliet Stephen Sondheim Musical MJ Neil Simon Musical The Outsiders Bernard B. Jacobs Musical Hell's Kitchen Shubert Musical Aladdin New Amsterdam Musical Oh, Mary! Lyceum Play Water for Elephants Imperial Musical Moulin Rouge! The Musical Al Hirschfeld Musical The Wiz Marquis Musical Cabaret August Wilson Musical The Notebook Schoenfeld Musical The Great Gatsby Broadway Musical Stereophonic John Golden Play Suffs Music Box Musical Maybe Happy Ending Belasco Musical Sunset Boulevard St. James Musical Death Becomes Her Lunt-Fontanne Musical Gypsy Majestic Musical Back to the Future Winter Garden Musical SIX: The Musical Lena Horne Musical The Book of Mormon Eugene O'Neill Musical Illinoise St. James Musical Smash Good Night, and Good Luck Othello A Wonderful World: The Louis Armstrong Musical Studio 54 Musical Eureka Day Samuel J Friedman Play Once Upon a Mattress Hudson Musical The Hills of California Broadhurst Play BOOP! The Musical Broadhurst Musical Swept Away Longacre Musical Redwood Nederlander Musical Romeo + Juliet Circle In The Square Play The Queen of Versailles English Todd Haimes Play Our Town Ethel Barrymore Play Floyd Collins Vivian Beaumont Theater Musical JOB Hayes Theater Play The Roommate Booth Play Left on Tenth James Earl Jones Play Tammy Faye Palace Musical The Last Five Years Hudson Musical Cult of Love Hayes Theater Play McNeal Vivian Beaumont Theater Play Stephen Sondheim's Old Friends Samuel J Friedman Musical Hello, I'm Dolly The Pirates of Penzance Todd Haimes Musical >",
  "originalScore": null,
  "assignedScore": 80,
  "source": "reviews-json-stub",
  "needsFullText": true,
  "textStatus": "partial",
  "isFullReview": true,
  "textWordCount": 266,
  "archivePath": "data/archives/reviews/operation-mincemeat-2025/bwaynews--unknown_2026-01-25.html",
  "textFetchedAt": "2026-01-25T05:02:41.691Z",
  "textIssues": [
    "Word count too low: 266 (min: 300)",
    "Show title not found in text"
  ]
}