{
  "showId": "operation-mincemeat-2025",
  "outletId": "CSCE",
  "outlet": "Culture Sauce",
  "criticName": "Thom Geier",
  "url": "https://culturesauce.com/2025/03/20/operation-mincemeat-broadway-review/",
  "publishDate": "2025-03-20",
  "fullText": "Theater &#8216;Operation Mincemeat&#8217; sends up history with humor, harmony, and heart (Broadway review) Zoë Roberts, Jak Malone, Natasha Hodgson, David Cumming, and Claire-Marie Hall in &#039;Operation Mincemeat&#039; (Photo: Julieta Cervantes) Date: March 20, 2025 Author: Thom Geier 3 Comments It&#8217;s been a decade since Hamilton exploded the possibilities of what musical theater could do with historical subject matter, jam-packing a lot of narrative and footnote-worthy tangents into a lyrically complicated but harmonically rich vehicle. The form is alive and well in the new British import Operation Mincemeat , which takes a bizarre-but-true chapter of World War II spycraft and turns it into a genre-busting celebration of musical storytelling that bursts with both hilarity and heart. First, the hilarity. The pitch-perfect cast of five &#8212; who originated the roles in the acclaimed London production &#8212; operate like a well-oiled comedic machine. They seamlessly shift among dozens of characters, both male and female, sometimes pulling off a switch of costume and accent mid-sentence. Three members of the ensemble are part of the SplitLip troupe that collaborated on the score and the book, which drips with clever dialogue and witty one-liners, as when the pompous MI5 agent Ewen Montagu (Natasha Hodgson, who nails old-boy pretension) describes a dressing-down by his superior as &#8220;some nonsense about attention to detail, I don’t know, I wasn’t listening.&#8221; Or when his meek, natural history-obsessed colleague Charles Cholmodeley (David Cumming) shouts out non sequiturs about newts. Cumming&#8217;s Cholmodeley delivers one of the most unusual &#8220;I wish&#8221; songs in the history of musical theater, waxing poetic about his envy of the critters he studies as a hobby. &#8220;I wish I was a maggot,&#8221; he sings, noting that for those pesky bugs &#8220;the parts are already supplied, I&#8217;d be born with the things to give me wings so I could fly.&#8221; Instead, his tongue-tied shyness relegates him to a desk job where he&#8217;s easily overlooked even after hatching a deviously clever plan to mislead the Nazis about the target of a major 1943 invasion by Allied forces. His scheme involves dumping a body on the shores of Nazi-friendly Spain that they make to look like a downed British pilot &#8212; and loading it up with fake plans for an Allied attack on Sardinia in the hope that the Nazis will divert their forces from Sicily, the real Allied target. Operation Mincemeat was an actual MI5 operation during the war, and has been the subject of a best-selling book by historian Ben Macintrye as well as a 2021 film starring Colin Firth. The musical has a great deal of fun with the absurdity of the plot, as well as some of its more esoteric details &#8212; like the fact that Ian Fleming (Zoë Roberts) was a junior MI5 agent during the war who pushed out-there ideas like a submarine car that foreshadowed his work on his James Bond novel series. &#8220;The bottom of the Thames is littered with Aston Martins thanks to him,&#8221; quips agency boss Johnny Bevan (also played by Roberts). Jak Malone and Zoë Roberts in &#8216;Operation Mincemeat&#8217; (Photo: Julieta Cervantes) The show also dips into social commentary, extolling the role of women like Jean Leslie (Claire-Marie Hall), a clerical worker at the agency who played a big role in fleshing out the backstory of the operation&#8217;s &#8220;Trojan corpse&#8221; and who yearned for a post-war future of gender equality in the U.K. When her mother complains that she&#8217;ll never find a husband working in the War Office, Jean admits, &#8220;hey&#8230; fingers crossed, am I right?&#8221; That budding assertion of feminism (and shunning of a strictly domestic life) segues into a girl-group bop that leans heavily on Beyoncé&#8217;s &#8220;Single Ladies&#8221; (including in Jenny Arnold&#8217;s zippy choreography) that underscores how the war opened up career opportunities for women. The score is a serviceable but savvy mashup of genres and styles, from British music hall to Hamilton -style rap to sea shanty to pop. The second act opens with an infectious K-Pop-inspired number, &#8220;Das Ubermensch,&#8221; in which the cast dons Nazi uniforms to perform synchronized dance moves to disco-ready lyrics like, &#8220;Hands up for the Fuhrer, all night! Goose step to the left, jump to the far right.&#8221; (Yes, there are clear echoes of &#8220;Springtime for Hitler&#8221; from The Producers here.) It&#8217;s a pity that Mike Walker&#8217;s sound mix in the Golden Theatre is so muddy because the audience is liable to miss some of the best lyrical jokes, though Ben Stones&#8217;s dynamic, ever-changing set and costume designs and Mark Henderson&#8217;s lighting go a long way to selling the humor. Operation Mincemeat isn&#8217;t just an exercise in turning history into a glorified pop concert, à la Six , or spoofing real events with the broad strokes o...",
  "originalScore": null,
  "assignedScore": 85,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T04:54:45.644Z"
}