{
  "showId": "operation-mincemeat-2025",
  "outletId": "daily-beast",
  "outlet": "The Daily Beast",
  "criticName": "Tim Teeman",
  "url": "https://www.thedailybeast.com/operation-mincemeat-review-seasons-most-surprising-showstopper-lands-on-broadway/",
  "publishDate": "March 20, 2025",
  "fullText": "An early candidate for Broadway’s song of the season has announced itself. \n\n“Dear Bill” is sung by the actor Jak Malone playing the character of Hester Leggatt, an MI5 secretary during World War II, in the charming, funny, tonally scattered, and sporadically piercing musical Operation Mincemeat (Golden Theatre, currently booking to Aug. 10), freshly transferred to Broadway from an award-winning ongoing run in London’s West End.\n\nThe semi-sung, semi-spoken number is a sudden, dropped rock of seriousness in an otherwise frothing river of frivolity, underlining the musical’s core intention to memorialize wartime’s not-famous and unlauded.\n\nMalone does not belt, but rather navigates “Dear Bill” as if composing it in real time: a quiet, reticent confessional. A letter of yearning, separation, and devastation (with echoes of Flanders and Swann, Noel Coward, Mrs. Miniver, and Vera Lynn), “Dear Bill” is phrased around the most mundane things—a stream of consciousness, all concealing via the stiffest of stiff-upper-lips, those things you really want to say to a much-missed loved one.\n\nIts free verse, and precisely enunciated lyrics begin: “Dear Bill/I’m afraid I’ve not got long to write/I’m off to Mary’s/You know how she feels about Bridge night./It’s been a few days/I thought that I’d send a few lines/Next door’s Greyhound came into the garden this morning./I think he likes the roses/ They’re doing fine/I used some twine to tie them up and rein them in/I hope they’ll bloom next spring.”\n\nThe audience’s appreciative response to the song is intense. Malone’s pitch-perfect clipped recitation, and the thudding impact of “Dear Bill,” stop the show. It is the least likely, most surprising showstopper so far this Broadway season in a show defined by a distinctly British quirkiness rooted in its source material. \n\nMincemeat’s verbal and physical comedy bring to mind Monty Python and pantomime, appositely enough for this wackiest of true stories about how the British military plotted to use a corpse, fictitiously styled to be a Royal Marines officer named Captain (Acting Major) William Martin, to deceive the Nazis over the Allied invasion of Sicily in 1943. An opening statement outlining the show’s basis in history was added to the Broadway production because director Robert Hastie kept hearing many Americans thought it so nuts it had to be fiction.\n\n‘Buena Vista Social Club’ Is Broadway’s Most Fabulous PartyFIESTATim TeemanThe cast of five play the real-life core characters involved—Malone as Leggatt, Natasha Hodgson as Naval intelligence officer Ewen Montagu, David Cumming as intelligence officer Charles Cholmondeley, Zoë Roberts as British army officer Johnny Bevan, and Claire-Marie Hall as MI5 secretary Jean Leslie—as well as a dizzying array of subsidiary characters. \n\nAll five also pop us as a panoply of other characters, including deep-of-voice seamen, gossiping secretaries, and an incredibly louche British vice-consul in Spain when the last thing you need to execute a sensitive, war-altering plan is an incredibly louche British vice-consul in Spain. \n\nA significant part of the joy of the show, directed with invention and dazzle by Hastie, is watching the five switch characters in a flash, somehow momentarily materializing in a new costume as a new person, as plans to find and deploy the corpse grow even more complicated and relations between the five key characters grow testier. The musical ricochets between zany comedy, history lesson, and deeply felt memorial.\n\nIts cast and producers cleave to the show’s modest beginnings. Hodgson, who first heard about the real-life Operation Mincemeat via the “Stuff You Should Know” podcast, sent it to Cumming, Roberts, and Felix Hagan, her SpitLip theatre company co-founders. Next, they read London Times columnist Ben Macintyre’s 2010 book, then Montagu’s 1953 book, The Man Who Never Was, and watched its 1956 film adaptation. (The musical makes a pointed joke of Montagu’s ambition to cash in on the operation after its completion.)\n\nEight Andrew Scotts Star in One of NYC’s Hottest TicketsSEEING DOUBLETim TeemanSpitLip debuted the musical in 2019 at the 80-seat off-West End New Diorama Theatre, moving to the West End in 2023. At last year’s Olivier Awards (the British Tonys), Mincemeat won Best New Musical, while Malone won the Best Supporting Actor, Musical award. (Let’s see if “Dear Bill” earns him mirroring acclaim at the Tonys.)\n\nThe actors inhabit characters of all genders and ages. This fluidity is not played in and of itself for laughs; you simply accept, for example, the swaggering Hodgson as the scene-chomping, caddish Montagu and Malone as the steadfast Hester. Separately, the show reveals how women like Hester and Jean were particularly used, then marginalized, in a sexist institution.\n\nScaling up to a Broadway house doesn’t rob the show of its innate small-scale charm, but it presents a challenge of necessary sizing-up that makes you want to see the original iteration. The show retains its appealing make-do-and-mend feel (Ben Stones designs both costumes and sets), meaning that the crazy efforts of the group of five to successfully execute Operation Mincemeat mirror the crazy efforts of Cumming, Hall, Hodgson, Malone, and Roberts to put on the show. Mincemeat’s charm is in how determinedly unshowy it feels until its finale when it decides, tongue-in-cheek, to give the audience all the glitz and pizazz expected from a Broadway finale (and even then it subverts itself). \n\nOne typically daffy set-piece features characters passing a briefcase around amid a tangle of landline phone cords. Rousing songs like “Born to Lead” sit alongside the jazzy “Spilsbury” about the Sweeney Todd-esque pathologist tapped to find the corpse. At the top of act two, a raucous Springtime for Hitler-in-spirit number, “Das Übermensch,” combines dancing Nazis, boybands and K-pop. The song intends to skewer authoritarianism, though tonally—at this moment in America and the world more generally—the song finds itself on an uneasy interpretive knife-edge. \n\nWhy ‘Purpose’ Is the Most Explosive Family Drama on BroadwayTRUTH BE TOLDTim TeemanWhen serious points about fascism are more soberly spoken, an audible rumble of recognition by those less than enamored living under Trump’s second term ripple through the Golden Theatre. The show’s focus skis all over the place, slaloming from hilarity to dense plot explanation to deeper meditations on patriotism, sexism, and loss. While accepting the real Operation Mincemeat was indeed complicated, the musical feels overlong; its brilliant cast ensures it never drags, but it sometimes feels too in service to its admirable mission to explain.\n\nHowever, the show’s serious and ultimately successful intention is to celebrate heroes forgotten by history—principally the five characters themselves (particularly the women), but also the real person, a homeless man named Glyndwr Michael, who was the corpse used in Operation Mincemeat.\n\nThe group is thrown into dispute over using Michael’s body so cavalierly, and then—in the final scene—the cast come together to pay resonant tribute to him. This concluding narrative beat reveals, beyond its ribald humor and impressive physical exertions, that Operation Mincemeat seeks to underscore a more damning truth about the ruthlessness of our leaders and the human cost of war—a truth that reverberates sharply to our present day.",
  "originalScore": null,
  "assignedScore": null,
  "dtliThumb": "Up",
  "source": "scraped",
  "scrapedAt": "2026-01-23T22:01:53.950Z"
}