{
  "showId": "operation-mincemeat-2025",
  "outletId": "new-york-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "https://newyorktheater.me/2025/03/20/operation-mincemeat-broadway-review/",
  "publishDate": null,
  "fullText": "Posted in Broadway, New York Theater, Theater Reviews\r\n        Operation Mincemeat Broadway Review\r\n                \r\n     Author: New York Theater     Published Date: March 20, 2025         Leave a Comment on Operation Mincemeat Broadway Review\r\n\n“Operation Mincemeat” is terribly clever and frightfully British, with a strong next-generation Monty Python vibe. If it ultimately feels too clever by half, that may be because this new musical by comedy troupe SpitLip, opening on Broadway tonight, is different in a crucial way from, say, “Monty Python’s Spamalot” or  Mystery Theater Company’s “The Play That Goes Wrong.”  The show provokes just as many laughs (or groans), but the bizarre story it dramatizes is true.\n\nDuring World War II, as the Allies were on the verge of invading Sicily, two British intelligence officers came up with a plan to deceive the Nazis into believing that the invasion would take place elsewhere, and thus redeploy their troops away from the action. The British officers recovered the body of a homeless man who had died from eating rat poison, dressed him up as an officer of the Royal Marines, planted bogus correspondence that supposedly laid out the Allied battle plans, and dumped the body off the coast of Spain, with the expectation that Nazi spies would recover the plans from the “drowned man.“ Improbably, the plan worked. Operation Mincemeat, which is what it was actually called, has been the subject of numerous books as well as a 2021 movie currently on Netflix.\n\nIn a serviceable score that employs music hall, rap, swing  and maybe even a nod to Gilbert and Sullivan, the musical more or less accurately follows the basic (but rarely straightforward) twists and turns in the story, with the five-member cast portraying the principal real-life participants by name as well as a multitude of other characters. Unlike another musical about to open on Broadway, “Operation Mincemeat” doesn’t depict what is arguably its central character – the corpse — on stage. But it does feature Ian Fleming, future novelist-inventor of James Bond, who participated in the operation. The musical can hardly be blamed for making several silly 007 jokes,\n\nAnd how could they resist the song they give the coroner (portrayed by Jak Malone) who finds them the body?“Don’t delay or they’ll decay,” he welcomes them. “You want homicide or suicide or can’t decide, well come inside and see!”\n\nWhat they might have resisted is the Nazi officers performing a boy band song (“It’s the Reich! It’s the Reich! And we’re going all night”) \n\nThere is also surely less of a market in America for the endless satirical references to the arrogance and incompetence of upper class British twits, exemplified by Ewen Montague, who is portrayed by one of the three women in the cast, Natasha Hodgson.  Fresher than the digs at the men, are the pointed proto-feminist moments, such as “All The Ladies,” sung by the women of the secretarial pool<< who are finally able to find meaningful work: (“Take this war for all you can get/This conflict’s our best opportunity yet.”)\n\nThere is no question that the five performers are adept at quick-change artistry; there is a question as to whether they had to change quite so many times, so quickly, and with sometimes quite confusing staging. Was this necessary to the story, or was this showing off? It would be kinder to believe they wanted to have fun, and share their fun with us – which would be the same motivation behind all the slapstick, and the rap, and the red-white-and blue song-and-dance razzmatazz, which we’re meant to take tongue-in-cheek (reminiscent of “Turn It Off” in “Book of Mormon.”)\n\nIn “Operation Mincemeat,” SpitLip wanted to tell a strange true story, but also have a frenetic fringe/ sketch comedy type of fun. Sometimes these two aims felt at cross purposes. But there are moments  when the musical seems to take the history seriously. At one point, Malone as the older secretary Hester Leggett sings “Dear Bill,” a sweet ballad in which she’s trying to create a fictional love letter to the fictional dead officer to lend his existence more credibility. It becomes clear she is really thinking about her own love, lost in the war. In a show that works so hard to be entertaining, it's the simple song that brings the story home.\n\nOperation Mincemeat\nJohn Golden Theater through August 10\nRunning time:2 hours 35 minutes including a 20 minute intermission.\nTickets: $59 – $499\nBook, music and lyrics by David Cumming, Felix Hagan, Natasha Hodgson and Zoë Roberts; \nDirected by Robert Hastie; Choreographed by Jenny Arnold; Resident Director & Choreographer: Tara Young\nScenic and costume design by Ben Stones, lighting design by Mark Henderson, sound design by Mike Walker\nCast: David Cumming as Charles Cholmondeley & others, Claire Marie-Hall as Jean Leslie & others, Natasha Hodgson as Ewen Montagu & others, Jak Malone as Hester Leggett & others, Zoe Roberts as Johnny Bevan & others     \n\n\t\t\tShare this:\n\t\t\t\tShare on X (Opens in new window)\n\t\t\t\tX\n\t\t\t\n\t\t\t\tShare on Facebook (Opens in new window)\n\t\t\t\tFacebook\n\t\t\t\n\t\t\t\tShare on LinkedIn (Opens in new window)\n\t\t\t\tLinkedIn\n\t\t\t\n\t\t\t\tShare on Reddit (Opens in new window)\n\t\t\t\tReddit\n\t\t\t\n\t\t\t\tEmail a link to a friend (Opens in new window)\n\t\t\t\tEmail\n\t\t\t\n\t\t\t\tPrint (Opens in new window)\n\t\t\t\tPrint\n\t\t\tLike this:Like Loading...\n\n\tRelated\n\n                Author: New York TheaterJonathan Mandell is a 3rd generation NYC journalist, who sees shows, reads plays, writes reviews and sometimes talks with people.",
  "originalScore": null,
  "assignedScore": null,
  "bwwThumb": "Meh",
  "source": "scraped",
  "bwwUrl": "https://newyorktheater.me/2025/03/20/operation-mincemeat-broadway-review/",
  "scrapedAt": "2026-01-23T22:09:12.190Z"
}