{
  "showId": "operation-mincemeat-2025",
  "outletId": "pagesonstages-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.com/2025/05/10/operation-mincemeat/",
  "publishDate": null,
  "fullText": "Operation Mincemeat – 8 May 2025 Most reminiscent of The Producers, Operation Mincemeat leans into the idea that people with highly classified, top secret government jobs can actually be morons just like the rest of society. Emphasizing a team that has no idea what they’re doing, with a host of strong personalities, varying levels of ego defects, and fabulous gender play, this musical soars in its ability to bring genuine laughter despite a semi-disturbing premise. In other words, it’s very British. But it’s also surprisingly fun and, at times, even a little heart warming. The most well done element of Operation Mincemeat was the actors playing multiple genders indiscriminately, and how the use of an opposite gendered actor at times helped expose the hypocrisy of gendered existence but, at other times, validated the transgender experience, particularly when Jak Malone sang “Dear Bill”. In this moment, Jak Malone fully embodied the woman he played, Hester Leggatt, and the audience didn’t care about his identity or his genitals—he was just Hester. This touching moment encompassed a lot of big ideas regarding what it means to suffer, whether men’s intense desire to fight for their country is actually running away from something, what things a person overseas might miss most, and how belief can sustain a person through endless dread and loneliness with no ending in sight. This moment painted men as soft and delicate too, a direct contrast to Natasha Hodgson’s depiction of Ewan Montagu, a man with an ego so large he didn’t care who he stepped on to get ahead. This portrayal was also profoundly sad in its way, suggesting a lack of depth to men. The need for women to be a large part of saving the day spoke to a broader dream of an egalitarian society where we stop acting like gender is what makes a person. As an experience, Operation Mincemeat was light and funny, slipping in and out of rap in ways that sometimes worked brilliantly and at other times felt a little clumsy. I thought “Das Ubermensch” was actually really funny, right up until they put the giant swastika on the back wall. I know there’s been a lot of debate over the years about whether or not it’s okay to use swastikas in art—after all, we use epithets and slurs and KKK hoods and Confederate flags and nooses and all kinds of very triggering symbols of death by discrimination in theatre. For me it’s a case-by-case basis. I don’t mind it on an arm band when it’s part of identifying characters, but I did find the usage in Operation Mincemeat to be gratuitous as the characters in this funny dance number were nameless Nazis, not permanent parts of the story. It was just done for shock value, and it didn’t teach us anything. The musical is bold enough on its own. On a plot level, the great joke of Operation Mincemeat was about miscommunications, with a lot of purposeful deception sprinkled in. Everyone had their orders, but not everyone dotted their i’s and crossed their t’s, and for some this was because they were new at a particular job and for others it was because they were being deliberately manipulative to smuggle government secrets away for a surprising purpose or to commit insubordination by making sure that the operation went ahead even when aborting the mission seemed like the safest strategy to the folks at the top. This emphasizes what happens under a government that has no idea what it’s really doing and allows people to have jobs vis-a-vis a hiring process that is basically non existent. For example, Jean (Claire-Marie Hall) gets hired because Ewan finds her attractive, when ironically she is the smartest person in the room and the person who cares the most. I can’t leave this review without mentioning Charlie (David Cumming), whose physicality was absolutely outrageous, despite at times being echoed by other characters. At times I felt bad for this character because it was obvious that he had a lot to offer the operation, no less because it was his creation. But at times he was just too much, and it crossed into thematic territory regarding idiot savants, what it means to be a genius verses be manipulated by being called one. I didn’t know quite what to make of this character, but how he was treated by others made me profoundly sad. On the whole, Operation Mincemeat has a complex plot pulled off by five actors, successfully achieves the daring task of a genuinely comedic musical, has relevant messages for today (particularly surrounding gender politics in the workplace), and pokes delightful fun at what it means to have a government job. The staging, choreography, and lighting support this mission, and a fun time is had by all. I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 810,
  "archivePath": "data/archives/reviews/operation-mincemeat-2025/pagesonstages-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:43:19.532Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}