{
  "showId": "operation-mincemeat-2025",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Andrew Martini",
  "url": "https://www.theatrely.com/post/spinning-a-military-operation-into-musical-comedy-gold-in-operation-mincemeat-review",
  "publishDate": "March 20, 2025",
  "fullText": "It’s a testament to its ingenuity that the show accomplishes all of this without ever taking itself too seriously. There are plenty of winks and nudges to the audience throughout, but make no mistake—Operation Mincemeat is some of the best of what musical theatre can be. It demands to be seen.",
  "isFullReview": false,
  "dtliExcerpt": "During World War II, the British secret service did indeed conduct a deception operation known as Operation Mincemeat, in which the British dressed a dead body in the uniform of a Royal Marine, transported him to the coast of Spain, and planted fake documents on him in the hopes that German spies would find the body and its falsified military papers and move their troops out of Sicily, leaving it open for an Allied Invasion. \n\nIf you’re thinking this doesn’t sound like the right kind of material for a musical, fret not: in the hands of the geniuses at SpitLip (David Cumming, Felix Hagan, Natasha Hodgson, and Zoë Roberts) it’s musical comedy gold. \n\nThe cast—which includes 3 of the 4 members of SpitLip, plus Claire-Marie Hall and Jak Malone—is a tight ensemble of bumbling clowns, who tackle the breakneck pacing with unflagging energy and megawatt charm. \n\nCharles Cholmondeley, the mealy-mouthed operative who comes up with the titular operation, lacks the confidence to present the idea to his boss, Colonel Johnny Bevan (Zoë Roberts, hysterical in every role she inhabits). David Cumming is hilarious and lovable as the nerd so forgettable even his coworkers can’t remember him despite working with him for six years. Just watching him walk across the stage (I can only guess the direction was to avoid bending his knees as much as possible) is a delight. His dubious savior comes in the form of his coworker Ewen Montagu, who has enough arrogance and showmanship to sell Charles’ bonkers idea and actually get it approved. Natasha Hodgson is brilliant as the pompous, Eton-educated Montagu. Her gravelly voice and swaggering walk are perfect foils to Cumming’s meek Cholmondeley. \n\nThe five actors switch roles and swap genders throughout, sometimes turning into a new character right before our eyes with a hairpin turn or the donning of a new costume piece or prop—the clever use of costumes and set by Ben Stones.\n\nIt’s this small, ragtag sensibility that keeps the show so utterly endearing. While the story lacks propulsive action, particularly in the first act, you hardly notice due to the uproarious comedy and the show’s music—an inventive pastiche of contemporary musical theatre and pop. (Music and lyrics, as well as the book, are all by the members of SpitLip.) Director Robert Hastie keeps the farce rolling, never missing an opportunity for comedy. The script’s raucous, joke-a-minute pacing is thrilling. Wartime espionage has never been this fun.\n\nThere’s a real, beating heart at the center of the show that elevates it above mere farce. Beneath the spoofs and gags, there’s an emotional depth that makes the comedy funnier and the satire sharper. While skewering the stuffy, educated British elite, SpitLip has done its due diligence by making room among the jokes to pay homage to the real man whose body was used as a pawn in a military operation. \n\nLike every member of the cast, Jak Malone plays many roles, most deliciously a foppish coroner, but his tender turn as Hester Leggatt, head of the secret service’s secretarial pool, is the most poignant and well-acted. Along with Claire-Marie Hall as Jean Leslie, the young upstart who wants to be useful beyond her administrative duties, they give voice to the women often banished to the background in stories such as these. \n\nIt’s a testament to its ingenuity that the show accomplishes all of this without ever taking itself too seriously. There are plenty of winks and nudges to the audience throughout, but make no mistake—Operation Mincemeat is some of the best of what musical theatre can be. It demands to be seen.\n\nOperation Mincemeat runs through August 18th at the Golden Theatre in New York City. For tickets and more information, visit here.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-23T21:55:13.649Z"
}