{
  "showId": "operation-mincemeat-2025",
  "outletId": "theatermania",
  "outlet": "TheaterMania",
  "criticName": "David Gordon",
  "url": "https://www.theatermania.com/news/review-operation-mincemeat-a-hilarious-musical-that-isnt-too-british-for-broadway_1768137/",
  "publishDate": "March 20, 2025",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "A zany little West End show about World War II charms its way to New York City.\n\nBoasting 74 five-star reviews, a marquee so bright yellow you can see it all the way on 9\n\nWritten by the musical-comedy troupe SpitLip (made up of cast members David Cumming, Natasha Hodgson, and Zoë Roberts, along with Felix Hagan), this is the improbably true story about a British deception operation designed to mislead Nazi Germany about the location of the Allied landing at Sicily. The mission—stay with me on this—entailed dressing the corpse of a Welsh vagrant as a British officer, planting falsified documents on the body, and setting it adrift off the coast of neutral Spain. The hope was that the Spanish would discover the cadaver and pass the intelligence on to the Germans, who would then redirect their forces to Sardinia, leaving Sicily strategically vulnerable for the Allies to capture.\n\nLeading the charge are intelligence officers Charles Cholmondeley (Cumming), a socially inept scientist, and smug bureaucrat Ewen Montagu (Hodgson), who is responsible for convincing their commanding officer Johnny Bevan (Roberts) that the plan is worth enacting. Alongside stenographers Hester Leggatt (Jak Malone) and Jean Leslie (Claire-Marie Hall), this group of bureaucrats create their man—fake Royal Marines major William Martin—from scratch, and essentially hope for the best.\n\nIt's a fascinating story, and a piece of history that Americans aren't likely to encounter anywhere in their high school curriculum. Depending on your tolerance for breathless silliness, you might prefer sticking to the 2021 movie with Colin Firth and Matthew Macfadyen, because this musical is the most unapologetically goofy thing since\n\nThe assorted issues that I had with the show in London still stand. There isn't a lot of melodic distinction between the songs, and as a result, most of the big production numbers tend to blend together. Mike Walker's tinny sound design doesn't help; the fast-moving lyrics are rendered almost completely unintelligible, and the band feels like it's miles away. And I still think it needs to be shorter: Pushing two hours and 40 minutes, the show stretches past its welcome, especially in the second half, which plods along through story padding as the officers await word of whether their plan worked.\n\nBut whereas I merely appreciated the show in the West End, I loved it on Broadway. There's not much discernible difference between Robert Hastie's irreverent staging here at the Golden and there at the Fortune, besides a handful of upgrades to Ben Stones's deceptively versatile set and Mark Henderson's glitzy lighting. Knowing what was coming allowed me to better appreciate the dedication of the five actors to their craft; they've done the show\n\nTheir complete seriousness is what allows all the peculiar stuff to work, whether its Cumming's elongated physical movement or the second act opener, an EDM Nazi dance number replete with sequined swastikas (the one instance where Stones's costumes shift away from trousers and suspenders). Jenny Arnold's choreography shouldn't be underestimated either; clearly, a lot of careful consideration went into the way the actors' bodies move in their multiple cross-gendered roles.\n\nLeading that charge is Hodgson as Montagu, her voice growling with a Clint Eastwood purr, and carrying herself with a swaggering self-assurance that is enough to make all the straight ladies in the audience change their majors to Ewen. She and Cumming make for a delightful double-act, the macho man who takes the uber nerd under his wing that allows his confidence to grow. Hall is terrific as Jean, the plucky woman from the typing pool determined to make her mark, while Roberts kills it with one of the most surprisingly real figures from this espionage mission: Ian Fleming, an eccentric intelligence officer in a black tux who's writing a novel about a British secret agent with a penchant for martinis shaken, not stirred.\n\nBut the show is undeniably stolen by Malone, whose array of roles includes the vampiric coroner supplying the officers with their body and, most notably, Hester, the fastidious head of the M15 secretarial pool who crafts a fake love letter for the fictional soldier to carry. He and Hall take command of the second act with \"Useful,\" a great song about the unsung contributions of the women who toil behind the scenes while men reap the glory. Yet it's Malone's first-act solo \"Dear Bill\" that lingers long after the curtain falls. One of the most poignant musical-theater ballads in recent memory, Malone delivers it as a masterclass in stillness and emotional acuity, hitting us like a ton of bricks. It's the kind of performance that wins awards, and it wouldn't surprise me if Malone collects a Tony come June to go with his Olivier.\n\nIf I'm being honest, I'll admit that I was among the cynics who didn’t think this little-show-that-could was cut out for the spotlight on 45\n\nGet the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nBroadway performances start on March 27 at the Majestic Theatre.\n\nGet the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nBy providing information about entertainment and cultural events on this site, TheaterMania.com shall not be deemed to endorse, recommend, approve and/or guarantee such events, or any facts, views, advice and/or information contained therein.\n\n©1999-2026 TheaterMania.com, Inc. All Rights Reserved.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-23T22:00:05.064Z"
}
