{
  "showId": "operation-mincemeat-2025",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "https://variety.com/2025/legit/reviews/operation-mincemeat-review-broadway-musical-1236343736/",
  "publishDate": "March 20, 2025",
  "fullText": "Think of it as Monty Python on speed, and then throw in some Ealing Studio wit and a bit of “Beyond the Fringe” slyness. Too British? Not if you want to laugh uproariously — and perhaps even unexpectedly shed a tear or two.",
  "isFullReview": false,
  "dtliExcerpt": "Home Legit Reviews Mar 20, 2025 7:00pm PT &#8216;Operation Mincemeat&#8217; Review: Broadway Transfer of the Olivier-Winning Musical Has Absurdity, Laughs and Heart By Frank Rizzo Plus Icon Frank Rizzo Latest &#8216;Ragtime&#8217; Review: Broadway Revival Is a Timely, Glorious Panorama of Changing Times in America 3 months ago &#8216;Waiting for Godot&#8217; Review: Keanu Reeves and Alex Winter Bring a Cooler, Cosmic Take to This Broadway Waiting Game 4 months ago &#8216;Call Me Izzy&#8217; Review: Jean Smart Dazzles in a Broadway Play That Treads All-Too-Familiar Territory 7 months ago See All Julieta Cervantes An astonishing, loopy and very true World War II story about Great Britain tricking Germany into believing false invasion plans has been the source material for non-fiction books and movies dramas . But this ludicrous 1943 espionage plot involving a corpse, fake papers and amazing good fortune also lends itself to absurdity. That's the approach the Brit comedy collective SpitLip takes with \" Operation Mincemeat ,\" the Olivier Award-winning, musical-comedy import from London. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-variety-article-mid-article-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[300,250],[2,2],[300,251],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); Related Stories &#039;Euphoria&#039; Season 3 Trailer: Zendaya, Sydney Sweeney and Jacob Elordi Return as Rue Battles Drug Dealers, Cassie Becomes a Cam Girl and More",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T04:55:07.285Z",
  "urlUpdated": "2026-01-23T05:27:32.789Z",
  "dtliThumb": "Up"
}