{
  "showId": "operation-mincemeat-2025",
  "outletId": "vulture",
  "outlet": "VULTURE",
  "criticName": "Sara",
  "url": "https://www.vulture.com/article/theater-review-operation-mincemeat-on-broadway.html",
  "publishDate": "March 20, 2025",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nFrom Operation Mincemeat, at the Golden.\n                  Photo: Julieta Cervantes\n              \n            \n              \n        What’s more pleasantly surprising? That a self-described “big, dumb musical” about a particularly wacko tidbit of World War II history, created by a scrappy British comedy troupe, is now making its debut on Broadway after rocketing through the strata of UK theater, selling out on the West End, and taking home two Olivier awards? Or that it’s actually the third musical—that we know of!—written about said historical escapade, along with a whole crop of books, TV episodes, and films? (I now personally wish I could have seen the one performed by Welsh schoolchildren.) The Brits—and the Welsh, for reasons that will become clear—have been telling the wilder-than-fiction story of Operation Mincemeat pretty much since the event itself occurred. But if you’re an American who doesn’t necessarily trip over herself to watch anything with Matthew Macfadyen, here’s a primer.\n\nIn 1943, the British were in search of an invasion route into Nazi Europe, and Sicily looked like the best bet, except that there were 100,000 German troops stationed there. They needed a scheme to throw Hitler’s command off the scent — to convince them that there was an Allied invasion coming from somewhere else. At MI5, several intelligence officers—chiefly Ewan Montagu and Charles Cholmondeley (that’s pronounced “Chumly,” fellow Yanks)—cooked up a scheme they called Operation Mincemeat: Disguise a corpse as a British pilot, plant a briefcase full of misleading documents on it, and let it wash up on the coast of Spain, where German spies would be almost certain to get their hands on the bait. If all this sounds like a James Bond movie, there’s a reason for that: Ian Fleming himself was a naval intelligence officer at the time, and a memo written by his boss, Rear Admiral John Godfrey, provided significant inspiration for the plan.\n\nThat detail, though, is less important to the multitalented dynamos of SpitLip, the writer-performers of Operation Mincemeat, the vivaciously silly and quite charming musical that’s made landfall on Broadway. Fleming shows up in their story (how could he not? The opportunity to incorporate riffs on the Bond intro is too irresistible), but they don’t bother much with Godfrey. They’ve already got a compellingly odd-couple-ish pair of heroes in Cholmondeley and Montagu, and with just five inexhaustible triple-threat performers, they’re ready to fill out the world around these aspiring spies with a whirlwind of rolling furniture, tangled telephone cords, dabbing Nazis, and shanty-singing submariners. Operation Mincemeat isn’t exactly blazingly clever—the jokes fly thick and fast, and they tend toward broad grin-crackers rather than breathless zingers—but it overflows with good humor and heartfelt commitment. Director Robert Hastie and choreographer Jenny Arnold keep the quintet of actors in such constant motion, rife with genre winks and references, that I was astonished not to see Ben Stones’s crisp, transformable base costumes of pinstripes, suspenders, and ties soaked clean through by the finale. While some moments certainly sizzle more than others, there’s more than enough sincerity and goofy charisma on stage to keep the show powered.\n\nThere’s also a sound instinct by the writing team (SpitLip’s David Cumming, Felix Hagan, Natasha Hodgson, and Zoë Roberts collaborated on book, music, and lyrics, and all but Hagan appear on stage) about where to pull all the zany stops out and where to pepper in dashes of earnest reflection or ethical quandary without oozing into preachiness. If there’s a deeper conflict underlying the play’s top layer of giddy spy-thriller action, it has to do with the moral corners that are easily cut during war, or simply in the pursuit of success and glory, and with the ever-troublesome question of who does the work and who gets the credit. Ewan Montagu (played with a plummy patriarchal growl and irrepressible BDE by Hodgson) is the swaggering, cavalier, ends-justify-the-means type. “Stop fretting about guidelines and rules,” he tells Cholmondeley (Cumming, wonderfully elastic of face and body). “Remember, we’re His Majesty’s finest, / And regulations are for cowards and fools.” Nervous, bespectacled Cholmondeley, meanwhile, probably couldn’t swagger with a gun to his head. He’s a scientist, a creepy-crawlies enthusiast (except, emphatically, bees), and an all-around grade-A nerd. I can’t believe there’s not an intentional Morris Moss allusion happening in the fact that he’s got a coffee mug with his own face on it, and I further can’t believe that I’m about to make my second critical reference to the same Jeeves and Wooster character in less than a year — but how can one not think of Gussie Fink-Nottle when Cholmondeley starts yammering on about newts?\n\nHere, it’s brainy Cholmondeley who thinks up the brilliant plan and cocksure Montagu who sells it to the top brass, with the indispensable support of Hester Leggatt, the not-to-be-trifled with head of all MI5’s secretaries (played with tart perspicacity and hidden wells of feeling by Jak Malone), and the gutsy “new girl” in the typing pool, Jean Leslie (Claire-Marie Hall). While Montagu bulldozes ahead from the jump, the women and Cholmondeley wrestle more with their consciences. When they find a body for their scheme—an unidentified “homeless chap” who swallowed rat poison—what are their moral responsibilities? “You must at least know his name?” Hester ventures. “Who was he?” And what about the dicey backstreet coroner who provided the corpse (given flamboyant Sweeney Todd–meets–Hairspray energy by Malone, covered in red glitter blood)? “Was any of that in any way legal?” Cholmondeley gulps. But Montagu scoffs in the face of such trifles. As he taught us in the show’s opening number, “Born to Lead,” when you’re an Eton boy, you grow up assured of one thing: “My centuries of breeding, / I know they’ll fail me not, / For fortune favours bravery / And a fortune’s what I’ve got.”\n\nThere’s more than a touch of Gilbert and Sullivan there. “Stick close to your desks and never go to sea, / And you all may be Rulers of the Queen’s Navy,” sung the First Lord of the Admiralty in H.M.S. Pinafore, providing Montagu with clear ancestry for lines like, “Well, let Navy lads get soaking / We’ll all stay nice and dry; / We’ll shout to all the soldiers ‘Jump!’ / And hear them shout ‘How high?’” The cheeky satire is where Operation Mincemeat really sparkles; where its gleam dulls a bit, it’s in the show’s signs of a different, more American strain of heritage. The unmistakable cadences of Hamilton turn up in certain stretches of semi-rapped lyrics, particularly by the MI5 team’s Christopher Jackson–as–Washington–channelling boss, Colonel Johnny Bevan (Roberts, who zings delightfully between parts, including a derpy Ian Fleming). Not only are the musical’s dips into hip-hop its most forced sections, in terms of both aesthetics and performance; they’re also just hard to hear. Whether it’s a matter of delivery or sound engineering, the fast-flying lyrics get swallowed up, and Mincemeat is a show where it’s imperative to catch the words.\n\nFortunately, the less engaging passages quickly roll onwards into more farcical fun — and, as in the case of Hester’s song “Dear Bill,” into some truly poignant gems. Cholmondeley and Jean find themselves attempting to write a love letter from their fictional airman’s fictional fiancé, to plant on the body to lend it more credibility, but neither has enough life experience to rise to the task. (Mercifully, unlike the 2021 Netflix film, this Operation Mincemeat avoids adding a romantic subplot.) Enter Hester, who tuts at her colleagues’ overwrought efforts and begins primly, “Dear Bill, / I’m afraid I’ve not got long to write; / I’m off to Mary’s, you know how she feels about bridge night…” Malone sings the whole song standing still, glasses just so, hands mostly together, a single curl neatly placed on his forehead — but the quiet anthem unfolds Hester’s inner life, growing from a place of deliberate mundanity (“Look, when you’re writing to someone you love, far away … I’d imagine you want them to feel as normal as possible,” she says) into a revelation of real love and loss. It’s a highlight of the show, as well as a lovely example of Mincemeat’s subtle queering of a historical narrative. “The only rules are: Ewan Montagu must be played by a woman. Hester Leggatt must be played by a man,” reads the script’s front matter. It’s not a matter of shoehorned commentary — simply of letting new bodies fill seemingly familiar spaces and seeing what resonates.\n\nAfter all, it’s a body pretending—or being pretended about—that anchors this whole affair. Though the real Operation Mincemeat proceeded, and somewhat miraculously triumphed, by inventing “Major William Martin, brave and beloved pilot who crashed his plane fighting for [his] country,” Hester’s question about the truth of this imaginary hero’s identity still resonates. It eventually came out that his name was (probably) Glyndwr Michael, a Welshman who traveled to London and never escaped poverty. Is it enough to remember him now? Is it okay to take delight in the wild caper that followed his sad end? Who can say, really? But SpitLip argues vigorously and convincingly in favor of delight. “Look, the world is… a mess, Charlie,” says Ewan in one of his more unaffected moments. “Small flashes of joy, it’s all any of us can hope for.” Whether or not it’s all, it’s a strong something, and Operation Mincemeat has plenty of joy to go around.\n\nOperation Mincemeat is at the Golden Theatre.\n\nShow \n      \n    \n    Comment\n  \n\n\n\n      Dead Men Do Tell (Funny) Tales: Operation Mincemeat\n\n\n\n    \n      \n        \n  \n\n\n      \n      \n      \n        \n  \n\n\n      \n    \n\n  \n  \n\n\n\n  \n\n\n\n        Things you buy through our links may earn Vox Media a commission.\n\nThis email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n\nPassword must be at least 8 characters and contain:\n\nYou’re in!\n        As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.\n\nThis email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n\nPassword must be at least 8 characters and contain:\n\nYou’re in!\n        As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.",
  "isFullReview": true,
  "dtliExcerpt": "While some moments certainly sizzle more than others, there’s more than enough sincerity and goofy charisma on stage to keep the show powered.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/operation-mincemeat/",
  "needsScoring": true,
  "textWordCount": 1722,
  "archivePath": "data/archives/reviews/operation-mincemeat-2025/vulture--sara_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:22:46.019Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251114223444",
  "archiveOrgUrl": "http://web.archive.org/web/20251114223444/https://www.vulture.com/article/theater-review-operation-mincemeat-on-broadway.html"
}