{
  "showId": "the-cripple-of-inishmaan-2014",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/the-cripple-of-inishmaan-review-daniel-radcliffe-excels-1.7761003",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/the-cripple-of-inishmaan-review-daniel-radcliffe-excels-1.7761003",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup",
    "bww-reviews"
  ],
  "fullText": "16 m ago In Brentwood road construction. right lane closed on Sagtikos Pkwy SB between Crooked Hill Rd/S2 and The Southern State Pkwy\n\nIn Brentwood road construction. right lane closed on Sagtikos Pkwy SB between Crooked Hill Rd/S2 and The Southern State Pkwy\n\n16 m ago Accident. Two lanes blocked on The Southern St Pkwy EB at Meadowbrook Pkwy/X22. Stop and go traffic from Grand Ave/Baldwin Rd/X20 in Nassau\n\nAccident. Two lanes blocked on The Southern St Pkwy EB at Meadowbrook Pkwy/X22. Stop and go traffic from Grand Ave/Baldwin Rd/X20 in Nassau\n\n16 m ago In Nassau road construction. shoulder closed on The Southern St Pkwy EB at Bellmore Rd/X26\n\nIn Nassau road construction. shoulder closed on The Southern St Pkwy EB at Bellmore Rd/X26\n\n16 m ago Road construction. Right lane closed on The Southern St Pkwy WB between Wantagh Ave/X28 and Rt-106/X25 in Nassau\n\nRoad construction. Right lane closed on The Southern St Pkwy WB between Wantagh Ave/X28 and Rt-106/X25 in Nassau\n\n57&deg;\n Hi 63&deg; Lo 45&deg;\n Mostly Cloudy\n\nHumidity: 29%\n Wind: SSW 10 mph\n Barometer: 29.98 Hg\n\nFull forecast\n Hour-by-hour\n Local map\n\nis imagining winning the lottery like these lucky folks have on Long Island.\n\nOriginally published: April 18, 2014 4:46 PM\n Updated: April 21, 2014 12:56 PM\n \n By LINDA WINER\n linda.winer@newsday.com\n\nActor Daniel Radcliffe during the Broadway opening night of \"The Cripple Of Inishmaan\" at the Cort Theatre on April 20, 2014 in New York City. (Credit: Getty Images / Andrew Toth)\n\nNever let it be said that Daniel Radclifffe panders - not to expectations of Hollywood glitz nor, especially, to his Harry Potter fan base.\n\nHere he is, back on Broadway after his daring 2008 New York debut in \"Equus\" and his equally courageous, in a different way, 2011 musical-comedy turn in \"How to Succeed in Business Without Really Trying.\" And Daniel Radcliffe is again wonderful, a low-key company player, as the sweet tragic figure, Cripple Billy, born virtually paralyzed on one side and hopping around the rocky, cartoon-Irish gothic landscape in a delightfully deadpan revival of Martin McDonagh's 1996 \"The Cripple of Inishmaan.\"\n\nBilly is not merely crippled and orphaned, but he has what's described as a \"bit of a wheeze,\" and there's a mystery about the drowning death of his parents. Oh, he also stares at cows. He is so bored and lonely on the remote island of Inishmaan that he runs off to Hollywood to do a screen test for a film -- called here by everyone a \"fill-em\" -- about the locals.\n\nThis is New York's third production of McDonagh's incorrigibly rude and gently shrewd satire, inspired by the real 1934 visit of Hollywood director Robert Flaherty to make the silent movie, \"Man of Aran.\" This \"Cripple,\" a London import, is the first to get a Broadway showcase.\n\nMichael Grandage, the Tony-winning director of \"Red,\" directs a lovely cast in the gleeful poetry of outcast inhumanity. Ingrid Craigie and Gillian Hanna are blissfully dim as Billy's loving maiden aunties. One talks to rocks when nervous. Pat Shortt is perfectly irritating as the town snoop, a man called Johnnypateenmike, who recites gossip about sheep deformities from house to house under the guise of journalism. Sarah Greene captures both the terror of the town hellion and her appeal.\n\nThe play is subtler than McDonagh's more melodramatic hit gore-fests, especially \"The Beauty Queen of Leenane.\" The worst these townfolk do -- except for the blunt insults -- is \"peg\" one another with stones and break raw eggs on unsuspecting heads. The work also has none of the political chill of his masterwork, \"The Pillowman.\" He seems here to be both satirizing and celebrating the cliches about primitive Ireland and primal Hollywood, sending up the cruelties and seductions of the parallel universes as mutually exploitable pleasures. How right to have a real movie star as its heart.\n\nWHAT \"The Cripple of Inishmaan\"\n\nWHERE Cort Theatre, 138 W. 48th St.\n\nINFO $27-$152; 212-239-6200; crippleofinishmaan.com\n\nBOTTOM LINE Daniel Radcliffe is lovely as a sweet cripple in a rude satire.\n\nadvertisement | advertise on newsday\n\n'Cabaret': Alan Cumming is still dangerous 4/24/14\n\n22 best new movies streaming on Netflix\n\nadvertisement | advertise on newsday",
  "isFullReview": true,
  "textWordCount": 696,
  "archivePath": "data/archives/reviews/the-cripple-of-inishmaan-2014/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:29:03.007Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140425180047",
  "archiveOrgUrl": "http://web.archive.org/web/20140425180047/http://www.newsday.com:80/entertainment/theater/the-cripple-of-inishmaan-review-daniel-radcliffe-excels-1.7761003",
  "contentTier": "needs-rescrape",
  "wordCount": 696,
  "tierReason": "Full review text",
  "bwwExcerpt": "Michael Grandage, the Tony-winning director of 'Red,' directs a lovely cast in the gleeful poetry of outcast inhumanity...The play is subtler than McDonagh's more melodramatic hit gore-fests, especially The Beauty Queen of Leenane. The worst these townfolk do -- except for the blunt insults -- is 'peg' one another with stones and break raw eggs on unsuspecting heads. The work also has none of the political chill of his masterwork, The Pillowman. He seems here to be both satirizing and celebrating the cliches about primitive Ireland and primal Hollywood, sending up the cruelties and seductions of the parallel universes as mutually exploitable pleasures. How right to have a real movie star as its heart.",
  "bwwScore": 8,
  "rejectedAt": "2026-02-06T09:02:47.566Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be a web page with traffic reports, weather information, and other non-review content mixed with what may be a truncated review excerpt; openai: The review is about a previous production of 'The Cripple of Inishmaan' from 2014, not the current Broadway run.",
  "promptVersion": "5.2.0"
}
