{
  "showId": "the-cripple-of-inishmaan-2014",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2014/legit/reviews/broadway-review-the-cripple-of-inishmaan-starring-daniel-radcliffe-1201159902/",
  "publishDate": "April 20, 2014",
  "fullText": "Giving a warm, sensitive performance, the grown-up teen idol leads an excellent cast in director Michael Grandage's sterling production.\n\nIn \"The Cripple of Inishmaan,\" Martin McDonagh's sublime tragicomedy about life on Ireland's desolate Aran Islands, there are two old biddies who desperately dote on Daniel Radcliffe — and who wouldn't? Having earned his legit chops (in \"Equus\" and \"How to Succeed in Business Without Really Trying\"), the grown-up teen idol turns in a warm, sympathetic performance as the sweet-tempered but broken-bodied \"cripple\" who has long resigned himself to the gleeful cruelty of his cloddish neighbors. The production also gives Gotham its first look at the work of the extraordinary new company formed by Michael Grandage, the estimable onetime artistic director of the Donmar Warehouse.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Olivia Dean Wins Best New Artist Grammy and Says 'I'm a Granddaughter of an Immigrant' and 'Those People Deserve to Be Celebrated' \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Bruno Mars' 'I Just Might' Scores Second Week at No. 1 on Singles Chart\n\nMaybe it takes a black Irish heart to fully appreciate McDonagh's savage humor. But from bizarre stage plays like \"The Lieutenant of Inishmore\" to a psychotic film like \"Seven Psychopaths,\" the scribe always tempers his killing wit with affection, and even sympathy, for his victims.\n\nThat's the way it works with \"The Cripple of Inishmaan,\" the 1997 play inspired by a visit that the movie director Robert J. Flaherty paid to the isle of Inishmore to film \"The Man of Aran,\" his seminal 1934 documentary about the primitive way of life (fishing off cliffs, hunting sharks, farming rocks) on the barren limestone islands off the Bay of Galway. In one raucous scene, the earthy residents of Inishmaan hoot and howl and throw eggs at a bedsheet screening of Flaherty's award-winning film. (\"Ah, they're never going to be catching this fecking shark,\" sneers the egg-thrower. \"A fecking hour they've been at it now.\") It's a perfect example of McDonagh's artistry — the sheer hilarity of the comic situation and the aching poignancy of the characters for refusing to see themselves in this wrenching film of their lives.\n\nUnlike his flamboyantly crude, rude and casually cruel neighbors, Billy (Radcliffe) is a gentle boy who calms his raging feelings by reading books and staring blankly at cows grazing placidly in the fields. The wisp of a plot, which opens with boffo laughs and stealthily advances toward a bitterly ironic ending, turns on the reckless scheme of this sensitive lad to get himself cast in the movie and transported to Hollywood for the filming.\n\nBut his thick-skinned neighbors find such merriment in \"Cripple Billy's\" physical deformities (which look quite painful in Radcliffe's realistically limned perf) that they never catch on to the young man's yearning to leave the island. Nor do they pay any mind to his persistent requests for the truth behind the deaths of his parents, who drowned shortly after he was born. (\"That's pure gossip that they had a sackful of stones tied between themselves,\" Billy insists.) Not even his doting foster aunties, the shopkeepers Kate and Eileen Osbourne (Ingrid Craigie and Gillian Hanna, comic geniuses with the killer timing of a couple of sharks), are inclined to share that terrible secret with their darling boy.\n\nIf anyone does know the whole story behind that mystery, it would be Johnnypateenmike, a monstrously funny rogue in Pat Shortt's Falstaffian performance. Johnnypateenmike is a scrofulous gossip who has made a flourishing trade of snooping out and peddling \"pieces of news\" that he delivers with great theatrical flourishes. For good reason, that old rascal's lips are sealed on this subject — although there's always the chance that his vindictive mother, an evil old hag in June Watson's priceless performance, might spill the beans. McDonagh's sly point here seems to be that Irish humor, so wickedly cutting and clever, doesn't always mean to inflict pain. There are times when the marvelous musical verbiage that rolls off the silver tongues of the Irish can serve as secretive, even protective camouflage for truths better not spoken.\n\nNone of the garrulous natives on Inishmaan seems the least bit daunted by the bleakness of this godforsaken island, with the possible exception of Babbybobby (Padraic Delaney, his face a tight mask of pure pain), a fisherman who recently lost his beloved wife to tuberculosis. But the harshness of the setting doesn't go unnoticed by the design team. Working with the meanest of materials — raw wood, rough stone and dirty old rags — set and costume designer Christopher Oram creates vivid images of human life as it's lived on this limestone rock in the middle of the sea. Hearing the crashing waves and the eerie cries of seabirds, and the mournful folk music supplied by composer and sound designer Alex Baranowski, it's easy to understand how the intolerable loneliness of the place has worked its way into Billy's bones.\n\nAs insensitive as they are to Billy's misery, it's doubtful that any of his neighbors has even noticed how deeply and desperately he's in love with Helen, the foul-mouthed egg-thrower at the film screening. A gorgeous red-headed witch of a girl in Sarah Greene's delicious performance, Helen is as fierce as she is beautiful, a heartless tyrant who physically torments her brother Bartley (Conor MacNeill, who must be a mass of bruises) and shamelessly teases all the horny priests on the island. In Greene's positively edible portrayal, the divine Helen is all filthy thoughts and foul mouth behind an angelically lovely face. That's an irresistible combination for every man, boy and priest on the island, and poor Billy is all too aware that this grubby goddess is out of his league.\n\nUnless, of course, someone in his tribe takes pity and teaches him how to survive as they do — with a thick skin, a wicked sense of humor and the occasional act of kindness.",
  "isFullReview": true,
  "dtliExcerpt": "Daniel Radcliffe gives a performance of surprising emotional depth and complexity as Billy Claven, the disabled young man whose yearning to escape his narrow island existence drives this darkly comic play.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Maybe it takes a black Irish heart to fully appreciate McDonagh's savage humor. But from bizarre stage plays like The Lieutenant of Inishmore to a psychotic film like Seven Psychopaths, the scribe always tempers his killing wit with affection, and even sympathy for his victims. That's the way it works with The Cripple of Inishmaan...McDonagh's sly point here seems to be that Irish humor, so wickedly cutting and clever, doesn't always mean to inflict pain. There are times when the marvelous musical verbiage that rolls off the silver tongues of the Irish can serve as secretive, even protective camouflage for truths better not spoken.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Daniel Radcliffe gives a performance of surprising emotional depth and complexity as Billy Claven, the disabled young man whose yearning to escape his narrow island existence drives this darkly comic play.",
  "contentTier": "complete",
  "contentTierReason": "Short text (31 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://variety.com/2014/legit/reviews/broadway-review-the-cripple-of-inishmaan-starring-daniel-radcliffe-1201159902/",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews"
  ],
  "rejectedAt": "2026-02-03T20:05:40.450Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single descriptive sentence about Radcliffe's performance, not a complete review with evaluative content or recommendation; openai: This text is a brief excerpt focusing on a single performance without providing an overall evaluation of the show.",
  "promptVersion": "5.2.0",
  "previousUrl": "https://variety.com/2014/legit/reviews/the-cripple-of-inishmaan-1201156021/",
  "urlDiscoveredAt": "2026-02-04T18:51:44.997Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 976,
  "archivePath": "data/archives/reviews/the-cripple-of-inishmaan-2014/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T18:51:45.004Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 976,
  "tierReason": "Full review text",
  "bwwScore": 9
}
