{
  "showId": "a-behanding-in-spokane-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2010/legit/reviews/a-behanding-in-spokane-1117942112/",
  "publishDate": "April 4, 2010",
  "fullText": "A disturbing, deeply introspective play about a once-successful couple who lose everything.\n\nIn 1970, Factory Theater became the first organization devoted to producing nothing but Canadian plays. Now in its 40th season, the Toronto venue has stuck to that mandate through good times and bad. Its latest entry is “And So It Goes,” the first new play in 10 years by one of the Factory’s first authors, George F. Walker. It’s a new Walker writing here, but not a kinder, gentler one. Leaner and meaner might be closer to the mark, although the final denouement is somehow reassuring — perfect for the times we live in.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Laufey Reflects on Honoring Mariah Carey With Jazzy ‘It’s Like That’ Tribute: ‘That’s a Standard Now’ \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Lola Young Was ‘Nervous as Hell’ Performing at the Grammys After Health Scare: ‘This Is Where I Belong’\n\nAn ex-cop and cab-driver, Walker carved an impressive swath across Canadian theater for nearly 30 years, with scripts like “Zastrozzi,” “Nothing Sacred” and his six-play “Suburban Motel” cycle being produced throughout North America.\n\nBut after a discouraging experience with his 2000 play, “Heaven,” Walker announced his departure from the theater. He has spent most of the past decade working in television, notably on CBC series “This is Wonderland.”\n\nWith “And So It Goes,” Walker returns to the stage with his powers of dialogue and characterization intact, but with far less focus on the door-slamming, gun-shooting melodrama that filled his earlier scripts.\n\nThis is a disturbing, deeply introspective play about a once-successful couple, Gwen (Martha Burns) and Ned (Peter Donaldson), who lost their jobs and fortunes at the same time their son vanished and their daughter (Jenny Young) became a schizophrenic.\n\nDespite this gloomy scenario, Walker has found room for his customary black humor, especially in scenes where Gwen meets with her therapist, who turns out to be the ghost of Kurt Vonnegut (Jerry Franken).\n\nNed tries to reinvent himself, going from being a financial analyst to a career as a dessert chef. But his failure on the creme caramel battleground spells an end to those dreams.\n\nThe play grows blacker and bleaker, but even then, Walker manages to find redeeming bursts of laughter. In the end, the resolution speaks of the kind of hope born from despair and one feels that, despite everything, Gwen and Ned have a chance of survival.\n\nWalker directs his own work with a sure hand to its rhythms and meanings. He’s perhaps a bit stingy with visual panache, although his design team provides a splendid urban prison in which his drama resonates.\n\nThe cast is also first-rate. Stratford vet Donaldson brings great depth to Ned, “Slings and Arrows” star Burns offers superb vulnerability as Gwen, and Shaw Festival newcomer Young is impressive as their damaged daughter. Franken provides a nicely dry comic counterbalance as Vonnegut.",
  "isFullReview": true,
  "dtliExcerpt": "McDonagh's talent for writing vivid, violent dialogue that crackles with dark humor and twisted logic is undeniable. But his plays are starting to feel like exercises in style over substance.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "McDonagh's talent for writing vivid, violent dialogue that crackles with dark humor and twisted logic is undeniable. But his plays are starting to feel like exercises in style over substance.",
  "contentTier": "complete",
  "contentTierReason": "Short text (30 words)",
  "textWordCount": 472,
  "archivePath": "data/archives/reviews/a-behanding-in-spokane-2010/variety--marilyn-stasio_2026-02-03.html",
  "textFetchedAt": "2026-02-03T07:25:00.286Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 472,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-03T10:33:23.467Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This is a review of a Factory Theater production in Toronto, not a Broadway show. The review is about a Canadian theater's production, not a current Broadway run.; openai: The review is about a production at the Factory Theater in Toronto, not a Broadway show.; kimi: This review covers a production at Factory Theater in Toronto, Canada, not a Broadway production. The show 'And So It Goes' is being reviewed in its Toronto run, not on Broadway.",
  "promptVersion": "5.2.0"
}
