{
  "showId": "faith-healer-2006",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Chris Wiegand",
  "url": "https://www.theguardian.com/stage/2020/sep/20/faith-healer-review-bittersweet-showbiz-memories-are-full-of-magic",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2020/sep/20/faith-healer-review-bittersweet-showbiz-memories-are-full-of-magic",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Michael Sheen in a performance of Faith Healer, streamed live and performed to an empty auditorium. Photograph: The Old Vic/Getty ImagesView image in fullscreenMichael Sheen in a performance of Faith Healer, streamed live and performed to an empty auditorium. Photograph: The Old Vic/Getty Images This article is more than 5 years oldReviewFaith Healer review – Friel's spellbinder captures theatre's magicThis article is more than 5 years oldOld Vic, LondonMichael Sheen, Indira Varma and David Threlfall are a superb trinity for Brian Friel’s powerful monologues\n\nWhat does it mean to stage a play in an empty theatre, no matter how many are watching on Zoom? The Old Vic’s livestream of Faith Healer – with the divine cast of Michael Sheen, Indira Varma and David Threlfall – begins by revealing rows of unfilled seats. Director Matthew Warchus frequently accentuates the emptiness to bring out elements of Brian Friel’s four monologues, shared by three characters who colour in or contradict each other’s stories.\n\nThe desolate auditorium reflects the times itinerant faith healer Frank (Sheen) sweeps out village halls and waits for the arrival of his audience who, as his partner Grace (Varma) remembers, would frequently number fewer than half a dozen. The absence adds poignancy to the bittersweet showbiz recollections of Frank’s manager, Teddy (Threlfall), whose theatrical flourishes reveal a craving for an audience or at least a bit of company. Perhaps you’ve heard of his previous act, Rob Roy, the bagpipe-blowing whippet? There is silence from the stalls.\n\nModestly billed as a “scratch” production, with sparing use of music and some occasionally jarring extreme closeups, the evening has three superb performances. As the ironically named Frank, Sheen gives as rich a delivery as you could wish of the mesmeric incantation of Welsh village names remembered from the trio’s travels. His three-piece black suit is not as shabby as Friel’s stage directions advise, but he looks dressed for a funeral, which brings its own resonance. Varma and Threlfall’s costumes are in matching tones of moss and mud; Grace measures her state on an index of cigarettes smoked and whiskeys drunk while Teddy has the air of a sozzled radio host. He sings along to The Way You Look Tonight, feet still tapping after the music has died.\n\nView image in fullscreenWho is misremembering and who is manipulating? Indira Varma, David Threlfall and Michael Sheen in Faith Healer. Photograph: The Old Vic/Getty ImagesThat song links the monologues that centre on two disturbing incidents: one in a Ballybeg pub, the other in the back of a van in the Scottish Highlands. Each recollection casts doubt on previous versions: who is misremembering and who is manipulating? The three characters carry an ache that reminded me of Philip Larkin’s poem Faith Healing, with its observation that within most people there lies a sense of “all they might have done had they been loved”.\n\nFriel considers how words are used: the legalese of Grace’s father, a judge, to assert his authority; the breathless newspaper report of Frank’s healing, which he has kept as a cutting; how the sound of a name can light up your face with promise, as Varma shows brilliantly. And Friel memorably captures emotional wounds: Grace allows herself to let in certain memories of Frank, “like a patient returning to solids”.\n\nThe tatty poster for Frank’s act promises appearances for one night only, and Friel’s play marvels at the magic of live theatre itself, where even actors can be left wondering where their performance came from. When Teddy describes Grace’s singing, he says she is not performing but the song is “rising out of her by itself”. Tonight, Friel’s play rises out of a spellbinding trinity.",
  "isFullReview": true,
  "textWordCount": 611,
  "archivePath": "data/archives/reviews/faith-healer-2006/guardian--chris-wiegand_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:13:19.729Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 611,
  "tierReason": "Full review text",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2020 outside valid range 2003–2008 for show opening 2006"
}