{
  "showId": "faith-healer-2006",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Helen Shaw",
  "url": "https://www.vulture.com/2020/09/almost-the-real-miracle-the-old-vics-streamed-faith-healer.html",
  "playbillVerdictUrl": "https://www.vulture.com/2020/09/almost-the-real-miracle-the-old-vics-streamed-faith-healer.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nMichael Sheen in Faith Healer.\n Photo: Old Vic\n \n \n \n The “Old Vic: In Camera” season’s third turn is Faith Healer, Brian Friel’s slippery, multi-perspective play about a man frightened by his own mystery. As the rest of “In Camera” has been, the performances are livestreamed from the otherwise empty theater in London. As a theatrical attempt, Faith Healer is ambitious and a little scary. Even after the season’s earlier artistic successes with Lungs and Three Kings, there was no guarantee that the magic would work again. For one thing, it’s a new production, whereas Lungs was a return engagement; for another, it relies on the chemistry of a multi-character work, where Three Kings was written for just Andrew Scott. Clearly the theater chose Friel’s 1979 play for its structure: Built from four monologues, the three actors never have to appear onstage together — until they bow to piped-in applause. But could one of the “In Camera” “scratch” productions create any sense of interplay with a socially distant process? How would they rehearse? Would it be a whole, or just parts?\n\nThere were some marks of haste (I saw the first public broadcast), including some hair-and-wig infelicities and awkward camerawork. But generally speaking, here was Friel’s gorgeous play, both competently staged and beautifully spoken. It begins with Michael Sheen as the faith healer himself, Francis Hardy. (Sheen’s hair situation has reached Walt Whitman proportions — he’s about two more weeks of beard from going full Karl Marx.) He tells us a detailed and rueful accounting of his life on the road with his manager, Teddy, and his mistress, Grace. We later learn that Grace is actually his wife, calling attention to one of the many purposeless lies Hardy tells.\n\nFaith healing may be Hardy’s destiny (same initials, F.H., he points out), but it’s not the kind of career that leads to healthy work-life balance. On good nights, he is a savior. On bad nights, he’s a fraud. Even he isn’t sure which is true, particularly now that the drinking has gotten so bad. His ability to cure only occasionally outshines all the dull failures on the road, traveling among tiny Welsh towns, where, he says, the village halls testify to their own obsolescence. Hardy’s descriptions of dusty, echoing churches and gathering places where no one gathers anymore are often painful, particularly with the empty Old Vic auditorium lurking over his shoulder. At one late point, Hardy wonders if the desolation of those venues operated as a kind of paradoxical cure. He wonders if his effects would have even been possible “away from the shabbiness” and that he can’t be sure that the “despair isn’t its own kind of healing.” The camera is very close to Sheen here, and his eyes are pleading. Is the performance working? Is he right about the power of an empty room? (Only if sorrow can be cured by hair of the dog.)\n\nIndira Varma plays Grace, Hardy’s shellshocked wife, who can’t understand why she stays with him. As she talks, we realize much of what Hardy has told us was untrue — he’s mentioned a little vacation by the sea, where, in fact, Grace suffered through a violent and lonely stillbirth. Some of her story is, in turn, cast into doubt by Teddy. The only thing that all three characters agree on is what route they took into Ireland and that Hardy did indeed effect cures; everything else is either abraded by memory or Hardy’s pathology around the truth. Friel seems to be writing his own Books of the Apostles, telling and retelling events with slight differences, agreeing only on the presence of the central Miracle. It’s an elegant trick, since the misrememberings and lies and inconsistencies actually increase our willingness to believe. It asks us to listen as though there is a truth to ferret out, if only we could cross-compare the monologues correctly.\n\nThere is a little slippage between the close-up cinematic way Sheen plays Frank Hardy and the stagier effects with which David Threlfall plays Teddy, the manager of their rabble-scrabble act. At first I saw that disconnect as evidence of the odd way the show must have come about. Perhaps the director, Matthew Warchus, hadn’t gotten everyone on the same stylistic page? But over the play’s two and a quarter hours, I came to savor, then marvel at, that difference. Teddy’s a man from another age, always referring to “Sir Laurence” and fondly remembering his other great vaudeville client, a dog that played the bagpipes. If he seems more affected on camera than Sheen, it’s because his character has been colored in with the old greasepaint. Friel’s writing, which can turn into showboating, takes its most exaggerated turns with Teddy, deliberately letting the show’s sentiment accumulate in him in vast pools. Teddy weeps; he calmly discusses a horror from the past; he mists up over the old poster for the Fantastic Frank Hardy (one of the props onstage); he glugs his beer. Friel indulges himself with Teddy’s character, so Threlfall does too. By the end of Teddy’s monologue, the two men, playwright and actor, seem to be propping each other up — old friends making themselves cry at the end of the bar.\n\nThe Old Vic plans to stream this production for only four performances, and if they make any changes, the length of the run is the big one I’m hoping for. The digital audience is capped at the seating capacity of the space, and no recording will remain online. The play itself is a grand argument for the magic of repeated performances: What’s magical one night may fade the next. And I think an audience more than four times the Old Vic’s capacity would want to see it. There’s something so intoxicating about the classic Friel feeling — the way sensations of physical languor, portrayed or simply described, are set against breathless mental activity. In his other great serial monologue play, Molly Sweeney, Friel uses Molly’s descriptions of swimming as the image of active surrender; in Faith Healer, the refrains are about traveling by van, which offer the listener that familiar dazed sense of being a passenger as a car goes up and down hills. Friel’s scripts are crammed with words, yet they all communicate a sense of peace and suspension and quiet. We remember swimming or driving, and time goes gelid, while the thoughts inside the characters — tortured by guilt — spin and spin and spin.\n\nShow \n \n \n Comment\n \n\n Almost the Real Miracle: The Old Vic’s Streamed Faith Healer\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1129,
  "archivePath": "data/archives/reviews/faith-healer-2006/vulture--helen-shaw_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:37:12.036Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1129,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2020 outside valid range 2003–2008 for show opening 2006"
}