{
  "showId": "cabaret-2014",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/cabaret-theater-review-699204/",
  "publishDate": "April 25, 2014",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "Williams brings a wicked gleam to the role, her Sally both magnetically seductive and heartbreakingly fragile, with a voice that can purr like velvet or cut like a blade.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "...there's simply no wrong time to revisit Sam Mendes' and Rob Marshall's thrilling production, which is even sharper this time around, with Alan Cumming reprising his louche Emcee alongside Michelle Williams' shattering Sally Bowles...Even for those of us who experienced it the first time around, this atmospheric revival is a bracing ride...Cumming is now 20 years older than when he first played the pansexual Master of Ceremonies, and his seductive performance in this career-defining role remains a knockout...he can be saucy and insinuating, cruel and menacing, downright debauched or dead-eyed and cold, often all at once...There's a riveting hard-soft dichotomy in Williams' performance. On one hand, she's the coke-snorting, armor-plated Sally who uses her frivolous disinterest in politics as an excuse to ignore the encroaching horror. On the other, she's the fragile creature who dreams of love and fulfillment while never quite convincing herself that those things are within reach...Mendes and Marshall have precision-tooled the production so that its hard, diamond edges glisten with sweat and sparkle.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-CABARET-Opens-on-Broadway-Updating-LIVE-20140424",
  "showScoreExcerpt": "Williams brings a wicked gleam to the role, her Sally both magnetically seductive and heartbreakingly fragile, with a voice that can purr like velvet or cut like a blade.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "bwwScore": 9,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ]
}
