{
  "showId": "cabaret-2014",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2014/04/25/theater/reviews/cabaret-revival-with-alan-cumming-and-michelle-williams.html",
  "publishDate": "April 24, 2014",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "This production doesn't just break the fourth wall; it obliterates any barrier between performer and audience, demanding that we become complicit in the world it creates.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "A little more than 16 years after it first opened, and only a decade after it closed, it feels as if the popular Roundabout Theater Company production of 'Cabaret' never left Studio 54, where it reopened on Thursday night. Alan Cumming, who won a Tony as the nasty M.C. in 1998, is back, offering a slightly looser, older-but-wiser variation on the same performance...The most conspicuous difference is the bright blond actress portraying Sally...The promiscuous, hard-partying Sally is now embodied by a very brave Michelle Williams, who doesn't look all that happy to be there. I'm assuming that's more a matter of character interpretation than of personal discomfort, but it does put sort of a damper on the festivities...Leading the Kit Kat girls in nightclub production numbers like 'Don't Tell Mama' and 'Mein Herr' with a shiny, metallic vibrato, Ms. Williams comes closer to evoking the musical style of the Depression than any Sally I've seen. And for her climactic performance of the show's title song, she has the shouty power and shell-shocked stare of someone who's seen the future and knows that it's terrifying.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-CABARET-Opens-on-Broadway-Updating-LIVE-20140424",
  "showScoreExcerpt": "This production doesn't just break the fourth wall; it obliterates any barrier between performer and audience, demanding that we become complicit in the world it creates.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "bwwScore": 8,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ]
}
