{
  "showId": "cabaret-2014",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2014/04/theater-review-cabaret-revival.html",
  "publishDate": "April 25, 2014",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "This Cabaret is performed with such skill and commitment that it almost makes you forget how often we've seen it before. Almost.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "I'm not sure you could call Cumming, with his rouged nipples and S&M undergear, tame; certainly he's tireless. But as the only holdover cast member, he's also the only one with a need to articulate a deeper understanding of his character. I'm not sure this can be done with a character who is a concept; at any rate, Cumming over-articulates the Emcee, illustrating every word he speaks like a mime instructor. Some of the punch lines get killed by the huge pauses he takes to set them up...The performers who make the most of their material are in fact the two who have the least background in musicals. Michelle Williams's head voice is breathy, with a hummingbird vibrato; her belt is solid if somewhat coarse. But these are not handicaps with Sally, and in any case she acts the hell out of the role...Not even Richardson, superb as she was, brought quite this sense of brimming irrepressibility to the role: irrepressible eagerness and irrepressible sorrow. And, somehow, both together.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-CABARET-Opens-on-Broadway-Updating-LIVE-20140424",
  "showScoreExcerpt": "This Cabaret is performed with such skill and commitment that it almost makes you forget how often we've seen it before. Almost.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "bwwScore": 8,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ]
}
