{
  "showId": "diana-the-musical-2021",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Diana/979",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Diana/979",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $139\n Buy Tickets\n\nCititour.com Review\n One shouldn’t say death becomes Lady Diana Spencer, but 24 years after the untimely – and still mystery-laden -- passing of the popular Princess of Wales, she’s become the prime subject for three very different works of art: the award-winning miniseries “The Crown,” the acclaimed arthouse film “Spencer,” and the mostly breezy Broadway musical “Diana,” now belatedly bowing at Broadway’s Longacre Theatre.\n\nHowever, unlike “The Crown,” which will spend countless hours examining Diana’s complicated marriage to Prince Charles, or “Spencer,” which focuses on only three days of her troubled existence, “Diana” takes an entirely different tack. Here, Tony Award-winning writers Joe DiPietro and David Bryan, in collaboration with Tony-winning director Christopher Ashley, have chosen to tell the entire 20-year tale of her courtship, marriage and almost-divorce in just 2 ½ hours. \n\nPredictably, the result is that we get a mostly superficial portrait of Diana, played by a slightly too-icy Jeanna DeWaal, whose iron-powered lungs and ability to perfectly wear William Ivey Long’s stunning re-creations of Diana’s iconic wardrobe are both quite remarkable. For all of her strengths, though, I don’t think DeWaal has the “It Factor” the role really needs; there seems to be little chance DeWaal will become our next Patti LuPone.\n\nStill, DeWaal fits the bill well enough to both deliver some very pointed dialogue and make the show’s ultimate point: As is indicated in the catchy opening number “Understimated,” Diana will suffer, mentally and physically for choosing her gilded cage and shiny tiaras, but she will finally prove to be smarter and shrewder than anyone imagined, a decision that might have cost the Princess her own life. \n\nIndeed, there is a lesson to be taken from “Diana”: Even a so-called “ordinary” woman can overcome an oppressive societal patriarchy, outsmart the press (ouch!), fight back against both an cold, overbearing, powerful and philandering husband, (the handsome Roe Hartrampf doing what he can this rather unfeeling Prince Charles) and his wily mistress (Erin Davie, giving the evening’s most complex performance as an all-too-human Camilla Parker-Bowles). Hell. she can even change the mind of the most unflappable woman of the world (the always solid and sadly underused Judy Kaye, perfectly channeling Queen Elizabeth II).\n\nSadly, “Diana’s” strengths – both the show and its title character -- can be easily lost among the musical’s breakneck speed, often unnecessary choreography (by the usually excellent Kelly Devine) and occasionally too-campy lyrics and even campier directorial choices. (Opening Act 2 with the emergence of Diana’s lover, James Hewitt, half-naked astride a horse might make a great pin-up poster to be sold at the merch stand, but it does little to bolster the show’s credibility.)\nMoreover, for a show about the richest family in the world, the entire enterprise – aside from Long’s lavish costumes – feels remarkably cheap, most notably David Zinn’s merely serviceable sets. Worse, the stage seems painfully underpopulated, with only a hard-working 14-person ensemble on hand to play everyone else involved (along with Kaye, doing delicious double-duty as romance novelist Barbara Cartland, who was both Diana’s idol and eventually her step-grandmother).\n\nIt's true, as one song goes, that the world fell in love rather quickly with Diana Spencer. Clearly, that love still endures. Whether that love is endless enough to make “Diana” a Broadway blockbuster remains to be seen. Let’s not underestimate it quite yet.\n By Brian Scott Lipton\n\nVisit the Sitehttps://thedianamusical.comOpen/Close DatesOpening 3/31/2020Closing 12/19/2021\nTheatre Info\nLongacre Theatre220 West 48th StreetNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 632,
  "archivePath": "data/archives/reviews/diana-the-musical-2021/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:36:47.968Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 632,
  "tierReason": "Full review text"
}