{
  "showId": "diana-the-musical-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2021/11/17/diana-the-peoples-princess-surrounded-by-the-wrong-people/",
  "publishDate": "2021-11-17T19:21:09",
  "fullText": "I declare before you all that my whole life whether it be long or short shall be devoted to your service and the service of our great imperial family to which we all belong.”\n— Claire Foy, The Crown, season 4, episode 8; also, Princess Elizabeth, April 21, 1947\n\nI declare before you all that my whole life whether it be long or short shall be devoted to your service and the service of our great imperial family to which we all belong.”\n— Claire Foy, The Crown, season 4, episode 8; also, Princess Elizabeth, April 21, 1947\n\nIf there’s one thing we know about Queen Elizabeth II after four seasons of The Crown and a pandemic spent watching seemingly every documentary about the House of Windsor (we all did that, right?), it is that she is driven by a single thing: duty. Ancillary royals can be selfish, libertine, or profligate—Uncle David, sister Margaret, Californian Harry—but for those who sit on the big chair, well, heavy is the head.\n\nAnd so it seems, in a way, entirely appropriate (if also a touch counterfactual) that the Broadway hagiography about the woman who was once destined to ascend to Elizabeth’s title, if not exactly to her throne—we speak of Diana, Princess of Wales, and the new Diana: A Musical—is, at its best, simply, perfectly dutiful.\n\nIt is not good. It is not terrible. It is bloodless, procedural, and, in Christopher Ashley’s staging, constantly, exhaustingly turned up to 11. It lacks nearly any wit, poetry, or sense of fun—except in the few moments when the tone shifts, briefly and inexplicably, to camp. (The estimable Judy Kaye  doubles as both Diana’s regal mother-in-law and also her over-the-top step-grandmother, the pulpy romance novelist Barbara Cartland, and in the latter role offers most of those few goofy moments.) We appreciate, once again, the many trials, stolen triumphs, and ultimate tragedies of Diana’s life. But watching it all rehashed at the Longacre, we are not especially amused.\n\nThis is not for lack of effort. The accomplished young actor Jeanna de Waal is Diana, with this battleship of a production resting on her alternately ruffled or bare shoulders. She confronts the task with the steadfastness it requires, giving it her overbearing all from the very first number. She sings with full force, she stomps around the stage, she punches through a mirror when the script calls for her to demonstrate a propensity toward self harm. (No room for crowd-displeasing bulimia or cutting here.) She never seems especially happy, but she does what is required, which is perhaps the truest portrayal.\n\nRoe Hartrampf, as her Charles, is a surprisingly handsome cipher, his hand firmly planted in his double-breasted coat pocket. Erin Davie acquits herself well in the thankless role of Camilla, and Gareth Keegan does what he can with James Hewett, Diana’s indiscreet inamorato, which consists entirely of opening the second act shirtless atop a horse, doing his best Matt Cavenaugh-in-Urban Cowboy. (The other bit of camp.)\n\nBut we come, unavoidably, to the script. And the music. And the lyrics. Joe DiPietro and David Bryan wrote Memphis, arguably the worst Best Musical Tony-winner of the 21st century. Here, DiPietro offers a script that rehashes Diana’s well-known story and contains no surprises, except where he fiddles with history. (An example: Asked in a post-engagement television interview whether the royal couple was in love, Charles famously answered, “Whatever ‘in love’ means.” Here, appropriately, there is a song called “Whatever Love Means Anyway.” But the first utterance of the line is, inexplicably, given to the Queen. Which is far less devastating.) Bryan’s music is forgettable pop-rock. And the pair’s lyrics are equally bad, all straightforward declarations, without any poetry, whimsy, or wordplay. Even their high points seem off: Diana’s end-of-Act I moment of conquest is as “pretty, pretty girl, in a pretty pretty dress” (hardly a feminist victory) and her final out-from-Windsor triumph  is “I choose happiness/ I choose a fresh new start/ I choose whatever lies ahead,” when we all know what lies ahead.\n\nAlas they get little help from their designers: The lights are often blinding (like the paparazzi!), the set is a simple palace fence (like Diana was fenced in!), and while Diana’s gowns nicely reflect the iconic originals, and the woman are generally nicely dressed, the men other than Charles are all in poorly tailored suits, with shirt collars that don’t fit and neckties that are improperly tied. It looks as though William Ivey Long ran through his budget on the green gown and the revenge LBD, and hit Century 21 for the gents.\n\nGranted, these creators are starting at a disadvantage. It’s hard to get at emotional truths with famously unemotional characters. Stiff upper lips do not often break into character-revealing song. But rather than attempt a theatrical solution to that problem—a Leading Player to narrate, say, or ghostly former selves to comment on the action—DiPietro and Bryan simply ignore. Elizabeth gets an 11-o’clock change-of-heart number, “An Officer’s Wife,” recalling her young married days with Philip and prompting a tenderhearted willingness to grant Charles and Diana’s divorce. It’s sweet, if we only believed that ol’ Lilibet ever allowed herself a reverie. (Somehow Kaye-as-Elizabeth comes off most like Mary Testa-as-Barbara Bush.)\n\nIn fact, if there’s anyone here who is ultimately mysterious and compelling, it’s Camilla. Though Diana’s epithet for her, the Rottweiler, is frequently repeated, the third person in their marriage in fact comes off as a kicked-aside stray. She’s not allowed to marry the love of her life, she tries to stay away but Charles keeps showing up, she stands by, and she waits, and, as we know, she eventually becomes a fine companion to the awkward prince in his old age. She also has perhaps the only good song in Diana, “I Miss You Most on Sundays,” a pleasant “I want” song that, unlike the rest of the score, actually employs metaphor.\n\nIt’s the final indignity, really, that I left Diana wanting more of Camilla. But that woman, perhaps the most dutiful of all, has a story to tell.\n\nDiana opened November 17, 2021, at the Longacre Theatre. Tickets and information: thedianamusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-roundup"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "It is not good. It is not terrible. It is bloodless, procedural, and, in Christopher Ashley's staging, constantly, exhaustingly turned up to 11. It lacks nearly any wit, poetry, or sense of fun-except in the few moments when the tone shifts, briefly and inexplicably, to camp. (The estimable Judy Kaye doubles as both Diana's regal mother-in-law and also her over-the-top step-grandmother, the pulpy romance novelist Barbara Cartland, and in the latter role offers those few goofy moments.) We apprec",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-DIANA-THE-MUSICAL-Opens-on-Broadway-The-Critics-Weigh-In-20211117"
}
