{
  "showId": "diana-the-musical-2021",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/diana-the-musical-broadway-review",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/diana-the-musical-broadway-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "An enduring global icon nearly 25 years after her death, Princess Diana's fractured fairytale story has been mined extensively and spun into books, TV shows, and movies. It was only a matter of time before it was churned into a Broadway bio-musical. Too bad what awaits for subjects of the Great White Way is Diana: The Musical, a vacant and vapid royal rehash. Besides lacking a compelling point of view to make this familiar tale fresh, the slick musical retread tends to take a campy approach as it chronicles Diana's tumultuous marriage to the ever-unfaithful Prince Charles. That includes a cameo and commentary by her step-grandmother, romance novelist Barbara Cartland, gushing and gabbing in an explosion of Pepto Bismol pink. Diana's 11 o'clock ditty about how she'll \"light the world\" doesn't balance the scales. Handling Diana's story with kitsch gloves seems an odd choice from director Christopher Ashley, who won a Tony Award for the warm, feel-good 9/11-themed musical Come From Away. Diana's life was packed with exploitations, rocky romances, and scandals, yes, but the woman died an agonizing death in a Paris car wreck in 1997. Nothing cartoonish in that. The show's creators — Joe DiPietro, who wrote the book and shares credit for lyrics with composer David Bryan — don't seem interested in getting more than skin deep. Instead, this team, which also made Memphis, cherry-picked Wikipedia-worthy moments and raided Diana's closet for famous outfits recreated here by William Ivey Long. Massive wedding gown? Check. Nice sheep sweater? Check. Naughty little black dress? Check — more on that in a minute. While pop-rock rhythms and melodies actually feel right for the People's Princess, the score is larded with limp lyrics and predictable rhymes. Each song offers up its own evidence, but the banality is distinctly center stage when Diana, who knew the power of designer fashion, famously uses it to turn the tables on Charles as he goes public about his long-running affair with married Camilla Parker Bowles. \"When a girl needs to express,\" Diana belts, \"her proper state of distress, revenge looks best in a f--k you dress. A f--ckity, f--ckity, f--ckity, f--ckity, f--ck you dress.\" Brazen and cheeky AF? Not so much. With the exception of the opening number in which Diana steps forward to reflect on how she was \"Underestimated,\" this musical bio takes a typically snoozy chronological approach. Here's Diana as: 19-year-old kindergarten teacher; depressed newlywed with a cheating husband; tabloid prey of trenchcoated paparazzi; glamour icon; doting mother; defiant cheater herself with British army officer James Hewitt (Gareth Keegan). Diana's humanitarian efforts offer a rebuke to Charles' assertion: \"Your life's greatest achievement — you married me.\" To their credit, the cast maintains their dignity. As Prince Charles, Broadway rookie Roe Hartrampf is charming and caddish and too handsome by half. He's also game for anything, including a manic doozy of a dance number where Diana daydreams about their incompatibilities and tastes in music. Grey Gardens alum Erin Davie adds a stalker vibe as Camilla. Judy Kaye doubles up as Queen Elizabeth, who reflects on her own experience late in the show, and the larger-than-life Cartland. In the title role and, of course, a signature Diana coif, Jeanna de Waal hits her marks and notes and, as this clothes-conscious production requires, makes a fine mannequin. During the pandemic, Diana was captured for Netflix. On film and on stage, the show doesn't sing. Diana, The Musical is running at the Longacre Theatre. Get Diana, The Musical tickets on New York Theatre Guide. Photo credit: Roe Hartrampf, Judy Kaye, and Jeanna de Waal in Diana, The Musical. (Photo by Matthew Murphy) Originally published on Jan 31, 202217:09",
  "isFullReview": true,
  "textWordCount": 611,
  "archivePath": "data/archives/reviews/diana-the-musical-2021/nytg--joe-dziemianowicz_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:56:53.319Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 611,
  "tierReason": "Full review text"
}