{
  "showId": "birthday-candles-2022",
  "outletId": "broadwaynews",
  "outlet": "Broadway News",
  "criticName": "Naveen Kumar",
  "url": "https://broadwaynews.com/2022/04/10/review-in-birthday-candles-the-cake-is-too-sweet/",
  "playbillVerdictUrl": "https://broadwaynews.com/2022/04/10/review-in-birthday-candles-the-cake-is-too-sweet/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "There are some things in life you can count on. Birthdays will tick by like clockwork, a good cake recipe won’t fail and the young will chase their future while elders reminisce. There are some things in life you can count on. Birthdays will tick by like clockwork, a good cake recipe won’t fail and the young will chase their future while elders reminisce. But combining staple observations about everyday existence, as the playwright Noah Haidle does with a cosmic hand in “Birthday Candles,” does not guarantee they’ll rise into more than mollifying fluff. The fine line between distilling so-called ordinary life and whipping up airy clichés is all but dissolved in this replay of one woman’s birthday over the course of many decades. From year to year, we’re always in the hours before the party, when Ernestine (earnestly played by Debra Messing) is preparing the golden cake that her mother teaches her to make on her 17th birthday.",
  "isFullReview": false,
  "textWordCount": 159,
  "archivePath": "data/archives/reviews/birthday-candles-2022/broadwaynews--naveen-kumar_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:52:57.949Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 171 (min: 300)"
  ],
  "contentTier": "truncated",
  "wordCount": 159,
  "tierReason": "Short text (159 words)",
  "bwwExcerpt": "Despite the play's universe-skimming ambitions, there's also a narrowness to its imagination of what life can and could be. Ernestine follows a path of least resistance; though she has regrets, 'Birthday Candles' isn't a critique of conformity, or the broader social forces that led her there (she is a woman happily baking a cake, year after year, for more than half a century, after all). The play rather reinforces the heteronormative fantasy that fulfillment comes in recognizable forms - just be careful which man you choose. It's a bitter, if obvious, pill served with enough sugar to rot a full mouth of teeth.",
  "bwwScore": 4
}
