{
  "showId": "birthday-candles-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2022/04/10/birthday-candles-casts-a-dim-theatrical-flame/",
  "publishDate": "2022-04-10T19:55:45",
  "fullText": "Listening to the cacophony of sniffles and laughs that emanated from the audience at the American Airlines Theatre, it was hard not to think of that famous line from Noel Coward’s Private Lives: “Extraordinary how potent cheap music is.” Substitute “playwriting” for “music,” and you have some idea of the manipulative hokiness of Birthday Candles.\n\nThis play by Noah Haidle (Mr. Marmalade, Smokefall) receiving its New York premiere by the Roundabout Theatre Company, is less indebted to Coward, however, than Thornton Wilder. Like Wilder’s one-act The Long Christmas Dinner, Birthday Candles spans 90 years and concerns several generations of a family. And like his Our Town, it deals with existential issues of lives both well-lived and not.\n\nUnfortunately, Haidle’s dramedy lacks the bracing acerbity marking Wilder’s plays, which are too often erroneously labeled as treacly and sentimental. As we watch its central character, Ernestine (Debra Messing) age from 17 to 107, we’re more often reminded of life’s banality than its specialness. When she declares as a headstrong teenager, “I’m a rebel against the universe!” you find yourself counting the minutes until her dreams are thwarted.\n\nThere’s no shortage of significant events occurring in the evening’s fast-paced but paradoxically slow-moving 90 minutes. Characters fall in love, get married, have children and grandchildren, become infirm, and die. Hopes and ambitions are both realized and abandoned, and joy and tragedy are doled out in fairly equal amounts. The one constant is that the scenes always take place on Ernestine’s birthdays, during which she resolutely bakes a cake, and that all the action occurs in the expansive kitchen of her family home in Grand Rapids, Michigan.\n\nFor all the baking going on, however, Birthday Candles remains stubbornly half-baked. Other than the obvious platitudes about the inevitability of change and loss the more life goes on, there are none of the insights that would make you sit up and take notice. There’s a shallowness to the proceedings that give the evening the feel of an attenuated variety show sketch. The dialogue rarely rises above the pedestrian, and the running gags, such as a character repeatedly sneaking up on Ernestine until she emits a started scream, get old as fast as the characters.\n\nThe passage of time, signified by the periodic sound of a bell, is often cleverly rendered via props and costumes. With the exception of Messing and Enrico Colantoni (Veronica Mars) — the latter playing Kenneth, a neighbor of Ernestine’s who pines for her for decades — the rest of the ensemble (John Earl Jenks, Crystal Finn, Susannah Flood, Christopher Livingston) skillfully embody multiple roles, often changing characters or ages from one moment to the next.\n\nIt’s easy to see why Messing wanted to star in the play. She’s onstage for the entire running time, and effectively conveys her character’s aging solely through body language and vocal changes. The actress delivers a winning performance, with her innate charm and comic chops, not to mention the audience goodwill she’s generated over the years on Will and Grace, putting the audience firmly in her camp. Colantoni generates laughs and pathos in equal amounts as the haplessly lovelorn Kenneth, and Finn stands out as Ernestine’s daughter Joan, among other characters. Special mention must also be made of the onstage goldfish who virtuosically represents Ernestine’s dozens of fish over the years and who receives its own curtain call.\n\nChristine Jones’ homey kitchen set feels properly lived in, and the whimsical assemblage of various objects suspended overhead provides a nice cosmic touch. John Gromada’s ethereal sound design and Kate Hapgood’s delicate music add to the overall Twilight Zone effect without being too heavy-handed.\n\nFor many, Birthday Candles will no doubt prove deeply moving, especially since it inevitably deals with so many relatable issues for both young and old. And if I’m being honest, there were moments that got to me as well, proving that there’s still something resembling a heart beneath this curmudgeonly exterior. But then, I’ve always found cheap music extraordinarily potent.\n\nBirthday Candles opened April 10, 2022, at the American Airlines Theatre and runs through May 29. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial"
}
