{
  "showId": "birthday-candles-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2022/04/10/birthday-candles-a-quirky-time-hopping-rom-com/",
  "publishDate": "2022-04-10T19:56:52",
  "fullText": "The odd thing about the eccentric but engaging Birthday Candles—one of many odd things about Noah Haidle’s new play, now on Broadway at the American Airlines Theatre—is that no one ever eats any cake.\n\nErnestine Ashworth (Will & Grace star Debra Messing) spends the entire show making her signature birthday cake: dutifully cracking eggs, leveling flour and baking powder, measuring milk and vanilla, creaming butter and sugar, and so on. Eventually, she brings the finished product out of the oven—it smells heavenly!—and she dumps it into the trash. Don’t be surprised when you hear gasps throughout the audience. That’s how invested theatergoers are in the creation of this confection.\n\nWe watch Ernestine age from 17 to 107—through marriage, parenthood, grandparenthood, and beyond—marking every birthday with from-scratch Golden Yellow Butter Cake. At age 17, the “recipe” isn’t very important to Ernestine. “Atoms left over from creation,” says her mother, Alice (Susannah Flood). Sighs Ernestine: “Stardust. The machinery of the cosmos…” She’s much more concerned with prepping for her King Lear—sorry, Queen Lear, “a feminist interpretation”—audition. “Because if Donna Kaplan gets the lead in another school play I’ll die.” Spoiler: Ernestine does not die. Long live the queen.\n\nThe following year, while Ernestine is making that very cake, she refuses an invite to the prom from Kenneth (Veronica Mars’ Enrico Colantoni), and accepts one from Matt (John Earl Jelks), her eventual husband. Many years later, that’s when her son Billy (Christopher Livingston) brings home his jumpy future wife Joan (Crystal Finn, in a roaringly funny Broadway debut), who ends up hyperventilating into a utensil crock after an embarrassing remark about Finish Me Off nail polish. (Incidentally, Haidle could have quite a side hustle naming nail lacquer. A few of his gems: Bang the Dream; Oops Not There, Senator; Yes, Right There, Madame Secretary.) The kitchen—on her birthday—is also where Ernestine holds her first granddaughter, and her first great-granddaughter. Does anything significant happen to this woman outside of the kitchen—or on any other day of the year?\n\nThere might be life beyond the walls of Ernestine’s expansive Grand Rapids, Michigan, kitchen, but Birthday Candles isn’t interested in it. (Your first clue that Birthday Candles doesn’t take place in the real world as we know it comes from Christine Jones’ fantastical set: pots and pans, musical instruments, stuffed animals, and assorted bric-a-brac hanging from above—a lifetime of memories scattered across the sky like stardust.) Haidle has a bit of a knack for creating alternate universes in his plays. His 2005 pitch-black comedy Mr. Marmalade centered on a precocious 4-year-old girl and her hard-drinking, coke-snorting imaginary friend. His 2016 Smokefall set an entire scene between two chatty fetuses in utero. A woman aging 90 years in 90 minutes actually seems a bit ordinary by comparison. And perhaps because there’s so much to cram in—again, 90 years in 90 minutes—Ernestine only grows older; she doesn’t really grow.\n\nFortunately, whether she’s wearing a ribbon in her hair and bouncing around the room as teenage Ernestine or slouchy knee-high stockings and shuffling slowly about as nonagenarian Ernestine, Messing is an absolute delight. And she’s beautifully matched with Colantoni, a total charmer as the geeky boy next door and later the geeky geezer next door. You might say they take the cake.\n\nBirthday Candles opened April 10, 2022, at the American Airlines Theatre and runs through May 29. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "There might be life beyond the walls of Ernestine's expansive Grand Rapids, Michigan, kitchen, but Birthday Candles isn't interested in it. (Your first clue that Birthday Candles doesn't take place in the real world as we know it comes from Christine Jones' fantastical set: pots and pans, musical instruments, stuffed animals, and assorted bric-a-brac hanging from above-a lifetime of memories scattered across the sky like stardust.) Ernestine only grows older; she doesn't really grow.",
  "bwwScore": 5
}
