{
  "showId": "birthday-candles-2022",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Diep Tran",
  "url": "https://www.newyorktheatreguide.com/reviews/birthday-candles-broadway-review-debra-messing",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/birthday-candles-broadway-review-debra-messing",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Sugar. Butter. Flour. Those are the building blocks of a good cake but also, according to Birthday Candles, the treacle new play on Broadway by Noah Haidle, a good cake is also \"atoms left over from creation. Look deeper and you'll find the story of the universe.\" That's a lot to put on a cake, and like an overbeaten cake, the play inflates with potential before ultimately collapsing in on itself, being filled with nothing but air. Birthday Candles stars Debra Messing in an impressive acting exercise: Messing plays Ernestine, an everywoman living in the Midwest, from age 17 to 107. Haidle uses a creative narrative construction that has the potential for brilliance: Birthday Candles is a series of snapshots, checking in with Ernestine on her birthday as she bakes her annual birthday cake — first with her mother, then with her husband, children, grandchildren, and great-grandchildren. The flash forwards are done with bells, sometimes spaced out for longer scenes, and other times in quick succession, to show the years quickly passing. And in a feat of timing, thanks to the sure hand of director Vivienne Benesch, Messing and the cast bake an actual cake onstage. You can see them hand mix the batter and smell the cake as it's baking in the oven of Christine Jones's cottage-core set (the floating furniture at the top of the kitchen set is truly gorgeous, giving the play a cosmic energy even as you enter the theatre.) Unfortunately, for a play about the quotidian joys and heartbreaks of life, Birthday Candles rarely goes beneath the surface. The characters sound less like real people and more like Hallmark greeting cards — such as when an 18-year-old Ernestine proclaims in a line said by no teenager ever: \"I am a rebel against the universe. I am waging a war with the everyday. I am going to surprise God!\" Then the play fast-forwards a confounding 21 years, to when Ernestine has settled into her socially acceptable role as a wife and a mother, her youthful ambitions forgotten. Except what happened in those 21 years that made her abandon her dreams. What even were her dreams? Haidle is so caught up in his dramatic device and in showcasing the universal milestones of love, family, aging, and loss that he forgot that real universality is rooted in the specific. The audience spends 100 years of play time with Ernestine and her family, and we don't feel like we know who they truly are. Instead the play depends on the audience's own lived experience to give it emotional heft. Birthday Candles also depends on the actors to give these broadly drawn characters inner life. Messing has the hardest job: She is on stage the entire time and she has to play Ernestine at every age, while making a cake in front of the audience. Messing, who is more mild-mannered here than on Will and Grace or even Smash, lacks the necessary oomph and conviction to play the young, fiery Ernestine. And as middle-aged Ernestine, Messing recedes into the background next to the zany personalities around her — such as a hilarious Crystal Finn as Ernestine's spastic daughter-in-law Joan or the quietly moving Susannah Flood, who plays Ernestine's mentally troubled daughter Madeline. It is as the older Ernestine that Messing truly shines. As her movements become slower and her voice becomes deeper, Ernestine is finally allowed to have a personality. She is finally given lines that showcase Messing's sharp comic timing. And Messing's scenes with the adorable Enrico Colantoni, who plays her lifelong friend Kenneth, brim with a warm, easy chemistry. The supporting cast around Messing are uniformly excellent, with John Earl Jelks giving a wonderfully grounded performance as Ernestine's husband Kenneth, and Christopher Livingston going from a delight to heartbreaking as Ernestine's son Billy. There are some beautiful insights in Birthday Candles, such as when different characters deliver the same lines, to show how life can be circular — that every generation goes from the passionate idealism of youth to the resigned dissatisfaction of middle age. But as the play progressed, I kept waiting for Birthday Candles to provide me with a greater insight into humanity's place in the cosmos or even just living. Or to even explode out like a supernova. But the play fails to deliver anything of greater substance — it is just dessert, all sugar. And like sugar, it'll dissolve from your mind after you've seen it. Birthday Candles is at the American Airlines Theatre through May 29. Book Birthday Candles tickets on New York Theatre Guide. Photo credit: Debra Messing in Birthday Candles (Photo by Joan Marcus) Originally published on Sep 29, 202209:12",
  "isFullReview": true,
  "textWordCount": 779,
  "archivePath": "data/archives/reviews/birthday-candles-2022/nytg--diep-tran_2026-02-03.html",
  "textFetchedAt": "2026-02-03T22:44:03.728Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 779,
  "tierReason": "Full review text"
}