{
  "showId": "birthday-candles-2022",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/birthday-candles-the-monotonous-trick-kind-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/birthday-candles-the-monotonous-trick-kind-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Did you hear the one about the woman who lived a life? She had ups, downs, outlived some around her, was survived by others. In case you forgot the basic trajectory of human existence, a self-satisfied little play called Birthday Candles opened tonight at the American Airlines Theatre. The Broadway debut of playwright Noah Haidle, it has almost nothing to say about the grand existential themes it barks throughout its brisk 90 minutes. It's hard to imagine why Messing took on this role, which only plays into her strengths as an actor a handful of times, when the script offers up sitcom-style setups.",
  "bwwScore": 3,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-BIRTHDAY-CANDLES-on-Broadway--Updating-Live-20220410",
  "fullText": "Debra Messing with Christopher Livingston | Photo: Joan Marcus\n\nDid you hear the one about the woman who lived a life? She had ups, downs, outlived some around her, was survived by others. In case you forgot the basic trajectory of human existence, a self-satisfied little play called Birthday Candles opened tonight at the American Airlines Theatre. The Broadway debut of playwright Noah Haidle, it has almost nothing to say about the grand existential themes it barks throughout its brisk 90 minutes.\n\nDebra Messing plays Ernestine Ashworth across several decades’ worth of birthdays, from her 17th to her 107th. Onstage throughout the duration of the play, she adopts an old lady voice as the play goes on and her life works itself out. The young Ernestine is idealistic and bold, reveling in her recent turn as “Queen Lear” on her high school stage. She is also shockingly existential about her role in the universe, speaking in Neil deGrasse Tyson-isms and carrying on about wanting to “meet the divinity within herself.”\n\nOstensibly a quirky character trait, the insufferable big-brain gene transfers to her daughter Madeline (Susannah Flood), who we know “Suffers From Something” because she talks about pills and generally goes against the family flow. Their nebulousness is reflected in Christine Jones’ appealing set — a large kitchen above which everyday objects like soccer balls and record players are suspended mid-air — and John Gromada’s new-agey sound design, composed mostly of wind chimes, ocean whooshes, and dings that signify the passage of time.\n\nThe two other members of the household are father Matt (John Earl Jelks), and son Billy (Christopher Livingston), plus Ernestine’s longtime admirer and neighbor, Kenneth (Enrico Colantoni). We trace these characters’ involvement in Ernestine’s life, with each actor except Messing and Colantoni playing various roles. Billy’s college girlfriend Joan (Crystal Finn), for example, later returns as Ernestine’s granddaughter. Couples split, lovers unite, relationships ebb and flow, life goes on, and we check in every couple of years with the undiscerning irregularity of an uncaring god.\n\nBaking sort of holds everything together, playing a central part of Haidle’s metaphor-heavy show. Ernestine’s late mother was joyous about their tradition of whipping up a birthday cake together, so its simple ingredients, much like the objects hanging above the proceedings, come to represent life’s all-important minutiae in the world’s least expedient rendition of “Seasons of Love.”\n\nBut you’re more likely to come away with a better understanding of how to bake a cake — something needs to hold us over before the next Waitress revival — than with our role in the universe, or how, or why, any of it should add up to something. “The pattern keeps getting stranger between the living and the dead,” Madeline announces in one scene, apropos of nothing. If Haidle meant for us to make anything out of the disparate scenes he presents, some restraint in the amount of time, characters, and relationships covered might have done the trick. None are very memorable, and Haidle doesn’t draw any interesting lines between them.\n\nI’m hard-pressed to fault the cast, who must reconcile their characters' utter void of identity with the number of roles they’re asked to play. Livingston acquits himself quite nicely, perhaps because his characters seem to get the most jokes, perhaps because he makes jokes out of them back.\n\nIt’s hard to imagine why Messing took on this role, which only plays into her strengths as an actor a handful of times, when the script offers up sitcom-style setups. A late-in-life romance for Ernestine grants her some moments of tenderness, but the character itself is a needlessly strenuous (in terms of constant visibility), thanklessly underwritten part.\n\nPassively directed by Vivienne Benesch, Birthday Candles is an expositional attempt to reconcile humanity’s smallness with the universe’s grandness. Typing that made my nose bleed, and I’m sure reading it will cause a similar reaction. For that, I apologize, but such is the material we’ve been presented. Without any particular viewpoint, Haidle takes us through a woman’s time on earth without a shred of philosophy: humanism, nihilism, objectivism, objectivity are nowhere to be found. All we’re left with is these candles that just won’t blow out.\n\n‍Birthday Candles is in performance through May 29, 2022 at the American Airlines Theatre on 42nd Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 829,
  "archivePath": "data/archives/reviews/birthday-candles-2022/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:12:34.468Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251011130642",
  "archiveOrgUrl": "http://web.archive.org/web/20251011130642/https://www.theatrely.com/post/birthday-candles-the-monotonous-trick-kind-review",
  "contentTier": "complete",
  "wordCount": 829,
  "tierReason": "Full review text"
}