{
  "showId": "frankie-and-johnny-in-the-clair-de-lune-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2019/05/30/frankie-and-johnny-in-the-clair-de-lune-acting-brilliance-in-the-light-of-the-moon/",
  "publishDate": "2019-05-30T21:17:07",
  "fullText": "Terrence McNally’s 1987 two-character play observes a pair of mismatched middle-aged misfits who are stunned to discover—in the light (clair) of the Manhattan moon (lune)—that the future they’ve both long given up on might just be found in the other’s imperfect arms. Mismatched characters, yes; played here by the mismatched but equally brilliant Audra McDonald and Michael Shannon, Frankie and Johnny in the Clair de Lune positively soars.\n\nThat McDonald plays Frankie so well is not surprising; she has repeatedly demonstrated that she can do just about anything. It is surprising, at first, that she has chosen to undertake the role. (For those unfamiliar with the play: Frankie and Johnny begin the evening naked, figuratively and literally, in bed and out.) It doesn’t take long for us to understand why McDonald has tackled the role, and to be mighty glad that she has. McNally’s character is bound by many psychological walls, and McDonald is somehow able to show more vulnerability when Frankie throws on an kimono or jeans than when she is in the altogether.\n\nShannon is far less familiar, Broadway-wise, his only credits being the quickly-forgotten Grace (at the Cort, in 2012) and a powerful Tony-nominated turn in the Jessica Lange Long Day’s Journey into Night in 2016. That list is deceptive, though. He started as a Steppenwolf actor, visiting off-Broadway starting in 1998 with powerful performances in Tracy Lett’s Killer Joe and Bug, plus Stephen Adly Guirgis’ The Little Flower of East Orange. He has gravitated to film, with Oscar-nominated roles in Revolutionary Road and Nocturnal Animals; but Frankie & Johnny reminds us that Shannon is at core a stage creature. He is as fascinating to watch as McDonald.\n\nThe performances of the stars are as different as—well, as Frankie (waitress at a “dirty spoon”) and Johnny (short-order cook). Combine two supercharged but diametric performances and the results might well sizzle or fizzle. These characters make an impossible pair; put them together and light the kindling, though, and McNally demonstrates that they may well be the best and last chance either of them will find. With McDonald and Shannon in Frankie and Johnny’s shoes, or rather bare feet, the stage is dazzled with lightning sparks of alternating current.\n\nSpeaking of lightning sparks, these come not only from the cast but from lighting designer Natasha Katz doing a customarily expert job. The scenery, alas, leaves us puzzled. While McNally proscribes that we are in a one-room walkup in Hell’s Kitchen, Riccardo Hernández (Indecent) places this small apartment in front of a tenement exterior; it seems like Frankie has been dispossessed as in one of those Depression films, her furniture thrown out on the sidewalk. There is an effectively grand scenic reveal in the final moment of the play, but we sometimes feel like the bed is placed on the front stoop and they are stepping through a first-floor window to get to the bathroom.\n\nOtherwise we have an impeccable production from Arin Arbus, who after a decade at TFANA (Theatre for a New Audience) here makes a most welcome Broadway debut. Arbus carefully modulates her two powerhouse actors, not necessarily an easy task. The three of them, along with McNally, combine to creating an enchantedly moonlit evening.\n\nAs for the author, he has had a long and varied career, starting with a couple of controversial Broadway flops. (And Things That Go Bump in the Night lasted two weeks in 1965; Here’s Where I Belong lasted one night in 1968—with McNally publicly battling to remove his librettist credit.) He moved on to a succession of new-style comedies (Next!, Bad Habits, The Ritz); a series of increasingly powerful plays from 1989 on (The Lisbon Traviata, Lips Together—Teeth Apart, Love! Valour! Compassion!); and finally significant success in the musical field (Kiss of the Spider Woman, Ragtime). Frankie and Johnny, in 1987, pointed the way forward to his career as a serious dramatist. It is revealed to be quite a good play, the author burrowing deep into his characters with abundant tension-alleviating humor.\n\nLet us point out that while McDonald began her Broadway career in parts created by others, her first two original roles were in McNally’s Master Class and Ragtime. It was thus inevitable, perhaps, that she should one day find herself playing another McNally role, and it turns out exceedingly well for actor and playwright both. Perhaps we’ll one day get to see Audra in Master Class again—this time playing Maria Callas?\n\nFrankie and Johnny in the Clair de Lune opened May 30, 2019, at the Broadhurst Theatre and runs through August 25. Tickets and information: frankieandjohnnybroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-reviews"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2019/05/30/frankie-and-johnny-in-the-clair-de-lune-acting-brilliance-in-the-light-of-the-moon/",
  "bwwExcerpt": "Terrence McNally's 1987 two-character play observes a pair of mismatched middle-aged misfits who are stunned to discover-in the light (clair) of the Manhattan moon (lune)-that the future they've both long given up on might just be found in the other's imperfect arms. Mismatched characters, yes; played here by the mismatched but equally brilliant Audra McDonald and Michael Shannon, Frankie and Johnny in the Clair de Lune positively soars.",
  "bwwScore": 8
}
