{
  "showId": "1776-2022",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "http://www.nydailynews.com/entertainment/theater-arts/1776-witty-long-winded-article-1.2584036",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/theater-arts/1776-witty-long-winded-article-1.2584036",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "Freedom doesn’t come easy-breezy.\n\nEither does “1776,” a singing slice of Americana about the Declaration of Independence.\n\nBack in an Encores! concert staging through Sunday, the 1969 best musical Tony winner by Peter Stone (book) and Sherman Edwards (music and lyrics) packs wit, spirit and some good songs.\n\n“For God’s Sake, John, Sit Down” establishes a snarky, non-reverential tone from the get-go. “He Plays the Violin” lends romance. “Momma, Look Sharp,” stings and pulls heart-strings.\n\nBut long-winded scenes without music — or so much as a drumbeat or toot on a fife — are as enjoyable as taxation without representation. Stretches of the almost three-hour show are a slog.\n\nStill, Stone’s witty jokes about a do-nothing Congress never fail to hit the mark. Polarizing founding father John Adams (a charismatic Santino Fontana) does gags that could work for a Jimmy Fallon monologue.\n\nDirector Garry Hynes’ production, which uses color-blind casting, features modern clothes for Benjamin Franklin (a droll John Larroquette) and Thomas Jefferson (an appealing John Behlmann) and the other statesmen and a couple of wives.\n\nThese 18th-century figures are deciding whether or not to declare independence and fight for freedom from England, but they could be going to a board meeting tomorrow.\n\nSet over three tempestuous and bloody months running up to July, 4, 1776, the show’s return is perfectly timed for current, high-stakes politics.",
  "isFullReview": false,
  "textWordCount": 226,
  "archivePath": "data/archives/reviews/1776-2022/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:38:10.201Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Word count too low: 226 (min: 300)"
  ],
  "contentTier": "truncated",
  "wordCount": 226,
  "tierReason": "Short text (226 words)",
  "rejectedAt": "2026-02-04T05:25:33.913Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about an Encores! concert staging, not the current Broadway run.; kimi: ",
  "promptVersion": "5.2.0",
  "bwwExcerpt": "In short, then, you have a revival that wants both to revive the material and blow it up, even though '1776″ hardly was a crude work of musical triumphalism. Sure, '1776″ is problematic, not unlike most cultural entities from 1969, but if that it was it wanted to foreground, the production needed to have better sense of the irony of bringing it back to our attention. As distinct, say, from supporting a new musical by people of color about the complexities of American history.",
  "bwwScore": 3
}
