{
  "showId": "king-kong-2018",
  "outletId": "3news",
  "outlet": "3News",
  "criticName": "Unknown",
  "url": "http://3news.co.nz/REVIEW-Melbournes-King-Kong-musical/tabid/418/articleID/301597/Default.aspx",
  "playbillVerdictUrl": "http://3news.co.nz/REVIEW-Melbournes-King-Kong-musical/tabid/418/articleID/301597/Default.aspx",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "King Kong has once again taken up residence on stage – and in spectacular fashion. The fictional beast's story has been retold many times since Merian C Cooper's 1933 film, but never as a musical.\n\nThankfully the show's creators have not been afraid to step outside the traditional ra-ra Broadway style, opting instead for a dark, reflective score with some brave contemporary staging.\n\nThe real star of the show, however, is Kong himself. The 6m-tall ape towers over his co-stars, with a combination of marionette puppet and animatronic robot technologies making him alarmingly lifelike.\n\nBut the expectation of Kong's arrival makes the opening somewhat sedentary in contrast. The dialogue is clunky in parts and initial character development is lacking, especially in film director Carl Denham, who is but a shadow of his previous delusional, megalomaniacal incarnations.\n\nThe mediocrities are quickly overshadowed when Kong emerges though, his carefully synced footsteps thundering impressively through the theatre. His 13 puppeteers are a sight to behold as they scramble up the beast's back and fly from his shoulders to operate his limbs.\n\nKong's entrance heralds a turning point for the show, after which the audience is plunged into the world of Skull Island and its mystical inhabitants.\n\nThe set becomes a visual feast, with vivid visualisations on an expansive digital backdrop representing the jungle, and the island's ghostlike inhabitants floating eerily down from the ceiling in silken tubes.\n\nComposer and arranger Marius de Vries has woven music from across the centuries into a powerful modern score, which includes works by Verdi, Justice and Sarah McLachlan. One of the most haunting songs is the original composition 'Full Moon Lullaby', sung by Anne Darrow (played by Esther Hannaford) to a morose Kong. It is one of the most poignant moments in the show – Hannaford's chemistry with the ape reciprocated by the incredible realism of the puppet's facial expressions.\n\nBy the second act, Denham (Adam Lyon) is finally in full flight as he competes with Kong for the New York spotlight.\n\nAs the city descends into chaos things become more and more surreal. The Avalanches' cover of 1930s standard 'Get Happy' provides one of the more sublime moments.\n\nAustralian theatre stalwart Queenie van de Zandt gives a standout performance as fortune teller Cassandra, a character created for the musical to foreshadow the story's tragic climax. Her powerful voice helps her rise above the chaos, further upping the intensity.\n\nKing Kong creates such an immersive world that it was a relief to emerge into the night and find that the city of Melbourne was still intact. It is perhaps the closest you will ever get to experiencing the \"Eighth Wonder of the World\".\n\nThis review was based on a June 4 preview.\n\nDavid Shearer has today resigned as Labour leader. Here is h...\n\nA police dog which died protecting his handler is today bein...\n\nAlthough the use of Agent Orange in Vietnam ended over 40 ye...\n\nTwo faultless performances have handed Team New Zealand a co...\n\nContact | \n Privacy Policy | \n Advertise with us |",
  "isFullReview": true,
  "textWordCount": 508,
  "archivePath": "data/archives/reviews/king-kong-2018/3news--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:47:46.832Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.goto: Timeout 60000ms exceeded.\nCall log:\n  - navigating to \"http://3news.co.nz/REVIEW-Melbournes-King-Kong-musical/tabid/418/articleID/301597/Default.aspx\", waiting until \"domcontentloaded\"\n"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20130822060139",
  "archiveOrgUrl": "http://web.archive.org/web/20130822060139/http://www.3news.co.nz/REVIEW-Melbournes-King-Kong-musical/tabid/418/articleID/301597/Default.aspx",
  "contentTier": "complete",
  "wordCount": 508,
  "tierReason": "Full review text"
}