{
  "showId": "king-kong-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/11/08/king-kong-broadway-agape-over-ape/",
  "publishDate": "2018-11-08T21:31:00",
  "fullText": "King Kong—the animated star of the new Broadway extravaganza, and when I say animated I don’t mean “full of life”—is awesome. The sheer size and range of movement of this 20-foot-tall puppet (although puppet doesn’t quite describe it) might well leave you agape, at least for 15 of the 130 minutes you’ll spend at the Broadway Theatre. The rest of the affair could have you pining for Spider-Man: Turn off the Dark, where they at least kept the evening suspenseful by offering the constant threat of calamity.\n\nLet us agree that, yes, this gigantuous puppet is impressively designed and altogether versatile, as operated by ten (?) visible on-stage bodies wearing what look like black monk’s cassocks with hoods. (There are also who-knows-how-many offstage flymen, computer operators, et al.) He—or, rather, it—is nimble, at least for a one-ton piece of machinery; and the technicians have given Kong a rather expressive and melancholy mien. But this is a Broadway musical, and the stuffed gorilla—which, once it finally appears late in the first act, has far more stage time than most of the Equity members on hand—does not sing or talk. Or dance, even.\n\nKong spends much of his time being sung at, by the damsel Ann Darrow (Christiani Pitts). The story—devised by director Merian C. Cooper for his 1933 movie, although it has been recycled again and again—at root is the “Beauty and the Beast” tale, except in this case the beast is not a bewitched human yearning to return to princely form, but merely, and literally, a hairy ape. When Ann sings, Kong doesn’t gaze in her eyes and emote, no; but at least the creature seems to pay attention, which is not by that point in the evening the case with some viewers out front. And the animatronic ape seems not much bothered by the quality of the music and lyrics.\n\nAs for the rest of the characters, the salient point is: There aren’t many. The plot tells of ambitious filmmaker Carl Denham (Eric William Morris) and his young discovery Ann, whom he takes to far-off Skull Island on a desperate mission to make a stupendous adventure movie in the wilds. This director journeys across the world, through dangerous waters, with a big film crew and only one actor. Who is the leading lady supposed to act with?\n\nThe underpopulated dramatis personae turns out to be Kong’s Achilles paw. The creators have seen fit to whittle down the original film’s cast of presumably hundreds to three principals. That’s right, three not including the puppet; everyone else, even the threatening ship captain, is drafted out of the chorus. Denham, in this telling, is something of an evil genius; he can and does sing about his ambition, many times, but that’s about all he has to offer (which leaves us with an undistinguished performance). That puts undue pressure on Ann, who stands around singing most of the evening, much of the time to the ape. She does have some scenes with a comedic character called Lumpy—that’s subtle, isn’t it?—who in the person of Erik Lochtefeld provides limited but welcome comic relief and good cheer.\n\nPitts sings well, or at least well enough; but she is more or less stranded in the spotlight for way too much of the running time. That’s not the fault of the performer, but still. The original film made a star-for-life out of Fay Wray, who proved an iconic beauty to the beast. Don’t expect the musical to make a star out of Pitts (recently seen in A Bronx Tale), although her conscientious efforts here will likely lead to future opportunities.\n\nOtherwise, we just have the chorus. Let it be said that the men do an awful lot of dancing; director-choreographer Drew McOnie has them leaping and spinning like the cast of Newsies after they’ve watched Fosse’s All That Jazz a few times too many. King Kong—at least in the Broadway sequences at the beginning of act one and throughout act two—is also oddly reminiscent 42nd Street in the dark, only with grit and muscles. The ensemble is heavily slanted towards grunting men who do, indeed, go through their paces with abandon. There is a noticeably slender female contingent, with one dancer standing out among the entire cast, perhaps because costume designer Roger Kirk wraps her in a mustard colored gown. She also does well in a brief stint as a comedic showgirl, at least if that’s the same unidentified dancer.\n\nWe apologize if we’ve slighted the contributions of songwriters Marius de Vries and Eddie Perfect, and bookwriter Jack Thorne (who did an infinitely keener job was his stage adaptation of the Harry Potter novels). But then, their collective contributions slight the show to the vanishing point. One might think that the producers of a troubled musical which goes through something like three directors, four songwriters, and three librettists would have kept working until they got it right.\n\nFollowing the lackluster Australian debut of the show in 2013 (directed by Daniel Kramer, with book and lyrics by Broadway veteran Craig Lucas), the producers saw the benefit of overhauling everything but the monkey at the hands of Tony-winner Jason Robert Brown (music and lyrics) and Tony/Pulitzer-winner Marsha Norman (book). Smart move, until they terminated them. Unsmart move. What do we end up with? A show without coherent words or music. I don’t imagine we’ll ever hear Brown’s songs for King Kong, but I’d have to guess that they are a tad more interesting than what’s at the Broadway.\n\nThe Fosse-obsessed choreographer-director of record is Drew McOnie, whose most prominent credit seems to be the poorly received London stage version of Strictly Ballroom. This opened in April and has already danced its last dance. Perhaps not incidentally, the lead producers of Strictly Ballroom are top-billed producers of King Kong. The sets are many but not exactly specific—the final scene takes place on the oddest-looking replica of the Empire State Building you’ve never seen—and the costumes are many. The finest contributions of the evening come from lighting designer Peter Mumford, “creature designer” Sonny Tilders, and Gavin Robins, who is credited as “Kong/Aerial Movement Director.”\n\nThe animated theatrics on view will likely attract a significant stream of curious theatergoers, as was the case with the aforementioned Spider-Man. But one doubts that the 36 producers with names above the King Kong title aspire to equal the success of Spider-Man.\n\nKing Kong opened November 8, 2018, at the Broadway Theatre. Tickets and information: kingkongbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-roundup"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "King Kong-the animated star of the new Broadway extravaganza, and when I say animated I don't mean \"full of life\"-is awesome. The sheer size and range of movement of this 20-foot-tall puppet (although puppet doesn't quite describe it) might well leave you agape, at least for 15 of the 130 minutes you'll spend at the Broadway Theatre. The rest of the affair could have you pining for Spider-Man: Turn off the Dark, where they at least kept the evening suspenseful by offering the constant threat of ",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Did-Critics-Go-Bananas-For-KING-KONG-On-Broadway-20181108"
}
