{
  "showId": "king-kong-2018",
  "outletId": "the-new-zealand-herald",
  "outlet": "The New Zealand Herald",
  "criticName": "Unknown",
  "url": "http://www.nzherald.co.nz/entertainment/news/article.cfm?c_id=1501119&objectid=10890915",
  "playbillVerdictUrl": "http://www.nzherald.co.nz/entertainment/news/article.cfm?c_id=1501119&objectid=10890915",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The face of the King Kong puppet is prepared for the Melbourne production of the King Kong musical. Is this for real? Surely the creators of King Kong could not have made the beast look so life-like, so charged with emotion? That is the true triumph of this world-first stage production of the 1933 film, the classic story of beauty and the beast. The show is high voltage stuff; a heady mix of dance, acrobatics and vocals. But the most gripping part of the performance is the emotion conveyed by the giant gorilla, through the intricate movement of his eyes, his facial contortions and interplay with heroine Ann. The first time the audience sees Kong is a wow moment. The silverback is a six-metre high marionette, with animatronic facial muscles controlled remotely by puppeteers off-stage and directly manipulated by a team of on-stage black-clad acrobatic puppeteers. Your eyes are drawn to the on-stage puppeteers at first, but as the story unfolds they fade into the background. The talk show, which debuted in 2019, will wrap after seven successful seasons.",
  "isFullReview": false,
  "textWordCount": 179,
  "archivePath": "data/archives/reviews/king-kong-2018/the-new-zealand-herald--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:47:31.926Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 179 (min: 300)"
  ],
  "contentTier": "needs-rescrape",
  "wordCount": 179,
  "tierReason": "Short text (179 words)",
  "rejectedAt": "2026-02-05T02:32:53.226Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The text appears to be a corrupted mix of content - starts as a review of King Kong musical but ends with an unrelated sentence about a talk show wrapping after seven seasons, indicating this is garbled or incorrectly scraped content.; openai: The review discusses the Melbourne production of the King Kong musical, not the current Broadway run.; gemini: This review discusses the Melbourne production of King Kong, not the Broadway production.; kimi: The text explicitly states it is reviewing the 'Melbourne production' of King Kong, not the Broadway production.",
  "promptVersion": "5.2.0"
}
