{
  "showId": "the-testament-of-mary-2013",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2013/04/23/theater/reviews/the-testament-of-mary-at-the-walter-kerr-theater.html",
  "publishDate": "April 22, 2013",
  "fullText": "All print options include free, unlimited access to NYTimes.com, NYTimes apps and NYT Now.\n\nGet unlimited access to NYTimes.com, NYTimes apps,plus free NYT Now.\n\nA selection of top stories,handpicked by editors. Available on NYTimes.com and a new iPhone® app.\n\nThe Testament of Mary Fiona Shaw in this play at the Walter Kerr Theater.\n\nJust let the woman speak, for pity’s sake.\n\nColm Toibin describes how he tried to recognize the humanity as well as the exalted status of Jesus’ mother in his play “The Testament of Mary.\n\nFollow @NYTimestheater for theater news and reviews from Broadway and beyond.\n\nFiona Shaw stars in the solo play “The Testament of Mary,” an adaptation of the Colm Toibin book in which Jesus’ mother is stripped to her essence.\n\nA great actress and a fine, trenchant script are struggling to assert themselves at the Walter Kerr Theater, where Colm Toibin’s “Testament of Mary” opened on Monday night. The ads for this production, directed by Deborah Warner, feature the play’s sole performer, Fiona Shaw, wearing what appears to be a crown of thorns, but as a muzzle.\n\nThe Mary whose testament we have gathered to hear is the mother of Jesus. And she wants to be allowed, for once, to tell her story on her terms, and to appear to us unencumbered by the signs and symbols that history and devotion have layered upon her.\n\nSo there’ll be no seraphim fluttering about the head of this Mary. The only winged creature we see her with is a live vulture, which appears in a prologue to the show. This is to be Mary stripped bare, the better for us to grasp the suffering reality of a woman doomed to live with the memories of a son taken from her first by fame and then by a terrible public death.\n\nThat it doesn’t quite work out that way ranks as one of the greater disappointments in a season that has made a practice of dashing hopes. Having read and admired Mr. Toibin’s book of the same title, an expansion of the script for this play, and knowing how transfixing Ms. Shaw can be, I was all set for an evening of searing, austere eloquence. It was just what I needed as a tonic after the gooier excesses of Broadway.\n\nI was startled, then, when I first saw the stage of the Walter Kerr, which was occupied by the designer Tom Pye’s elaborate installation. That’s where the vulture I mentioned earlier perches, spreading its baleful wings. That is also where we first see Ms. Shaw, garbed like a Raphaelite Madonna and seated in a large, transparent cube, a sea of votive candles at her feet.\n\nThe audience is invited onstage to take a closer look, and to note the surrounding clutter of things new (a tape recorder, a roll of toilet paper) and old (amphoras, an open trap door that looks onto what appears to be an archaeological dig).\n\nI joined the throng, trying not to stare at Ms. Shaw, whose mouth was shaping unheard words, and stooping to examine scrawled-upon paper, hand-rolled cigarettes and, at a distance, that intimidating vulture. Though I didn’t snap pictures of Ms. Shaw with my cellphone, as many fellow audience members did, I felt creepy and a little guilty.\n\nThis is probably as I was meant to feel, like a gawker at a sideshow. It’s a crafty coup de théâtre, this fourth-wall-breaking prologue. It suggests how people have been conditioned to see those of whom we make saints, through a glass darkly. The implicit promise here is that the glass will be broken.\n\nSure enough, shortly after the last of the pilgrims have returned to their seats, much of that set is dismantled. Ms. Shaw sheds her biblical raiment and steps before us in mufti, her face scrubbed raw, in a long black dress over work pants. Before the show ends, she will have taken off every last stitch of those as well. Stripped bare, indeed.\n\nLong before that moment of confrontational nudity, you will have probably surmised that Ms. Warner is going to err on the side of literal-mindedness. She has divested the stage of one landscape of smothering iconography only to substitute another. As Mary describes the events leading up to her son’s death, she employs all sorts of heavy visual aids.\n\nSpeaking of the death and resurrection of Lazarus, she covers her face with a shroudlike cloth. When she talks about the transformation of water into wine, she hefts a large clay vessel onto a table. By the time we get to Calvary, you have a good idea of how she is going to use that long wooden ladder and those coils of barbed wire.\n\nIt is as if Ms. Warner — who collaborated with Ms. Shaw on productions of Euripides’ “Medea” and Beckett’s “Happy Days” — didn’t trust sufficiently in the power of her star and script to captivate a big Broadway audience.\n\nMs. Warner, of all people, should know better. The first time I ever saw Ms. Shaw was in a one-woman production of T. S. Eliot’s “Waste Land,” staged by Ms. Warner in 1996 in a derelict 42nd Street theater, and I felt I was watching a cast of hundreds. And there are moments in “Testament” that demonstrate that Ms. Shaw’s abilities to command as an actress have only grown.\n\nBillions of dollars have poured into the continent to fight killer diseases. But the most basic killer, injury, is neglected.\n\nIn Room for Debate: Even for students who can afford a semester overseas, there may be better uses for that time and money.",
  "isFullReview": true,
  "dtliExcerpt": "Ms. Shaw doesn't just inhabit this role; she becomes a force of nature within it, channeling a mother's anger and bewilderment with an intensity that makes the theater feel too small to contain her.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Long before that moment of confrontational nudity, you will have probably surmised that Ms. Warner is going to err on the side of literal-mindedness...There are moments in 'Testament' that demonstrate that Ms. Shaw's abilities to command as an actress have only grown...This Mary is an ordinary woman of her day, forced against her will into a role in history she never sought or wanted. Ms. Shaw gives us that woman, for sure... But if you're going to give us a vision of Mary as we've never seen her, why would you block the view?...I was never happier - or more harrowed - than in those rare quiet, contained moments when this Mary made us feel that we were in a private tête-à-tête with a woman who had an extraordinary story to tell, and needed to keep telling it, forever and ever.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-TESTAMENT-OF-MARY-Opens-on-Broadway-Updating-LIVE-20130422",
  "showScoreExcerpt": "Ms. Shaw doesn't just inhabit this role; she becomes a force of nature within it, channeling a mother's anger and bewilderment with an intensity that makes the theater feel too small to contain her.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Short text (34 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://theater.nytimes.com/2013/04/23/theater/reviews/the-testament-of-mary-at-the-walter-kerr-theater.html?pagewanted=all&_r=0",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "previousUrl": "https://www.nytimes.com/2013/04/23/theater/reviews/the-testament-of-mary-starring-fiona-shaw.html",
  "urlDiscoveredAt": "2026-02-04T18:20:16.685Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 937,
  "archivePath": "data/archives/reviews/the-testament-of-mary-2013/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:20:36.500Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140513215235",
  "archiveOrgUrl": "http://web.archive.org/web/20140513215235/http://www.nytimes.com:80/2013/04/23/theater/reviews/the-testament-of-mary-at-the-walter-kerr-theater.html?",
  "wordCount": 937,
  "tierReason": "Full review text",
  "bwwScore": 7,
  "rejectedAt": "2026-02-06T16:37:31.416Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This text appears to be a garbled mix of website navigation elements, subscription prompts, and fragments of multiple articles rather than a coherent review; openai: The text is primarily navigation menus and unrelated content, not a coherent review.",
  "promptVersion": "5.2.0"
}
