{
  "showId": "the-testament-of-mary-2013",
  "outletId": "timeout",
  "outlet": "Time Out New York",
  "criticName": "David Cote",
  "url": "https://www.timeout.com/newyork/theater/the-testament-of-mary",
  "publishDate": "April 22, 2013",
  "fullText": "Theater review by David Cote. Walter Kerr Theatre (see Broadway). By Colm Tóibín. Dir. Deborah Warner. With Fiona Shaw. 1hr 30mins. No intermission.\n\nLast time she was on Broadway, Fiona Shaw made a bloody sacrifice of her children in Medea. Now the grand, incisive performer is back as a different sort of mother with a different sort of sacrifice. She’s the Virgin Mary, railing against the mythologizing of her dead son, Jesus. Not that Mary identifies him explicitly. “Something will break in me if I say his name,” she tells us. The Testament of Mary is the biblical icon’s remembrance of her son’s apostles (“misfits,” she calls them), his miraculous acts and his brutal execution. The setting is many years after the Crucifixion, as Christ’s early converts busily compile the Gospels that will spread a new religion. But Mary doesn’t care about dogma or Immaculate Conception; she just wants her child back.\n\nFar from a sentimental treatment of the mother-son bond barely explored in the Bible—but exhaustively cataloged in European art for centuries—Testament is a brief but rigorous application of humanist skepticism to the notion of Christ’s divinity. In this monologue, author Colm Tóibín doesn’t set out to prove or disprove whether Mary gave birth to the Son of God, but he gently allows room for both wonder and doubt. Yes, Mary recounts, in a harrowing passage, the raising of Lazarus—but she wasn’t there. When she does meet him, she says Lazarus is more zombie than man. Likewise, the text emphasizes Jesus’ pain and fear of death. Scour Scripture and the apocrypha; you won’t find any description of a frantic Christ trying to stop the Romans from nailing the second hand.\n\nShaw’s performance is keen and staggering in its total effect, and slightly self-indulgent in its particulars (I felt a similar dichotomy a decade ago with her Medea). She has a tendency, especially early in the show, to show you how. bloody. hard. she’s acting! And director Deborah Warner allows too much neurotic prop-moving business and italicized bits of mugging. (It’s probably intentional, as the character is still processing the trauma and avoiding the admission of her fundamental lack of faith.) Still, this is a potent piece of writing, and Shaw winds up to a shattering finale. “Who is my mother?” Christ asks, philosophically yet woundingly, in the Book of Mark. Foolish boy; the answer is right here.—David Cote",
  "isFullReview": true,
  "dtliExcerpt": "Colm Tóibín's spare, poetic monologue gets a respectful but static staging that doesn't fully capitalize on Fiona Shaw's formidable talents.",
  "originalScore": 60,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Colm Tóibín's spare, poetic monologue gets a respectful but static staging that doesn't fully capitalize on Fiona Shaw's formidable talents.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (20 words)",
  "textQuality": "truncated",
  "playbillVerdictUrl": "http://www.timeout.com/newyork/theater/the-testament-of-mary",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "textWordCount": 399,
  "archivePath": "data/archives/reviews/the-testament-of-mary-2013/timeout--david-cote_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:48:02.507Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20150907121017",
  "archiveOrgUrl": "http://web.archive.org/web/20150907121017/http://www.timeout.com/newyork/theater/the-testament-of-mary",
  "wordCount": 399,
  "tierReason": "Missing proper ending or other signals"
}