{
  "showId": "the-testament-of-mary-2013",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2013/legit/reviews/the-testament-of-mary-1200407773/",
  "publishDate": "April 22, 2013",
  "fullText": "Fiona Shaw makes an icon human in a powerhouse Broadway performance\n\nWhere to begin? Well, there’s a live vulture on stage, and an uprooted tree suspended in mid-air, and a pool of water that appears to be bottomless. And that’s before the house lights even go down on “The Testament of Mary.” The matchless Fiona Shaw commands the stage in this solo piece adapted by Irish scribe Colm Toibin from the 2012 novella he fashioned as an interior monologue delivered by Mary, the mother of the historical Christ and, in Christian legend, the Mother of God and the Queen of Heaven. It’s safe to say you’ve never seen anything like it.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n\n VIP+\n \n\n \n \n\n \n \n \n \n What an AI War on Copyright Law Could Mean for Content Creators \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Kelly Marie Tran on How 'Wedding Banquet' Empowered Her to Come Out as Queer and Why 'Star Wars' Racism Is a 'Microcosm for the Social Climate'\n\nHelmer Deborah Warner, a first-hand creative collaborator on this hugely imaginative work, succinctly conveys the point of it in a single powerful image. Before the play begins, she has positioned Shaw inside a Plexiglas cube, sitting in a classic pose of the Blessed Virgin familiar from countless religious paintings and church statuary. Clad in Mary’s traditional blue cloak, she holds a single stalk of lilies to signify her purity and is encircled by lighted votive candles — a beloved but distant image of worship.\n\nMoments later, when Shaw appears in character — a tall, lean figure with burning eyes — Mary has been stripped off all those iconic symbols. The celestial blue cape is gone, as are the candles, the lilies and all trappings of religious veneration. As the mother of a son whose name she can’t bring herself to speak aloud, this Mary is no saint but a grieving mother who has clung to her sorrow for years, for decades, possibly for generations, down to the present day.\n\nThe premise of the play is that Mary is the silent woman of the New Testament. Generations of religious art may have led us to think we know her, but she actually has very little to say for herself in the Gospels. Not until now, when she has finally been cornered by John the apostle, who wants her testimony for his Gospel.\n\nToibin, a literary heavyweight admired for his emotional depth and spare, elegant style, has said that he wrote this piece to give voice to “a woman’s anger, her power, her politics, her wit.” His intention was to restore to solid flesh and blood “a woman who was human and mortal” before she became a religious icon.\n\nWarner honors the scribe’s intention with what appears to be her single piece of direction: play it human. That’s exactly what Shaw’s soul-baring perf delivers — a mother whose grief at the loss of her child is singularly human, but also so timeless and universal, it seems to contain the rage, the fury and the suffering of every mother who ever lost a child.\n\nThe tremendous tension within the monologue is Mary’s terrible conflict about returning to the past and re-living the excruciating pain of her memories. Shaw first attacks the conflict on a physical level, prowling her modest house and slamming around the household props as if she were confined to a cage from which there’s no escape. Although it’s not always clear how some of these items relate to the subject at hand, it’s thrilling to watch Shaw throwing things around.\n\n“I remember everything,” she says ominously, in a tone of such misery that Shaw seems to be holding onto her sanity by a thread. Remembering is one thing, but opening herself up to those memories is a treacherous business. And once Mary brings herself to speak the word “crucified” — Shaw’s face a landscape of pain and grief — the images come flooding out.\n\nMary is such an original character and Shaw such a master at the art of creative shock, that in the process of delivering her testimony, one traditional legend after another is smashed to bits.\n\nThose blessed Apostles? “A band of misfits,” in Mary’s furious condemnation of these hot-headed young “fools and malcontents,” so carried away by the high drama of proclaiming their leader the “King of the Jews” and “Son of God” that they deliver her son to his executioners.\n\nThe great miracles of her son’s career? “I want no more miracles,” she says, questioning the unnatural act of raising Lazarus from the dead and mocking the wedding in Cana for its excessive consumption.\n\nBut Mary directs the full force of her fury toward the crucifixion itself. No, her son didn’t bear his excruciating ordeal in silence. He screamed and howled and moaned like a tortured animal. And as for that myth that he rose from the dead after three days — well, let’s not examine that one too closely.\n\nAs hard as Mary is on the players in this cruel drama, she’s even more unforgiving of her own role in it. Which is why the most searing images in this monologue are the ones that she alone can see.\n\n(Walter Kerr Theater; 974 seats; $135 top)\n\nA presentation by Scott Rudin, Stuart Thompson, Jon B. Platt, Roger Berlind, Broadway Across America, Scott M. Delman, Jean Doumanian, Roy Furman, Stephanie P. McClelland, Sonia Friedman Productions / Tulchin Bartner Productions, The Araca Group, Heni Koenigsberg, Daryl Roth, and Eli Bush of a play in one act by Colm Toibin, based on his own novel of the same title. Directed by Deborah Warner.\n\nSet, Tom Pye; costumes, Ann Roth; lighting, Jennifer Tipton; original music & sound, Mel Mercier; production stage manager, Michael J. Passaro. Opened April 22, 2013. Reviewed April 20. Running time: ONE HOUR, 25 MIN.",
  "isFullReview": true,
  "dtliExcerpt": "Fiona Shaw's performance as Mary is magnificent, a tour de force of theatrical power that transforms Colm Toibin's spare prose into a living, breathing portrait of grief.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Fiona Shaw's performance as Mary is magnificent, a tour de force of theatrical power that transforms Colm Toibin's spare prose into a living, breathing portrait of grief.",
  "contentTier": "complete",
  "contentTierReason": "Short text (27 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://variety.com/2013/legit/reviews/the-testament-of-mary-1200407773/",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "textWordCount": 961,
  "archivePath": "data/archives/reviews/the-testament-of-mary-2013/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T18:20:23.248Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "wrongFullText": "Local version of mag suffers slings, arrows of culture war\n\nFilm producer Erwin Arnanda, prexy of Indonesia’s Rex Cinema, pulled off one of the biggest publicity coups of his career with the launch of a local version of Playboy earlier this month.\n\nTrouble is, the mag’s debut ran smack into the middle of Indonesia’s growing culture wars.\n\nIndonesia is officially a secular state, but has the world’s largest Muslim population. New laws on pornography and obscenity are making their way through parliament, and more moderate segments of society fear the laws presage an Islamic cultural clampdown.\n\nWhen the Indonesian Playboy debuted — by subscription only — hundreds of rioters organized by the Islamic Defenders Front (FPI) forced their way into Arnanda’s offices in Jakarta, broke windows and overturned furniture.\n\nSince then, the media has been awash in pro- and anti- commentaries on the subject, and the mag has sold out — although secondhand copies have turned up on newsstands. Arnada says he’s postponed a second edition, citing security concerns.\n\nThe content alone cannot have sparked such a flare-up: The magazine bares less flesh than the local versions of FHM or Maxim and is less racy than many women’s magazines. But Islamic politicians and preachers say the name of the magazine alone is grounds to ban it.\n\nIndonesia’s creative community is fighting back, though. Thousands of actors, filmmakers and other creative types turned out at an April 22 rally against the laws .\n\n“We were very happy to have drawn the support of so many sections of society, artists and regular people,” says Jakarta Film Fest chair Shanty Harmayn. Avoiding provocation, she marched in a combo of jeans and traditional garb.",
  "_showNotMentionedDiscoveryAttempted": true,
  "archiveOrgTimestamp": "20250426204542",
  "archiveOrgUrl": "http://web.archive.org/web/20250426204542/https://variety.com/2013/legit/reviews/the-testament-of-mary-1200407773/",
  "wordCount": 961,
  "tierReason": "Full review text",
  "previousUrl": "https://variety.com/2013/legit/reviews/the-testament-of-mary-1200334859/",
  "urlDiscoveredAt": "2026-02-04T18:20:23.254Z",
  "urlDiscoveryMethod": "show-not-mentioned-recovery"
}
