{
  "showId": "holler-if-ya-hear-me-2014",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "https://ew.com/article/2014/06/20/holler-if-ya-hear-me-ew-review/?srsltid=AfmBOoo_keVwp71zulz5PlPEaJxorPBdKJgbSb4Lne_kK15GlBkIl9Hb",
  "playbillVerdictUrl": "http://www.ew.com/ew/article/0,,20826965,00.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "previousUrl": "http://www.ew.com/ew/article/0,,20826965,00.html",
  "urlDiscoveredAt": "2026-02-04T03:34:09.764Z",
  "urlDiscoveryMethod": "google-serp",
  "fullText": "Tupac Shakur’s best songs have a narrative built into them, so the idea of creating a jukebox musical — or at least an iTunes musical — out of the late hip-hop legend’s catalog must have seemed natural. And there are moments in Holler If Ya Hear Me that connect theatrically, such as the energetic song-and-shimmy routine around a purple Cadillac to ”California Love” and the male chorus’ tag-teaming on the raps in ”If I Die 2Nite.” But Shakur’s bulletins from the periphery of the 1980s and ’90s urban jungle were mostly self-contained, too slender to support or advance a larger, more ambitious story. Holler‘s script, by Todd Kreidler, is a confusing muddle involving mostly interchangeable young black men in an unnamed Midwestern city who plot revenge on a neighboring gang that has slain the upright brother of one of their own. Oddly, that killing — which triggers the to-rumble-or-not-to-rumble plot — happens off stage. Also left off stage: all members of that rival gang, the racist cops who are frequently rapped about, and pretty much any character development. There’s a perfunctory love triangle featuring the comics-drawing ex-con John (Saul Williams) and his drug-dealer pal Vertus (the soulful Christopher Jackson). But sultry-voiced Saycon Sengbloh, as the woman who flits between them, appears to exist solely to justify including the hit ”Unconditional Love.” (Don’t get me started on the underuse of the divine Tonya Pinkins as Vertus’ dear mama.) Tony-winning director Kenny Leon is a newbie to Broadway musicals, and it shows in his awkward staging. Wayne Cilento’s choreography, which could help bridge the story’s gaps, often seems like an afterthought. The whole thing makes you want to holler. C+",
  "isFullReview": true,
  "textWordCount": 278,
  "archivePath": "data/archives/reviews/holler-if-ya-hear-me-2014/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:34:09.768Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 278 (min: 300)"
  ],
  "contentTier": "truncated",
  "wordCount": 278,
  "tierReason": "Short text (278 words)"
}