{
  "showId": "holler-if-ya-hear-me-2014",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Unknown",
  "url": "http://www.thewrap.com/tupac-shakur-holler-if-ya-hear-me-theater-review/",
  "playbillVerdictUrl": "http://www.thewrap.com/tupac-shakur-holler-if-ya-hear-me-theater-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "Frankly, I wouldn’t trust any veteran Broadway critic when it comes to a new musical that features the songs of Tupac Shakur. In this case, that musical is “Holler If Ya Hear Me,” which opened Thursday at the Palace Theater.\n\nAt the critics’ preview I attended, the show’s heartiest response came from the balcony and not those people seated in the orchestra of the Palace Theatre, which earlier this year housed a revival of “Annie” and before that, “Priscilla Queen of the Desert.”",
  "isFullReview": false,
  "textWordCount": 83,
  "archivePath": "data/archives/reviews/holler-if-ya-hear-me-2014/thewrap--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:35:28.766Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "excerpt",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Word count too low: 89 (min: 300)"
  ],
  "contentTier": "truncated",
  "wordCount": 83,
  "tierReason": "Short text (83 words)",
  "bwwExcerpt": "As with the nearby 'Rocky,' the best thing about 'Holler' is the new seating configuration, which is startlingly effective in giving us a predatory hawk's eye view of the bleak street scene below. Otherwise, this show keeps falling prey to almost every cliché that has made the jukebox musical such a maligned genre in the theater. It's not just that Todd Kreidler's book can't match the power of Shakur's stark and bracing poetry. Kreidler keeps subverting those lyrics with a storyline that makes a contradictory mess of its principal characters. 'Holler' is not a travesty like the super-successful 'Mamma Mia!,' where only the first line of every Abba song refers to the action at hand and the rest of the lyrics go on their merry, aimless way. But all too often, Shakur's lyrics only comment on the emotional content of the characters' lives. As with most jukebox musicals, the lyrics rarely further the action. Which leaves Kreidler's book with way too much explaining to do.",
  "bwwScore": 6
}
