{
  "showId": "the-last-five-years-2025",
  "outletId": "nydailynews",
  "outlet": "Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/2025/04/06/broadway-review-last-five-years-with-nick-jonas-has-beautiful-score-disconnected-characters/",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "At its core, Jason Robert Brown’s two-character musical “The Last Five Years” is about the difficulty of maintaining a relationship while working in high-pressure creative fields. Its score, provocative and beautiful, is filled with songs about loneliness, insecurity and isolation and about how hard it can be to sustain the power balance within a marriage when one partner’s career is on the rise and the other’s is stuck perpetually in the weeds.\nIt’s also a show about early-career artists, those years when big breaks have to be grabbed by the horns but also when the agonizing realization first dawns that they might never happen (one chills out either way, as one ages). And that’s the first disconnect with the disappointing new Broadway production at the Hudson Theatre, featuring the truly bizarre casting of Nick Jonas, the pop star of Jonas Brothers heritage and fame, playing the rising novelist Jamie, and Adrienne Warren, best known for playing the title role in “Tina: The Tina Turner Musical,” a character that is about as far away from the struggling summer-stock actress Cathy as Jupiter is from Mars.\nThat’s always a risk with this 90-minute show, which I first saw in its lovely premiere at the Northlight Theatre in Chicago in 2001, where it starred Lauren Kennedy and Norbert Leo Butz, working with director Daisy Prince. That’s because Brown structured the show so that the five-year relationship between Jamie and Cathy unspools in opposite directions.\nJamie’s story is told in chronological order. But Cathy’s story is recounted in reverse, akin to “Merrily We Roll Along.” In the first scene, her song mourns the end of her marriage.\nAdrienne Warren and Nick Jonas in 'The Last Five Years' on Broadway.",
  "bwwScore": 5,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LAST-FIVE-YEARS-Starring-Nick-Jonas-and-Adrienne-Warren-20250406"
}
