{
  "showId": "the-last-five-years-2025",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Johnny Oleksinski",
  "url": "https://nypost.com/2025/04/06/entertainment/the-last-five-years-review-nick-jonas-musical-is-the-worst-of-the-broadway-season/",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Audiences always deserve clarity, but “The Last Five Years” must be especially well-defined in its staging and performances, since the weird structure is jarring to the uninitiated. You see, Jamie tells the couple’s tale in sequential order, from meeting gentile Cathy, his “Shiksa Goddess” who’s a struggling actress, to their breakup. Cathy’s songs, meanwhile, occur in reverse. She begins “hurting” from the split and ventures backwards to the elation of their first date — a la “Merrily We Roll Along.” Well, best of luck figuring any of that out. The first Broadway bow of Brown’s semi-autobiographical musical is almost impossible to follow, and the viewer gives up on it quickly.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LAST-FIVE-YEARS-Starring-Nick-Jonas-and-Adrienne-Warren-20250406",
  "showScoreExcerpt": "\"Despite a short 90-minute runtime, “The Last Five Years” is never “moving too fast.” You’re five years older by curtain call. Now, add in woefully miscast leads in Nick Jonas and Adrienne Warren and barely-there direction by Whitney White and what you get is the dirge that opened Sunday night at the Hudson Theatre — one of the worst musical productions of the season. It’s appallingly bad.\"\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "playbillVerdictUrl": "http://nypost.com/2015/02/11/anna-kendrick-sings-it-out-of-the-park-in-the-last-five-years/",
  "sources": [
    "show-score-playwright",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwScore": 2
}
