{
  "showId": "the-last-five-years-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2025/04/06/the-last-five-years-stuck-on-the-seesaw/",
  "publishDate": "2025-04-06T22:59:08",
  "fullText": "A two-person show is something like a seesaw. One character, as created by the author, might well be stronger, friendlier, funnier (etc.) than the other, just as one person on a seesaw is likely weightier. In which case, those two-on-the-seesaw must adjust their positions to maintain a modicum of balance; otherwise, one of the pair will be forever up in the air, the other weighted to the ground.\n\nWelcome to the Broadway premiere of Jason Robert Brown’s The Last Five Years, which as written is an enchantingly clever and vibrantly tuneful chamber musical. Although a perhaps sizable section of first-time viewers at the Hudson are likely to sit there wondering “what’s that?” Due to a combination of casting, direction, stage presence and downright talent, Adrienne Warren alone spends the evening airborne, on the upper end of the seesaw and sometimes soaring high above. Nick Jonas remains cemented to the stage floor, mostly, depleting The Last Five Years of its buoyancy.\n\nBrown, who had already established himself on Broadway with the 1998 musical Parade, devised The Last Five Years to illustrate the ins and outs of his disintegrated marriage. (Those so interested can easily uncover the backstory, in which Brown’s ex-wife waged a highly public battle with the aim of preventing The Last Five Years from ever being seen, sung, or heard.)\n\nOf course, a two-character opus which follows that traditional boy meets girl/boy gets girl/boy loses girl scheme is likely to fall flat on its formulaic face. Brown came up with an ingenious solution to the mundane: Start one character (Jamie) at the beginning of the affair and the other (Cathy) at the final breakup. Proceed in opposite directions till the midpoint, which is to say their wedding. Then watch Jamie’s side of the equation disintegrate while Cathy, at the final curtain, is only just beginning to fall in love five years earlier. Match that musically, and the potential is boundless.\n\nA key component in the piece as written is Brown’s notion (and his stage direction in the script) that the two actors do not stand together and look directly at each other until the midway point of the midway song in the show, at the wedding altar during “The Next Ten Minutes.” You might note that Brown here interrupts his rueful examination of a romance gone bad (over the last five years) with a fleetingly brief ten minutes of happiness. Other than at this midway point when the time spans converge, the pair cannot truly interact, even though they are occasionally on stage simultaneously. How can they, if their stories are taking place in different days and months and years? Break that illusion, as they do at the Hudson, and Brown’s intriguingly plotted puzzle disintegrates. You’re left wondering where are they now, what are they talking/singing about, and—to borrow that old Abbott & Costello catchphrase—who’s on first?\n\nBrown’s varied and vibrant songs, sprinkled with surprise twists and briskly colloquial (and funny) lyrics, add up to a delicious 90 minutes. At least, they have in the two prior New York productions, both off-Broadway, with then-newcomers Norbert Leo Butz and Sherie Rene Scott (in 2002) and Adam Kantor and Betsy Wolfe (2013). Stray too far from the structural framework, and the whole thing unravels like that dress devised by Schmuel-the-tailor-of-Klimovich (to borrow an image from one of Brown’s songs).\n\nDirector Whitney White—who has done notable work of late in both Jaja’s African Hair Braiding and Liberation—sees fit to disrupt Brown’s cannily crafted plan. (Brown seems to have permitted this, as he has been on hand contributing modernized alterations to some lyrics.) With the two characters frequently interacting through the 15-song evening, a first-time viewer might not glean that while Jamie ends the evening five years older and five years sadder, Cathy is just embarking on what will hopefully be—as Jamie earlier puts it—the next 10 minutes, and then another 10 minutes, and then the next 10 lifetimes. An enigmatic song list, hastily inserted into the Playbill during the final previews, doesn’t help.\n\nNeither does the physical production. David Zinn and Dede Ayite—highly creative designers both—here seem restrained. Zinn usually gives us simple looking sets with something stunning hidden away, but here there’s nothing to hide. There is a nice set change following the wedding night, but it draws attention to the fact that the lovely Central Park rowboat scene from the original has been displaced. As for Ayite, she gets but one opportunity here to dazzle us. She does so, with a remarkably stylish wedding gown.\n\nBut the altered concept is only half the problem. Warren is one of those performers who has repeatedly demonstrated—in such musicals as Shuffle Along and Tina—that she can instantly light up the stage with an incandescent smile or shake the rafters in song, or both. She does so here, notably in the rambunctious “A Summer in Ohio” and the searing “I Can Do Better than That.”\n\nJonas, though, seems to be the wrong actor in the wrong show. A recording star since his teens, he has visited Broadway in the past: as a child replacement in both Beauty and the Beast and Les Misérables, plus a stint stepping into Daniel Radcliffe’s shoes in the 2011 How to Succeed. Experience or no, Jonas seems highly uncomfortable playing Jamie. His performance is mostly satisfactory, but he often seems to be concentrating on whether he is doing his steps correctly. Even when at his surest, we get the sense that he—the actor, not the character—is working too hard. Capping the problem is that in this musical about those the birth and death of passion, the level of passion between the two actors is nil.\n\nBrown introduces Jamie, his alter-ego in this personal tale of divorce, with a rambunctiously colorful over-the-top stream-of-conscience aria. From the moment he bursts out in rapture—“Hey, hey! Shiksa goddess! I’ve been waiting for someone like you”—we can’t help but be on Jamie’s side. With the severe articulation problems at the Hudson, though—whether it be the performer, the designer or the sound balance, large swaths of lyrics are imprecise—I don’t expect many in the audience catch that catch-phrase, no matter how many times it is repeated.\n\nIf the songwriter, the character, and the performer don’t grab you at the top with “Shiksa Goddess,” The Last Five Years has a hard time getting started. As is the case at the Hudson.\n\nThe Last Five Years opened April 6, 2025 at the Hudson Theatre and runs through June 22. Tickets and information: thelastfiveyearsbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
