{
  "showId": "the-last-five-years-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2025/04/06/the-last-five-years-a-romance-told-up-and-down/",
  "publishDate": "2025-04-06T22:58:42",
  "fullText": "In a season marked by debates over whether this show or that is well suited to its assigned venue, it’s happy to report that The Last Five Years, Jason Robert Brown’s widely-performed song cycle finally making its Broadway debut after a quarter of a century, fits snugly into the intimate quarters of the Hudson. Director Whitney White and a skillful design team honor the piece’s two-planks-and-a-passion minimalist roots, while offering plenty to delight the eye and ear. Unhappy to report, Brown’s battle of the sexes is here unequally matched.\n\nAs most stage mavens know, the piece employs divergent perspectives on the ups and downs of the five-year love affair between aspiring artists. Grad student Jamie Wallenstein (Nick Jonas) finds his first novel recognized as he becomes besotted with would-be thesp and “shiksa goddess” Cathy (Adrienne Warren). His forward journey in time details the vagaries of fame that will elude, and ultimately undo, his wife-to-be.\n\nThat said, we meet her at the saga’s very end, reacting to Jamie’s we’re-through letter and thereafter going backward in time to their first date, when their shared “Goodbye” will have a vastly different meaning for each.\n\nThe structure is easier to follow than many may expect, and the spaces between the alternating he/she numbers leave room to speculate on what came between. It’s a deft piece of work, garnering some truth (according to the author) from the tale of his own divorce, but really elevated by his gifts. The score’s lushness – enhanced here by Brown’s new orchestrations and arrangements for a strings-forward ensemble of nine conducted by Tom Murray – presages the even deeper romanticism of The Bridges of Madison County to come.\n\nTo the surprise, I suppose, of few aficionados, Adrienne Warren inhabits Cathy as if it had been written for her. The depth of her Tony-winning turn in Tina: The Tina Turner Musical is echoed in her first solo, the dialed-up-to-11 mix of despair and betrayal “Still Hurting.” From there it’s talent and technique all the way, as she negotiates the travails of cattle calls and self-doubt midway through the evening, eventually to segue into the ecstatic promise of first love whose bitter end we witnessed ninety minutes before.\n\nBut it takes two to tango. Jonas Brother Nick has garnered praise for past appearances in How to Succeed… and Les Misérables. He is earnest at his craft. But it’s one thing to embody the conflict between one’s comrades and sheer passion for a Cosette, and quite another to negotiate the multiple conflicts involving ambition, appetite, duty, ethnic rebellion, and the complex Cathy. Merely donning a pair of specs is not going to persuade us that we’re in the presence of a preternaturally gifted novelist about to take the literary world by storm.\n\nJamie’s first step toward success, “Moving Too Fast,” needs more than just pep-rally enthusiasm: He must present enough charisma to dazzle his new amour, while hinting at the narcissism that will become a major factor in the breakup. Jonas nicely handles the comedy of “The Schmuel Song,” an improvised Yiddish folk tale meant to buck up Cathy’s spirits, but he can’t get a grip on the rationalization and self-loathing of “Nobody Needs to Know,” his last-straw embrace of infidelity. Having seen the show so often I can’t be sure, but I’d wager that in this production, few newcomers will be able to figure out, from Jamie’s end, why the marriage goes phffft. Nor will they be able to make out some of his lyrics, given the frequent pop-song breathiness in his lower register (something that White, or sound designer Cody Spencer, might yet work on).\n\nSet designer David Zinn offers upscale versions of the simple set pieces that are the show’s usual trademark, even as Stacey Derosier’s lighting effects and Dede Ayite’s costumes collaborate smartly to delineate the different time frames. That’s most notable in an eleventh-hour tableau, where Jamie in pure black-and-white is side-by-side with Cathy in glowing amber. (The effect may sound corny but I promise, it isn’t.)\n\nWell, The Last Five Years has suffered underwhelming Jamies and powerhouse Cathys before (and vice versa, cf. the 2014 film version with Jeremy Jordan and Anna Kendrick). Yet its depth of feeling and universality always manage somehow to click. This Broadway incarnation is well worth taking in, but its fulfillment – just like that of the connection between Cathy and Jamie itself – remains tantalizingly, yet undeniably, just out of reach.\n\nThe Last Five Years opened April 6, 2025 at the Hudson Theatre and runs through June 22. Tickets and information: thelastfiveyearsbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial"
}
