{
  "showId": "mary-poppins-2006",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "David Edelstein",
  "url": "https://www.vulture.com/2018/12/mary-poppins-returns-review.html",
  "playbillVerdictUrl": "https://www.vulture.com/2018/12/mary-poppins-returns-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Jay Maidment/Disney Enterprises, Inc\n \n \n \n Mary Poppins Returns opens gloriously, with lush orchestrations — so homogenized that they sound pre-stereo — and with bold yellow letters on the Buena Vista–azure sky that some of us recall from when Disney was merely a Magic Kingdom and not a Giant Corporate Entertainment Squid. This is the Squid in disguise, of course, carefully arrayed as its simpler former self; but I liked living in the past for a time (I saw Mary Poppins in 1964, at the ripe age of 5), and actually cried when the tatty Banks family kite drifted into the clouds and then … out from the mist, umbrella aloft, came … well, not Julie Andrews, but Emily Blunt, certainly the more versatile actress and one I couldn’t wait to watch dispensing spoonfuls of sugar. After that, I stayed with the movie a long time — longer than it deserved, really — but its spell had begun to dissipate the instant Mary’s feet touched terra firma. Mary Poppins Returns is a work of painstaking re-creation, and it’s full of nice touches. But it’s a bit of a dud.\n\nTo start, the plot is ungainly. One of Mary Poppins’s former charges, Michael Banks, is now fully grown (he’s played by Ben Whishaw), a grieving, high-strung widower with three moppets of his own. It’s neither Michael nor his warmer sister, Jane (Emily Mortimer), who summons their old nanny from the ether. Nor is it Michael’s children, Annabel (Pixie Davies), Georgie (Joel Dawson), and John (Nathanael Saleh). Ms. Poppins comes on her own authority, evidently to ensure that Michael’s children don’t grow up too fast, given that they’ve lost a mum and that their dad is in a state of nervous near collapse. With the National Health years in the future, Michael had to pay for his late wife’s care by taking out a mortgage on the family’s Cherry Tree Lane manse from his father’s old bank. It comes due that Friday at midnight exactly, and the bank — now presided over by an oily Colin Firth — proves shockingly unsentimental. So, when Big Ben strikes 12, Michael and his kids will have to move into Aunt Jane’s bachelorette pad.\n\nThe problem is that most of Mary Poppins Returns — the parts with Mary Poppins, sadly — feels like a digression from the central, stay-the-foreclosure narrative. The blame doesn’t wholly rest with the screenwriter, David Magee. You can be as digressive as you want with music and lyrics as delectable as “A Spoonful of Sugar,” “Chim Chim Cheree,” “Feed the Birds,” “Supercalifragilisticexpialidocious,” and bravura dancing numbers like “Step in Time.” But Mary Poppins has returned without the Sherman brothers (not Mary’s fault — Robert B. died in 2012, while Richard M. is listed here as a consultant); and apart from a wistful little number about “where the lost things go,” the score (by Marc Shaiman and Scott Wittman) leaves no residue. It’s not unpleasant, at least, apart from a song led by Meryl Streep as some sort of wacky sorceress whose world turns turtle once a week. The number ends with the singers collapsing and laughing on the floor — a cliché parodied by Shaiman’s collaborators way back in 1999 in South Park: Bigger, Longer & Uncut.\n\nIt pains me to say that Emily Blunt never finds her inner Mary P. I mean no disrespect: She’s a superb actress, both canny and soulful, and she all but stole her last movie musical, the Stephen Sondheim adaptation Into the Woods, from its more flamboyant performers. But for someone with her extraordinary range, the part is like a straitjacket. Ordering the children about, her Mary puts on a stern face and freezes her scowl in place, then gives a tiny smile when their backs are turned — a shtick she repeats with diminishing returns. Blunt sings well and dances efficiently (she’s best in a music-hall number in which she gets to play Cockney and show some sass), but she’s a mite robotic. She makes you appreciate how well the part fit Julie Andrews.\n\nA word about Andrews: No actress has ever done as well in a role in which she was completely miscast as Andrews in The Sound of Music. Recall that her character, Maria, has driven her sister nuns to lyrical exasperation for being “a flibbertigibbet, a will-o’-the-wisp, a clown.” One even calls her a demon. Julie Andrews, with her prim demeanor and bell-like diction, is the furthest thing on the planet from a demon clown. (Mary Martin, who originated the role on Broadway, was the impish type, having made her name as Nellie Forbush and Peter Pan.) But as Mary Poppins, Andrews found her small but very sweet spot. She could be prim without being icy, because the primness came naturally — she didn’t have to put it on. Natural, too, was her relish for the musical numbers: She sang with her heart and then snapped back into formality as the final chords died away. She merged with P.L. Travers’s Mary Poppins, a distinctly mid-20th-century British creation who felt that to keep children from growing up too quickly, she must first instill order and only then permit well-regulated fantasy. Let me say that again: well-regulated fantasy. The fun is real, but hygienic, and no one else could have made it seem so not like being in hell.\n\nUnder Rob Marshall’s direction, Mary Poppins Returns doesn’t quite know what to make of Mary’s split personality. Marshall simply sets about re-creating the style and tone of Mary Poppins. The animation sequences are pleasantly 2-D — it must have taken a good deal of high-tech ingenuity to make a movie that looks so low-tech à la 1964. There’s a tolerably well-done sequence in which the littlest Banks is kidnapped by cartoon hooligans — it suggests Pinocchio with a touch of Indiana Jones. Younger kids might respond.\n\nAudiences of all ages will respond to Dick Van Dyke, who returns to brighten things up, not as Bert the chimney sweep but an elderly banker who proves an able dancer. At 92 (he was born December 13, 1925), Van Dyke reminds you how much fun a gangly legged hoofer can be — he might have followed in the steps of Ray Bolger if dance musicals hadn’t fallen so far out of fashion in the late ’60s. In place of ol’ Bert is a new Cockney sidekick: Lin-Manuel Miranda as Jack, who lights London’s lamps every night and extinguishes them every morning while singing about life “underneath the lovely London sky” (which sickened tens of thousands of Londoners in that blighted era, but never mind). In his first major studio part, Miranda is light on his feet and wonderfully congenial. I assume that out of respect for his predecessor, he makes sure that his Cockney isn’t too realistic, while thankfully sparing us the worst of Van Dyke’s ear-graters.\n\nBen Whishaw plays the grown Michael Banks with so much dramatic intensity that he puts a pall over his scenes — the downside of introducing the death of a wife and mother into so airy a fantasy. But Emily Mortimer dispels that pall and then some. As Jane, a labor organizer, she has a meltingly soft face and plenty of backbone, so that the prospect of the Banks children losing their house and moving in with her doesn’t seem so terrible. She’s like Mary Poppins, only human.\n\nMary Poppins Returns was nominated for four Oscars in 2019, including Best Costume Design, Best Original Score, Best Original Song, and Best Production Design.\n\nShow \n \n \n Comment\n \n\n Mary Poppins Returns, Without the Magic\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1307,
  "archivePath": "data/archives/reviews/mary-poppins-2006/vulture--david-edelstein_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:49:52.830Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20260128045859",
  "archiveOrgUrl": "http://web.archive.org/web/20260128045859/https://www.vulture.com/2018/12/mary-poppins-returns-review.html",
  "contentTier": "complete",
  "wordCount": 1307,
  "tierReason": "Full review text"
}