{
  "showId": "scandalous-2012",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://theater.nytimes.com/2012/11/16/theater/reviews/scandalous-the-life-and-trials-of-aimee-semple-mcpherson.html?_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "web-search",
    "bww-roundup"
  ],
  "bwwExcerpt": "“The Life and Trials of Aimee Semple McPherson,” as the show is subtitled, are actually much more fascinating than you would gather from this formulaic Broadway musical...“Scandalous'...condenses and rearranges McPherson’s story to fit smoothly into the familiar grooves of celebrity biography. In the process the show reduces McPherson’s remarkable life to a cliché-bestrewn fable about the wages of fame…“Scandalous” isn’t so much scandalously bad as it is generic and dull…Ms. Carmello, a gloriously gifted singing actress, has never managed to snag a star-making breakout role on Broadway — not all that surprising in these difficult days for musical theater. Sister Aimee certainly provides plenty of opportunities for Ms. Carmello to thrill us with the purity and power of her voice. She leads a few rousing come-to-Jesus gospel-tinged numbers with bright-beaming intensity. She delivers the climactic soul-baring ballad with plenty of emotional heat. What she cannot do — no singer without the power of miracle could — is bring distinction to songs that never rise above the serviceable.",
  "bwwScore": 6,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-SCANDALOUS-Opens-on-Broadway-Updating-LIVE-20121115",
  "publishDate": "November 15, 2012",
  "fullText": "https://www.nytimes.com/2012/11/16/theater/reviews/scandalous-the-life-and-trials-of-aimee-semple-mcpherson.htmlShare full articleAdvertisement\n\nThe story is as familiar as anything in the Gospels. Little girl from Nowheresville dreams of fame on the world stage. Rebelling against a stern upbringing, she lights out for the big time, picking up and losing a husband or two before amassing an adoring audience. Then come the dark days, as her morals begin to melt in the hot Hollywood spotlight: the pill popping, the bad romances and legal squabbles, the flight from the scavenging reporters. Salvation arrives on cue, just in time for the finale.\n\n“Scandalous,” a new Broadway musical about Aimee Semple McPherson, deviates from the boilerplate only in the distinctive passions of its heroine, whose fame derived not from stage or screen but from the pulpit. While collecting a fan base that would be the envy of any of her movie star contemporaries in the 1920s and ’30s, McPherson was also converting thousands to Christianity, healing the sick through the laying on of hands, and establishing the foundations on which the modern evangelical movement would be built.\n\n“The Life and Trials of Aimee Semple McPherson,” as the show is subtitled, are actually much more fascinating than you would gather from this formulaic Broadway musical. With book and lyrics by Kathie Lee Gifford and music by David Pomeranz and David Friedman, “Scandalous,” which opened on Thursday night at the Neil Simon Theater, condenses and rearranges McPherson’s story to fit smoothly into the familiar grooves of celebrity biography. In the process the show reduces McPherson’s remarkable life to a cliché-bestrewn fable about the wages of fame.\n\nMs. Gifford herself is something of an expert on that subject: she’s known primarily as a perky television morning show host with a bit of the mean girl lurking behind the blinding smile. Recently she’s begun moonlighting: “Under the Bridge,” a cutesy children’s musical with book and lyrics by Ms. Gifford, was produced Off Broadway in 2005. Broadway jackals suspicious of Ms. Gifford’s bona fides were surely hoping for an epoch-making turkey in time for Thanksgiving. Sorry, guys. “Scandalous” isn’t so much scandalously bad as it is generic and dull.\n\nTrue, collectors of camp might find some minor pleasures in the splashy biblical pageants of the second act, when McPherson, portrayed with hearty gumption by Carolee Carmello, looks on with a twinkly eye as Adam and Eve chomp from a sequined apple, or vamps as an alluring Delilah as Samson groans in beefcake bondage.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 429,
  "archivePath": "data/archives/reviews/scandalous-2012/nytimes--charles-isherwood_2026-02-07.html",
  "textFetchedAt": "2026-02-07T15:00:56.454Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 429,
  "tierReason": "Full review text"
}