{
  "showId": "scandalous-2012",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "http://www.variety.com/review/VE1117948755?refCatId=33",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Picking up where 'Leap of Faith' left off, 'Scandalous' is another big-budget, evangelist-with-feet-of-clay tale from the hinterlands, and despite various prior incarnations, it looks woefully out of place on a Broadway stage. Thesp Carolee Carmello ('Parade') does everything she can to breathe life into this bio-musical of forgotten celeb Aimee Semple McPherson, aka Sister Aimee, but no amount of proselytizing is likely to convert Gothamites. The composer, lyricist, librettist, director, choreographer and producers are all Broadway first-timers; so much for beginner's luck.",
  "bwwScore": 6,
  "contentTier": "complete",
  "fullText": "Picking up where \"Leap of Faith\" left off, \"Scandalous\" is another big-budget, evangelist-with-feet-of-clay tale from the hinterlands, and despite various prior incarnations, it looks woefully out of place on a Broadway stage.\n\nPicking up where “Leap of Faith” left off, “Scandalous” is another big-budget, evangelist-with-feet-of-clay tale from the hinterlands, and despite various prior incarnations, it looks woefully out of place on a Broadway stage. Thesp Carolee Carmello (“Parade”) does everything she can to breathe life into this bio-musical of forgotten celeb Aimee Semple McPherson, aka Sister Aimee, but no amount of proselytizing is likely to convert Gothamites. The composer, lyricist, librettist, director, choreographer and producers are all Broadway first-timers; so much for beginner’s luck.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Trevor Noah Roasts Nicki Minaj at Grammys for Going MAGA: 'She's Still at the White House With Donald Trump' \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Donald Trump Slams Grammys as 'Unwatchable' and Calls Trevor Noah a 'Total Loser' Over Trump-Epstein Island Joke: 'It Looks Like I'll Be Sending My Lawyers to Sue This Pathetic Dope'\n\nShow, with book and lyrics by TV hostess and media personality Kathie Lee Gifford, preemed (as “Saving Aimee”) at the White Plains Performing Arts Center in 2005 before moving on to an Eric Schaefer-directed version at Signature in Arlington, Va., in 2007; the present version originated at Seattle’s Fifth Avenue Theater last October, with that house’s artistic director, David Armstrong, taking over the reins here.\n\nOne of the show’s co-producers is the Foursquare Foundation, which was founded by McPherson and honors her memory, yet had no creative input; that might explain why she’s portrayed here as a cynical, money-grubbing, child-neglecting, pill-popping adulteress. To its credit, “Scandalous” doesn’t try to whitewash its heroine’s life. It even seems to admit that when McPherson was purportedly kidnapped for five weeks in 1926, she was probably shacked up in a bungalow in Carmel with her married lover.\n\nBut the book never offers more than a by-the-numbers outline of the life of Sister Aimee, whose “hair is as unruly as her spirit is wild.” (This from the mother, referring to her 6-week-old infant.) Gifford, who is credited with additional music along with the book and lyrics, does not impress in her several capacities. Her lyrics are filled with rhymes like “changing world”/”ever-rearranging world” and “pompous piety”/”religiosity.” Facile sentiments abound, such as “I have a fire, it burns deep within, whether I am inspired or mired in sin.”\n\nGifford also includes a couple of unexpectedly raunchy scenes that merely seem out of place. The whole affair is synthetic and simplistic: The songs, from pop composer David Pomeranz and conductor/arranger David Friedman (“Beauty and the Beast”), move the story along from point to point, but without any sense of purpose. There’s a wide range of styles, at least, with one jazzy duet for Aimee’s suitors, “It’s Just You,” providing momentary interest. The biblical vignette songs in the second act, however, border on embarrassing.\n\nArmstrong’s direction is pageant-like and aimless, and sabotaged by designer Walt Spangler’s scenery: The opening number reveals a massive tabernacle, with a central podium flanked on each side by 12 massive steps. Those 24 steps remain stranded onstage throughout the evening, drastically restricting the playing area. Choreographer Lorin Latarro seems to be mostly filling space.\n\nCarmello has been with the show since White Plains, but she continues to face an uphill battle; she’s hard-working and the resultant performance is admirable, but the material doesn’t allow the actress or “Scandalous” to be convincing. Carmello’s co-star here is George Hearn, who has little to do but bluster as a power-hungry pastor with a compromised past.\n\nCandy Buckley sings and frowns as Aimee’s harsh mother, while Roz Ryan plays the role of the baddest madam in Kansas City, who sings a raunchy sex song and then immediately transforms herself into Aimee’s biggest acolyte and protectoress. Ryan gets what are pretty much the only hearty laughs of the evening, suggesting she rewrote her lines herself.",
  "isFullReview": true,
  "textWordCount": 652,
  "archivePath": "data/archives/reviews/scandalous-2012/variety--steven-suskin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:34:15.845Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 652,
  "tierReason": "Full review text",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-SCANDALOUS-Opens-on-Broadway-Updating-LIVE-20121115"
}
