{
  "showId": "the-cottage-2023",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/theater/theater-reviews/the-cottage-review-broadway-jason-alexander/",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Cottage review: Jason Alexander's Broadway directorial debut is a knock-knock-knockout\nEric McCormack, Laura Bell Bundy, Alex Moffat, and more bring the drama to the pastoral English countryside in Broadway's newest screwball comedy.\n\nSex, lies, and several half-finished cups of tea are just a hint of what's actually happening behind closed doors in Broadway's new side-splitting screwball comedy The Cottage, which opens at the Helen Hayes Theater on July 24.\n\nThe play is a sensational, feminist twist on a classic British period drama that features knockout performances, melodramatic reveals, and some seriously outrageous one-liners. If home is where the heart is, then The Cottage is where the mind's deepest, darkest, and most salacious secrets go to fight and frolic in the fresh air.\n\nIt all kicks off when Sylvia (Laura Bell Bundy), a 1920s woman basking in the afterglow of an evening spent with her paramour Beau (Eric McCormack) at his pastoral cottage in the English countryside, decides that she's ready to take their illicit affair to the next level by penning a series of telegrams notifying her husband, Clarke (Alex Moffat), and Beau's wife, Marjorie (Lilli Cooper), of their romance. Her bold declaration sets off a chain reaction that leads to a whole host of unexpected visitors, a swordfish casually being used as a weapon, and the truth, eventually, coming to light.\n\nJason Alexander, in his Broadway directorial debut, keeps the hysterical production (which also stars Dana Steingold, Nehal Joshi, and Tony Roach) moving at a swift clip to match the natural cadence of playwright Sandy Rustin's snappy script. His strong stage direction — joined with lighting designer Jiyoun Chang's well-timed spotlights — keeps The Cottage from collapsing in on itself as its protagonists frenetically buzz in, out, and around Paul Tate dePoo III's sumptuous set, which is decorated to the nines with elegant tchotchkes, leather-bound books, a chaise lounge, gramophone, and several key family portraits.\n\nWhile Alexander and Rustin light the way, The Cottage's success ultimately rests upon the chemistry between its phenomenal (and likely future Tony-nominated) six-piece ensemble to not only maintain its fervent pace, but also draw laughs with Rustin's rapid-fire, period-typical dialogue that delights in subverting audience expectations at every turn. Thankfully, the cast more than rises to the occasion, each bringing their own unique comedic timing and skill set to the table as they riff off one another with cheeky ad-libs, lean into physical comedy gags, and try their best not to break along the way.\n\nMcCormack is stellar as the dashing and debonair Beau, a wealthy womanizer who is at one point described as \"the greatest looking man in all of Britain.\" The Emmy award-winning actor deftly imbues the character with both the unshakeable confidence of a leading man from Hollywood's Golden Age and a biting sense of humor that often flies directly over the other houseguests' heads. As the cottage's visitors ponder the true meaning of love over the course of the play's two-hour runtime, McCormack lets Beau's perfectly poised veneer slowly crumble until he's left thunderstruck at the realization that, despite being married, he's never actually been in love before — and his attempts to supplement the feeling by taking on lovers \"like the Queen takes tea\" won't remedy the problem.\n\nMeanwhile, hell hath no fury like a Sylvia scorned. Bundy — best known for her Tony-nominated performance as Elle Woods in the musical adaptation of Legally Blonde —brings real moxie to the unapologetic spitfire. Sylvia begins her morning believing that love is the answer to all of her problems, only to end her day having learned that all she really needs in life is herself — and maybe a cute gardener to call upon to \"get into your pansies\" once in awhile. She spirals around the cottage's living room like a whirlwind — her gorgeous off-white negligee, designed by Sydney Maresca, twirling behind her as she goes — delivering cutting remarks, mourning lost loves, and lighting cigarette after cigarette from any of the random household appliances that secretly moonlight as lighters throughout the elaborate living room.\n\nCooper brings a grounded approach to the stern Marjorie, but the Tony-nominated actress is also largely responsible for making all of her costars crack onstage during an uproariously funny scene in which her character, who is heavily pregnant, unleashes what can only be described as the fart of all ages. (The flatulence — brought to life in crystal clear audio by sound designer Justin Ellington — spawned not only several minutes of uncontrollable laughter from the audience, but received its very own round of applause.)\n\nMoffat, making his Broadway debut, taps into his improv skills and Saturday Night Live experience to transform Clarke into a seemingly-distinguished gentleman who, when the chips are down, shrinks at the first glimpse of confrontation — and is willing to jump headfirst into a secret window compartment to avoid it, even if it means that his legs are left sticking comically straight up in the air.\n\nWithout giving too much away, Joshi is absolutely killer as the mysterious Richard, while Steingold drops some serious truth bombs about love (and the many different forms it can take in one's life) as the equally curious Deirdre.\n\nFrom the moment that Sylvia first flounces onstage until the curtain call, The Cottage is a fresh and fiercely fun play that's firing on all cylinders, with Rustin's excellent script. The play delivers comedy gold while simultaneously encouraging theatergoers to consider the roles love, sex, and societal expectations play in our lives. Its ending, while perhaps a bit too easily won, is still an enjoyable twist on a timeless tale that will leave you ready to march up to The Cottage's stained glass front door and ring its doorbell once again. Grade: A",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 95,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 959,
  "archivePath": "data/archives/reviews/the-cottage-2023/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:29:59.748Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "scoreSource": "extracted-grade",
  "scoreConfidence": "medium",
  "extractedGrade": "A"
}