{
  "showId": "the-cottage-2023",
  "outletId": "observer-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://observer.com/2023/07/the-cottage-review-this-new-broadway-farce-is-a-fiasco/",
  "publishDate": null,
  "fullText": "Set in the summer of 1923 in a lavishly appointed cottage in the British countryside, the silly new Broadway farce called The Cottage at the Helen Hayes Theater is too vulgar, pointless and stupid to describe, but I feel duty-bound to try. Rakish playboy Beau (dashing Eric McCormack from Will and Grace) and dim-witted blonde Sylvia (Laura Bell Bundy) have been having an affair. Well, it’s not much of an affair. They’ve been sleeping together in the cottage one night a year for seven years. But it’s a bit of a sticky wicket, you know, because Beau is Sylvia’s brother-in-law, and his pregnant wife Marjorie (Lilli Cooper) would drop dead if anyone ever told her. Which is exactly what Sylvia intends to do. Never mind. Marjorie arrives and announces she’s in love with Beau’s brother Clarke (Alex Moffat), who is also Sylvia’s husband and the father of Marjorie’s expected child. Enter Beau’s other lover, Dierdre (Dana Steingold), who announces her husband Richard has murdered all of her previous lovers and now plans to kill Beau. Dierdre to Beau: “I thought your divorce was final.” Beau to audience: “Final is such an ambiguous word.” And this is such an ambiguous play! Also noisy, witless and moronic.\n\nIt’s a first-time directorial debut by actor Jason Alexander, who once showed a devout sense of humor as a regular on Seinfeld, but now leads an unfortunately misguided cast of six other actors at a fever pitch to yell, shriek and swallow two hours of uniformly overwrought line readings that make them appear to be delivering dialogue to the furniture. Everyone speaks (squeaks?) in phony accents that resemble a 33-rpm recording of geese played at a 78-rpm speed. Last (and definitely least) there is Dierdre’s husband Richard (Nehal Joshi), who arrives late with a fake beard and turns out to be another lover of Sylvia’s whose real name is William. Are you still with me?\n\nThe actors prattle on endlessly about nothing at all and 90 percent of what they say is incomprehensible. The running gag The Cottage depends on for laughs is the myriad hiding places where the actors search for cigarettes, retrieving them from wine bottles, mantelpiece drawers, and the penises of statues. Overloaded with gimmicks to pad out the playing time, the visual gags include a golf club that folds in half, a gun that won’t fire, and a hideous stuffed porcupine. When everything else fails, one whole scene is devoted to farting.\n\nThe hopeless ineptitude of the playwright, Sandy Rustin, makes it hard to tell exactly what the point of this abysmal fiasco really is. It may or may not be intended as a trashy spoof of the old drawing-room comedies of Noel Coward, but it’s so bad it makes Sir Noel look and sound as serious and important as Molière and Aristophanes put together. The best thing about The Cottage is the cottage, designed by someone with the name Paul Tate dePoo III.  Everything else is more like the outhouse. Even as a lark, it’s beneath the standards of Broadway.\n\nThere’s only one thing to do about something this lousy. Anyone got a blow torch?\n\nWe get it: you like to have control of your own internet experience. But advertising revenue helps support our journalism. To read our full stories, please turn off your ad blocker.We'd really appreciate it.\n\nBelow are steps you can take in order to whitelist Observer.com on your browser:\n\nClick the AdBlock button on your browser and select Don't run on pages on this domain.\n\nClick the AdBlock Plus button on your browser and select Enabled on this site.\n\nClick the AdBlock Plus button on your browser and select Disable on Observer.com.",
  "isFullReview": true,
  "dtliExcerpt": "“The best thing about ‘The Cottage’ is the cottage, designed by someone with the name Paul Tate dePoo III. Everything else is more like the outhouse. Even as a lark, it’s beneath the standards of Broadway.”\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 616,
  "archivePath": "data/archives/reviews/the-cottage-2023/observer-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:34:39.035Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230926060925",
  "archiveOrgUrl": "http://web.archive.org/web/20230926060925/https://observer.com/2023/07/the-cottage-review-this-new-broadway-farce-is-a-fiasco/"
}