{
  "showId": "the-cottage-2023",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/TheCottage.html",
  "publishDate": null,
  "fullText": "Present LaughterThe Hayes Theaterthe Hayes TheaterHayes TheaterTheatre-related booksMusical theatre reviewsTalkin Broadway merchandiseRegional theatre ticketsTheatre themed apparelStudio Theatre\n\n\n\n\n\n\n\n\n\n\n            \t\t                  \n                                            \n \n\n\t\n\n\n \n \n\n\n\n Past ReviewsBroadway Reviews\n\nTheatre Review by Howard Miller - July 24, 2023\n\nThe Cottage by Sandy Rustin. Directed by Jason Alexander. Scenic design by Paul Tate dePoo III. Costume design by Sydney Maresca . Lighting design by Jiyoun Chang. Sound design by Justin Ellington . Wig, hair, and makeup design by Tommy Kurzman . Production properties supervisor Matthew Frew. Dialect coach Jerome Butler. Associate director Jennifer Werner. Fight director Thomas Schall.\nCast: Eric McCormack, Laura Bell Bundy, Lilli Cooper, Nehal Joshi, Alex Moffat, Dana Steingold, and Tony Roach.\nTheater: Hayes Theater\nTickets: Telecharge.com\n\nThe Cottage takes place in 1923 in the pastoral village of Moreton-in-Marsh in Gloucestershire, England. The tone is set from the moment you enter the theater and are treated to the sounds of popular tunes from the era. But while you are enjoying the music, do take the time to peruse the drop curtain, with its image of a lovely country cottage that will be the play's setting. Look closely, and you will notice that the garden has gone a little bit wild, and that the animals depicted in the bucolic scene are doing what comes naturally. Oh, and there is that article of clothing that has been tossed onto a tree limb. In short, all the themes of the play are captured right there.\n\nAs the curtain rises on Paul Tate dePoo III's scrumptious set, which looks more like the interior of a mansion than any cottage I've ever seen, you may feel you have wandered into a performance of Coward's Present Laughter, especially when Beau (a pitch perfect Eric McCormack, who would make a terrific Garry Essendine from that play), shows up in his dressing gown.\n\nBut first, there is Sylvia (a resplendent Laura Bell Bundy), Beau's once-a-year paramour, who sweeps into the room wearing a glamorous negligee and tries out various formalized poses for greeting Beau when he comes down the stairs. For many long moments she lies across the chaise longue holding aloft a bunch of grapes until, when Beau still hasn't come down to catch a glimpse of her at her Rococo best, she gives up and throws down the grapes in annoyance.\n\nFrom there on out, the dominos fall one by one. Clarke, who happens to be Beau's brother (both their sibling rivalry and mutual affection are on display throughout) shows up with a visibly pregnant Marjorie. But just as we expect a bombshell of recriminations, Clarke and Marjorie announce that they could not be happier with the situation since they, too, are lovers.\n\nBut wait; there's more. Enter onto the scene Deirdre (Dana Steingold, splendidly wacky). Deirdre is Beau's rest-of-the-year lover, and she has come to announce she has divorced her husband Richard (Nehal Joshi) so she can be free to marry Beau, once he and Marjorie divorce, of course. Oh, and by the way, Richard, who has a habit of murdering Deirdre's lovers, is on his way over as well.\n\nAll of this is basically the set-up for an excuse to have this stellar cast bounce around the set dressed in Sydney Maresca's marvelous costumes, trading bon and lesser-bon mots, playing with a multitude of props (cigarettes and lighters pop up in the most unexpected places, along with a variety of taxidermied animals), and generally turning The Cottage into quite a romp of a comedy.\n\nThe center of attention keeps switching from character to character, but in the end, it is Laura Bell Bundy as the increasingly self-determined Sylvia who turns out to be the glue that holds it all together. It is Sylvia who, among all of the partner swapping, comes out on top, thanks to a surprise gift from her newly deceased mother-in-law (intently disliked by her sons), whose formal portrait looks down on everyone from over the fireplace.\n\nAll told, The Cottage is a perfect summertime play, as pleasurable as a stroll through an English country garden, followed by a perfect dish of strawberry ice cream.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 677,
  "archivePath": "data/archives/reviews/the-cottage-2023/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:38:50.219Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}