{
  "showId": "the-cottage-2023",
  "outletId": "theatrereviews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theatrereviews.com/broadway-review-the-cottage-at-the-helen-hayes-theater-through-sunday-october-29-2023/",
  "publishDate": null,
  "fullText": "The familiar post-TONY lull that usually occurs during the summer months of July and August, when everyone takes a break to flee the city for a bit of ocean breeze, doesn’t seem to be happening this theater season. So those theater going tourists and local homebodies can partake in a few new openings on Broadway, with the latest being “The Cottage” penned by Sandy Ruskin and directed by Jason Alexander. The action takes place in 1923 England, in the living room of a well-appointed, over the top, country cottage. More than a farce, it is a parody of a British drawing room farce, where every situation is highly improbable, everyone is extremely exaggerated and broad, and low brow humor and slapstick seem to appear at every turn. The opulent scenic design by Paul Tate de Poo III is filled with so many surprises it almost becomes one of the comedic characters taking on a role of its own. Right from the opening scene the audience becomes aware that this is not to be taken seriously and is all done modeled after period British comedy.\n\nThe plot revolves around Syvia (a spirited Laura Bell Bundy) who is having an affair at the family cottage with her brother-in-law Beau (a debonaire Eric McCormack), but sheepishly sends off telegrams to her husband Clarke (a flexible Alex Moffat) and beau’s pregnant wife Marjorie (a calm Lilli Cooper), announcing her intention to divorce her husband to marry Beau. When the two spouses arrive at the cottage, we discover they are having an affair with each other, and Marjorie is pregnant with Clarke’s child. The calamity continues when ex-prostitute Dierdre (a perky and determined Dana Steingold) appears at the door, to announce she is having an affair with Beau and has gotten divorced to be with him. The excitement continues when Dierdre’s ex-husband Richard (a meek Nehal Joshi) knocks at the door, and appears holding a gun, prepared to shoot Beau. What happens next adds to the confusion and complexity of the improbable script, providing more melodramatic exaggeration and implausible situations.\n\nAt times, the low brow humor gets a bit too broad and raunchy, but it is all done for fun and laughs. This is buffoonery at its best, going above and beyond, both physically and visually to produce an uproarious farce with quite a few laughs. The remarkable cast outshines the book showcasing their impeccable comedic timing and turning in performances that are larger than life, establishing a perfect balance of sincerity and ridiculousness that is the root of British humor. Ms. Bundy exhibits her ability to control the festivities front and center, alongside Mr. McCormack who exudes the confidence and panache of the finest English magistrate. Their chemistry is charming. Mr. Moffat produces exceptional physical comedy as he twists and turns with dramatic punctuation and Ms. Cooper captures a regal dry humor with stone cold delivery. Ms. Steingold makes the most of her minor role with charming innocence and raucous drunkenness, while Mr. Joshi is convincing in his complex role.\n\nRegardless of the shortcomings of the book, Mr. Alexander deftly directs his cast to squeeze every spec of humor from absurd and ridiculous situations and does so at a very quick pace. This is a production that succeeds in its mission, solely to entertain and treat the audience to some lighthearted laughter. It makes for a great summer evening at the theatre, where you can sit back, relax, and enjoy some mindless humor.\n\nThe Clubbed Thumb, True Love, and New York Theatre Workshop production of What the Constitution Means to Me will come to Broadway this spring for a 12-week limited engagement, beginning performances at the Helen Hayes Theater (240 W 44th Street, New York, NY) on March 14, 2019, with opening night scheduled for March 31. Heidi Schreck’s timely…\n\nAt the beginning of “Job” which is currently running at the Helen Hayes Theater, Jane (a frenetic yet oddly focused Sydney Lemmon) enters Lloyd’s (a seemingly focused yet not fully at ease Peter Friedman) office holding a gun, confident she knows “who he is.” Although she then briefly experiences some…\n\nLoneliness, the quest for authentic and meaningful love, the fear of rejection, the need for respect, and the excruciating separation from situations of abuse are not unique to members of the LGBTQ+ community of any decade or location, and perhaps that is why audiences have responded positively to Harvey Fierstein’s…",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 736,
  "archivePath": "data/archives/reviews/the-cottage-2023/theatrereviews-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:48:55.348Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.goto: Timeout 60000ms exceeded.\nCall log:\n  - navigating to \"https://www.theatrereviews.com/broadway-review-the-cottage-at-the-helen-hayes-theater-through-sunday-october-29-2023/\", waiting until \"domcontentloaded\"\n"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "ends_with_ellipsis"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}