{
  "showId": "the-cottage-2023",
  "outletId": "theaterpizzazz-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theaterpizzazz.com/the-cottage-sex-intrigue-mayhem-in-a-bucolic-country-setting/",
  "publishDate": null,
  "fullText": "What could be better than a comedy of manners in the style of Oscar Wilde, “inspired by the works of Noël Coward,” heightened to riotous farce with a modern twist? The Cottage, by playwright Sandy Rustin in her Broadway debut, is a send-up of well-to-do British society in 1923. This parody of romantic comedies is deliciously served with lust and infidelity behind “closed doors.”\n\nDirected by the inimitable Jason Alexander for maximum high jinks and mirth, The Cottage is a romp that speeds by at two hours and fifteen minutes with one intermission at the Hayes Theater. With a limited run and an October 29 closing date, this is a LOL must-see.\n\nAn all-star cast portrays the lovers, wives and husbands in lust and love with each other’s spouses, while they enjoy the duplicitous romances made even more exciting by their betrayal of each other.\n\nThe first romancers we meet at the sumptuously decorated, cottage hideaway (set design by Paul Tate dePoo III), are Sylvia (Laura Bell Bundy, Legally Blonde) and Beau (Eric McCormack, renowned for his portrayal of Will in the TV comedy, “Will and Grace”). Sylvia and Beau are concluding their annual, erotic, wild, one-night tryst, when Sylvia excitedly reveals that she has sent telegrams to both of their spouses. By revealing their seven-year-long affair for “love,” Sylvia hopes their marriages to their spouses will end in divorce.\n\nBeau is barely able to register his shock and awe when there is a knock at the door and a humorous musical flourish announces the entrance of Beau’s very pregnant spouse, Marjorie (Lilli Cooper, POTUS). Of course, to keep up appearances for Beau’s sake, Sylvia momentarily hides in the window seat storage compartment until Beau ironically retrieves her in response to Marjorie, who asks for Sylvia. After repartee about Marjorie’s pregnancy, which shocks Sylvia, who assumed Beau was sexually abstemious with his wife, there is another knock at the door. And there is another humorous musical flourish at the entrance of Sylvia’s husband and brother-in-law Clarke (Alex Moffat, “Saturday Night Live”). Yes, Beau and Clarke are brothers, who believe in sharing.\n\nAs the couples and lovers confront each other with wit, irony, nuzzling and competing sexual innuendos, Beau’s lasciviousness is revealed when a third knock comes at the door. The humorous musical flourish announces Dierdre (the flighty, fatuously wise Dana Steingold). Dierdre—who looks twenty years younger than Sylvia and Marjorie—is a ball of fire, which sets Sylvia’s hair and attitude aflame, along with the discovery that her husband, Clarke, and Beau’s wife, Marjorie, have sex almost nightly.\n\nFurthermore, the “working late” excuse that Beau and Clarke give to Sylvia in response to why they are never at home or can’t meet up has been answered roundly by Dierdre and Marjorie. It seems that Sylvia is the deprived, lonely, odd woman out when everyone else has been enjoying each other’s sexual delights with immodest frequency. Where will these events end for hapless, desolate Sylvia?\n\nDierdre brings the answer to fate, betrayal and marriages gone belly-up. She announces that the ink is barely dry on her divorce papers, so she is available to marry Beau, who has been lying to her about his marital status. However, there is a problem for everyone in the large, well-appointed living room. Dierdre’s former spouse is a real killer. As the scenario diverts with twists, turns and riotous humor, the last knock comes upon the well-worn cottage door.\n\nBut this time there will be no musical flourish for the intruder, Dierdre’s newly divorced husband, Richard (Nehal Joshi, Flying Over Sunset). Instead, ominous thunder and lightning flashes accompany Sylvia, as she opens the door and bravely faces Richard alone, not caring whether she lives or dies because she is disgusted with living a life of lies. Meanwhile, the others are in hiding, because of the frightening stories Dierdre has told them about Richard.\n\nIf Act I is uproarious (and it is), Act II follows with even greater hilarity, rapid-fire pacing and expertly delivered jokes of thrust and parry. The ensemble melds beautifully. They are comfortable with mannered acting styles and posh, put-on British accents, which are intentionally exaggerated.\n\nAlexander’s innate funny bone and talent in shepherding his cast with staccato pacing, speeds the action and keeps it vibrant. There is schtick that builds joke upon joke (i.e., the various containers from which the characters pull their cigarettes) and augments to a glorious peak. The actors’ physicality is authentic and sharp, and clever staging flows smoothly. This is farce with a capital “F.”\n\nOf course, the themes about women overthrowing the patriarchy, which Sylvia decides to do at the play’s conclusion—when she determines she doesn’t need a man to live happily—are glorious. Rustin’s dialogue and plot twists are refreshing. The production doesn’t take itself seriously and twits the preposterousness of romance, sex, infidelity, and marriage with a soupçon of goodwill.\n\nKudos to other members of the creative team which include Sydney Maresca (costume design), Jiyoun Chang (lighting design), Justin Ellington (sound design) and Tommy Kurzman (wig/hair and makeup design).\n\nThe Cottage. Through October 29 at The Hayes Theater. (240 West 44th Street, between Seventh and Eighth Avenues). www.thecottageonbroadway.com\n\nJoanne & Bernie Furshpan\nJane H. Goldman\nJamie deRoy & friends\nJudy Stewart\nJudy Davis\nCarol Ostrow\nAmerican Popular Song Soc. (APSS)\nJanet Fein\nAlyce Finell\n\nYour donation will help us to bring you the latest in NYC theater and cabaret. DONATE TODAY!\n\nJoin our mailing list to receive the latest news and updates from Theater Pizzazz.\n\nJoin our mailing list to receive the latest Theater Pizzazz news.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 85,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 928,
  "archivePath": "data/archives/reviews/the-cottage-2023/theaterpizzazz-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:41:55.958Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250318003823",
  "archiveOrgUrl": "http://web.archive.org/web/20250318003823/https://theaterpizzazz.com/the-cottage-sex-intrigue-mayhem-in-a-bucolic-country-setting/",
  "designation": "Must_See",
  "scoreSource": "extracted-strong-positive",
  "scoreConfidence": "medium",
  "extractedPhrase": "must-see"
}