{
  "showId": "the-cottage-2023",
  "outletId": "timeout-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.timeout.com/newyork/theater/the-cottage-broadway-comedy-review",
  "publishDate": null,
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Joan Marcus | The CottageReview\n\n4 out of 5 starsEric McCormack and Laura Bell Bundy star in a naughty romp.Theater, ComedyRecommendedMonday July 24 2023ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\nWhat’s that merry racket at the Helen Hayes Theater this summer? By George, it’s the sound of a lark! An English lark! Sandy Rustin’s The Cottage has no pretensions to seriousness: It’s a brazenly straightforward drawing-room farce, created for light amusement and delivered on a platter by a properly silly cast of six. The year is 1923, the setting is a country hideaway in the Cotswolds, and the subject is made clear on the drop curtain, which includes a rutting pair of squirrels and a brassiere suspended from the branch of a tree. “Romance, my dear, is for fairy tales,” says the suave Beau (Eric McCormack) to his mistress Sylvia (Laura Bell Bundy), who is also his sister-in-law. “This is not a romance. This is sex.”\n\nSylvia, though, has other ideas. For some time, the couple has been conducting a steamy extramarital affair, meeting once a year at Beau’s family cottage. But Sylvia has now decided to go public with their relationship—and has rashly done so in telegrams to their respective spouses: Beau’s forbidding and very pregnant wife (Lilli Cooper) and his stuffy brother (Alex Moffat). This love rectangle is further complicated by the staggered arrivals of Beau’s doe-eyed auxiliary mistress (Dana Steingold) and her menacing ex-husband (Nehal Joshi).\n\nThe Cottage | Photograph: Courtesy Joan Marcus\n\nThe Cottage may look like a throwback to the tony sauciness of Noël Coward’s plays in the 1930s—in a nod to the Master, Beau’s secretary is named Mrs. Worthington—but it is broader in character and characters, and less sophisticated in language. Some of the play’s biggest laughs come from outright spoofery of its period and genre, like a running joke that finds cigarettes and lighters concealed in unexpected parts of Paul Tate dePoo III’s well-stuffed set. (These cigs rarely stay lit for long; they are alway being stubbed out in some dramatic gesture.) Amid the old-fashioned trappings, Rustin nestles a welcome modern sensibility to the plot’s skirmishes of the sexes; Sylvia’s dissatisfaction hints at the growing agency of post-Victorian Englishwomen.\n\nWhile the architecture of the plot is solid, what really keeps The Cottage up is the comedic industry of its cast. Directed by Jason Alexander, a seasoned hand at classic timing, the actors leap gamely into their funny business. McCormack’s vain Beau is smoothly caddish and twittish; Moffat, leading with his chin, has some inspired physical horseplay, and Steingold packs a lot of power into her small frame. And Bundy, who looks smashing in Sydney Maresca’s costumes, holds the play’s center together with considerable appeal. It’s sex, sure, but more than that: It’s charm.\n\nThe Cottage. Helen Hayes Theater (Broadway). By Sandy Rustin. Directed by Jason Alexander. With Eric McCormack, Laura Bell Bundy, Lilli Cooper, Alex Moffat, Dana Steingold, Nehal Joshi. Running time: 2hrs. One intermission.\n\nFollow Adam Feldman on Twitter: @FeldmanAdamFollow Time Out Theater on Twitter: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nThe Cottage | Photograph: Courtesy Joan Marcus\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "dtliExcerpt": "\"While the architecture of the plot is solid, what really keeps 'The Cottage' up is the comedic industry of its cast. Directed by Jason Alexander, a seasoned hand at classic timing, the actors leap gamely into their funny business.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": 100,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 830,
  "archivePath": "data/archives/reviews/the-cottage-2023/timeout-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:50:09.522Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "designation": "Critics_Choice",
  "scoreSource": "time-out-stars",
  "scoreConfidence": "medium",
  "originalRating": "5/5 stars"
}