{
  "showId": "death-becomes-her",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2024/11/21/death-becomes-her-the-rare-screen-to-stage-musical-that-improves-on-the-original/",
  "publishDate": "2024-11-21T20:58:20",
  "fullText": "The more movie-to-stage musical adaptations that I see, and I’m seeing a lot, the more I get the feeling that a key ingredient has been left out. Well, not so much left out as glossed over. Whether it’s The Notebook or Back to the Future or seemingly countless others, the creatives seem to spend a lot of effort recreating iconic moments (That kiss in the rain! The flying car!) and dialogue from the films, and the barest minimum on the score. As in the main reason theatrical musicals exist in the first place.\n\nThe latest example is Death Becomes Her, which actually manages the neat trick of being superior to the 1992 fantasy film starring Meryl Streep, Goldie Hawn, and Bruce Willis. The musical adaptation, newly arrived on Broadway after a Chicago tryout, is a laugh riot from start to finish, featuring superb comic performances from its two female leads, a lavish physical production that actually reflects the astronomical (reportedly $31.5 million) production cost, and a book featuring more zingy one-liners than a Friars Club Roast. The only thing missing are memorable songs, but fortunately the show is so entertaining you’ll find yourself not minding very much.\n\nNot that the songs by Julia Mattison and Noel Carey (as in, who?) are bad, mind you. They’re serviceable, sometimes slightly more than that, and if the tunes don’t get stuck in your head, the lyrics will make you laugh continuously. Especially as delivered by Megan Hilty and Jennifer Simard, who play the central roles of Madeline Ashton, a diva actress battling the ravaging effects of growing older, and her frenemy Helen Sharp, who finally finds happiness in the form of marriage to plastic surgeon Ernest Melville (a very funny Christopher Sieber), only to have it snatched away when Madeline steals her man.\n\nWhat ultimately unites the two women is not their bond to Ernest, who, we learn, is the good kind of plastic surgeon specializing in “burn victims and children with cleft palates,” but their succumbing to the temptation of achieving eternal youth. That’s provided by the sorceress Viola Van Horn (Michelle Williams, formerly of Destiny’s Child, whose theater credits include Aida, The Color Purple, and Chicago), whose stable of hard-bodied scantily clad “Immortals” are visual evidence of her powers.\n\nUnfortunately, being immortal comes with its share of bodily complications, especially since the rivalry between the two women results in extreme violence, including a bone-breaking fight on a palatial staircase, a severed head, and a gunshot wound in the stomach that produces a hole so large that you could stick a fist through it. Those and more slapstick moments from the film are recreated onstage to hilarious effect, especially that staircase brawl (featuring a very talented stunt performer, not-so-convincingly outfitted with a blond wig).\n\nAnother of the show’s highlights is the number “The Plan” (sadly, one of only two solely accorded to Sieber), in which the paraphernalia in his workshop, including a vintage Farrah Fawcett poster, comes to riotous life.\n\nUltimately, it’s the book by Marco Pennette, much funnier than the film’s screenplay, that provides the lion’s share of the show’s pleasures, with Hilty and Simard exchanging so many pricelessly bitchy one-liners it’s no wonder that the lines are longer for the men’s room than the women’s. Both actresses knock it out of the park, and if Simard proves the funnier, especially with her line readings and facial expressions, it’s probably only because her character is less one-dimensional.\n\nSieber provides solid support even if he’s largely confined to the role of straight man for much of the time, and Josh Lamon is a hoot as Madeline’s put-upon assistant (strangely, he’s only listed as part of the ensemble despite playing a significant supporting character). Williams delivers more of a presence than a performance, but what a presence it is, and her vocals, not surprisingly, prove thrilling, especially in the opening number “If You Want Perfection.”\n\nDerek McLane has provided the sort of lavish sets, including for Madeline’s mansion and Viola’s lair, that you don’t often see much anymore on Broadway; Paul Tazewell’s costumes and Charlies LaPointe’s hair and wig designs practically deserve a show of their own; and director-choreographer Christopher Gattelli has staged the fast-paced proceedings with the high energy this sort of madcap farce demands. It turns out that Death Becomes Her becomes Broadway.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
