{
  "showId": "the-children-2017",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "Frank Scheck",
  "url": "http://www.hollywoodreporter.com/review/children-1066778",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/children-1066778",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "A thoughtful and provocative theme about one generation's responsibility to the next eventually comes into play, but unfortunately, the evening takes way too long to get there. The plot, such as it is, doesn't kick in until nearly an hour into the intermissionless proceedings, when Rose finally announces the reason for her visit. Before that, there is an endless amount of small talk that, while it teases out revealing information about the characters, proves a trial to sit through. The attempts at comic relief, such as the lengthy exchange revolving around whether Rose did 'number one' or 'number two' in the couple's temperamental downstairs toilet, hardly amuses.",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-The-Critics-Weigh-In-on-THE-CHILDREN-on-Broadway-20171212",
  "fullText": "A cozy cottage near the coast in rural England provides the setting for the new drama by Lucy Kirkwood, and all you have to do is take one look to know that things are not quite right. Miriam Buether’s set design is askew, tilted just slightly enough to suggest there’s something seriously off about the lives of its inhabitants. As we eventually learn, there’s something seriously off about the play as well.\n\nThe Children — which Manhattan Theatre Club has transferred intact to Broadway after the acclaimed run of James Macdonald’s production at London’s Royal Court Theatre — depicts the tense interaction among three characters. They are married sixty-somethings Hazel (Deborah Findlay) and Robin (Ron Cook), and their friend and former colleague Rose (Francesca Annis), who drops in unexpectedly one day after not having seen them for 38 years.\n\nWe soon learn that the couple lives in the wake of a devastating accident that occurred at the nearby nuclear plant in which they all once worked. It resulted in contamination of a widespread area dubbed the “exclusion zone,” with Hazel and Robin having been forced to relocate to a small cottage that has only intermittent electricity. Hazel bemoans the situation to their new arrival, who chastens her, “You don’t have a right to electricity.”\n\nThe tension between the two women continues as they reveal the vastly different courses their lives have taken. Hazel and Robin have four grown children, while Rose, who decamped to America, has remained childless and single. Hazel, a yoga enthusiast, leads an intently healthy lifestyle, while Rose, who still drinks and smokes, happily admits that she has thrown caution to the wind. And, as we come to learn, Rose once had a fling with Robin, a dalliance of which Hazel was well aware.\n\nA thoughtful and provocative theme about one generation’s responsibility to the next eventually comes into play, but unfortunately, the evening takes way too long to get there. The plot, such as it is, doesn’t kick in until nearly an hour into the intermissionless proceedings, when Rose finally announces the reason for her visit. Before that, there is an endless amount of small talk that, while it teases out revealing information about the characters, proves a trial to sit through. The attempts at comic relief, such as the lengthy exchange revolving around whether Rose did “number one” or “number two” in the couple’s temperamental downstairs toilet, hardly amuses.\n\nSimilar to Caryl Churchill’s acclaimed dystopian drama Escaped Alone but running twice as long to half the effect, The Children squanders its provocative premise with dull execution. There are powerful moments in the second half once the main situation has been established, such as the alarming reading of a Geiger counter when waved over Robin’s body or the startling sight that ensues after Hazel attempts to pull Rose’s hair. But for all the moments that resonate there are others that feel forced, such as when the trio launches into a synchronized dance routine to a James Brown song. Because really, that’s what people do in the midst of an impassioned debate about the ramifications of nuclear devastation.\n\nMacdonald’s staging does little to alleviate the work’s tonal problems, although Peter Mumford’s lighting and projections and Max Pappenheim’s sound design provide some spookily atmospheric moments.\n\nThe three veteran British performers deliver impeccable work, handling the play’s ungainly mixture of foreboding drama and cheeky comedy as well as possible. (Findlay, incidentally, also appeared in Macdonald’s production of the similarly themed Escaped Alone, making one wonder if she suffers sleepless nights worrying about nuclear devastation.) But the actors’ fine efforts are not enough to fully breathe life into this willfully slow-paced, sluggish work, which treats minor domestic issues and the future of the planet with equal gravity.\n\nVenue: Samuel J. Friedman Theatre, New York\n Cast: Francesca Annis, Ron Cook, Deborah Findlay\n Playwright: Lucy Kirkwood\n Director: James Macdonald\n Set and costume designer: Miriam Buether\n Lighting and projection designer: Peter Mumford\n Sound designer: Max Pappenheim\n Presented by Manhattan Theatre Club and Royal Court Theatre\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice.",
  "isFullReview": true,
  "textWordCount": 782,
  "archivePath": "data/archives/reviews/the-children-2017/hollywood-reporter--frank-scheck_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:55:10.733Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 782,
  "tierReason": "Full review text"
}