{
  "showId": "the-children-2017",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2017/12/12/theater/review-in-the-children-manhattan-theater-club-lucy-kirkwood.html",
  "publishDate": "December 13, 2017",
  "fullText": "https://www.nytimes.com/2017/12/12/theater/review-in-the-children-manhattan-theater-club-lucy-kirkwood.htmlShare full article3535Advertisement\n\nFirst the earthquake. Then the tsunami. Then the nuclear reactor shuts down when the tidal wave reaches its seaside dome. But not to worry. That’s why they have emergency generators.\n\nPutting emergency generators where floodwaters can quickly render them useless sounds like a design mistake only a polemical (or satirical) playwright would invent. But part of the horror of “The Children,” which opened on Tuesday at the Samuel J. Friedman Theater, is that the author, Lucy Kirkwood, did not dream up that part of the plot. Pretty much the same chain of events caused the 2011 nuclear disaster in Fukushima, Japan.\n\n“It was a one in 10 million years fault sequence,” says Rose, a physicist who helped build the play’s fictional plant on the crumbling east coast of England.\n\nAnd yet one of the astonishments of “The Children,” which comes to the Manhattan Theater Club intact from a run at the Royal Court Theater in London last winter, is that even though it is completely successful as an eco-thriller, bristling with chills and suspense and foreboding sound effects, denuclearization is not its subject. Just a few months after the core meltdown, Rose and the two other characters, also physicists involved in the plant’s creation, remain blasé about that. They assume that such facilities, albeit better designed, will have to be part of the world’s energy mix for a long time to come.\n\nNo, the “fault sequence” Ms. Kirkwood wants to explore is a great deal larger and, given human nature, more intractable.\n\nBut that only dawns on us slowly. First we meet Rose, standing in the kitchen of a ramshackle seaside cottage and ignoring a prodigious nosebleed. She has arrived uninvited to visit Hazel and her husband, Robin, the other two physicists, now retired. They have lived here, a few miles outside the disaster’s “exclusion zone,” since their longtime home and farm nearby was inundated by the tsunami.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Ms. Vega's production emphasizes the apocalyptic undertones of Ms. Kirkwood's text, creating an atmosphere of dread that hovers over the entire evening like radioactive dust.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Ms. Vega's production emphasizes the apocalyptic undertones of Ms. Kirkwood's text, creating an atmosphere of dread that hovers over the entire evening like radioactive dust.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Short text (25 words)",
  "textQuality": "full",
  "previousUrl": "https://www.nytimes.com/2017/12/13/theater/the-children-review.html",
  "urlDiscoveredAt": "2026-02-04T01:22:32.630Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 345,
  "archivePath": "data/archives/reviews/the-children-2017/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:49:10.013Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250602172611",
  "archiveOrgUrl": "http://web.archive.org/web/20250602172611/https://www.nytimes.com/2017/12/12/theater/review-in-the-children-manhattan-theater-club-lucy-kirkwood.html",
  "wordCount": 345,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T05:31:18.731Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The text ends with a technical error message about retrieving article content and enabling JavaScript, indicating this is incomplete/corrupted web content rather than a complete review.; openai: The text is incomplete and includes navigation instructions and error messages, indicating it's not a full review.",
  "promptVersion": "5.2.0"
}
