{
  "showId": "the-children-2017",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "http://www.vulture.com/2017/12/the-ensemble-triple-threat-of-lucy-kirkwoods-the-children.html",
  "playbillVerdictUrl": "http://www.vulture.com/2017/12/the-ensemble-triple-threat-of-lucy-kirkwoods-the-children.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "The Children - which premiered at the Royal Court in London last year and has now transferred to Broadway's Samuel J. Friedman Theatre with its original cast and director, the deft, deceptively unostentatious James Macdonald - is a play about responsibility and guilt, reparation and redemption. It's also a British play, so these heavy matters are handled lightly, wryly, approached from the side until circumstances absolutely demand a head-on confrontation.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-The-Critics-Weigh-In-on-THE-CHILDREN-on-Broadway-20171212",
  "showScoreExcerpt": "“A play about responsibility and guilt, reparation and redemption. It’s also a British play, so these heavy matters are handled lightly, wryly, approached from the side until circumstances absolutely demand a head-on confrontation...Kirkwood plays a clever and ultimately heartbreaking game with the complex relationships among these three old friends...There’s the sense of three expert players staying in close harmony, at first reserved, eventually released.”\n\nRead more",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nDeborah Findlay and Ron Cook in The Children, at the Samuel J. Friedman Theatre. Photo: Joan Marcus “How are the children?” shouts a woman standing in a spare, roughly furnished cottage kitchen at the start of Lucy Kirkwood’s potent, aching new play. The woman is still, serious; there’s an almost alien quality about her, as if she’s processing the details of the world of human beings for the first time. She has gray hair with some wave to it, nicely kept, and a finely featured, elfin face that hints at younger days of striking beauty. She’s also bleeding heavily from the nose, and though another woman — more earthy, more energetic — will soon arrive with a washbowl and a rag and a profusion of apologies, the first woman, the alien, will spend the rest of the play with the front of her shirt marked with blood.\n\nThe Children — which premiered at the Royal Court in London last year and has now transferred to Broadway’s Samuel J. Friedman Theatre with its original cast and deft, deceptively unostentatious director, James Macdonald — is a play about responsibility and guilt, reparation and redemption. It’s also a British play, so these heavy matters are handled lightly, wryly; they’re approached from the side until circumstances absolutely demand a head-on confrontation. “And then I saw the wave,” one character tells another, talking quickly and avoiding sentiment as she describes the cataclysmic event that has redefined reality in The Children’s version of contemporary coastal Britain: “Only it didn’t look like a wave — it looked like the sea was boiling milk and it just kept boiling and boiling and boiling and … and then everyone was running, so I ran too … I’m so sorry, did you say you wanted tea?”\n\nThe character speaking is Hazel.\n\nShow \n 2 Comments / 2 New\n \n Comment\n \n\n The Ensemble Triple Threat of Lucy Kirkwood’s The Children\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 357,
  "archivePath": "data/archives/reviews/the-children-2017/vulture--sara-holdren_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:56:35.051Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "invalid",
  "wordCount": 357,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T05:32:40.678Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a truncated excerpt that only provides plot summary and character description without any critical evaluation or verdict about the production's quality.; openai: The text includes navigation menus and promotional content, not a coherent review.",
  "promptVersion": "5.2.0"
}
