{
  "showId": "the-color-purple-2015",
  "outletId": "latimes",
  "outlet": "Los Angeles Times",
  "criticName": "Charles McNulty",
  "url": "http://www.latimes.com/entertainment/arts/theater/la-et-cm-color-purple-broadway-review-20151211-column.html",
  "playbillVerdictUrl": "http://www.latimes.com/entertainment/arts/theater/la-et-cm-color-purple-broadway-review-20151211-column.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews"
  ],
  "bwwExcerpt": "What a difference a director makes...Rather than rehashing the drama, Doyle has reconceived 'The Color Purple' as a communal meditation on a modern American myth. The result...is a spiritually transcendent theatricalization of the tale that had me silently shouting 'hallelujah' and 'amen.' Doyle is aided by a glorious female cast. Jennifer Hudson, who plays Shug Avery, has been brought in for the Broadway production for box office mojo. But luscious as her singing and stage presence are, she's not the star here. Front and center is the London-trained Cynthia Erivo as Celie...Relatively unheralded, she brings stark humanity -- and an astonishing voice -- to the role of the abused young woman dismissed as ugly and worthless who somehow manages to persevere long enough to have her radiant light recognized. It's hard to imagine that Erivo's heart-stirring Broadway debut, a portrayal that derives enormous power from humility, won't be recognized once award season arrives.",
  "bwwScore": 9,
  "showScoreExcerpt": "\"I'd be happy to see this transformative revival at least a dozen more times…A spiritually transcendent theatricalization of the tale that had me silently shouting 'hallelujah' and 'amen.' Doyle is aided by a glorious female cast…Through this directorial legerdemain the drama achieves the force and fluidity of a Gospel service. ...Emotion soars as despair and despondency give way to forgiveness…'The Color Purple' has finally found the freedom it needed to attain sublimity.\"\n\nRead more"
}