{
  "showId": "the-color-purple-2015",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Elisabeth Vincentelli",
  "url": "https://nypost.com/2023/12/21/entertainment/the-color-purple-review-fantasia-barrino-stuns-in-movie-musical/",
  "publishDate": "December 11, 2015",
  "fullText": "Thanks for contacting us. We've received your submission.\n\nIf you’re on the fence about catching yet another “Color Purple” adaptation, I get it.\n\nSince Alice Walker’s novel was published in 1982, the world has experienced Steven Spielberg’s Oscar-nominated 1985 film, starring Whoopi Goldberg and Oprah Winfrey, the 2005 Broadway musical and a perfect 2015 revival of that same stage show.\n\nRunning time: 140 minutes. Rated PG-13 (mature thematic content, sexual content, violence and language). In theaters Dec. 25.\n\nIsn’t that enough? Shouldn’t we be all Purpled out by now?\n\nNot so fast. Wait until you watch director Blitz Bazawule’s stirring new film version of the musical, starring a tender and triumphant Fantasia Barrino as that timeless beacon of perseverance, Celie.\n\nFar from being an average retread of what previously bowled audiences over onstage and on-screen, Bazawule’s “Color Purple” fuses song and stunning Georgia scenery into a freshly inspirational cinematic entity that, unlike much of what’s been released this year, will strongly appeal to most ticket-buyers.\n\nAnother reason to embrace “Purple” is that the moving film is graced by a duo of exceptional performers in Barrino and Danielle Brooks as Sofia who, while singing, capture the electricity of being live onstage, and, while acting, take advantage of the raw intimacy of a close-up. Getting that combo right in movie musicals is rarer than you’d think.\n\nWalker’s story is much the same as you remember it from Broadway — a softening of the harsher epistolary novel that’s enlivened by gospel and blues.\n\nDuring the early 1900s, a young black woman named Celie experiences loss upon loss and hardship upon hardship as the years go by. Her newborn children are taken away by her abusive father; she’s married off to an unloving husband known as Mister (Colman Domingo) who beats her; and her beloved sister Nettie (Ciara) runs away to safety (for a time) in Africa.\n\nBut shy, don’t-rock-the-boat Celie eventually finds peace and companionship in the women around her, especially Sofia, the brazen wife of Mister’s son Harpo (Corey Hawkins), and Shug Avery (Taraji P. Henson), Mister’s glamorous lounge-singer ex-flame — both of whom encourage Celie to finally stand up for herself.\n\nWhen Sofia wails the number “Hell No!” after Harpo mistreats her, Brooks, who played Taystee on “Orange Is the New Black,” just about crashes through the screen with boldness. She’s just as terrific in the role now as she was on Broadway back in 2015.\n\nBarrino also won over crowds as Celie onstage in New York, but in the original production a decade earlier. Nearly 20 years on, the more mature actress has grown deeper in her character’s later-in-life scenes, especially the climactic ballad “I’m Here” in which she sings, “I believe I have inside of me everything that I need to live a bountiful life!”\n\nIt’s in these rousing musical moments that Bazawule, who also directed Beyonce’s “Black Is King,” is at his most assured as a filmmaker. He also has a knack for weaving notes into nature, be it little girls playing on the driftwood of Jekyll Island or women slapping clothes against the rocks of a waterfall to a rhythm.\n\nThere are a couple numbers, such as Celie and Shug’s “What About Love?,” that are overly stagey and feel too far away from this world — even if that’s the point. But another transcendent one comes along soon enough.\n\nThere’s fun, too, in the form of Henson’s sexy Shug as she sings the bluesy and sultry “Push ‘Da Button” at Harpo’s juke joint.\n\nMany movies are full of pain, just like “The Color Purple” is. But more and more these days, we get to the end credits having only witnessed the worst of humanity with no catharsis, affirmation or takeaway beyond basic bleakness.\n\nIf you’re looking to feel, however, then “The Color Purple” is your movie.",
  "isFullReview": true,
  "dtliExcerpt": "This revival of 'The Color Purple' is a gorgeous, emotionally overwhelming experience that improves on the original in every way.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This revival of 'The Color Purple' is a gorgeous, emotionally overwhelming experience that improves on the original in every way.",
  "contentTier": "complete",
  "contentTierReason": "Short text (20 words)",
  "textQuality": "truncated",
  "playbillVerdictUrl": "http://nypost.com/2015/12/10/jennifer-hudsons-co-stars-steal-the-show-in-color-purple/",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "wrongProduction": true,
  "rejectedAt": "2026-02-03T20:03:36.029Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This is a review of the 2023 film adaptation of The Color Purple musical, not the current Broadway production; openai: The text is a review of a new film adaptation of 'The Color Purple', not the current Broadway production.; kimi: This is a review of the 2023 film adaptation of 'The Color Purple' (noted by references to 'film version,' 'in theaters Dec. 25,' 'movie musicals,' 'cinematic entity,' and director Blitz Bazawule), not the current Broadway production.",
  "promptVersion": "5.2.0"
}
