{
  "showId": "the-color-purple-2015",
  "outletId": "timeout",
  "outlet": "Time Out New York",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/the-color-purple",
  "publishDate": "December 10, 2015",
  "fullText": "This revival of the musical adaptation of Alice Walker's novel is a triumph of spirit over adversity, with powerhouse performances that will leave you emotionally wrung out.",
  "isFullReview": false,
  "dtliExcerpt": "This revival of the musical adaptation of Alice Walker's novel is a triumph of spirit over adversity, with powerhouse performances that will leave you emotionally wrung out.",
  "originalScore": 80,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Seeing The Color Purple on Broadway, a decade after its premiere, is like meeting an old friend who has gotten her life together since the last time you saw her. It seems more confident in itself, surer in its sexuality, and it's lost a lot of weight...Doyle's production intensifies The Color Purple and brings out its deeper hues. The musical blossoms into a classic...Celie's journey has a clearer sense of direction than before, but she doesn't have to travel it alone. Erivo is supported by a mighty sisterhood of performers: Jennifer Hudson as Shug, Mister's mistress and Celie's lover; Danielle Brooks as the seemingly indomitable Sofia; Patrice Covington as the exuberant Squeak; Carrie Compere, Bre Jackson and Rema Webb as a trio of gossipy church ladies. This Color Purple is a celebration of black women, and it fills you with appreciation for the musical's return. It's here, and it's beautiful.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This revival of the musical adaptation of Alice Walker's novel is a triumph of spirit over adversity, with powerhouse performances that will leave you emotionally wrung out.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (27 words)",
  "textQuality": "truncated",
  "playbillVerdictUrl": "http://www.timeout.com/newyork/theater/the-color-purple",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews"
  ],
  "bwwScore": 8
}
