{
  "showId": "yellow-face-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2024/10/01/yellow-face-playwright-david-henry-hwang-has-fun-unmasking-himself/",
  "publishDate": "2024-10-01T21:29:40",
  "fullText": "There are some plays that, when revived, you wish would present themselves as dated, plays that could then be enjoyed or disdained as reminders of a darker era. One group of them surely deals with racism, particularly racist American. How wonderful, even miraculous, it would be if those dramas, when brought back, could be received as reminders of a now distant time, dramas to shake a head over and reflect satisfyingly that those bad days are, thank heaven, gone.\n\nUnfortunately, such wishes have yet to be granted when the subject raises its hobgoblin head. Racism still blights the United States so crucially and cruelly that what’s occurring in today’s political climate must be considered a nasty spike in racist attitudes, a hardly gentle reminder being David Henry Hwang’s Yellow Face, currently making its Broadway bow. First seen at the Public Theater in December 2007 and subsequently an Obie winner and Pulitzer Prize finalist, it returns with the same director, Leigh Silverman, and one of its original players, Francis Jue.\n\nSmiles and laughs it elicits, true enough, because Hwang writes it as an autobiographical comedy-drama. Wittily, he puts himself, DHH—as impersonated by square-jawed Daniel Dae Kim in a crackerjack performance—at its center. In large part, he insists that in many of the ensuing mishaps the joke’s on him. Smart fellow, this on-stage (and, of course, off-stage) Hwang. He recognizes that a man who can make fun of himself will in turn have audiences laughing simultaneously at and with him.\n\nAs playwright, Hwang recalls many past distractions, digressions, and indiscretions but focuses on three: (1) his well-publicized 1991 protest, with some equally prominent others, against Actors Equity and, specifically, Welsh actor Jonathan Pryce’s starring on Broadway as a Eurasian man in Cameron Macintosh’s imported Miss Saigon blockbuster; (2) his passing off as Asian the very Caucasian Marcus Gee (Ryan Eggold) in the disastrous, money-losing M. Butterfly follow-up, Face Value, a revue that prompted his Yellow Face self-examination; and (3) the investigated Far East National Bank that his father HYH (Jue), founded and on the board of directors of which DHH sat under duress.\n\nFilling in these stops—many of them substantially enhanced by Yee Eun Nam’s projections—Hwang wrings humor from Marcus’s initial resistance to passing himself off as Asian but, when the guise proves fruitful in the casting department, exploiting it to a rewarding fare-thee-well, most prominently with Asian girlfriend, Leah (Shannon Tyo).  Hwang gets almost as much mileage from the Far East National Bank stew as well as the government pursuit of Wen Ho Lee (also Jue), the Los Alamos scientist suspected of purloining classified papers. He throws tough, no-joke-provoking punches at a name-withheld (Jeff Gerth, Tim Golden?) New York Times reporter (Greg Keller), who unrelentingly covered the FENB situation. (Note: Eventually, Hwang admits that not everything he presents on Arnulfo Maldonado’s sleek, sliding panel set, as lighted by Lap Chi Chu, is true. Sorry, no hints to be yielded here.)\n\nAs recalling the (sometimes made-up?) events, Hwang mostly aims to be funny, as numerous others cast members, primarily Kevin Del Aguila and Marinda Anderson, put themselves through innumerable quick and comic changes. It may be that some of these segments are more amusing to Hwang than to the audience and could stand judicious trimming from the 105-minute entertainment.\n\nWhen toward the play’s end Hwang arrives at his compelling, even compulsive, revelation, however, he’s deeply serious. Responding to his own quite personal impulse, he reveals that he’s written Yellow Face to confront the guise he regards himself as wearing professionally, the face he’d assumed through his earlier works as a Chinese playwright.\n\nYellow Face could, of course be written as “yellowface”—a descriptive companion to blackface, the once familiar, now in disrepute performing style. Indeed, there’s something valiant about Hwang’s reaching this self-facing (self-defacing?) conclusion. There’s something touching is his removing the unseen mask—the imagined make-up he obviously never literally brushed on—that in this final Yellow Face development lifts the self-involved piece to a praise-worthy height.\n\nAnd, be aware, his look in the mirror—where the face seen is an embarrassing reflection—could very well encourage spectators to do their own mask-shedding.  Many thanks to the now relievedly unmasked Hwang for that.\n\nYellow Face opened October 1, 2024, at the Todd Haimes Theatre and runs through November 24. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-reviews"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "https://nystagereview.com/2024/10/01/yellow-face-laugh-reflect-repeat/",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "Smiles and laughs it elicits, true enough, because Hwang writes it as an autobiographical comedy-drama. Wittily, he puts himself, DHH—as impersonated by square-jawed Daniel Dae Kim in a crackerjack performance—at its center. In large part, he insists that in many of the ensuing mishaps the joke’s on him. Smart fellow, this on-stage (and, of course, off-stage) Hwang. He recognizes that a man who can make fun of himself will in turn have audiences laughing simultaneously at and with him.",
  "bwwScore": 9
}
