{
  "showId": "yellow-face-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2024/10/01/yellow-face-laugh-reflect-repeat/",
  "publishDate": "2024-10-01T21:28:35",
  "fullText": "“When you write an autobiographical play, no one uses their real name. That would be self-indulgent,” says a character named DHH in Yellow Face, a play by David Henry Hwang (M. Butterfly).\n\nThe audience at the Todd Haimes Theatre, where Yellow Face has just opened in a lively revival, laughs heartily. Partly because DHH, played by Daniel Dae Kim—of TV’s Lost and Hawaii Five-0—has a wicked way with a one-liner. Also because Hwang is so proudly flaunting his dramaturgical transgression. But mostly because we have been laughing at DHH for the last 90 minutes. Not many writers would be willing to be the butt of so many jokes.\n\nFirst produced in 2007 at the Public Theater and directed by Leigh Silverman, who helms this revival, the semiautobiographical comedy starts with story of Hwang’s high-profile involvement with the 1990 Miss Saigon Broadway protest. For the uninitiated, Hwang and others were objecting to the casting of Jonathan Pryce, a Welsh actor, as a Eurasian pimp. (Hwang wrote a letter to Actors’ Equity, which somehow, cough cough, got leaked to The New York Times: “I had dared to suppose that the yellowface days of Charlie Chan and Fu Manchu had been relegated forever to the closets of historical kitsch.…”) Eventually Pryce went on, and won a Tony for the role. Hwang decided to write a play about it, a “backstage farce about a musical in which the lead actor is a Caucasian playing an Asian.”\n\nYou might not remember 1993’s Face Value, which had a rocky out-of-town tryout in Boston and closed on Broadway after eight previews, never reaching its official opening night. And here’s where art stops imitating life. In Yellow Face, DHH ends up casting—oops!—a white guy, Marcus G. Dahlman (TV star Ryan Eggold of New Amsterdam and The Blacklist, making a very compelling Broadway debut), in an Asian role. But he doesn’t own up to his mistake until years later—leading to a national scandal and public humiliation, not to mention “Marcus Gee” getting roles like the King in The King and I. (If you saw Daniel Dae Kim’s terrific turn as the King in London or on Broadway, that tidbit is extra-funny.)\n\nBroadway insiders will appreciate all “appearances” by actor/Tony-winning M. Butterfly star B.D. Wong, British super-producer Cameron Mackintosh, Shubert Theatres president Bernard Jacobs, casting directors Vinnie Liff and Jay Binder, Public Theater impresario Joe Papp, then-New York Times chief theater critic Frank Rich, and director Jerry Zaks. Those characters, and many others, are all portrayed by the insanely versatile trio of Kevin Del Aguila, Marinda Anderson, and Shannon Tyo, who must take on at least a dozen roles each. Though she does a pretty good Cameron Mackintosh, Tyo—a standout the past few seasons in off-Broadway shows including The Chinese Lady, The Far Country, The Comeuppance, and Regretfully, So the Birds Are—is especially good as Leah Anne Cho, Marcus Gee’s girlfriend and DHH’s ex. I couldn’t help but dream-cast her and Eggold in a revival of Chinglish, Hwang’s 2011 comedy of cross-cultural misunderstandings and malapropisms.\n\nHwang has called Yellow Face a “stage mockumentary,” but there’s more to the piece than theater jokes. Perhaps the best character is DHH’s father, HYH, a self-described “Chinese Republican banker” who idolizes Jimmy Stewart and Frank Sinatra. He’s played by the incomparable Francis Jue, who won an Obie for playing HYH in 2007 and, intriguingly, played a character named DHH in the 2019 David Henry Hwang–Jeanine Tesori musical Soft Power. Jue is a comic dynamo (“You know, your M. Butterfly—that play is a little weird,” HYH says to his son), but in many ways proves Yellow Face’s moral compass. And every good comedy needs a little gravitas.\n\nYellow Face opened Oct. 1, 2024, at the Todd Haimes Theatre and runs through Nov. 24. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
