{
  "showId": "yellow-face-2024",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2024/10/02/theater/yellow-face-review.html",
  "publishDate": "October 2, 2024",
  "fullText": "In 'Yellow Face,' David Henry Hwang has written a play that is both a mea culpa and a manifesto, a work that examines his own complicity in the systems he critiques while never losing sight of the larger issues at stake.",
  "isFullReview": false,
  "dtliExcerpt": "In 'Yellow Face,' David Henry Hwang has written a play that is both a mea culpa and a manifesto, a work that examines his own complicity in the systems he critiques while never losing sight of the larger issues at stake.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "I don’t remember feeling the weight of that insight, or for that matter, the levity of the jokes, when I saw the 2007 production. Part of the improvement in this revival is, no doubt, the result of cuts, fine-tuning and rewritten scenes. The elimination of the intermission helps too; the two halves of the story don’t separate like a sauce. And there’s something to be said for the way a Broadway house, when a solid play is sized up to suit it, responds by giving it space to breathe.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Daniel-Dae-Kim-More-Star-In-YELLOW-FACE-on-Broadway-20241001",
  "showScoreExcerpt": "In 'Yellow Face,' David Henry Hwang has written a play that is both a mea culpa and a manifesto, a work that examines his own complicity in the systems he critiques while never losing sight of the larger issues at stake.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (41 words)",
  "playbillVerdictUrl": "https://www.nytimes.com/2024/10/01/theater/yellow-face-review-daniel-dae-kim.html",
  "sources": [
    "web-search",
    "show-score-playwright",
    "playbill-verdict",
    "nyc-theatre",
    "bww-reviews",
    "bww-roundup"
  ],
  "nycTheatreExcerpt": "\"I don't remember feeling the weight of that insight, or for that matter, the levity of the jokes, when I saw the 2007 production. Part of the improvement in this revival is, no doubt, the result of cuts, fine-tuning and rewritten scenes. The elimination of the intermission helps too; the two halves of the story don't separate like a sauce. And there's something to be said for the way a Broadway house, when a solid play is sized up to suit it, responds by giving it space to breathe.\"",
  "textQuality": "truncated",
  "rejectedAt": "2026-02-03T20:34:40.870Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a brief excerpt or summary statement rather than a complete review with evaluative content and a recommendation.; openai: The review is about 'Yellow Face,' which is not the current Broadway production being reviewed.; kimi: The text provided is purely descriptive, explaining the themes and subject matter of the play (a mea culpa and manifesto about complicity) without offering any evaluation of the production quality, performances, or whether it is worth seeing.",
  "promptVersion": "5.2.0",
  "bwwScore": 8
}
