{
  "showId": "the-homecoming-2007",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2007/legit/reviews/the-homecoming-1200558166/",
  "publishDate": "December 16, 2007",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "Director Daniel Sullivan has assembled a superb cast for this revival of Harold Pinter's 1965 masterpiece, with Ian McShane delivering a commanding performance as the brutish patriarch Max.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Director Daniel Sullivan has assembled a superb cast for this revival of Harold Pinter's 1965 masterpiece, with Ian McShane delivering a commanding performance as the brutish patriarch Max.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Short text (28 words)",
  "textQuality": "partial",
  "sources": [
    "web-search"
  ],
  "textWordCount": 614,
  "archivePath": "data/archives/reviews/the-homecoming-2007/variety--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:31:11.907Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 614,
  "tierReason": "Full review text",
  "wrongFullText": "Tenor Alfie Boe and soprano Sarah Tynan have ideal voices to ride the lushly orchestrated hit tunes famously borrowed from Borodin that make up \"Kismet.\" Their singing in the ravishing quartet \"And This Is My Beloved\" is spine-tingling. That's it for the good news.\n\nTenor Alfie Boe and soprano Sarah Tynan have ideal voices to ride the lushly orchestrated hit tunes famously borrowed from Borodin that make up “Kismet.” Their singing in the ravishing quartet “And This Is My Beloved” is spine-tingling. That’s it for the good news. The plot may be peopled by beggars, but virtually everything else about Gary Griffin’s misconceived, misjudged English National Opera production of “Kismet” beggars belief.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nIt makes sense for this company to revive grand-scale works outside the standard opera repertoire, and this extravagant score, with its glowering tuba and shimmering, evocative harp glissandi, is beyond the possibilities of a West End pit band let alone a fashionable Donmar-style small-scale rethink.\n\nWhich is where Griffin comes in. Prior to directing “The Color Purple,” Griffin had proved himself a master of the scaled-back approach to musical theater. In “Kismet,” however, faced with the vast Coliseum stage and with operetta material already somewhat dated when the show premiered in 1953, Griffin flounders — and, finally, founders.\n\nMuch of the trouble lies with the queasy design. One lyric cries, “Don’t underestimate Baghdad!”, but Griffin and designer Ultz have omitted the expected Arabian Nights fantasy treatment.\n\nIn its place comes a hyper-stylized, Pierre-et-Gilles-type production. Ultz’s sets revisit the antique staging notion of clumsy front-cloth scenes. Behind them are a succession of stage-wide flats with Moorish cut-outs, large-scale toy town shapes and super-saturated colors — think raspberry and lime.\n\nA few undulating female dancers in scanty, pastel-colored costumes and “come hither” smiles are seen, but most of the cast members wear realistic Muslim robes and colors appropriate to the 11th century setting. The result instead of depicting a colorful bazaar, is just plain bizarre.\n\nThe plot about a lucky poet (Michael Ball) who’s mistaken for a wizard, and his lovely daughter (Tynan) makes most operetta look like Bertolt Brecht, so trying for moments of cultural authenticity verges on the preposterous. To describe the resultant clash as uncomfortable is an understatement.\n\nAs the poet, Ball sings lustily but attacks his dialogue like an over-eager children’s TV presenter. His lack of connection with the other actors leaves even the wasted Faith Prince as Lalume stranded.\n\nYet even Ball shouldn’t have to submit to this staging of his kidnapping –where a black bag is pulled over his head and he is dragged off stage. Post-Abu Ghraib, you don’t have to be obsessively politically correct to regard the scene as miscalculated.\n\nBut the major problem here is lack of atmosphere. Comic scenes and dance numbers are staged in vast spaces but, dismayingly, the temperature at the end of each one is exactly the same as when they started.\n\n“Kismet” is rarely revived because of its book. English National Opera originally made a rash announcement the book would be rewritten, a notion roundly rejected by copyright holders. At which point, ENO should have reconsidered the project. Either that, or it should have been staged as a concert, preferably with another conductor to make the Broadway score sound less stiff than it does under Richard Hickox’s baton.\n\nIn its current form — with new prologue and minor excisions — “Kismet” should play out its 18-performance run. But if anyone even hints at reviving it in the future, they should be boiled in oil.",
  "contentMismatchNote": "Wrong content detected by audit - fullText is about different show"
}
