{
  "showId": "on-the-town-2014",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "Frank Scheck",
  "url": "http://www.hollywoodreporter.com/review/misty-copeland-town-theater-review-817876",
  "publishDate": null,
  "fullText": "The bubbly Broadway revival of On the Town, the 1944 musical by Leonard Bernstein, Betty Comden and Adolph Green, has received a shot of publicity adrenaline with the late-in-the-game addition of Misty Copeland in one of its central roles. Performing for the final two weeks of the critically adored, Tony-nominated show’s year-long run, the first African-American principal dancer in the history of the American Ballet Theatre should produce a significant box-office uptick for the production, which never quite managed to attain hit status in the cavernous Lyric Theatre.\n\nCopeland, who’s written a bestselling memoir and has been the subject of countless fawning profiles in magazines, newspapers and television, plays Ivy Smith, or “Miss Turnstiles.” She’s the dream girl ardently pursued by Gabey (Tony Yazbeck), one of the trio of sailors hellbent on mining the romantic possibilities of their 24-hour leave in the city so memorably described as “a helluva town” in the musical’s signature number, “New York, New York.”\n\nRead More ‘Hamlet’: Theater Review\n\nIt’s at once a canny and daring career move by the 32-year-old dancer, who’s never sung or even spoken onstage before. But it clearly seems to be paying off, as evidenced by the rapturous response she received from the audience at her first performance Tuesday night. Her predecessor in the role was yet another dance star making her Broadway debut, Megan Fairchild, a New York City Ballet principal dancer.\n\nAlthough Copeland’s acting is stilted and her singing ability very modest, she acquits herself nicely in the role. She has a natural star quality accentuated by her striking beauty and all-American sex appeal, and her dancing, not surprisingly, is sublime. The part is small enough that her lack of acting experience doesn’t weigh too heavily, and her lithe physicality is gorgeously illustrated in several dance numbers, especially the dazzling second act “Pas de Deux” performed with Yazbeck.\n\nRead More Kevin Bacon to Star in Stage Version of ‘Rear Window’\n\nThe rest of the original ensemble — including Jay Armstrong Johnson and Clyde Alves as the other sailors, and Alysha Umphress and Elizabeth Stanley as their respective paramours — remains intact. If their comic performances seem to have broadened since the show opened last October, it may well be the result of having to play to the rafters of the massive theater, which was never a good fit for the relatively intimate musical.\n\nAlthough Copeland, who’s scheduled to resume her ABT duties as soon as the show ends its run on Sept. 6, professes to be fully committed to her dance career, her brief stint in this show is a good indicator that she’ll be able to segue later into other acting parts. While a future Oscar nomination (a la Mikhail Baryshnikov in The Turning Point) is unlikely, it seems a good bet that we’ll see more of her onstage and onscreen. Perhaps a remake of The Red Shoes?",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Although Copeland's acting is stilted and her singing ability very modest, she acquits herself nicely in the role. She has a natural star quality accentuated by her striking beauty and all-American sex appeal, and her dancing, not surprisingly, is sublime. The part is small enough that her lack of acting experience doesn't weigh too heavily, and her lithe physicality is gorgeously illustrated in several dance numbers.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 481,
  "archivePath": "data/archives/reviews/on-the-town-2014/hollywood-reporter--frank-scheck_2026-02-07.html",
  "textFetchedAt": "2026-02-07T14:45:46.809Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 481,
  "tierReason": "Full review text"
}