{
  "showId": "on-the-town-2014",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/on-the-town-review-a-good-humored-frolic-1.9507620",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/on-the-town-review-a-good-humored-frolic-1.9507620",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Front row from left, Clyde Alves, Tony Yazbeck and Jay Armstrong Johnson during a performance of \"On the Town,\" in Manhattan. Photo Credit: AP / Joan Marcus\n\nFor reasons unknown, Broadway's latest revival of \"On the Town\" begins with the audience asked to stand and sing \"The Star Spangled Banner\" at a huge American-flag curtain. And, since we know that the 1944 sailors-in-New York musical-comedy classic is neither a show about baseball nor a patriotic anthem, we gird ourselves for some heavy-handed manipulation of a sweetly unassuming show with champion credentials.\n\nBut nothing of the sort happens in director John Rando's altogether loving, good-humored, skimpy-looking but imaginative frolic.\n\nIf anything, despite that bizarre start, we miss the shadow of World War II that surely must hover over young men on their last 24-hour shore leave before shipping out. Instead, this just is a breezy, peppy, pleasantly libidinous valentine to New York-New York that respects Leonard Bernstein's jazzy brainy score with a lush 28-piece orchestra.\n\nThe cast, except for Jackie Hoffman overdoing four comic cameos, doesn't hit the sly jokes by Betty Comden and Adolph Green too hard. And the big ensemble, led by the amiable if slightly bland Tony Yazbeck as sailor Gabey, makes the huge Lyric Theatre (Spider-Man's former home) feel almost homey.\n\nThe big hurtle with the dance-driven show has always been the choreography, made iconic by Jerome Robbins on an idea he first explored in his more wistful and beautifully distilled 25-minute ballet, \"Fancy Free.\" Joshua Bergasse, choreographer of NBC's \"Smash\" in his Broadway debut, defines characters persuasively in classic, jazz and comic movement and, though the two big ballet scenes don't build into more than serviceable pastiche, the dancers are attractive and strong.\n\nThe most daring delights come from Megan Fairchild, on leave from the New York City Ballet. She plays Miss Turnstile, the subway's monthly ingénue, whose poster makes Gabey obsessed with finding her. Although Fairchild has a little peep of a voice, she has a robust sweetness and unspools her scenes with fearless daring and confidence.\n\nRando (\"Urinetown\") doesn't delineate Gabey's two pals (Clyde Alves and Jay Armstrong Johnson) enough. But Alysha Umphress has amusing dignity as the lusty taxi driver and Elizabeth Stanley even handles the operetta demands as the sex-craved anthropologist.\n\nBeouwulf Boritt's projections make us feel as if we're zipping around town but his blue and magenta cardboard sets, despite much imagination, don't make the stage feel full. \"On the Town\" never was one of the great musicals or an urgently needed revival, but it needs a throat-catching sense of the world outside to make it more than diverting.\n\nWHERE Lyric Theatre, 213 W. 42nd St.\n\nINFO $37-$137.50; 877-250-2929; onthetownbroadway.com\n\nBOTTOM LINE Bright revival needs dark shadings.\n\nWe're revamping our Comments section. Learn more and share your input.\n\nBaldwin said he was done playing Trump. Here's why he's still going.\n \n \n \n \n \n \n \n \n \n \n 'Catherine the Great': Mirren can't save tepid tale\n \n \n \n \n \n \n \n \n \n \n Nickelodeon to air live 'SpongeBob Musical'\n \n \n \n \n \n \n \n \n \n \n CBS signs Stephen Colbert to 3-year extension\n \n \n \n \n \n \n \n \n \n \n LI salon to be focus of new TLC reality series\n \n \n \n \n \n \n \n \n \n \n 'Living with Yourself': Paul Rudd is terrific in dual role\n \n \n \n \n Didn’t find what you were looking for?\n Try our new Search",
  "isFullReview": true,
  "textWordCount": 531,
  "archivePath": "data/archives/reviews/on-the-town-2014/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:05:55.151Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20191022160217",
  "archiveOrgUrl": "http://web.archive.org/web/20191022160217/https://www.newsday.com/entertainment/theater/on-the-town-review-a-good-humored-frolic-1.9507620",
  "contentTier": "complete",
  "wordCount": 531,
  "tierReason": "Full review text"
}