{
  "showId": "on-the-town-2014",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "http://newyorktheater.me/2014/10/16/on-the-town-broadway-review-sex-and-art-do-mix/",
  "publishDate": null,
  "fullText": "The audience at “On The Town,” the thrilling Broadway revival of the 1944 musical that brought us “New York, New York, it’s a helluva town,” doesn’t wait until the end to give a standing ovation. They stand before the show begins. That’s because, before the curtain rises on the story about three sailors meeting three dames while on shore leave for 24 hours in New York City, a 28-piece orchestra plays the national anthem in front of a curtain festooned with a giant American flag — one with just 48 stars. This is how the original musical started, during wartime, a show that marked the Broadway debuts of four now-legendary musical theater artists – composer Leonard Bernstein, choreographer Jerome Robbins and book writers Betty Comden and Adolph Green. If “On The Town” does not hold the kind of sacred place as the flag or the Star-Spangled Banner, it is part of its own American tradition – an early American musical comedy classic: The show opened on Broadway just a year after Oklahoma and six years before Guys and Dolls. Not every production has been able to rekindle the original excited reaction to this savvy mix of silken song, dazzling dance and silly story – high-brow art in a pas de deux with middle-brow entertainment. This fourth Broadway production does. There is no wholesale updating of the material a la It’s Only A Play (The 1949 film of “On The Town” with Gene Kelly and Frank Sinatra was significantly altered from the stage show, including the elimination of much of Bernstein’s luscious bluesy, brassy score.) But director John Rando (Urinetown, A Christmas Story) stamps it with his own brand of cheerful vulgarity, with the help of two writers (Jonathan Tolins and Robert Cary), given credit for “additional material.” Choreographer Joshua Bergasse, making his Broadway debut, pays tribute to the airy jazz-inflected style of Robbins, but turns it more earthy and sensual. “On the Town” was inspired by a ballet, Jerome Robbins’s “Fancy Free.” It should tell you how splendid the dancing that one of the leads, Megan Fairchild, making her Broadway (and theater) debut, is a principal dancer with the New York City Ballet. Fairchild plays Ivy Smith, a small-town gal herself recently arrived in the big city, who won the title of Miss Turnstiles of June, awarded by the New York Subway System. The three sailors spot the poster for Miss Turnstiles in the subway, shortly after descending from their ship at the Brooklyn Navy Yard. Gaby (Tony Yazbeck) takes one glance and decides this is the girl of his dreams. His two shipmates decide to help him find her, even though Chip (Jay Armstrong Johnson) wants to go sightseeing. But he and Ozzie (Clyde Alves) run into complications. For starters, they are hijacked by sex-starved females — Alysha Umphress as taxi driver Hildy takes on Chip in an aggressive and gymnastic seduction scene in her cab, accompanied by the raunchy “Come Up To My Place” and then the suggestive “I Can Cook Too”; Elizabeth Stanley as an anthropologist as Claire spots Ozzie at the “Museum of Anthropological History” (I guess the Museum of Natural History threatened to sue) mistaking him for a pre-Homo Sapien (a “Pithecanthropus Erectus” which sounds like it should be censored.) But despite this — and her engagement to an upright judge — her nymphomaniac tendencies get the better of her, and they get (and sing) “Carried Away.” We eventually see both Ozzie and Chip in their underwear. (These are not the innocents from the film.) “Sex and art don’t mix,” Madame Dilly, a drunken vocal coach played by Jackie Hoffman, tells Ivy, her student, trying to get her not to go on a date with Gabey. “If they did, I’d have gone straight to the top.” August 6, 2015 Update: The producers have announced that On the Town will play its last performance on September 6, 2015. On the Town At The Lyric Theater Music by Leonard Bernstein; book and lyrics by Betty Comden and Adolph Green, based on an idea by Jerome Robbins Directed by John Rando; choreography by Joshua Burgess; music direction by James Moore; sets and projections by Beowulf Boritt; costumes by Jess Goldstein; lighting by Jason Lyons; sound by Kai Harada; hair design by Leah Loukas; makeup design by Joe Dulude II; associate choreographer, Greg Graham; production stage manager, Bonnie L. Becker; additional material by Robert Cary and Jonathan Tolins; music coordinator, John Miller Cast: Tony Yazbeck (Gabey), Jay Armstrong Johnson (Chip), Clyde Alves (Ozzie), Megan Fairchild (Ivy), Alysha Umphress (Hildy), Elizabeth Stanley (Claire), Michael Rupert (Pitkin), Allison Guinn (Nun/Singer/Lucy Schmeeler), Phillip Boykin (Workman/Miss Turnstiles’ Announcer/Dream Coney Island Master of Ceremonies/Bimmy), Stephen DeRosa (3rd Workman/Bill Poster/Figment/Actor/Nedick’s Attendant/Diamond Eddie’s Master of Ceremonies/Conga Cabana Master of Ceremonies/Conductor) and Ja ckie Hoffman (Little Old Lady/Maude P. Dilly/Diana Dream/Dolores Dolores). Running time: 2 hours 35 minutes including one intermission Tickets: $37 to $150 The Lost Boys Broadway musical: First LookJanuary 24, 2026In \"Broadway\" On The Town with Found, Sting, Emily Dickinson, Leslie Odom Jr. Week in New York TheaterOctober 20, 2014In \"New York Theater Weekly Summary\" Getting A Charge Out of Broadway. Free Summer Stages! The Week in NY TheaterJuly 7, 2015In \"New York Theater\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"If 'On The Town' does not hold the kind of sacred place as the flag or the Star-Spangled Banner, it is part of its own American tradition – an early American musical comedy classic. Not every production has been able to rekindle the original excited reaction to this savvy mix of silken song, dazzling dance and silly story – high-brow art in a pas de deux with middle-brow entertainment. This fourth Broadway production does.\" \n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 870,
  "archivePath": "data/archives/reviews/on-the-town-2014/nyt-theater--jonathan-mandell_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:38:00.198Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 870,
  "tierReason": "Full review text"
}