{
  "showId": "on-the-town-2014",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Gia Kourlas",
  "url": "http://www.nytimes.com/2015/08/27/arts/dance/misty-copeland-makes-her-broadway-debut-in-on-the-town.html?_r=0",
  "publishDate": null,
  "fullText": "Asking this seemingly innocent question was Misty Copeland, making her debut as Ivy Smith in the Broadway musical “On the Town” on Tuesday. Ivy had just been named Miss Turnstiles.\n\nThe crowd whooped and roared, though it was pretty clear that the enthusiasm had little to do with a pageant to choose the subway poster girl. This summer, Ms. Copeland became the first African-American female principal of American Ballet Theater. Her fame is remarkable. At the show’s conclusion on Tuesday night, photographers and camera operators rushed to the edge of the stage. During curtain calls, Robin Roberts, the television broadcaster, presented her with flowers. And Ms. Copeland was worthy of the scene: Her Ivy was terrific. She also may want to consider wearing the musical’s 1940s-style clothing in her everyday life. It’s her silhouette. Before John Rando’s production of “On the Town” closes at the Lyric Theater on Sept. 6, audiences will have been treated to two new interpretations of Ivy Smith, the seeming girl-next-door who really spends her nights as a cooch dancer in Coney Island. Previously, Georgina Pazcoguin, a soloist at New York City Ballet, took over the part, choreographed by Joshua Bergasse and originated by her fellow company member, the stellar Megan Fairchild, for a limited run.\n\nOn Aug. 18, Ms. Pazcoguin’s tour de force came in the second act dream pas de deux, in which Ivy finds herself in a boxing ring with Gabey, played by Tony Yazbeck, whose superb partnering allowed Ms. Pazcoguin to do what she does best: move like a flame. She’s not the kind of dancer to linger in a pose; at City Ballet, many of her finest roles are in Jerome Robbins’s ballets. (“On the Town” is based on “Fancy Free,” which Robbins created for Ballet Theater in 1944.) Her Anita in “West Side Story Suite” is a dazzling mix of finesse and fury.\n\nIn the pas de deux, Ms. Pazcoguin, even in an unbecoming red wig, transported the choreography to a primal, sensuous place as she whipped across the stage in thrilling chaîné turns and landed in Mr. Yazbeck’s arms so suddenly that you thought, where was the leap? She was less convincing in scenes requiring a touch of innocence, and the acrobatic partnering of the Miss Turnstiles dance eluded her, showing that Mr. Bergasse’s athletic, robust choreography is harder than it appears. If not seamless, it can look like an obstacle course.\n\nMs. Copeland, perhaps because she holds her body more rigidly, triumphed in that opening Miss Turnstiles number, in which football players toss Ivy overhead as her legs open in a straddle. (If only it had been danced on point instead of in soft slippers!) Drawing on her own formidable power as the male ensemble manipulated her through a tangle of overhead flips and hand-to-hand walks, Ms. Copeland, with sweet humor, sailed through them and landed on their shoulders with her arms raised in victory. This was her number; she owned it.\n\nIn ballet, Ms. Copeland is rarely so voluptuous a mover; technique aside, what you yearn for is more expansiveness in her dancing. All the while, she is a fine dancer-actress, as proved last spring at Ballet Theater by her affecting Cowgirl in Agnes de Mille’s “Rodeo.” Ms. Copeland’s singing voice may be flat, but this is a dancing role, and her Ivy has vulnerability and moxie.\n\nShe lit up the stage of the Lyric Theater — enough to make you wonder: Is Ms. Copeland’s home on Broadway? Here, she finally looked like a star, more fresh and free than she’s appeared in ages.\n\n“On the Town” continues performances through Sept. 6 at the Lyric Theater, Manhattan; 212-307-4100, onthetownbroadway.com.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Her Ivy was terrific...Ms. Copeland’s singing voice may be flat, but this is a dancing role, and her Ivy has vulnerability and moxie. She lit up the stage of the Lyric Theater — enough to make you wonder: Is Ms. Copeland’s home on Broadway? Here, she finally looked like a star, more fresh and free than she’s appeared in ages.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 612,
  "archivePath": "data/archives/reviews/on-the-town-2014/nytimes--gia-kourlas_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:42:39.368Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 612,
  "tierReason": "Full review text"
}