{
  "showId": "on-the-town-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "http://www.nytimes.com/2014/10/17/theater/in-on-the-town-the-city-is-candy-colored-heaven.html?partner=rss&emc=rss&_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup",
    "playbill-verdict"
  ],
  "bwwExcerpt": "...this merry mating dance of a musical feels as fresh as first sunlight as it considers the urgent quest of three sailors to find girls and get, uh, lucky before their 24-hour shore leave is over. If there's a leer hovering over 'On the Town,' a seemingly limp 1944 artifact coaxed into pulsing new life by the director John Rando and the choreographer Joshua Bergasse, it's the leer of an angel...Mr. Rando...has a loving affinity for this material that dispels the scent of mothballs...'On the Town' has grown up quite nicely, thank you, with much of its original cast not only intact but also improved. Every element has been heightened in just the right way, a delicate achievement when you consider the heightening that's aspired to...What's surprising is how fluent the entire cast is in both the high and low languages they are required to speak...Throughout the show, which includes the dreamiest dream ballets I've seen in years, Mr. Bergasse...maintains this rare feeling of idiosyncrasy in harmony. Similarly, he's captured the Robbins spirit, but stamped it with his own vivid signature.",
  "bwwScore": 9,
  "contentTier": "needs-rescrape",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ON-THE-TOWN-Opens-on-Broadway-Updating-LIVE-20141016",
  "showScoreExcerpt": "\"And now, a show about sex that you can take the whole family to: the kids, the grandparents, even your sister the nun. That idea may sound kind of creepy, or (worse) dreary. But I assure you that the jubilant revival of “On the Town,” which opened Thursday night at the Lyric Theater, is anything but.\"\n\nRead more",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/10/17/theater/in-on-the-town-the-city-is-candy-colored-heaven.html?partner=rss&emc=rss",
  "fullText": "https://www.nytimes.com/2014/10/17/theater/in-on-the-town-the-city-is-candy-colored-heaven.htmlShare full article53Advertisement\n\nAnd now, a show about sex that you can take the whole family to: the kids, the grandparents, even your sister the nun. That idea may sound kind of creepy, or (worse) dreary. But I assure you that the jubilant revival of “On the Town,” which opened Thursday night at the Lyric Theater, is anything but.\n\nOn the contrary, this merry mating dance of a musical feels as fresh as first sunlight as it considers the urgent quest of three sailors to find girls and get, uh, lucky before their 24-hour shore leave is over. If there’s a leer hovering over “On the Town,” a seemingly limp 1944 artifact coaxed into pulsing new life by the director John Rando and the choreographer Joshua Bergasse, it’s the leer of an angel.\n\nThe best-known song from this show — which has music by Leonard Bernstein, with book and lyrics by Betty Comden and Adolph Green — describes its setting as “a helluva town.” But the town in question — “New York, New York,” if you didn’t know — feels closer to heaven here.\n\nDesigned in a spectrum of jelly-bean hues that makes vintage Technicolor look pallid, this is a parallel-universe New York in which hectic urban life acquires the pace and grace of a storybook ballet. It’s a bustling, jostling cartoon that also floats like a swan. And it feels right that the show’s central object of desire, a subway beauty queen pursued by our leading sailor (the wonderful Tony Yazbeck), is portrayed by a principal dancer from the New York City Ballet, Megan Fairchild.\n\nNew York — I mean the real New York, both back in the day and today — is also a world capital of reinvention, where what was once regarded as terminally passé can surface anew as the hottest, latest thing. “On the Town” has long been looked upon with the amused but distant fondness reserved for fading picture postcards.\n\nHow to wade through the crush of culture coming your way this season? Here’s a guide to 100 events that have us especially excited, in order of appearance.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 377,
  "archivePath": "data/archives/reviews/on-the-town-2014/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T17:29:09.406Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No usable CDX snapshots (all non-200 or non-HTML)"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee auth failed: Monthly API calls limit reached: 1250000"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 377,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T05:16:46.941Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is cut off mid-sentence and ends with technical error messages about JavaScript and access verification, making it impossible to determine the critic's final verdict.; openai: The text appears to be a mix of a review snippet and website navigation or error messages, making it unclear and not scoreable.",
  "promptVersion": "5.2.0"
}
