{
  "showId": "on-the-town-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "http://www.nytimes.com/2014/10/17/theater/in-on-the-town-the-city-is-candy-colored-heaven.html?partner=rss&emc=rss&_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup",
    "playbill-verdict"
  ],
  "bwwExcerpt": "...this merry mating dance of a musical feels as fresh as first sunlight as it considers the urgent quest of three sailors to find girls and get, uh, lucky before their 24-hour shore leave is over. If there's a leer hovering over 'On the Town,' a seemingly limp 1944 artifact coaxed into pulsing new life by the director John Rando and the choreographer Joshua Bergasse, it's the leer of an angel...Mr. Rando...has a loving affinity for this material that dispels the scent of mothballs...'On the Town' has grown up quite nicely, thank you, with much of its original cast not only intact but also improved. Every element has been heightened in just the right way, a delicate achievement when you consider the heightening that's aspired to...What's surprising is how fluent the entire cast is in both the high and low languages they are required to speak...Throughout the show, which includes the dreamiest dream ballets I've seen in years, Mr. Bergasse...maintains this rare feeling of idiosyncrasy in harmony. Similarly, he's captured the Robbins spirit, but stamped it with his own vivid signature.",
  "bwwScore": 9,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ON-THE-TOWN-Opens-on-Broadway-Updating-LIVE-20141016",
  "showScoreExcerpt": "\"And now, a show about sex that you can take the whole family to: the kids, the grandparents, even your sister the nun. That idea may sound kind of creepy, or (worse) dreary. But I assure you that the jubilant revival of “On the Town,” which opened Thursday night at the Lyric Theater, is anything but.\"\n\nRead more",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/10/17/theater/in-on-the-town-the-city-is-candy-colored-heaven.html?partner=rss&emc=rss"
}
