{
  "showId": "sunday-in-the-park-with-george-2017",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://variety.com/2017/legit/reviews/sunday-in-the-park-with-george-review-jake-gyllenhaal-1201993848/",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "A concert staging at City Center last fall of Stephen Sondheim's 1984 Pulitzer Prize-winning musical 'Sunday in the Park With George' went swimmingly, with Jake Gyllenhaal in the titular role of Georges Seurat, raising hopes for an extended engagement. The theater gods heard, and the re-mounted show is back for a commercial run in one of Broadway's historic jewels, the newly restored Hudson Theater. Under the direction of Sarna Lapine, the staging is more theatrically structured than it was at City Center, with its stools and lecterns. But even as retooled, the show retains the quality of serene simplicity that heightens the poignant beauty of the score. Gyllenhaal returns in the leading role, his acting chops intact, but his voice refreshed and enhanced by what must have been professional coaching.",
  "bwwScore": 9,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Jake-Gyllenhaal-and-Annaleigh-Ashford-Open-in-SUNDAY-IN-THE-PARK-WITH-GEORGE-20170223",
  "fullText": "A concert staging at City Center last fall of Stephen Sondheim’s 1984 Pulitzer Prize-winning musical “Sunday in the Park With George” went swimmingly, with Jake Gyllenhaal in the titular role of Georges Seurat, raising hopes for an extended engagement. The theater gods heard, and the re-mounted show is back for a commercial run in one of Broadway’s historic jewels, the newly restored Hudson Theater. Under the direction of Sarna Lapine, the staging is more theatrically structured than it was at City Center, with its stools and lecterns. But even as retooled, the show retains the quality of serene simplicity that heightens the poignant beauty of the score. Gyllenhaal returns in the leading role, his acting chops intact, but his voice refreshed and enhanced by what must have been professional coaching.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Chicago P.D.' Stars Jesse Lee Soffer and Tracy Spiridakos Set to Return for Crossover \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Chicago Fire,’ ‘Med’ and ‘P.D.’ Set Crossover Episodes on NBC in March\n\nGyllenhaal (who previously appeared on Broadway in “Constellations”) passionately commits himself to “Color and Light,” the dazzling number that illustrates the Pointillist painter’s obsessive commitment to his innovative art. Color and light, order and design, composition and symmetry, and a certain ineffable “tone” infuse the song, the show, and Seurat’s art work with those ephemeral qualities that we identify as Beauty.\n\nIn the same vein, “Finishing the Hat” is a testament to the artist’s fanatical devotion to his work. It falls to Annaleigh Ashford, in stunning voice and quite enchanting as Dot, the artist’s long-suffering mistress and model, to put into the words of the title song both the languid pleasure and the creative tension of spending a day of leisure with an obsessive artist like Seurat. If it weren’t for Gyllenhaal’s inherent charm and the affection of Ashford’s doting Dot, the artist’s commitment to his art (“I cannot look up from my pad”) might not compensate for his overwhelming self-absorption.\n\nThe inventive staging reflects both the form and feeling of Seurat’s artistic style. In concert with Beowulf Boritt’s set designs, Tal Yarden’s projections first deconstruct and then re-assemble “A Sunday Afternoon on the Island of La Grande Jatte” from Sondheim’s playful musical portrayals of the mute models captured on the artist’s canvas.\n\nFrom nothing more than painted figures, Sondheim and book writer James Lapine imagine a complex relationship between George and his mistress, most poignantly in “We Do Not Belong Together” and the wrenching “Move On.” The rugged boatman gazing into the water comes alive in Philip Boykin’s boisterous portrayal, as do the two soldiers, the two nursemaids, and the old lady and her caretaker, who all step out of the canvas to share their feelings (in “The Day Off”) about this lovely Sunday in the park.\n\nThere are no little people in this intricate canvas: Robert Sean Leonard cuts an elegant figure as a man about town; Liz McCartney and Brooks Ashmanskas are amusing as a couple with more money than taste; and Penny Fuller makes a feisty old lady. They come and go and, one by one, make themselves at home in Seurat’s mind, as he imagines them on a beautiful Sunday on La Grande Jatte.",
  "isFullReview": true,
  "textWordCount": 527,
  "archivePath": "data/archives/reviews/sunday-in-the-park-with-george-2017/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:52:45.433Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 527,
  "tierReason": "Full review text"
}