{
  "showId": "the-gershwins-porgy-and-bess-2012",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2012/legit/reviews/the-gershwins-porgy-and-bess-1117946878/",
  "publishDate": "January 12, 2012",
  "fullText": "Writer-helmer Destin Daniel Cretton makes a well-crafted feature debut with this slender slice of life about a depressed indie rock up-and-comer's hectic week.\n\nA Sundance prizewinner for 2009 short “Short Term 12,” writer-helmer Destin Daniel Cretton makes a well-crafted feature debut with drama “I Am Not a Hipster.” Slender slice of life about a depressed indie-rock up-and-comer’s hectic week ultimately delivers some emotional heft, but provides a considerable hurdle to viewer engagement in making the central protagonist such a sulky, bitter pill to be around. New director showcases and moderate home-format exposure are signaled.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Chile Selected as Guest Country of Honor at Mexico's Guadalajara Film Festival \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Concourse Media Nabs Costa Rican Drama ‘April’ Ahead of Its Santa Barbara Film Festival World Premiere (EXCLUSIVE)\n\nWe first see Brook Hyde (Dominic Bogart) starting his first club set in a while, only to bail partway through the opening song and retreat to the bathroom for a hurl. Pic then rewinds a week to show him hiding out in his messy apartment, ignoring umpteen phone messages from family members about to visit, as well as anything else that might disturb his funk.\n\nDragged to a local radio by his hyperactive “sorta manager” Clarke (Alvaro Orlando), Brook lackadaisically informs listeners that despite his first album’s success, “It all just seems really stupid to me right now … a waste of energy.” When the gushing interviewer raises the fact that the musician’s mother died two years ago — right about the same time he moved from rural Ohio to San Diego — Brook turns hostile.\n\nIt’s surely not his first tantrum; nor is it his last onscreen one, as the protag is alternately awkward and spiteful toward everyone around him. (The title notwithstanding, he’s the very definition of hipster cliche, being a tortured singer-songwriter insistent that all bystanders feel his pain.) Things brighten with the arrival of his three sisters (Tammy Minoff, Lauren Coleman, Kandis Erickson), an irrespressible trio who force him to have some fun despite himself. He manages to avoid his dad (Michael Harding), who’s come along with them, for a couple days, but when the whole surviving family finally gets together and their purpose in reuniting is revealed, there’s a certain dramatic payoff.\n\nStill, Brook is off-putting company, which seems to be just what Cretton and Bogart have in mind. He childishly creates embarrassing scenes twice when forced to share space with an ex-g.f. and her new beau, ruining pitiful Clarke’s spotlight moment in the process. All Brook has going for him, from the viewer’s standpoint, is talent: The songs featured, penned by San Diego musician Joel P West and nicely sung by Bogart, are agreeable enough if indeed “whiny,” as even the hero admits. A deeper glimpse of the San Diego indie-rock scene around him might have made Brook’s self-absorbed resentment less overbearing.\n\nOther elements are pleasing, with Cretton’s breezy editing highlighting a modest but nimble package.",
  "isFullReview": true,
  "dtliExcerpt": "This production succeeds in making the material more palatable to contemporary audiences without betraying the essential spirit of the original work.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This production succeeds in making the material more palatable to contemporary audiences without betraying the essential spirit of the original work.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 487,
  "archivePath": "data/archives/reviews/the-gershwins-porgy-and-bess-2012/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:52:15.617Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 487,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-04T10:41:10.251Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a film review of 'I Am Not a Hipster', not a Broadway theater review; openai: The text is a review of the film 'I Am Not a Hipster', not a Broadway show.; gemini: This is a review for the film 'I Am Not a Hipster', not a Broadway show.; kimi: This is a film review of 'I Am Not a Hipster' (a 2012 feature film), not a Broadway theater review. The text references Sundance Film Festival, feature debut, cinematic direction, and home-format release.",
  "promptVersion": "5.2.0"
}
