{
  "showId": "home-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2024/06/05/home-is-where-the-art-is-at-roundabout/",
  "publishDate": "2024-06-05T21:26:06",
  "fullText": "A genuine charmer, Home was a glowing highlight of a 1979-80 Broadway season that fielded major dramas such as Betrayal, Talley’s Folly and Children of a Lesser God as well as musical hits like Evita, Barnum and Sugar Babies.\n\nOpening on Wednesday, Roundabout Theatre Company’s revival of Home launches the 2024-2025 Broadway season. Let’s hope most of the incoming shows of the new season look nearly as good as Home.\n\nA three-actor work originally presented by the Negro Ensemble Company, Home may appear small in size but its story expands to reflect significant changes in African-American life during the middle parts of the 20th century.\n\nThe coming-of-age play centers upon Cephus Miles, a cheerful soul who grows up amid North Carolina’s tobacco fields. His adolescence seems mighty nice, featuring fond relatives and pals, fish fries, moonshine making, and hayloft trysts with pretty Pattie Mae. Yet distant voices keep urging Cephus to quit the farm for the big city.\n\nA good farmer, Cephus inherits family acres, but troubles arise. Loved ones pass on, Pattie Mae marries somebody else, and when his draft card for the Vietnam conflict arrives, Cephus objects conscientiously to killing. His farm gets sold for taxes while Cephus is confined in federal prison. Maligned as a coward back home following his release, Cephus runs off to the city.\n\nCephus’ checkered adventures up North and eventual return to the farm – and his realization how society has evolved over the years even down South – are satisfyingly rendered by author Samm-Art Williams. Often spoken directly to the audience by its characters, the dramedy offers an easygoing blend of narrative, rapturous poetry and ever a warm sense of human comedy, all tied up with a surprise that concludes the story with happy laughter.\n\nWith its often poetic language, Williams’ storytelling is so disarmingly intimate that one nearly overlooks how his larger canvas regards the mass migration of Black Americans from the rural South to the urban centers of the North during the last century.\n\nIn their pleasing Broadway debuts, three capable actors better known for their television credits help to make Home an enjoyable place to spend 90 minutes.\n\nA genial Cephus, Tory Kittles (“The Equalizer”) never once leaves the stage and yet credibly depicts this companionable fellow through his times as a hot and bothered teenager to a battered, middle-aged bum to a man secure in his sunset prime, while effectively suggesting the character’s ages and attitudes between those lifetime points.\n\nTwo others lend their gleaming voices and versatile physicality to deliver glimpses of dozens of people who quickly pass in and out of Cephus’ world. Most notably they portray contrasting women: Brittany Inge (“Atlanta”) is a sweetly demure Pattie Mae. Stori Ayers (“The Last O.G.”) is laidback yet hilarious as a hard-hearted big city mama. Every now and again they ardently perform the lovely poetic passages that illuminate the play with a special radiance.\n\nThe single flaw to Roundabout’s nice revival is some questionable pacing by Kenny Leon, the director, whose recent Broadway staging of Purlie Victorious was marred by its headlong speed.\n\nHere, the lyrical opening passages of Home intended to evoke the long ago rural South are nearly lost in the breakneck speed they are spoken. Other poetic sections tend to rush by, too, suggesting that Leon doesn’t trust the audience to appreciate their beauty.\n\nLeon otherwise gives his well-acted production sufficient atmosphere. A longtime collaborator with Leon, the great Allen Lee Hughes expertly designs sunlight and moonlight and passages of time. Simple, painterly settings designed by Arnulfo Maldonado always keep a patch of those homeland fields in view even when Cephus strays far away. Perhaps just as crucial to the production’s impact is how the designer uses simple fabric borders to reduce the expansive size of the proscenium frame of the Todd Haimes Theatre so the actors can commune more closely with the audience.\n\nHome opened June 5, 2024, at the Todd Haimes Theatre and runs through July 21. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "dtli"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "dtliExcerpt": "Here, the lyrical opening passages of Home intended to evoke the long ago rural South are nearly lost in the breakneck speed they are spoken. Other poetic sections tend to rush by, too, suggesting that Leon doesn’t trust the audience to appreciate their beauty.",
  "dtliThumb": "MEH"
}