{
  "showId": "home-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2024/06/05/home-not-always-easy-to-go-back/",
  "publishDate": "2024-06-05T21:27:14",
  "fullText": "Like people, some plays age better than others. More than four decades ago, I loved Samm-Art Williams’ 1979 Home when I first saw its Negro Ensemble Company production and then again when it transferred to Broadway for its Tony-nominated run. The work is now receiving a Broadway revival by the Roundabout Theatre Company in which its charms prove much more elusive. Although difficult to know for sure, I suspect it’s a combination of the play feeling dated and the current production being lacking in certain respects. Or maybe you just can’t go home again.\n\nThe work revolves around Cephus Miles (Tory Kittles, The Equalizer), a young Black farmer living in North Carolina who loves nothing more than working the land — except possibly talking, which he does a lot. Mostly to the audience, as he delivers a robust account of his life’s joys and sorrows, the latter of which come to predominate as his beloved uncle and grandfather, who raised him after he became an orphan, both die, leading Cephus to whimsically conclude that God must be vacationing in Miami. Not long after, he loses his high school sweetheart, Patti Mae Wells (Brittany Inge), when she decides to go to college and winds up marrying another man.\n\nCephus is then drafted to serve in the military in Vietnam, but being opposed to the war for religious reasons, he winds up serving five years in prison as a draft dodger. Upon his release, he heads to the big city where he becomes involved with a not-so-good woman and loses himself to the temporary pleasures of cocaine and Night Train wine. Not to worry, though, as the play ends happily when the older and wiser Cephus eventually finds his way home to his beloved North Carolina and even gets reunited with his beloved Patti Mae.\n\nThe story is touching, but the ritualistic telling proves problematic. It’s done in large part through narration, often delivered in a poetical, incantational style that can be distancing. Not helping matters is the fact that the two female members of the cast, Stori Ayers and Inge, are tasked with playing dozens of characters which makes the already confusing narrative even harder to follow.\n\nKenny Leon’s bare-bones staging fails to deliver much in the way of vibrant theatricality, making the intimate play feel somewhat lost in the Todd Haimes Theatre. There’s not much visual stimulation either, with set designer Arnulfo Maldonado providing little more than backdrops depicting a field of corn and an urban landscape, the latter accompanied by a fire escape. Dede Ayite’s costumes and Allen Lee Hughes’ warm lighting design can’t be faulted, however.\n\nKittles delivers a vibrant, charismatic performance as Cephus, but he doesn’t match the buoyant charm of Charles Brown, the originator of the role. And although Inge is wonderfully endearing as Pattie Mae, she and Ayers are only sporadically effective embodying their multiple characterizations.\n\nThe play’s revival ironically, and sadly, has come to serve as a memorial to its talented playwright, who died at age 78 just days before it went into previews.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial"
}
