{
  "showId": "good-night-and-good-luck-2025",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Good-Night-and-Good-Luck/1291",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Good-Night-and-Good-Luck/1291",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "More importantly, though, it’s a solid evening of theater. Yes, perhaps it’s a less-than-dramatic one -- unless you’ve never seen the movie or don’t know your 1950s history -- but it remains eminently watchable as it recounts Murrow’s crusade to take down Wisconsin’s junior senator, Joseph McCarthy, through his news program 'See It Now.'",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-GOOD-NIGHT-AND-GOOD-LUCK-Brings-George-Clooney-To-Broadway-20250403",
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $176\n Buy Tickets\n\nCititour.com Review\n In a spring theater season already filled with movie stars on stage – Denzel, Jake, Andrew, Kieran – no one quite emits the megawattage of George Clooney. But instead of trying to show his versatility or take on an offbeat project, the beloved star can be found at the Winter Garden in the much-anticipated, crowd-pleasing stage adaptation of his award-winning film “Good Night and Good Luck.”\n\nDirected by the ever-dependable David Cromer, the 100-minute play – co-written by Clooney and Grant Heslov -- proves to be a fine showcase for the Oscar-winning actor, whose undeniable charisma and serious demeanor (with just a slight touch of wryness) are an excellent fit for the role of legendary CBS broadcaster Edward R. Murrow. (In the film, David Strathairn played Murrow, while Clooney played producer Fred Friendly, here embodied by the very fine Glenn Fleshler).\n\nLuckily, as well, the piece provides a much needed (if somewhat heavy-handed) civics lesson perfect for our turbulent times, including a reminder of the need for things like due process, as well as an welcome examination of the power of television to control hearts and minds. \n\nMore importantly, though, it’s a solid evening of theater. Yes, perhaps it’s a less-than-dramatic one -- unless you’ve never seen the movie or don’t know your 1950s history -- but it remains eminently watchable as it recounts Murrow’s crusade to take down Wisconsin’s junior senator, Joseph McCarthy, through his news program “See It Now.” \n\nTold mostly in flashback -- and bookended by parts of a real-life speech Murrow gave in 1958 -- “Good Night and Good Luck” details the period in 1954 when the veteran broadcaster became extremely incensed over McCarthy’s “witch hunt” for communists, especially after it extended to Milo Radulovich, a young Air Force officer who was discharged (without benefit of a trial or evidence) because his father was Serbian. \n\nRisking both the possible wrath of CBS boss William S. Paley (elegantly embodied by Paul Gross) and the definite ire of the sponsors of “See It Now,” Murrow – who also hosts the popular celebrity-driven program “Person to Person” -- nonetheless soldiers on with his mission, perhaps unwilling to see all the possible consequences of his actions.\n\nHe’s aided in his quest by both Friendly and the show’s loyal, hardworking staff, which includes secretly married couple Joe and Shirley Wershba (Carter Hudson and Ilana Glazer), editor Mili Lerner (Jenifer Morris), reporter Palmer Williams (Fran Kranz) and cameraman Charlie Mack (Andrew Polk). Also supporting the team’s efforts is CBS newscaster Don Hollenbeck (a first-rate Clark Gregg), whose support of Murrow caused him to be labeled a communist by the New York newspapers.\n\nAt times, Cromer’s primary job is to play traffic cop, moving the large ensemble around Scott Pask’s remarkable bi-level set. But Cromer is first and foremost an actor’s director, which is one reason why the supporting cast is uniformly good, especially in the show’s many two-person scenes. (Meanwhile, as in the film, all the footage of McCarthy, Radulovich and other real-life figures is from historical archives. Here, they’re displayed in various ways on the stage-filling set, surrounded on both sides by small black-and-white television screens.)\n\nStill, the show’s most memorable performance (aside from Clooney) belongs to jazz singer Georgia Heers as “Ella” (no last name needed?) who brilliantly performs musical standards alongside a live band in a recording studio perched on the upper right side of the set. (Why she is there is never made clear, but I doubt anyone will care!)\n\nYou might need very good luck (and a hefty wallet) to get a seat where you’re up close and personal with Clooney. But I suspect wherever you are inside the Winter Garden, you’ll have a good night.\n By Brian Scott Lipton\n\nVisit the Sitehttps://goodnightgoodluckbroadway.com/Open/Close DatesOpening 4/3/2025Closing Open-ended\nTheatre Info\nWinter Garden Theatre1634 BroadwayNew York, NY 10019 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 696,
  "archivePath": "data/archives/reviews/good-night-and-good-luck-2025/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:46:06.370Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 696,
  "tierReason": "Full review text"
}