{
  "showId": "good-night-and-good-luck-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2025/04/03/good-night-and-good-luck-movie-to-stage-to-video/",
  "publishDate": "2025-04-03T23:57:18",
  "fullText": "One of the main selling points of the current wave of celebrity-driven Broadway dramas is that they give you the opportunity to see your favorite movie and television stars live in the flesh.\n\nPerversely, Good Night, and Good Luck mainly provides the opportunity to see George Clooney onscreen.\n\nThat’s because this stage adaptation of the acclaimed 2005 film — which Clooney directed, co-wrote, and appeared in, although not in the leading role — features so many video close-ups of its star that audiences may feel they’ve wandered into a movie theater by mistake. In the many scenes in which Clooney delivers CBS journalist Edward R. Murrow’s See It Now broadcasts directly to the camera, the actor sits facing away from the audience, often semi-obscured, as we see his face projected on a giant screen. This may provide some comfort to those sitting in the furthest reaches of the Winter Garden Theatre, a venue far too cavernous for this intimate drama, but it also makes you wonder what the point of it all is.\n\nThat’s the question that the show’s creators don’t seem to have fully figured out as well. The film, depicting Murrow’s courageous television battle against Joseph McCarthy, the “junior senator from Wisconsin” (as Murrow repeatedly referred to him) whose government witch hunt against alleged Communists destroyed countless lives, was practically perfect. From its incisive screenplay to its crisp direction to its evocative black & white cinematography to its superb performances, especially by the Oscar-nominated David Strathairn as Murrow, it worked beautifully.\n\nThe stage version, again written by Clooney and Grant Heslov, does nothing to enhance the material. It pretty much replicates the film, up to the point of including several time-filling musical interludes performed by a jazz combo and female vocalist (Imani Rousselle at the reviewed performance). There’s nothing inherently theatrical about it, unless you count the extensive use of video that has become unfortunately common on our stages. But hey, it does have George Clooney, now bumped up to lead after playing the supporting role of Fred Friendly in the movie. (Glenn Flesher has inherited it, and does a terrific job.)\n\nSo how is Clooney, you’re asking, wondering why it took six paragraphs to get to it? He’s fine, especially for someone whose last time performing in an Equity theater, as his charmingly self-effacing Playbill bio informs us, was in June of 1986. (“He has never appeared on Broadway so…buckle up,” we’re warned.) Like so many screen actors, he doesn’t have a particularly compelling stage presence, but he makes up for that with his movie-star looks and charisma. But while comparisons are odious, his performance pales next to Strathairn, who captured Murrow’s looks and voice, not to mention his trademark intensity, with uncanny precision. Clooney does a passable job of imitating Murrow’s distinctive vocal cadences, but that’s about it. It says it all that his most effective moment, namely Murrow’s silent, disgusted reaction after being complimented for a silly interview with Liberace, occurs during a giant video close-up.\n\nWhat was galvanizing onscreen is curiously lifeless onstage, its airless quality not helped by the lackluster staging from the normally superb David Cromer. Despite running a mere 90 intermission-less minutes, the play feels much longer, filled with interminable stretches in which the large cast seems to wander around listlessly on the giant stage doing nothing especially interesting (Scott Pask designed the impressive, multi-layer television studio set).  Such would-be powerful moments as the news of the suicide of a supporting character barely register. And the subplot involving the secret marriage between two CBS employees, while providing some comic relief, feels like filler. Only in the occasional moment, as when Paley asks Murrow about the future ramifications of injecting his personal opinions into his reporting, does the writing feel sufficiently dramatic.\n\nThere are plenty of solid, familiar performers in the large ensemble, including Marvel movie veteran Clark Gregg as Don Hollenbeck, Slings and Arrows’ Paul Gross as William S. Paley (not William F. Paley, as the program has it), Christopher Denham, and Fran Kranz, but none of them has very much to do. The biggest waste is comedian/actress Ilana Glazer (Broad City), woefully underutilized as the secretly married staffer Shirley Wershba.\n\nOf course, the live performers have a lot of competition. They have to vie for attention against the real-life video footage of McCarthy, Milo Radulovich (one of McCarthy’s many victims), Roy Cohn (boo! hiss!), and the Army-McCarthy hearings where McCarthy was publicly shamed by Army lawyer Joseph Welch (“Have you no sense of decency, sir, at long last?”).\n\nThe play ends with Clooney’s Murrow delivering one last address (thankfully, directly to the audience), accompanied by a video montage featuring televised moments from the last 70 or so years. Much of the audience seem knocked out by it, but to me it seemed forced, hammering home the play’s themes with such things as clips from Fox News as if we couldn’t figure out the contemporary parallels ourselves. I mean, If you need footage of Elon Musk delivering the Nazi salute as a mic drop, there might be a problem with the underlying material.\n\nGood Night and Good Luck opened April 3, 2025 at the Winter Garden Theatre and runs through June 8. Tickets and information: goodnightgoodluckbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial"
}
