{
  "showId": "good-night-and-good-luck-2025",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/good-night-and-good-luck-broadway-review-george-clooney",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/good-night-and-good-luck-broadway-review-george-clooney",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Read our review of Good Night, and Good Luck on Broadway, a new play adapted from Clooney's Oscar-nominated 2005 film featuring the actor in his Broadway debut. George Clooney fans who are fond of seeing his face up close on screen will get plenty more of that in Good Night, and Good Luck, a topical yet tepid drama that marks the Oscar-winning star’s Broadway debut. Hair Brylcreemed, chin set, brow furrowed, and voice geared for gravity, Clooney makes a reasonable facsimile of renowned journalist Edward R. Murrow. In the 1950s, the celebrated newsman famously clashed with Senator Joseph McCarthy, challenging the politician’s anti-communist witch hunts. The war of words played out on Murrow’s CBS program See It Now, where he, alongside producer Fred Friendly (Glenn Fleshler) and CBS president William Paley (Paul Gross), exposed McCarthy’s tactics. Murrow’s risky broadcast helped diminish McCarthy’s influence and marked a turning point in television journalism. It’s a provocative slice of history. At the Winter Garden Theatre, the production directed by David Cromer (The Band’s Visit) is earnest and movie-star handsome (thanks to great work by set designer Scott Pask), but unexciting. It simply fails to catch fire, save for all the cigarettes. Both the play and Clooney click most effectively during reenactments of Murrow’s broadcasts, fitting for a drama about a TV showdown. The conclusion of Murrow’s famous 1958 speech about TV news and its responsibility to avoid sensationalism caps the play. The creators can’t resist hammering home how that speaks to today. Expect them to trust the audience to put two and two together on their own? Good luck. The play premiering on Broadway is based on the 2005 movie of the same title written by Grant Heslov and Clooney, who also directed and played Friendly opposite David Strathairn as Murrow on screen. It’s a drama about the power as well as the vulnerability of TV, the news, and the truth. It centers on the ethical struggles and courage of journalists who risked their careers to expose McCarthy’s tactics and how they aimed to uphold journalistic integrity and defend democracy in a time of intense political and social pressure. The play’s focus is squarely on Murrow, but it also includes other journalists whose stories add personal and historical dimensions to the story. They include Palmer Williams (Fran Kranz), whose wife’s link to the Communist Party is a source of anxiety; anchor Don Hellenbeck (Clark Gregg), who faced extreme pressure after the hearings; and Shirley Wershba (Ilana Glazer) and Joe Wershba (Carter Hudson), whose secret marriage ran afoul of CBS’s strict policy prohibiting relationships between employees. In a curious device, a singer and band situated on an elevated side platform periodically performs standards like “When I Fall in Love.” These musical interludes mimic the underscoring in the movie, but they don't enhance the narrative on stage. Good Night, and Good Luck has an audience approval rating of 89% on the review aggregator Show-Score. Read more audience reviews of Good Night, and Good Luck on Show-Score. Despite its flaws, Good Night, and Good Luck is a newsworthy event of the season thanks to George Clooney’s dual role as star and co-writer. Photo credit: Good Night, and Good Luck on Broadway. (Photos by Emilio Madrid) Good Night, and Good Luck is playing at Winter Garden Theatre. The theatre is located at 1634 Broadway (between 50th and 51st Street), New York, 10019. The running time of Good Night, and Good Luck is 1hr 40min. No intermission. See Oscar winner and Tony Award nominee George Clooney in his Broadway debut as famed journalist Edward R. Murrow as he challenges Senator Joe McCarthy. Faced with threats to their careers, Murrow’s team fights for truth. Directed by Tony Award winner David Cromer, Good Night, and Good Luck is a timely, powerful new adaptation. Book tickets for Good Night, and Good Luck on New York Theatre Guide. The recommended age for Good Night, and Good Luck is Ages 13+. Children under 4 years old will not be admitted.. George Clooney and Grant Heslov, who co-wrote the film’s screenplay which earned an Oscar nomination, co-write this Broadway script. David Cromer, who won a Tony Award for directing The Band’s Visit, directs this Broadway premiere. This play is recommended for ages 13 and over. Reviews are not out yet, but the original film garnered six Oscar nominations, and with a starry team like Clooney and Cromer, the show has a lot of momentum and anticipation. Originally published on Apr 3, 202523:59",
  "isFullReview": true,
  "textWordCount": 748,
  "archivePath": "data/archives/reviews/good-night-and-good-luck-2025/nytg--joe-dziemianowicz_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:52:32.748Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 748,
  "tierReason": "Full review text"
}