{
  "showId": "good-night-and-good-luck-2025",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/article/theater-review-george-clooney-good-night-and-good-luck-broadway.html",
  "playbillVerdictUrl": "https://www.vulture.com/article/theater-review-george-clooney-good-night-and-good-luck-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Emilio Madrid\n \n \n \n “You want a cigarette, Fred?” one newsman asks another in the stage adaptation of George Clooney’s 2005 film Good Night, and Good Luck. “No,” Fred replies. “I’ll just breathe the air.”\n\nIn David Cromer’s handsome production, written like the movie by Clooney and Grant Heslov, the whole world is wreathed in smoke. Its protagonist Edward R. Murrow—the real and really heroic midcentury broadcast journalist who combined Jimmy Stewart levels of integrity with Gregory Peck straightness of spine—is never without his trademark Camel, all the way up to the silent “2… 1…” mouthed just before his CBS show goes live. “Every time you light a cigarette for me, I know you’re lying,” he quips at his co-producer Fred Friendly (Clooney’s role in the film, here played by Glenn Fleshler as Clooney graduates to Murrow himself). But the haze isn’t just a period detail, a complement to the rolling lights and ribbon mics of Scott Pask’s meticulously researched set, and the spot-on profusion of pencil skirts and pinstripes in which Brenda Abbandandolo has costumed the cast. (The production’s palette is perhaps its purest triumph: a gorgeous sepia-to-gold-leaning universe, evoking cinematic black-and-white while infusing it with a warm pulse.) The smoke, though, means more. Murrow and his newsroom are reporting from the height of McCarthy’s Red Scare, and the “junior senator from Wisconsin,” as the journalist always calls him, has cloaked the country in his own murk of suspicion and fear. “We’re gonna go with the story,” Murrow tells his staff as they debate whether to take on the senator head-on, “because the terror is right here in this room.”\n\nAs Cory Booker breaks the senate speaking record with a broad indictment of our hate-mongering, self-enriching president, there’s undeniably something bracing about Clooney’s revisitation of Murrow’s story — and something wrenching, too. “We will not walk in fear of one another,” says Clooney gravely into one of the set’s many cameras, and it’s easy to see why an actor would thrill at the chance to ventriloquize Murrow’s own extraordinary words. “We will not be driven by fear into an age of unreason.” Later on, the suppressed mournfulness in his tone, at once composed and adamant, becomes more audible: “If we go on as we are, then history will take its revenge, and retribution will not limp in catching up with us.” In the controlled conviction of Clooney’s delivery, Murrow starts to sound like a Cassandra, a truth-teller whose greatest victory—McCarthy was censured by the senate in December 1954, and Murrow’s reporting helped break his reign of terror—was followed by his own diminution. In 1955, CBS moved Murrow’s groundbreaking program “See It Now” to a sleepy Sunday-afternoon slot and slashed the number of its broadcasts. Ten years later, Murrow was dead of lung cancer at 57. Six decades after that, here we all are, thrashing in the bloody maw of an age of unreason.\n\nThere is, however, an ebb and flow to witnessing Good Night, and Good Luck on stage, as the potency of its content only intermittently melds with the capacities of its form. The play has a beautiful opening, in which a singer played by Georgia Heers appears in a hazy cone of half-light behind a golden curtain. Statuesque in emerald green, she sings “When I Fall in Love,” backed by a jazz band that nestles into the set’s upper level and functions as in-studio musicians for CBS. Heers’s voice is velvet, and Cromer’s stage picture yearns and glows. As Clooney advances in silhouette in front of the curtain to speak to us for the first time “about what is happening in our mass media,” the perfume of the era’s dissonance suffuses the space: the glamor and what it masks, the romantic melody and the bassline of greed, bigotry, and cruelty thudding away underneath.\n\nIt’s quite a beginning, but then that curtain rises, and as lovingly detailed as Pask’s newsroom set is, Cromer has to enliven a still highly cinematic script in a wide-open theatrical space; the result is that Good Night almost immediately starts to diffuse. Take an early scene between Joe Wershba (Carter Hudson) and his wife Shirley (Ilana Glazer), who both work on Murrow’s team, thinking their relationship remains a secret: In a private corner of the office, Joe shows Shirley a loyalty oath everyone at the network has been asked to sign. “You promise to be a loyal American,” reads Shirley, unnerved. “Who are you promising this to?” It’s a chilling scene and a significant setter of tone — or, it should be. But while the movie’s Joe and Shirley, played by Robert Downey Jr. and Patricia Clarkson, got to huddle in a camera’s close-up and whisper to each other, Hudson and Glazer have to try to evoke that same tucked-away urgency from a spot on the stage where our focus isn’t being particularly drawn. The whole sweep of the newsroom is always in Cromer’s frame — very seldom does he tighten his lens in order to ping our attention and energy around to space with a more intensified sense of target. He trusts his actors to pull us to them, which works in some cases but not all. Paul Gross is a highlight as CBS’s cagey chief, Bill Paley, but Hudson and Glazer can’t hook us, and Glazer in particular struggles to find definition for Shirley. The script gives her plenty of smart, Myrna Loy–style barbs, but she’s finding no zing in their deployment. It’s a shame to see the obviously gutsy and gifted creator of Broad City come across so flat, and I wished that Cromer had helped her more confidently navigate the leap from screen to stage.\n\nMeanwhile, there are brilliant theater actors like Will Dagger (playing Don Hewitt, “See It Now”’s stressed-out director) getting a little lost in the swirl of Camels and khakis. He pops out now and then, delightful as always, but as in a Shakespeare history play, it can be tricky for all the guys in the army to distinguish themselves. It’s another challenge that’s neatly eliminated by the movie form and its ability to dive into faces and tiny definitive moments, but the stage needs more investment in the body. Tension and attention are differently martialled, differently maintained, and here, neither feels as dialed up as it might. It may be a question of Cromer’s natural inclinations — watching Good Night, I often found myself thinking back to his last translation from film, the beautifully underplayed The Band’s Visit, which came to Broadway in 2017. There, a wide playing space where our focus could float, softening in the play’s desert air and in the yearning tenderness of its characters, felt exactly right, and Cromer could conduct with more breath, subtle poignancy, and looseness of grip. Not that a show as concerned with integrity as Good Night, and Good Luck wants the superficial pulse of a thriller, but still, there’s something a touch too shaggy in its current theatricality to keep us consistently attuned to its turns and its stakes.\n\nBecause those stakes, as we’re all too painfully aware 60 years down the road from Edward R. Murrow, are deadly and only getting deadlier. And to his credit, Clooney—probably the closest thing contemporary Hollywood has to a Cary Grant and a natural descendent of those pre-Technicolor idols—carries this sense of responsibility onto the stage. He’s not exactly dazzling, but that’s not the point: Murrow’s charisma lay in his gravity, his wry composure and his absolute refusal to break under pressure. Clooney has that solidity and resolve, and I suspect his sense of theatrical ease and breadth will only grow. Movie star he may be, and flashy ticket Good Night, and Good Luck is, but there’s no arguing with his or the project’s sincerity, even its sense of duty. Once again channelling Murrow’s real words near the play’s end, Clooney speaks not only of television and news media, but of theater, of all the informative, entertaining, and communicative arts: “These instruments can teach, they can illuminate; yes, and they can even inspire,” he says. “But they can do so only to the extent that humans are determined to use them to those ends. Otherwise, they are merely wires and lights in a box.” It’s a relatively easy thing for the mega-famous to walk onto a Broadway stage; what they choose to invest themselves in while they’re there is its own question. With Good Night, and Good Luck, Clooney and his collaborators give a dignified and resonant answer.\n\nGood Night, and Good Luck is at the Winter Garden Theatre.\n\nShow \n \n \n Leave a Comment\n \n\n This I Believe: George Clooney in Good Night, and Good Luck\n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1468,
  "archivePath": "data/archives/reviews/good-night-and-good-luck-2025/vulture--sara-holdren_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:53:05.919Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250404051814",
  "archiveOrgUrl": "http://web.archive.org/web/20250404051814/https://www.vulture.com/article/theater-review-george-clooney-good-night-and-good-luck-broadway.html",
  "contentTier": "complete",
  "wordCount": 1468,
  "tierReason": "Full review text"
}