{
  "showId": "whos-afraid-of-virginia-woolf-2020",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Peter Debruge",
  "url": "https://variety.com/2022/legit/reviews/edward-albee-whos-afraid-of-virginia-woolf-review-calista-flockhart-zachary-quinto-1235257488/",
  "playbillVerdictUrl": "https://variety.com/2022/legit/reviews/edward-albee-whos-afraid-of-virginia-woolf-review-calista-flockhart-zachary-quinto-1235257488/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The trick of stage acting comes in playing the same thing every night as if it were happening for the first time, right there in front of the audience's eyes. But once-controversial American classic \"Who's Afraid of Virginia Woolf?\" calls for something different. Edward Albee wrote a play in which we get to observe the latest round in a cruel and competitive game of escalating insults between career-stalled history professor George and Martha, the wife who makes vicious sport of her disappointment. In the gnarly \"Groundhog Day\" nightmare that is their marriage, the trick is to distinguish those moves that rupture the routine — which is precisely how director Gordon Greenberg approaches the boozy battle royale in a 60th-anniversary production for the Geffen Playhouse featuring Zachary Quinto and Calista Flockhart.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Real Housewives of New York' Alums Including Luann de Lesseps, Jill Zarin and Ramona Singer to Star in New E! Reality Series Set in Florida \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Lisa Rinna Says 'Karma Is Coming' for Rob on 'The Traitors,' Addresses Controversial Colton Underwood Comment: 'He Wanted a Housewife, So I Gave Him a Housewife'\n\nA play of this magnitude calls for two titans in the lead roles, not a couple of yesterday's-news TV stars. Who didn't love Flockhart on \"Ally McBeal\" back in the day, or Quinto on \"Heroes\"? But are they really up to the task? One can easily be excused for lowering one's expectations at the prospect of these two trying to fill the shoes of Uta Hagen and Arthur Hill, Elizabeth Taylor and Richard Burton, Kathleen Turner and Bill Irwin. A 2020 Broadway production featuring Rupert Everett and Laurie Metcalf was in previews when the pandemic hit, but the Geffen likes to give small-screen thesps a shot at Serious Theatah.\n\nAt first, this latest pairing doesn't seem likely to yield any fresh revelations to such a familiar play, only to surprise as the duo offer their own take on these two characters — who share the names of America's first first couple, the Washingtons. Quinto makes for a solid, relatively stolid George. Though described in the dialogue as weighing 108 pounds, Martha is nearly always played by a larger, more physically dominant performer, a \"maneater.\" Brittle looking but titanium strong, Flockhart's not the same physical type at all, even if there's never a moment's doubt when she's on stage that this formidable woman could devour any of her co-stars. With an Aqua Net-stiff, late-career-Marilyn 'do and impossible-to-pinpoint enhancements to her face, her Martha reads as a woman who still wants to be desired, which adds another dimension to the dynamic.\n\nThis three-hour emotional marathon takes place in the wee hours of a Saturday night into Sunday morning, following another of Martha's father-the-university-president's faculty parties. (The title, sung to the tune of \"Who's Afraid of the Big Bad Wolf,\" is a reference to a play-on-words heard earlier that night.) It's 23 years into George and Martha's minefield marriage, and passion has long since cooled into contempt. At daddy's suggestion, Martha has invited over a younger couple, new-to-campus/fresh-meat biology professor Nick (Graham Phillips) and his lightweight wife Honey (Aimee Carrero), who will serve as a fresh audience and instrument of jealousy, while the four of them knock back enough liquor to tranquilize a T. rex.\n\nTipsy bickering escalates into brutal combat as the evening wears on. George and Martha have been at it even before they step on stage, but the \"braying\" George accuses her of isn't quite as abrasive coming from Flockhart. It's too easy to make Martha into a villain (she cuckolds her husband midway through the play), but there's more to her here. To compare, I tracked down a vinyl recording of the Broadway cast from 1963, in which Hagen swings the battleax persona with all her might. It's a blast to see it played so explosively, but so too is watching Flockhart's Martha — an academic's daughter and an academic's wife, stuck in an Ivy League prison with no outlet for her intellect — alternate between passive-aggressive and claws-out attack modes.\n\nThe mystery of this play has always been what this couple ever saw in each other, especially with such an emasculated George as Quinto embodies (at times, he comes across like a flustered, tweed-suited Alan Rickman). The world is full of couples who feed on conflict — just witness the Johnny Depp/Amber Heard trial for such a case. But in inventing this pair, Albee insured that audiences leave the theater with the assurance that (a) George and Martha really are in love and (b) your own relationship doesn't look half as bad by comparison, no matter how imperfect.\n\nIf every night George and Martha practice the same form of mutual flagellation, then it's an inspired choice to play the text in this competitive spirit, taking literally Martha's unguarded admission that her husband is the only man \"who can keep learning the games we play as quickly as I can change them.\" An early clue comes just before Nick and Honey's arrival, when George makes a balding joke that stops Martha in her tracks. They laugh, and she raises her glass — a toast to a fresh barb, as if this were a tennis match and George had just scored a point.\n\n\"Swampy,\" she calls him — an innovation of her own — while the guests squirm uncomfortably. It's an ugly sport, and as bottles are smashed and unwritten rules betrayed, there's a terrifying sense that things could get ugly, that irreparable damage might be done. The casualty isn't their marriage so much as the one thing that was keeping it together: their imaginary son, who, like their no-holds brawling, Martha has dared to bring into the open. George and Martha may put one another through a version of this abuse every weekend, but there's something different about the night in question. As played, the game now shifts to us, where it's our job to spot (and appreciate) the small and significant ways the couple succeeds in surprising one another.",
  "isFullReview": true,
  "textWordCount": 1004,
  "archivePath": "data/archives/reviews/whos-afraid-of-virginia-woolf-2020/variety--peter-debruge_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:05:32.097Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1004,
  "tierReason": "Full review text"
}