{
  "showId": "waitress-2016",
  "outletId": "boston-arts-diary",
  "outlet": "Boston Arts Diary",
  "criticName": "Unknown",
  "url": "http://bostonartsdiary.com/wordpress/2015/08/waitress/",
  "playbillVerdictUrl": "http://bostonartsdiary.com/wordpress/2015/08/waitress/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "August 20, 2015 by admin 1 Comment Book by Jessie Nelson Music and Lyrics by Sara Bareilles Based upon the motion picture written by Adrienne Shelly Choreography by Chase Brock; Music Supervision by Nadia DiGiallonardo American Repertory Theater Loeb Theater, Harvard University, Cambridge, MA August 2 – September 27, 2015 With Jessie Mueller (Jenna), Eric Anderson (Cal), Keala Settle (Becky), Jeanna de Waal (Dawn), Dakin Matthews (Joe), Joe Tippett (Earl), Drew Gehling (Dr. Pomatter), Jeremy Morse (Ogie), Giana Ribeiro (Lulu), Addison Oken (Lulu), Ensemble: Charity Agnel Dawson, David Jennings, Corey Mach, Ragan Pharris, Cullen R. Titmas, Stephanie Torns The relatively straightforward story embedded in this zippy and entertaining musical demonstrates how much one can pack onstage with relatively little narrative support. Jenna (Jessie Mueller) is a waitress in a diner that specializes in pies and she is a whiz at making them, each named uniquely in a way that reflects her mood and the circumstances of the moment. Her two fellow waitresses, Dawn (Jeanna de Wall) and Becky (Keala Settle), great personal supports to Jenna, also have their challenges and complexities. Dawn is lonely, and with Jenna’s and Becky’s help, manages to get online and start the relationship balls rolling. And Becky seems to carry an angry chip on her shoulder, particularly towards Cal (Eric Anderson) the diner’s surly cook, for unknown reasons. Jenna is in an unhappy marriage with Earl (Joe Tippett), a domineering and distasteful man who she has been with for years but from whom she can’t seem to separate. A pregnancy turns up all of a sudden and an appealing obstetrician, Dr. Pomatter (Drew Gehling) shows up as well, stirring embers that had not seemed to be there before. The amazing thing in this beautifully composed (music and lyrics by Sara Bareilles) and directed (by Diane Paulus) musical is how much gets made out of so little. The simplicity of the setting and the ordinariness of the characters gives this musical an unexpected charm. That it does, like its main character, cook up something delightful out of ordinary ingredients at every turn is what provides its particular magic. The musical numbers are consistently catchy and engaging. What’s Inside and Opening Up are rousing openers which begin with announcing the ingredients of a pie (add two ounces of metaphor and stir), but with a light and rhythmic tone. Bad Idea, another energetic group theme evokes how fulfilling some ethically questionable things turn out to be, gutsily owning up to the rebellious animal within that searches for happiness despite what it knows not to be the straightest path. I Love You Like a Table is a hilariously inane song put forward as a marriage proposal routine with unexpected wildness exhibited by Ogie (Jeremy Morse), who shows up originally as a totally uptight suitor to Dawn and turns out to be something of a wild man. The ingenuity of the stage and set design involves having everything set up as though it were in the diner, with sliding panels that create, along the way, a bus stop, an obstetrician’s office, a kitchen in a home. The excellent live band sits in the back of the stage as though they were stationed at seats in the back of the diner – brilliant. Everything moves along fluidly and the switch of sets is clean and efficient. Jessie Mueller, who won the Tony in 2014 for best lead actress in a musical for her performance in Beautiful: The Carole King Musical, provides an evocative lead as Jenna, embodying this perfectly routine character, in one sense, and giving a great feeling for her exquisite talents in another. Drew Gehling, as the doctor, has a brush of hair that makes him odd and offbeat, and his slight goofiness, making him look like a taller cousin of Muppets Bert and Ernie, is well-suited to this role as a sympathetic and vulnerable romantic counterpart. Jeanna de Waal, as Dawn, the shyly gawky waitress, fills out the requirements nicely, and fits in perfectly with Ogie (Jeremy Morse), the computer date who zooms into her life. And Becky (Keala Settle), the big boisterous but loveable third member of this trio is brassy and sings with a full and rich voice that has its day in You Matter To Me. Dakin Matthews, a well-known character actor, plays the grumpy but loveable Joe here. His scenes with Jenna are spicy but sweet; his addition to the narrative mix is significant. His Take It From An Old Man, sung with an older man’s partial projection is nonetheless delicately affecting. Joe Tippett, as Earl, the far less than noble husband, is believably and forcefully unappealing yet still attractive enough so that one understands how he and Jenna managed to get and stay together. His role is not entirely a caricature of a dismal spouse, and Tippett creates this quite horrific character deftly. In the denouement a couple of partings are undertaken rather abruptly and without enough process and explanation given all that’s happened. There’s some thematic satisfaction in how it all turns out, but not completely. A little more elaboration on that end of the scale would make for a more entirely satisfying story line. Apart from that, author Jessie Nelson, composer and lyricist Sara Bareilles and director Diane Paulus have created an energetically satisfying, funny, and interestingly offbeat show, exhibiting a collective capacity to turn small stuff into something significant and entertaining. Bareilles, a successful singer-songwriter who has never composed a musical before is a total natural. Her lyrics seem effortless but witty and her music is catchy and engaging. Apparently Bareilles started composing the musical with the ballad She Used To Be Mine, sung beautifully by Jessie Mueller as Jenna, framing the theme of self-alienation, and that provided an emotional core which provided impetus for composing the rest of the score. As well, the tone of the romance between Jenna and Dr. Pomatter is consistently light, which is useful for an upbeat musical but weird for a depiction of an encounter between a patient and a doctor. The implication is that he’s a bit goofy and vulnerable and so captivated by love for Jenna that his transgression of professional boundaries should be forgiven. That’s a big gamble to take in this narrative, and though it all sort of gets swept up in the end, a strange feeling lingers, especially because we get the sense, ultimately, that he has not been just to his wife. The wife is not a brutalizer, as is Jenna’s husband Earl, so the doctor’s justification for betraying her, especially with a patient, seems unjustified. And why does it take Jenna so long to get rid of Earl? She gives Earl the boot as soon as Lulu is born, but it all happens so fast and without much process and seems like a facile conclusion to a long build-up. He is obviously a miserable, domineering husband, but he also shows, near the end, an unexpected vulnerability, and the script seems to complicate itself by at once showing that side of him then making Jenna get rid of him finally and mercilessly. It just doesn’t do justice to what makes an effort to show a somewhat more complex relationship. Jenna’s sudden personal conviction about getting rid of him is totally based on becoming a mother and it doesn’t quite wash. It’s far too quick, too easy, and the transition gets expressed through pie-making, which carries impact beforehand but seems like filler at the end. It’s a nice, but facile, ending after all that’s happened, and does not quite answer or explain things. Though it’s great that the show emphasizes the bonds between the fellow waitresses and accentuates the empowerment they mutually enable, a little more deftness with working out the kinks in these plot points about the men would have been welcome. An excellent overview of the show. I agree that the second act feels rushed and needs work especially the hospital scene. Jesse Mueller sings her final song in bed (not a good idea). The most tuneful songs Broadway will get to here in a long time Your email address will not be published. Required fields are marked * Δdocument.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() );",
  "isFullReview": true,
  "textWordCount": 1371,
  "archivePath": "data/archives/reviews/waitress-2016/boston-arts-diary--unknown_2026-02-03.html",
  "textFetchedAt": "2026-02-03T19:23:58.260Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 1371,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-03T20:30:07.382Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production at the American Repertory Theater in Cambridge, MA, not the current Broadway run.; kimi: This review covers the pre-Broadway tryout production at American Repertory Theater in Cambridge, MA (August-September 2015), not the current Broadway run.",
  "promptVersion": "5.2.0"
}
