{
  "showId": "waitress-2016",
  "outletId": "chicagotribune",
  "outlet": "Chicago Tribune",
  "criticName": "Chris Jones",
  "url": "https://www.chicagotribune.com/2025/02/24/review-waitress-at-the-paramount-theatre-is-a-charming-show-with-songs-youll-remember/",
  "publishDate": "April 25, 2016",
  "fullText": "Sara Bareilles, the creator with book writer Jessie Nelson of the 2016 Broadway musical “Waitress” and a star of the most recent Broadway revival of “Into the Woods,” has been one of the best things to happen on Broadway over the past decade. The singer-songwriter creates beautiful, intimate scores, rich in harmonics and pulsing with heart.\n\n“Waitress” starred Chicago’s own Jessie Mueller on Broadway and is now getting its first local production at the ambitious Paramount Theatre in Aurora with Michelle Lauto in the lead role. It’s a delightful piece of material centered on the female experience and based on the 2007 Adrienne Shelly movie. Since 2016, Bareilles songs like “She Used to Be Mine” and “When He Sees Me” have become staples of cabarets, auditions and YouTube videos.\n\n“Waitress” is the rare show about ordinary, working-class Americans in the South. The main character is a server named Jenna who stashes away her tips in the hopes of getting away from her louse of a husband, and moonlights as a baker of the most incredible pies. In the show’s main running gag, she gives all of them names (Betrayed By My Eggs Pie, My Husband is a Jerk Chicken Pot Pie), reflecting what is transpiring within her own life. The show makes much of the community around Jenna in the diner, especially her live-wire fellow servers Dawn (Kelly Felthous) and Becky (Teresa LaGamba) and the diner manager Cal (Jonah Winston), classic sidekicks as the action centers on Jenna’s marriage to the awful Earl (Ian Paul Custer) and her less-than-practical attraction to her married obstetrician Dr. Pomatter (David Moreland). In the original Broadway staging, the band was on stage.\n\nIt’s a formulaic show in some ways. There’s a classic B-plot romance between Dawn and a nerd named Ogie (Jackson Evans) and a grumpy oldster (played by Ron E. Rains) who changes before the final curtain, but it’s charming nonetheless and director Katie Spelman’s Paramount production has a very talented cast.\n\nThe stellar vocal chops of Lauto also are a crucial asset; this star of Chicago musical theater has gone back and forth some between Chicago and New York and it’s always good to see her in a lead role like this one, especially a part that is such a match for her formidable singing ability and a powerful personality that can anchor a show.\n\nLauto plays Jenna as a woman undergoing a traumatic time in her life; her face looks pained and stressed throughout the show, even at the end. That’s a fair take but it comes with some traps because the musical also has to make us believe in Jenna’s own powers of transcendence, her creative potential and humanistic outlook on life has to be visible too. Musicals, especially this one, traffic in hope and self-actualization.\n\nAnd that’s where this production, although entertaining overall, has some issues. It’s way too chilly in some places and way too wacky in others. In the first category, the apartment shared by Jenna and Earl certainly should be an ordinary kind of small-town place but it doesn’t need to look like a scene in a Stephen King novel, as it does here. And, as if to compensate, the comedy often goes over the top: the romance between Jenna and her doctor never feels credible or real, when the show’s dramatic tension actually requires as much.\n\nI think “Waitress” works best in an honest middle-ground. The characters all are based on real, intelligent people, trying to improve their lives and fight back the fear that holds back their ambitions. That’s the essential ingredient in this particular Broadway pie, baked as a blend of life’s ups and downs, smoothing then out into a slice of life that supports people living their dreams and learning to find their best selves.\n\nChris Jones is a Tribune critic.\n\nWhere: Paramount Theatre, 23 E. Galena Blvd., Aurora.\n\nRunning time: 2 hours, 35 minutes\n\nTickets: $35-$85 at 630-896-6666 and paramountaurora.com",
  "isFullReview": true,
  "dtliExcerpt": "Sara Bareilles has written a warm, intimate and highly personal musical score that feels like a departure from the typical Broadway sound, focusing on character and emotion over spectacle.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Mueller's is a performance stripped of condescension, lived in the moment and rich in musical pleasures; surely there is no singing actress of Mueller's generation better able to play a woman of low power and self-esteem....In this show she immediately moves her lips whenever Jenna is asked a question - signaling to the audience that Jenna's main problem is that she worries so much about pleasing others that she never has learned how to put her own needs first. Jenna eventually grabs such an opp",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-WAITRESS-Opens-on-Broadway-All-the-Reviews-20160425",
  "showScoreExcerpt": "Sara Bareilles has written a warm, intimate and highly personal musical score that feels like a departure from the typical Broadway sound, focusing on character and emotion over spectacle.",
  "contentTier": "complete",
  "contentTierReason": "Short text (29 words)",
  "textQuality": "full",
  "previousUrl": "https://www.chicagotribune.com/entertainment/theater/ct-waitress-broadway-review-20160425-column.html",
  "urlDiscoveredAt": "2026-02-03T19:24:53.982Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 659,
  "archivePath": "data/archives/reviews/waitress-2016/chicagotribune--chris-jones_2026-02-03.html",
  "textFetchedAt": "2026-02-03T19:24:53.986Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251221234248",
  "archiveOrgUrl": "http://web.archive.org/web/20251221234248/https://www.chicagotribune.com/2025/02/24/review-waitress-at-the-paramount-theatre-is-a-charming-show-with-songs-youll-remember/",
  "wordCount": 659,
  "tierReason": "Full review text",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2025 outside valid range 2013–2021 for show opening 2016",
  "sources": [
    "web-search",
    "bww-roundup"
  ]
}
