{
  "showId": "waitress-2016",
  "outletId": "npr",
  "outlet": "NPR",
  "criticName": "Andrea Shea",
  "url": "http://www.npr.org/2015/08/19/432724883/waitress-serves-dark-funny-fare-with-a-musical-twist-and-a-side-of-pie",
  "playbillVerdictUrl": "http://www.npr.org/2015/08/19/432724883/waitress-serves-dark-funny-fare-with-a-musical-twist-and-a-side-of-pie",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Waitress tells the story of Jenna (Jessie Mueller), a diner waitress who is stuck in a stifling, abusive marriage and yearns for a better life. Evgenia Eliseeva/Courtesy of The American Repertory Theater hide caption Waitress tells the story of Jenna (Jessie Mueller), a diner waitress who is stuck in a stifling, abusive marriage and yearns for a better life. Tony Award-winning director Diane Paulus has a knack for developing works that make it to Broadway. She premiered Finding Neverland, Pippin and The Gershwins' Porgy and Bess at the American Repertory Theater in Cambridge, Mass., before bringing those productions to Manhattan. Now, Paulus has another potential hit on her hands: her musical adaptation of the 2007 indie film Waitress. (The production is currently in previews at the American Repertory Theater and will head to Broadway next spring.) Paulus didn't see the film when it came out, but a few years ago a couple of big-deal Broadway producers told her Waitress could be great on stage. \"Full confession: The DVD sat on my desk for about a year before I found the time to watch it,\" Paulus says. \"And as soon as I did I knew this show had the heartbeat of a musical.\" Waitress tells the story of Jenna, a woman who works at a diner, is stuck in a stifling, abusive marriage, and yearns for a better life. Then she learns she's pregnant. Paulus says, \"What's riveting to me is this is the story of a waitress struggling with these issues, and yet when I saw the film I thought of all kinds of people I know — girlfriends of mine — who have struggled with the same kinds of issues that this character struggles with.\" The pies Jenna (Jessie Mueller) bakes are a form of therapy and escape from her controlling husband, Earl (Joe Tippett). Evgenia Eliseeva/Courtesy of The American Repertory Theater hide caption The pies Jenna (Jessie Mueller) bakes are a form of therapy and escape from her controlling husband, Earl (Joe Tippett). In the movie, Jenna (played by actress Keri Russell) pours her churning emotions into creatively named pies that she bakes every day for the diner. The pastries are a form of therapy and escape from her controlling husband, Earl (Joe Tippett). The film is dark and funny, and Jenna's character is endearing and complicated. Paulus says, \"For me, that translated into, you know, 'Who the heck can write this score?' \" The theater director found her composer and lyricist outside the musical theater world, in Grammy-nominated singer and songwriter Sara Bareilles. (You might remember her 2007 hit, \"Love Song.\") Paulus asked Bareilles to watch Waitress hoping she'd connect, and she offered this advice, \"Don't worry about: How should this be adapted? What is the outline for the musical? Just go with your heart, your inspiration. See where it takes you.\" Bareilles says that after watching the film, \"The door felt like it opened. I felt like I really began a relationship with this character.\" The first song she wrote, \"She Used To Be Mine,\" is now the centerpiece of the American Repertory Theater's production. In it, Jenna sings: It's not simple to say Most days I don't recognize meThese shoes and this apronThat place and its patronsHave taken more than I gave them. Jessie Mueller, who plays Jenna in the musical, says Bareilles' songs are an important adaptation tool. In the film, she says, Jenna's inner turmoil is captured through intimate camera work. \"You get, you know, a beautiful close-up on Keri Russell's eyes and you know what's going on in her head. Well, you can't do that on stage, but you can have the character sing their inner thoughts.\" The Waitress screen-to-stage recipe has been tweaked over the past two years. Jessie Nelson wrote the dialogue (or book) and says she worked hard to stay true to the film's spirit and also to its creator, Adrienne Shelly. Shelly — who wrote, directed and had a role in Waitress — was murdered in 2006, soon after finishing the film. Eventually her husband reached out to Nelson asking her to look at some of his late wife's unfinished scripts. Nelson became close to the family and says she felt close to Shelly, too, as she adapted the screenplay for the stage. \"And when I was writing, I really carefully went through it and tried to bring her voice into it whenever I could, as if she was another collaborator in the room,\" Nelson says. One of the collaborators on the film, producer Michael Roiff, was good friends with Adrienne Shelly and retained the stage rights for Waitress. He says, \"The hardest thing on this journey for me has been knowing that she's not sitting there next to me. ... But, you know, I just hope she somehow ... knows and is happy about all of it.\" Director Diane Paulus feels like Shelly has been looking over their shoulders throughout the process. \"We always talk about Adrienne's amazing lines and those amazing character, quirky things she put in the screenplay,\" Paulus says. \"And we always have a copy of the screenplay right on the desk in front of us in rehearsal and we're constantly going back. So I feel like she's in the room with us through her words.\" Paulus says she hopes the musical adaptation of Waitress is a fitting — and fun — homage. Support mission-driven journalism while getting something great in return. Enjoy bonus content, early access and sponsor-free listening from your favorite NPR podcasts.",
  "isFullReview": true,
  "textWordCount": 921,
  "archivePath": "data/archives/reviews/waitress-2016/npr--unknown_2026-02-03.html",
  "textFetchedAt": "2026-02-03T19:25:01.301Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 921,
  "tierReason": "Full review text"
}
