{
  "showId": "waitress-2016",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2016/04/25/theater/review-jessie-mueller-serves-a-slice-of-life-with-pie-in-sara-bareilless-waitress.html",
  "publishDate": "April 24, 2016",
  "fullText": "https://www.nytimes.com/2016/04/25/theater/review-jessie-mueller-serves-a-slice-of-life-with-pie-in-sara-bareilless-waitress.htmlShare full article23Advertisement\n\n“Sugar. Butter. Flour.” The words are crooned like a lullaby intermittently throughout the musical “Waitress,” bringing a warm blanket of comfort to the troubled central character, stuck in an unhappy marriage and essentially working two jobs, baking pies for the diner where she also puts on an apron to wait tables.\n\nIn Jessie Mueller, who plays Jenna, that hard-working waitress, this agreeable if unexceptional musical, which opened on Sunday at the Brooks Atkinson Theater, has the kind of vital ingredient any show would benefit from. Ms. Mueller, who won a Tony for her performance in “Beautiful: The Carole King Musical,” possesses a rich, soulful and emotionally translucent voice, and an ability to bring heaping cupfuls of subtext to her acting.\n\nBut as with the unremarkable jukebox musical that brought her Broadway stardom, Ms. Mueller’s talent often outstrips the material she’s given here. So, incidentally, do the gifts of her supporting cast, who provide brightly colored, vibrantly sung performances.\n\nMuch of the score, by the pop singer-songwriter Sara Bareilles, is appealing, drawing on the sounds of country music reflecting the Southern setting, but also containing more traditional Broadway-pop balladry. But the book by Jessie Nelson, based on the movie written and directed by (and co-starring) Adrienne Shelly, tends to flatten most of the characters into comic cartoons. (To be fair, they do not have much more depth in the movie, from which some of the musical’s dialogue is borrowed.)\n\nOnly Jenna seems fully drawn from life, and the emotional arc of her character conforms to familiar stories about oppressed women finding their inner strength. This, of course, is a journey that many women have indeed traveled, and has a built-in (or should I say baked-in?) emotional appeal. Still, “Waitress,” directed by Diane Paulus, taps into its wellsprings of universal feeling with a slick surface professionalism rather than anything approaching real depth.\n\nThe story starts with Jenna facing a life crisis. She discovers she’s pregnant, and doesn’t greet the news with the traditional excitement. This is primarily because her husband, Earl (Nick Cordero, doing what he can with a one-note villain), is a brutish lout who snatches Jenna’s tips as soon as she gets off work, glowering at her if he feels she hasn’t brought home enough. For a while Jenna keeps news of her pregnancy from Earl, hoping she can find some way to wriggle out of her marriage and forge a new life for herself and her child.\n\nAnd in the handsome gynecologist she meets when she eventually must acknowledge that, like it or not, a baby is in her future, Jenna finds a man who is everything Earl is not. As played with endearingly goofy charm by Drew Gehling, Dr. Pomatter is amiable, funny, accomplished and, most of all, understanding. Soon they are, yes, singing a duet, “It Only Takes a Taste,” which prefigures the unlikely affair they impulsively begin.\n\nAmbivalent about this new relationship — and Ms. Mueller does ambivalent beautifully — Jenna draws support from her fellow waitresses in the diner: the gawky, geeky Dawn (Kimiko Glenn) and the brassy, sassy Becky (Keala Settle), two stock characters given some welcome glints of distinctiveness by Ms. Glenn and Ms. Settle. As in musical comedies dating at least to the 1940s, Dawn and Becky embark upon romances that provide comic diversion from the more weighty travails of Jenna.\n\nEncouraged by her co-workers to dip her toe at least into the shallow end of the dating pool, Dawn immediately meets Ogie (Christopher Fitzgerald), who’s instantly smitten. So smitten that he shows up at the diner the morning after their five-minute date and proceeds to vow eternal devotion in an ebullient knee-slapping country number, “Never Ever Getting Rid of Me,” that Mr. Fitzgerald quite simply knocks out of the ballpark. (Lucky Mr. Fitzgerald; but it’s a little unfortunate that this comparatively minor character gets the splashiest and most memorable song in the first act.)\n\nBecky’s marriage is not wholly fulfilling, partly because her significantly older husband is seriously ill. No prizes for guessing where the tart exchanges of insults between Becky and the diner’s manager, Cal (an amusingly gruff Eric Anderson), will eventually lead.\n\nSpeaking of prizes, the other significant subplot in “Waitress” involves Jenna’s secret (from Earl) plan to enter a local baking contest that would, rather implausibly, bring her a $20,000 windfall should she win. Giving her particular encouragement in this is the diner’s owner, Joe, a half-avuncular, half-curmudgeonly (and more than half-clichéd) elder man played with easygoing grace by Dakin Matthews.\n\nMs. Bareilles shows an unexpected flair for comic songs, with that joyous hootenanny for Mr. Fitzgerald; a nervous solo about dating jitters for Ms. Glenn; and a rollicking duet for Jenna and the doctor wittily establishing that they both know that getting together is a “pretty good bad idea.” (Less successful: the awkward “I Love You Like a Table.” Huh?) Ms. Mueller also has a lovely, reflective ballad in the first act that establishes, or rather underscores, the solace Jenna finds in making pies, which allows her to escape the awkward chemistry of her life into the satisfying alchemy of baking.\n\nBut it is when Ms. Mueller tears into the musical’s climactic number, “She Used to Be Mine,” that her talents are most fully and movingly harnessed. In this emotionally intricate song, Jenna looks at herself from the outside, analyzing the conflicts and complexities within her: “She is messy but she’s kind/She is lonely most of the time.” In acknowledging the mistakes she’s made and the regret she’s allowed to puncture her self-esteem, Jenna finds a voice for the nascent, regenerating woman within her.\n\nMs. Mueller’s vibrant performance of this gentle but wrenching song, featuring a melody that soars and then recedes in waves, is the high point of the show — and for that matter a high point of the Broadway season. Suddenly, a pleasant and polished but weightless musical comedy rises to transporting heights, and sweeps up your heart along with it.",
  "isFullReview": true,
  "dtliExcerpt": "Ms. Mueller finds something approaching greatness in transforming an adorable kook into a flesh-and-blood woman discovering her own strength.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Ms. Mueller finds something approaching greatness in transforming an adorable kook into a flesh-and-blood woman discovering her own strength.",
  "contentTier": "complete",
  "contentTierReason": "Short text (19 words)",
  "textQuality": "full",
  "previousUrl": "https://www.nytimes.com/2016/04/25/theater/waitress-review-jessie-mueller-broadway.html",
  "urlDiscoveredAt": "2026-02-03T19:14:18.667Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1000,
  "archivePath": "data/archives/reviews/waitress-2016/nytimes--ben-brantley_2026-02-03.html",
  "textFetchedAt": "2026-02-03T19:14:18.678Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251007094146",
  "archiveOrgUrl": "http://web.archive.org/web/20251007094146/https://www.nytimes.com/2016/04/25/theater/review-jessie-mueller-serves-a-slice-of-life-with-pie-in-sara-bareilless-waitress.html",
  "wordCount": 1000,
  "tierReason": "Full review text"
}