{
  "showId": "waitress-2016",
  "outletId": "theatermania",
  "outlet": "TheaterMania",
  "criticName": "Jesse Green",
  "url": "https://www.theatermania.com/broadway/reviews/waitress_76476.html",
  "publishDate": "April 24, 2016",
  "fullText": "Aaron Posner brings ”The Seagull” into the 21st century.\n\nRarely have the characters of Anton Chekhov felt as alive as they do in Stupid F**king Bird, Aaron Posner's \"sort of\" adaptation of The Seagull at the Pearl Theatre Company. That may seem a little weird, considering that the denizens of the Russian masterpiece are famously \"in mourning\" for their lives. But worry not; the occupants of Posner's vital 2013 comedy are just as exquisitely miserable as Chekhov's. However, unlike the individuals in typical productions of The Seagull, this play's characters speak with a distinctly contemporary tongue.\n\nAn exhilarating deconstruction of the Russian dramatist's masterwork, Stupid F**king Bird not only rebuilds The Seagull for modern-day audiences, but also uses it as a lens to further explore the idea essential to Chekhov's character Konstantin: that in order for something to stay relevant, it needs to break free of its confines and find new methods.\n\nWhich is exactly what Stupid F**cking Bird does. Posner, with director Davis McCallum and an exceptional company headed by Christopher Sears, is creating a new kind of theater, one where the characters are simultaneously \"real\" people living in the world of the play, while also being fully aware that they are performing for an audience. And it's absolutely thrilling.\n\nSears is Conrad, a theater artist with a desperate desire to push the form into the boundaries of the experimental. He chooses to premiere his new \"Site Specific Performance Event\" for the wrong audience, one made up of his impatient movie-star mother, Emma (Bianca Amato), and her lover, the noted writer Doyle Trigorin (Erik Lochtefeld). Conrad falls into despair, compounded by the knowledge that the longtime object of his affection and leading lady, Nina (Marianna McClellan), is much more taken with the older, famous Doyle.\n\nThe Chekovian blueprint is very much intact — characters on the periphery include Mash (Joey Parsons), a cook desperately in love with Con; Con's observant best friend, Dev (Joe Paulik); and Emma's physician brother, Eugene Sorn (Dan Daily) — and the gist of the dialogue is in a similar vein to the original, down to the references to Hamlet.\n\nYet the fourth wall breaks as soon as the actors walk onto a stage that consists of little more than the title printed on a series of interlocking flats (Sandra Goldmark created this universe, which eventually shape-shifts into something more naturalistic). \"The play will begin when someone says 'start the f**king play,'\" Con says to us, adding an unexpected feeling of danger. \"We all see damn near everything you ever do out there, all of you,\" he later rails at us as the lines of performer and spectator are blurred inexorably. His acknowledgement of our existence as we recognize his is what makes Stupid F**king Bird so exciting. It allows the great agonies of the people onstage to feel real and honest in a way that the original rarely does.\n\nMcCallum's vibrant production, with contemporary costumes by Amy Clark and lighting by Mike Inwood that further blurs the lines between \"us\" and \"them,\" is incomparably well cast. Newcomer Sears is fantastically engaging as Con, whose dreams for a new kind of theater echo many of ours. Amato brings an imposing sexiness to the cold and oblivious Emma, while Daily expertly captures the pathos of a man who spent his life not really living. The coquettish McClellan is the Nina of our dreams; she shares a steamy chemistry with Lochtefeld, whose Doyle disarmingly transforms from a seemingly nice guy to a total jerk. Paulik and Parsons complete the ensemble with a sweet and sad air of self-awareness.\n\nIf there's one complaint, it's that Stupid F**king Bird has a tendency to sag in its midsection, the momentum slowed by the appearance of several monologues. But in terms of sheer originality and emotional resonance, this Bird is anything but stupid.\n\nReview: Manon!, Opera’s Have-It-All Girl \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Review: In The Porch on Windy Hill, Bluegrass Heals a Broken Family \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Review: Power Slips Away, One Lear at a Time, in King Lear at La MaMa \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Review: Blackout Songs, When Your Life Is One Long Night Out \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Review: Stories of Childhood Told Through Dance in BLACK GIRL: Linguistic Play \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Review: Every Step Has Meaning in Anne Gridley’s Watch Me Walk \n \n \n \n\n \n\n \n \n\n \n \n\n \n \n \n\n \n \n \n \n\n \n \n \n \n\n \n \n \n \n\n \n \n \n \n\n \n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n Theater News & discounts\n \n Get the best deals and latest updates on theater and shows by signing up for TheaterMania's newsletter today!\n\nBroadway performances start on March 27 at the Majestic Theatre.",
  "isFullReview": true,
  "dtliExcerpt": "Waitress is a sweet slice of Americana that goes down easy, with a terrific performance by Jessie Mueller and a score by Sara Bareilles that's more sophisticated than it first appears.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Waitress is a sweet slice of Americana that goes down easy, with a terrific performance by Jessie Mueller and a score by Sara Bareilles that's more sophisticated than it first appears.",
  "contentTier": "complete",
  "contentTierReason": "Short text (31 words)",
  "textQuality": "truncated",
  "textWordCount": 740,
  "archivePath": "data/archives/reviews/waitress-2016/theatermania--jesse-green_2026-02-03.html",
  "textFetchedAt": "2026-02-03T19:21:44.449Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (503): Request failed with status code 503"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 740,
  "tierReason": "Full review text"
}