{
  "showId": "waitress-2016",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2016/legit/reviews/waitress-review-broadway-musical-1201759570/",
  "publishDate": "April 24, 2016",
  "fullText": "“Waitress” owes its sweetness to the mouth-watering goodness of Jessie Mueller. As a diner waitress named Jenna, Mueller is such a honey bun, she melts us like the mounds of butter that make Jenna’s homemade pies so luscious. The musical resorts to comic overkill to create characters based on Adrienne Shelly’s 2007 indie rom-com. But Sara Bareilles has written a charming score that suits the quirky material and Mueller’s dazzling voice and endearing personality.\n\n“Beautiful” was no fluke. Mueller can really act as well as sing her heart out. She’s enchanting as Jenna, who is stuck in a miserable marriage and working as a waitress in a smalltown diner (Scott Pask executed the sunny design of this 1950s throwback) somewhere down south.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Halle Berry Won an Oscar and Says 'I Was Still Black the Next Morning' With Directors Refusing to Cast Her; She Later Advised Cynthia Erivo That Oscar Wins 'Cannot Be Validation' \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Sinners' Costume Designer Ruth E. Carter Becomes Most-Nominated Black Woman in Oscar History\n\nIn the sweet opening number (“What’s Inside”), Jenna leads the company in illustrating how she bakes her pies — which are loaded with sugar, as well as creative ingredients like bacon and blueberry — and names them for how she’s feeling that day. In “What Baking Can Do,” she goes deeper and reveals how creating new pies helps her get through her unhappy life.\n\nJenna’s only friends are her fellow waitresses, Becky and Dawn (Keala Settle and Kimiko Glenn, nice pipes, but knocking themselves out to be funny). As good friends, they encourage her to enter a pie-baking contest that would win her enough of a nest egg to leave her lazy lug of a husband, Earl. Nick Cordero is stuck in the thankless role of Earl, who is a pure caricature of an insensitive husband — selfish and dreadfully overbearing, but so spineless, he isn’t even abusive.\n\nThe discovery that Jenna is pregnant kills her escape plan. But it does lead to an affair with the new (and happily married) pediatrician, Dr. Pomatter, appealingly shy and awkward in Drew Gehling’s performance. This likeable character returns in Act Two, which is one good reason for sticking it out through Act One, which helmer Diane Paulus, who navigated the show through its development at the American Repertory Theater, unwisely chose to play for broad caricature and slapstick laughs.\n\nThere are good things in the second act, which is more lyrical and less silly. Gehling’s eerily beautiful voice turns his love duet with Mueller (“You Matter to Me”) into a heartbreaker. Dakin Matthews, as the avuncular diner owner who is actually named Joe, steps out and into the audience’s arms with his warm and witty solo, “Take It From an Old Man.” One of the waitresses, Keala Settle’s Becky, stops vamping and gets serious in “I Didn’t Plan It.” And Mueller allows a proud and self-respecting Jenna to claim her independence in “She Used to Be Mine.” It’s a nice moment. Too bad it took so long to get here.",
  "isFullReview": true,
  "dtliExcerpt": "Mueller brings such warmth and vulnerability to Jenna that you can't help rooting for her to find the courage to leave her abusive husband and start a new life with her baby.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mueller brings such warmth and vulnerability to Jenna that you can't help rooting for her to find the courage to leave her abusive husband and start a new life with her baby.",
  "contentTier": "complete",
  "contentTierReason": "Short text (32 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://variety.com/2015/legit/reviews/waitress-review-musical-art-1201573745/",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "previousUrl": "https://variety.com/2016/legit/reviews/waitress-review-broadway-jessie-mueller-1201747953/",
  "urlDiscoveredAt": "2026-02-03T19:16:11.337Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 506,
  "archivePath": "data/archives/reviews/waitress-2016/variety--marilyn-stasio_2026-02-03.html",
  "textFetchedAt": "2026-02-03T19:16:11.343Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Insufficient text: 0 chars"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 506,
  "tierReason": "Full review text"
}