{
  "showId": "straight-white-men-2018",
  "outletId": "newyorker",
  "outlet": "The New Yorker",
  "criticName": "Hilton Als",
  "url": "https://www.newyorker.com/magazine/2018/08/06/the-soullessness-of-straight-white-men",
  "playbillVerdictUrl": "https://www.newyorker.com/magazine/2018/08/06/the-soullessness-of-straight-white-men",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Privacy CenterCurrently, only residents from GDPR countries and certain US states can opt out of Tracking Technologies through our Consent Management Platform. Additional options regarding these technologies may be available on your device, browser, or through industry options like AdChoices. Please see our Privacy Policy for more information.\n\nLee, who usually directs her own works, began putting this piece together in 2014. In the course of her now fifteen-year career, this very special theatre artist has generally worked as follows: She gathers a group of performers and asks a question, like “What is a straight white man?” She then builds a script around the resulting improvisations, shaping the material through readings and workshops. I first saw “Straight White Men” in 2014, when it premièred at the Wexner Center for the Arts, in Ohio. Back then, the work seemed to be the beginning of an interesting idea, if drier and more academic than some of Lee’s other pieces, including the phenomenal “Untitled Feminist Show” (2011), which had the benefit of Lee’s heart. There is no heart in “Straight White Men,” or not much of one, and that’s the fault not of the actors but of Lee’s ambition: she wanted to make a “straight” play and hang with the Broadway boys, without appearing to aspire to anything other than the spectacle’s success.\n\nThe play is framed by two trans people, known as Person in Charge 1 and Person in Charge 2 (the attractive Ty Defoe and the performance artist and author Kate Bornstein, respectively). After they break down some definitions—what constitutes “trans” and so on—this choral duo ushers us into a family room in the Midwest, complete with fireplace and La-Z-Boy. But how can we find our way into the story proper, now that the People in Charge have spent a fair amount of time winking at us about the asshole culture that Lee’s about to take down? It’s Christmastime, and Jake (the expert and funny Josh Charles) is messing around with his brother Drew (the sensitive and charismatic Armie Hammer); soon they’re joined by their dad, Ed (Stephen Payne), and brother Matt (Paul Schneider), who once wrote inflammatory lyrics to the tune of “Oklahoma!”—lyrics that, if you replay them in your mind, hint at Matt’s difference from his brothers, who never stop horsing around. When they get a fake Christmas tree, don the requisite plaid pajamas, and eat Cheese Puffs, it all feels familiar—or borrowed from old tropes, which, judging by Lee’s previous work, seemed tired to her to begin with.\n\nEd, for instance, comes from Sam Shepard territory—the bitter old codger who sees nothing wrong with his boys trying to act like men, whatever that is. But, whereas Shepard wrote from real anguish about these questions—about men who impersonate some Hollywood idea of masculinity while searching for a father’s love—Lee’s characterizations of white men don’t seem to draw on anything real. Is her point that straight white men are superficial creatures, bound by codes of behavior that make them stupid and puerile? The dishonesty in the play runs deep. Writers don’t spend time with characters who don’t, on some level, interest them—and who among us hasn’t felt a flash of anger at or yearning for straight white men and their ability to be carefree and uncomplicated while claiming what they naturally assume to be theirs? What if Lee had written about the sexual tension and distance one can feel when observing one’s own reaction to white masculinity? Instead, she’s scripted a simplistic morality play whose thrust is Them bad, Us—audience members, Persons in Charge—good. “Straight White Men” is, ultimately, not much more than a repetitive Twitter rant about what’s wrong with other people.\n\nLooking over what I’ve just written, I’m saddened as much as annoyed by my peevishness. I don’t think I’m criticizing Lee’s wish to cross over, whatever that means in today’s cultural landscape, where high is low and everything else is television. What dismayed me about “Straight White Men,” in the end, was that not only does it not exhibit any of the humor, recklessness, and passion of Lee’s previous work; it refutes those things. Seeing the show is like meeting the free-spirited and fun-loving girl of one’s youth who has grown up to be a conventional woman, delighted to conform.\n\n“Straight White Men” was a good idea for a play, but it wasn’t a good idea for Lee as a writer, since her great strength—or one of them—in the past was not entirely knowing what regular theatre is, and not being particularly interested in it (though she is a first-rate Shakespeare scholar). What she did know was actors, and how rarely they were given an opportunity to contribute as thinkers. So she allowed them to speak. The other thing she knew was herself. In early plays, such as “Pullman, WA” (2005) and “Song of the Dragons Flying to Heaven” (2006), Lee wrote profoundly about her own ancestry, her culture, and her failure to be “Asian”—to be ambitious in the right ways, to fit the model of Korean life that her parents had envisioned for her. There was so much regret in those works—and anger about the regret. Then, in 2009, she presented “The Shipment,” a play that deals with blackness in ways that I continue to find perplexing, fascinating, and necessary. After “The Shipment,” there was more work that revealed how immense her over-all project truly was, less an anthropological quest, I think, than an act of intellectual and artistic greed: Lee wanted to talk to everyone who had been at least partly shaped or distorted by whiteness. But what can she do with whiteness itself?\n\nShapiro, bless her, has put a frame around the proscenium, with a large plaque at the bottom that says “Straight White Men.” The actors want to play real people, but what chance do they have when they’re presented like silhouettes in a shooting gallery—easy marks—and with all those accusing fingers pointing at them like guns? Charles goes with the fun—he always does—but Hammer tries to do what he does so admirably in his film work: he wants to connect with his character emotionally and spiritually, even when, as in this case, the character is underwritten. On the afternoon that I saw the show, a group of girls sitting behind me kept murmuring, “He’s so beautiful,” whenever Hammer did something physical and outsized, and he is beautiful, a matinée idol with a soul, but that’s another issue: how can an actor with soul attach himself to something that’s soulless?\n\nFor the past decade or so, it’s been weird to watch the work of a number of young American playwrights. It’s as if, having studied theatre for too long before making a play, and daunted by the emotion and the character development to be found in the works of such writers as Suzan-Lori Parks, Ntozake Shange, Bill Gunn, and Charles Gordone, they’d decided that characters and love were passé; it had all been done before. Not to get too Aristotelian about it, but one thing we go to the theatre to see is how a character’s consciousness can be transformed by events, thereby also changing the writer of the text and the audience. For a long time, at least in theatre years, Lee gave us this, and it was a thrill to imagine what she would do next. But now, by trying to lampoon whiteness, she’s made a “white” play: shallow, soporific, and all about itself. ♦",
  "isFullReview": true,
  "textWordCount": 1244,
  "archivePath": "data/archives/reviews/straight-white-men-2018/newyorker--hilton-als_2026-02-04.html",
  "textFetchedAt": "2026-02-04T18:23:05.477Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 1244,
  "tierReason": "Full review text"
}