{
  "showId": "straight-white-men-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2018/07/23/straight-white-men-check-their-privilege/",
  "publishDate": "2018-07-23T21:50:16",
  "fullText": "A couple months ago, comedian/Food Network personality Josh Denny sent the Twitterverse into a tizzy with this apparently sincere assertion: “‘Straight White Male’ has become this century’s N-Word. It’s used to offend and diminish the recipient based on assumption and bias. No difference in the usage.” Denny was undoubtedly being intentionally provocative, but he certainly stirred a pot that’s been simmering for the past couple of years. The Spectator’s Brendan O’Neill dubbed 2016 “the year of the ‘white men’ slur” (“The most dehumanizing insult of our times,” read the headline). And in 2017, The Boston Globe ran an opinion piece called “In Defense of the White Male.” (The Boston Globe. Not The Onion.)\n\nBy all accounts, this is the worst time in history to be a straight white man. So it’s probably the perfect time for Second Stage to bring Young Jean Lee’s Straight White Men to Broadway.\n\nBut don’t expect Lee to jump on the hate train. What the Korean-American writer—the first Asian-American female playwright produced on Broadway—is doing, explains Person in Charge 2 (Ty Defoe), is “something a little tricky”; she’s trying to “find some understanding for straight white men.” (Whether we need that explained to us is altogether debatable.)\n\nBefore you get to the title characters—father Ed (Stephen Payne) and his sons, Jake (a viciously funny Josh Charles), Drew (Hollywood heartthrob Armie Hammer, matching Charles punch for punch, sometimes literally), and Matt (Paul Schneider)—you’ll meet Person in Charge 1 and 2: They’re played, respectively, by Kate Bornstein and Defoe—neither of whom is a straight white man. “My gender identity,” says Defoe in the first scene, “is Niizhi Manitouwug, which means ‘transcending gender’ in the Ojibwe language.” As for Bornstein, a self-described “Jew from the Jersey shore”: “I’m what’s called ‘non-binary,’ which means ‘not man/not woman’ in the English language.”\n\nBornstein and Defoe—whose roles are new since the 2014 Public Theater production—serve as the play’s affable hosts/Greek chorus/guides; they’re there to welcome you (“This theater we’re all sitting in is built on the land of my people,” says Defoe, who’s from the Oneida and Ojibwe nations. “So welcome.”), and to acknowledge that the preshow music—explicit rap, played at what some might call an eardrum-splitting level—might have made some audience members uncomfortable. (Personally I’d pay extra to download the preshow playlist, populated entirely by female hip-hop artists. But Lil’ Mama and Junglepussy is probably not to everyone’s taste.)\n\nThey also help set the scene by bringing the actors literally into the frame—the proscenium is cleverly outlined by a gilded museum-style picture frame—and putting them into position. The whole thing has a clever, ever-so-creepy diorama effect—like we’re watching the actors in a museum, or at Epcot Center. It’s also a double-edged sword: Looking at them as if they’re merely figures on display to be studied lends an oddly thrilling anthropological angle to the production; it also, unfortunately, keeps us at arm’s length, never affording any emotional investment in the characters.\n\nGranted, a playwright can go only so deep in 90 minutes, but Lee can go deeper than most; this is a woman who brought Big Bird into her 2010 Shakespeare–meets–Sesame Street mash-up, Lear. So while the play incorporates plenty of standard men-behaving-badly shtick—think video games, slap fights, childish nicknames, ridiculously bad dancing (Hammer’s moonwalk pretty much brings down the house), and the absolute whitest version of Run DMC’s “Peter Piper” you’ll ever hear (hats off to Charles and Hammer, who could really pass for brothers)—these white men aren’t exactly standard. They grew up playing Privilege, their mom’s homemade woke version of Monopoly that involved moves like “get stopped by the police for no reason and go directly to jail.” Eldest brother Matt once started an “awesomely Stalinist” School for Young Revolutionaries. And now that he’s a Harvard-educated temp worker who lives at home with dad, it puzzles and frustrates the heck out of professor/author Drew and banker Jake, especially after Matt breaks down in tears over pot stickers. Everyone wants to fix Matt, and everyone has a theory—he needs therapy, he’s worried about his student loans, he’s fighting the system by sacrificing his own place at the top—except Matt. The playwright doesn’t even seem to have a theory, which might puzzle and frustrate viewers as well. Straight White Men is Lee’s most naturalistic play to date; it’s also her least plot-driven.\n\nYou’ll remember that our mission, as explained by the Persons in Charge, was to “try to find some understanding for straight white men.” Understanding turns out to be in short supply. But Lee’s perspective—wry, unflinching, and altogether unique—is an unexpected privilege.\n\nStraight White Men opened July 23, 2018, at the Helen Hayes Theater and runs through Sept. 9. Tickets and information: 2st.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "show-score-playwright",
    "playbill-verdict"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2018/07/23/straight-white-men-check-their-privilege/",
  "showScoreExcerpt": "\"The whole thing has a clever, ever-so-creepy diorama effect—like we’re watching the actors in a museum, or at Epcot Center. It’s also a double-edged sword: Looking at them as if they’re merely figures on display to be studied lends an oddly thrilling anthropological angle to the production; it also, unfortunately, keeps us at arm’s length, never affording any emotional investment in the characters.\"\n\nRead more"
}