{
  "showId": "straight-white-men-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2018/07/23/straight-white-men-nice-guys-get-framed-in-a-dramatic-diorama/",
  "publishDate": "2018-07-23T21:50:33",
  "fullText": "Young Jean Lee is a smart playwright known in adventurous theater circles for her unorthodox works that explore issues relating to identity, race, and gender. Lee makes her Broadway debut with Straight White Men, which opened tonight in a Second Stage production at the Helen Hayes Theater.\n\nThis contemporary play and its staging may be a trifle offbeat, but they are nothing that will freak out a traditionally-minded Broadway show-goer, who might well become rather bored by a lack of story and strong dramatic conflict.\n\nSet in a nice, if bland, family room of a house in the American Midwest, the situation involves three brothers in their 40s who are spending the Christmas holidays with Ed (Stephen Payne), their widowed dad. Jake (Josh Charles) is a banker and a divorced father of two kids. Drew (Armie Hammer) is a university professor and novelist who remains single. Also single is Matt (Paul Schneider), the eldest brother and a Harvard graduate crippled by college debt, who is more or less keeping house for his father while holding down a paltry temp job.\n\nThe 90-minute play is structured in three scenes that occur over three days. The men cheerfully participate in some family holiday rituals—wearing Christmas Eve pajamas, eating Chinese take-out food, drinking eggnog punch, singing “O Tannenbaum,” and other similarly cozy traditions.\n\nThey also briefly play a board game called “Privilege,” which is a Monopoly set that their late mother doctored way back when in order to caution her sons about the advantages they will enjoy unfairly as educated, prosperous white men in American society.\n\nAlthough at times the brothers engage in juvenile silliness and horseplay, they obviously are fond of each other and their father. It also becomes apparent that these straight white men, like their dad, are genuinely nice guys with decent socially conscious attitudes.\n\nYet as they share the holiday, Jake and Drew become aware that Matt, rather a woebegone fellow, is troubled. After Matt unexpectedly cries into his moo shu pork, his brothers attempt to figure out what’s ailing him.\n\nWhy is he behaving like such a loser? Could Matt be sabotaging himself due to his liberal white male guilt? Should he see a therapist? Might they pay off his college loans? Would it be better for Matt to try to forge a life of his own rather than take refuge in his father’s house?\n\nMatt’s existential issues ultimately fracture the family circle.\n\nA comedy of sorts modelled after conventional father and son dramas, complete with a couch and coffee table plunked in the middle of the room, Straight White Men, rather like poor Matt, does not live up to its potential. The playwright’s intriguing suggestion that these guys are actually too comfortable living within their supposedly woke consciousness may be too subtly expressed for some viewers to grasp. The conclusion seems abrupt and not especially satisfying.\n\nSince Straight White Men first appeared at the Public Theater in 2014—in a production that registered as even more enigmatic than this one—the playwright has crafted a frame to give it a sharper focus. Literally: Set designer Todd Rosenthal puts a wooden picture-type frame around the taupe-on-beige family room that makes it appear like a museum diorama. There is even an engraved title plate on the bottom of it.\n\nLee also has added two characters, Person in Charge 1 (Kate Bornstein) and Person in Charge 2 (Ty Defoe), who act as docents for the play. Dressed in slightly eccentric costumes, they patrol the theater’s aisles even before the show begins, apologizing for the shrieking female rap music being blasted through the auditorium. They further make brief, rather jocular, introductory remarks as a sort of prologue in which they identify themselves as non-binary individuals and urge the audience to “try to find some understanding for straight white men.” They later pop up as silent supervisors during the intervals when stagehands reset the room between scenes.\n\nInventing these characters is a clever way to give audiences a sense of distance to view the story and its people dispassionately. But they do not compensate for the underwritten play, which is neither sufficiently satirical nor revelatory enough to achieve any sense of catharsis.\n\nAnna D. Shapiro, a very good, accomplished director, cultivates natural, warm performances from her fine actors that make the play seem more humorous than it happens to be. It’s very easy to like these guys, so there’s something of a cross-purposes gap yawning between the play and its production. The message that the playwright probably intends to relate about people vainly struggling to live up to their privilege gets lost somewhere in the middle.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial"
}
