{
  "showId": "waiting-for-godot-2013",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/waiting-godot-theater-review-354188/",
  "publishDate": "November 24, 2013",
  "fullText": "People will probably debate the meaning of Samuel Beckett’s “Waiting for Godot” until the end of time, but the reaction of one audience member at the current Broadway revival might say it all. At one point late in the first act, he rose from his seat and stormed up the aisle, and was then heard banging on one of the rear doors of the theater while crying, “Let me out of here!”\n\nSomewhere, the playwright must be smiling.\n\nThe reactions of other theatergoers will likely be much more favorable, since this Broadway revival of the classic work, the first since its premiere, is one of the most entertaining and powerful renditions of the play that this critic has ever seen.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n TV\n \n \n \n \n\n \n \n \n \n People Can't Stop Googling the 2014 Olympics and \"Boy Aquarium\" in the Wake of 'Heated Rivalry' \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Movies\n \n \n \n \n\n \n \n \n \n Fiji, and Tilda Swinton, Star in 'Heart of Light - eleven songs for Fiji.' Swinton and Her Director Share What the World Can Learn From the Island Nation\n\nBeckett’s challenging works often go down much easier when presented with generous doses of humor, and this production directed by Anthony Page fortunately doesn’t stint on it. Vladimir and Estragon are played by Bill Irwin and Nathan Lane, and these veteran comic actors apply their vaudeville-style skills to excellent effect. Lane infuses his line readings with his trademark snappish delivery, bellowing voice and perfect comic timing, while the circus-trained Irwin enhances his gentler turn with his expert miming and physical clowning talents. Their iconic characters might be desperately and pathetically waiting in vain for the mysterious Godot, but in these talented performers’ hands, they provide plenty of fun for the audience along the way.\n\nNot that the evening doesn’t effectively convey the play’s more chilling elements. Here they’re largely provided by John Goodman and John Glover, whose Pozzo and Lucky are truly awesome sights to behold. As the officious Pozzo, Goodman — whose already considerable bulk has been enhanced by padding — resembles a mountainous creature whose quiet malevolence is made even scarier by his mock, high-toned accent. And as his slave Lucky, Glover has been made up to look positively demonic, with the actor’s intensity in the near-silent role quietly terrifying.\n\nSanto Loquasto’s striking set, featuring giant gray rock formations, perfectly conveys the stark bleakness that marks the characters’ seemingly pointless existence.\n\nVeteran theatergoers usually don’t have to wait long for another production of the oft-performed “Godot.” But one as special as this doesn’t come along that often. Venue: Studio 54, New York (through July 5)Presented by the Roundabout Theatre Co.Playwright: Samuel BeckettCast: Nathan Lane, Bill Irwin, John Goodman, John GloverDirector: Anthony PageSet designer: Santo LoquastoCostume designer: Jane GreenwoodLighting designer: Peter KaczorowskiSound designer: Dan Moses Schreier",
  "isFullReview": true,
  "dtliExcerpt": "Patrick Stewart and Ian McKellen bring their formidable theatrical gifts to Samuel Beckett's existential masterpiece in a production that finds fresh meaning in familiar territory.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Patrick Stewart and Ian McKellen bring their formidable theatrical gifts to Samuel Beckett's existential masterpiece in a production that finds fresh meaning in familiar territory.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (25 words)",
  "textQuality": "truncated",
  "playbillVerdictUrl": "https://www.hollywoodreporter.com/lifestyle/arts/waiting-for-godot-broadway-review-keanu-reeves-alex-winter-1236387450/",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "textWordCount": 455,
  "archivePath": "data/archives/reviews/waiting-for-godot-2013/hollywood-reporter--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:08:18.855Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "wordCount": 455,
  "tierReason": "Missing proper ending or other signals"
}