{
  "showId": "betrayal-2019",
  "outletId": "bloomberg-news",
  "outlet": "Bloomberg News",
  "criticName": "Unknown",
  "url": "http://www.businessweek.com/news/2013-10-27/craig-weisz-rafe-spall-sizzle-in-five-star-betrayal-review",
  "playbillVerdictUrl": "http://www.businessweek.com/news/2013-10-27/craig-weisz-rafe-spall-sizzle-in-five-star-betrayal-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 1002,
  "archivePath": "data/archives/reviews/betrayal-2019/bloomberg-news--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:40:06.384Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_text"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "28:07The Year AheadLuxury Goods Are More Expensive Than Ever. You Should Buy Secondhand InsteadAmerica Needs to Come Around to the Idea There’s No ‘Winning’ Against China50 Companies to Watch in 2026Let’s Quit Worrying About a US Recession AlreadyElon, IncOver and OutListen: 40:06Elon, IncWill Elon Get Paid $1 Trillion?Listen: 32:11Elon, Inc.Tesla's Master Plan, Part 4Listen: 25:45Elon, Inc.Are Elon and Mark Friends Again?Listen: 14:31Nico Brausch for Bloomberg BusinessweekFracking Goes GlobalThe technique, honed over the past 15 years in the US, is now being deployed to unlock hard-to-reach oil and gas reserves from Australia to Saudi Arabia.Going ViralThe story behind the hitRyan Haskins for Bloomberg Businessweek; Photos: Companies (3); Getty Images (5)A Global Explosion of Absurdly Spicy FoodsDiners worldwide are seeking out palate-numbing flavors their parents or grandparents would rarely have considered—or even encountered.Japan’s Viral Horse-Racing Video Game Has Players Flocking to Real-Life StablesHow the Shiny, Viral Hulken Bag Became a $50 Million BrandOnes to WatchPhoto Illustrations: 731; Photos: Berner: David Urbanke. Esparza: Star Montana. Shulman: Barry Chin/Getty Images. Storer: Emma Mcintyre/Getty Images. Young: Justin Goff/Getty Images. Yu: Visual China Group/Getty Images. All others: courtesy subjectThe Entertainers and Executives Shaping the Arts and CultureGet to know the musicians, podcasters and artists who are shaping the future of the industry.A Walk WithGetting to know the most interesting people in businessBrad Swonetz for Bloomberg BusinessweekZillow’s CEO Is Ready for Another Slow Year in the US Housing MarketThe $16 billion company is pushing more into the transaction side of the real estate industry, which Jeremy Wacksman calls ‘a better business to be in.’Uniqlo Founder and Japan’s Richest Man Loves a $32 Pair of SlacksDisney Exec on Media Mergers, Jimmy Kimmel and What Makes Good TVBuying PowerAmanda Mull on consumer cultureLillian Ansell for Bloomberg BusinessweekThe United States of KlarnaWant to understand the state of the economy? Just look to all the shoppers flocking to “buy now, pay later” services.Extra SaltDeena Shanker on the food businessSebastian Mast for Bloomberg BusinessweekOzempic Users Actually Spend More Dining Out. Smart Restaurants Are AdaptingThe weight loss revolution could be a good thing for the food service industry.Why America’s Fridges Are Overflowing With SauceThe Boom in ‘Better for You’ Kid Snacks Is Worse for ParentsB-SchoolsA crash course on the best business schoolsPhoto illustration by 731; photo: Getty ImagesThe New Requirement for MBAs Seeking Consulting Jobs: AI ProficiencyRather than posing an existential threat, the technology is reinforcing the importance of judgment and emotional intelligence.Trump Loves Trade Schools. So Why Does He Want to Defund Them?Will Foreign MBAs Win or Lose With Trump’s H-1B Reforms? Maybe BothField DayIra Boudway and Randall Williams on the business of sportsAlex Gamsu Jenkins for Bloomberg BusinessweekThe Business of College Football Has Never Been More Exciting or More of a MessThe NIL spigot continues to flow despite a revenue-sharing cap.Ones to WatchPhoto Illustrations: 731; Photos: Berner: David Urbanke. Esparza: Star Montana. Shulman: Barry Chin/Getty Images. Storer: Emma Mcintyre/Getty Images. Young: Justin Goff/Getty Images. Yu: Visual China Group/Getty Images. All others: courtesy subjectThe Entertainers and Executives Shaping the Arts and CultureGet to know the musicians, podcasters and artists who are shaping the future of the industry.Buying PowerAmanda Mull on consumer cultureLillian Ansell for Bloomberg BusinessweekThe United States of KlarnaWant to understand the state of the economy? Just look to all the shoppers flocking to “buy now, pay later” services.Field DayIra Boudway and Randall Williams on the business of sportsAlex Gamsu Jenkins for Bloomberg BusinessweekThe Business of College Football Has Never Been More Exciting or More of a MessThe NIL spigot continues to flow despite a revenue-sharing cap.The ArchiveThe Screentime IssueOctober 1, 2025In Scott Bessent We TrustSeptember 1, 2025How Citizen Musk Threatens Elon Inc.August 1, 2025Can Gap Come Back?July 1, 2025More From Businessweek15 hr ago15 hr agoInside Xbox, a Game Studio Is Trying to Reinvent ItselfMicrosoft’s Obsidian Entertainment is searching for ways to make games more quickly and on smaller budgets.February 2, 2026February 2, 2026Industry TV Recap: A Tabloid DramaAll this supposed shadiness in financial journalism was news to us!February 1, 2026February 1, 2026Carvana’s Red-Hot Growth Runs on a Cycle of Borrowed MoneyAttacks from short sellers and the collapse of auto lender Tricolor haven’t slowed down America’s most valuable used-car retailer.January 30, 2026January 30, 2026How Much of Your Money Is Going to ICE?On Everybody’s Business, we tackle the cost of Trump’s deportation campaign and look at a startup taking on the declining population.January 30, 2026January 30, 2026The US Is Flirting With Its First-Ever Population DeclineAmerica’s population wasn’t expected to start falling until 2081. Trump’s immigration crackdown means it could happen as soon as this year.January 29, 2026January 29, 2026Sanctioned Vessels, Pursuits at Sea: Tanker Trackers Keep TabsIt’s been a busy couple of months for the handful of companies that track the global flow of oil, ship by hulking ship.January 28, 2026January 28, 2026The Future of Male Birth Control Could Be Pills, Gels and ImplantsNew contraceptive methods are in trials, but can companies get men to buy in?January 27, 2026January 27, 2026Germany’s Far Right Takes Its Fight to the Factory FloorThe upstart Zentrum union is growing fast and makes no secret of its political leanings.January 27, 2026January 27, 2026Cognac Makers Are Uprooting Vines. Dumping Supplies May Be NextProducers of the pricey brandy are cutting staff. January 26, 2026January 26, 2026Canadians Are Boycotting US Ski SlopesTravelers from Canada, long the biggest source of international visitors to the US, have pushed back against the president’s imperialist rhetoric. Winter resorts are feeling the chill.Load moreHomeBTV+Market DataOpinionAudioOriginalsMagazineEventsNewsMarketsEconomicsTechnologyPoliticsGreenCryptoAIWork & LifeWealthPursuitsBusinessweekCityLabSportsEqualityManagement & WorkMarket DataStocksCommoditiesRates & BondsCurrenciesFuturesSectorsEconomic CalendarExploreNewslettersExplainersPointed News QuizAlphadots GameThe Big TakeGraphicsSubmit a TipAbout UsTerms of ServiceDo Not Sell or Share My Personal InformationTrademarksPrivacy PolicyCareersAdvertiseAd ChoicesHelp©2026 Bloomberg L.P. All Rights Reserved.\n\nBy accepting, you agree to our updated\n Terms of Service,\n including the arbitration provision and class action waiver. You understand that we process your information as described in the\n Privacy Policy,\n which may include sharing information about your use of\n Bloomberg.com\n with third parties. Accepting does not affect your right to opt-out at any time via the Do Not Sell or Share My Personal Information link in the website footer.",
  "contentTier": "needs-rescrape"
}