{
  "showId": "betrayal-2019",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Unknown",
  "url": "http://nypost.com/2013/10/27/cheaters-prosper-in-betrayal/",
  "playbillVerdictUrl": "http://nypost.com/2013/10/27/cheaters-prosper-in-betrayal/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Ethel Barrymore Theatre, 243 W. 47th St.; 212-239-6200. Through Jan. 5. Running time: 95 minutes, no intermission.\n\nWith its flashy pedigree — stars Daniel “007” Craig and his real-life wife, Rachel Weisz, plus powerhouse director Mike Nichols — Broadway’s new revival of “Betrayal” was a hot ticket before rehearsals even started.\n\nWhen $500 premium seats are selling based on reputation alone, you don’t need to be a masterpiece.\n\nThe good news is that while the production isn’t a lightning bolt of brilliance, it’s also sturdy and absorbing.\n\nBut then, the play’s construction forces you to pay attention.\n\nIn 1978’s “Betrayal,” Harold Pinter tracks an adulterous triangle over roughly a decade — and in roughly reverse chronological order. In the first scene, ex-lovers Emma (Weisz) and Jerry (Rafe Spall) meet in a pub in 1977, two years after their breakup. The show concludes with their initial kiss, at a party, in 1968.\n\nIn between, we check in on the duo and Emma’s husband, Robert (Craig), through the years. (Jerry’s married, too, but his wife is never seen and doesn’t seem to factor much into anybody’s thoughts.)\n\nIn the opening scene, Emma informs Jerry that she’s just told her husband — who’s also Jerry’s best friend — about their affair. Or so she says: In the next scene, Robert casually tells Jerry he’s known about them for years.\n\nWhen the play starts going backwards in time, you scrutinize the characters for clues, slips, revealing smiles or frowns. Who knows what when? In a web of lies, information is more important than sentiment.\n\nPinter, inspired by a seven-year affair of his own, writes with manipulative precision. There’s a contained fury in the merciless way with which he approaches Emma, Robert and Jerry. At times, you feel as if he’s less interested in feelings than in the clever perspective-altering plot mechanics.\n\nThis impression is reinforced in this production, which looks great but is emotionally distant and a tad too tasteful. Ian MacNeil’s stylish sets glide smoothly in and out as we move through the years and places — a pub, a studio apartment for illicit sex, a hotel room in Venice. Departing from his usual dance-music exuberance, former LCD Soundsystem frontman James Murphy contributes a restrained piano-and-string score.\n\nIt’s all cool and self-controlled, as is Weisz’s performance. The English actress — who memorably played another adulterous wife in the 2011 movie “The Deep Blue Sea” — has a stunning, warm beauty, but it’s paired with emotional opacity. She cries in half of her scenes, yet it’s hard to get a sense of what Emma actually wants.\n\nSaddled with feathered, dirty-blond ’70s hair, Craig gives us a blunt Robert who seems to care less about losing his wife than his best friend.\n\n“I’ve always liked Jerry,” Robert coldly tells Emma after discovering her cheating. “To be honest, I’ve always liked him rather more than I’ve liked you. Maybe I should have had an affair with him myself.”\n\nAs the man in the middle, Spall — the son of jowly character actor Timothy Spall, the rat of the “Harry Potter” films — makes the strongest impression as a man torn between desire and guilt.\n\nAt the end, which is the beginning, Jerry is carefree and daring. We already know a decade of lies and cheating awaits.\n\nThis is the kind of insight that makes “Betrayal” a play worth revisiting — its very structure encourages multiple viewings. Just not at $500 a pop.\n\nActors bring fiends... \n \n Actors bring fiends to life...\n\nWe've sent an email with instructions to create a new password. Your existing password has not been changed.",
  "isFullReview": true,
  "textWordCount": 602,
  "archivePath": "data/archives/reviews/betrayal-2019/nypost--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:45:18.700Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140101080358",
  "archiveOrgUrl": "http://web.archive.org/web/20140101080358/http://nypost.com/2013/10/27/cheaters-prosper-in-betrayal/",
  "contentTier": "complete",
  "wordCount": 602,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2013 outside valid range 2016–2021 for show opening 2019"
}