{
  "showId": "betrayal-2019",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2019/09/05/theater/betrayal-review-tom-hiddleston.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "playbill-verdict"
  ],
  "bwwExcerpt": "Mr. Lloyd's interpretation balances surface elegance with an aching profundity, so that 'Betrayal' becomes less about the anguish of love than of life itself. Specifically, I mean life as lived among people whom we can never truly know. That includes those closest to us; it also includes our own, elusive selves.",
  "bwwScore": 9,
  "contentTier": "complete",
  "fullText": "https://www.nytimes.com/2019/09/05/theater/betrayal-review-tom-hiddleston.htmlShare full article22Advertisement\n\nHow can a naked space seem so full? Feelings furnish the stage in the resplendently spare new production of Harold Pinter’s “Betrayal,” which opened on Thursday night at the Bernard Jacobs Theater, and they shimmer, bend and change color like light streaming through a prism.\n\nDirected by Jamie Lloyd — and acted with surgical precision by Tom Hiddleston, Zawe Ashton and Charlie Cox — this stripped-down revival of Pinter’s 1978 tale of a sexual triangle places its central characters under microscopic scrutiny, with no place to hide. Especially not from one another, as everybody is on everybody else’s mind, all the time. They are also all almost always fully visible to the audience.\n\nThis British version is the most merciless and empathic interpretation of this much performed work I’ve seen, and it keeps returning to my thoughts in piercing shards, like the remnants of a too-revealing dream. I had heard good things about this “Betrayal” when it debuted in London earlier this year, but I didn’t expect it to be one of those rare shows I seem destined to think about forever.\n\n“Betrayal” was dismissed as lightweight by Pinter standards when it opened at the National Theater in London four decades ago, and hearing it described baldly, you can sort of understand why. The high concept pitch could be: “Love among the literati in London leads to disaster, when a publisher discovers his wife is having an affair with his best friend!”\n\nTrue, the play had an unusual structure, with its reverse chronology. (It begins in 1977 and ends in 1968.) Early critics regarded this as an unnecessary and confusing gimmick. As for all that brittle, passion-concealing wit and straight-faced deception, wasn’t that the stuff of old-guard West End masters like Coward and Rattigan?\n\nWith subsequent productions and a first-rate film in 1983 — featuring Jeremy Irons, Ben Kingsley and Patricia Hodge — earlier naysayers began to perceive a creeping depth and delicacy in the work, which for me now ranks among Pinter’s finest. Curiously, despite three starry productions (the most recent led by Daniel Craig and Rachel Weisz), “Betrayal” has never been done full justice on Broadway.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 385,
  "archivePath": "data/archives/reviews/betrayal-2019/nytimes--ben-brantley_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:01:01.133Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250724061155",
  "archiveOrgUrl": "http://web.archive.org/web/20250724061155/https://www.nytimes.com/2019/09/05/theater/betrayal-review-tom-hiddleston.html",
  "duplicateTextOf": "nytimes--jesse-green.json",
  "wordCount": 385,
  "tierReason": "Full review text",
  "playbillVerdictUrl": "http://www.nytimes.com/2013/10/28/theater/reviews/daniel-craig-and-rachel-weisz-star-in-betrayal-on-broadway.html?_r=0"
}
