{
  "showId": "betrayal-2019",
  "outletId": "timeout",
  "outlet": "Time Out",
  "criticName": "Unknown",
  "url": "http://www.timeout.com/newyork/theater/betrayal",
  "playbillVerdictUrl": "http://www.timeout.com/newyork/theater/betrayal",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Betrayal. Ethel Barrymore Theatre (see Broadway). By Harold Pinter. Directed by Mike Nichols. With Daniel Craig, Rachel Weisz, Rafe Spall. Running time: 1hr 30mins. No intermission.\n\nBased on his own infidelity, Harold Pinter’s 1978 play runs backward—starting with the aftermath of a failed extramarital affair and ending with its sudden start. Guiding us through the triangulated chronology are Daniel Craig and Rachel Weisz, doing the art-imitating-life thing by playing spouses. Rafe Spall is the homewrecker in this revival, staged by the great Mike Nichols.\n\nBetrayal: Theater review by David Cote\n\nIt was a troubled marriage from the start, but no one knew. Old hand Mike Nichols, who did such magnificent work on Death of a Salesman, seemed a sound choice to direct the starry Broadway revival of Pinter’s 1978 play about infidelity. Daniel Craig hadn’t shrunken a bit from his years in front of the camera as Agent 007; he was even able to electrify vastly inferior stage material in 2009’s cop melodrama A Steady Rain. And Craig wasn’t acting in a vacuum: Rachel Weisz and Rafe Spall are both appealing performers. The drama itself, while of its time, is not essentially dated. It’s simply that no one got the tone right.\n\nOne imagines Nichols telling his cast on the first day of rehearsal: “Kids, forget everything you thought you knew about Pinter. These aren’t posh-talking, emotionally repressed stiffs who use words as instruments of torture. They screw; they get drunk; they’re human.” And so in the course of 90 minutes we get a lot of overdone subtext, externalized anger and sloppy-soused acting, and too little of the cool menace and tension one associates with this playwright.\n\nMind you, Betrayal isn’t one of Pinter’s early studies of vicious bums or cryptic thugs. And it’s not from his late period of grim totalitarian allegories. (As English critic Michael Billington documented in his invaluable 1996 biography, the piece is based on Pinter’s long affair with BBC presenter Joan Bakewell.) There’s a good deal of tenderness and humor in Betrayal, and these charming, vibrant actors bring out those qualities. They capture the haunted, fractured half-lives of adulterers, torn between two beds, two narrative tracks, two sets of memories.\n\nBut they crucially miss the current of sadism and emotional brutality that courses underneath. It’s a question of technique, really. Restraint, understatement and precision with language are called for, not Craig’s periodic spurts of rage or Weisz’s brittle weepiness. Spall’s scruffy, laddish vibe undermines Jerry’s desperation and neediness.\n\nThe play is famously structured in reverse chronological order, with the first scene taking place in 1977, two years after Emma and Jerry’s affair ended, and spooling back to 1968, with the first flickers of attraction. That built-in device ensures that the action unfolds with gathering, inescapable irony, so that the final scene, in which Jerry professes his love to the astonished Emma, is both spontaneous and fatalistic. If the Broadway engagement succeeds at all (beyond grossly inflated ticket prices), it’s because the dramaturgy is indestructible. But the music is lacking.\n\nIs that so great a pity? If you don’t know how a piece of music should be performed, what matter if it’s played poorly? Shostakovich’s Piano Trio No. 2 must retain some power, even with a detuned Steinway and cellist lagging. A serious music critic would disagree. Likewise, finally, I can’t recommend this event to anyone who loves Pinter or Betrayal. If you don’t care and you’ve got a few hundred burning a hole in your pocket, go for it. But for your own sake, don’t peruse YouTube clips from the 1983 movie starring Patricia Hodge, Jeremy Irons and Sir Ben Kingsley. It is an ideal transfer of play to film and impeccably acted. If you see it too soon after attending this glossy, empty revival, you’ll feel cheated.—Theater review by David Cote\n\nTHE BOTTOM LINE: A star cast isn’t true to Pinter’s dark classic.",
  "isFullReview": true,
  "textWordCount": 649,
  "archivePath": "data/archives/reviews/betrayal-2019/timeout--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:46:36.245Z",
  "originalScore": "3/5",
  "originalScoreNormalized": 60,
  "scoreSource": "star-icon",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140113010900",
  "archiveOrgUrl": "http://web.archive.org/web/20140113010900/http://www.timeout.com:80/newyork/theater/betrayal?",
  "contentTier": "complete",
  "wordCount": 649,
  "tierReason": "Full review text"
}