{
  "showId": "betrayal-2019",
  "outletId": "wsj",
  "outlet": "The Wall Street Journal",
  "criticName": "Unknown",
  "url": "http://online.wsj.com/article/AP33d95e788ba1493d9b702142144b4aac.html",
  "playbillVerdictUrl": "http://online.wsj.com/article/AP33d95e788ba1493d9b702142144b4aac.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "World\n \n \n &raquo; More\n\nWorld\n &raquo; More\n\nU.S.\n \n \n &raquo; More\n\nU.S.\n &raquo; More\n\nBusiness\n \n \n &raquo; More\n\nBusiness\n &raquo; More\n\nTech\n \n \n &raquo; More\n\nTech\n &raquo; More\n\nMarkets\n \n \n &raquo; More\n\nMarkets\n &raquo; More\n\nYour Money\n \n \n &raquo; More\n\nYour Money\n &raquo; More\n\nOpinion\n \n \n &raquo; More\n\nOpinion\n &raquo; More\n\nLife & Culture\n \n \n &raquo; More\n\nLife & Culture\n &raquo; More\n\nN.Y.\n \n \n &raquo; More\n\nN.Y.\n &raquo; More\n\nReal Estate\n \n \n &raquo; More\n\nReal Estate\n &raquo; More\n\nManagement\n \n \n &raquo; More\n\nManagement\n &raquo; More\n\nAn error has occured and your email has not been sent. \n Please try again.\n\nDow Jones Reprints: This copy is for your personal, non-commercial use only. To order presentation-ready copies for distribution to your colleagues, clients or customers, use the Order Reprints tool at the bottom of any article or visit\nwww.djreprints.com\n\nNEW YORK — If revenge is a dish best served cold, betrayal is one apparently lubricated by plenty of booze.\n\nA stunning revival of Harold Pinter's \"Betrayal\" opened Sunday at the Barrymore Theatre with alcohol flowing in every one of its nine scenes: Beer, red wine, scotch, vodka, white wine. Repeatedly cheating on your spouse clearly necessitates liquid courage.\n\nDirector Mike Nichols adds more spirits than even Pinter's script suggests, a way the master craftsman can connect the scenes and explain the stiff-upper-lip repression on the stage. Liquor is the lubrication that keeps each participant from going on a table-flipping screaming rant or utterly collapsing. Nichols proves once again — as if anyone needed it — that he is brilliant at stripping away everything that is not the meaning of the play.\n\nPinter's work, ultimately, is about a triangular relationship — wife, husband and husband's best friend, who all care for each other — that uses reverse chronology to chart the corrosive force of infidelity. This is clearly not a date-night play: More than one couple shifted uneasily in their seats during one recent performance.\n\nSuperbly acted by Rachel Weisz, Daniel Craig and Rafe Spall, the production sparkles in its simple, powerful beauty. The fact that Craig and Weisz are married in real life adds a dash of spice to performances roiling under the surface.\n\nIan MacNeil's handsome sets — lit gorgeously by Brian MacDevitt — drift in and out of view in pieces effortlessly, as if reinforcing the notion of hazy memories. A stuffed animal in one scene casually tossed aside is a reminder of the stakes involved. James Murphy, best known as part of LCD Soundsystem, makes an auspicious Broadway debut with between-scenes instrumental music that puts punctuations on moments without undermining them.\n\nWeisz is luminous — pitiful in a scene when she confesses her affair, toussled and off-kilter when in deep infatuation and yet also coolly disconnected in a scene in her love nest at the end of the secret relationship. Craig still has some 007 swagger about him but it falls away in scenes when his cuckold anger keeps bubbling beneath his calm surface.\n\n\"I hope she looked after you all right,\" he says sharply to his friend at one confrontation. It doesn't get much more venomous than that. When he confronts his wife and she confesses to a yearslong affair with his best friend, this is all he has: \"Must be a bit awkward. I mean we've got two kids, he's got two kids, not to mention a wife. ...\"\n\nBut it's Spall, making his Broadway debut, who perhaps shines the brightest as the best friend who wears his emotions on his sleeve the most. Spall is jittery and passionate and conveys the horror and paranoia of a man hiding his true feelings to both his best friend and the man's wife.\n\nPinter based the play on an affair he had with a television newscaster when he was married in the 1960s. It movingly captures the highs of intoxicating love and the hurt when real life intrudes.\n\nThis production is also shot through with humor — dark, perhaps, but very present. Much of it comes from the peculiar calmness of all three main actors, who all love each other so much that they can't stop hurting each other. It would drive you to drink, too.\n\nOnline: http://www.BetrayalBroadway.com\n\nMark Kennedy can be reached at http://twitter.com/KennedyTwits",
  "isFullReview": true,
  "textWordCount": 695,
  "archivePath": "data/archives/reviews/betrayal-2019/wsj--unknown_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:28:49.282Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140110200500",
  "archiveOrgUrl": "http://web.archive.org/web/20140110200500/http://online.wsj.com:80/article/AP33d95e788ba1493d9b702142144b4aac.html",
  "contentTier": "needs-rescrape",
  "wordCount": 695,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T15:12:08.585Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: Text begins with navigation menu elements and error messages, indicating this is website infrastructure rather than review content; openai: The text is primarily navigation menus and error messages, not a review.",
  "promptVersion": "5.2.0"
}
