{
  "showId": "chess",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Elisabeth Vincentelli",
  "url": "https://www.nytimes.com/2025/11/16/theater/chess-review-lea-michele-broadway.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2025/11/16/theater/chess-review-lea-michele-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "You have a preview view of this article while we are checking your access. When we have confirmed access, the full article content will load.\n\nThis new revival, starring Lea Michele, Nicholas Christopher and Aaron Tveit, is a reminder why the erratic yet rewarding show has endured all these years.\n\nListen to this article · 6:34 min Learn moreShare full article158By Elisabeth Vincentelli\n\nThe musical “Chess” is known for its brilliant score by the Abba songwriters Benny Andersson and Bjorn Ulvaeus and the “Evita” and “Jesus Christ Superstar” lyricist Tim Rice. And it is notorious for a terminally clunky story line that has undergone several alterations over the past 40 years.\n\nDespite many a writer’s efforts, “Chess” has defeated some of the best minds in the business. But really, who can figure out a tuner born out of a 1980s concept album about competitive chess and the rivalry between the United States and the Soviet Union?\n\nWe now have an answer to one of the fall theater season’s biggest questions: Has the yearslong collaboration between the director Michael Mayer and the screenwriter Danny Strong (“Empire”) that opened Sunday at the Imperial Theater finally found the winning move? Let’s call it a draw.\n\nParts of the show are absolutely thrilling and parts are flat at best, aggressively dumb at worst. At least Mayer’s production, starring Nicholas Christopher, Lea Michele and Aaron Tveit, is not a bland bore. Thinking back to Michele’s big, then bigger, then biggest “Nobody’s Side” or Christopher’s red-hot, neck-vein-bursting “Anthem,” I can feel the needle move toward the positive side of the dial.\n\nNicholas Christopher, whose Anatoly reveals turmoil and humor behind his severe demeanor, in the musical with, background from left: Aaron Tveit, Hannah Cruz and Lea Michele.Credit...Sara Krulwich/The New York TimesLike many previous attempts at injecting coherence into “Chess” — whose original Broadway run, in 1988, lasted only about two months after a protracted reworking following its West End premiere — the production is using a revised book. Without going into a close reading, let’s just say that Strong’s most notable change is to boost the character of the Arbiter (Bryce Pinkham) from a chess judge into an omnipresent narrator.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 388,
  "archivePath": "data/archives/reviews/chess/nytimes--elisabeth-vincentelli_2026-02-01.html",
  "textFetchedAt": "2026-02-01T18:22:38.160Z",
  "designation": "Critics_Pick",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}