{
  "showId": "prayer-for-the-french-republic-2024",
  "outletId": "amny",
  "outlet": "amNewYork",
  "criticName": "Matt Windman",
  "url": "https://www.amny.com/entertainment/theater/review-prayer-for-the-french-republic/",
  "publishDate": "January 9, 2024",
  "fullText": "In the two years since I first saw Joshua Harmon’s ambitious, busy play about antisemitism, in which five generations of a single French family in two different eras fear for their safety, the subject has become even more timely, with a shocking rise in antisemitism in America. The incidents documented by the Anti-Defamation League — some 3,700 in 2022 alone (some five times higher than a decade ago) —  have escalated exponentially since the Hamas massacre and kidnapping of Israelis on October 7, 2023\n\nWithin the past two years, there has also been a rise in New York productions that depict antisemitism. “Harmony” is currently playing right down the block on 47th Street from MTC’s Samuel Friedman Theater, where “Prayer for the French Republic” has just opened. Broadway also saw recent runs of “Just for Us,” “Parade,” and “Leopoldstadt,” while there were  productions Off or Off-Off Broadway of “Amid Falling Walls,” “King of the Jews,”  “The Doctor,”  “Remember This: The Lesson of Jan Karski“,  “Witness,” “Otto Frank,”\n\nThe greater urgency of the issues in the play probably explains why, seeing it now on Broadway, it feels even more stirring, enhanced by some strong performers, five of whom were also standouts in the original eleven-member cast Off-Broadway.   But “Prayer for the French Republic” also suffers from comparison with some of the other recent productions. As well-constructed as many of the scenes are, there is too much going on; too much the playwright is trying to do. In its three hour-plus running time, including two intermissions, the play strives to make an epic statement, while still making room for Harmon’s signature bratty comedy.\n\nMarcelle (Betsy Aidem) is a member of the Salomon family, Jews who have lived in France for a thousand years. Those of her relatives who survived the Holocaust, stayed.  Her father Pierre (Richard Masur), in his eighties, is the fifth generation of Salomons who have owned piano stores throughout France, a business that the family began in 1855 and that Pierre rebuilt after the war\n\nYet, in 2016, Marcelle’s 26-year-old son, Daniel (Aria Shahghasemia) returns home with a bloodied face. Several hooligans beat him up because he was wearing a kippah, a skullcap worn by religious Jews. Marcelle, who grew up secular, has been trying to get her son to cover up his newfound devotion by taking it off when he is outside, or at least wearing a baseball cap over it. His father Charles Benhamou (Nael Nacer), soon comes up with a more drastic solution: They should move to Israel. The incident is just the latest, after all, in a darkening picture for Jews in France at the time — the shooting at CharlieHebdo, the newspaper, the killing of four Jews in a kosher supermarket in Paris “who were just shopping for groceries,” the possible election of right-wing politician Marine Le Pen as president of France.Charles’s Benhamou ancestors had lived in Spain until all Jews were kicked out in 1492; the Benhamous then lived for hundreds of years in Algeria, before being forced to leave in the 1960’s. He understands why Jews have survived through thousands of years of hatred: “It’s the suitcase, or the coffin.”\n\nThis is the core story, and it’s a compelling one. But it’s crisscrossed with scenes and subplots featuring eight more characters, most of whom serve overtly dramaturgical and thematic functions.\n\nAnthony Edwards portrays Patrick, Marcelle’s brother, who serves as the narrator. He’s resolutely secular. The offspring (like Marcelle) of a mixed marriage, he doesn’t sound like he considers himself Jewish at all, and in any case doesn’t approve of the Benhamou family’s plan to leave France, thinking they’re overreacting. Yet he recounts a series of gruesome atrocities committed against French Jews in the Middle Ages (Interestingly,  Patrick’s monologue no longer brings up the 2018 massacre by a white supremacist of the worshippers in the Tree of Life synagogue in Pittsburgh, as he did Off-Broadway.) Making this defiantly secular character obsessed with antisemitism is not necessarily a flaw in characterization – Harmon could be making the point that it’s precisely because of Patrick’s obsession with the details of Jew-hatred that the character wants to keep that part of his identity hidden, even from himself.\n\nMolly Ranson portrays Molly, an American college student on her junior year abroad who is enchanted by the romance of France — the kind of woke and clueless secular American Jew that Harmon has proven adept in skewering (in such plays as Bad Jews.)  Molly is a distant cousin of the Salomon family; her first visit with Marcelle and her family happens to occur on the day that the antisemites have bloodied Daniel, and she silently witnesses the angry argument that ensues between Daniel and his mother, which Charles attempts to end by begging “please….let’s have dinner.”   After a long pause, Molly pipes up: “I don’t know if I mentioned, I’m a vegetarian?” Audience laughter. End of scene.\n\nMolly is the outsider to whom Marcelle and her family explain things the playwright wants the audience to know. She winds up injecting a little romantic comedy into the play; she and Daniel fall for another, although the courtship is not a major focus.\n\nShe also expresses her view that Israel is not a place to which the Benhamou family should move: “I’m not sure what the word is in French, maybe it’s the same: apartheid?” This provokes a sarcastic rebuke from Daniel’s sister, Elodie Benhamou (portrayed by actress named coincidentally Francis Benhamou) – and an opportunity in the exchange between the two young women to lay out the general debate over Israel and the Palestinians. Elodie represents another typical fixture in a Harmon comedy (best represented by the teenager Charlie in Admissions.) — the garrulous character given to long arias that are comic in their breathlessness, but simultaneously intended as serious insight.\n\nSimilarly, the family members express their serious disagreements on occasion by shouting at one another — sometimes comically, sometimes angrily, often indecipherably. This is a family that spends its Passover Seder as Patrick puts it, “one-quarter eating, three quarters arguing.”  Director David Cromer is known for his delicate touch, in such works as Our Town Off-Broadway and Broadway’s Tony-winning musical,  The Band’s Visit, but is unable to get these scenes under control  — which, to be fair, are the exceptions in a production with acting of often exceptional clarity.\n\nThe remaining characters are members of the Salomon family living in France during World War II. In scenes from 1944 to 1946 that alternate with the ones from 2016 and 2017, we see Patrick and Marcelle’s great-grandparents Adolphe and Irma (Daniel Oreskes and Nancy Robinette) in their home in Paris, where they were miraculously left alone during the war, but knew enough never to venture out into the streets, and always to keep the windows covered. They wait and wait for word of the family members who weren’t lucky. Finally their son Lucien (Ari Brand) comes back, along with Lucien’s son, 15-year-old Pierre (Ethan Haberfield), both having survived Auschwitz.\n\nI found these Holocaust-era scenes largely inert and unnecessary when I first saw “Prayer for the French Republic” Off-Broadway, and, along with the weirdly sentimental and contrived ending, led me to see the play as a work in progress – a worthwhile play in need of work. But very little has changed in its Broadway transfer.  Despite some beautifully performed moments by Oreskes and Robinette, those scenes now seem even more of a mistake, especially in light of what’s been rendered on other stages. The elder Pierre, now played briefly but masterfully by Masur, could have supplied all the historical context that the play needed.\n\n“Three fourths of the French Jews survived,”  the elderly Pierre points out near the end.  “You know what a high percentage that is? It was so much worse in Poland, in Germany, Czechoslovakia, Greece. France is the one of the best.” And yet here he was, talking to his descendants, who felt the need to escape the country.\n\nPrayer for the French RepublicMTC’s Samuel J. Friedman Theater through February 18. Extended to March 3Running time: Three hours and 15 minutes including two intermissions.Tickets: $94-$298Written by Joshua HarmonDirected by David CromerScenic Design by  Takeshi Kata; Costume Design by  Sarah Laux; Lighting Design by  Amith Chandrashaker; Sound Design by  Daniel Kluger; Hair Design by  J. Jared Janas; Make-Up Design by  J. Jared JanasCast: Betsy Aidem as Marcelle Salomon Benhamou, Francis Benhamou as Elodie Benhamou, Ari Brand as Lucien Salomon, Anthony Edwards as Patrick Salomon, Ethan Haberfield as Young Pierre Salomon, Richard Masur as Pierre Salomon, Nael Nacer as Charles Benhamou,  Daniel Oreskes as Adolph Salomon,  Molly Ranson as Molly, Nancy Robinette as Irma Salomon, Aria Shahghasemi as Daniel Benhamou.\n\nJust for Us Review. Using Jewish humor with AntisemitesJune 26, 2023In \"Antisemitism\"\n\nElton John gets an EGOT.  Eva Noblezada, Corey Cott, Ramin Karimloo back on Broadway.  Broadway Week begins. Stageworthy NewsJanuary 16, 2024In \"New York Theater Weekly Summary\"\n\nBroadway Week 2024: 2 for 1 Tickets.January 10, 2024In \"Broadway\"\n\nBluesky\nMost Popular PostsBroadway and the Blizzard 2026: Questions and AnswersData ReviewMasquerade Review: An Immersive Phantom even for non-PhansAll Out Comedy About Ambition Broadway ReviewTwo Strangers (Carry A Cake Across New York) Broadway ReviewBroadway at the Oscars, in the Snow, at BroadwayCon.  Sir Ian on the Edge. #Stageworthy NewsStereophonic ReviewBug Broadway ReviewThe 50 Best Plays of The Past 100 YearsMarjorie Prime Broadway Review\t\tAdvertisement\n\t\t\n\t\t\n\t\t\n\t\tRecent Posts\n\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tBroadway at the Oscars, in the Snow, at BroadwayCon.  Sir Ian on the Edge. #Stageworthy News\n\t\t\t\t\t\t\t\t\t\t\tJanuary 26, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tWatch Telly Leung, Ali Ewoldt, Shoba Nayaran et al perform at “This is What It Sounds Like: An AANHPI Concert of Joy”\n\t\t\t\t\t\t\t\t\t\t\tJanuary 26, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tData Review\n\t\t\t\t\t\t\t\t\t\t\tJanuary 25, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tBroadway and the Blizzard 2026: Questions and Answers\n\t\t\t\t\t\t\t\t\t\t\tJanuary 24, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tThe Lost Boys Broadway musical: First Look\n\t\t\t\t\t\t\t\t\t\t\tJanuary 24, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tEdward Review. 27 Objects That Tell A Life\n\t\t\t\t\t\t\t\t\t\t\tJanuary 23, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tOscar Nominations 2026\n\t\t\t\t\t\t\t\t\t\t\tJanuary 22, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tAn Ark Review: MR Ian McKellen and “you”\n\t\t\t\t\t\t\t\t\t\t\tJanuary 21, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tBroadway Week. Fascist Year. #Stageworthy News\n\t\t\t\t\t\t\t\t\t\t\tJanuary 20, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tMartin Luther King Jr’s Final Speech: “I’m so happy I didn’t sneeze”\n\t\t\t\t\t\t\t\t\t\t\tJanuary 19, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\n\t\tNew York Theater Archives\t\tNew York Theater Archives\n\t\t\n\t\t\t\n\t\t\tSelect Month\n\t\t\t\t January 2026  (28)\n\t December 2025  (34)\n\t November 2025  (32)\n\t October 2025  (32)\n\t September 2025  (32)\n\t August 2025  (37)\n\t July 2025  (35)\n\t June 2025  (32)\n\t May 2025  (39)\n\t April 2025  (35)\n\t March 2025  (29)\n\t February 2025  (24)\n\t January 2025  (34)\n\t December 2024  (36)\n\t November 2024  (32)\n\t October 2024  (32)\n\t September 2024  (31)\n\t August 2024  (23)\n\t July 2024  (33)\n\t June 2024  (34)\n\t May 2024  (39)\n\t April 2024  (38)\n\t March 2024  (36)\n\t February 2024  (32)\n\t January 2024  (33)\n\t December 2023  (36)\n\t November 2023  (38)\n\t October 2023  (27)\n\t September 2023  (26)\n\t August 2023  (24)\n\t July 2023  (13)\n\t June 2023  (34)\n\t May 2023  (37)\n\t April 2023  (31)\n\t March 2023  (25)\n\t February 2023  (30)\n\t January 2023  (33)\n\t December 2022  (32)\n\t November 2022  (33)\n\t October 2022  (30)\n\t September 2022  (27)\n\t August 2022  (28)\n\t July 2022  (21)\n\t June 2022  (23)\n\t May 2022  (37)\n\t April 2022  (31)\n\t March 2022  (25)\n\t February 2022  (25)\n\t January 2022  (24)\n\t December 2021  (29)\n\t November 2021  (31)\n\t October 2021  (27)\n\t September 2021  (28)\n\t August 2021  (27)\n\t July 2021  (28)\n\t June 2021  (32)\n\t May 2021  (37)\n\t April 2021  (36)\n\t March 2021  (40)\n\t February 2021  (34)\n\t January 2021  (43)\n\t December 2020  (39)\n\t November 2020  (41)\n\t October 2020  (40)\n\t September 2020  (33)\n\t August 2020  (35)\n\t July 2020  (38)\n\t June 2020  (39)\n\t May 2020  (51)\n\t April 2020  (48)\n\t March 2020  (38)\n\t February 2020  (29)\n\t January 2020  (36)\n\t December 2019  (38)\n\t November 2019  (35)\n\t October 2019  (29)\n\t September 2019  (35)\n\t August 2019  (32)\n\t July 2019  (32)\n\t June 2019  (37)\n\t May 2019  (38)\n\t April 2019  (35)\n\t March 2019  (34)\n\t February 2019  (28)\n\t January 2019  (35)\n\t December 2018  (41)\n\t November 2018  (34)\n\t October 2018  (33)\n\t September 2018  (28)\n\t August 2018  (26)\n\t July 2018  (36)\n\t June 2018  (27)\n\t May 2018  (34)\n\t April 2018  (33)\n\t March 2018  (29)\n\t February 2018  (25)\n\t January 2018  (34)\n\t December 2017  (40)\n\t November 2017  (26)\n\t October 2017  (22)\n\t September 2017  (31)\n\t August 2017  (24)\n\t July 2017  (33)\n\t June 2017  (29)\n\t May 2017  (33)\n\t April 2017  (33)\n\t March 2017  (31)\n\t February 2017  (28)\n\t January 2017  (30)\n\t December 2016  (35)\n\t November 2016  (31)\n\t October 2016  (24)\n\t September 2016  (30)\n\t August 2016  (37)\n\t July 2016  (27)\n\t June 2016  (31)\n\t May 2016  (33)\n\t April 2016  (27)\n\t March 2016  (31)\n\t February 2016  (28)\n\t January 2016  (35)\n\t December 2015  (35)\n\t November 2015  (30)\n\t October 2015  (28)\n\t September 2015  (29)\n\t August 2015  (27)\n\t July 2015  (26)\n\t June 2015  (26)\n\t May 2015  (39)\n\t April 2015  (35)\n\t March 2015  (25)\n\t February 2015  (23)\n\t January 2015  (32)\n\t December 2014  (33)\n\t November 2014  (26)\n\t October 2014  (32)\n\t September 2014  (30)\n\t August 2014  (32)\n\t July 2014  (27)\n\t June 2014  (20)\n\t May 2014  (22)\n\t April 2014  (27)\n\t March 2014  (36)\n\t February 2014  (22)\n\t January 2014  (30)\n\t December 2013  (29)\n\t November 2013  (33)\n\t October 2013  (28)\n\t September 2013  (26)\n\t August 2013  (39)\n\t July 2013  (34)\n\t June 2013  (27)\n\t May 2013  (38)\n\t April 2013  (45)\n\t March 2013  (29)\n\t February 2013  (39)\n\t January 2013  (27)\n\t December 2012  (29)\n\t November 2012  (31)\n\t October 2012  (26)\n\t September 2012  (9)\n\t August 2012  (19)\n\t July 2012  (27)\n\t June 2012  (20)\n\t May 2012  (9)\n\t April 2012  (1)\n\t March 2012  (1)\n\t December 2011  (1)\n\t November 2011  (1)\n\t April 2011  (3)\n\t March 2011  (1)\n\t December 2010  (1)\n\t November 2010  (1)\n\t September 2010  (1)\n\t May 2010  (2)\n\t April 2010  (1)\n\t March 2010  (1)\n\t January 2010  (2)\n\n\t\t\n\n\t\t\t\nCategoriesCategories\n\tSelect Category\n\tAccommodating illness\n\tACTA\n\tActing\n\tactivism\n\tageism\n\talbum\n\tAlphabet Series\n\tanniversary\n\tAntisemitism\n\tArtificial Intelligence\n\tartists responsibility\n\tartists responsibility\n\tarts and education\n\tarts funding\n\tarts issues\n\tASL\n\tAudience\n\tAudio Theater\n\tAwards\n\tBest\n\tbody issues\n\tbook\n\tBritish\n\tBroadway\n\tBrooklyn\n\tcabaret\n\tCalendar of openings\n\tcelebration\n\tcensorship\n\tcharity\n\tchildren\n\tclimate change\n\tcomedy\n\tcomposer\n\tconcert\n\tcostume design\n\tCrisis News\n\tcultural sensitivity\n\tCurrent monthly calendar of openings\n\tDance\n\tDC Theatre Scene\n\tDemocracy\n\tdesign\n\tdialogue\n\tDigital Theater\n\tDinner theater\n\tDirector\n\tdisability in the theater\n\tDiscounts\n\tDiversity\n\tdrama criticism\n\tEdinburgh\n\temergency assistance\n\tenvironment\n\tEssay\n\tfamily\n\tfashion\n\tfeminist\n\tforeign artists\n\tgay\n\tgender\n\tGiveaway Contest\n\thistory\n\tHowlround\n\thumor\n\tImmersive theater\n\tImmigrants and immigration\n\tincome inequality\n\tinjuries\n\tInterview\n\tlabor\n\tLatest Calendar of Openings\n\tleaving at intermission\n\tLGBTQ\n\tLin-Manuel Miranda\n\tList\n\tlyrics\n\tMoment on stage\n\tmovies\n\tMuseum\n\tmusical\n\tNetathon\n\tNew Jersey\n\tNew York City\n\tNew York Theater\n\tNew York Theater Poll\n\tNew York Theater Weekly Summary\n\tNightlife\n\tObituary\n\tOff-Broadway\n\tOff-Off Broadway\n\topera\n\tOut of town\n\toutdoor theater\n\tperformance art\n\tPerformer\n\tPhotographs\n\tPlaywrights\n\tpoetry\n\tpolitics\n\tPolitics and the Arts\n\tpoll\n\tposter\n\tPreview\n\tPreview Guide\n\tProducing\n\tpuppetry\n\tQuizzes\n\trace\n\tracism\n\trap\n\trecording\n\treligion and theater\n\treopening\n\tResurrected review\n\trevival\n\tscript\n\tset design\n\tsexual harassment\n\tShakespeare\n\tshopping\n\tSite Specific\n\tSondheim\n\tsong\n\tspat\n\tspeech\n\tSponsored content\n\tsubscriptions\n\tTDF Stages\n\tTechnology\n\tThe Stage\n\tTheater about theater\n\ttheater and healing\n\tTheater and Social Media\n\tTheater architecture\n\tTheater Awards\n\tTheater Blog Roundup\n\tTheater community reaching out\n\tTheater etiquette\n\tTheater Festival\n\tTheater Lore\n\tTheater on Film\n\tTheater on TV\n\tTheater Online\n\tTheater Reviews\n\tTheater ritual\n\tTheater Tech\n\tTicket giveaway contest\n\tTickets\n\tTrends\n\tTweeting\n\tTwitter\n\tUncategorized\n\tvideo\n\tviolence on stage\n\tvisual art\n\twomen in the arts\n\tyouth\n\n\nLong-running Broadway Shows\n\t\nAladdin\nBook of Mormon, The\nChicago\nHadestown\nHamilton\nHarry Potter and the Cursed Child\nLion King, The\nMoulin Rouge\nWicked\n\n\t\n\nTheater blogroll\n\t\n2 a.m. theatre (inactive)\nAbout Last Night, Terry Teachout (inactive)\nAdam Szymkowicz Playwright Interviews\nAmerican Theatre Magazine\nAnother Eye Opens\nArts Journal Theater\nBad Boy of Musical Theater\nBitter Gertrude (Inactive)\nBroadway Abridged, Gil Varod (inactive)\nBroadway and Me, Jan Simpson\nBroadway Journal\nCall Me Adam\nDrama Book Shop Podcast\nEverything I Know I Learned from Musicals, Chris Caggiano (inactive)\nFeminist Spectator\nFrom The Rear Mezzanine, Oscar Moore\nGeorge Hunka\nHoward Sherman\nHowlround\nJK's Theatre Scene\nKen Davenport blog\nLibrary of Congress blog\nLincoln Center Theater blog\nOn Stage\nPataphysicalSci, Linda Buchwald\nStagezine, Scott Harrah\nThe David Desk 2\nThe Wicked Stage. Rob Weiner-Kendt\nTheatre Aficionado at Large, Kevin Daly\nTheatre Clique\nTheatre's Leiter Side\n\n\t\n\n\t\t\t© Jonathan Mandell and NewYorkTheater.me, Unauthorized use and/or duplication of this material without express and written permission from this site’s author  is strictly prohibited. Excerpts and links to the content may be used\n\nBluesky\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Copyright © 2026 New York Theater\n\nLoading Comments...\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tWrite a Comment...\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEmail (Required)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tName (Required)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWebsite\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\n\t\t\n\t\t\n\t\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t%d\n\t\t\t\t\t\t\n\t\t\n\n\nAdvertisementAdvertisement",
  "isFullReview": true,
  "bwwExcerpt": "Over the past year, there have been a number of plays and musicals dealing with anti-Semitism, some more powerfully than others. Harmon (whose prior works include the comedies “Bad Jews,” “Significant Other” and “Admissions”) takes the genre to the next level by not just depicting anti-Semitism or warning against it but in earnestly trying to wrestle with how to respond to it, including the limits of intellectually analyzing it, and whether to fight it or flee for safety.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PRAYER-FOR-THE-FRENCH-REPUBLIC-Opens-on-Broadway-20240108",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Up",
  "needsScoring": true,
  "llmScore": {
    "score": 75,
    "confidence": "high",
    "range": {
      "low": 70,
      "high": 80
    },
    "bucket": "Positive",
    "thumb": "Up",
    "components": {
      "book": 78,
      "music": null,
      "performances": null,
      "direction": null
    },
    "keyPhrases": [
      {
        "quote": "takes the genre to the next level",
        "sentiment": "positive",
        "strength": 4
      },
      {
        "quote": "earnestly trying to wrestle with how to respond to it",
        "sentiment": "positive",
        "strength": 3
      },
      {
        "quote": "some more powerfully than others",
        "sentiment": "neutral",
        "strength": 2
      }
    ],
    "reasoning": "Claude: The critic praises the playwright for elevating the genre and wrestling earnestly with complex themes, suggesting intellectual respect and appreciation for the work's ambition. | GPT-4o-mini: The review indicates a clear recommendation with praise for the thematic depth, though it lacks explicit enthusiasm.",
    "flags": {
      "hasExplicitRecommendation": false,
      "focusedOnPerformances": false,
      "comparesToPrevious": true,
      "mixedSignals": false
    }
  },
  "llmMetadata": {
    "model": "ensemble:claude-sonnet-4-20250514+gpt-4o-mini",
    "scoredAt": "2026-01-27T22:08:53.383Z",
    "promptVersion": "3.0.0",
    "inputTokens": 0,
    "outputTokens": 0
  },
  "ensembleData": {
    "claudeScore": 75,
    "openaiScore": 75,
    "scoreDelta": 0,
    "thumbsMatch": null,
    "expectedThumb": null,
    "needsReview": false,
    "needsReviewReasons": []
  },
  "dtliExcerpt": "“Why do they hate us?” So asks Pierre Salomon, a Holocaust survivor in his 80’s, to his 26-year-old grandson Daniel after being told that Daniel’s family, including Pierre’s adult daughter Marcelle, is relocating from France to Israel (despite not knowing Hebrew or virtually anyone there) because they genuinely fear for their safety due to rising anti-Semitism in “Prayer for the French Republic,” Joshua Harmon’s long-winded (running three hours and 15 minutes) but powerful drama of family, religious identity, politics, and occasional humor.",
  "sources": [
    "bww-roundup",
    "dtli"
  ],
  "bwwThumb": "Up",
  "textWordCount": 588,
  "textFetchedAt": "2026-01-27T14:33:36.775Z",
  "fetchMethod": "archive",
  "showScoreExcerpt": "“Though it’s surrounded by heavy clouds, Harmon’s play is plenty sharp and by no means gloomy...How much you respond to ‘Prayer’ may ultimately rest on your taste for such harangues. I admit to finding them hard to follow — not intellectually but emotionally. They leave me cold and a little suspicious.”\n\nRead more",
  "mergedFrom": [
    {
      "filename": "unknown--unknown.json",
      "outlet": "unknown",
      "critic": "Unknown",
      "mergedAt": "2026-01-28T21:15:21.911Z"
    }
  ],
  "rescoreReason": "scored on brief excerpt, now has fullText",
  "previousLlmScore": 75,
  "rescoreCompletedAt": "2026-01-29T14:31:51.965Z"
}