{
  "showId": "prayer-for-the-french-republic-2024",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://cititour.com/NYC_Broadway/Prayer-for-the-French-Republic/1194",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $92\n\t Buy Tickets\n\nCititour.com Review\n    “How do I tell him, at the end of his life, that his daughter is asking the same question he heard his parents ask when he was a little boy?”\n\nThese words, while haunting on the page, positively sting on the stage of Manhattan Theater Club’s Samuel J. Friedman Theater when they are uttered with heartbreaking urgency in Joshua Harmon’s three-hour drama “Prayer for the French Republic.”\n\nIn this extraordinary play -- first presented Off-Broadway by MTC in 2022 but even more uncomfortably au courant at this moment in time -- Harmon details the long history of antisemitism (in France and elsewhere) while also crafting a highly compelling drama about family dynamics. It’s the almost-ideal match of the personal and the political, especially as brought to vivid life by a superb ensemble cast under David Cromer’s razor-sharp direction.  \n\nThe above question is asked at the end of the play, set primarily in 2016 and 2017, by Marcelle (Betsy Aidem, in a truly magnificent performance), a brilliant if sometimes abrasive psychiatrist who has been dealing with the request of her Algerian-immigrant husband Charles (an excellent Nael Nacer) to move from Paris to Israel. \n\nCrimes against Jews have become more prevalent in France -- including the one which was committed as the play begins against her yarmulke-wearing adult son Daniel (a very fine Aria Shahghasemi) – and Charles fear for his and his family’s safety – but Marcelle is initially reluctant to leave the land her family has called home for generations.\n\nStill, despite her protestations, Marcelle may have always harbored some concerns even while relishing her bourgeois existence. As we discover in a series of beautifully etched scenes set in the 1940s, her great-grandparents (the sublime Nancy Robinette and Dniel Oreskes) luckily avoided being arrested during World War II. Meanwhile, her grandfather Lucien (Ari Brand) and her father Pierre (Ethan Haberfield as a young man, and the superb Richard Masur as the eighty-something version) somehow made it back from the concentration camps, yet most of her family didn’t survive. \n\nMoreover, as she’s reminded by her insensitive brother Patrick (a grating Anthony Edwards) -- who quasi-narrates the work and provides much of the family backstory – it may have been no accident that their mother was Catholic and raised her children without much sense of either religion. A man of little faith in most ways, Patrick is nonetheless resolved to stay put in Paris, stubbornly convinced that because he and his family do not look or act Jewish, they will always be safe.\n\nWhile America might have once seemed a “safer” option than Israel, Marcelle doesn’t need to read the headlines to realize life in the U.S. may have changed (and ultimately does) under the presidency of Donald Trump. For one thing, her home has been “invaded” by Molly (a fine Molly Ranson), a distant college-aged cousin from the Upper East Side with an equally strong disdain of America’s new commander-in-chief and the “apartheid” policies of Israel -- and who isn’t letting a little shared blood stopping her from pursuing a relationship with Daniel. \n\nAnd if anyone ever needs another opinion – about anything – Marcelle and Charles’ moody but fiercely intelligent daughter Elodie (a brilliant Francis Benhamou, dazzlingly handling a complex mid-play monologue) always has one at the ready – and a point after point after point she’s determined to make.\n\nWith so many characters and so many themes, the work could feel overwhelming. But Cromer, as he has done so often, ensures the show flows smoothly and feels much shorter than its running time. However, neither the play, which can feel overwritten at times, nor the production is perfect. For example, Takeshi Kata’s set design is visually too spare for such a long show while Sarah Laux’s costumes feel uninspired.\n\nStill, we should be profoundly grateful that a work of such ambition, scope and importance has made it to the stage, not once but twice. The many questions the play poses, not just Marcelle’s, are like most prayers: necessary but not easily answered.\n\n    \t    By Brian Scott Lipton\n\nVisit the Sitehttps://www.manhattantheatreclub.com/Open/Close DatesOpening 1/9/2024Closing 2/18/2024\nTheatre Info\nSamuel J. Friedman Theatre261 West 47th Street New York, NY 10036\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 762,
  "archivePath": "data/archives/reviews/prayer-for-the-french-republic-2024/cititour-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:34:52.155Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}