{
  "showId": "prayer-for-the-french-republic-2024",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=-N6BBQS",
  "publishDate": null,
  "fullText": "Molly Ranson, Francis Benhamou. Photo: Jeremy Daniel What a difference a few years makes: Prayer for the French Republic, returning after an acclaimed 2022 run at MTC's City Center venue, remains (despite a few structural oddities) a powerful piece, but current events -- especially the demonization, on American campuses, of Jewish students because of Israel's brutal military actions in Gaza following the atrocities committed by Hamas -- have given Joshua Harmon's drama an extra gut punch. As fear of antisemitism proceeds like an airborne virus through a solidly bourgeois Parisian family, its members argue as if their lives depend on it, as indeed they might. Their words are, by turns, candid, caustic, hilarious, and optimized for drawing blood. What they have to say is all too relevant in this unhappy global moment. Middle-aged siblings Marcelle and Patrick are descendants of the Salomons, their roots stretching back a thousand years. The family's piano business, founded in the 1820s, is winding down; it largely exists to provide the elderly patriarch Pierre with a place for his afternoon nap. Patrick is thoroughly assimilated; after all, he notes, their mother was Catholic. Marcelle, a psychiatrist, is married to Charles Benhamou, a Sephardic physician whose family fled Algeria in the wake of the 1962 massacres. (\"Many, many centuries they lived there, and then...,\" Marcelle says, her voice trailing off.) Moderately observant, Marcelle and Charles are bemused that their son, Benjamin, has become openly religious, refusing when in public to hide his kippah with a baseball cap; this minor irritation becomes a major issue, however, when Benjamin is assaulted on the street, not for the first time, by Jew-hating thugs. As cracks form in the foundation of the Benhamous' seemingly assimilated existence, Charles, who has already fled one homeland, suddenly proposes that they move, en famille, to Israel. Marcelle, horrified, resists this proposition until the murder of the Jewish Dr. Sarah Halimi (a real-life crime, committed by a killer shouting \"Allahu Akbar\") annihilates her sense of security. As she and Charles debate their next move, the action flashes back to 1944 as Irma and Adolphe, Marcelle and Patrick's grandparents, sit out the war in seclusion, having been spared deportation by a fluke. They are profoundly alone: A daughter has fled to Cuba, a son was killed, and another son, Lucien, has gone into hiding with his wife and children. Lucien and his boy, Pierre, are the only returnees, refusing to speak about their time in the death camps. To stay or to go? The question is almost absurd, since the Benhamous have lived in France for a millennium. But, in 1944, they face exile and murder, and in 2016, the coming presidential election looks to be a match between Emmanuel Macron and the far-right demagogue Marine Le Pen; even on the left, allies are hard to find. As Marcelle bitterly notes, Jews, who make up one percent of the nation's population, figure in forty percent of its hate crimes. But is Israel, aptly described by Patrick as \"the most contentious strip of land in the most volatile region in the world,\" really any better?\" Aren't the Benhamous deliberately putting themselves in harm's way? Then again, as Charles grimly notes, an escape route is a time-tested necessity. \"We just keep criss-crossing the Mediterranean,\" he says, adding, \"What can you do? If's the suitcase or the coffin.\" The best news about David Cromer's deeply nuanced production is that the four actresses who comprise its heart and soul have returned, each of them delivering the playwright's arguments with irrefutable force. In many ways, the action turns on the pragmatic, crisply professional Marcelle, whose descent into fear is made vividly real by Betsy Aidem. Initially coming across as unflappable -- \"Your French is very good,\" she tells a foreign visitor in a tone suggesting that C-minus is a perfectly respectable grade -- she holds her own among her contentious loved ones. (When Patrick reminds of her Anne Frank's famous assertion that people are good at heart, she replies, \"Yes, she did say that, and a few months later she was dead.\") But she also precisely graphs the conflict between her character's growing anguish -- Can she abandon her career and leave behind the increasingly frail Pierre? -- and her fiercely protective nature. Furious at being dragged from bed at the early hour of noon, looking like a tumbleweed that crashed into a haystack, Francis Benhamou is instantly memorable as Elodie, Marcelle and Charles' brilliant, manic-depressive daughter. (Turning her ire against her mother, she snarls, \"I will never understand how you are a person people seek for compassionate treatment.\") A black-belt debater, Elodie saves her best counterpunches for anyone who uses Zionism as a cudgel against all Jews. (But don't get her started on Benjamin Netanyahu...) Nobody writes extended rants like Harmon, and he gives Elodie a real sizzler that Benhamou parses with astonishing lucidity, considering that it's a tidal wave of free associations and takedowns expressed in a multitude of sentence fragments. Watching from the sidelines is Molly Ranson as Molly, the Benhamous' American cousin, who may or may not have designs on Benjamin. Faced with a parade of assertive personalities, the actress underplays expertly, nearly derailing Elodie, in full oratorical fury, with a single murmured comment. (\"Are you familiar with this thing called whataboutism?\") Then again, as Donald Trump enters the White House, Molly learns something about feeling like a stranger in her native country. Nancy Robinette makes a stunning impression as Irma, who, having just passed away, returns from the grave to joyously raise a fist against Hitler and revel in the fact that, in a time of world war and genocide, she managed to die at home. The play is, at times, inelegantly structured, with an overreliance on direct address to communicate the families' complex histories; many of these speeches are assigned to Patrick, who resides uneasily on the edge of the action, interacting with characters from both time frames. (Compared to Richard Topol, who created the role, Anthony Edwards is relatively flat, although he improves markedly when Patrick attacks Marcelle over what he sees as foolish identity issues.) Some of the script's awkwardness is reflected in Takeshi Kata's set design, which doesn't fully meet the challenge of representing two apartments (as well as other locations) onstage. Still, Harmon's dramaturgy allows for powerful juxtapositions, for example when Lucien, torn with anguish, recalls the murder of his daughter, Colette, while, upstage, a first-night-of-Hanukkah ceremony unfolds in 2016. Cromer makes the most of this moment as well as the melancholy rendition of \"The Marseillaise\" that closes the play. There are fine contributions from Nael Nacer as the deeply unsettled Charles; Ari Brand as Lucien, hollowed out from suffering; Ethan Haberfield as young Pierre, mute with grief and bucking against joining the family business; and Aria Shahghasemi, casually charming in the seriously underwritten role of Benjamin. Richard Masur makes a stunning, eleventh-hour appearance as the elderly Pierre, providing a coolly pessimistic wrap-up that also serves as a benediction of sorts. The stage is hauntingly lit by Amith Chandrashaker, whose time-of-day looks add shading and depth to each stage picture; he also provides some beautifully wrought interior effects keyed to practical lamps onstage. Sarah Laux's costumes efficiently evoke the prosperity of the present with lives lived under wartime privations. Daniel Kluger's original music and sound design contrast delicate clarinet passages with sirens, street traffic, radio broadcasts, and voices from a synagogue service where the prayer of the title is recited. What keeps the play riveting is the vigor with which Harmon considers every side of the central question, creating confrontations from which nobody emerges unscathed. The real problem, Elodie asserts, is the ahistorical thinking that has taken over, leaving those who forget the past doomed to repeat it. Not for the first time, she may be right: The elderly Pierre, by way of explaining France's collective amnesia, recalls placing in the store a photo of Colette presenting flowers to the President of France. \"And you know something?\" he says. \"No one has ever looked at [it] and asked, 'Where's your sister?'\" Plenty of ugly truths are on display at the Friedman just now and if you're tempted to dismiss Prayer for the French Republic as a case of special pleading, today's Guardian reports on the hate speech that flooded X following the recent appointment of Gabriel Attal as France's prime minister. Attal, you won't be surprised to hear, is Jewish; as a bonus for bigots, he is also gay. \"Why do they hate us?\" wonders Pierre. Because, it seems, they can. --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1448,
  "archivePath": "data/archives/reviews/prayer-for-the-french-republic-2024/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:37:21.624Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}