{
  "showId": "prayer-for-the-french-republic-2024",
  "outletId": "nystagereview-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nystagereview.com/2024/01/09/prayer-for-the-french-republic-give-thanks-for-this-powerful-drama/",
  "publishDate": null,
  "fullText": "★★★★★ Joshua Harmon's superbly staged and acted drama arrives on Broadway after its heralded premiere at Manhattan Theatre Club. It was probably wishful thinking to have hoped that Prayer for the French Republic would have felt less relevant since its premiere nearly two years ago. Joshua Harmon’s ambitious play takes place in dual time frames, 1944-1946 and 2016-2017, and deals with such subjects as anti-Semitism, the election of Donald Trump, and failed election (thankfully) of Marie Le Pen in France. Now we are facing a dramatic rise in anti-Semitism worldwide, the ascendency of the far right in France and other European countries, and the very possible re-election of Trump to the presidency. So don’t head to the Samuel J. Friedman Theatre looking for a pick-me-up. What you’ll get instead is a superb drama that only seems to have gained in power and intensity with this Broadway transfer featuring many cast members from the original Manhattan Theatre Club off-Broadway production. The play revolves around the French Salomon family, one of whose members, Patrick (Anthony Edwards, ER), also serves as a wry narrator. He introduces us to his extended clan, including his psychotherapist sister Marcelle (Betsy Aidem), her husband Charles (Nael Nacer), and their twentysomething children Elodie (Francis Benhamou) and Daniel (Aria Shahghasemi). The family has lived in the country for generations, the owners of once nearly two dozen piano stores that have been reduced to only one in Paris, manned by Pierre (Richard Masur), Marcelle and Patrick’s elderly father. [Read Roma Torre’s ★★★★☆ review here.] The Salomons, who are hosting a visit from Molly (Molly Ransom), a naïve, young American cousin, have become frighteningly aware of the rising anti-Semitism in their country. In the opening scene, Daniel, who has become increasingly religious, has just been brutally beaten by hooligans who know he’s Jewish because of the yarmulke he’s taken to constantly wearing. His terrified parents react differently, with Marcelle insisting on calling the police and Charles becoming so terrified that he insists that the family pick up roots and move to Israel. Their anxieties are mirrored by the plight of Marcelle’s grandparents Irma (Nancy Robinette) and Adolphe (Daniel Oreskes), seen living in the same Parisian apartment decades earlier after having somehow been spared by the Nazis. Their son Lucien (Ari Brand) and grandson Pierre (Ethan Haberfield) were not so lucky and were sent to a concentration camp (Pierre is the younger version of the character we see later). Miraculously, they manage to survive and return to the apartment to live, although not without suffering great loss. Harmon, author of the much more comic Bad Jews, juggles these time-shifting narrative balls with skill, aided greatly by David Cromer’s expertly fluid staging that makes frequent use of the revolving turntable employed in Takeshi Kata’s realistic set. Even more impressive, however, is the playwright’s ability to blend deeply moving domestic drama with incisive debates about social and political issues. There is much speechifying in this three-hour play, perhaps too much for some viewers, with the most glaring example being a scene late in the evening in which the characters attempt to understand the reason for the anti-Semitism that goes back centuries. But Prayer for the French Republic earns its didacticism thanks to its well-drawn characterizations, beautifully written dialogue, and powerful situations, not to mention generous doses of welcome humor. It’s the rare sort of play that gives you a lump in your throat one minute and provides a belly laugh the next. The many intellectual debates are often as character-revealing as they are polemical, as when Elodie explains her strongly held positions about Israel and America to Molly in what becomes a ranting monologue as the verbally outclassed visitor can barely get a word in edgewise. Patrick’s emotional distance from his sister becomes vividly illustrated by his vehement disdain for her embrace of Jewish rituals, including the Passover Seder, that he repeatedly refers to as “bullshit.” There are refreshingly lighter moments as well, including the sweetly amusing mutual flirtation between Daniel and Molly, whose youthful innocence is conveyed by her constant rhapsodizing about the deliciousness of Parisian croissants. The scene in which she swoons as he shirtlessly serenades her with a Bob Dylan song while unimpressively playing guitar wouldn’t be out of place in a CW series yet works perfectly here. The performances by the ensemble, both veterans and newcomers, are exemplary, with Aidem perhaps the standout as the mother desperately trying to hold everything together in the face of eternal forces. Only Edwards seems a bit out of place, and not only because of his celebrity relative to the rest of the cast. But his performance may sharpen as the run goes on. Arriving shortly on the heels of the similarly bracing Appropriate, Prayer for the French Republic proves that straight plays can still pack a wallop on Broadway even without big stars to entice the tourists. Of course, it’s no coincidence that both dramas are being presented by non-profit theaters. Prayer for the French Republic opened January 9, 2024, at Samuel J. Friedman Theatre and runs through March 3. Tickets and information: manhattantheatreclub.com Frank Scheck has been covering film, theater and music for more than 30 years. He is currently a New York correspondent and arts writer for The Hollywood Reporter. He was previously the editor of Stages Magazine, the chief theater critic for the Christian Science Monitor, and a theater critic and culture writer for the New York Post. His writing has appeared in such publications as the New York Daily News, Playbill, Backstage, and various national and international newspapers.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 929,
  "archivePath": "data/archives/reviews/prayer-for-the-french-republic-2024/nystagereview-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:40:10.224Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}