{
  "showId": "prayer-for-the-french-republic-2024",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/PrayerfortheFrenchRepublic.html",
  "publishDate": null,
  "fullText": "Broadway & Musical TheaterMusic & AudioPerforming ArtsActing & TheatermusicEvent Ticket SalesMusic\n\n\n\n\n\n\n\n\n\n\n            \t\t                  \n                                            \n \n\n\t\n\n\n \n \n\n\n\n Past ReviewsBroadway Reviews\n\nTheatre Review by Howard Miller - January 9, 2024\n\nPrayer for the French Republic by Joshua Harmon. Directed by David Cromer. Set design by Takeshi Kata. Costume design by Sarah Laux. Lighting design by Amith Chandrashaker. Original music and sound design by Daniel Kluger. Hair and makeup design by J. Jared Janas. Vocal coach Gigi Buffington.\nCast: Betsy Aidem, Francis Benhamou, Ari Brand, Anthony Edwards, Ethan Haberfield, Richard Masur, Nael Nacer, Daniel Oreskes, Molly Ranson, Nancy Robinette, and Aria Shahghasemi.\nTheater: Samuel J. Friedman Theatre, 261 West 47th Street, between Broadway and 8th Avenue\nTickets: Telecharge.com\n\nThe reason is the parallel growing surge of antisemitism in the United States. Suddenly, a play about a Jewish family in crisis in 2016 Paris could just as well be about a Jewish family in crisis in New York, and what a couple of years back might have been seen as an overreaction to a perceived threat now seems quite plausible: deciding whether to stay or to pull up stakes and leave the only home you've ever known and move to a place where you may have to struggle with establishing yourself, but where at least no one even blinks at your identity.\n\nUnder the sure hand of director David Cromer, Prayer for the French Republic has found a thoughtful balance as it seesaws between a domestic drama and a series of engrossing and passionate socio-political history lessons. Its three-hour running time (with two intermissions) rarely feels like it is in need of reigning in, at least not until the very end, which insists on wrapping things up like the summary statement after a lengthy debate. Still and all, that only takes up a few minutes of our time in a production that is sharp as a tack and blessed with a wonderful cast that includes several who have followed it to Broadway from the Manhattan Theatre Club. It also helps that the playwright has provided an ample amount of humor to keep a mood of increasing anxiety from becoming overwhelming.\n\nPrayer for the French Republic, whose title refers to an actual prayer recited in French synagogues and which we hear in English during a blackout, opens with a brief introduction by one Patrick Salomon (Anthony Edwards), in which he tells us about the five generations of the Salomon piano business in Paris and of the family's long and deep ties to France, which has the largest Jewish population in Europe.\n\nMarcelle and Molly's conversation is interrupted when in burst Charles and Daniel. Daniel, who teaches math at a Jewish day school, was attacked and beaten about the head when he was seen walking around the streets wearing a yarmulke. While he has not been greatly injured, the assault triggers the entire rest of the play, which is focused on the Jewish diaspora (Charles is a Sephardic Jew whose family fled from Algeria and resettled in France during the Algerian decolonization war) and the possibility of yet another move for some or all of the family, this time to Israel.\n\nMuch of the rest of the play revolves around domestic arguments and political debates, including plenty of opportunities for Molly to toss in her narrowly focused liberal/progressive New Yorker views on the Middle East. Because Joshua Harmon has provided such intelligent, often astringent, dialog, there is almost no repetition of ideas. It seems we are privy to the entire history of the Salomon family (though more about the Algerian Benhamou family story would be welcome) as well as a wide range of topics ranging from assimilation to isolationism and even genocide.\n\nYes, even that. For in alternating scenes, we are taken back to the 1940s in order to spend time with Marcelle's great-grandparents Irma (Nancy Robinette) and Adolphe (Daniel Oreskes), who somehow managed to survive the Nazi occupation of France while living in isolation in their Paris apartment. Most of their family members were not so fortunate, though they are eventually reunited with their son Lucien (Ari Brand) and grandson Pierre (Ethan Haberfield), who shows up again late in the play as an elderly man (Richard Masur), still running the piano store and ready to join the argument.\n\nClearly, Prayer for the French Republic covers a lot of territory, yet it never flags or overwhelms, thanks to its carefully crafted script, direction, and committed performances. You will not soon forget these characters or the difficult decision they face as they struggle with what is yet another piece of the endlessly complex immigrants' story.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 763,
  "archivePath": "data/archives/reviews/prayer-for-the-french-republic-2024/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:43:29.527Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}