{
  "showId": "prayer-for-the-french-republic-2024",
  "outletId": "theater-pizzazz",
  "outlet": "Theater Pizzazz",
  "criticName": "Stuart Miller",
  "url": "https://www.theaterpizzazz.com/prayer-for-the-french-republic-2/",
  "playbillVerdictUrl": "https://www.theaterpizzazz.com/prayer-for-the-french-republic-2/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "Extended Again thru March 3 . . . Theater Review by Stuart Miller . . . . Joshua Harmon clearly understands the delicate magic of theater. Prayer For the French Republic opens in 2016 with a Jewish family in Paris plunged into crisis when 26-year-old Daniel returns home for dinner after being beaten up for wearing his yarmulke. The family, understandably, freaks out; but, midway through the act the play’s narrator, Patrick, the brother of Daniel’s mother Marcelle, returns to the stage and takes us back in time. Patrick describes his elderly great-grandparents in Paris in 1944, how they survived the occupation as one child and her family fled for Cuba while the other two were detained by the Nazis. He mourns knowing so little about them, but as he imagines how they must have discussed their missing children and grandchildren regularly, his great-grandmother, Irma, interrupts him from across the decades, saying, “We don’t talk about our children that much.” After her husband, Adolphe softly disputes this, Patrick asks about those children and grandchildren (one is Pierre, his father), Harmon’s play gently shifts to a beautiful and poignant scene about storytelling, hope and denial. The couple bicker over what could have been done differently, before Adolphe lovingly gives Irma what she desperately needs: an imagined life for these missing offspring, hiding out in the mountains, making do, waiting to return to the family home . . . where they will resume the snarling and fighting that occurred at every family get together. (This fantasy gains emotional heft because we already know Pierre is still alive in Paris in 2016, yet realize not all of those missing could possibly have survived, which is later confirmed when Pierre and his father are the only ones to return.) All of the 1940s scenes are similarly compelling and emotionally resonant, including one in which Irma steps forward to tell us about her own death in 1946—calling a Jew dying a natural death in her home in Europe a triumph, but doing it in a surprisingly profane way. Yet this same Joshua Harmon can’t help seeing the theater as a blunt force instrument for scoring political points. In the 2016 scenes, the attack on Daniel (Aria Shahghasemi) prompts his father Charles (Nael Nacer) to say Europe is unsafe for Jews. He wants to move to Israel even though they don’t speak Hebrew and, of course, the Middle East is never safe. His wife Marcelle (Betsy Aidem) initially resists, saying she is French to the core—she says the solution would be for Daniel to cover his yarmulke with a baseball cap. As everyone jumps into the fray the arguments swirl and then repeat. Patrick (Anthony Edwards) is rabidly secular and an outsider in his own family. Daniel’s hyper-opinionated and manic-depressive sister Elodie (Francis Benhamou, the standout in a strong cast) is prone to political tirades that go too long . . . even when she’s occasionally right. Molly (Molly Ranson) is a distant cousin and surprise guest, a college student newly arrived from New York who is young and American enough to call out Israel for its settlements and apartheid policies. Molly’s comment prompts a disingenuous retort from Elodie about Molly being a New Yorker living on stolen lands . . . without acknowledging that the atrocities against the Lenapes happened centuries ago while Israel’s policies are ongoing. Given David Cromer’s track record as a director of great subtlety in plays like Our Town, Tribes, and The Sound Inside, it was disappointing that he let this play run for three hours with so much preaching. For instance, a funny and touching scene in which Charles tells Daniel and Molly the family secret behind his Hanukkah donuts is undercut when Charles veers into a history lesson about Jews in Algeria. While the show is well-paced, sometimes funny, and often quite involving, cutting 20 minutes could have heightened the impact of what remained. Still, there’s no getting around Harmon’s political agenda. For instance, when Charles argues for moving to Israel, no one points out that the family would be safer on the Upper West Side. (In the United States, it’s Blacks who can never feel truly safe, but Harmon doesn’t ask his white, Jewish New York theater audience to think about that correlation to the European Jews.) Nor does anyone mention Canada, where they wouldn’t even have to learn a new language. The play’s ideas are often not fairly fleshed out because Harmon is not arguing in good faith—he seems to be saying Israel is the only safe space for Jews. Anti-Semitism was relevant before October 7, 2023, and is obviously more so now, but more nuance and less speechifying would make any discussion of the topic more powerful. A long stretch about why everyone hates the Jews (“because of Christ,” “It’s about money,” “for controlling everything”) that ends with a proud rant from Elodie about resilience, has nothing to do with the characters’ arcs but is just a way for Harmon to score points with the audience. Branden Jacob-Jenkins’ new play, Appropriate, is haunting because it asks the audience difficult questions that lack easy answers. Harmon is just trying to give us the answers. His answers. Many in the theater were definitely in agreement, but I still wish Harmon had trusted them to think more deeply. As I was leaving the theater, I overheard a woman who asked her friend if she’d liked the play, to which the friend quipped, “Besides being hit on the head?” And the first woman responded, “Repeatedly.” Prayer for the French Republic. Through February 18 at the Samuel J. Friedman Theatre (261 West 47th Street, between Broadway and Eighth Avenue). Running time: three hours with two intermissions. www.manhattantheatreclub.com",
  "isFullReview": true,
  "textWordCount": 956,
  "archivePath": "data/archives/reviews/prayer-for-the-french-republic-2024/theater-pizzazz--stuart-miller_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:08:46.803Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}