{
  "showId": "prayer-for-the-french-republic-2024",
  "outletId": "theaterlife-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://theaterlife.com/prayer-for-the-french-republic-1-2-3/",
  "publishDate": null,
  "fullText": "[Note: some of what follows is adapted from my review of the Off-Broadway production of this play in 2022.] January 12, 2024: If there’s one thematic word that sums up the general impression of the post-pandemic theatre, it’s racism. Just the other night, Appropriate,the first play I saw this year, revealed the agonized struggle of a Southern family in coming to terms with the possibility that their late father was very likely a violent bigot. The way that Appropriate exposes its dysfunctional family’s behavior in the face of a racist past is strikingly similar in tone to the turmoil stirred by the threat of anti-Semitism to the French family in Prayer for the French Republic, by Joshua Harmon (Bad Jews, Significant Other). Jews, of course, are not a race, yet few dispute that anti-Semitism falls within the parameters of racism. Anyway, Jewish Lives Matter. [Note: some of what follows is adapted from my review of the Off-Broadway production of this play in 2022.] January 12, 2024: If there’s one thematic word that sums up the general impression of the post-pandemic theatre, it’s racism. Just the other night, Appropriate,the first play I saw this year, revealed the agonized struggle of a Southern family in coming to terms with the possibility that their late father was very likely a violent bigot. The way that Appropriate exposes its dysfunctional family’s behavior in the face of a racist past is strikingly similar in tone to the turmoil stirred by the threat of anti-Semitism to the French family in Prayer for the French Republic, by Joshua Harmon (Bad Jews, Significant Other). Jews, of course, are not a race, yet few dispute that anti-Semitism falls within the parameters of racism. Anyway, Jewish Lives Matter. David Cromer’s dynamically directed Manhattan Theatre Club production of Harmon’s well-regarded, stimulating, if overblown play, has moved across town from its Off-Broadway origins at the City Center to the MTC’s Broadway home at the Samuel J. Friedman Theatre. Its premise can be summed up briefly: in 2016 France, a French Jewish family is so disturbed by the growing outbursts of violence against Jews (the 2015 Charlie Hedbo shooting among them) that it considers moving to Israel. This basic situation is so fraught with personal, familial, and political vibrations, however, that Harmon has turned it into a three-act, three-hour play. Consequently, this allows for seriously expansive coverage of its issues while simultaneously weakening its dramatic, as opposed to rhetorical, impact. The setup, introduced by the cynically nonobservant, middle-aged Patrick Salomon (Anthony Edwards, Children of a Lesser God, TV’s “ER”), who serves throughout as narrator, is this: Patrick’s moderately observant sister, Marcelle (Betsy Aidem, Leopoldstadt, returning from the OB production), a psychiatrist, and her husband, Charles Benhamou (Nael Nacer, in his Broadway debut), a physician and Algerian refugee, live in a Paris apartment with their youthful but grown children. Daniel (Aria Shahghasemi, also in his Broadway debut) is a math teacher at a Jewish school, and Elodie (Francis Benhamou, of the OB production, another Broadway newbie) is very well informed but manic depressive. Marcelle and Patrick are the offspring of Pierre Salomon (Richard Masur, of countless stage and screen appearances), an octogenarian seller of pianos whose family has been in that line—their names are on the pianos—going back to the mid-nineteenth century. A Salomon piano dominates the set. Soon we’re embroiled in conversations and arguments about what it means to be Jewish, what it means to be French, the relative piety or secularism of the characters (Daniel being the most religious, although his motives are teased), whether one should flaunt one’s beliefs by outward signs (Daniel’s kippah/yarmulke), the rise of right-wing extremist Marine Le Pen, the defeat of Hillary Clinton, and so on. Also lighting fires are disagreements about personal safety, whether the family or members of it should move to Israel, the pros and cons of Israeli politics, the degree of security one can expect in the Middle East, the difficulty of starting over in a new country, and so on. The current Israeli-Palestinian conflict had not yet erupted, but it burns hotly beneath all the palaver about moving to Israel, especially when Benjamin Netanyahu’s name is contemptuously cited. In all honesty, I found myself far more intensely focused on the argumentative exposition than even two years ago because of what’s happening now in the Middle East; I suspect most audiences are similarly attentive. Perhaps because he wants to expand the situation to demonstrate the family’s deep roots in France, Harmon uses flashbacks to the years 1944-1946 (during and right after the Nazi occupation) to show Marcelle and Patrick’s great-grandparents, Irma (Nancy Robinette, The Curious Incident of the Dog in the Night-Time, another member of the OB cast) and Adolphe (Daniel Oreskes, Oslo), their grandfather. We eventually meet the old couple’s surviving son, Lucien (Ari Brand, My Name Is Asher Lev, also from the OB company), and his teenaged son (destined to be the father of Marcelle and Charles), young Pierre (Ethan Haberfield, Mary Poppins). (Pierre, as noted, appears as an old man, late in the play.) These scenes from the past have a certain interest in filling in family history, and explaining their luck in escaping Nazi extermination, but they also tend to bog the episodic play down and draw it out longer than need be. To help connect these scenes to the present, Patrick, like the Stage Manager in Our Town, serves as interlocutor, including his taking considerable time to explain the history of Jewish oppression in France, with vivid descriptions of the suffering people endured. In preparation for writing the play, Harmon traveled to France to do research. The results, which can be fascinating, come with the baggage of didacticism. The play works best when situated in the 2016 apartment where the quarrelsome Benhamou family, their visiting American guest, a distant cousin named Molly (Molly Ranson, Plaza Suite, another OB returnee), and—when he reluctantly takes part in a Seder—Patrick, are present. The family is deeply loving, virulently contentious, but wittily sardonic, providing welcome comic leavening to the overall seriousness. Elodie, for example, vehemently challenges as anti-Zionist the politely critical comments made by the liberal American guest she’s only just met. Without explanation for the shift, however, a riveting later scene has her spew her polemics, geyser-like, to Molly as if someone magically removed the chip from her shoulder. Essentially, this is good old discussion drama, where disagreements strike sparks that make you question your own beliefs. Harmon often succeeds at taking both sides so that you don’t feel as if he’s putting his thumb on the scales, at least not too heavily. And his dialogue and situations are always richly stage-worthy without going over your head. Prayer for the French Republic sometimes borders on situation comedy so you occasionally laugh at awful things, including allusions to similar events in the U.S.A. The OB design team is on hand to more or less replicate its work for the larger venue. Scenic designer Takeshi Kata again uses sliding units and a revolving stage to allow for multiple shifts from scene to scene, providing a cinematic flow, although the décor itself is rather bland. Sarah Laux’s believable costumes and Amith Chandrashaker’s atmospheric lighting do nicely without drawing attention to themselves, and director Cromer gets quality performances from his ensemble. If I had to single out one performance as especially distinctive it would be that of Francis Benhamou (she uses the male spelling of her given name) for how effectively she brings a snarky sarcasm to her every line. On the other hand, her smarmy tone is distinctly American, which is linked to another problem. And that problem—as it was Off Broadway—is how very little French atmosphere there is. In a play understood to be spoken in French, the colloquial English, with lots of “bullshits” and “fucks,” cannot sound other than American. It’s easier to accept the convention in a translation, but for a play originally written in English it would be useful if, somehow, a hint of the language supposedly being spoken could be provided. Perhaps a “Merde!,” “Putain!,” or “Connerie!” here or there would help. We do, at least, get a full-on French rendition of the “Marseillaise.” Prayer for the French Republic, which takes its title from a prayer—spoken in the play—that has been part of French Jewish services for a couple of hundred years, is a worthwhile, even necessary play. For all the Jewish-related plays on Broadway over the years, I think this one might be the most Jewish of them all, one that could not, now, be more relevant. A tighter structure and a shorter run time would help greatly but, even as it is, audiences will find much here to appreciate and from which to learn. Prayer for the French Republic ***1/2Samuel J. Friedman Theatre261 W. 47th Street, NYCThrough March 3, 2024Photography: Jeremy Daniel",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 50,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1475,
  "archivePath": "data/archives/reviews/prayer-for-the-french-republic-2024/theaterlife-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:45:35.042Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "scoreSource": "extracted-rating",
  "scoreConfidence": "medium",
  "extractedRating": "1/2"
}