{
  "showId": "prayer-for-the-french-republic-2024",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.theaterscene.net/plays/broadway-plays/prayer-for-the-french-republic-2/joel-benjamin/",
  "publishDate": null,
  "fullText": "Posted on January 15, 2024 by Joel Benjamin in Broadway, Plays Molly Ranson, Francis Benhamou, Nael Nacer, Aria Shahghasemi, Betsy Aidem and Anthony Edwards in a scene from the Manhattan Theatre Club production of Joshua Harmon’s “Prayer for the French Republic” at the Samuel J. Friedman Theatre (Photo credit: Jeremy Daniel) [avatar user=”Joel Benjamin” size=”96″ align=”left”] Joel Benjamin, Critic[/avatar] Is it just a coincidence or some karmic force that has materialized several Broadway productions focusing on anti-Semitism and the Holocaust: Tom Stoppard’s Leopoldstadt, Barry Manilow/Bruce Sussman’s Harmony, and, now, Joshua Harmon’s Prayer for the French Republic? Harmon’s richly rewarding drama, a Manhattan Theatre Club production at the Samuel J. Friedman Theatre, follows the Salomon/Benhamou extended family in Paris from World War II to 2017, putting a human face on anti-Jewish sentiments and violence. An earlier version of the play was produced by MTC at New York City Center Stage I during the winter of 2022 with half of the same cast as this Broadway production and won the Drama Desk Award for Outstanding Play and the Outer Critics Circle Award for Outstanding New Off Broadway Play for the 2021- 2022 season. If one hasn’t perused the character list in the program notes, it might take a while to unravel all the familial connections. The fascinatingly complex revolving set by Takeshi Kata helps greatly by exposing the domiciles of each family in the different time periods as does Amith Chandrashaker’s soft, almost faded lighting for the period scenes and Sarah Laux’s historical and character-perfect costumes. Betsy Aidem and Molly Ranson in a scene from the Manhattan Theatre Club production of Joshua Harmon’s “Prayer for the French Republic” at the Samuel J. Friedman Theatre (Photo credit: Jeremy Daniel) As if to make light of the genealogical complexities of the characters, Harmon opens with Marcelle Salomon-Benhamou (Betsy Aidem, forceful, yet sympathetic) tediously explaining the family tree to her houseguest, distant cousin Molly (Molly Ranson, making a solid human out of a ditzy character). Marcelle’s family, the Salomons, have made pianos for five generations. Her father Pierre (a superb Richard Masur who makes the most of his appearance late in the play) is aging out of selling pianos and, with no one to take on the responsibility, the business is coming to an end. Marcelle’s brother Patrick—who also plays the Narrator—(Anthony Edwards, coolly agnostic to perfection), refuses to consider the piano game. Similarly, twenty-something Daniel (Aria Shahghasemi, youthfully passionate), Marcelle’s son with husband Charles Benhamou (Nael Nacer, quietly intensive) has other fish to fry as does their terminally sardonic daughter, Elodie (Francis Benhamou, explosive). Molly Ranson and Francis Benhamou in a scene from the Manhattan Theatre Club production of Joshua Harmon’s “Prayer for the French Republic” at the Samuel J. Friedman Theatre (Photo credit: Jeremy Daniel) While Marcelle is lecturing Molly, Daniel appears all bloodied and battered, the victim of an anti-Semitic attack. Marcelle is furious because Daniel, who teaches at a religious school, insists on wearing on the street his yarmulke, or kippah, the headdress that clearly defines him as a Jew. Marcelle hysterically derides Daniel for advertising his Judaism. The Benhamous are at a crossroad: should the stay in their beloved France or move to Israel? Harmon also takes us back to 1944-46 where Marcelle and Patrick’s great grandparents, Irma and Adolphe Salomon of the piano dynasty (Nancy Robinette and Daniel Oreskes, both quietly brilliant) rode out the Nazi occupation of Paris almost totally unscathed. Nancy Robinette, Daniel Oreskes, Richard Masur, Ari Brand and Ethan Haberfield in a scene from the Manhattan Theatre Club production of Joshua Harmon’s “Prayer for the French Republic” at the Samuel J. Friedman Theatre (Photo credit: Jeremy Daniel) Their son Lucien (Ari Brand, heartbreaking) with Young Pierre (Ethan Haberfield, registering strongly in an almost nonverbal part) returns from years in a concentration camp where his wife and others perished. Lucien refuses to speak of his ordeal and reluctantly enters the family business as does Pierre whose older incarnation becomes the philosophical and practical sage in the last act. Harmon meticulously fuses the domestic ups and downs of this bright, well-educated extended family with the overwhelming and unavoidable social upheavals that surround them whether it’s the Nazi persecutions or the rise in anti-Jewish violence and rhetoric in contemporary France. Their story is epic, but intimate. David Cromer, the director, isn’t afraid to keep Prayer flowing in a deliberate, unhurried pace, or pausing at times letting the play breathe. He makes the epic quite human scale. Richard Masur and Aria Shahghasemi in a scene from the Manhattan Theatre Club production of Joshua Harmon’s “Prayer for the French Republic” at the Samuel J. Friedman Theatre (Photo credit: Jeremy Daniel) Prayer for the French Republic is monumental, yet human scaled, addressing a resurgent scourge with intelligence and warmth. Prayer for the French Republic (extended through March 3, 2024) Samuel J. Friedman Theatre, 261 West 47th Street, in Manhattan For tickets, visit http://www.manhattantheatreclub.com Running time: three hours and ten minutes including two intermissions",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 35,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 831,
  "archivePath": "data/archives/reviews/prayer-for-the-french-republic-2024/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:47:55.936Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "scoreSource": "extracted-strong-negative",
  "scoreConfidence": "medium",
  "extractedPhrase": "avoid"
}