{
  "showId": "prayer-for-the-french-republic-2024",
  "outletId": "timeout-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.timeout.com/newyork/theater/prayer-for-the-french-republic-broadway-review",
  "publishDate": null,
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Jeremy Daniel | Prayer for the French RepublicReview\n\n3 out of 5 starsTheater, DramaRecommendedTuesday January 9 2024ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\nTo be Jewish in the diaspora is to always depend on the kindness of neighbors—a kindness that has proven unreliable, continually and violently, for millennia. The modern Parisian family in Joshua Harmon’s Prayer for the French Republic is beginning to feel a cold shadow creeping up. In the play’s first scene, Daniel Benhamou (Aria Shahghasemi), a young teacher, arrives home with blood on his face; he has been targeted by local ruffians, and not for the first time. His mother, Marcelle (an excellent Betsy Aidem), implores him to stop putting his Jewishness on display by wearing a kippah. But his father, Charles (Nael Nacer), sees a larger pattern. It is time, he decides, to move somewhere safer: Israel.\n\nThe Hamas attack on Israel last fall has shaded Harmon’s 2022 play, which is mostly set in the mid-2010s, with fresh urgency and bitter irony: Antisemitic incidents have spiked in France, which supports the argument to leave; but the notion of Israel as a secure haven has rarely seemed shakier. (At least 41 French citizens, the most of any foreign nationality, were among those killed on October 7.) Densely packed with history and rhetoric, Harmon’s depiction of French Jews in two different decades—it periodically flashes back to the same apartment in the 1940s, as Marcelle’s elderly grandparents (Daniel Oreskes and Nancy Robinette, both very fine) wait out the Nazi occupation—provides valuable insights into their divided states of mind.\n\nPrayer for the French Republic | Photograph: Courtesy Jeremy Daniel\n\nAs a theatergoing experience, however, the three-hour Prayer for the French Republic is less effectively timed. The play premiered in early 2022 at Manhattan Theatre Club; Dravid Cromer’s production has now moved to MTC’s Broadway venue, the Samuel J. Friedman Theatre. But in the gap between these two mountings, New York got a 10-month run of Tom Stoppard’s Leopoldstadt, which approached the same core issues—the persistence of antisemitism, and the debates about fitting in that surround it—with more gravity, scope and finesse. By comparison, flaws that were already noticeable Off Broadway seem more pronounced.\n\nIn his 2013 breakthrough, Bad Jews, Harmon surveyed questions of identity with a sharp insider eye for the internecine squabbles of American Jews. Here, perhaps because of the weightiness of his subject, his writing seems heavier: schematic and sometimes self-consciously polemical. Counterargument is put in the mouths of two family members from outside the Benhamou nuclear core: Marcelle’s assimilationist brother (Anthony Edwards), who toggles between testiness and rue, and also serves as our narrator; and Molly (Molly Ranson), a progressive American third cousin who hits it off with Daniel and—in an echo of Louis and Belize’s coffee-shop scene in Angels in America—gets lectured about Israeli politics by his frowzy sister, Elodie (Francis Benhamou). There is perceptiveness and humor in Prayer for the French Republic, and Cromer’s direction does its best to keep things honest. But as Harmon weighs out the issues, you can sense his thumb on the scale; by the denouement, it feels more like his whole hand, pressing for amens.\n\nPrayer for the French Republic. Samuel J. Friedman Theatre (Broadway).  By Joshua Harmon. Directed by David Cromer. With Betsy Aidem, Anthony Edwards, Francis Benhamou, Molly Ranson, Aria Shahghasemi, Nael Nacer, Daniel Oreskes, Nancy Robinette, Richard Masur, Ari Brand, Ethan Haberfield. Running time: 3hrs 5mins. Two intermissions.\n\nFollow Adam Feldman on X: @FeldmanAdamFollow Time Out Theater on X: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nPrayer for the French Republic | Photograph: Courtesy Jeremy Daniel\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "dtliExcerpt": "“There is perceptiveness and humor in ‘Prayer for the French Republic,’ and Cromer’s direction does its best to keep things honest. But as Harmon weighs out the issues, you can sense his thumb on the scale; by the denouement, it feels more like his whole hand, pressing for amens.”\n\nRead more",
  "originalScore": null,
  "assignedScore": 100,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 912,
  "archivePath": "data/archives/reviews/prayer-for-the-french-republic-2024/timeout-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:49:59.395Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "designation": "Critics_Choice",
  "scoreSource": "time-out-stars",
  "scoreConfidence": "medium",
  "originalRating": "5/5 stars"
}