{
  "showId": "prima-facie-2023",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Prima-Facie/1143",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Prima-Facie/1143",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "It’s hard to decide whether to give Jodie Comer a Tony Award or an Olympic Gold Medal (or both) for her emotionally and physically exhausting solo turn in Suzie Miller’s award-winning drama “Prima Facie,” now making its American debut at the Golden Theatre under the excellent direction of Justin Martin. Either way, she delivers the most remarkable performance in a season of exceptional acting work.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PRIMA-FACIE-Starring-Jodie-Comer-Opens-on-Broadway-Updating-Live-20230423",
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $22\n Buy Tickets\n\nCititour.com Review\n It’s hard to decide whether to give Jodie Comer a Tony Award or an Olympic Gold Medal (or both) for her emotionally and physically exhausting solo turn in Suzie Miller’s award-winning drama “Prima Facie,” now making its American debut at the Golden Theatre under the excellent direction of Justin Martin. Either way, she delivers the most remarkable performance in a season of exceptional acting work.\n\nAs attorney Tessa Ensler, this extraordinary, 30-year-old actress speaks practically non-stop for 100 minutes, moves furniture, changes clothes (onstage and off), and, most importantly, undergoes a heart-shattering emotional transformation in a manner so believable it’s hard to remember she’s “acting.” One supposes when she’s not on stage at the Golden, she’s not just on vocal rest; she’s probably on complete bed rest.\n\nThe intermissionless work first finds Tessa in what has become her natural element: the courtroom. She is a British barrister who defends alleged petty criminals and sex offenders. Her opening, jagged “monologue” is a vivid one, devoted to Tessa’s description of the trial process. We watch, impressed and aghast, as she strategically “plays” the victims of sexual assault or the witnesses who support them, poking holes in their stories or making them look confused, all in the name of “justice.”\n\nIn lesser hands, Tessa could come off as heartless, and in a way, she does. Comer stresses that Tessa has no emotional stake in her victories; she simply enjoys seeing herself as a winner in the “game” of law. Furthermore, Miller ups the ante by stressing that Tessa is from a working-class family and has miraculously survived the cutthroat (and much wealthier) competition at Cambridge, where students regularly drop out before graduation. (As an American lawyer, something you may not know about me, I can attest to Miller’s accuracy in positing law school as a place where everyone can feel like a potential enemy!)\n\nComer’s complete commitment to the role keeps us mostly riveted through the show’s sometimes banal first half, even as we can’t help but suspect that Miller must have more on her mind than justifying criminal defense work. And, of course, she does! (If you really want to avoid this “spoiler,” please stop reading.)\n\nOn her first official date with co-worker Julian (they’ve already slept together after-hours on the office sofa), the pair go home together – having already drunk too much, they drink some more, make love, and then, while Tessa is vomiting up her sake and sushi, Julian rapes her. \n\nIn shock, all Tessa knows about how to handle the situation and its aftermath goes out the window, including taking a hot shower that washes away any evidence of semen. She then flees her own apartment in the pouring rain (a striking visual effect, one of many by the creative team led by designer Miriam Buether) and – rather than heading to her mother’s as first intended – goes to the police station to file a complaint and press charges against Julian. Immediately, she becomes one of the women she used to cross-examine: an assaulted woman seeking justice at any cost, willing to undergo any debasement. \n\nAs beautifully acted and constructed as “Prima Facie” is, one may not be completely convinced that Tessa would take this step, especially as it takes a shocking 782 days for her case to come to trial. Perhaps this is the irony of the play’s title, which means “at first impression” in Latin (and is commonly used in law), because Tessa has certainly given us the impression that her career (especially as she has just joined a more prestigious “chamber”) would come above everything else.\n\nStill, as Tessa goes through the difficult process of dealing with the police (simultaneously supportive and skeptical) and then a trial with everything stacked against her, Comer’s performance somehow deepens –exponentially. She’s now an almost ordinary woman betrayed by a would-be-lover (Julian) and her long-time lover (the law). Seeing her realize how her life has been destroyed is beyond devastating.\n\nBut to use another legal term: Res Ipsa Loquitor (the thing speaks for itself). Having eloquently made her points about how “something has to change” (to quote the play’s last line), Miller nonetheless gives Tessa two long end-of-play speeches that come off as unduly preachy and even accusatory (towards both men and women as well as the legal system). Perhaps they will spark discussion – or even action. But in purely theatrical terms, I object to their inclusion.\n\n By Brian Scott Lipton\n\nVisit the Sitehttps://primafacieplay.comOpen/Close DatesOpening 4/23/2023Closing 7/2/2023\nTheatre Info\nGolden Theatre252 W 45th StNeighborhood: West 40sNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 820,
  "archivePath": "data/archives/reviews/prima-facie-2023/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:42:54.862Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 820,
  "tierReason": "Full review text"
}