{
  "showId": "prima-facie-2023",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/prima-facie-broadway-review-jodie-comer",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/prima-facie-broadway-review-jodie-comer",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Read our four-star review of Suzie Miller's Prima Facie on Broadway, which stars Emmy Award winner Jodie Comer, at the Golden Theatre through July 2. On the face of it and, frankly, on stage at the Golden Theatre, the one-woman drama Prima Facie starring Jodie Comer is too slick and tidily constructed for its own good. In it, Tessa, a British barrister known for defending men accused of sexual assault, gets date raped herself. The parallels are plain. Suzie Miller’s play offers a reckoning with the before and after. Only in the wake of her assault does Tessa fully wrap her brain around a terrible inequity. The symbol for justice is a woman, and in rape cases, her scales tip toward men. Unfortunately, that’s not exactly headline news. Running 100 unbroken minutes, the production is Exhibit A of how a focused and fierce performance can elevate a work. Comer’s breathless star turn in her Broadway debut does that. Comer, who speaks for several minor characters, has won various awards for her portrait, including an Olivier. She is riveting, even in a late section where Tessa spouts statistics and the play teeters into movie-of-the-week territory. Director Justin Martin keeps Tessa in near-nonstop motion on Miriam Buether’s set lined with soaring floor-to-ceiling case files. Tessa periodically climbs atop a heavy wooden table to make a point. It’s a stagy trick, but it gets attention. Like Tessa, the production is alive. There’s a subtle heartbeat-like throb underscoring the action, incidental music, and bright flashes punctuating scenes thanks to sound designers Ben and Max Ringham, composer Rebecca Lucy Taylor, and lighting designer Natasha Chivers, respectively. When we meet Tessa, she’s in court and at the top of her game. All smirks and smug self-satisfaction, she’s a shameless showboater in a robe and horsehair wig. She gleefully likens taking down a witness to a fight to the death. Armed with her legal cunning and killer instinct, she fires off questions that are aimed to slay, not just wound — bang-bang-bang! She shapes her fingers into a pistol as she revels. When it comes to blasting holes in the testimony of an anguished woman alleging sexual assault, she is just as merciless. Tessa says she is in the business of legal truth — what’s provable beyond a doubt. It’s easy to connect the dots between Tessa and Villanelle, the Killing Eve assassin that made Comer a star — and accounts for raucous entrance applause. Tessa is in her element in court, but she’s far less so when she’s back home in hardscrabble Liverpool. A brief, fitful visit with her mother and brothers shows she’s left this world behind. Since landing a spot in law school at Cambridge, she’s moved on. In London, she’s a star on the rise, whether in court drag or a flirty green dress for a date with Julian, a colleague she shags on a sofa at work. A week later, after drinks and sex earlier in the evening, Julian rapes Tessa in her home. The details spill out of her in a harrowing torrent echoed by an onstage rainstorm. Tessa knows the law. Her case is iffy, but she decides to press charges. Some 782 days later, she has her day in court, where she knows she’ll be subjected to the same kind of attack she uses against witnesses. The outcome of the trial is fairly predictable. Tessa — who, by the way, is still a defense lawyer — seizes the opportunity to make a statement about the need for change. In the end, Miller, an Australian writer with a law background, makes Prima Facie a message play. What it’s saying isn’t revelatory, but it is worthwhile. And Comer is a first-class messenger. Prima Facie is at the Golden Theatre through July 2. Get Prima Facie tickets on New York Theatre Guide. Photo credit: Jodie Comer in Prima Facie. (Photo by Bronwen Sharp, retouch by Caz Lock) Originally published on Apr 23, 202322:00",
  "isFullReview": true,
  "textWordCount": 661,
  "archivePath": "data/archives/reviews/prima-facie-2023/nytg--joe-dziemianowicz_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:12:40.457Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 661,
  "tierReason": "Full review text"
}