{
  "showId": "prima-facie-2023",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/jodie-comer-triumphs-in-prima-facie-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/jodie-comer-triumphs-in-prima-facie-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "In a bravura stage debut (!), Comer plays Tessa, an intelligent young criminal defense barrister in London whose workload has somehow come to focus on sexual assault cases. She looks forward to cross-examination, if not so much returning home to her somewhat distant mother. Tessa is not a shark, but her mentality is sharp as one’s teeth. “There is no real truth, only legal truth,” she says, explaining the rational logistics of her work. The brilliance of Miller’s creation, brought exquisitely to life by Comer, is that Tessa does not seek to justify her career. She’s not bending over backwards to absolve herself, and her trust in the legal system is soberly convincing. And she is also the kind of woman we’d all like to befriend: successful, fun, level-headed, understanding.",
  "bwwScore": 9,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PRIMA-FACIE-Starring-Jodie-Comer-Opens-on-Broadway-Updating-Live-20230423",
  "fullText": "Jodie Comer in Prima Facie | Photo: Bronwen Sharp\n\nJodie Comer, taking her (hopefully restorative) bows after 100 minutes alone onstage at the Golden Theatre, extends her arms onto the wings, motioning at the stagehands. The graciousness, ever so British, signals how much she must rely on their support throughout her Broadway run of Suzie Miller’s harrowing play Prima Facie, which earlier this month won the two women Olivier Awards for its West End premiere.\n\nIn a bravura stage debut (!), Comer plays Tessa, an intelligent young criminal defense barrister in London whose workload has somehow come to focus on sexual assault cases. She looks forward to cross-examination, if not so much returning home to her somewhat distant mother. Tessa is not a shark, but her mentality is sharp as one’s teeth. “There is no real truth, only legal truth,” she says, explaining the rational logistics of her work. The brilliance of Miller’s creation, brought exquisitely to life by Comer, is that Tessa does not seek to justify her career. She’s not bending over backwards to absolve herself, and her trust in the legal system is soberly convincing. And she is also the kind of woman we’d all like to befriend: successful, fun, level-headed, understanding.\n\nSo when she finds herself on the other side of the stand, testifying to the very crime she’s often defended, her world is turned upside down in more ways than one. The play, directed by Justin Martin with a superb sense of emotional and practical efficiency, follows the immediate effects of Tessa’s assault on her mind, career, and soul. It is clear in its intentions, brave in its intimacy, and commendable for its lack of melodrama. Miller is logical without sacrificing passion or courting sentimentality. Like Tessa on the job, she gets us on the same page before throwing out the book altogether in search of a better read on the situation.\n\nThat simplicity also allows for a tiny bit of questioning the point. Not aimlessness—Miller’s writing and Comer’s performance are laser-sharp—but, with a Playbill insert listing statistics about sexual assault, the play can afterward feel like a thought experiment in irony and consequence posed to a high school class.\n\nThen again, those statistics prove that our culture is not above that kind of philosophical reproach. And, with a production as focused and impeccably executed as this, we are in no room to complain. Prima Facie is a masterclass in sophistication, thoughtfulness, and brevity; the platonic ideal of a night at the theatre. Here’s to Comer and Miller returning to Broadway sooner rather than later, hopefully (for them) in a softer play, in a softer world.\n\nPrima Facie is in performance through June 18, 2023 at the Golden Theatre on West 45th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 573,
  "archivePath": "data/archives/reviews/prima-facie-2023/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:43:00.776Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250910104649",
  "archiveOrgUrl": "http://web.archive.org/web/20250910104649/https://www.theatrely.com/post/jodie-comer-triumphs-in-prima-facie-review",
  "contentTier": "complete",
  "wordCount": 573,
  "tierReason": "Full review text"
}