{
  "showId": "clydes-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2021/11/23/clydes-zestfully-tasty-new-play-from-lynn-nottage-with-cilantro-and-dill/",
  "publishDate": "2021-11-23T21:51:48",
  "fullText": "Clyde’s, the new Lynn Nottage play at the Helen Hayes, begins with a cartoon panel-like closeup through a take-out window of a sandwich being garnished. Food—or, rather, the noble sandwich—is very much on the metaphoric menu.\n\n“Maine lobster,” one character fantasizes, “potato roll gently toasted and buttered with roasted garlic, paprika and cracked pepper with truffle mayo, carmelized fennel and a sprinkle of…of…dill.”\n\nAre you hungry yet?\n\nThe sandwiches—and these kitchen dreamers continually play at conjuring up ultra-tasty-sounding delights while filling less exalted orders rifled through the counter window by the cigarette-smoking dragon of a proprietor—are not sandwiches, per se. They are metaphors for life, specifically the life faced by these ex-cons struggling along the halfway-house treadmill to life outside.\n\nClyde (Uzo Aduba), an ex-con herself, encourages her crew by giving them work at her truck-stop sandwich joint outside Reading, Pennsylvania. She also continually cuts them down, lording her power over them (and, it seems, physically abusing at least one of the men). “Let me tell you something,” she brays at emotionally centered “sensei”-like excon-chef Montrellous (Ron Cephas Jones): “That bitch ass sandwich ain’t gonna change a damn thing.”\n\nIs change possible for this “bunch of felons making sandwiches,” the others being short order cook Rafael (Reza Salazar) and prep chef Leticia (Kara Young)? Is there hope? Not apparently so, at Clyde’s Café. But Nottage is dealing in mystic symbols here, from figurative onstage evidence of fiery hell to the notion of these kitchen prisoners actually “escaping” from the play. Nottage seems to go out of her way to be purposefully imprecise; her intention, perhaps, is to force viewers to think, and consider, and involve themselves.\n\nClyde’s is something of an upbeat, other-side-of-the-coin companion to Nottage’s brutally riveting Sweat. The playwright devised them simultaneously, on an extended research trip to blue-collar Reading. When violent newcomer to the kitchen Jason (Edmund Donovan)—just out of jail, with threatening prison tats on his face—recounts the crime for which he was incarcerated, he pretty much describes the brutal attack we witnessed in the climactic scene of the earlier play. Both characters, in fact, are named Jason; he here mentions in passing two other Sweat characters.\n\nFurthering the ties, we find that when Clyde’s was first produced at the Guthrie in 2019—under the title Floyd’s, which seems to have been changed for reasons understandable—the tough-as-nails title character was played by Johanna Day, who was mesmerizing as Jason’s mother in Sweat. Which leads one to wonder just how much Nottage’s play was impacted by the alteration—also understandable—of the race of the domineeringly sadistic sandwich-shop proprietor. Or was this merely a casting choice, given the wide audience which might be attracted by the multiple Emmy-winning Aduba from Orange Is the New Black?\n\nThis leads to what is at present the weak link in the evening: Clyde is the one character, and the one performance, that is less than convincing. Everyone else is—to borrow a word from Nottage’s kitchen—sublime. Stage veteran Jones, who also has two Emmys on his shelf (for This Is Us), brings impressive strength to the play. Salazar, who has appeared as the bus boy Oscar in multiple productions of Sweat, gives an energetic and affecting performance as the fry cook. Donovan, who played memorably damaged young men in Samuel D. Hunter’s Greater Clements and Lewiston/Clarkson, admirably expresses the barely restrained violence overflowing through Jason.\n\nThat said, the stage radiates with the talent emanating from Kara Young, whom those of you fortunate enough to have seen Stephen Adly Guirgis’s Halfway Bitches Go Straight to Heaven might remember as that play’s poetry-writing abused teenaged ex-prostitute. Clyde’s marks the Broadway debut of Young, and she demonstrates magnetic power throughout.\n\nFrequent Nottage collaborator Kate Whoriskey (director of Ruined and Sweat) has staged a fine production, with a properly “liminal” set (as specifically called for by the playwright) from set designer Takeshi Kata and properly mystical touches from lighting designer Christopher Akerlind. Jennifer Moeller, meanwhile, gives Aduba an array of startling costumes that might well chasten Diana over at the Longacre. That desperately doomed princess has more actual costume changes than Clyde, yes; but Diana is 40 endless minutes longer than Clyde’s, and several of Moeller’s greasy spoon wardrobe choices are strikingly more eyegrabbing.\n\nNottage is in the midst of her own personal uptown theater festival, with no less than three pandemic-delayed items scheduled to open by February 1 (the others being the Lincoln Center Theater opera version of her early play Intimate Apparel and the biomusical MJ). Clyde’s demonstrates that the twice-Pulitzered, MacArthur-winning author remains high among our most accomplished playwrights. And how.\n\nClyde’s opened November 23, 2021 at the Helen Hayes Theater and runs through January 16, 2022. Tickets and information: 2st.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "show-score-playwright",
    "dtli",
    "bww-roundup"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "dtliExcerpt": "Nottage is in the midst of her own personal uptown theater festival, with no less than three pandemic-delayed items scheduled to open by February 1 (the others being the Lincoln Center Theater opera version of her early play Intimate Apparel and the biomusical MJ). Clyde’s demonstrates that the twice-Pulitzered, MacArthur-winning author remains high among our most accomplished playwrights. And how.",
  "dtliThumb": "UP",
  "showScoreExcerpt": "\"4 stars!...The sandwiches—and these kitchen dreamers continually play at conjuring up ultra-tasty-sounding delights while filling less exalted orders rifled through the counter window by the cigarette-smoking dragon of a proprietor—are not sandwiches, per se. They are metaphors for life, specifically the life faced by these ex-cons struggling along the halfway-house treadmill to life outside.\"\n\nRead more",
  "bwwExcerpt": "Frequent Nottage collaborator Kate Whoriskey (director of Ruined and Sweat) has staged a fine production, with a properly \"liminal\" set (as specifically called for by the playwright) from set designer Takeshi Kata and properly mystical touches from lighting designer Christopher Akerlind. Jennifer Mo...",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-CLYDES-Opens-On-Broadway--See-What-the-Critics-Are-Saying-20211123"
}