{
  "showId": "clydes-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2021/11/23/clydes-lynn-nottage-cooks-up-a-sharp-kitchen-set-comedy/",
  "publishDate": "2021-11-23T21:50:33",
  "fullText": "Given the choice in any restaurant, I will pretty much never opt for a sandwich. Honestly, sandwiches are hard to eat. They’re messy. Just chop everything up in a colorful crunchy salad, please.\n\nBut the way two-time Pulitzer Prize winner Lynn Nottage (Ruined, Sweat) writes about sandwiches in her tempting new slice-of-life comedy, Clyde’s—and the way her characters rhapsodize about them—could bring me around.\n\n“Bacon, lettuce and…grilled squash on cornbread wit’ molasses butter,” offers Letitia (Kara Young).\n\n“Vietnamese sandwich, crisp baguette, barbecue pork,” begins Rafael (Reza Salazar). “Cilantro, diced sweet potatoes, a sprinkle of lime and hold for it…horseradish.”\n\n“Um, grilled skirt steak sautéed in butter, thinly sliced, caramelized onions and peach chutney,” suggests Jason (Edmund Donovan). On…? “A cheddar biscuit? A cheddar biscuit!”\n\nMouthwatering, right? Though all of their recipes all pale in comparison with this—and every—creation from their coworker Montrellous (This Is Us Emmy winner Ron Cephas Jones, who quietly steals every scene he’s in): “Maine lobster, potato roll gently toasted and buttered with roasted garlic, paprika and cracked pepper with truffle mayo, caramelized fennel and a sprinkle of…of…dill.” When Montrellous starts to talk about sandwiches, time stands still; a majestic light beams down from above, and I swear I could hear angels singing. “Montrellous is a sensei,” Letitia says. “Drops garlic aioli like a realness bomb. He knows what we only wish to know.”\n\nKitchen workers Letitia, Rafael, Jason, and their guru, Montrellous, spend their shifts dreaming up the perfect Bon Appétit–ready concoction at a purgatory-like Pennsylvania truck-stop sandwich shop named Clyde’s, run by the mean-as-a-cobra, tough-as-acrylic-nails Clyde (Uzo Aduba, late of TV’s Mrs. America and Orange Is the New Black). They’re all ex-cons—something Clyde, who also did time, uses to beat them into submission whenever she gets the chance. “She might actually be the devil,” muses Jason. And, in fact, she might. Consider the burst of flames she produces periodically.\n\nHer employees might be out of prison, but while they’re in Clyde’s kitchen, they’re in a prison of a different kind. They’re trying to build themselves up, but damned if Clyde doesn’t tear each of them down at every turn. She laughs at Jason’s sprinkle of Italian parsley—as if truckers are too unrefined to appreciate a garnish. She scoffs at Letitia’s “I’m gonna be a real chef” assertion: “Don’t disappoint me by having aspirations.” She’s almost incensed by a few sentences of media coverage, which Montrellous sees as a major opportunity (“It’s a blurb in a free newspaper that homeless guys use to wipe their asses,” she declares). And she spits nails when Montrellous refuses to put relish on the Manuel Luis Echegoyen, which he explains would “destroy the integrity of the sandwich.” (Gotta say, I’m with Monty on that one. As Letitia says earlier, “respect the recipe.”)\n\nAll of this got me thinking…what kind of sandwich would I invent? And here’s what I landed on: prosciutto di Parma (sliced paper-thin), burrata, baby arugula, roasted peppers (or heirloom tomatoes, if they’re in season), and a balsamic reduction, on a semolina roll. I hope Montrellous would approve.\n\nClyde’s opened Nov. 23, 2021, at the Helen Hayes Theater and runs through Jan. 16, 2022. Tickets and information: 2st.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
