{
  "showId": "clydes-2021",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/clydes-uzo-aduba-broadway-review",
  "publishDate": null,
  "fullText": "Food for thought is on the menu, along with lots of laughs and a few tears in Lynn Nottage's Clyde's, a richly entertaining and timely play set in a truck stop sandwich shop along a nowhere stretch of Berks County, Pennsylvania. It's roughly the same GPS of the author's Sweat, which focused on grim aftershocks of a factory lockout and won a Pulitzer Prize in 2017. Eight years earlier, she won the same award for Ruined, about women in the Congo scarred by war. Clyde's, commissioned by the Guthrie Theater where it premiered in 2019, is a lighter slice of life than those weightier works, but it still has the power to stay with you. The program for the Second Stage Theater production describes the roadside restaurant as a liminal space — in other words, an in-between locale. It's a fitting place for folks to seek second chances. It also provides wiggle room, perhaps, to merge reality with metaphor. It's where four ex-cons struggle to put their criminal pasts behind them as they work together as line cooks in the sandwich dive. One wrong move can land them back in the joint. World-battered single mom Letitia (Kara Young) did time because she robbed a pharmacy to help her special-needs daughter. Sweet-natured Rafael (Reza Salazar) held up a bank armed with a BB gun. Jason (Edmund Donovan, deeply affecting), a loner with a face covered in racist tattoos inked in prison, unleashed his violence and fury on a man with a baseball bat. His story summons a pivotal moment from Sweat. Montrellous (a quietly magnetic Ron Cephas Jones), who reveals he went to prison as an act of brotherly love, is the foursome's senior member. He's a kitchen philosopher who urges co-workers to step outside limitations and to devise the perfect sandwich. You can't turn back time. You can't undo a crime. You can aspire and escape drudgery through creativity. As characters share visions of dream eats — a tuna melt with chopped lemongrass on toasted black rye; a Cubano sandwich with jalapeno aioli and sweet onions; a grilled halloumi masterpiece — your mouth may water. Clyde (Uzo Aduba), the abusive and exploitative boss at the namesake joint, typically turns up her nose. \"You're all losers, felons,\" she says. \"Don't disappoint me by having aspirations... I'll make sure you go back to whatever hell you came from.\" One could argue that the script lays things on too thick at times — and this is one of them. On the other hand, Clyde may be intentionally drawn to be larger and more satanic than life and be a stand-in for society as a whole. Directed by Kate Whoriskey, the author's go-to collaborator, the production cooks on all burners. Orange Is the New Black Emmy winner Aduba slyly brings out Clyde's devilish streak. Young is thrilling as the take-no-b.s. Tish. The physical production is also deft thanks to Jennifer Moeller's character-defining costumes, Takeshi Kata's realistic working kitchen, and Christopher Akerlind's moody, shifting lighting. A final rebellious communal act of creativity turns out to be liberating for the kitchen crew. You can take the ending literally or poetically — either way it works, and it satisfies. Chalk that up to Nottage's theatrical 'wichcraft. Originally published on Jan 31, 202217:09",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Directed by Kate Whoriskey, the author's go-to collaborator, the production cooks on all burners. Orange Is the New Black Emmy winner Aduba slyly brings out Clyde's devilish streak. Young is thrilling as the take-no-b.s. Tish. The physical production is also deft thanks to Jennifer Moeller's charact...",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-CLYDES-Opens-On-Broadway--See-What-the-Critics-Are-Saying-20211123",
  "showScoreExcerpt": "\"Directed by Kate Whoriskey, the author’s go-to collaborator, the production cooks on all burners. Orange Is the New Black Emmy winner Aduba slyly brings out Clyde’s devilish streak. Young is thrilling as the take-no-b.s. Tish. The physical production is also deft thanks to Jennifer Moeller’s character-defining costumes, Takeshi Kata’s realistic working kitchen, and Christopher Akerlind’s moody, shifting lighting. \n\nA final rebellious communal act of creativity turns out to be liberating for the kitchen crew. You can take the ending literally or poetically — either way it works, and it satisfies. Chalk that up to Nottage’s theatrical 'wichcraft.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright",
    "bww-roundup"
  ],
  "textWordCount": 545,
  "archivePath": "data/archives/reviews/clydes-2021/nytg--joe-dziemianowicz_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:22:41.753Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 545,
  "tierReason": "Full review text"
}