{
  "showId": "clydes-2021",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Naveen Kumar",
  "url": "https://variety.com/2021/legit/reviews/clydes-review-broadway-uzo-aduba-lynn-nottage-1235118289/",
  "publishDate": "November 23, 2021",
  "fullText": "A sandwich has always been a kind of vehicle, ingredients riding between sliced bread. Lynn Nottage improbably turns the lunchtime staple into the storytelling engine of \"Clyde's,\" her deceptively simple flavor-bomb of a new comedy about survival, second chances and digesting whatever life serves up.\n\nThe roadway joint of the play's title is a waystation not just for the truckers it serves, but also for employees getting back on their feet in the kitchen where the action is set. Indomitable owner Clyde (played with tart relish by Uzo Aduba) hires formerly incarcerated people, freed and in need of a paycheck to maintain parole and build something new.\n\nAnd, yes, that starts with a sandwich. Dreaming up, if not the perfect combination, then one that's uniquely their own, becomes a metaphor for characters striving to move forward.\n\nThe apron crew's elder statesman Montrellous (Ron Cephas Jones, cool and easy) isn't just a well-seasoned maestro, but a mentor and wellspring of strength for the lot, who each have their own hardships and palates.\n\nThere's Letitia (Kara Young), a quick-tongued single mom who likes to mix savory and sweet. Rafael (Reza Salazar), a goofball recovering from addiction, has a taste for richness and heat. (The two share a tangy flirtation.) And Jason (Edmund Donovan), a quiet but hot-tempered new release covered in gang-suggestive tattoos, is working on his sophistication. It seems a Philly cheesesteak on wheat does not reflect the courage of imagination he'll need to forge ahead.\n\nNottage, a Pulitzer winner for the more weighty topical dramas \"Ruined\" and \"Sweat,\" maintains her interest in illuminating the lives of working class people, but shifts strategies here into broad comedy. The setup has a sitcom quality that's paradoxically inviting, not dissimilar to \"Orange Is the New Black,\" for which Aduba won two Emmys; it's easy to imagine stopping by Clyde's every week, with a steady swinging door of short-order cooks working toward rehabilitation. The comedy is situational in both structure and execution, with personalities, incidents and drool-worthy sandwich descriptions making up a bulk of its substance.\n\nAduba's Clyde, who's also served time, has since hardened into her own manner of prison guard to a captive workforce. Ding! She pops into the serving window with another order slip. Ding! Why is everyone just standing around? Ding! She stalks through the door in another jaws-on-the-floor boss look (the delectable costumes are by Jennifer Moeller). Aduba makes an acrylic-licking meal of the part, reveling in the swagger and intimidation Clyde hurls about like a flamethrower.\n\nIf the title role ultimately feels underdone — the devil wears Fendi, but does she have a soul? — that's in line with Nottage's focus on humanizing those under Clyde's thumb. Performances from the ensemble grow more refined as the play goes, its lens narrowing in from would-be stereotype to something more like portraiture.\n\nDirector Kate Whoriskey amps up the energy to 11, in answer to the monotony of visible action that actually goes into sandwich-making — chopping, dressing, fetching greens from the walk-in fridge, chopping some more. In tandem with intermittently otherworldly lighting by Christopher Akerlind and sound by Justin Ellington, the set by Takeshi Kata suggests a freeway scullery that occasionally gives way to the story's more gourmet — and cosmic — possibilities. If Clyde's is clearly figured as purgatorial, glimpses of both the divine and the ordinary lie just beyond.\n\n\"Clyde's\" might also be considered a subversion of familiar genres, including drawing room comedy and workplace drama, and the value judgments conventionally inherent to them. By nature of her composition, Nottage also questions which sorts of rooms and people have previously been considered worthy of sustained attention.\n\nWhy should a courtroom drama, for example, be any more attractive to audiences than, say, the assembly of a sublime sandwich? And crucially, why don't we pay more respect to people who've been chewed up and discarded by the system? After all, everyone needs to eat.",
  "isFullReview": true,
  "dtliExcerpt": "A sandwich has always been a kind of vehicle, ingredients riding between sliced bread. Lynn Nottage improbably turns the lunchtime staple into the storytelling engine of “Clyde’s,” her deceptively simple flavor-bomb of a new comedy about survival, second chances and digesting whatever life serves up.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/clydes/",
  "bwwExcerpt": "Nottage, a Pulitzer winner for the more weighty topical dramas \"Ruined\" and \"Sweat,\" maintains her interest in illuminating the lives of working class people, but shifts strategies here into broad comedy. The setup has a sitcom quality that's paradoxically inviting, not dissimilar to \"Orange Is the ...",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-CLYDES-Opens-On-Broadway--See-What-the-Critics-Are-Saying-20211123",
  "showScoreExcerpt": "\"Director Kate Whoriskey amps up the energy to 11...“Clyde’s” might also be considered a subversion of familiar genres, including drawing room comedy and workplace drama, and the value judgments conventionally inherent to them. By nature of her composition, Nottage also questions which sorts of rooms and people have previously been considered worthy of sustained attention.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "dtli",
    "show-score-playwright",
    "bww-roundup"
  ],
  "textWordCount": 654,
  "archivePath": "data/archives/reviews/clydes-2021/variety--naveen-kumar_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:24:26.260Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20221204141902",
  "archiveOrgUrl": "http://web.archive.org/web/20221204141902/https://variety.com/2021/legit/reviews/clydes-review-broadway-uzo-aduba-lynn-nottage-1235118289/",
  "textIssues": [
    "Show title not found in text"
  ],
  "duplicateTextOf": "variety--aramide-tinubu.json",
  "wordCount": 654,
  "tierReason": "Full review text"
}