{
  "showId": "ifthen-2014",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "http://www.ew.com/ew/article/0,,20364394_20801613,00.html",
  "playbillVerdictUrl": "http://www.ew.com/ew/article/0,,20364394_20801613,00.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 351,
  "archivePath": "data/archives/reviews/ifthen-2014/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:26:53.155Z",
  "originalScore": "B+",
  "originalScoreNormalized": 87,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140331070328",
  "archiveOrgUrl": "http://web.archive.org/web/20140331070328/http://www.ew.com/ew/article/0,,20364394_20801613,00.html",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Can a 40ish American woman really have it all? If you're Idina Menzel, you can get a hit movie, viral fame as Adele Nazeem, and a meaty role in the new Broadway musical If/Then complete with a soaring 11 o'clock number aimed squarely at your in-leaning target audience.\n\nBut you're also the appealing heart of an overly cluttered story, by writer-lyricist Brian Yorkey, that gives more than a passing nod to the 1998 movie Sliding Doors. Menzel's middle-aged divorcée moves to New York City and explores two separate life paths: In one, she's Beth and scores a dream job as a city planner but has unfulfilling flings with her married boss (Jerry Dixon) and her nominally bisexual pal (Anthony Rapp). In the other, she's Liz and settles for a blah teaching job but lands a hunky doctor (James Snyder) who's more golden retriever than man. (His first-act solo, ''You Never Know,'' is a take-a-chance-on-me ode to neutered self-deprecation.)\n\nThe two scenarios unfold in consecutive scenes, sometimes shifting mid-song, which is not as confusing as it sounds given shifts in lighting, changes in our heroine's name, and Michael Greif's solid direction. But the show's exploration of fate and chance seldom rises above Hallmark-card sentimentality  and the characters have no more depth. There are also a lot of them, including Liz/Beth's kindergarten-teacher pal (LaChanze), the teacher’s lover (Jenn Colella), and the doc's gay best friend (Jason Tam); many get songs of their own, which only slows down the action.\n\nWhile composer Tom Kitt's tunes are pleasant enough  Menzel's comedic ''What the F---?'' is a standout  his score pales compared to Next to Normal, his memorable 2010 Pulitzer winner with Yorkey.\n\nBut as even John Travolta must know by now, the real star here is Menzel, and she delivers a powerful bipolar performance that often masks the shallowness of the material. In her triumphant final ballad, ''Always Starting Over,'' she proves she doesn't need to defy gravity to win over fans. With her feet planted on terra firma, she can shake the rafters and pierce your heart all at once. B-",
  "contentTier": "needs-rescrape"
}