{
  "showId": "ifthen-2014",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/if-then-review-idina-menzel-back-on-broadway-in-fork-in-the-road-musical-1.7551210",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/if-then-review-idina-menzel-back-on-broadway-in-fork-in-the-road-musical-1.7551210",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "9:49 PM Road construction. Right lane closed on Northern State Pkwy WB at Routes 106/107/X35\n\nRoad construction. Right lane closed on Northern State Pkwy WB at Routes 106/107/X35\n\n9:48 PM In Nassau closed due to road construction on Seaford-Oyster Bay Expwy/Rt-135 NB between Merrick Rd/X1 and Powell Ave/X8\n\nIn Nassau closed due to road construction on Seaford-Oyster Bay Expwy/Rt-135 NB between Merrick Rd/X1 and Powell Ave/X8\n\n9:47 PM In Manhasset construction work on NY-25A WB at Rt-101/Port Washington Blvd\n\nIn Manhasset construction work on NY-25A WB at Rt-101/Port Washington Blvd\n\n9:45 PM In Manhasset construction work on NY-25A EB at Rt-101/Port Washington Blvd\n\nIn Manhasset construction work on NY-25A EB at Rt-101/Port Washington Blvd\n\n40&deg;\n Hi 55&deg; Lo 41&deg;\n Partly Cloudy\n\nHumidity: 83%\n Wind: SE 6 mph\n Barometer: 30.09 Hg\n\nFull forecast\n Hour-by-hour\n Local map\n\nwatched the Yankees open their 2014 season in Houston.\n\nOriginally published: March 30, 2014 5:30 PM\n Updated: March 30, 2014 9:01 PM\n \n By LINDA WINER\n linda.winer@newsday.com\n\nThis image released by Polk and Co. shows Idina Menzel during a performance of \"If/Then\" at the Richard Rodgers Theatre in New York. (Credit: AP / Joan Marcus)\n\nWe are meant to feel a bit off-balance, a little disoriented, maybe even confused in parts of \"If/Then\" -- and that's the sharp point. In this intelligent, surprising, altogether original new musical, the main character is a 39-year-old divorced woman, Elizabeth, who returns to New York after 12 years as a wife in Phoenix.\n\nThis is a fork-in-the-road show, a back-to-the-future entertainment in which we briefly see the consequences of different roads taken. Should she reinvent herself as Liz, who wants domesticity, or Beth, who craves a career? Children or no children? Teach city planning or be a city planner? Are life choices decided by fate or fluke and, as one of Brian Yorkey's smart lyrics puts it, how long do we have before the \"might be\" turns into \"might have been?\"\n\nThe one thing clearly meant to be is Idina Menzel as Elizabeth, a character whose indecisions could seem trivial in an actress less substantial. But Menzel -- best known to tween girls as Elphaba in \"Wicked\" and to viewers of befuddled John Travolta's Oscar intro to her performance of \"Let It Go\" as Adele Dazeem -- plants herself in the center of every decision with the same precision and honesty she brings to her creamy, shiny high notes.\n\nMenzel doesn't have much vocal variety, but that sound -- soft, medium, loud -- has a lustrous integrity. So does her portrayal of a type of woman seldom seen on Broadway -- the complicated kind who can entertain more than one sense of herself at the same time. There is an endearing awkwardness about Menzel's not-quite-perfect beauty that makes us root for Elizabeth's \"she's-gonna-make-it-after-all\" determination.\n\nThe creative team is united in degrees of separation from work in \"Rent,\" \"Wicked\" and, especially, \"Next to Normal.\" In that Pulitzer-winning show, director Michael Greif, composer Tom Kitt and Yorkey explored a mom with catastrophic bipolar depression. Here they again take on a woman with bifurcated views, but, to my mind, ones far more translatable into rock singing and friendly dancing.\n\nHighlights of the large, lovely cast include Anthony Rapp as the maybe-bisexual activist friend, James Snyder as the possibly ideal husband and LaChanze, who, as the live-wire new gay friend, is snappy and stylish and overdue for her own big musical again.\n\nKitt's keyboard-driven music matches Elizabeth's contradictory decisions with back-and-forth rippling. The show gets a little repetitious and could be tightened up, but not enough to jeopardize the conclusion that the most challenging lives start over every day.\n\nGreif's gleaming, inventive production has lots of moving parts, including double-decker sets by Mark Wendland that add more levels with a mirror that adds layers of ceiling and sky. Disorienting? Indeed, but in attractive, unpredictable ways.\n\nWHERE: Richard Rodgers Theatre, 226 W. 46th St.\n\nINFO: $67-$142; ifthenthemusical.com; 877-250-2929\n\nBOTTOM LINE: smart musical, commanding Menzel\n\nUser rating: 3\n \n \n \n \n \n \n \n \n (5) Click to rate\n\nadvertisement | advertise on newsday\n\n'Game of Thrones' season premiere: Still TV's best 3:48 PM\n\n18 best new movies streaming on Netflix\n\nadvertisement | advertise on newsday",
  "isFullReview": true,
  "textWordCount": 693,
  "archivePath": "data/archives/reviews/ifthen-2014/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:27:14.832Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140402031848",
  "archiveOrgUrl": "http://web.archive.org/web/20140402031848/http://www.newsday.com:80/entertainment/theater/if-then-review-idina-menzel-back-on-broadway-in-fork-in-the-road-musical-1.7551210",
  "contentTier": "complete",
  "wordCount": 693,
  "tierReason": "Full review text"
}