{
  "showId": "lombardi-2010",
  "outletId": "newyorker",
  "outlet": "The New Yorker",
  "criticName": "Uncredited",
  "url": "http://www.newyorker.com/arts/events/theatre/lombardi-circle-in-the-square",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "The dazzling sound and lighting turn a simple stage into a pro-football field, and Judith Light cuts through a loud, cold men’s world with her warm brilliance.",
  "bwwScore": 7,
  "contentTier": "truncated",
  "fullText": "In Eric Simonson’s new play, based on a biography by David Maraniss, “When Pride Still Mattered: A Life of Vince Lombardi,” and directed by Thomas Kail, a young sports reporter (Keith Nobbs) spends a week in 1965 with Vince Lombardi (Dan Luria), the infamously gruff coach of the Green Bay Packers, and his long-suffering wife, Marie (Judith Light). Lombardi is a lot like the reporter’s father: intolerant of imperfection, too demanding; and the reporter is a lot like Lombardi’s son (and teammates): uncontrollable and imperfect; and the week is explosive. It’s hard to believe that in 2010 we can still romanticize selfish, abusive bastards, even if they’re gifted enough to turn a losing team into winners. That said, this has the potential to be a moving story about fathers and sons and football, but Luria would do well to tone down the yelling and play more subtle notes. The dazzling sound and lighting turn a simple stage into a pro-football field, and Judith Light cuts through a loud, cold men’s world with her warm brilliance.\n\nDate: \n Previews begin September 23, opens October 21\n\nMore news, politics, culture, business, and technology:\n\nRegistration on or use of this site constitutes acceptance of our User Agreement (Revised January 7, 2009) and Privacy Policy (Revised January 7, 2009). The New Yorker © 2010\n Condé Nast Digital. All rights reserved. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast Digital.",
  "isFullReview": true,
  "textWordCount": 250,
  "archivePath": "data/archives/reviews/lombardi-2010/newyorker--uncredited_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:48:32.483Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20101028235305",
  "archiveOrgUrl": "http://web.archive.org/web/20101028235305/http://www.newyorker.com:80/arts/events/theatre/lombardi-circle-in-the-square",
  "textIssues": [
    "Word count too low: 250 (min: 300)"
  ],
  "wordCount": 250,
  "tierReason": "Short text (250 words)"
}