{
  "showId": "lombardi-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2010/tv/reviews/lombardi-2-1117944171/",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Can 'Lombardi' be the show to overcome Broadway's ingrained disdain for sports-themed plays? That depends on audience expectations of Eric Simonson's biodrama (based on a book by David Maraniss) about Hall of Fame football coach Vince Lombardi. Fans content just to spend a few hours in the company of this great guy should be mesmerized by Dan Lauria's spot-on impersonation of the famously hot-tempered Lombardi. More sports-minded auds, eager for insights on how this legendary coach famously guided the Green Bay Packers to five Super Bowl championships, might want to know why the show spends so little time on the gridiron. Lauria, the lovably grumpy sitcom dad on 'The Wonder Years,' brings that endearing quality to his scrappy portrait of Lombardi as the surrogate father who bullied, scolded, cheered and dragged the Packers out of the NFL cellar and on to glory. Working off his own bulldog physique and gap-toothed grin, Lauria achieves an eerie physical resemblance to Lombardi, who used his whole body to speak his mind.",
  "bwwScore": 6,
  "contentTier": "complete",
  "previousUrl": "http://www.variety.com/review/VE1117943897.html",
  "urlDiscoveredAt": "2026-02-05T03:55:37.641Z",
  "urlDiscoveryMethod": "google-serp",
  "fullText": "Dec 8, 2010 7:06pm PT \n\n \n\n \n \n \n\n \n\n \n Lombardi\n \n \n\n \n\n Thirty years after his death, Vince Lombardi is experiencing something of a renaissance.\n\nThirty years after his death, Vince Lombardi is experiencing something of a renaissance. The legendary coach of the Green Bay Packers is the subject of a well-regarded Broadway play and now a well-researched documentary from HBO that portrays him as equal parts drill sergeant, school teacher, autocrat and psychologist — a father figure who alienated his own children, and a loving husband who drove his wife to drink. But it was perhaps his self-proclaimed reputation as a madman — an obsessive workaholic perfectionist — that moved the National Football League to name its championship trophy in his honor.\n\nWriter Ouisie Shapiro appreciates the ironies in the coach’s life. Lombardi’s father, Harry, was a meat packer who made sure his two boys helped him during the summer; without belaboring the point, the pic intimates that the man who was to gain fame as coach of the Packers literally worked as one as a teenager.\n\nAt age 26, after distinguishing himself as an undersized lineman at Fordham U., Lombardi landed a job as a coach at St. Cecilia’s High School in New Jersey. And while his record as football coach there was remarkable, Newark Star-Ledger writer Jerry Izenberg relates an even more amazing tale of achievement: Lombardi, who knew little about basketball, was asked to coach that sport, too, and, relying on a textbook on fundamentals, led the team to the state title.\n\nIn trying to encompass Lombardi’s entire life, rather than just a few key moments, as in the stage play, there is an inevitable brusqueness to portions of the briskly paced docu, which still finds time to detail his years as an assistant coach at Army and with the New York Giants, where a creaky-sounding Frank Gifford describes the coach’s difficult transition from a teacher of students to a leader of pros.\n\nThe pic includes some of the better-known details from Lombardi’s years as Packers coach, many of them mentioned in Jerry Kramer’s 1968 bestseller “Instant Replay” — Lombardi’s arduous training camps; his humiliating disparagement of players during practice, subsequently building them back up in the locker room; his drive to make the Packers the first team to threepeat as NFL champs. Kramer is among the former players interviewed here, along with Bart Starr, Gifford and Dave Robinson, and all have something new to add, most notably Robinson, who tells of Lombardi battling the league in the ’60s in support of one of his black player’s right to interracial marriage.\n\nThe football achievements are accompanied mostly by little-seen vintage clips, thanks to NFL Films’ massive archives. But it’s frequently away from the football field that the docu scores its finest points. The filmmakers let the coach’s son Vincent and daughter Susan relate the toll their father’s devotion to winning took on the family, mixing in interviews with wife Marie (who died in 1982) and Vince himself.\n\n“It’s a game for madmen,” Lombardi admits, “and I’m the biggest madman of them all.”\n\nPerhaps the truest measure of the man, though, is that none of people who had such differing relationships with Lombardi can hold back tears recalling the coach’s final days as he lay dying of cancer.\n\nAt one point, former Packer tight end Gary Knafelc remembers Lombardi’s three great loves: God, family and the Green Bay Packers. “He went to church every day,” Knafelc recalls, “and he was the altar boy. To this day, I believe the priest kept looking at Lombardi like, ‘Am I doing it right?’ ”\n\nAfter considering this docu, warts and all, the coach certainly would have nodded.",
  "isFullReview": true,
  "textWordCount": 611,
  "archivePath": "data/archives/reviews/lombardi-2010/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:55:37.651Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 611,
  "tierReason": "Full review text",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-LOMBARDI-20101021"
}
