{
  "showId": "les-miserables-2006",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://variety.com/2014/legit/reviews/broadway-review-les-miserables-1201143947/",
  "publishDate": null,
  "fullText": "“Les Miserables” is back, and those irreverent satirists at Forbidden Broadway must be licking their chops. There’s no clunky turntable to mock in this reverential revival of the barnburner musical that Alain Boublil and Claude-Michel Schonberg shrewdly fashioned from the classic Victor Hugo novel, which ran for 16 years on Broadway. But those excitable French revolutionaries are still storming the barricades, marching in place and singing at the top of their lungs. And unlike the tentative 2006 revival, this one is a solid piece of theatrical architecture, built to survive every critical arrow shot through its heart.\n\nAudiences go to musical comedies to laugh themselves silly. But when they go to musical plays, they want to be stirred by melody and shaken with emotion. Like it or not (and it’s always been more of an audience show than one for the critics), that’s what “Les Miz” delivers — beautiful melodies and unbridled emotions.\n\nThe emotion that thunders through the house in song after song is rage. The heroic Jean Valjean, played with great conviction and in ringing voice by Ramin Karimloo, rages (in “Soliloquy”) at the unjust law that cast him in penal servitude for 19 years for stealing a loaf of bread. The fanatical Inspector Javert, who comes alive in Will Swenson’s fiercely passionate performance, rages against the fugitive Valjean in “Stars,” swearing to re-capture him, in the sacred name of the law, if it takes the rest of his life.\n\nThe third source of rage is the collective fury of Enjolras (Kyle Scatliffe, an extraordinarily imposing figure) and his fellow students, who launch the ill-fated Paris Uprising of 1832 to protest (in “The People’s Song”) the appalling social conditions under the provisional French monarchy.\n\nWhenever these angry passions ease up, pain and anguish rush in to keep the emotional pitch high. The tragic Fantine (Caissie Levy) suffers and dies (in “Fantine’s Death”) on behalf of all the poor women forced to sell their bodies to survive. Brave Eponine (Nikki M. James) suffers (in “On My Own”) from her unrequited love for Marius (Andy Mientus), a student revolutionary, and dies saving his life in street battle. And helpless children like Fantine’s orphaned daughter, Cosette (played by the lovely soprano Samantha Hill), suffer at the hands of predatory thieves like the evil Thenardier (Cliff Saunders).\n\nFueled by rage and fired by wholesale suffering, the narrative of “Les Miz” is about as dark as it gets in musical theater. But it’s the heroic scale and epic sweep that intensify the darkness, and the directorial hand of helmers Laurence Connor and James Powell that makes it so relentless.\n\nThe design palette is limited to gray on black — the universal colors of deep depression — with only a flash of red in the giant flag that the rebels carry to the barricade. In this lead-coffin context, Paule Constable’s murky lighting design is quite beautiful, as are the stunning projections (realized by Fifty-Nine Prods.) that provide a brooding backdrop for dramatic scenes of Valjean running for his life in the sewers of Paris, and Javier standing on a moonlit bridge and contemplating his fate.\n\nThe folly of this revival is allowing this thematic darkness to overwhelm the whole production and the raging emotions to color every single musical number. Perhaps not every last one: The night before the battle, Karimloo is allowed a still moment so Valjean can sing the heartbreaking “Bring Him Home” without having the mood destroyed. And after the battle has been fought and lost, Mientus’ Marius is left to quietly contemplate the loss of his friends in “Empty Chairs at Empty Tables.”\n\nBut like the overwrought sung-through recitative, the songs are mostly delivered at high decibels. Even Eponine’s despairing “On My Own” escalates from mournful reflection to belting brassiness. Technically and stylistically, this is quite a good show and sure to please the fans. It doesn’t really need to twist and shout to be heard.",
  "isFullReview": true,
  "bwwExcerpt": "\"\"Les Miserables\" is back, and those irreverent satirists at Forbidden Broadway must be licking their chops. There's no clunky turntable to mock in this reverential revival of the barnburner musical that Alain Boublil and Claude-Michel Schonberg shrewdly fashioned from the classic Victor Hugo novel,...",
  "bwwRoundupUrl": null,
  "bwwThumb": null,
  "showScoreExcerpt": null,
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "playbill-verdict"
  ],
  "playbillVerdictUrl": "http://variety.com/2014/legit/reviews/broadway-review-les-miserables-1201143947/",
  "textWordCount": 656,
  "archivePath": "data/archives/reviews/les-miserables-2006/variety--marilyn-stasio_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:00:19.916Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 656,
  "tierReason": "Full review text"
}