{
  "showId": "back-to-the-future",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2023/08/03/back-to-the-future-back-to-musical-comedy-with-plutonium-packed-thrills/",
  "publishDate": "2023-08-03T21:54:05",
  "fullText": "Back to the Future, the latest blockbuster motion picture to be transferred to the stage, is most happily ensconced at the Winter Garden. Now and forever, or at least presumably through the end of the decade.\n\nFunny, thrill-filled, and overflowing with song and dance—although the former is more loud than melodic, the latter more busy than beat-worthy—Back to the Future is sure to draw an enthusiastically eager audience from the myriad throngs schooled in the 1985 film. Many of whom know the jokes by heart, wait expectantly for the favorite sight gags, and will sit agape at the theatrical special effects. Bookwriter Bob Gale, who wrote the screenplay; director John Rando, of Urinetown and the recent On the Town; and most crucially actors Roger Bart (a veteran scene stealer) and Casey Likes (a newly minted scene stealer)—all of them seem to know precisely what to do. They do it, offering a reasonably close facsimile of the original film experience.\n\nFor those who grew up in the pre-DVD/cable/streaming world and thus might not have Back to the Future (and sequels Back to the Future II and Back to the Future III) engrained in memory, the time is 1985. Marty McFly (Likes) is a 17-year old slacker, doomed to repeat the lackluster life of his dead-end parents: mother Lorraine (Liana Hunt), who perennially clutches a liter of cheap vodka, and chronically unassertive father George (Hugh Coles), who flinches and cowers at the every move of local bully Biff Tannen (Nathaniel Hackman).\n\nMarty’s only confidant seems to be the local mad professor, old Doc Brown (Bart), whose time-travel invention sends Marty back to 1955. To the date in 1955, specifically, when his parents first kissed in their small-town USA village of Hill Valley, California. Which gives Marty the chance to not exactly change history, but to fix up a detail or two before returning back to—well, back to the future of 1985.\n\nDoc Brown’s masterpiece is a souped-up DeLorean outfitted with a magical “flux capacitator.” This was an ultra-luxe sports car built by a fellow named John DeLorean, which came to market in 1981 and flopped spectacularly in 1983. Thus, the inclusion of a DeLorean was a topical joke at the time, although it turns out to have immortalized the irretrievably bankrupt DeLorean brand.\n\nThe new musical import from London is built around the spectacle of that flying DeLorean; or at least, I imagine the show would be just another mediocre effort without the spectacular flying machine. The prop car, built by a company called Twins FX, turbocharges the audience at least four times, and deserves the waves of applause it garners.\n\nWhich leads us, inevitably, to items of lesser importance like book, music, lyrics, et al. Gale, who wrote the screenplay with Robert Zemeckis (director of the original film and one of numerous coproducers of the musical), has done a respectable job of adapting it to the stage. All the film highlights seem to be here, which is to the good. As for the score by Alan Silvestri (composer of the film) and Glen Ballard (composer/lyricist of that excessively bland Ghost musical that visited the Lunt in 2012), let’s just say that it gets by; this is one of those shows with the music so brutally amplified as to make the words often impossible to comprehend. Why is it, though, that when Bart starts singing his first number, “It Works,” we can suddenly understand every crisply precise word? Perhaps because the lyrics to this song sit well on the music; the orchestrators let the singer handle the melody; and Bart is mighty good.\n\nSeveral scenes later, Coles—as Marty’s ineffectual father transformed into the teenager he was in 1955—has a ditty which goes “My myopia is my Utopia and I’m hopin’ ya feel it too.” While this would not turn the late and revered Sheldon Harnick green with envy, it suggests that at least one of the songwriters does have a musical comedy point of view.\n\nAfter another lull of small-town teenage machinations, the proceedings are suddenly jolted from auto-pilot by an honest-to-goodness musical comedy production number. Not only tuneful and melodic, but with actual words that fit the awkwardness of the situation. The teenaged Lorraine, who in this science fiction romp is Marty’s mother 13 years before he’s born, is unwittingly flirting with the time-travelling Marty, a.k.a. Calvin Klein (don’t ask, but it’s one of the film’s wisest jokes). She stops dead in her tracks when she suddenly realizes that, well, there’s “Something About That Boy.” She is joined by the other girls, and then by everyone, the number building—like a Broadway showstopper ought to—to such high velocity that they drop the act curtain on a frenzied ensemble and an almost equally energized audience.\n\nThe intermission gives the cast time to regroup, as well as the producers time to sell a full line of Back to the Future merchandise. Marketing tip: You will sell far more t-shirts and hats and posters and paraphernalia if you send the ticketbuyers out at halftime all revved up. Me, I took the time to thumb through the Playbill bios in search of the the credits of the designer, only to first land on the extensive bio of the “Ticketing and Revenue Director.” So much for “Who’s Who in the Cast.”\n\nFrom “Something About That Boy” on, Back to the Future is more or less as joyful and funny as the creators intended—which is something we can’t quite say for most of the first act. But we’re putting the horse before the cart, or the flux capacitor before the lithium boost that sends that flying DeLorean soaring not only back to the future but out over the heads of the folks in the front of the house. Can’t you just hear the shill of the marketers hawking “premium seats”?\n\nThe flying car isn’t the show’s only asset, not when you’ve got Bart and Likes clowning for your own personal pleasure. Bart has done it before, again and again, in You’re a Good Man, Charlie Brown, The Producers, and Young Frankenstein. Here he holds the audience captive as if his workshop tools include a cone of hilarity. (Is he surreptitiously channeling forgotten comedian Red Skelton, pursing his lips over a recessed chin and offering tell-tale cross-eyed takes?)\n\nAs for the 21-year-old Likes, Back to the Future is a case of getting what you deserve: a starring role in a new Broadway musical hit. Quickly, too. He was the only compelling reason to see last November’s Almost Famous. Everything about his performance screamed, “Give this kid his break!” Now he has it, and he manages to drive the Back to the Future musical in much the same way that young Michael J. Fox did the film back in 1985.\n\nAs if two outlandish star comedy performances are not enough, British import Cole—as Marty’s father, George McFly—runs a close third. The fellow vibrates in place as if he has kinetic rubber bands for limbs, anchored to the ground by invisible gravity boots. Otherwise, highest praise goes to designer Tim Hatley (most recently here with Life of Pi), lighting designers Tim Lutkin and Hugh Vanstone, video designer Finn Ross, and illusion designer Chris Fisher. Along with lead producer Colin Ingram, who paid for it all.\n\nSo what if certain element of the well-made musical comedy are conspicuously lacking in Back to the Future? When the DeLorean takes off, revs up, and flies through the Winter Garden with soaring sound and neon-streaked side walls, the producers—and the audience—get what they paid for.\n\nBack to the Future opened August 3, 2023, at the Winter Garden Theatre. Tickets and information: backtothefuturemusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
