{
  "showId": "back-to-the-future",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2023/08/03/back-to-the-future-a-sensory-assault-with-songs/",
  "publishDate": "2023-08-03T21:53:55",
  "fullText": "For years, theater fans have been lamenting the “Disneyfication” of Broadway, but that term isn’t quite fair to Disney. In truth, a whole cabal of studios and abetting producers enabled the trend in blockbuster movies being converted into flashy musical spectacles. Sometimes the latter can be fun and even stylish, if you can look and listen past the generally unsurprising storylines and usually lackluster original scores.\n\nThen there are shows like Back to the Future: The Musical, whose title is something of a misnomer: This adaptation of the Universal Pictures/Amblin Entertainment hit about a teenager who finds himself bounced back from 1985 to 1955 is less a musical than a two-and-a-half-hour theme park ride with songs, offering as much sensory overload as an afternoon at Magic Kingdom.\n\nIndeed, the warnings that can accompany splashily high-tech productions, to pregnant women and theatergoers prone to migraines and seizures, should have been emblazoned on the playbill cover in this case. Strobe lights and other visual shenanigans, from Finn Ross’s dizzying video design to a flying car, are just the beginning; for me, the auditory assaults leveled by sound designer Gareth Owen (in conjunction with musical supervisor Nick Finlow and music director Ted Arthur, I assume) hit the hardest. Before the first act was even half over, I had crafted makeshift earplugs out of tissue paper, a trick I typically reserve for the loudest rock concerts.\n\nBut perhaps that’s the vibe this Back to the Future‘s creators, among them original co-screenwriter Bob Gale, were going for. The film showcased two songs by Huey Lewis and the News—hardly headbangers, to be fair—including the chart-topping “The Power of Love”; both tunes are featured in the stage incarnation, along with early rock classics “Johnny B. Goode” and “Earth Angel,” which were also included on the soundtrack.\n\nExcerpts from Alan Silvestri’s film score are inserted into the action, and Silvestri and pop veteran Glen Ballard—best known by rock and Broadway fans for his contributions to Alanis Morissette’s Jagged Little Pill, the album and musical (though he also co-wrote the score for Ghost: The Musical and has songs featured in MJ The Musical)—have crafted a bunch of turbo-charged tunes that are memorable mostly for the affable banality of their lyrics.\n\n“Now the walls just keep closing in/And I don’t know if I’ll ever win,” sings our hero, Marty McFly, played by an agreeable Casey Likes, who made his Broadway bow last year in a similar role—yearning teenager thrust into extraordinary adventure—in another musical adaptation of a hit film, Almost Famous. Marty’s mom, whom he will awkwardly encounter as a nubile beauty in the ’50s, is portrayed by a winsome Liana Hunt, who gets to croon, in the same song, “You look around/And you start to see/That you’re living out your fantasy/It starts to feel like destiny/Like it’s meant to be.”\n\nHugh Coles steals a scene or two as Marty’s dad, an über-nerd who has his own solo number, with the following chorus: “My myopia/Is my utopia/And I’m hoping you’re feeling it/See how I’m dealing with it/I’m hoping you’re feeling it too.” Who says they don’t write ’em like they used to?\n\nThe role of Doc Brown, the freaky scientist whose experiments accidentally hurl Marty back in time, is played by Roger Bart, whose considerable comedic gifts enhanced the 1999 revival of You’re A Good Man, Charlie Brown and the original production of The Producers, among other shows. Here Bart is pretty much relegated to reproducing the kind of shtick that got Christopher Lloyd, who was Doc to Michael J. Fox’s Marty on screen, laughs, with director John Rando gamely milking each exchange.\n\nAt the preview of Back to the Future I attended, in fact, audience members reserved their greatest enthusiasm for references to the film and special effects, though not necessarily in that order. Towards the end, a character called Uncle Huey materializes, a nod to Lewis’s cameo in the movie—which is readily available on streaming outlets, for a tiny fraction of the cost of a Broadway ticket. A day pass to Six Flags Great Adventure might also prove a better bargain.\n\nBack to the Future opened August 3, 2023, at the Winter Garden Theatre. Tickets and information: backtothefuturemusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars"
}
