{
  "showId": "arcadia-2011",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Elisabeth Vincentelli",
  "url": "http://www.nypost.com/p/entertainment/theater/the_tedium_is_the_message_in_tangled_Q0IC1kUiMoTbGmQGPwZDwK#ixzz1Gy9Ja8gz",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Tom Stoppard's 'Arcadia' is witty, erudite and cunningly structured. David Leveaux's revival, which opened on Broadway last night, looks handsome, and its cast, including Billy Crudup and Raúl Esparza, does fine, nuanced work. But boy, is the show tedious.",
  "bwwScore": 6,
  "contentTier": "complete",
  "fullText": "\"Oz the Great and the Powerful\" lived up to its name at the box...\n\n\"Oz the Great and the Powerful\" lived up to its name at the box office over...\n\nMichelle Obama's 50th-birthday bash next year could be a star-studded...\n\nA smiling Timothy Cardinal Dolan wowed worshipers at Our Lady of Guadalupe...\n\nIt's last call for calories. Today is the final day for restaurants and...\n\nBillionaire George Soros is finally fighting back in the legal...\n\nBillionaire George Soros is finally fighting back in the legal wrangle with...\n\nYankees slugger Alex Rodriguez is on the hunt for a new Manhattan apartment...\n\nMiami billionaire Jeff Soffer had a change of heart, and decided he wanted...\n\nTiger Woods' ex-wife, Elin Nordegren, is quietly dating her older Florida...\n\nOAKLAND, Calif. — Stephen Curry scored 26 points, David Lee had...\n\nOAKLAND, Calif. — Stephen Curry scored 26 points, David Lee had 21 and the...\n\nTAMPA — The buses were loading for the 23-mile trip to Dunedin and a game...\n\nDORAL, Fla. — Never mind what the Official World Golf Rankings tell you...\n\nWASHINGTON — Halfway through a season in which the Rangers have struggled...\n\nWhen we mere mortals feel faint and off-kilter and fear we're having a...\n\nWhat-the-hell was ABC thinking when they decided to torture Elisabeth...\n\nAlbums of the Week David Bowie \"The Next Day\" ★★★ 1/2 DAVID Bowie's...\n\nFour nights a week, Mile End Delicatessen in Boerum Hill serves its...\n\nARCADIA Ethel Barrymore Theatre, 243 W. 47th St.; 212-239-6200. Through June 19.\n\nTom Stoppard's \"Arcadia\" is witty, erudite and cunningly structured. David Leveaux's revival, which opened on Broadway last night, looks handsome, and its cast, including Billy Crudup and Raúl Esparza, does fine, nuanced work.\n\nIf you've seen Stoppard's other work, most recently the trilogy \"The Coast of Utopia,\" you know the drill: He does lots of research, then has characters mouth it back to us. Invisible footnotes dangle from every other line.\n\n\"Arcadia\" takes place in the main room of the English estate of Sidley Park. With its high ceilings and marble walls, it looks like a fascist dictator's memorial -- though the real problem is that Hildegard Bechtler's set creates terrible acoustics.\n\nWhile the location remains the same, the action alternates between the 19th century and the present day -- until the last scene, when characters from both eras share the stage.\n\nThe period characters, especially the precocious Thomasina Coverly (Bel Powley) and her tutor, Septimus Hodge (Tom Riley), handle most of the play's emotional load, while the contemporary inhabitants try to parse what happened in the house centuries earlier.\n\nStoppard makes this historical sleuthing somewhat interesting, as past and present gradually\n\nfill in the puzzle. Then again, A.S. Byatt did the same thing more successfully in her 1990 novel \"Possession,\" three years before \"Arcadia.\"\n\nThe show goes down easily enough. Stoppard has a way with bon mots, though he can be precious: \"Do not dabble in paradox,\" Lady Croom (Margaret Colin, marvelously unflappable) admonishes her brother in the early 1800s. \"It puts you in danger of fortuitous wit.\" Worse, Powley's squeaky readings make Thomasina's quips sound as if she's on \"The Big Bang Theory.\"\n\nWhether he's dealing with the laws of thermodynamics or Romanticism vs. Classicism, Stoppard avoids jargon and lets the audience feel pleased about itself for attending such a smart show. In its own way, this is as pandering as \"Mamma Mia!\"\n\nNever mind that what's onstage feels mechanically plotted, or that you care little for these chattering people. Only Lia Williams and Billy Crudup -- as a writer and an ambitious academic, respectively -- fully suggest the passion and drive that fuel intellectual investigation.\n\nOtherwise, \"Arcadia\" feels like a loop-de-loop feeding on its own cleverness. It's easy to admire, but hard to love.\n\nelisabeth.vincentelli@nypost.com\n\nBy clicking 'SIGN-UP' you agree to our Terms of Use & Privacy Policy\n\nNEW YORK POST is a registered trademark of NYP Holdings, Inc.\n\nnypost.com, nypostonline.com, and newyorkpost.com are trademarks of NYP Holdings, Inc.\n\n©",
  "isFullReview": true,
  "textWordCount": 662,
  "archivePath": "data/archives/reviews/arcadia-2011/nypost--elisabeth-vincentelli_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:42:09.957Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20130312064721",
  "archiveOrgUrl": "http://web.archive.org/web/20130312064721/http://www.nypost.com:80/p/entertainment/theater/the_tedium_is_the_message_in_tangled_Q0IC1kUiMoTbGmQGPwZDwK",
  "wordCount": 662,
  "tierReason": "Full review text"
}