{
  "showId": "liberation-2025",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theaterscene.net/plays/broadway-plays/liberation-2/victor-gluck/",
  "publishDate": null,
  "fullText": "Posted on November 9, 2025 by Victor Gluck, Editor-in-Chief in Broadway, Plays, Still Open Kristolyn Lloyd, Adina Verson, Betsy Aidem and Audrey Corsa in a scene from the Roundabout Theatre Company’s production of Bess Wohl’s “Liberation” at the James Earl Jones Theatre (Photo credit: Little Fang) Liberation, Bess Wohl’s latest play, has weathered the transition from the Roundabout Theatre Company’s Laura Pels Theatre to Broadway’s James Earl Jones Theatre and the play is now more impressive than before. Wohl has shortened the running time (all to the good) with some judicious cuts that won’t be noticed by theatergoers who have seen the earlier production. The play seems to move more quickly even though all the same scenes are still there. The author has now revealed that although the play is in no way autobiographical (made clear in the subtitle “A Memory Play About Things I Don’t Remember”) she does recall her mother working for MS. magazine when she was growing up. The Ohio setting was inspired by Judith Ezekiel’s Feminism in the Heartland, demonstrating that women’s lib was being debated all over the US, not just in the big cities. Wohl’s ambitious and engrossing Liberation attempts to investigate the roots of the Women’s Liberation Movement back in the seventies from a decidedly contemporary point of view. Calling it a “memory play,” she uses a narrator “Lizzie,” who tries to recreate the consciousness raising group her mother started back in 1970 in Ohio where she lived at the time. Complicating things for the viewer, Lizzie also plays her own mother (who also seems to be named “Lizzie”) in the flashbacks, showing us seven meetings from the many the group had in their weekly encounters back in the seventies. She also interviews the survivors now in the present about what they recall of those days as her mother has recently passed away and it is too late to ask her more questions. Susannah Flood and Betsy Aidem in a scene from the Roundabout Theatre Company’s production of Bess Wohl’s “Liberation” at the James Earl Jones Theatre (Photo credit: Little Fang) Whitney White, who has had great success with new plays by women of color such as Jocelyn Bioh (Jaja’s African Hair Braiding), Aleshea Harris (On Sugarland and What to Send Up When It Goes Down), Ife Olujobi (Our Dear Dead Drug Lord) and Lynn Nottage (The Secret Life of Bees), has made the six women in the group so completely different that we know them from the very beginning and care about each of their various stories. Betsy Aidem (Margie), the oldest of the women, is married with grown up sons who are out of the house. Her problem is her husband Bert has retired and is now home all the time but does not help out with any of the chores. Dora (Audrey Corsa), an attractive blonde, resents that the men in her firm (which markets wine and spirits) keep getting promotions when she does much more work than they do. Kristolyn Lloyd’s Celeste is a New York book editor who has had to grudgingly return home to help care for her bedbound mother. Extremely articulate about women’s rights, she has been a radical seen in a march by one of the other women back in Greenwich Village and will publish her own book someday. Susan (Adina Verson) is a radical lesbian who has left home and is living out of her car. Currently out of work, she is also very independent and holds more advanced views than the local women. Irene Sofia Lucio’s Isidora is an Italian immigrant who has seen a great deal of the world and had married a local man in order to get her green card. She likes to tell things as they are. And Susannah Flood’s Lizzie is a journalist whose editor will not give her more than weddings and obits or allow her to get involved with local political movements. The Lizzie of today is a Brooklyn woman with two children who wonders how she ended up with so traditional a life – just like her mother eventually did. Betsy Aidem, Kristolyn Lloyd, Irene Sofia Lucio, Adina Verson, Audrey Corsa and Susannah Flood in a scene from the Roundabout Theatre Company’s production of Bess Wohl’s “Liberation” at the James Earl Jones Theatre (Photo credit: Little Fang) The play takes place on a basement basketball court in the local rec center somewhere in Ohio on Thursday nights at six PM in David Zinn’s realistic setting. There are banners congratulating the boys’ teams but none for girls. A clock on the back wall cleverly reminds us that time is passing. Each of the play’s many scenes tackles another issue of the women’s movement. After the initial scene in which the women introduce themselves to each other, the second one introduces the glass ceiling. Dora has had an aggravating day at the office discovering that her colleague Ray, who does little work and allows her to save him time and again, has been given a promotion and now she has to report to him. The women discuss her options and how to deal with her situation. In the next meeting, Margie speaks up about action she took at home: she made a three-page list of all the jobs she does as a housewife and posted it for her husband, asking him to circle the items with which he will offer to help. She is still waiting for his response three weeks later. Asked why she doesn’t leave him, she points out she has never paid a bill, has no bank account and can’t drive. She feels that marriage in 1970 is a trap and warns the other women about making the same mistake. As the days turn towards August 1970, the National Organization of Women’s Strike for Peace is discussed in its local version. Which of the women will join? Can Margie leave her husband to his own devices, he who can’t even boil water? Will Lizzie risk losing her job and defy her editor? By the end of Act One, we find out which women have the courage to march for equality. Kayla Davion and Charlie Thurston in a scene from the Roundabout Theatre Company’s production of Bess Wohl’s “Liberation” at the James Earl Jones Theatre (Photo credit: Little Fang) The second act turns to Lizzie (the mother) and her relationship with her boyfriend Bill (Charlie Thurston), a crackerjack lawyer, who she has kept a secret from the other women. The modern Lizzie wants to know why her mother made the choice she did to marry and follow Bill (her father) to New York, giving up her own career, but had never gotten around to asking her. Joanne (played by Kayla Davion), a Black woman who has shown up to find her son’s missing backpack and has complained that she hasn’t been given enough to do in the story, offers to play Lizzie’s mother. The final scene has Lizzie confront her mother (now played by Aidem) as to the choices she made. Her mother reminds her how different things were for women then: they couldn’t get a loan at the bank, couldn’t buy a home and couldn’t have their own credit card. Among the many themes the play discusses are “why does it feel somehow like it’s all slipping away? And how do we get it back.” However the most shattering remark leveled at Lizzie by Margie is “You want a revolution, but you want it on your own terms and you don’t want to give up anything to get it.” Is Lizzie a coward? But then how would we behave in similar circumstances? The scene that causes the audience’s cell phones to be locked up has all the participants undressed and sitting in the nude – a technique for consciousness raising they found in an article in Ms. Magazine – and they discuss how they feel about their own bodies. Not surprisingly, most of them can’t wait to put their clothes back on. The many period perfect costumes are by Qween Jean; if memory serves several of them are different from the Off Broadway production. The hair and wig design by Nikiya Mathis also takes us back to the 1970s. Adina Verson, Susannah Flood, Betsy Aidem, Audrey Corsa, Kristolyn Lloyd and Irene Sofia Lucio in a scene from the Roundabout Theatre Company’s production of Bess Wohl’s “Liberation” at the James Earl Jones Theatre (Photo credit: Little Fang) This latest play by Bess Wohl does not have any answers but does state the questions very well. She also reviews the distance that women have come in the last 55 years and reminds us that the work is not yet finished. We listen as they reveal secrets and discover the choices that they make over the course of three years. The cast is excellent in their distinctive roles. The author has given Flood the most difficult role playing two different women in two time frames simultaneously. At times we are not absolutely certain when she is speaking as Lizzie the mother or Lizzie the daughter. This has been smoothed out more in this production partly through Cha See’s lighting but could still use tweaking. Wohl’s play remains an important document of an earlier time when women’s liberation seemed just around the corner. Liberation (extended through February 1, 2026) James Earl Jones Theatre, 138 W. 48th Street, in Manhattan For tickets, visit http://www.liberationbway.com/tickets/ Running time: two hours and 30 minutes including one intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1585,
  "archivePath": "data/archives/reviews/liberation-2025/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:36:30.772Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}