{
  "showId": "a-gentlemans-guide-to-love-and-murder-2013",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2013/11/18/theater/reviews/a-gentlemans-guide-to-love-and-murder-on-broadway.html",
  "publishDate": "November 17, 2013",
  "fullText": "Serial killers may be all the rage on bookshelves and television screens — so ubiquitous, you’d think they made up a major demographic of the world population — but they are comparatively rare in the peppier precincts of musical theater. Now, after a long dry spell, Broadway has a deadly sociopath to call its own. Please give a hearty welcome to Monty Navarro, the conniving killer who helps turn murder most foul into entertainment most merry in the new musical “A Gentleman’s Guide to Love & Murder.”\n\nDespite the high body count, this delightful show will lift the hearts of all those who’ve been pining for what sometimes seems a lost art form: musicals that match streams of memorable melody with fizzily witty turns of phrase. Bloodlust hasn’t sung so sweetly, or provided so much theatrical fun, since Sweeney Todd first wielded his razor with gusto many a long year ago.\n\nThe seriously squeamish needn’t fear entering the Walter Kerr Theater, where this frolicsome operetta opened on Sunday night. Although our antihero, played with brash innocence lightly sprinkled with arsenic by Bryce Pinkham, eventually piles up a stack of corpses to rival that of dear old Mr. Todd, he’s a much cuddlier fellow. A gentleman indeed, whose only wish is to secure his fortune by bumping off a few inconvenient relatives in Edwardian England.\n\nSince these spoiled sprigs on the family tree are mostly stuffed shirts or stuffed skirts — and are all played by the dazzling Jefferson Mays — you’ll be laughing too hard to shed a tear for any of them. (Those looking for fresh holiday entertainment for the family should know there’s nothing here to frighten children.)\n\nMr. Mays won a Tony Award for playing multiple roles in the Pulitzer Prize-winning solo show “I Am My Own Wife,” but the chameleonic performance he gives here makes even that feat seem simple — a matter of filing your nails while whistling “Edelweiss,” say. In a true tour de force that is hardly likely to be bettered on Broadway this season (apologies to the magnificent Mark Rylance, and those two knights, Ian McKellen and Patrick Stewart, performing Beckett and Pinter in repertory), Mr. Mays sings, dances, ice-skates, bicycles and generally romps through some eight roles — flipping among personas male, female and somewhere in between — at a pace that sets your head spinning. (It’s almost an in-joke when one of his doomed characters meets his end through decapitation.)\n\nWritten by Robert L. Freedman (book and lyrics) and Steven Lutvak (music and lyrics), both welcome newcomers to Broadway, “Gentleman’s Guide” is based on a 1907 novel by Roy Horniman. Fans of British film will recognize the plot from the classic British comedy “Kind Hearts and Coronets,” which gave Alec Guinness a chance to display his own virtuosity as a raft of British gentlefolk falling prey to an ambitious relative. Here the mood is more farcical, the score a skillful homage to Gilbert and Sullivan, and the well-heeled family is called the D’Ysquiths. (That’s DIE-squith, wouldn’t you know.)\n\nThe penniless Monty little knows of his relationship to the clan when we find him, in the opening scene, mourning his newly deceased mother. A visit from an old friend of hers, the nosy Miss Shingle (the excellent Jane Carr), brings startling news: The mother he knew only as a Dickensian sufferer — scrubbing floors to feed her beloved only son — was in fact a highborn D’Ysquith, banished forever when she ran off with a Castilian, defying her family’s wishes.\n\n“And by my estimation,” Miss Shingle casually adds, “only eight other relations stand between you and the current Earl of Highhurst, Lord Adalbert D’Ysquith himself.”\n\nThis tempting tidbit lodges in Monty’s fertile mind and begins forthwith to sow dark intentions. Monty is on the verge of losing his love, the socially ambitious Sibella Hallward (Lisa O’Hare), to a more well-heeled man. Might she not reconsider if Monty were to establish himself as a bona fide D’Ysquith, or better yet, to hack his way through all that underbrush on the family tree and arrive at the tippy top, becoming the ninth earl of Highhurst?\n\nFortune favors the brave, and soon Monty — through happenstance and the occasional bit of malicious handiwork — is rocketing up the social scale, as his relatives fall victim to unhappy, ahem, accidents. Under the nicely pitched direction of Darko Tresnjak — a Shakespeare specialist here making his own impressive Broadway debut — Monty’s journey unfolds as a series of brisk comic vignettes, set to songs that honorably re-create the boisterous heyday of the English music hall and the prime of 19th-century operetta. (The charming set, by Alexander Dodge, features a gorgeously detailed Victorian-style stage within a stage, and the spot-on period costumes are by Linda Cho.)\n\nI could fill the rest of my review with quotations from the lyrics that particularly tickled. Here’s just a morsel, from one of the show’s highlights, a comic ditty lampooning the rapacities of would-be do-gooders, in which Lady Hyacinth D’Ysquith (Mr. Mays, natch), desperate to find a new cause to champion, lights on the opportunities in darkest Africa:\n\nWe’ll civilize a village in the jungle!\n\nIt can’t take long to learn their mother tongue!\n\nAnd all of them are different words for dung!\n\nMr. Lutvak and Mr. Freedman may be reworking forms that have been previously established, primarily the patter song and the romantic ballad. But their score still establishes itself as one of the most accomplished (and probably the most literate) to be heard on Broadway in the past dozen years or so, since the less rigorous requirements of pop songwriting have taken over.\n\nIt is beautifully sung by the rich-voiced cast, with Mr. Pinkham handling his heavy chores with a light touch, his firm tenor matched by pleasingly (and necessarily) precise diction. Ms. O’Hare plays Sibella with pertness and poise, and has a bright, clear soprano. So, too, does the wonderful Lauren Worsham, who plays Phoebe D’Ysquith, the rival for Monty’s heart, with a demure sweetness that never cloys. (Fortunately for Phoebe, she is not in the direct line of heirs to the D’Ysquith fortune.)\n\nMr. Mays is not a musical theater specialist, to be sure, which makes his accomplishment here all the more impressive. Most of his songs don’t make any great demands on the tonsils (he’s largely doing patter material), but he manages to sing in a variety of voices, distinguishing each character with a distinctive sound.\n\nA distinctive look and personality, too: the dazed, toothy dottiness of the Rev. Lord D’Ezekial; the buxom heartiness of Lady Hyacinth; the pompous grumpiness of the reigning Lord Adalbert; the tallyho perkiness of the bright-eyed beekeeper Henry (spinning forth hilarious yet never vulgar double-entendres in a mock-homoerotic duet with Monty, “Better With a Man”).\n\nAs each precise caricature of British snootiness or silliness comes bounding onto the stage, Mr. Mays seems to be challenging himself to elicit bigger laughs, and he almost always succeeds. All but one of his characters ends up six feet under by the time this daffy, inspired musical concludes, but his brilliant performance deserves to be immortalized in Broadway lore for some time to come.\n\nA listing of credits on Monday with a theater review of “A Gentleman’s Guide to Love & Murder,” at the Walter Kerr Theater in Manhattan, omitted several producers. The complete list can be found with the review at nytimes.com/theater.\n\nWhen we learn of a mistake, we acknowledge it with a correction. If you spot an error, please let us know at nytnews@nytimes.com.Learn more\n\nShare full articleAdvertisement",
  "isFullReview": true,
  "dtliExcerpt": "This show succeeds brilliantly in doing what so many Broadway musicals fail to do these days: it tells a story clearly, entertainingly and with a gratifying sense of inevitability.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This show succeeds brilliantly in doing what so many Broadway musicals fail to do these days: it tells a story clearly, entertainingly and with a gratifying sense of inevitability.",
  "contentTier": "complete",
  "contentTierReason": "Short text (29 words)",
  "previousUrl": "https://www.nytimes.com/2013/11/18/theater/reviews/a-gentlemans-guide-to-love-and-murder-opens-on-broadway.html",
  "urlDiscoveredAt": "2026-02-03T07:44:16.389Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1265,
  "archivePath": "data/archives/reviews/a-gentlemans-guide-to-love-and-murder-2013/nytimes--ben-brantley_2026-02-03.html",
  "textFetchedAt": "2026-02-03T07:44:16.394Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20241110155749",
  "archiveOrgUrl": "http://web.archive.org/web/20241110155749/https://www.nytimes.com/2013/11/18/theater/reviews/a-gentlemans-guide-to-love-and-murder-on-broadway.html",
  "wordCount": 1265,
  "tierReason": "Full review text"
}