{
  "showId": "elling-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2010/legit/reviews/elling-1117944334/",
  "publishDate": "November 21, 2010",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Despite being performed by two terrific actors, this gentle Norwegian dramedy about unlikely friendship feels airless and inconsequential in its Broadway incarnation.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Despite being performed by two terrific actors, this gentle Norwegian dramedy about unlikely friendship feels airless and inconsequential in its Broadway incarnation.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 567,
  "archivePath": "data/archives/reviews/elling-2010/variety--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:30:17.349Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "A strong writing-helming feature debut for Brit thesp Paddy Considine.\n\nBrit thesp Paddy Considine makes a strong writing-helming feature debut with “Tyrannosaur,” recycling the same cast, characters and setup he used for his 2008 award-winning short “Dog Altogether.” As in the earlier film, lonely, rage-filled widower Joseph (Peter Mullan) seeks refuge from his pain in the charity thrift store managed by Christian do-gooder Hannah (Olivia Colman). Character, dialogue, storyline and production values exude grit, an aesthetic rigor that makes “Tyrannosaur” a good fit for its Sundance festival berth. Produced by low-budget imprint Warp X, pic looks set to avoid extinction via further fest exposure and niche theatrical outings.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Damon Lindelof Sets Limited Series 'The Chain' at HBO Under New Overall Deal \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'It's Florida, Man' Renewed for Season 3 at HBO\n\nIf a character’s treatment of his dog serves as a shorthand indicator of his or her moral compass, Considine challenges auds from the outset, as protag Joseph (Mullan) drunkenly boots his canine companion to near-death before the opening titles. In short order, Joseph takes on three young men whose noisy horseplay at a pub pool table disturbs his drinking session, and then mocks the religious convictions of Hannah (Colman). At least Joseph doesn’t want for self-knowledge, judging by his pithy assessment, “My best friend’s dying of cancer. I killed my dog. I’m fucked.”\n\nIn a significant shift from “Dog Altogether,” this feature-length version finds its most striking subject in Hannah, whose cheerful demeanor and religious certitude mask a desperate home life with abusive husband James (Eddie Marsan). Torment can quietly flourish at all levels of society, evidently, although it’s a stretch to believe that Hannah, as she’s presented, might meekly accept her husband urinating on her as punishment for falling asleep on the sofa. Her later revelations of James’ worst depravities, which have prevented her from ever conceiving a child, are even more disturbing.\n\nThe pic is well served by its three principal thesps, who all prove eminently capable of suggesting the full depths of these interior lives. Mullan’s likability is a prime asset, given his character’s alienating aspects, and he and Colman (best known to Brit auds for sitcom “Peep Show”) enjoy an easy chemistry after Hannah leaves James to bunk with Joseph. Marsan (“Vera Drake,” “Happy-Go-Lucky”) chillingly swings between geniality and hostility.\n\nConsidine deploys none of the warm humor found in the work of countryman Shane Meadows, for whom he has acted many times, beginning with 1999’s “A Room for Romeo Brass.” Brief flashes of levity do arrive courtesy of Joseph’s well-intentioned drinking partner, Tommy (Ned Dennehy), and humor of a darker hue comes from Joseph himself, notably in his explanation of the nickname he gave his amply proportioned wife (which gives the pic its title). The film initially seems happy to privilege situation over story, until a nimbly executed narrative kick late in the proceedings en route to a satisfying tie-up.\n\nAuds hoping for a compensatory poetic dimension amid the grimness — the kind provided by other low-budget Brit helmers like Lynne Ramsay (“Ratcatcher”) and Andrea Arnold (“Fish Tank”) — will find scant solace in lenser Erik Alexander Wilson’s defiantly prosaic lighting and camera setups or Simon Rogers’ dour, budget-appropriate production design. At least the lyrical guitar strumming fashioned by composers Chris Baldwin and Dan Baker, plus a couple of well-chosen and adroitly placed songs by others, provide a welcome emotional outlet."
}