{
  "showId": "elling-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://www.variety.com/review/VE1117944090?categoryid=33&cs=1&nid=2562&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:+variety/headlines+(Variety+-+Latest+News)",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "Elling\" looks like a hard sell for Broadway. Simon Bent's stage adaptation of Norwegian author Ingvar Ambjornsen's cult novels about two former mental patients adjusting to life in the \"normal\" world was rumored to have had a certain gentle, wistful charm in its London production. (The 2002 film version was up for a foreign-language film Oscar.) But as dumbed down for American auds (why do they keep doing this to us?), this queasy-making comedy is so broadly played, by a",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ELLING-20101121",
  "contentTier": "complete",
  "fullText": "Nov 21, 2010 6:53pm PT \n\n \n\n \n \n \n\n \n\n \n Elling\n \n \n\n \n\n \"Elling\" looks like a hard sell for Broadway.\n\nElling” looks like a hard sell for Broadway. Simon Bent’s stage adaptation of Norwegian author Ingvar Ambjornsen’s cult novels about two former mental patients adjusting to life in the “normal” world was rumored to have had a certain gentle, wistful charm in its London production. (The 2002 film version was up for a foreign-language film Oscar.) But as dumbed down for American auds (why do they keep doing this to us?), this queasy-making comedy is so broadly played, by a cast headlined by Denis O’Hare and Brendan Fraser, it’s close to sitcom. Call it “Friends With Mental Issues.”\n\nWhen first met, the anxiety-riddled Elling (O’Hare) and goofy giant Kjell (Fraser) are roommates in a Norwegian institution they aren’t shy about calling “the nuthouse.” Since scribe Bent is vague about the medical particulars, both thesps are obliged to broadcast their characters’ mental limitations in blunt behavioral terms.\n\nElling, a sensitive “Mommy’s boy” who took to sleeping in the wardrobe after his mother died, is so non-functional he can barely peel a hard-boiled egg. With his wiry frame and intense expression of perpetual anxiety, O’Hare is shrewdly cast as this would-be poet, but the manic tone of the production limits this fine actor’s ability to show us how painful it must be to actually live in Elling’s skin.\n\nThe childish Kjell is a much simpler character, largely defined by his gargantuan appetites, including an unfulfilled sex drive that would be frightening if it weren’t strongly sweetened and played for laughs. Relating to the essential innocence of this big, clumsy baby, Fraser gives his all to the part and seems not to mind that it’s actually a cruel caricature.\n\nEven after two years in the nuthouse, this unconventional odd couple seems incapable of functioning off the institutional leash. But a cheery social worker, Frank (Jeremy Shamos, dependably sane), is determined to install them in a halfway house in Oslo.\n\nSo, it’s off they go to the big city, still without any observable survival skills, where they find themselves in another vast, empty room in an even scarier environment. While it’s possible to interpret these soulless surroundings as symbolic of how lost these two misfits must feel in the big, wide world, Scott Pask’s spare set and Kenneth Posner’s severe lighting are more of a visual giveaway of how ill suited this intimate show is to a big Broadway house.\n\nHelmer Doug Hughes mines all the humor he can from the friends’ terrifying learning experiences in fending for themselves. Elling nearly starves to death before he can bring himself to go out for food, and Kjell seems unable to master the basic skill of changing one’s underpants.\n\nBut once the roommates work up their courage and begin to interact with other people, the play reveals more relaxed, genuine charms. The ever-exuberant Kjell hurls himself into a boisterous courtship of a big-hearted and hugely pregnant neighbor named Reidun (a Nordic Amazon, in Jennifer Coolidge’s generous perf). Elling, who has been scribbling his thoughts into a journal all the while, makes the acquaintance of the eccentric Alfons, a famous poet-recluse who brings light and air and honest laughter into the play, through Richard Easton’s wonderful perf.\n\nHave Elling and Kjell become “normal?” Or is the “normal” world as nutty as they are? Honestly, it doesn’t bear thinking about.",
  "isFullReview": true,
  "textWordCount": 566,
  "archivePath": "data/archives/reviews/elling-2010/variety--marilyn-stasio_2026-02-06.html",
  "textFetchedAt": "2026-02-06T05:53:12.395Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 566,
  "tierReason": "Full review text"
}