{
  "showId": "death-of-a-salesman-2022",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Adrian Horton",
  "url": "https://www.theguardian.com/stage/2018/oct/17/death-of-a-salesman-review-don-warrington-royal-exchange-manchester",
  "publishDate": "October 10, 2022",
  "fullText": "Bluff authoritarian growl … Ashley Zhangazha and Don Warrington in Death of a Salesman. Photograph: Johan PerssonView image in fullscreenBluff authoritarian growl … Ashley Zhangazha and Don Warrington in Death of a Salesman. Photograph: Johan Persson This article is more than 7 years oldReviewDeath of a Salesman review – Don Warrington is the businessThis article is more than 7 years oldRoyal Exchange, ManchesterSarah Frankcom gives Arthur Miller’s decline-and-fall drama an extra edge in this powerful production\n\nDon Warrington’s Willy Loman is at the centre of his own universe. In any production of Arthur Miller’s suburban tragedy, the salesman is orbited by his wife and sons, but in Sarah Frankcom’s in-the-round staging, they can do little else but circle. Death of a Salesman’s original title was The Inside of His Head and in this fluid, boundary-free production, where past and present intermingle as easily as the characters slip in and out of view, you can see exactly why. Inner thoughts and spoken words get equal billing as Loman exerts his gravitational pull.\n\nGruff, quick-tempered and controlling, Warrington is every bit the patriarch. His family have learned to appease and flatter, keen to maintain his image as a successful self-made man. When he claims the buyers he deals with on the road have started to find him “foolish to look at” and are mocking his “walrus” features, you think he must be mistaken, even mentally unbalanced. For how could such a dapper man, his tie neat beneath his waistcoat, his grey hair trimmed short, strike anyone as comical?\n\nYet the moment his estranged brother Ben circles into his memory, our perspective changes. Played by Trevor A Toussaint, he is taller, broader, more radiant, and makes Willy seem to crumple. In the company of a man who embodies success – not just the idea of success – Warrington’s Loman is brought down to size. His suit looks cheaper, his stature is diminished, his confidence seems like bluster. In the inside of his head, Willy is a respected businessman, admired and well liked. In the real world, he is simply another huckster in a suit.\n\nView image in fullscreenMorose optimism … Buom Tihngang, centre, as Happy in Death of a Salesman. Photograph: Johan PerssonFrom a modern British perspective, it can be hard to place the Loman family on the social ladder. By our standards, they can seem too comfortably off, with too little to lose from the consumer boom of postwar America. But Frankcom’s casting gives this decline-and-fall drama an extra edge. By presenting them as African Americans, the director makes sense not only of the thriftiness and austerity, but also of the aspiration and ambition.\n\nWith Maureen Beattie as his white wife (rock-like in her devotion, bewildered at his loss), Willy sees himself as an upwardly mobile citizen, believing hard work alone can secure his status in the land of the free. As the father of a black family, he finds life a struggle and every gain hard earned. His tragedy is in putting not only his trust but also his entire sense of self into an economic system that has no reciprocal care for him. Ranting about a growing population (“There’s more people! That’s what’s ruining this country!”), he sounds very like one of today’s left behind.\n\nRead moreIn a minor-key production, stately in its pace, Ashley Zhangazha as elder son Biff has a soulful air as if beset by existential doom. Even Buom Tihngang as brother Happy brings a morose tone to his glass-half-full optimism. In this context, Biff’s rootlessness, Happy’s philandering and their joint faith in get-rich-quick schemes are the products not of an arrogant sense of white entitlement, as it can sometimes seem, but of naively having invested in a belief system that has only ever let them down.\n\nBy the play’s powerful end, Warrington has traded the bluff growl of an authoritarian for the bass notes of a furious wounded animal, followed by the broken treble of a mystified man.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "dtliExcerpt": "Pierce and Clarke are magnetic together, their chemistry crackling with the kind of lived-in intimacy that makes their eventual breakdown all the more devastating.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Pierce and Clarke are magnetic together, their chemistry crackling with the kind of lived-in intimacy that makes their eventual breakdown all the more devastating.",
  "contentTier": "complete",
  "contentTierReason": "Short text (24 words)",
  "rejectedAt": "2026-02-05T01:32:37.617Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production at the Royal Exchange in Manchester, not the current Broadway run.; gemini: This review is for a 2017 production of Death of a Salesman at the Royal Exchange in Manchester, not the current Broadway production.; kimi: This review covers the Royal Exchange, Manchester production of Death of a Salesman directed by Sarah Frankcom, not a Broadway production. The text explicitly states the venue as 'Royal Exchange, Manchester' and notes the article is more than 7 years old.",
  "promptVersion": "5.2.0",
  "textQuality": "truncated",
  "previousUrl": "https://www.theguardian.com/stage/2022/oct/10/death-of-a-salesman-review-wendell-pierce-sharon-d-clarke-broadway",
  "urlDiscoveredAt": "2026-02-04T02:44:03.528Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 680,
  "archivePath": "data/archives/reviews/death-of-a-salesman-2022/guardian--adrian-horton_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:44:03.532Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "wordCount": 680,
  "tierReason": "Full review text",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2018 outside valid range 2019–2024 for show opening 2022",
  "wrongProduction": true
}
