{
  "showId": "death-of-a-salesman-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2022/10/09/death-of-a-salesman-wendell-pierce-and-sharon-d-clarke-bring-classic-to-broadway/",
  "publishDate": "2022-10-09T20:54:40",
  "fullText": "The highlight of my last London theatre trip, in 2019, was the Marianne Elliott/Amanda Cromwell production of Arthur Miller’s Death of a Salesman at the Young Vic. With Wendell Pierce and Sharon D Clarke in the leading roles, this was a great production of a great play, presenting the playwright’s unchanged words as new, alive, and enhanced for our times.\n\nThe production has now come to Broadway’s Hudson, down the street from where Willy Loman first trundled those heavy sample cases in 1949. American actor Pierce (The Wire, Suits) and the British Clarke (Caroline, or Change) remain on hand, giving substantially the same performances as in those pre-pandemic days. But this Salesman seems not to have weathered the three years so well, losing a substantial slice of effectiveness on its journey from the Thames to the Hudson.\n\nCo-directors Elliott (War Horse, The Curious Incident of the Dog at Night-Time) and Cromwell (Elliott’s associate director on Angels in America and Company) did not envisage a radical rewrite of Miller. Rather, they retained the author’s time (1949) and place (Brooklyn) but chose to cast the Loman family with actors who are Black. Not a case of color-blind casting, mind you; but one in which this particular family lives and interacts with Willy’s traditionally white neighbors and employer. (In the first Broadway revival of the play, starring George C. Scott back in 1975, the neighbors of the white Lomans were performed by black actors—at the time a racially significant statement by Scott, who also directed.)\n\nPierce’s performance and this production, mind you, fully support what Miller wrote. There seem to be only a few minor textual changes; the football-playing Biff Loman is angling for a scholarship to UCLA, for example, rather than the then-restricted University of Virginia. But unlike with some recent Broadway productions—such as last season’s Company (from Elliott) and this week’s 1776—there is no modernistic tinkering, thank you very much.\n\nThe tragedy of Willy Loman remains. What possible future is there for a protean salesman who has lost his ability to sell, his means of living, his purpose for living? Only the death of the salesman. In Miller’s telling, and in the present production, there is nothing racial about it. Pierce’s Willy Loman, simply put, is Miller’s Willy Loman. One expects that the playwright would enthusiastically recognize this performance, which fully expresses the universality and greatness of his play.\n\nBut this production has undergone a significant sea change on its way across the Atlantic. The two leading players are imported from London, as are the design elements. Much of the overall impact, though, is diminished. The direction is now credited solely to Cromwell, without any mention of the formerly top-billed Elliott. (The pair shared an Olivier Award for the 2019 production.) Whether this is a case of the latter stepping aside to encourage her former assistant or something more pointed is unknown; Elliott’s production company remains one of the lead producers of the enterprise. Let it also be noted that the scenery by Anna Fleischle, of Hangmen, was considerably more striking at the Young Vic than on what seems to be the narrower playing space at the Hudson.\n\nThe present production starts as strongly as before, with Willy (Pierce) trodding home—under the weight of those two iconic suitcases—from his aborted selling trip while Linda (Clarke) desperately tries to rescue him from despair. As the discussion shifts upstairs to the bedroom of the angry Biff (Khris Davis) and the hapless Happy (McKinley Belcher III), the drama’s spell wavers; at least it did for this viewer. Pierce and Clarke are firmly rooted in the play. The two younger actors, though, seem to be acting out of their own experience, far away from the world of their stage parents.\n\nThis becomes even more disruptive issue with other performers, as for example André de Shields. What’s the third leading role in Salesman, anyway? Certainly not Ben, the barely-remembered older brother who wanders through Willy’s challenged memory. Here we have the celebrated de Shields, of Ain’t Misbehavin’ and Hadestown. The recent Tony winner sashays through the play with rings on his fingers—eight of them, glistening with phony diamonds—and sequins on his toe shoes. While there is nothing blatantly incorrect in this portrayal, it does not—and perhaps cannot—be the Ben whom Pierce’s Willy sees in his meandering memories. At the Young Vic, the entire exceptional cast seemed of a piece. Here, too many of the actors seem to have been working, with sole director Cromwell, in a different rehearsal room than Pierce and Clarke.\n\nIt is not until late in the three-hour ten-minute evening that this Salesman finally starts to crackle the way the entire performance did in London. Specifically, in the office scene in which Willy—on the final afternoon of his life—encounters neighbor Charley (Delaney Williams) and his lawyer-son Bernard (Stephen Stocking). But that’s an especially long time to wait through otherwise intermittent high spots.\n\nGreat plays—and while the designation of “great” is variable, Death of a Salesman undeniably is just that—are likely to hold up in production, from year to decade to century. Match a great play with great performers and a pitch-perfect production, and you are likely to leave the theatre in wonder at just what the playwright wrought.\n\nThat was the case, for this viewer, with the productions headed by George C. Scott in 1975; Dustin Hoffman in 1984; Brian Dennehy in 1999; Philip Seymour Hoffman in 2012; and most decidedly with Pierce and Clarke at the Old Vic in 2019. But not yesterday at the Hudson, where there is a good though not exceptional production of Miller’s great play on display.\n\nDeath of a Salesman opened October 9, 2022, at the Hudson Theatre and runs through January 15, 2023. Tickets and information: salesmanonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "show-score-playwright"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "showScoreExcerpt": "\"Match a great play with great performers and a pitch-perfect production, and you are likely to leave the theatre in wonder at just what the playwright wrought.\"\n\nRead more"
}