{
  "showId": "death-of-a-salesman-2022",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2022/10/09/theater/review-death-of-a-salesman.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2022/10/09/theater/review-death-of-a-salesman.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup",
    "bww-reviews"
  ],
  "bwwExcerpt": "Miranda Cromwell's revival, based on one she directed in London with Marianne Elliott in 2019, does more than give us Black Lomans - including Khris Davis as Biff and McKinley Belcher III as Happy. It also, crucially, puts them in a largely white world. Willy's employer (Blake DeLong), his neighbor (Delaney Williams) and his mistress (Lynn Hawley) are thus more than foils in the usual sense; like Willy, you can never untangle the personal, economic and now racial threads of their behavior. And even if they aren't bigots, they electrify moments - a card game with the neighbor, a negotiation with the 'boss' - in which Willy's paranoia seems at the same time both fantastical and well founded.",
  "bwwScore": 9,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-DEATH-OF-A-SALESMAN-Opens-on-Broadway--Updating-Live-20221009",
  "fullText": "A deeply original work that is also deeply influential may yet in time be trite. What once opened eyes comes to seem preloaded behind them, as if part of the general human inheritance.\n\nSuch has been the ironic trajectory of Arthur Miller’s “Death of a Salesman.” When it premiered on Broadway in 1949, with its depiction of the false hopes of capitalism and the family dysfunction left in its wake, there were fathers for whom “the doctor had to be called because they couldn’t stop crying,” the director Mike Nichols, who saw it then, said. “It was like an explosion.”\n\nAs “Salesman” spread into the culture with astonishing speed, it helped introduce the seismic re-evaluations of the ensuing decades. But now that we take those shocks to be self-evident, the job of making the play feel as new as it once did is a difficult one for those who would revive it. “Willy Loman” has long since become shorthand for the “low man” in the pecking order. And everyone for whom it was required high school reading already knows the story: how a washed-up salesman’s delusions about American success destroy not just his own life but also those of his wife, Linda, and their sons, Happy and Biff.\n\nShort of stunt casting or radical resetting, directors must therefore dig either deeper or wider. Nichols’s 2012 Broadway production, starring Philip Seymour Hoffman and Linda Emond as Willy and Linda, went deeper, examining the work with microscopic precision and even replicating Jo Mielziner’s original set design and Alex North’s music. The result was a very powerful mounting, and I use the word advisedly: It sometimes seemed like an exhibit.\n\nThe latest Broadway revival, which opened on Sunday at the Hudson Theater, goes wider, a notably rich and mostly successful approach. For the first time in a major New York production, the Lomans are played by Black actors. Wendell Pierce, as Willy, is wrenching as he flails and fails to avoid his fate instead of slumping into it from the start. And Sharon D Clarke, as Linda, is so paradoxically shattering in her stoicism that she turns what is usually portrayed as unshakable loyalty into a kind of heedless comorbidity.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 391,
  "archivePath": "data/archives/reviews/death-of-a-salesman-2022/nytimes--jesse-green_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:34:35.568Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "needs-rescrape",
  "wordCount": 391,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T11:04:12.882Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is truncated and ends with a technical error message about retrieving article content and enabling JavaScript, making it incomplete and unscoreable; openai: The text is interrupted with a technical issue message, indicating incomplete content retrieval.",
  "promptVersion": "5.2.0"
}
