{
  "showId": "beautiful-the-carole-king-musical-2014",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Unknown",
  "url": "http://www.thewrap.com/beautiful-theater-review-carole-king-musical",
  "playbillVerdictUrl": "http://www.thewrap.com/beautiful-theater-review-carole-king-musical",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Here is arguably the nicest, most normal, least eccentric personality ever to be at the center of a Broadway musical. “Beautiful” is the show for theatergoers who don’t like drama queens. Is there such an animal?\n\nThe new Carole King bio musical “Beautiful,” which opened Sunday at the Stephen Sondheim Theater, might more aptly be titled “Nice.”\n\n“Beautiful,” of course, is just one of the singer-composer’s many hit songs. “Nice,” though, is the word that best describes this showbiz musical that goes out of its way to prove that great talent isn’t necessarily dramatic.\n\nIf this sounds like the beginning of a really downbeat review, on the contrary, it’s not. In this age of Broadway musicals starring women who must belt out an over-amplified, eardrum-splitting “Defying Gravity” anthem every other number, “Beautiful” is a refreshing, if not needed, respite on the musical landscape. It’s amiable without being heart-wrenching, amusing without being laugh-ridden, entertaining without being enthralling.\n\nAlso read: Broadway Audience White, Middle Aged and Female, Study Finds\n\nThe truly amazing thing about Douglas McGrath’s efficient book is that it provides not one major glitch on King’s rise to the top of the recording industry with her best-selling album “Tapestry.” As a 16-year-old college student (she’s so intelligent she skipped a couple of years in high school), King sold her first song, quickly landed a songwriting contract, met future husband and lyricist Gerry Goffin and wrote nothing but hits despite stiff competition from rivals Barry Mann and Cynthia Weil, who became their very best friends.\n\nWhen King finally goes solo late in act two, an impromptu gig at the Bitter End leads to a recording contract as well as a night at Carnegie Hall. In fact, the major suspense in act one is an improbable game of strip poker that the two couples play while on vacation in snowy Vermont. King quickly puts a stop to it, because in the end she is arguably the nicest, most normal, least eccentric personality ever to be at the center of a Broadway musical.\n\n“Beautiful” is the show for theatergoers who don’t like drama queens. Its producers will soon discover if there is such an animal.\n\nAlso read: Tupac Shakur Musical Headed to Broadway\n\nCompared to King’s career journey, Fanny Brice’s trip to stardom in “Funny Girl” is a real schlep. The similarity between these two backstage stories is the men these women love. Nicky Arnstein was a chronic gambler, Gerry Goffin was a serial adulterer suffering from, as the McGrath’s book describes it, a possible “chemical imbalance.” If he’d been faithful and emotionally stable, “Beautiful” would be little more than a collection of songs, albeit a collection that is artfully woven together by McGrath and Marc Bruni’s expert direction. They even give the Goffin character a Nicky Arnstein moment: when he reunites briefly with King right before her Carnegie Hall triumph.\n\nBefore we drop the Brice connection, let it be noted that “Beautiful” stars the incredibly talented Jessie Mueller, who looks a lot like King and more than a little like Brice, and who possesses the vocal chops (as evidenced here and recent outings in “Carousel,” “On a Clear Day” and “Edwin Drood”) to fill Barbra Streisand’s shoes in that long-awaited first Broadway revival of “Funny Girl.”\n\nAlso read: Carole King Is First Female Songwriter Honored With Library of Congress’ Gershwin Prize\n\nMueller is well supported here by Jake Epstein’s Goffin, Anika Larsen’s Weil and Jarrod Spector’s Mann. Together they make a really nice team.\n\nTired of Broadway brass? You’ll love Mueller. She nearly apologizes when she takes the stage.\n\nTheWrap speaks to the MTV thriller's stars about romantic...\n\n© The Wrap News Inc. 2013\n | Privacy Policy",
  "isFullReview": true,
  "textWordCount": 615,
  "archivePath": "data/archives/reviews/beautiful-the-carole-king-musical-2014/thewrap--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:42:26.873Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 400 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140114203014",
  "archiveOrgUrl": "http://web.archive.org/web/20140114203014/http://www.thewrap.com:80/beautiful-theater-review-carole-king-musical",
  "contentTier": "complete",
  "wordCount": 615,
  "tierReason": "Full review text"
}