{
  "showId": "beautiful-the-carole-king-musical-2014",
  "outletId": "timeout",
  "outlet": "Time Out",
  "criticName": "Unknown",
  "url": "http://www.timeout.com/newyork/theater/beautifulthe-carole-king-musical",
  "playbillVerdictUrl": "http://www.timeout.com/newyork/theater/beautifulthe-carole-king-musical",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Beautiful—The Carole King Musical\n\nBeautiful—The Carole King Musical\n\nBeautiful—The Carole King Musical\n\nBeautiful—The Carole King Musical\n\nBeautiful—The Carole King Musical\n\nBeautiful—The Carole King Musical\n\nBeautiful—The Carole King Musical\n\nBeautiful—The Carole King Musical. Stephen Sondheim Theatre. (see Broadway). Book by Douglas McGrath. Music and lyrics by Carole King, Gerry Goffin, Barry Mann and Cynthia Weil. Directed by Marc Bruni. With Jessie Mueller. Running time: 2hrs 30mins. One intermission.\n\nBeautiful—The Carole King Musical: In brief\n\nRecently minted Broadway star Jessie Mueller finally gets a vehicle specially crafted for her gorgeous voice and her innate warmth. She plays the great singer-songwriter Carole King in a retrospective about King's early life and career. Playwright Douglas McGrath provides the book.\n\nBeautiful—The Carole King Musical: Theater review by David Cote\n\nBeautiful—The Carole King Musical shares several virtues with its titular singer-songwriter, among them humility, earnestness and dedication to craft. If Douglas McGrath’s book never achieves the dramatic grit or comic zip of Jersey Boys, at least director Marc Bruni’s production avoids being a brain-dead, self-satisfied hit parade à la Berry Gordy’s Motown. Still, it does seem that stretches of Broadway’s newest jukebox musical consist of situations such as this: “Carole, you’ve got to write us a hit!” “I’ve written something.” “It’s a hit!” Yes, Beautiful loves its diligent, long-suffering pop genius, and invites you to do the same.\n\nIt’s quite an easy task when you have the phenomenal Jessie Mueller in the lead. The effortlessly appealing star cut her teeth on Broadway flops (the mis-reconceived On a Clear Day You Can See Forever) and in supporting parts (The Mystery of Edwin Drood). Now she’s ready to carry a show. As Brooklyn-raised King, who started churning out teenybopper tunes at 1650 Broadway in the late ’50s, Mueller exudes warmth and common sense, playing up King’s old-fashioned modesty and insecurity without becoming a doormat or cipher. And when she wraps her rich, burnished voice around those hits—“So Far Away,” “Will You Still Love Me Tomorrow,” “It’s Too Late”—they feel as fresh as the day King penned them.\n\nMcGrath’s deft, wry book tracks its hero’s tortured first marriage to lyricist-partner Gerry Goffin (Jake Epstein) and their friendly rivalry with another songwriting couple, Barry Mann and Cynthia Weil (Jarrod Spector, Anika Larsen), humanizing the principals in quick, confident brushstrokes. By the end, when King records her iconic feminist love anthem, “(You Make Me Feel Like) A Natural Woman,” you realize how effectively this hooky, soulful songbook and Mueller’s smartly wistful performance deliver emotional release. When the divine Mueller lets loose, you feel the earth move.—Theater review by David Cote\n\nTHE BOTTOM LINE: The wonderful Jessie Mueller puts a song (several, actually) in our heart.",
  "isFullReview": true,
  "textWordCount": 444,
  "archivePath": "data/archives/reviews/beautiful-the-carole-king-musical-2014/timeout--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:42:41.434Z",
  "originalScore": "5/5",
  "originalScoreNormalized": 100,
  "scoreSource": "star-icon",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140215015905",
  "archiveOrgUrl": "http://web.archive.org/web/20140215015905/http://www.timeout.com:80/newyork/theater/beautifulthe-carole-king-musical",
  "contentTier": "complete",
  "wordCount": 444,
  "tierReason": "Full review text"
}