{
  "showId": "beautiful-the-carole-king-musical-2014",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2014/legit/reviews/broadway-review-beautiful-the-carole-king-musical-1201049758/",
  "publishDate": "January 12, 2014",
  "fullText": "Snazzy stagecraft and a moving performance by Jessie Mueller help this bio-musical overcome its plodding book.\n\nThe early life and career of legendary singer-songwriter Carole King surely deserves more imaginative treatment than the corny chronological storytelling (And then we wrote …) and old-fashioned musical format (scene/song/scene/song) of “Beautiful.” But whenever this bio-musical stumbles over Douglas McGrath’s flat-footed book, helmer Marc Bruni rushes to the rescue with some snazzy piece of stagecraft for the sleek production numbers. And all is forgotten, even momentarily forgiven, whenever Jessie Mueller, in the modest person of Carole King, sits down at the piano and pours heart and soul into familiar favorites from the composer’s songbook.\n\nWho knew that a young Carole King (Mueller) and her husband and longtime writing partner Gerry Goffin (Jake Epstein) wrote “Will You Love Me Tomorrow” for the Shirelles, who demanded something elegant. Or “Some Kind of Wonderful ” for the Drifters, who were going for sophistication. Or “The Locomotion” for sassy Little Eva, who just wanted to be noticed.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n\n VIP+\n \n\n \n \n\n \n \n \n \n With a Data Licensing Framework in Play, Rights Holders Can Embrace AI \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Zee Sets 'Dhadak 2' for November Theatrical Release - Global Bulletin\n\nThere are beaucoup happy surprises like that in the first act of “Beautiful,” all staged by Bruni in Broadway-worthy style and smartly executed by an attractive ensemble with great pipes and nice moves. (Josh Prince did the choreography and dance captain Sara Sheperd made it happen.)\n\nIt’s touch and go, though, in the show’s awkward opening scenes, set in darkest Brooklyn, of 16-year-old Carole Klein trying to talk her mother into letting her pitch pop songs to a Manhattan record producer. The character of Genie Klein (Liz Larsen) is a cringe-worthy caricature of the overbearing Jewish mother and Larsen plays her accordingly.\n\nThat same blunt dramaturgy and broad characterization will repeatedly drag down the narrative in other book scenes. But once the pony-tailed Carole wins over pop-music producer Don Kirshner (Jeb Brown) and finds herself with a writing partner and an office at 1650 Broadway — the famed rabbit warren where white people wrote songs for black singers — the mood perks up, visually and dramatically.\n\nDerek McLane’s two-story set of metal cubicles lights up like a landing strip at JFK, thanks to Peter Kaczorowski’s eye-popping design of flashing jewel-toned headlights. This sets the scene for the show’s first, fabulous production number, “1650 Broadway Medley,” a composite recording session featuring immortal pop groups performing their biggest hits.\n\nYouth and high spirits carry off stilted book scenes in which Carole and Gerry fall in love, marry, and form a lasting friendship with the competitive songwriting team of Cynthia Weil (Anika Larsen, a dazzling nova) and Barry Mann (the extremely likable Jarrod Spector). Their sunny, wholesome personalities make a nice contrast with Carole’s self-effacing meekness and Gerry’s edgy moodiness.\n\nTheir music, though, is almost undistinguishable and versatile to a fault. That point is repeatedly and comically made by the superb ensemble singers impersonating dinner-table groups like the Coasters and the Platters. Case in point: “You’ve Lost That Lovin’ Feeling,” a song full of youthful angst when Barry sings it to Cynthia, is transformed into sophisticated soul when the Righteous Brothers (Josh Davis and Kevin Duda, who also does a hilarious takedown of Neil Sedaka) get their hands on it.\n\nWhile it’s hard to read character in sexless songs like “Who Put the Bomp,” which Barry and Gerry wrote together, we get a hint of Gerry’s troubled soul in “Up On the Roof” and Carole’s insecurity in “Will You Love Me Tomorrow.” But it isn’t until the second act, when the show leaves the foolish 50s entirely and moves deeper into the screwed-up 60s, that we get a sharper sense of how the world was catching up with all those eternal teenagers in the pop music industry. As Weil and Mann put it succinctly in 1965, “We Gotta Get Out of This Place.”\n\nFunny thing, though. Musical bios tend to slip and slide in the second act of life, when youth and spring have made their exit. Here, Carole’s personal unhappiness in her married life presage her coming into her own as a songwriter, a singer, and — can you beat it? — a performer. “I’m so square,” she admits, so completely “normal.” “Who wants to hear a normal person sing?”\n\nPlenty of people, as it turns out, couldn’t get enough of this low-keyed plain Jane (so unkindly but accurately costumed in Alejo Vietti’s ugly schmattas) once she bared her soul in “Tapestry,” the 1971 album that swept the Grammys, got her to Carnegie Hall and launched a new, grownup career.\n\nAnd that, surprisingly, is where this musical tribute leaves her, after only a few songs (“It’s Too Late” and “A Natural Woman,” along with the title song) to give us a hint of this new woman. Her more rabid fans might not appreciate the fact that the show doesn’t follow her to California or delve into her friendship with James Taylor. But the way the book is written, that might be a blessing in disguise.",
  "isFullReview": true,
  "dtliExcerpt": "Jessie Mueller gives a deeply felt performance as the singer-songwriter, capturing both her vulnerability and her strength in a musical that celebrates the golden age of pop songwriting.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Jessie Mueller gives a deeply felt performance as the singer-songwriter, capturing both her vulnerability and her strength in a musical that celebrates the golden age of pop songwriting.",
  "contentTier": "complete",
  "contentTierReason": "Short text (28 words)",
  "previousUrl": "https://variety.com/2014/legit/reviews/beautiful-the-carole-king-musical-1201076101/",
  "urlDiscoveredAt": "2026-02-03T09:39:29.616Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 848,
  "archivePath": "data/archives/reviews/beautiful-the-carole-king-musical-2014/variety--marilyn-stasio_2026-02-03.html",
  "textFetchedAt": "2026-02-03T09:39:29.622Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240617212844",
  "archiveOrgUrl": "http://web.archive.org/web/20240617212844/https://variety.com/2014/legit/reviews/broadway-review-beautiful-the-carole-king-musical-1201049758/",
  "wordCount": 848,
  "tierReason": "Full review text"
}