{
  "showId": "the-norman-conquests-2009",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2009/legit/reviews/the-norman-conquests-table-manners-1200474901/",
  "publishDate": "April 14, 2009",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Ayckbourn's comic masterwork receives a sterling revival that captures both the playwright's surgical wit and his underlying compassion for his flawed characters.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Ayckbourn's comic masterwork receives a sterling revival that captures both the playwright's surgical wit and his underlying compassion for his flawed characters.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 410,
  "archivePath": "data/archives/reviews/the-norman-conquests-2009/variety--charles-isherwood_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:55:42.453Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Jerusalem's gay community offers one small equal-footing intersection for Israelis and Palestinians, Jews and Muslims.\n\nLiberal Tel Aviv is considered the gay capital of the Middle East, while just 45 minutes away, Jerusalem is the region’s historical multifaith nexus. Yun Suh’s documentary “City of Borders” finds the latter city’s homosexual community offers one small equal-footing intersection for Israelis and Palestinians, Jews and Muslims — if only because gays of any background here share condemnation from all religious quarters. Focusing on a few representative individuals, well-made pic should continue to play the fest circuit through an as-yet-unscheduled PBS broadcast debut. Offshore tube sales are likely.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nSa’ar Netanel opened the Shushan bar the same day he became Jerusalem’s first openly gay city councilman — elected alongside its first ultra-Orthodox mayor, alas. (We see other conservative politicos and staffers routinely insult Netanel to his face at work.) The bar fast became popular among gay residents of all stripes, drawn to its inclusive vibe, as new friendships tore down long-held cultural stereotypes. But this proved only fleeting shelter from a hostile environment.\n\nBoody, a young, devout Muslim and drag performer, worries he’ll be forced to emigrate to save his neck. Exhibiting world-class denial, his otherwise supportive mother flatly refuses on camera to believe he’s really gay.\n\nSecular Jewish youth Adam Russo became an emboldened gay rights activist after he was one of several people stabbed by an Orthodox man at a 2005 gay-pride parade. Still, his political awakening only stretches so far, as he sees no problem in building a home for himself and his lover in a settlement in disputed occupied territory. Elsewhere, lesbian partners Samira Saraya and Ravit Geva struggle with the complications of crossing religious and ethnic lines within one relationship that’s already taboo to many.\n\nThe virulence of the surrounding homophobia is daunting — even when the 2006 parade is canceled for fear of violence, protestors riot and set fires anyway. Somewhat frustratingly, gays in nearby Tel Aviv aren’t all that supportive, tending to shrug and opine that fighting for rights in Jerusalem is a pointless endeavor.\n\nInvolving personality mix and balance of intimate/public dramas make the pic seem fuller than its slim running time. The film maintains its protags’ stubbornly upbeat attitude, despite the frequent hurdles and setbacks they face. Assembly is decent."
}