{
  "showId": "dead-accounts-2012",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2012/11/30/theater/reviews/dead-accounts-with-katie-holmes-opens-on-broadway.html",
  "publishDate": "November 29, 2012",
  "fullText": "Ms. Holmes, making her Broadway debut, brings a quiet, steady presence to Lorna that serves the play well. She doesn't push for laughs or tears, and her restraint feels right for a woman who has learned to keep her emotions in check.",
  "isFullReview": false,
  "dtliExcerpt": "Ms. Holmes, making her Broadway debut, brings a quiet, steady presence to Lorna that serves the play well. She doesn't push for laughs or tears, and her restraint feels right for a woman who has learned to keep her emotions in check.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "This comedy about a prodigal son, returned from the wilds of New York City to his family in Cincinnati, seems to float out of memory even as you’re watching it. Ms. Rebeck, the author of“Seminar” and “Mauritius,” keeps throwing out weighty subjects — from the ethics of Wall Street to the existence of God — but never cultivates them into anything approaching a solid existence. They all blur into a single jet stream of semisnappy dialogue before changing course a few times and evaporating…For at least its first 15 minutes “Dead Accounts” does manage to command your attention. That’s because its first scene is essentially a sustained aria of nervous energy for Mr. Butz...Ms. Rebeck doesn’t seem to have settled on a tone or, for that matter, a subject. “Dead Accounts” is, I think, meant to be about the inflation of the superficial in a materialistic society, and the attendant, unsatisfied craving for belief...But the play never follows through convincingly on any of its ideas.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-DEAD-ACCOUNTS-Opens-on-Broadway-Updating-LIVE-20121129",
  "showScoreExcerpt": "Ms. Holmes, making her Broadway debut, brings a quiet, steady presence to Lorna that serves the play well. She doesn't push for laughs or tears, and her restraint feels right for a woman who has learned to keep her emotions in check.",
  "contentTier": "invalid",
  "contentTierReason": "Short text (42 words)",
  "rejectedAt": "2026-02-05T06:16:13.865Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a brief excerpt focusing only on one performer's portrayal, lacking any overall evaluation or recommendation about the show itself; openai: The text is a brief evaluation of a single performance, not a full review of the show.",
  "promptVersion": "5.2.0",
  "textQuality": "partial",
  "bwwScore": 6,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ]
}
