{
  "showId": "ill-eat-you-last-a-chat-with-sue-mengers-2013",
  "outletId": "bloomberg-news",
  "outlet": "Bloomberg News",
  "criticName": "Unknown",
  "url": "http://www.bloomberg.com/news/2013-04-25/midler-dishes-hollywood-in-i-ll-eat-you-last-review.html",
  "playbillVerdictUrl": "http://www.bloomberg.com/news/2013-04-25/midler-dishes-hollywood-in-i-ll-eat-you-last-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 254,
  "archivePath": "data/archives/reviews/ill-eat-you-last-a-chat-with-sue-mengers-2013/bloomberg-news--unknown_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:39:14.880Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_text"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Word count too low: 254 (min: 300)"
  ],
  "contentTier": "excerpt",
  "wordCount": 246,
  "tierReason": "Short text (246 words)",
  "rejectedAt": "2026-02-06T08:04:06.915Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This is website navigation, error messages, and legal boilerplate text, not a theater review.; openai: This text is a collection of navigation menus, links, and error messages, not a review.; gemini: This is not a review, but rather a collection of links, navigation menus, and legal disclaimers.; kimi: This is an error page with navigation menus and footer content, not a review. The text includes 'failed to render body of article' and consists of social media links, site navigation, and terms of service language.",
  "promptVersion": "5.2.0",
  "bwwExcerpt": "Those who come knowing Midler but not Mengers (who died in 2011) will be disappointed by this weightless valedictory, for there's no swan, and no song.",
  "showNotMentioned": true,
  "wrongFullText": "XLinkedInEmailLinkGiftFacebookXLinkedInEmailLinkGiftGift this articleContact us:Provide news feedback or report an errorConfidential tip?Send a tip to our reportersSite feedback:Take our SurveyNew Windowfailed to render body of articleBefore it's here, it's on the Bloomberg TerminalBloomberg Terminal LEARN MOREMore From BloombergChina Trader Who Made $3 Billion on Gold Bets Big Against Silver\n\nBrevan Howard's Bathwal Makes Billions in 18-Year Winning Streak\n\nAnthropic AI Tool Sparks Selloff From Software to Broader Market\n\nTata’s Outsider CEO Battles Multiple Crises After Bad Year\n\nAnthropic Releases New Model That’s Adept at Financial Research\n\nDivorce, Hedge-Fund Style: Inside the Breakup at Two Sigma\n\nby Hema Parmar and Chris Dolmetsch\n\nFor Colombia’s Richest Man, Maduro’s Ouster Means More Candy for Venezuela\n\nCardholders Are Mad at Bilt’s CEO. They’re Still Renewing\n\nCredit Market’s Reality Check Follows Decade of Loose Lending\n\nby Eliza Ronalds-Hannon and Silas Brown\n\nHomeBTV+Market DataOpinionAudioOriginalsMagazineEventsNewsMarketsEconomicsTechnologyPoliticsGreenCryptoAIWork & LifeWealthPursuitsBusinessweekCityLabSportsEqualityManagement & WorkMarket DataStocksCommoditiesRates & BondsCurrenciesFuturesSectorsEconomic CalendarExploreNewslettersExplainersPointed News QuizAlphadots GameThe Big TakeGraphicsSubmit a TipAbout UsTerms of ServiceDo Not Sell or Share My Personal InformationTrademarksPrivacy PolicyCareersAdvertiseAd ChoicesHelp©2026 Bloomberg L.P. All Rights Reserved.\n\nExplore live news and interviews, documentary features, reporter analysis and more, all in one place.\n\nBy accepting, you agree to our updated\n Terms of Service,\n including the arbitration provision and class action waiver. You understand that we process your information as described in the\n Privacy Policy,\n which may include sharing information about your use of\n Bloomberg.com\n with third parties. Accepting does not affect your right to opt-out at any time via the Do Not Sell or Share My Personal Information link in the website footer."
}