{
  "showId": "ill-eat-you-last-a-chat-with-sue-mengers-2013",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/i-ll-eat-you-last-review-bette-midler-is-back-1.5127889",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/i-ll-eat-you-last-review-bette-midler-is-back-1.5127889",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Bette Midler during dress rehearsal of \"I'll Eat You Last: A Chat with Sue Mengers\" written by John Logan & directed by Joe Mantello at Booth Theatre in Manhattan. (March 4, 2013) Credit: Richard Termine\n\nHow much fun is it to have Bette Midler curled up barefoot on a sofa on a Broadway stage, chatting at us for 90 minutes in a periwinkle blue caftan with silver sparkles to match her long fingernails?\n\nSo much fun that, even when the script doesn't scintillate as much as it intends to, a happy contentment seems to permeate the theater.\n\nBut first, we clarify. Midler is not here as her own branded divine self. In a platinum flip and enormous glasses, she is playing a different oversized personality and Hollywood power divinity, Sue Mengers, Hollywood's first woman superagent, who died at 79 in 2011.\n\nIn John Logan's solo play, \"I'll Eat You Last,\" Midler takes on her first Broadway role since she was a 1967 replacement Tzeitel in \"Fiddler on the Roof.\"\n\nFor a while, she seems almost as much Bette as Mengers. Before long, however, we stop expecting her to launch into one of her clam-on-a-half-shell extravaganzas and imagine we are there with Mengers for a fateful day in 1981 in what she calls \"my modest little hacienda in the hills of Beverly.\"\n\nAt least she calls it that in this fact-based fiction written by Logan, Tony-winning playwright of \"\"Red\" and screenwriter of \"Skyfall,\" and based on recollections by Mengers' friends. She also gossips about lots of her heavyweight '60s and '70s clients, many of whom have abandoned her by the time she is talking bawdy to us. She tries not to focus on the call expected to confirm that Barbra Streisand, her longtime client and friend, is firing her.\n\nThe phone, with its curly cord, is not the only thing old about the scene. Although we're interested in Mengers' rise from isolated German émigré to kingmaker, gossip about Ali MacGraw, Steve McQueen and Gene Hackman feels as ancient as her joke about '60s mass murderer Richard Speck.\n\nOn the other hand, there is Midler's Mengers, waiting to host a party with a joint in one hand, a cigarette in the other. Terrific director Joe Mantello frames her in a peach mansion where shadows of the pool she never uses appear on the ceiling. She misses old Hollywood, where \"we used to laugh more.\" Midler makes us miss it, too.\n\nWHAT \"I'll Eat You Last: A Chat With Sue Mengers\"\n\nWHERE Booth Theatre, 222 W. 45th St.\n\nINFO $82-$152; 212-239-6200; illeatyoulast.com\n\nBOTTOM LINE Delightful Bette, not always scintillating play\n\nWe're revamping our Comments section. Learn more and share your input.\n\nHilary Duff seeks new 'Lizzie McGuire' TV home on Hulu\n \n \n \n \n \n \n \n \n \n \n 'Twenties': BET series is sharply written, amusing\n \n \n \n \n \n \n \n \n \n \n 'Shark Tank's' Barbara Corcoran victim of phishing scheme\n \n \n \n \n \n \n \n \n \n \n LI's Lori Loughlin, husband's trial date set for October\n \n \n \n \n \n \n \n \n \n \n What's new in March on the streaming services\n \n \n \n \n \n \n \n \n \n \n 'The Office' is now a children's book\n \n \n \n \n Didn’t find what you were looking for?\n Try our new Search",
  "isFullReview": true,
  "textWordCount": 508,
  "archivePath": "data/archives/reviews/ill-eat-you-last-a-chat-with-sue-mengers-2013/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:31:40.947Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20200302170713",
  "archiveOrgUrl": "http://web.archive.org/web/20200302170713/https://www.newsday.com/entertainment/theater/i-ll-eat-you-last-review-bette-midler-is-back-1.5127889",
  "contentTier": "complete",
  "wordCount": 508,
  "tierReason": "Full review text"
}