{
  "showId": "ill-eat-you-last-a-chat-with-sue-mengers-2013",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://theater.nytimes.com/2013/04/25/theater/reviews/ill-eat-you-last-starring-bette-midler.html?pagewanted=all&_r=0",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "Tangy and funny as much of Mr. Logan's writing is, the play would hardly transmit the contact high it does without the presence of Ms. Midler. As a performer she shares certain qualities associated with her subject: an ability to make the crassest vulgarities sound like crystalline repartee, an earthy glamour and a preening, kittenish imperiousness that's somehow warmly endearing. It is hard to imagine any other actor imbuing the character with the same seductive effervescence - or giving a feel",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Bette-Midler-in-ILL-EAT-YOU-LAST--Updating-Live-20130424",
  "contentTier": "complete",
  "fullText": "https://www.nytimes.com/2013/04/25/theater/reviews/ill-eat-you-last-starring-bette-midler.htmlShare full articleAdvertisement\n\nChances are you are not a movie star. Chances are equally good that this state of affairs is not likely to change soon. But if you’ve ever wondered what it might be like to explore that golden realm where the gods and goddesses of the screen dwell, race over to the Booth Theater, where you can enjoy an audience with a woman who consorted almost exclusively with box office luminaries, or “twinklies” as she affectionately calls them.\n\nIn “I’ll Eat You Last,” a delectable soufflé of a solo show by John Logan that opened Wednesday night on Broadway, Bette Midler portrays the Hollywood agent Sue Mengers, who at the height of her reign in the 1970s could make a career merely by issuing an invitation to one of her A-list-only dinner parties. For a limited time, the tightly closed doors of the Beverly Hills aerie in which Mengers held court are being thrown open, and for the price of a ticket we all get to feel a little twinkly for a night.\n\nIt’s a heady sensation, thanks to the buoyant, witty writing of Mr. Logan (“Red”), the focused direction of Joe Mantello and above all to Ms. Midler, who gives the most lusciously entertaining performance of the Broadway season. Dropping names as if to the rhythm of a disco beat, snapping out wisecracks like acid-tipped darts that find the sweet spot every time, proffering profanity-laden advice about how to get ahead in show business: as the frank, brassy, foul-mouthed Mengers, who died in 2011, Ms. Midler cradles a spellbound audience in the palm of her hand from first joke to last toke. (Mengers’s love of celebrity was perhaps equaled only by her affection for marijuana.)\n\nOr rather she would so cradle us, if both hands were not otherwise engaged. As she welcomes us, Sue does not deign to rise from the pillow-bestrewn couch on which she sits, or rather slinks (“Forgive me for not getting up,” she says, unapologetically. “Think of me as that caterpillar from ‘Alice in Wonderland,’ the one with the hash pipe”), but her silver-taloned fingers are in continual motion: slicing the air to accentuate a point, fiddling with the white-blond tresses framing her face, adjusting her signature glasses — oversize circles that symbolize a lifelong obsession with stargazing — or grabbing another cigarette or a joint, if not both at the same time.\n\nWe have been invited into Sue’s private domain to provide a distraction from a dark cloud that has appeared on a formerly cloudless horizon, regarding matters both social and business — which for this woman are one and the same. (The year is 1981, as the décor by the designer Scott Pask tastefully whispers.) Sue is regaling us with tales from her well-stocked larder of Hollywood lore while she awaits a phone call from her great friend Barbra Streisand, who was also the biggest jewel in the crown of her client list — until just a few moments ago. The story of the Streisand defection will be told, but not until Sue has dished up great mountains of glittery Hollywood dirt. We learn how Sue finagled the female lead in “Chinatown” for Faye Dunaway. How Steve McQueen stole Ali MacGraw from the Paramount honcho Bob Evans, turning her into a high-class hausfrau and torpedoing her career. (Not a great loss to cinema history, perhaps, but as a fiercely loyal agent and friend, Sue resented it immensely.)\n\nWhen the phone rings and it’s Sissy Spacek calling, we learn how a good agent engages in the delicate art of client-poaching in the guise of offering maternal advice. “Let’s face it,” she says, acknowledging the ruthlessness that rules in Hollywood, “if no one’s trying to steal your clients, you’re doing something wrong.”\n\nAnd of course we are treated to the boilerplate life summary that’s de rigueur in bio-plays: How a young immigrant from Germany, burning with the shame of “always feeling outside looking in,” escaped into the movies, became obsessed (“That’s why I still talk like a gum-cracking Warner Brothers second lead”), quickly abandoned acting ambitions for a role behind the scenes, and climbed the Hollywood agenting ladder rung by rung until she became one of the first women to reach the top in a male-dominated world.\n\nTangy and funny as much of Mr. Logan’s writing is, the play would hardly transmit the contact high it does without the presence of Ms. Midler. As a performer she shares certain qualities associated with her subject: an ability to make the crassest vulgarities sound like crystalline repartee, an earthy glamour and a preening, kittenish imperiousness that’s somehow warmly endearing. It is hard to imagine any other actor imbuing the character with the same seductive effervescence — or giving a feeling of perpetual motion to a 90-minute monologue without even standing up. (Dressed in a shapely blue tent adorned with silvery spangles designed by Ann Roth, Ms. Midler looks smashing enough to single-handedly revive the muumuu.)\n\nWe learn early that Sue has little interest in politics or the wider world of culture (she acidly describes Vanessa Redgrave “downing glass after glass of my best Veuve Clicquot like a good socialist”), and Mr. Logan does not force-feed us pathos involving the diminution of her power in Hollywood. In one of the play’s few darker passages Sue laments the rise of the bottom-line-oriented, more technocratic agencies like Creative Artists Agency. The aesthetic ferment of Hollywood during the 1970s may have been due in part to the Mengers style of mixing pleasure and business, but it could be argued, too, that the inflation of star salaries that she stoked helped usher in the Hollywood of the 1980s and beyond.In any case, the exuberantly shallow Sue we meet in “I’ll Eat You Last” would bridle at any attempt to analyze her legacy. “I’ve seen the future, and, kids, it’s not a lot of laughs,” she says at one point, and that’s about as close as she comes to making grand statements on the changing Hollywood culture.\n\nAs the shadows of evening begin to gather, and she begins to slouch deeper into the pillows, as if seeking to become one with her couch, Ms. Midler subtly conveys that Sue has begun to feel the soft sting of her feisty heedlessness beginning to bite back. As she dismisses us to prepare for her dinner — minus a star who called to cancel at the last minute, ominously — we sense that her need for the sweet release of a joint (or two or three) is perhaps more urgent than usual because she can see the credits beginning to roll on her glory years. Sue has learned that if you seek out the pleasures of living in intimate proximity to the hot glare of movie fame, eventually you’re going to get burned.",
  "isFullReview": true,
  "textWordCount": 1139,
  "archivePath": "data/archives/reviews/ill-eat-you-last-a-chat-with-sue-mengers-2013/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:39:14.095Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "wordCount": 1139,
  "tierReason": "Full review text"
}