{
  "showId": "ill-eat-you-last-a-chat-with-sue-mengers-2013",
  "outletId": "vulturecom",
  "outlet": "Vulture.com",
  "criticName": "Jesse Green",
  "url": "http://www.vulture.com/2013/04/theater-review-ill-eat-you-last.html",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "playbill-verdict"
  ],
  "bwwExcerpt": "Which, despite the expert attention of director Joe Mantello, is what I'll Eat You Last would do without Midler. She isn't delivering an impersonation or even exactly acting a role; she's running the Mengers prototype through her own sensibility and seeing what comes out.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Bette-Midler-in-ILL-EAT-YOU-LAST--Updating-Live-20130424",
  "contentTier": "complete",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nBette Midler in I’ll Eat You Last: A Chat With Sue Mengers.\n Photo: Richard Termine\n \n \n \n There was a time in my life when I’d gladly have watched Bette Midler sit on a sofa as she waited for the phone to ring. Her talent, while prodigious, was only part of the reason. Of course I admired her joyful voice, her earthy humor, her rimshot timing, but it was the spectacular warmth of the woman, and her outsider nerve, that made her so completely compelling.\n\nThat time in my life began around 1972 with her debut album, The Divine Miss M, and ended — well, it hasn’t ended. (I even liked her blink of a sitcom in 2000.) For here she is, sitting on a sofa, albeit on Broadway, not in fact doing much more than waiting for the phone. And I’m still glad I’ve had the opportunity to watch.\n\nNot that I wouldn’t have preferred a better occasion for our visit than John Logan’s I’ll Eat You Last: A Chat with Sue Mengers. The 85-minute monologue, in which Midler portrays one of Hollywood’s most successful talent agents, is an event without quite being a play. Midler just sits in a blue chiffon caftan in a glassy Beverly Hills mansion (you can almost feel the air conditioning on Scott Pask’s set) telling stories half-familiar from Vanity Fair. And while Mengers’ life and work raise plenty of interesting questions about the oilers of the dream machine, I’ll Eat You Last only glancingly addresses them. Rather, it’s content to string some of Mengers’ tell-it-like-it-is pearls of nastiness on a gappy necklace for display in a vitrine. “Elton’s the easiest dinner guest ever,” she says in a typical gambit. “He’ll eat anything but pussy.”\n\nMidler probably makes as good a case as can be made for this vulgar and fun-loving if deeply unpleasant woman, whom even the vile Robert Evans called “Mengele.” And Logan, the author of the Rothko bioplay Red, tries too. He dutifully gives you her difficult youth — the escape from Hitler, her father’s suicide — but since they’re just anecdotes like the one about John (or Faye Dunaway, or Ali MacGraw, ad infinitum) they don’t come to much. The only one that sticks is the one Midler actually gets to enact: the story of how she struggled to learn English, mostly from movies, until she could pronounce her name like an American. “That’s why I still talk like a gum-cracking Warner Bros. second lead,” she says.\n\nSomewhere through the downpour of dropping names you can sense Logan’s intention to use Mengers to address the corrosive effects of Hollywood agentry. But do we really care how hard it is to make a living as a Sherpa on the slopes of power? We might if it weren’t all business. And, to be fair, Mengers’s relationship with Barbra Streisand, who is in the process of firing her as the play begins, suggests the distorted kind of mutual dependency that passes for love in Hollywood and might justify the title. (Midler does a devastating Streisand.) But the surgeon general’s warning that’s displayed on the show curtain — “This play contains profanity, smoking, alcohol consumption, drug use, and gossip” — advertises an argument the text fails to pursue. Is dish dangerous? Is celebrity toxic? If so, you wouldn’t know it from Mengers. “I love gossip, don’t you?” she says. “’Tis like mother’s milk to me, and it’s the lube by which this town slips it in. Whole place would grind to a slow, agonizing dry hump without gossip.”\n\nWhich, despite the expert attention of director Joe Mantello, is what I’ll Eat You Last would do without Midler. She isn’t delivering an impersonation or even exactly acting a role; she’s running the Mengers prototype through her own sensibility and seeing what comes out. (Often what comes out are Midler’s familiar pressurized consonants and taffy vowels.) But that’s good enough, because the two Miss M’s have enough in common, including the outsider’s genius for self-invention: “You want to be a thing,” Mengers says, “make yourself that thing.” Midler couldn’t bite harder into that line if she were doing her Sophie Tucker. The difference is that when she says it, it’s with the satisfaction of someone who, unlike Mengers, apparently knew what to make.\n\nI’ll Eat You Last: A Chat with Sue Mengers is at the Booth Theater through June 30.\n\nShow \n \n \n Comment\n \n\n Theater Review: I’ll Eat You Last\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 780,
  "archivePath": "data/archives/reviews/ill-eat-you-last-a-chat-with-sue-mengers-2013/vulturecom--jesse-green_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:44:12.630Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "Request failed with status code 503"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "wordCount": 780,
  "tierReason": "Full review text"
}