{
  "showId": "redwood-2025",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Redwood/1276",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Redwood/1276",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nCititour.com Review\n Neither a giant success nor a giant flop, the new musical “Redwood,” now at the Nederlander Theatre, is more like a giant wasted opportunity for its star (and co-conceiver) Idina Menzel. Still, I suspect Menzel’s ardent fans will be happy enough just to see her back on a Broadway stage after a decade’s absence. For nearly two hours, the Tony Award-winning icon -- surrounded by a superlative supporting cast of four – gets to frequently show off her still-breathtaking belt to tremendous effect.\r\n\r\nUnfortunately, it’s too often in the service of a generic pop-sounding, lyrically banal score by musical theatre newcomer Kate Diaz, with too many songs that simply reinforce emotions that have already been expressed and do little to advance the barely-there plot. Indeed, no matter how strikingly songs like “Great Escape” or “No Repair” are performed, there’s no number here like “Defying Gravity” or “Over the Moon” that Menzel’s admirers will want to hear for years (or decades) to come. \r\n\r\nFurther, librettist and director Tina Landau’s frustrating, oddly structured book basically dares us to sympathize with Menzel’s self-absorbed, self-pitying character, New York City gallerist Jesse. Instead, the show asks Menzel to rely far too hard on her naturally winning nature to keep us even vaguely on her character’s side by refusing to tell us Jesse’s whole story until it’s almost too little, too late. \r\n\r\nWithout warning, Jesse has abandoned her wife of 20 years, photojournalist Mel (an excellent De’Adre Aziza) and driven – somewhat aimlessly – to the Redwood Forest in Eureka, California. (Like E.T, Jesse really needs to call home!) To help explain this drastic action, Landau gives us bits and pieces of the couple’s backstory – primarily, their ultimately troubled relationship with Jesse’s son Spencer (the fine Zachary Noah Piser) – but it’s often like looking at an underexposed photograph. (In fact, Aziza does get one of the show’s finer and quieter songs, “Through the Lens.”)\r\n\r\nMeanwhile, in California, Jesse unexpectedly finds refuge – literally and figuratively -- in the peaceful forest (brought to spectacular life by scenic designer Jason Ardizzone-West and video designer Hana S. Kim, whose mind-blowing projections deserve a special Tony Award.) While there, she ends up “befriending” two local scientists: the kindly, almost avuncular Finn (an always excellent Michael Park) and the rather strident Becca (an extraordinary Khaila Wilcoxon). \r\n\r\nBut the conflict among these characters is decidedly lower-case. It might have been infinitely more interesting if there was some sexual attraction between the heavily bearded, somewhat grizzled Finn and Jesse to give more dimension to their unexpected connection; meanwhile, Becca’s by-the-book personality is ultimately no less than annoying than Jesse’s self-entitlement until it softens slightly.\r\n\r\nUnsurprisingly, Landau eventually creates a scenario that literally threatens Jesse’s life, but you can feel pretty sure she’ll emerge unscathed. In fact, she’s ultimately reborn! Still, one wishes Landau hadn’t waited until this do-or-die moment to fully explore Jesse’s personal dilemma (and to some extent, Mel’s and Spencer’s as well). It’s a rather severe miscalculation on Landau’s part, who sees the forest, but really needs to visualize more trees.\n By Brian Scott Lipton\n\nVisit the Sitehttps://www.redwoodmusical.com/Open/Close DatesOpening 2/13/2025Closing 8/17/2025\nTheatre Info\nNederlander Theatre208 West 41st StreetNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 577,
  "archivePath": "data/archives/reviews/redwood-2025/cititour--brian-scott-lipton_2026-02-01.html",
  "textFetchedAt": "2026-02-01T23:56:39.101Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee auth failed: Monthly API calls limit reached: 250000"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}