{
  "showId": "redwood-2025",
  "outletId": "josh-at-the-movies-joshua-m-hayes",
  "outlet": "Josh at the Movies (Joshua M. Hayes)",
  "criticName": "Unknown",
  "url": "https://joshatthemovies.com/2025/02/13/theater-review-redwood/",
  "playbillVerdictUrl": "https://joshatthemovies.com/2025/02/13/theater-review-redwood/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "Based strictly on the pure performative power of Broadway megastar Idina Menzel, dark dramedy Redwood feels like the ultimate conundrum. It is a high budget spectacle with low budget indie roots, overcomplicating complex subject matter and ultimately botching the delivery of its absolutely beautiful message. Yet, despite being messy, the beauty peeks out just beyond the trunk of a massive redwood tree. The raw power of a late moment—one in which we finally reveal the true trauma at the heart of the show—left me with tears streaming down my face. As is, the second half evolves into a much stronger musical than the first. Worth a ticket just for Menzel truly in her element, Redwood is a mixed bag with occasional moments of poetic brilliance. When taking a seat in the Nederlander Theatre—notably, the same auditorium where Menzel made her Broadway debut in Rent circa 1996—we are greeted to a seemingly blank space. Sprawling, gigantic blank screens spread out in every direction, immersing one’s entire field of view in an IMAX kind of way. In a most rare suggestion, I would recommend seeing Redwood from the mezzanine for maximum enjoyment, considering the majority takes place in the heights of the redwood tree. When showtime comes, virtually without warning, we are plunged into darkness. Then, Menzel’s soaring vocal quickly sweeps in for a somewhat jarring, contemplative opening number, “Drive.” Personally, I found beginning the show in this manner to be a bit abrasive, filling the number with flashes of memory and visual overstimulation. In retrospect, it does introduce many prevalent themes early on. The first thirty minutes or so of Redwood felt pretty rough around the edges to me, racing to get Jesse (Menzel) where she needs to be in order for the story to progress. Along the way, it establishes quite a few things about the central five-person cast. For one, Jesse’s family of three has been splintered by the untimely death of her twenty-three-year-old son, Spencer (Zachary Noah Piser), whom she sees as every man she comes across. Not even attempting therapy with her wife, Mel (De’Adre Aziza), can help to mend the horrible grief of losing their only child. This opening stretch races through time, revisiting key moments that show Jesse fleeing from her grief as quickly as her legs will carry her. Our first introduction to the immersive screens gives little warning as to potential motion sickness, but soon the rain effects and racing greenery plant Jesse deep within the woods. Two climbers discover a disheveled Jesse amongst the trees. Unbeknownst to Jesse, she has ended up on private property; the two canopy botanists set to take samples at the top of a sprawling redwood tree urge Jesse to leave and head back home. This duo displays polar opposite personality traits. Finn (Michael Park) waxes philosophical about the heartwood of trees; Becca (Khaila Wilcoxon) takes a more no-bullshit approach, taking the work seriously and wanting to get straight into the thick of things. Finn and Becca in essence end up therapizing Jesse. Finn sings about “Big Tree Religion” while sharing some tragedy in his past, and Becca offers up details about how a tree grows, realized in a tiny shadow that gradually grows larger and larger. As the days pass and Jesse observes the climbers, she longs to be involved. She dodges calls from her angry wife, gets plagued by memories from her past, and argues with the living embodiment of her cell phone. Some of this was a bit head-scratching, while other moments are baked in with an inherent beauty to them. For a one hour and forty-five minute musical with no intermission, Redwood takes a bit too long getting Menzel in climbing equipment to scale the redwood tree. However, eventually, climbing tree acrobatics and sweeping moments of immersion make the case for the namesake redwood of the title. On a platform deep in the tree alone, Jesse learns everything she can to be a climbing equal to Finn and Becca. Her sanity begins to crack high up enough that she cannot escape any of it. Unmistakably, the parts that work best are the ones where Jesse embraces her past, making the setup of her brushing them aside to be particularly frustrating. Menzel tries hard, but she cannot sell some of the sillier, pun-heavy dialogue. Once we finally arrive at the heartbreaking center of this story, Redwood delivers a show-stopping, incredibly sad monologue of grief that transforms into an equally tragic song: “No Repair.” One last song that I really loved deals with the same themes, and helps to bring the narrative full circle in the best way it can. Mainly delivered in booming Broadway vocals by relative newcomer Zachary Noah Piser, “Still” left multiple people in my performance of the show in tears. There are many flaws to be found within the structure Redwood unfolds, not least of which is the fact that we do not get enough meaningful interaction between Mel and Jesse, or Mel, Jesse, and Spencer as a unit. By splitting the time up between this trio and the climbers, it almost spreads them all too thin, except for Jesse. The attempts to give Mel a story of her own shift the point of view, and frankly do not work, as they cut into the progression of Jesse’s recovery. Swishes of repeating dialogue and memory cracks can come across comical rather than as intended. Still, I have to admire a strong message and a big swing. Redwood contains both of these elements, running a parallel as the roots of trees in connecting us all to the heart and soul of those we love. The set is creative, containing the giant screens but also a huge recreated piece of redwood tree. Idina Menzel, who was heavily involved in the crafting of this production from top to bottom, gives her best to every second of Jesse’s tale. Redwood is worth seeing simply for the strength of Menzel’s vision—though the ensemble definitely each get their time to shine, they never feel fully fulfilled. Only Menzel and to an extent Piser have been given enough material. Serving as Idina Menzel’s grand return to Broadway, Redwood should prove a mostly satisfying take on healing and forgiveness. Redwood unveils its heartwood at the Nederlander Theater, now playing daily performances except Mondays.",
  "isFullReview": true,
  "textWordCount": 1053,
  "archivePath": "data/archives/reviews/redwood-2025/josh-at-the-movies-joshua-m-hayes--unknown_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:15:32.105Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}