{
  "showId": "motown-the-musical-2016",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "https://newyorktheater.me/2016/07/21/motown-the-musical-review-back-on-broadway/",
  "publishDate": null,
  "fullText": "When “Motown the Musical” opened on Broadway in 2013, I fell for the show, because of the exciting performances by a cast impersonating many of the stars of Motown Records – Diana Ross and the Supremes, the Jackson 5, Marvin Gaye, Smokey Robinson, Stevie Wonder…more than a dozen acts in all. I forgave the chutzpah of Motown Records founder Berry Gordy Jr., who co-wrote and produced the clunky, self-serving story that framed the music, which focused on the rise of the wise and powerful Berry Gordy Jr. The show wound up being the hit I had predicted, and when it closed just 18 months ago, it promised to return to Broadway. And so it has, for a limited engagement of 18 weeks. This time around, I didn’t fall. Update: The producers have announced (on opening night!) that “Motown” will close early; its final performance will be July 31 (not November.) Yes, the musical numbers are still entertaining, thanks (as I noted three years ago) to the adept musical arrangements by Ethan Popp, expert sound design by Peter Hylenski, choreography by Patricia Wilcox and Warren Adams that offers the signature Motown moves mixed in with some exhilarating dancing that is more free-form and contemporary. ESosa’s flashy and elegant costumes still number in the hundreds. A clue to the difference between the original Broadway production and the new one occurred at the curtain call, when Chester Gregory, the actor portraying Berry Gordy Jr. this time around, shouted out “Hey, New York City!” That is the sort of thing a touring company does – call out the name of the city where they are performing that night. And indeed, the cast now at Broadway’s Nederlander Theater is part of a production that has been touring the country since 2014. Most everything about this production is more….efficient….than the original one on Broadway. The cast has been reduced in size; sets have been simplified; scenes have been trimmed or excised – we no longer see Gordy working as a mechanic in an auto repair shop, for example, one of the several jobs he had (including boxer, failed record store owner, cookware salesman and songwriter) before he borrowed $800 from his family to create a record company that he sold some three decades later for $61 million. Unfortunately, the efficiency seems to extend to the performances as well. I don’t doubt that the new cast is talented, but the moments that won me over the first time around – the Jackie Wilson character shimmying through “Reet Petite,” the Marvin Gaye character singing “What’s Going On,” and especially Diana Ross doing her first solo apart from the Supremes, “Reach Out and Touch” – just didn’t have the same impact this time. The only clear standout now is Leon Outlaw Jr. as young Michael Jackson. The cast members make all the right moves, their voices are in fine form, but there surely needs to be some extra, indefinable spark to stand out in a show that is jam-packed with some 60 songs — most shortened versions or mere snippets of the original. Maybe they’ve just been on the road too long. Book by Berry Gordy, music and lyrics by “The Legendary Motown Catalog” Based upon the book “To Be Loved: The Music, The Magic, The Memories of Motown” by Berry Gordy. (“script consultants” David Goldsmith and Dick Scanlan.) Charles Randolph-Wright (Direction) Warren Adams and Patricia Wilcox (Choreography) David Korins (Scenic Design) ESosa (Costume Design) Natasha Katz (Lighting Design) Peter Hylenski (Sound Design) Daniel Brodie (Projection Design) Ethan Popp (Musical Supervision, Arrangements and Orchestrations) Bryan Crook (Co-Orchestrations and Additional Arrangements) Zane Mark (Dance Arrangements) Joseph Joubert (Musical Direction) Cast: Chester Gregory as Berry Gordy, Allison Semmes as Diana Ross, Jesse Nager as Smokey Robinson, Jarran Muse as Marvin Gaye, and J.J. Batteast and Leon Outlaw, Jr. as Young Berry Gordy/Stevie Wonder/Michael Jackson Running time: 2 hours and 45 minutes, including an intermission Motown was scheduled to run through November 13, 2016, but now will end July 31. Can You Be Michael Jackson of the Jackson 5? Berry Gordy wants you for Motown MusicalJuly 17, 2012In \"Broadway\" Motown The Musical Review. Jackson 5, Diana Ross, Marvin Gaye Brought to BroadwayApril 14, 2013In \"Broadway\" Diana Ross and Boss Berry Gordy: Valisia LeKae and Brandon Victor Dixon of Motown The MusicalMay 4, 2013In \"Broadway\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "“Most everything about this production is more….efficient….than the original one on Broadway. The cast has been reduced in size; sets have been simplified; scenes have been trimmed or excised...Unfortunately, the efficiency seems to extend to the performances as well...The cast members make all the right moves, their voices are in fine form, but there surely needs to be some extra, indefinable spark to stand out...Maybe they’ve just been on the road too long.”\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 722,
  "archivePath": "data/archives/reviews/motown-the-musical-2016/nyt-theater--jonathan-mandell_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:36:17.236Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 722,
  "tierReason": "Full review text",
  "wrongShow": true,
  "wrongShowReason": "Cross-show URL collision: review belongs to motown-the-musical-2013 (publishDate April 15, 2013 is 1 days from motown-the-musical-2013 opening (2013-04-14))"
}
