{
  "showId": "a-little-night-music-2009",
  "outletId": "nypost",
  "outlet": "NY Post",
  "criticName": "Elisabeth Vincentelli",
  "url": "http://www.nypost.com/p/entertainment/theater/send_in_the_substitutes_UyJILYURqUn7QMH2irKjAK",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "With everybody firing on all cylinders, Nunn's spare, twilit staging finally makes sense, and even the smallness of the orchestra feels appropriate. This is about presenting Sondheim's sorry-grateful, regretful-happy take on love, sex and marriage without pretenses or adornments -- but with plenty of style and wit. How adult!",
  "bwwScore": 9,
  "contentTier": "complete",
  "fullText": "CHARLESTON, W.Va. — West Virginia's treasurer has a check waiting...\n\nCHARLESTON, W.Va. — West Virginia's treasurer has a check waiting for Matt...\n\nTHE HAGUE, Netherlands — Actress Sylvia Kristel, the Dutch star of the hit...\n\nA new exhibition is hailing the fashion sense of Katharine Hepburn, whose...\n\nAuthorities are looking for whoever is responsible for shooting blow darts...\n\n\"mob Wives\" star Renee Graziano was admitted to rehab on Monday,...\n\n\"mob Wives\" star Renee Graziano was admitted to rehab on Monday, Page Six...\n\nScott Disick has cut ties with Meatpacking District restaurant RYU. The...\n\nDemi Moore grabbed a late dinner at downtown hot spot Ken & Cook on...\n\nR&B singer/producer Ne-Yo celebrated turning 30 this week at several...\n\nDETROIT -- Ninety-five wins, an AL East title and an ALDS...\n\nDETROIT -- Ninety-five wins, an AL East title and an ALDS victory never...\n\nDETROIT – There is only wreckage now, the detritus of having every weakness...\n\nThe New Antonio Cromartie doesn't call Tom Brady an A-hole. \"He's a...\n\nDavid Carr never has seen it before and never has noticed anyone else do it...\n\nTo call Ben Lewin's inspiring and Oscar-baiting \"The Sessions'' a cross...\n\nBy the age of 7, Glenn Nocera already identified as a Republican. And...\n\nJust because you're a filmmaking genius doesn't mean you're not a freaky...\n\nThere is still activity, I regret to report, and none of it is of the...\n\nA LITTLE NIGHT MUSIC Walter Kerr Theatre, 219 W. 48th St.; 212-239-6200.\n\nBy stepping into the revival of Stephen Sondheim's \"A Little Night Music,\" Berna dette Peters and Elaine Stritch are doing more than merely replacing Catherine Zeta-Jones and Angela Lansbury, respectively. They -- especially Peters -- have transformed the entire show. Trevor Nunn's production felt murky and undernourished when it opened back in December. Now, a coherent whole has emerged.\n\nIf Mrs. Michael Douglas won a Tony for her one-note performance as charismatic theater actress Desirée Armfeldt, you've got to wonder what Peters should get. A Medal of Honor? The Nobel Prize?\n\nPeters creates a multifaceted woman strong enough to anchor Sondheim's bittersweet comedy about romantic entanglements. She is the axle around which the show rotates, and her presence is felt even when she isn't onstage.\n\nOf course, this Desirée remains the seductive, playful stage star she's meant to be. But she isn't young anymore, and is fully aware of the passage of time.\n\nBeing reunited with her old lover Fredrik Egerman (Alexander Hanson) prompts an avalanche of mixed emotions. It's a rare pleasure to watch them all flicker on Peters' face, to catch a sudden melancholy briefly cloud her gaze even as she unleashes her plentiful charms on her conquests.\n\nAnd her \"Send in the Clowns\" is one for the books, a masterpiece of interpretative finesse that should be retitled \"Send in the Handkerchiefs.\"\n\nLansbury was the best thing in the December cast, so the new Madame Armfeldt doesn't have the same radical impact as the new Desirée. Still, Stritch is a hoot to watch, as always. She spits out her bon mots with acidic relish and turns \"Liaisons\" into a mesmerizingly bizarre experience halfway between storytelling and performance art.\n\nLike a rising tide lifting all boats, the newcomers have inspired the original cast to raise its game. Hanson, in particular, looks a lot more relaxed and isn't afraid to sound menacingly wolfish in \"Now,\" while Erin Davie nails Charlotte's sarcastic disenchantment.\n\nWith everybody firing on all cylinders, Nunn's spare, twilit staging finally makes sense, and even the smallness of the orchestra feels appropriate. This is about presenting Sondheim's sorry-grateful, regretful-happy take on love, sex and marriage without pretenses or adornments -- but with plenty of style and wit. How adult!\n\nelisabeth.vincentelli@nypost.com\n\nBy clicking 'SIGN-UP' you agree to our Terms of Use & Privacy Policy\n\nNEW YORK POST is a registered trademark of NYP Holdings, Inc.\n\nnypost.com, nypostonline.com, and newyorkpost.com are trademarks of NYP Holdings, Inc.\n\n©",
  "isFullReview": true,
  "textWordCount": 651,
  "archivePath": "data/archives/reviews/a-little-night-music-2009/nypost--elisabeth-vincentelli_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:40:42.180Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20121019061616",
  "archiveOrgUrl": "http://web.archive.org/web/20121019061616/http://www.nypost.com/p/entertainment/theater/send_in_the_substitutes_UyJILYURqUn7QMH2irKjAK",
  "wordCount": 651,
  "tierReason": "Full review text"
}