{
  "showId": "a-little-night-music-2009",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2009/legit/reviews/a-little-night-music-1200475836/",
  "publishDate": "December 14, 2009",
  "fullText": "Quietly comical, quietly lyrical and quietly tedious.\n\nThe nocturnal nonadventures of a disenchanted Madrid homemaker are the subject of the quietly comical, quietly lyrical and quietly tedious “Woman Without Piano.” But despite sophomore helmer Javier Rebollo’s decision to overextend practically every scene, the talent of Carmen Machi (as the pic’s sole-focus protag) and some superior mood-making bring enough interest to see the pic through its longueurs. Helmer’s self-conscious bid for auteurdom will attract and alienate in equal measure, but his daring brought him the best director nod at San Sebastian. “Piano” will likely have its ivories tickled at selected Euro fests.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Tyler, the Creator and Rosé to Perform at 2026 Grammy Awards \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Kendrick Lamar Makes Grammys History as Most-Awarded Rapper, Breaking Jay-Z's Record\n\nRosa (Carmen Machi), married to a taxi driver (Pep Ricart), suffers from tinnitus, which makes her already bleak life even less enjoyable. We follow her through what is presumably a normal day: She cooks food, makes a trip to the post office, earns a few euros shaving the hair off the legs of a neighbor, and half-heartedly attempts to masturbate but is interrupted by an unwanted call from a salesperson.\n\nBut at night, when her husband is asleep, Rosa dons a vampish black wig, picks up a suitcase and heads for the bus station to escape. Her attempts to buy a ticket frustrated — the dehumanizing effect of bureaucracy is one satirical target — she falls in with simpleminded Polish immigrant Radek (Jan Budar), whom she sees has escaped from custody. Soon after, Radek collapses in the street from a seizure and she takes him to a hotel and nurses him back to health.\n\nMachi (who appeared as a corrupt right-wing politico in Pedro Almodovar’s “Broken Embraces”) is best known in Spain as a sitcom star. Here, she compellingly plays against type, principally by keeping her mouth shut and letting her face and body do the work, as though the spirit of Buster Keaton had been transplanted into the body of a middle-aged Spanish housewife.\n\nThat this is a deeply human tale about a woman who hasn’t lost hope — communicated through the birdlike brightness of Rosa’s gaze, staring out from otherwise show-nothing features — is often buried under the overwhelmingly artificial, carefully manufactured style. The oh-so-long shots (of, for example, a boiling egg), the unusual camera angles and the lack of dialogue are all calculated to support the sense of alienation that hangs over Carmen, but it also mostly keeps her at an emotional remove.\n\nThe comedy is gently absurdist but rarely funny, provoking a wry smile at best. However, the helmer is also capable of brief, intense moments of poetry, as when Rosa enters an empty room and piano music is heard. It may be Rosa playing, or it may not, and the ambiguity is deliciously suggestive.\n\nSymbolism is sometimes clumsily deja vu, as when the script contrasts the passion and danger of a picture on Rosa’s wall with the weary passivity of her existence.\n\nSound work is superbly synched to Rosa’s ear troubles, the clocks in the house ticking loudly all the time to emphasize that time is running out on her impoverished life. Pic is set on a day in 2003 that has become iconic for left-wing Spaniards, but this reference will mean little to non-Spanish auds. The beautifully judged final seconds also are worthy of mention.",
  "isFullReview": true,
  "dtliExcerpt": "With Catherine Zeta-Jones making her Broadway debut and Angela Lansbury returning to the musical stage after 23 years, this sumptuous revival of Stephen Sondheim's 'A Little Night Music' has marquee appeal to burn.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "With Catherine Zeta-Jones making her Broadway debut and Angela Lansbury returning to the musical stage after 23 years, this sumptuous revival of Stephen Sondheim's 'A Little Night Music' has marquee appeal to burn.",
  "contentTier": "complete",
  "contentTierReason": "Short text (33 words)",
  "textWordCount": 566,
  "archivePath": "data/archives/reviews/a-little-night-music-2009/variety--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T07:51:51.144Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "wordCount": 566,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-03T11:19:27.359Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a film review of 'Woman Without Piano', not a Broadway theater review; openai: The text is a review of the film 'Woman Without Piano,' not a Broadway show.; gemini: This is a review of the film \"Woman Without Piano\", not a Broadway show.; kimi: This is a film review of the Spanish movie 'Woman Without Piano' (La mujer sin piano), not a Broadway theater review. The text references film festivals (San Sebastian), cinematography ('pic', 'helmer'), and compares the actress to film roles in Pedro Almodovar movies.",
  "promptVersion": "5.2.0"
}
