{
  "showId": "between-riverside-and-crazy-2022",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/2022/12/theater-review-between-riverside-and-crazy-on-broadway.html",
  "publishDate": "December 19, 2022",
  "fullText": "Things you buy through our links may earn New York a commission.\n\nThe play is built around Henderson’s character, Walter, an aging, valiantly crotchety former police officer who is clinging to his grand rent-controlled apartment on Riverside Drive, for which he currently pays $1,500 a month. (If deregulated, it’d fetch ten times that.) The rotating set, by Walt Spangler, gives us a glimpse of the various principalities of this decaying kingdom: chipping paint in the immense kitchen, a grand chandelier in the untidy living room, and a bedroom big enough to fit a king bed. The place is currently occupied by Walter and his ex-con son, Junior (played by Common); his friend in recovery, Oswaldo (Victor Almanzar); and Junior’s spacey girlfriend, Lulu (Rosal Colon). As they make their way through breakfast at the top of the show, Walter snipes at everyone from his deceased wife’s old wheelchair. “It’s comfortable seating!” he grumbles at Junior.\n\nThere are shades of a very New York King Lear to the setup — which of you shall we say doth love my lease best? — though once the plot clicks into motion, it leads away from that in both grim and hilarious directions. Guirgis is a dramatist singularly attuned to the city’s rhythms of dialogue, topics of conversation, and petty envies. He won a Pulitzer for Riverside and Crazy in 2015, and though it’s now technically a period piece (set in 2014), the play still feels written in this moment, with its passing references to Trump and Giuliani (“fuckin’ Giuliani,” grumbles Walter) and its cutting depiction of the cops. Walter secured the apartment during his service in the NYPD and is involved in an extended lawsuit against the department after a shooting, the details of which Guirgis slowly and carefully parcels out, egging you to assume one thing and then pulling out the rug. Early on, his ex-partner (Elizabeth Canavan) and her fiancé (Michael Rispoli) show up for a convivial dinner that takes a turn, right after that Giuliani-bashing, as they start to press him to drop the suit. He’s been a true believer in the system — “Married your mother. Joined the police. Paid taxes. Bought insurance. Got a Riverside Drive apartment. Had you. Put down firm roots,” as he puts it to Junior — and now the system is turning against him. He keeps clinging to his credentials, not realizing they’ve crumbled to dust. He announces grandly at one point that he’s a “flesh-and-blood, pee-standing-up, registered Republican,” right before staggering and collapsing.\n\nThat may sound like a downer of an evening, but Guirgis’s play is speckled with his customary wry humor and genuine strangeness that lifts it from straight issue drama into something lovelier and weirder. Often, there’s just the delight of the dialogue. Lulu is purportedly studying to be an accountant, but as Walter notes, “her lips move when she read the horoscope — that ain’t the mark of a future accountant!” The play sometimes seems like it’s heading toward one possible conclusion, but then Guirgis ducks away from the obvious. In the second act, Walter has an encounter with a lady from his church (played by Liza Colón-Zayas, another routinely excellent performer who deserves a bigger platform) that veers into possibly dreamlike absurdity. That scene and its heightened aftermath may be hard to swallow, but it’s performed with such conviction that I was fully along for the ride. There’s a sense that the strictures of New York life are so wild on their own — from the real-estate laws on down — that the only possible recourse is to embrace the crazy yourself. In a maddening time, go a little mad.\n\nHenderson and the rest of the cast aside from Common were in the original run of Riverside and Crazy Off Broadway back in 2014, also directed by Austin Pendleton, and the play comes to Broadway nearly a decade later with much of its fire still intact. As Junior, and making his Broadway debut, Common can’t match the lived-in quality that his castmates bring to their performances, but he has a fittingly internal take on the character, bringing the feeling of someone who has turned inward to survive his father’s overscale presence. The play wobbles when it’s just Junior alone with Lulu, the two of them caught up in predictable lover’s quarrels, and more generally when Walter himself isn’t onstage. He’s completely the main attraction, a character and a performance that draws every eye in the Hayes Theater. Henderson’s Walter belongs on Broadway, and it’s a pity it took this long for the production to transfer. He’s this sputtering, bellyaching tragic monarch of contemporary New York — a place where even royalty can still be evicted.\n\nBetween Riverside and Crazy is at the Helen Hayes Theater.\n\n+Comments\n \n \n Leave a Comment\n \n\n King Lear, But Rent Controlled: Between Riverside and Crazy\n\n \n\n \n \n\n \n\n Things you buy through our links may earn New York a commission.\n\nEditor’s Picks\n \n \n \n \n \n \n \n \n early and often\n \n Did the January 6 Committee Finish Trump?\n Did the January 6 Committee Finish Trump?\n \n \n \n \n \n \n \n \n \n \n urban fauna\n \n Los Angeles’s Celebrity Mountain Lion Was Also Its Hostage\n Los Angeles’s Celebrity Mountain Lion Was Also Its Hostage\n \n \n \n \n \n \n \n \n \n \n the year of the nepo baby\n \n How a Nepo Baby Is Born\n How a Nepo Baby Is Born\n \n \n \n \n \n\n \n\n \n \n \n \n Most Popular\n \n\n \n \n \n \n How a Nepo Baby Is Born\n \n \n \n \n \n \n An All But Definitive Guide to the Hollywood Nepo-Verse\n \n \n \n \n \n \n Which Nepo Baby Said It?\n \n \n \n \n \n \n Drake’s $1 Million World Cup Bet Is His Loss\n \n \n \n \n \n \n Saturday Night Live Recap: Good-bye, Cecily Strong. Hello, Austin Butler\n \n \n \n \n\n \n \n \n \n How a Nepo Baby Is Born\n \n \n \n \n \n \n An All But Definitive Guide to the Hollywood Nepo-Verse\n \n \n \n \n \n \n 1923 Series-Premiere Recap: At Close Range\n \n \n \n \n \n \n Saturday Night Live Recap: Good-bye, Cecily Strong. Hello, Austin Butler\n \n \n \n \n \n \n Everything We Know About YSL’s RICO Case\n \n \n \n \n\n \n\n \n Sign In to Comment\n \n \n\n \n \n \n\n \n \n\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n\n \n \n Email\n \n \n\n \n \n You\\'ll receive the next newsletter in your inbox.\n \n \n *Sorry, there was a problem signing you up.\n\nThis site is protected by reCAPTCHA and the Google\n Privacy Policy and\n Terms of Service apply.",
  "isFullReview": true,
  "dtliExcerpt": "This is a play about gentrification and police violence and family dysfunction, but it's also deeply, fundamentally about the way we talk to each other when no one else is listening.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This is a play about gentrification and police violence and family dysfunction, but it's also deeply, fundamentally about the way we talk to each other when no one else is listening.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "previousUrl": "https://www.vulture.com/2022/12/theater-review-between-riverside-and-crazy-broadway.html",
  "urlDiscoveredAt": "2026-02-04T14:42:48.644Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 993,
  "archivePath": "data/archives/reviews/between-riverside-and-crazy-2022/vulture--sara-holdren_2026-02-04.html",
  "textFetchedAt": "2026-02-04T14:42:48.658Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20221220030243",
  "archiveOrgUrl": "http://web.archive.org/web/20221220030243/https://www.vulture.com/2022/12/theater-review-between-riverside-and-crazy-on-broadway.html",
  "wordCount": 993,
  "tierReason": "Full review text"
}