{
  "showId": "rocky-2014",
  "outletId": "wsj",
  "outlet": "The Wall Street Journal",
  "criticName": "Terry Teachout",
  "url": "https://www.wsj.com/articles/rocky-review-a-lumbering-musical-1395359400",
  "publishDate": "March 21, 2014",
  "fullText": "The problem with 'Rocky' is that it's a lumbering musical that never finds its dramatic footing, much less learns how to dance.",
  "isFullReview": false,
  "dtliExcerpt": "The problem with 'Rocky' is that it's a lumbering musical that never finds its dramatic footing, much less learns how to dance.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "The stage version, directed with immense panache and soaring physicality by Alex Timbers ('Bloody Bloody Andrew Jackson'), is very nearly as good [as the movie], an unpretentious slice of honest entertainment whose rock-'em-sock-'em finale will set the snobbiest of theatergoers to cheering in spite of themselves...Mr. Timbers's staging and Christopher Barreca's scenic design are the stuff Tony nominations are made of. The neon-and-graffiti mean streets of South Philly are portrayed with grim verisimilitude, but the glitz starts to fly as the climactic fight scene draws nearer, and the fight itself is a total-immersion, spare-no-expense stage spectacle. Since Steven Hoggett and Kelly Devine are jointly credited with the show's choreography, I assume that they deserve much credit for the potency of this scene, which is a rich and masterly synthesis of movement, music and design. So yes, 'Rocky' is a straight-down-the-center commodity musical-but a damned fine one, maybe the best I've ever seen. A knockdown hit, in fact.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ROCKY-Opens-on-Broadway-Updating-LIVE-20140313",
  "showScoreExcerpt": "The problem with 'Rocky' is that it's a lumbering musical that never finds its dramatic footing, much less learns how to dance.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (22 words)",
  "textQuality": "truncated",
  "bwwScore": 9,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ]
}
