{
  "showId": "cyrano-de-bergerac-2007",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "https://variety.com/2019/legit/reviews/cyrano-review-peter-dinklage-1203395671/",
  "publishDate": null,
  "fullText": "Pride prevails in this thin, stripped-down musical version of the well-known tale.\n\nIt's pride and not panache that drives this overly spare and gloomy musical adaptation of that classic tale of unrequited love and honor, “Cyrano de Bergerac.” Despite a mesmerizing performance by Peter Dinklage, hot off \"Game of Thrones,\" and a haunting score by members of the band The National, this \"Cyrano\" is so reductive — the musical runs just two hours — that instead of an epic narrative poem of yearning, brio and noble sacrifice, there's just a haiku of rue.\n\nThat may be the point that adapter/director Erica Schmidt intends to make by stripping Edmond Rostand's long, populous 1893 play down to its core story points and tone. But in reducing its flourishes and joy — not to mention the details that enrich characters, color the world they live in and vary the storytelling — it also diminishes the audience's emotional connection, even in its usually surefire, heart-tugging end.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Timothée Chalamet Says He 'Spent Six Figures Out of My Pocket' on 'SNL' Musical Performance and Press Tour Stunts Aren't a 'Gimmick': ‘I Don't Want to Be in the Pretentious In-Crowd' \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Timothée Chalamet Getting American Cinematheque Retrospective\n\nMaking Cyrano sing has been a challenge in the past, too. A large-scale 1973 musical, choreographed and directed by Michael Kidd with a book by Anthony Burgess, earned Christopher Plummer a Tony but was short-lived. Another sumptuous version by a Dutch creative team came and went on Broadway in 1993.\n\nIn this adaptation, the outline of the narrative remains more or less the same as the 1893 play but cut dramatically. Schmidt makes many smart edits and rewrites to move the story along and reduce its period preciousness; though ostensibly set in 17th century France, the attitude is deliberately contemporary.\n\nThough poet-soldier Cyrano (Dinklage) has extraordinary skills with the sword (performed offstage) and with words, his physical insecurities — it's not about the nose — and his high sense of honor prevent him from declaring his love for Roxanne, played with unsettling and unsubtle fierceness by Jasmine Cephas Jones.\n\nRoxanne, oblivious to her friend's profound affection, is urged by her chaperone Marie (Grace McLean) to be more accommodating to the powerful and wealthy De Guiche (Ritchie Coster) — who controls the city and the regiment, which is in the midst of a war. But Roxanne only has eyes for Christian (Blake Jenner), a handsome but word-challenged cadet. Cyrano's love for Roxanne is so strong, he supplies Christian with the words to woo, if only to express his passions vicariously.\n\nThough the script reduces the more improbable or fussy aspects of the Rostand play, new problems arise in the re-purposing. The first connection between Roxanne and Christian is badly and barely staged; the arrival of supporting characters supplying exposition is often clunky, if not unintentionally comic; Cyrano's wizardry with language — his purported specialty — is only glimpsed. The final scene presents a disconcerting side of Roxanne that chills the heart and makes it only about pride, leaving its hero empty and the audience unfulfilled and stranded.\n\nThe production boasts an effective traditional-yet-modern feel, with a handsome minimalist set design by Christine Jones and Amy Rubin; dreamlike and ritualistic movement by Jeff and Rick Kuperman (who also supplied one of the more memorable elements of “Alice by Heart”); and meditative music of longing and desire by Aaron Dessner and Bryce Dessner, with lyrics by Matt Berninger and Caron Besser.\n\nSometimes the tunes are slips of musical moments, sometimes they're fully realized numbers. But they are all of a piece and set the dominant tone of melancholy — apt, but insufficient for the needs of the story-telling.\n\nThe cast numbers 11 but in essence the show's focus is on four characters, all under some form of beautiful illusion. Coster's Duke is a psychologically conflicted and the actor makes the most of his internal angst in the song, \"What I Deserve.\" Jenner (TV's \"Glee\") makes a boyishly appealing Cristian, though perhaps not cadet-worthy. He has a graceful baritone and the show's loveliest song, \"Someone to Say.\"\n\nDinklage's songs are well-crafted to accommodate his low register and narrow range. His singing voice is a soulful musical rumble that measures seismic readings of his sadness and longing. But whether he's singing or sighing, being fearless in battle or fearful of love, his Cyrano remains captivating. Not so much the show, which only sees the pain of illusion.",
  "isFullReview": true,
  "bwwExcerpt": "It's pride and not panache that drives this overly spare and gloomy musical adaptation of that classic tale of unrequited love and honor, \"Cyrano de Bergerac.\" Despite a mesmerizing performance by Peter Dinklage, hot off \"Game of Thrones,\" and a haunting score by members of the band The National, th...",
  "bwwRoundupUrl": null,
  "bwwThumb": null,
  "showScoreExcerpt": null,
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "playbill-verdict"
  ],
  "playbillVerdictUrl": "https://variety.com/2019/legit/reviews/cyrano-review-peter-dinklage-1203395671/",
  "textWordCount": 743,
  "archivePath": "data/archives/reviews/cyrano-de-bergerac-2007/variety--frank-rizzo_2026-02-06.html",
  "textFetchedAt": "2026-02-06T05:36:57.427Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 743,
  "tierReason": "Full review text"
}