{
  "showId": "gutenberg-2023",
  "outletId": "amny-matt-windman",
  "outlet": "AMNY (Matt Windman)",
  "criticName": "Matt Windman",
  "url": "https://www.amny.com/entertainment/gutenberg-review-andrew-rannells-josh-gad-musical/",
  "playbillVerdictUrl": "https://www.amny.com/entertainment/gutenberg-review-andrew-rannells-josh-gad-musical/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "“Gutenberg! The Musical” — a scrappy two-hander parody of mega Broadway shows, structured as a backers’ audition for the Broadway production of an imaginary musical — is finally receiving a high-profile Broadway production of its very own.\n\nFrankly, it worked a lot better before it landed on Broadway.\nThe Broadway production of “Gutenberg!” serves as a star vehicle for Andrew Rannells and Josh Gad, who famously led the original cast of “The Book of Mormon.” Alex Timbers, who staged the original production before becoming a major Broadway director (“Moulin Rouge!,” “Beetlejuice”), has returned.\n\nFirst seen almost two decades ago at the Upright Citizens Brigade and the now defunct New York Musical Theatre Festival, “Gutenberg! The Musical!” depicts Bud Davenport and Doug Simon, a pair of hapless musical theater writers (originally played by Christopher Fitzgerald and Jeremy Shamos, respectively), who share with the audience their ridiculous vision of a lavish Broadway musical based on the life story of Johannes Gutenberg, the inventor of the printing press, in medieval Germany, at least as imagined by them.\n\nIt is not unusual for a creative team to pitch a musical to prospective investors by narrating and singing through the show. (A quick search on YouTube turns up bootleg audio recordings of backers’ auditions for “Company” and “Sweeney Todd.” Stephen Sondheim allegedly did 33 backers’ auditions for the 1964 flop “Anyone Can Whistle.”)\n\nBud and Doug are clueless but well-meaning and dreamy-eyed writers. Their understanding of musical theater appears to be based solely on “Wicked,” “Phantom” and “Hamilton.”\n\nFor instance, they explain that every good musical needs to be based on a preexisting story (because no one cares about completely original work) and should have an “important” theme, and since their show takes place in Germany, their theme is the Holocaust.\n\nFurthermore, they try to act out and physicalize as much of the show as possible by putting on numerous baseball caps (each containing the name of a major or minor character) in order to represent each person they portray at any given time. At one point, a string line of hats held up by sticks stands in for a chorus line of dancers.\n\nRannells and Gad once again make a terrific pair of unlikely pals and earn many laughs. However, “Gutenberg!” was intended to be what the Polish theater theorist Jerzy Grotowski termed “Poor Theater,” built upon minimal production values and maximized imagination.\n\nOn Broadway, it feels both overdone (with an elaborate set invoking an empty stage, instead of an actual empty stage, and a band instead of a single piano, losing its original charm) and undercooked (a slight, overextended, and rudimentary comic routine).\n\nGutenberg! The Musical. James Earl Jones Theatre, 138 W. 48th St., gutenbergbway.com.",
  "isFullReview": true,
  "textWordCount": 452,
  "archivePath": "data/archives/reviews/gutenberg-2023/amny-matt-windman--matt-windman_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:16:41.200Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250717222652",
  "archiveOrgUrl": "http://web.archive.org/web/20250717222652/https://www.amny.com/entertainment/gutenberg-review-andrew-rannells-josh-gad-musical/"
}