{
  "showId": "gutenberg-2023",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://cititour.com/NYC_Broadway/Gutenberg-The-Musical/1173",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $49\n\t Buy Tickets\n\nCititour.com Review\n    Mike Nichols and Elaine May. Nathan Lane and Matthew Broderick. Josh Gad and Andrew Rannells? Somehow, the fact that the latter pair has done just one Broadway show together – “The Book of Mormon” – has been translated into the public gestalt that they’re a legendary comedy team. And that perception, in turn, has resulted in a nearly two-decades later Broadway transfer of Scott Brown and Anthony King’s alternately satiric and sophomoric Off-Broadway tuner “Gutenberg! The Musical!” \n\nWell, thanks to these stars, if you head to the James Earl Jones Theater, you’ll laugh. You’ll wince. You may even tear up a bit. Above all, you’ll be incredibly impressed by the pair’s incredible chemistry as well as their go-for-broke mentality in selling this ridiculous material. Without question, Gad and Rannells absolutely earn an A+ for effort. (Gad, in particular, pulls out all the stops – from silly voices to pathetic looks – to get the biggest guffaws!)\n\nStill, even if you have a good time – and I actually did -- you might wonder why this show isn’t at New World Stages, perhaps playing in repertory with “Dracula: A Comedy of Terrors.” Despite Alex Timbers’ inventive direction and Scott Pask’s clever set, the show never really escapes its humble roots. \n\nFor example, there are still only three musicians on stage (supposedly one-half of New Jersey wedding band “The Middlesex Six”) and there are only two “actors,” aka the show’s writers: schlubby Bud Davenport (Gad) and his best bud, the decidedly gay – but far-from-stylish -- Dan Simon (Rannells).\n\nFor over two hours, the pair must put on a bevy of baseball of caps, not to mention funny voices, to differentiate the (too) many characters that populate the small town of Schlimer, Germany -- the home of the title character (and best known today as the inventor of the first printing press and an occasional “Jeopardy” clue). \n\nMoreover, despite some silly back story, exactly what possessed these two nursing home workers from Nutley to choose Gutenberg as not only the subject of their “historical fiction” musical – but also spend all their money on renting a Broadway theater for a one-time-only backers’ audition -- is never entirely clear, which makes the show’s premise a tad problematic.\n\nNonetheless, what does eventually become clear is Bud and Dan truly love each other (not sexually) almost as much as they love musicals, even if everything they know about the art form seems to have been learned from reading a book about it. Dan practically can’t wait to explain to all of us what a “motif” is, what a “metaphor” means, and why you need a “charm song,” even if the one in the show-within-a-show, “Biscuits,” isn’t particularly charming. Or particularly good.\n\nIndeed, Brown and King haven’t successfully skated the fine line they need to with the show’s score. It’s not supposed to be great, but it’s probably not supposed to be as inept as it is. The melodies are repetitive and banal (as if written by a student of Andrew Lloyd Webber) and the lyrics, whether they rhyme or not, are mostly insipid.\n\nMoreover, while Rannells and Gad have a lot of fun taking turns singing the role of the show’s leading lady, Helvetica (!), I kept wishing for a special female guest star to appear, especially since “she” sings both the show’s Act I finale – which, per Bud, must be a soaring anthem that tween girls will eventually struggle to sing in the shower --  as well as its eleven o’clock number. (Wait for Dan’s explanation of that term!) \n\nWell, at least it’s sung at exactly 9:46!\n\n    \t    By Brian Scott Lipton\n\nVisit the Sitehttps://gutenbergbway.com/CastJosh Gad, Andrew Rannells  \nOpen/Close DatesOpening 10/12/2023Closing Open-ended\nTheatre Info\nJames Earl Jones Theatre138 West 48th StreetNew York, NY 10036\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 83,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 696,
  "archivePath": "data/archives/reviews/gutenberg-2023/cititour-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:32:38.936Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "scoreSource": "extracted-rating",
  "scoreConfidence": "medium",
  "extractedRating": "10/12"
}