{
  "showId": "gutenberg-2023",
  "outletId": "observer-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://observer.com/2023/10/review-of-gutenberg-the-musical-print-is-hilariously-not-dead/",
  "publishDate": null,
  "fullText": "Gutenberg! The Musical! | 1hr 45mins. One intermission. | James Earl Jones Theatre | 138 West 48th Street | 212-239-6200\n\nSign Up\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tThank you for signing up!\n\nBy clicking submit, you agree to our <a href=\"http://observermedia.com/terms\">terms of service</a> and acknowledge we may use your information to send you emails, product samples, and promotions on this website and other properties. You can opt out anytime.\n\nA first-rate intellect, wrote F. Scott Fitzgerald, can hold two opposing ideas in mind and still retain the ability to function. By that metric, I felt pretty darn clever at Gutenberg! The Musical!, which had me scribbling in my notepad, Ugh musicals are stupid and Yay musicals are glorious. Second-rate brains (and humorless rhyme police) can pooh-pooh this zestful skewering of the genre’s creaky conventions and trivializing tendencies; we lacerate because we love.\n\nFramed as a backer’s audition for a plainly atrocious tuner about the 16th-century German inventor of the printing press, the real drama of Scott Brown and Anthony King’s supersized skit is the fraught bromance between its clueless makers, book writer Doug Simon (Andrew Rannells) and composer Bud Davenport (Josh Gad). Crisscrossing the stage with big-boy steps like six-year-olds in a Nativity play, the anxious co-creators introduce themselves as proud residents of Nutley, New Jersey. (Like many of the gags, the name is the punch line; a “wench” named Helvetica lusts after Gutenberg, for example.) One day on a crazy impulse, the guys sold Doug’s car to see a Broadway show—and ended up taking in three and a half (“Please don’t tell us how Hamilton ends, we will go back”). Bitten by the razzle-dazzle bug, our talentless twosome never looked back.\n\nHow were these boobies able to rent the James Earl Jones Theatre for their reading? Bud explains that his uncle “recently started hang-gliding,” hand soars up, “and then recently stopped hang-gliding,” hand plummets down. “It was very quick and he didn’t suffer,” Doug hastily adds. “Which is exactly how I hope all of you die.” So, money from inheritance and Doug selling his parents’ home totally squandered, the boys are ready to act out scenes and songs for hypothetical producers in the audience, juggling a full cast of characters by alternating trucker mesh caps with names taped above the bill: Gutenberg, Drunk #2, Young Monk, and so forth. I scanned the playbill for “Headwear Choreographer” and, finding none, tip my own chapeau to the actors and their puckish director, Alex Timbers. It’s a symphony of doffing.\n\nGutenberg! has been doing the hat jive for some time. The metamusical spoof debuted Off Broadway in 2006, where the overweening absurdity of Bud and Doug’s dreams probably seemed even more flop-sweaty and pathetic. An Off Broadway cast album inspired multiple out-of-town and college productions. Seventeen years later, original director Timbers has Moulin Rouge!, Here Lies Love and other splashy titles under his belt and he’s cast the original breakout stars of The Book of Mormon. Is there enough outsider desperation left for this comedy of low stakes to come through?\n\nOh my Gad yes. The shorter and rounder of the comedy duo exudes panicked glee from every pore, sculpting another manic man-boy from the mold of Mormon’s Elder Arnold. Rannells plays straight twink to Gad’s squirming bundle of nerves, the strapping, boyish hunk semi-oblivious to his buddy’s vaguely romantic overtures. (In Bud’s defense, when Gutenberg operates a wine press, his deep-squat gyrations are positively pornographic.) Gad’s voice is a multi-octave marvel, swooping from an evil monk’s villainous rasp to a vibrato-heavy tenor and up to a demented falsetto for an antisemitic flower girl and others. Sounding like a rabid weasel is trapped in his esophagus, Gad’s vocal inflections and acrobatics build laughs within laughs. Rannells’s shtick may be less flashy, but he holds his own, and seasons the friendship with dashes of earnestness and compassion that keep us engaged in the one-joke concept.\n\nWhich is, obviously, that Gutenberg! is dreadful in a way that only bad musical theater can be dreadful. The title hunk (Rannells) is a winemaker for the German town of Schlimmer where rampant illiteracy leads to tragic results, such as mistaking jelly beans for medicine. Gutenberg turns his wine press into a printing press, the town’s Satan-worshipping monk (Gad) vows to stop him, and grape-stomping love interest Helvetica ends up in prison (where a couple of hats named “rat” hump on her shoulder). The ersatz score (performed by one-half of “New Jersey’s premier wedding band”) cribs shamelessly from Andrew Lloyd Webber, Boublil and Schönberg, and pop styles ranging from boogie-woogie to power ballad. Along the way, Doug and Bud offer a crash course on the elements of the form: the “I Want” song, the “Charm Song,” and the big Act I finale. Need one add that Brown and King’s lyrics are impressively tortured? Helvetica bewails her fate behind bars: “So maybe I oughta drown / or put my body in the ground / ‘cause I let everybody down / I’m just a crying clown / wearing a painted frown.” It takes craft to be this crappy.\n\nScenic designer Scott Pask simulates a disorganized backstage area with tables, technical gear and touches that suggest a Nutley yard sale (I see he bought the Star Wars bedsheets from my childhood on eBay) and costume designer Emily Rebholz gives the boys the perfect level of dweeby élan, down to Rannells’ tucked-in sweater. I don’t know if the bazillion trucker hats are sets, costumes, props or what, but give someone a Tony. Having staged much costlier and busier spectacles, it’s a treat to see Timbers work his signature blend of irony and ecstasy on a smaller scale with a tighter focus, while reserving a juicy reveal for the end. Gutenberg! is not designed to be anyone’s gateway musical or inspire a career in that impossible, flop-filled field, but it’s firmly imprinted on my heart, sans serif.\n\nWe noticed you're using an ad blocker.\n\t\t\tWe get it: you like to have control of your own internet experience. But advertising revenue helps support our journalism. To read our full stories, please turn off your ad blocker.We'd really appreciate it.\n\nBelow are steps you can take in order to whitelist Observer.com on your browser:\n\nClick the AdBlock button on your browser and select Don't run on pages on this domain.\n\nClick the AdBlock Plus button on your browser and select Enabled on this site.\n\nClick the AdBlock Plus button on your browser and select Disable on Observer.com.",
  "isFullReview": true,
  "dtliExcerpt": "\" 'Gutenberg!' is not designed to be anyone’s gateway musical or inspire a career in that impossible, flop-filled field, but it’s firmly imprinted on my heart, sans serif.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1077,
  "archivePath": "data/archives/reviews/gutenberg-2023/observer-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:37:23.629Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250724231609",
  "archiveOrgUrl": "http://web.archive.org/web/20250724231609/https://observer.com/2023/10/review-of-gutenberg-the-musical-print-is-hilariously-not-dead/"
}