{
  "showId": "gutenberg-2023",
  "outletId": "theatrereviews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theatrereviews.com/broadway-review-gutenberg-the-musical-at-the-james-earl-jones-theatre-through-sunday-january-28-2024/",
  "publishDate": null,
  "fullText": "One of the latest offerings to open on the Great White Way is no stranger to New York theatre audiences since it has had several productions Off Broadway since the mid-2000s, after it was developed by Upright Citizens Brigade Theatre as a forty-five-minute, one act. In this present, over produced, Broadway incarnation, you might start to feel as if it may actually be as long as the Gutenberg Bible and far less interesting. Basically, it is two hours of the same joke over and over again, and no matter how well it is delivered by the two talented stars Josh Gad and Andrew Rannells it becomes tiresome. In fact, these two actors portray numerous characters so well, that a need for gimmicky baseball caps with characters names on them becomes unnecessary, diminishing the impact of the comedic device. Unfortunately, at the same time repeating the same gestures and mugging to punctuate a point or joke wears thin.\n\nThis is a two-hander with both actors playing numerous characters. The plot revolves around two friends who have decided to write a musical and pitch it to producers, hoping to secure a contract which would award them a Broadway production. After exhausting all their money and resources to rent a Broadway theatre for the backer’s audition, they are left with the task of performing the show themselves, playing all the characters. They hire a local wedding band, only being able to afford three pieces, and rely on DIY production values, done on a shoestring budget. There are no costumes or sets, using baseball caps to identify characters and revealing locations by using handwritten cardboard signs hung on the backstage door. All major props consist of a cardboard box, labeled with the name of the coinciding object it needs to become. Somehow, even with these minimal production values, this show seems overproduced, especially during the last scene after a guest star appears, acting as a producer who has been watching the show in the audience.\n\nNo matter what Director Alex Timbers has done to move the show along at a quick pace it loses steam even before the end of the first act. It is said that no matter how great the product may be, it does not work if the actors do not rise to the occasion. In this case no matter how talented the actors are, they cannot transcend the inferior material. The book, music and lyrics are credited to Scott Brown and Anthony King. The book is predictable and becomes redundant, as is the play within the play. The music is pleasant enough but a bit generic with no distinct style. The lyrics are sophomoric and contribute nothing to the plot or action at hand. The production would fare much better in a smaller more intimate space performed with no intermission. It is a great evening of entertainment if you are a fan of the two actors, easily suspend your disbelief and go along for the rollicking ride. It can be considered a bit of fluff, but if you whip it too long or work it too much, it can become too stiff and lose the light and airy texture it so desperately needs.\n\nThe somewhat recognizable journey from play, to film, and finally to musical delivers the new “Real Women have Curves” to the James Earl Jones Theatre on Broadway. It has morphed into a small musical with a big heart. The book by Lisa Loomer and Nell Benjamin is based on the…\n\nComplete casting has been announced for the new musical NATASHA, PIERRE & THE GREAT COMET OF 1812, featuring the Broadway debuts of 24 cast and creative team members including Josh Groban* as ‘Pierre’ and Denée Benton* as ‘Natasha.’ Created by Dave Malloy* (Ghost Quartet, Preludes) and directed by Rachel Chavkin* (Hadestown, Artistic Director of The TEAM) – also making their Broadway debuts…\n\nThe new musical “Smash,” opening on Broadway at the Imperial Theatre, creates more than one bombshell, strategically detonating a multitude of explosive twists, turns, and powerful production numbers, to create a good old-fashioned musical. Never having seen the popular television show of the same name, there were no comparisons or…",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 695,
  "archivePath": "data/archives/reviews/gutenberg-2023/theatrereviews-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:48:51.057Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.goto: Timeout 60000ms exceeded.\nCall log:\n  - navigating to \"https://www.theatrereviews.com/broadway-review-gutenberg-the-musical-at-the-james-earl-jones-theatre-through-sunday-january-28-2024/\", waiting until \"domcontentloaded\"\n"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "ends_with_ellipsis"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}