{
  "showId": "gutenberg-2023",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.theaterscene.net/musicals/broadway/gutenberg-the-musical/joseph-pisano/",
  "publishDate": null,
  "fullText": "Posted on October 25, 2023 by Joseph Pisano in Broadway, Musicals Andrew Rannells and Josh Gad in the Broadway production of “Gutenberg! The Musical!” at the James Earl Jones Theatre (Photo credit: Matt Murphy) Whatever wisdom human beings possess about each other might be best represented through Stephen Sondheim’s collected works, but, let’s be honest, theater fans. Most musicals range from forgettable to indelibly bad, particularly when serious matters become the basis for pretentious scores that cause listeners to mercifully beg for any facile earworms to just go ahead and finish them off. With tongue planted firmly in cheek, Gutenberg! The Musical! takes playful aim at the expensively staged song-and-dance that repeatedly bilks, bothers, and bores audiences while also, touchingly, making a compelling argument for its continued existence, at least to all of us sentimental suckers (wasn’t that in Sondheim, too?). Belying the apparent confidence of those titular exclamation points, Gutenberg! The Musical! is propelled by the cutesy-wootsy conceit that it’s not yet ready for Peoria, let alone the Great White Way. Still struggling through the pitch phase of their Broadway dream, old friends and nursing-home co-workers Doug (Andrew Rannells) and Bud (Josh Gad) turn lots of money, mostly acquired from either gullible or recklessly dead relatives, into a long-shot attempt at finding a richer vein of financial support. Having secured the James Earl Jones Theatre for a barebones production of their debut opus, as well as a resonant recorded welcome from that eponymous legend, Doug and Bud, backed by a half-available sextet (The Middlesex Six, “New Jersey’s premier wedding band”), perform the multitudinous roles they’ve written entirely themselves. To sustain their middle-aged aspiration of footlights glory, Doug and Bud desperately need the audience to contain perhaps no more than one appreciative, and moneyed, member (spoiler alert: this potential angel investor is a golden opportunity for a celebrity cameo). For their maiden artistic voyage, the two starry-eyed jamokes from New Jersey have indeed chosen as their subject, Johannes Gutenberg, the inventor of the movable-type printing press. Doug and Bud’s logic for this out-of-the-box selection is twofold: as any schoolkid knows, Gutenberg did something very important, and the duo’s quick google search didn’t reveal much personal information about a 15th-century man who had such a profound effect on everything to come. Therefore, besides being an historical brand name, Gutenberg is also essentially a blank slate whose life story Doug and Bud can overwrite with whatever formulaic musical-theater nonsense occurs to them. Josh Gad and Andrew Rannells in the Broadway production of “Gutenberg! The Musical!” at the James Earl Jones Theatre (Photo credit: Matt Murphy) How much you enjoy Gutenberg! The Musical! likely depends on a combination of factors entirely unrelated to that German fellow: familiarity with the tropes it’s skewering; your own level of disdain for such hackney execution; and your tolerance for Rannells and Gad’s incessant mugging. In their first Broadway pairing since The Book of Mormon over a decade ago, Rannells and Gad are less a comic team than a comic rivalry, with neither willing to be the Abbott to the other’s Costello. Fortunately, their ping-ponging, look-at-me dynamic only occasionally grows tiresome, usually when either of them is trying to gin up laughs that aren’t there or shouldn’t rise above a tee-hee. Mostly, though, their peppy antics commendably serve the deliberately puerile Gutenberg! The Musical, with Rannells and Gad reveling in the show-within-a-show’s self-referential silliness so completely that it’s easy to overlook the fact that they’re depicting characters. That’s true even when Doug and Bud share autobiographical details with the audience between scenes, a sure indication that not only has director Alex Timbers given Rannells and Gad free rein to overwhelm the material with their own outsized personalities but, more to the point, he had no other choice. While Scott Brown and Anthony King, who actually collaborated on the book, music and lyrics for Gutenberg! The Musical!, might be a couple triple threats, they aren’t especially deep ones. In fairness, of course, Doug and Bud are supposed to be inept, so nobody should expect what they’ve creatively concocted to herald the second coming of Rodgers and Hammerstein. That being noted, the more musicals you’ve seen, the more likely you are to grade what they’ve done on a curve, which would be a solidly middling one even without Rannells and Gad’s charismatic contributions. In fact, there’s a bit of genius in their stupidity. Josh Gad and Andrew Rannells in the Broadway production of “Gutenberg! The Musical!” at the James Earl Jones Theatre (Photo credit: Matt Murphy) Besides the who’s who of sharpie-scrawled trucker hats (costume design by Emily Rebholz) that Doug and Bud utilize to miraculously keep their character-packed narrative cogent, there are also hilariously history-warping shenanigans in Gutenberg! The Musical! in line with the old adage about a little knowledge being a dangerous thing. The highlights include Gutenberg’s credulous would-be wife Helvetica (shout out to the typophiles!)–who Rannells and Gad alternate, um, embodying–and our hero’s diabolical antagonist, a Satan-worshiping monk–that Gad portrays with all the subtlety of peak Ozzy Osbourne–who feverishly fulminates against what widespread literacy will do to his social position (makes total sense!). Despite continuously reminding us how uninspiringly faithful they’re being to musical conventions–this is our “I Want” song; this is our “11 o’clock” number, even though shows aren’t that long now–Doug and Bud’s mix of wide-eyed innocence and crow’s feet is a compelling reason to root for them. It’s a smartly cynical bet others in their shoes would never experience the fairytale ending of Gutenberg! The Musical!, which includes an extraordinary blink-and-you’ll-miss-it set from Scott Pask. Still, to all the Dougs and Buds out there, good luck, you fools! Gutenberg! The Musical! (through January 28, 2024) James Earl Jones Theatre, 138 West 48th Street, in Manhattan For tickets, call 212-239-6200 or visit http://www.gutenbergbway.com Running time: two hours and 15 minutes including one intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 978,
  "archivePath": "data/archives/reviews/gutenberg-2023/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:41:41.121Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}