{
  "showId": "gutenberg-2023",
  "outletId": "theaterlife-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://theaterlife.com/gutenberg-the-musical-1-2/",
  "publishDate": null,
  "fullText": "October 15, 2023: Gutenberg! The Musical! is as sweet, light and fun as a big chocolate chip coookie—and about as nourishing. But that’s okay. This fluffy, insider meta-musical for those who love musicals is nothing more than a diversion, mildly tweaking the conventions of Broadway and ribbing those who are obsessed with them. Originally presented Off-Broadway in 2007, this big, splashy revival sharply directed by the inventive Alex Timbers retains the two-hander’s intimacy while expanding to fill the James Earl Jones Theater. There are even pre-show jokes about the venue’s namesake. “Welcome to the only Broadway theater named for a Sith Lord,” intones a voice, presumably an imitation of the deep-voiced actor and not the star himself. October 15, 2023: Gutenberg! The Musical! is as sweet, light and fun as a big chocolate chip coookie—and about as nourishing. But that’s okay. This fluffy, insider meta-musical for those who love musicals is nothing more than a diversion, mildly tweaking the conventions of Broadway and ribbing those who are obsessed with them. Originally presented Off-Broadway in 2007, this big, splashy revival sharply directed by the inventive Alex Timbers retains the two-hander’s intimacy while expanding to fill the James Earl Jones Theater. There are even pre-show jokes about the venue’s namesake. “Welcome to the only Broadway theater named for a Sith Lord,” intones a voice, presumably an imitation of the deep-voiced actor and not the star himself. Scott Brown and Anthony King collaborated on the witty book, music and lyrics and the concept is ingeniously simple. An aspiring musical theater writing duo named Bud Davenport and Doug Simon, played with gleeful giddiness by Book of Mormon alumnae Josh Gad and Andrew Rannells, have spent their life savings to rent the Jones theater for one night to present a backer’s audition of their ridiculous runt-of-the-litter tuner about the titular inventor of the printing press. They explain they were bitten by the Broadway bug after they sold Doug’s car to buy tickets to a show. (That crack about the Main Stem’s exorbitant prices got a huge guffaw at the performance attended.) In order to save money, the two play all the roles in their bizarre, historically inaccurate fantasy, distinguishing each part by donning a baseball cap with the character’s name imprinted on it. The switching of hats leads to some clever staging by Timbers, particularly when there is a crowd scene. The show-within-a-show is a zany and hilarious spoof of megamusicals like Les Miz and Phantom with a particularly silly plot twist of the boyishly heroic Gutenberg’s printing press being endangered by his jealous love interest Helvetica (her name is a printing font, get it?) and a villainous Monk who sees the advancement of reading as a threat to his power. Gad is spectacularly funny as the monk, giving him a dark rumbling voice not unlike Audrey II in Little Shop of Horrors. Both actors are brilliantly goofy as the earnest pair, desperate to find a producer amongst the audience and joyful in their celebration of musicals. They make a gloriously mismatched pair. Physically they are a sort of a 2023 Laurel and Hardy with Gad a rotund clown playing against the handsome, tall Rannells. They display versatility in liming the various roles while maintaining the personae of the adorable but somewhat deranged songwriters. Their commentary on the writing of a show is also riotous. They have been given humorous movement patterns to denote the various tropes. For example, Bud gives a silly little sidekick every time he asks Doug a question about a musical convention, “But, Doug (kick) what is a charm song?” (Nancy Renee Braun is credited with movement.) Scott Pask created the bare-bones set which contains several surprises and Jeff Croiter’s masterful lighting transports us into the numerous comical worlds of Bud and Doug’s fractured imagination. My only complaint is the material is too thin to be stretched out over two hours with an intermission. Ninety minutes with no break would have been sufficient. The pacing drags when Bud and Doug break from their presentation and expose their desperate situation. All their cash is tied up in this one night and their personal lives are gloomy. Somehow the comedy gets drained during these asides and the show comes to a stop. Also the ending of the Gutenberg musical is rather abrupt. Even in a comedy sketch context, conflicts and plots must be resolved. But, sides from these quibbles, Gutenberg! is joyful funny and a special treat for all those who love Broadway. Gutenberg! The Musical! ***1/2Oct. 12—Jan. 28, 2023James Earl Jones Theater138 W. 48th St., NYC. Running time: two hours including intermission. telecharge.com.Photography: Mathew Murphy",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 773,
  "archivePath": "data/archives/reviews/gutenberg-2023/theaterlife-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:40:25.675Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}