{
  "showId": "gutenberg-2023",
  "outletId": "timeout-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.timeout.com/newyork/theater/gutenberg-the-musical-broadway-review-josh-gad-andrew-rannells",
  "publishDate": null,
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Matthew Murphy | Gutenberg! The Musical!Review\n\n4 out of 5 starsJosh Gad and Andrew Rannells press their luck (and win!) in a two-man musical comedy.Theater, MusicalsRecommendedThursday October 12 2023ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\nDoug Simon and Bud Davenport wear many hats in their enthusiastic presentation of Gutenberg! The Musical! Not only are these overeager friends from New Jersey the authors of a highly unpromising new tuner about the 15th-century inventor of the printing press, but they also narrate this show, explain their writing choices and play every part; their roles are differentiated via dozens of yellow baseball caps with the characters’ names spelled out on them, like the shirts in the doomed original production of Merrily We Roll Along. Having spent their life savings to rent Broadway’s James Earl Jones Theatre for a one-night backers’ audition, hoping to corral producers for their project, they throw everything they’ve got—and, alas, more—into songs that are very bad at the very best. “Gutenberg! Darn tootin’-berg,” they sing in their show’s big opener. “He’s the best chap around / At least in this town / Sure as shootin’-berg!”\n\nIf they seem nervous, that’s because they’re taking a mighty big risk up there; after all, as Doug’s late mother once told him, “You gotta put food on the table and you can’t eat dreams!” So the open laughter that their amateurish presentation evokes from the audience might seem a bit cruel—that is, if Doug and Bud were real wanna-be writers and not the fictional heroes of Scott Brown and Anthony King’s silly-smart, sweet-natured and very funny meta-musical, and if they weren’t being played by the hilarious Andrew Rannells and Josh Gad, last seen together on Broadway as the original leads of The Book of Mormon. The fiasco is faux, and the mortifying goofs onstage are just inspired goofing.\n\nGutenberg! The Musical! | Photograph: Courtesy Matthew Murphy\n\nThis production of Gutenberg! also reunites the Beetlejuice team Brown, King and director Alex Timbers, who helmed the musical’s Off Broadway premiere back in 2006. The gifted Timbers has since directed projects ranging from micro (Oh, Hello on Broadway) to mega (Moulin Rouge!), and this show has been revised and scaled up to fill a larger venue. It remains, however, deliberately homemade-looking. Wielding dubious props—Gutenberg’s press looks more like a fireplace bellows—and backed by a three-person band, Doug and Bud prance awkwardly about the stage, stopping the show from time to time to overshare glimpses of their disappointing personal lives.\n\nRannells and Gad work so well off each other’s strengths that Gutenberg! makes you want to see them in a revival of The Producers. Though Doug is the gay one of the team, Rannells mostly plays it relatively straight; physically graceful and a bit of a control freak—you can occasionally catch him mouthing lines when Bud speaks—he plays the central role of the hardy Gutenberg, who begins the show as a winemaker in the thatch-heavy, rat-infested town of Schlimmer. (That’s the German word for worse.) Meanwhile, Gad’s more excitable Bud capers around him and shows off his impressive range, both comic and vocal, in juicier side roles like a hateful flower girl and an evil, growling monk. They both play a recurring pair of drunks, and take turns playing Gutenberg’s love interest, an illiterate wench named Helvetica.\n\n“History’s paved with the hearts of the stupid,” observes Helvetica in her 11-o’clock number, once the show-within-a-show has veered wildly from what little is known of Gutenberg’s biography. Brown and King excel at this kind of joke, which sends up musical-theater ambitions. That kind of humor isn’t new—Saturday Night Live enthusiasts might be reminded of the 1977 “Bad Musicals” sketch involving a show about the Dutch microscope pioneer Antonie van Leeuwenhoek—but Gutenberg! infuses its kidding with kindness. The result suggests a cross between Christopher Guest’s Waiting for Guffman and the beloved cult musical [title of show], which also began at the New York Musical Festival in the 2000s. Affection is the key that opens the show’s comedy: You feel for Doug and Bud, and even root for them. As stupid as their historical musical may be, you can’t deny that they’ve got heart.\n\nGutenberg! The Musical! James Earl Jones Theatre (Broadway). Book, music and lyrics by Scott Brown and Anthony King. Directed by Alex Timbers. With Josh Gad, Andrew Rannells. Running time: 2hrs 15mins. One intermission.\n\nFollow Adam Feldman on Twitter: @FeldmanAdamFollow Time Out Theater on Twitter: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nGutenberg! The Musical! | Photograph: Courtesy Matthew Murphy\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "dtliExcerpt": "\"Affection is the key that opens the show’s comedy: As ridiculous as Doug and Bud may be, you feel for these guys and even root for them. As stupid as their historical musical may be, you can’t deny that they’ve got heart.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": 100,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1065,
  "archivePath": "data/archives/reviews/gutenberg-2023/timeout-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:49:59.226Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "designation": "Critics_Choice",
  "scoreSource": "time-out-stars",
  "scoreConfidence": "medium",
  "originalRating": "5/5 stars"
}