{
  "showId": "gutenberg-2023",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Aramide Tinubu",
  "url": "https://variety.com/2023/legit/reviews/gutenberg-the-musical-broadway-review-1235792515/",
  "publishDate": "October 13, 2023",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Though the show runs a brisk 100 minutes, it feels much longer due to its repetitive nature and lack of genuine surprises.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Though the show runs a brisk 100 minutes, it feels much longer due to its repetitive nature and lack of genuine surprises.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 400,
  "archivePath": "data/archives/reviews/gutenberg-2023/variety--aramide-tinubu_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:00:41.398Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Disney is heading back to Arendelle.\n\nBob Iger revealed the studio is working on a fourth “Frozen” movie in addition to the previously announced “Frozen 3,” which hasn’t been released yet.\n\n\"'Frozen 3' is in the works, and there might be a 'Frozen 4' in the works too,\" Disney’s CEO said Thursday on \"Good Morning America.\" \"But I don't have much to say about those films right now. [Director] Jenn Lee, who created the original 'Frozen' and 'Frozen 2,' is hard at work with her team at Disney animation on not one but actually two stories.\"\n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Timothée Chalamet Makes Oscars History With 'Marty Supreme' as Youngest Man With Three Acting Noms \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'One Battle After Another' Wins Top Honor at London Critics' Circle Film Awards as Timothée Chalamet Is Named Best Actor\n\n“Frozen” songwriters Kristen Anderson-Lopez and Robert Lopez will be back to pen new tunes for the two follow-up films, Anderson-Lopez later confirmed on social media. “Well, I've been quiet here for a while,” she wrote. “But yeah, this.”\n\n \n Popular on Variety\n\nWell, I’ve been quiet here for a while. But yeah, this. https://t.co/0ueoW3UxOx#frozen3 #frozen4\n\nIger made the announcement from Disney’s theme park in Hong Kong, where he’s in town for the opening ceremony of “World of Frozen.” The attraction lets guests not only meet Olaf, Anna and Elsa, but also dine at restaurants and walk the streets that evoke the mystical world of Arendelle.\n\n\"For years at our Disney Parks, we've been creating these large immersive worlds. Essentially, they are the physical embodiment of some of the greatest stories that we’ve told... And of course, 'Frozen' being one of our most valuable franchises, I think it's just right for building the place that 'Frozen' takes place in,” Iger said. “It’s just a fantastic land that enables people to get immersed in the story of 'Frozen' and interact with all the great characters from the films.\"\n\n“Frozen” and its 2019 sequel “Frozen II” became huge, zeitgeist-smashing hits for Disney. The follow-up film remains the biggest animated release of all time with $1.45 billion, though the original was no slouch with $1.33 billion. In addition to box office riches, the movies about the adventures of royal sisters Anna and Elsa (voiced by Kristen Bell and Idina Menzel) produced inescapably popular songs like “Let It Go” and “Do You Want to Build a Snowman?” as well as a Broadway musical."
}