{
  "showId": "jitney-2017",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2017/legit/reviews/jitney-review-august-wilson-1201973950/",
  "publishDate": "January 19, 2017",
  "fullText": "With August Wilson’s “Fences” playing in movie theaters and Andre Holland attracting Oscar buzz for his star-making performance in “Moonlight,” Manhattan Theater Club should draw crowds to this pitch-perfect revival, with Holland in the fine cast, of another play in Wilson's Pittsburgh Cycle. Although “Jitney” was the only one of Wilson’s 10 plays that hasn’t previously had a Broadway production, this ensemble piece about gypsy cab drivers trying to make an honest living during the 1970s economic depression remains one of Wilson’s best plays.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Succession’ Star Hiam Abbass Says Making Movies Like ‘Palestine 36’ Is ‘More Than an Artistic Choice’ — ‘It’s a Duty’ \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘The Secret Agent’ Director Kleber Mendonça Filho Praises Oscar Nominee Wagner Moura: ‘Everything Came Together Because of the Main Actor Who Believes in Generosity’\n\nIt was the playwright's great ambition to chart the fortunes of African-Americans in the 20th century by writing plays illustrating the economic and social changes that defined each decade. Amazingly, he succeeded. “Gem of the Ocean,” the last really great play Wilson wrote (in 2003), begins the historical cycle in 1904 with a soulful account of the great northern migration of freed black citizens after the Civil War. “Jitney,” which falls later in the cycle, is the first play the scribe wrote (in 1979) and captures the essence of that dark decade of hard times and declining hopes.\n\nLike all the plays in the cycle, “Jitney” is set in the Pittsburgh Hill District. The scene is a busy gypsy cab company — busy because regular cab companies won’t service this black neighborhood — and its every grubby detail is captured in David Gallo’s meticulously designed set and by Jane Cox’s artfully dreary lighting scheme. The company is operated by Becker (John Douglas Thompson, one of our finest actors), an upright man who sets stringent rules for his drivers: 1. No overcharging; 2. Keep cab clean; 3. No drinking; 4. Be courteous; 5. Replace and clean tools. Which sound like the kind of rules everyone might live by.\n\nThat great god Gentrification, a sign of the ’70s, is coming to the Hill District, and local residents are living on the edge. But not Becker, who intends to carry on until the gentrifiers drag him out by the heels. That bullheaded attitude might work with his drivers, but when extended to his son, Booster (Brandon J. Dirnden), it resulted in an estrangement between father and son that now seems impossible to repair.\n\nRather than following a conventionally structured plot, the wheels of the play turn on individual mini-dramas like the father-son conflict between Becker and Booster.\n\nThe most engaging throughline is the romantic tragicomedy played out between Youngblood (Holland) and Rena (Carra Patterson), his longtime girlfriend and the mother of his young son. A young vet whose social skills were blunted in Vietnam, Youngblood has been downright devious about where his time and money have been going lately — a shifty quality that Holland softens with an appealing dose of boyish charm — and Rena is pretty frantic about it. It’s a tender moment when Youngblood finally reveals what he’s been doing behind Rena’s back, followed by a hilarious comeback when Rena tells him exactly what she thinks about that.\n\nWilson was a student of humanity and a master of its foibles, and his characters are a collection of flawed, funny, and sometimes tragic people who somehow manage to screw up their own best intentions. As one of his most realistic plays, “Jitney” is filled with sharply observed characters who don’t immediately reveal themselves to the naked eye.\n\nTake Fielding, who seems to be your conventional drunk. As played by Anthony Chisholm, who seems to have an affinity for Wilson’s characters, Fielding has the staggering gait and vacant grin of a hopeless alcoholic — not really someone you’d trust to drive you around the neighborhood. As such, he’s kind of funny and a little bit sad. But when Wilson hands Fielding his dramatic moment, he draws himself up and reveals a proud man with a dignified history. It’s a stunning moment and a fine piece of acting.\n\nHis heartfelt feelings for his characters made Wilson a master of the ensemble-play structure, which lives and dies on the human comedy of its characters. Director Ruben Santiago-Hudson, an honorable caretaker of Wilson's characters (he starred in “Seven Guitars” and “Gem of the Ocean” on Broadway), dances to the rhythms of ensemble directing, which assures that these actors live for and through their characters.\n\nUnder Santiago-Hudson's sure hand, you can't help but relish the performances of Michael Potts, as the nosy gossip Turnbo; Harvy Blanks, as the busy-busy numbers runner Shealy; and all the other jitney drivers who make Becker’s cab station a great place to hang out in.",
  "isFullReview": true,
  "dtliExcerpt": "The production has the lived-in feel of real life, and the ensemble cast delivers Wilson's streetwise dialogue with the authenticity of people who have walked these mean streets.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The production has the lived-in feel of real life, and the ensemble cast delivers Wilson's streetwise dialogue with the authenticity of people who have walked these mean streets.",
  "contentTier": "complete",
  "contentTierReason": "Short text (28 words)",
  "textQuality": "full",
  "rejectedAt": "2026-02-03T17:12:28.476Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a brief excerpt or quote fragment lacking any clear recommendation or comprehensive evaluation of the show.; openai: The text provided is too brief and lacks evaluative content to determine a recommendation or score.",
  "promptVersion": "5.2.0",
  "textWordCount": 794,
  "archivePath": "data/archives/reviews/jitney-2017/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:25:00.236Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 794,
  "tierReason": "Full review text",
  "playbillVerdictUrl": "http://variety.com/2017/legit/reviews/jitney-review-august-wilson-1201961718/",
  "sources": [
    "web-search",
    "playbill-verdict"
  ]
}
