{
  "showId": "ann-2013",
  "outletId": "deadline",
  "outlet": "Deadline",
  "criticName": "Unknown",
  "url": "http://deadline.com/2015/10/sylvia-broadway-review-1201595939",
  "playbillVerdictUrl": "http://deadline.com/2015/10/sylvia-broadway-review-1201595939",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Disney Names Parks Chief Josh D'Amaro As CEO To Succeed Bob Iger, Ups Dana Walden To New President Role; Pay Packages Set \n \n \n\n \n \n \n \n\n \n \n \n\n Read the full story\n\n \n\n \n\n \n\n \n\n \n \n \n \n\n \n\n \n \n\n \n\n \n\n \n \n\n \n \n \n \n \n By Jeremy Gerard\n\nMatthew Broderick plays Matthew Broderick and Annaleigh Ashford plays the dog he picks up in Central Park. They’re both pretty adorable in the Broadway premiere of A.R. Gurney’s Sylvia, given an engaging, if somewhat attenuated, staging by Daniel Sullivan. Ashford is especially endearing the title role, a poodle mix that Broderick’s Greg rescues, to the chagrin and, soon, distress of his wife Kate (Julie White, also perfectly cast).\n\nAshford won a Tony Award last year for her demented ballerina in the revival of You Can’t Take It With You; before that she nearly stole Kinky Boots from its putative stars. She’s an irresistible comedienne, part Lucille Ball, part Joan Cusack: unembarrassedly physical, graceful and slightly wacked out. The role was famously originated by Sarah Jessica Parker in the 1995 Manhattan Theatre Club premiere; 20 years later, Ashford makes it entirely her own.\n\nGurney’s gimmick is that Sylvia talks, and she’s got a mouth on her. When she spots a cat in the distance, she lets loose with a litany of epithets that would, as they used to say, make a sailor blush. At home, she’s likely to spring up onto the couch, only to be rudely dispatched by Kate. Greg, on the other hand, she worships. Indeed, “You are God,” she says, meaning it. She nuzzles his neck, wraps her paws around anything she can grab and when she senses an intruder, shouts “Heyheyhey!” in lieu of barking.\n\nBut the play is about Greg, a classic male midlife crisis case. His job as a currency trader is empty and beyond his understanding. Kate, now that her children are grown and out of the house, has a noble career teaching Shakespeare to city kids who could care less. A dog is out of the question; she wants to go to concerts, weekend away with friends, travel to places they have dreamed of. In Sylvia she has met her match, as Greg focuses an increasingly disturbing amount of attention on her. He leaves the office early to take her on long walks in the park (where she has a hilarious, thankfully unseen, fling with a dog named Bowser) and protests that Kate will come to love her. He wants to have his cake and, well, have it too.\n\nThink too hard and the whole thing falls apart, or into a kind creepiness as Greg’s affections turn obsessive and just this side of sexual (I hope). But in truth, Sylvia might easily have been a red Ferrari or a hot secretary, and Gurney slaps on a happy ending that’s pat but at least sympathetic. In 1995, I wrote, “Sylvia becomes the route through which Greg divorces everything meaningless in his life; it’s significant that that does not include Kate.” Robert Sella plays three increasingly annoying characters — Bowser’s male owner, a society doyenne and an ambisexual shrink — whose comic relief is vulgar, unnecessary and overdrawn. So leave the deep-thinking cap at home, and settle in for some pleasurable laughs. A lot of them.\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nYes, rather than do a new, timely or provocative play, why not dust off an old A.R. Gurney piece that was dated when it was written years ago. This is why straight plays (non-musicals) have become all but culturally irrelevant\n\nNot every play has to be “provocative” to be worthy of a Broadway production. There’s a lot to be said about a well-crafted evening of theater that is simply a pleasure. Noel Coward certainly wrote his share of fun. As did George Kaufman, Moss Hart, S.J. Perelman and others. You don’t have to limit yourself to Clifford Odets.\n\nDeadline is a part of Penske Media Corporation. © 2026 Deadline Hollywood, LLC.",
  "isFullReview": true,
  "textWordCount": 651,
  "archivePath": "data/archives/reviews/ann-2013/deadline--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:16:48.476Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 651,
  "tierReason": "Full review text"
}