{
  "showId": "ann-2013",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "http://www.vulture.com/2013/03/theater-review-ann.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "This isn’t a political ad, and anyway, the audience is already sold. How could it not be? With no live foils onstage — another unavoidable condition of the genre — Taylor works the room relentlessly. Every laugh is procured and brought home like pork. And while she is a fine enough actress to integrate that kind of wolfishness into her characterization, you can’t help thinking it would be nice if she could press some actual onstage, co-star flesh. After all, it’s not just a good line and good politics, but good playwriting advice as well, when Taylor has Richards say, near the end, “Why should your life be just about you?”",
  "bwwScore": 7,
  "contentTier": "complete",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Ave Bonar\n \n \n \n She’s back! And who hasn’t missed that scrappy, indefatigably optimistic Democrat with the famous hair?\n\nI don’t mean Annie, though she’s back too, warbling her millionth “Tomorrow” at the Palace. I mean Ann Richards: Texas pol, mesquite sage, world-champion Bush-skewerer. And although Richards — in the person of Holland Taylor — may not sing, she delivers something the belty orphan can’t: realpolitik laced with dirty jokes.\n\nAnn is the first of three one-woman bioplays arriving on Broadway this spring; we will soon see Bette Midler as Hollywood super-agent Sue Mengers, and Fiona Shaw as Holy Land supermom the Virgin Mary. Technically at least, Taylor, who met Richards once and wrote the part for herself in a kind of trance of respect after she died in 2006, has set herself the most difficult task of the three. For all most of us know, Mengers may have sounded just like Bette Midler, and Mary like Olive Oyl. But Ann’s voice and manner and way of maintaining a wily smile well past its sell-by date are vivid, even precious, memories for those who fell for her when she delivered the blistering keynote address at the 1988 Democratic Convention in Atlanta. (That’s where she entered immortality, or at least Bartlett’s, with her quip about George H. W. Bush’s being born with a silver foot in his mouth — a line wisely eschewed here.) Taylor gets the voice and everything else dead on. The physical and spiritual illusion is so masterful that when a huge portrait of the real Richards appears at one point, it feels like a wasted effort. It might be a mirror.\n\nBut as with any play purporting to retail historical fact, it’s worth asking whether Taylor’s script creates an accurate picture of the day-to-day facts of Richards’s life. In pre-opening publicity (Taylor has been touring and shaping the show since 2010), she clearly explains that much of the script is cooked, albeit from real ingredients. The title page notes that it is “based on writings of Ann Richards, interviews with her staff, friends and family, film records, news publications, anecdotes, and imagination.” There’s no exploding Mike Daisey problem here — the story enhancements aren’t lies. Every fabulous Texas locution (“I am as strong as mustard gas,” she tells Bill Clinton on the phone) is no doubt one she used, and every policy initiative or painful decision is one she actually made. The problem is that she didn’t make them all on the one afternoon that takes up most of the play’s two hours. Surely she sat there in the Texas governor’s office doing nothing for a few minutes? Or read silently to herself?\n\nWell, that would make a dull play, so Taylor is justified in her conflations, but they do introduce a dosage problem. You have to know your limit. (Richards was an alcoholic, and funny about it.) Especially when sober, she could be a bit much, as her beleaguered staff — here represented only by the pre-recorded offstage voice of Julie White — well knew. She’s a bit much here, too. In one sitting, in the concentrated form of a one-woman play, how much wit, color, and moral competence can you take? On the other hand, if the intense depiction of her work leads you to expect a similar approach to personal matters, you will often be disappointed. The failure of her marriage, for instance — possibly the result of her political ascendance, or possibly the result of her drinking — gets about twenty seconds. The biggest conflict with her four kids is over a game of charades.\n\nPerhaps Taylor couldn’t go there. (Richards’s family cooperated with her throughout the process.) Even so, the director, Benjamin Endsley Klein, might have forgone the cheesy echo effects, the inspirational soundtrack, the lambent spotlights-of-fate. This isn’t a political ad, and anyway, the audience is already sold. How could it not be? With no live foils onstage — another unavoidable condition of the genre — Taylor works the room relentlessly. Every laugh is procured and brought home like pork. And while she is a fine enough actress to integrate that kind of wolfishness into her characterization, you can’t help thinking it would be nice if she could press some actual onstage, co-star flesh. After all, it’s not just a good line and good politics, but good playwriting advice as well, when Taylor has Richards say, near the end, “Why should your life be just about you?”\n\nAnn is at the Vivian Beaumont Theatre.\n\nShow \n \n \n Leave a Comment\n \n\n Theater Review: ‘Ann’\n\n \n \n\n Things you buy through our links may earn Vox Media a commission.\n\nEditor’s Picks\n \n \n \n \n \n \n \n \n election 2024\n \n American Freak Show\n American Freak Show\n \n \n \n \n \n \n \n \n \n \n first person\n \n Looking for the Woman Who Made Us\n Looking for the Woman Who Made Us\n \n \n \n \n \n \n \n \n \n \n profile\n \n Therapy Daddy\n Therapy Daddy\n \n \n \n \n \n\n \n\n \n \n Sign In to Comment\n \n \n\n \n \n Most Popular\n \n\n \n \n \n \n Want Just Gymnastics? Here’s Your Schedule.\n \n \n \n \n \n \n Cinematrix No. 126: July 30, 2024\n \n \n \n \n \n \n You Finally Get to See Joe Goldberg’s End\n \n \n \n \n \n \n Da Vinci Would Have Loved the Olympics’ Controversial ‘Last Supper’\n \n \n \n \n \n \n Therapy Daddy \n \n \n \n \n\n \n \n \n \n Want Just Gymnastics? Here’s Your Schedule.\n \n \n \n \n \n \n Therapy Daddy \n \n \n \n \n \n \n House of the Dragon Recap: An Army of Bastards\n \n \n \n \n \n \n Cinematrix No. 126: July 30, 2024\n \n \n \n \n \n \n Below Deck Mediterranean Recap: She Said, She Said\n \n \n \n \n\n \n\n \n \n \n\n \n \n\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n\n \n \n Email\n \n \n\n \n \n You\\'ll receive the next newsletter in your inbox.\n \n \n *Sorry, there was a problem signing you up.",
  "isFullReview": true,
  "textWordCount": 900,
  "archivePath": "data/archives/reviews/ann-2013/vulture--jesse-green_2026-02-05.html",
  "textFetchedAt": "2026-02-05T01:27:30.348Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240731051338",
  "archiveOrgUrl": "http://web.archive.org/web/20240731051338/https://www.vulture.com/2013/03/theater-review-ann.html",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 900,
  "tierReason": "Full review text"
}