{
  "showId": "oedipus-2025",
  "outletId": "FMJ",
  "outlet": "Front Mezz Junkies",
  "criticName": "Ross",
  "url": "https://frontmezzjunkies.com/2025/11/19/oedipus-reborn-robert-icke-broadway/",
  "publishDate": "2025-11-19",
  "fullText": "November 19, 2025 November 19, 2025 ross &#8220;Oedipus&#8221; Reborn: Robert Icke’s Political Tragedy Lands with Shattering Force Mark Strong and Lesley Manville in OEDIPUS . Photo by Julieta Cervantes. The Broadway Theatre Review: Oedipus on Broadway By Ross The moment that Mark Strong&#8217;s handsome frame fills that massive opening screen, a sensation passes through Broadway&#8217;s Studio 54 Theatre. It&#8217;s impossible to ignore, as the political parallels fling themselves at us, from both sides, connecting our emotional and intellectual hearts to the production in an instant. We feel a particular thrill pulse through the theatre in those first filmed moments of Oedipus , Robert Icke’s massively intoxicating, Olivier Award-winning adaptation. But surprisingly, what struck me most this time around was how much of that charge forms in the stillness beside him, in the composed presence of Lesley Manville. I felt the same reverberation before, when I was lucky enough to see this production in London&#8217;s West End , where this sleek political thriller first grabbed me and didn&#8217;t let go. It&#8217;s an astonishing piece of work, one that has only deepened and darkened on its journey across the Atlantic. There is an utter brilliance in writer/director Icke’s reimagining that lives and descends in its simple, devastating clarity, just like he did with his phenomenally detailed The Doctor . But with his adaptation of Oedipus , it is in the way he takes on a myth that is so culturally over-familiar that we’ve practically grown immune to its horror. Yet somehow, he has restored its devastating power through precise storytelling and terrifying plausibility. In his creation, he has replaced a royal palace with an election night office. Press briefings in front of cameras now stand in for iconic proclamations. And most powerfully, as before, a stop-clock diligently counts down the minutes toward victory, and his doom. The prophecy, delivered magnificently by the twitching Teiresias (a strong Samuel Brewer, returning from the West End production), remains a thrilling and disturbing moment, as we engage with a prophet who seems to channel both mysticism and madness, with just enough lucidity to terrify. The interaction doesn’t feel ancient or distant; it feels like modern opposition research waiting to drop. The result is a contemporary political tragedy that pulsates with recognizable ambition, ego, and the terror of discovery that the story you’ve built your life around is, at its core, a lie. Mark Strong and Samuel Brewer in OEDIPUS . Photo by Julieta Cervantes. Mark Strong (Young Vic/West End/Broadway’s A View From the Bridge ), reprising his Olivier-nominated performance, remains utterly transfixing and intensely driven, shifting from caring to rage within seconds. Handled solidly with intention and charisma, his Oedipus stands tall, confident, and righteous, a true statesman built of intelligence and clarity. But what’s remarkable this time around is how his certainty now carries a faint shudder of something desperate beneath it, as if some part of him senses the underlying rot in the foundation long before he allows himself to acknowledge it. His unraveling isn’t a collapse; it’s a slow, tight erosion, and watching Strong chart that interior disintegration is devastating. Parallel to him, and often surpassing him in emotional precision, is the formidable Lesley Manville (Bristol Old Vic/BAM’s A Long Day’s Journey Into Night ), reprising her Olivier-winning turn as Jocasta. She is extraordinary to watch, as every gesture, every restraint, and every moment of careful recalibration feels richer and deeper than before. Her performance operates like the production’s moral frequency, vibrating with unknown dread long before the truth is revealed. And in fact, when that happens, the horror is never actually spoken out loud to each other. It is telegraphed by their stance and their stare. A pin could be heard dropping anywhere in that theatre as we watch her, and then him, put the disturbing pieces together. But saying it clearly aloud is something neither can actually do. Together, they create some of the most intelligent, emotionally exact acting and internal reckoning you’ll see on Broadway this year. Tony nominations are inevitable. Around them, the company knits the tragedy into a full and living world. John Carroll Lynch (&#8220; Fargo &#8220;) is a superb addition as Creon. He is measured, grounded, subtly compassionate in ways that complicate Oedipus’s paranoia and exasperate it. Jordan Scowen (BBC&#8217;s &#8220; Casualty &#8220;) and James Wilbraham (BBC&#8217;s &#8220; Rogue Heroes &#8220;) reprise their roles as Eteocles and Polyneices, bringing the same raw, volatile sibling chemistry that makes their scenes land with remarkable human weight. Olivia Reis (MCC’s Shit. Meet. Fan. ) as Antigone, new to the company, is especially gripping in her open-eyed and rebellious stance. She shivers with the...",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 85,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:06:08.473Z"
}
