{
  "showId": "oedipus-2025",
  "outletId": "new-york-magazine-vulture-sara-holdren",
  "outlet": "New York Magazine / Vulture (Sara Holdren)*",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/article/theater-review-robert-icke-sophocles-oedipus-broadway.html",
  "playbillVerdictUrl": "https://www.vulture.com/article/theater-review-robert-icke-sophocles-oedipus-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nMark Strong (at center) and the cast of Oedipus, at Studio 54.\n                  Photo: Julieta Cervantes\n              \n            \n              \n        Allow me a soapbox for a moment: Where in the contemporary American theater are our great female adapters of the classics? Of course, there are women directing the big canonical hits, here and in the U.K. and beyond, but that’s not my point. I’m talking about directors who, when they take on Shakespeare or Ibsen or, God help us, Lloyd Webber, generate as much fascination as the author with whom they’re grappling — artists whose personal signatures and distinctive interpretations, be they text-faithful or entirely rewritten, we await with hungry anticipation, wondering, What will she do with that? For years now here in the States, we’ve been visited by Ivo Van Hove and Thomas Ostermeier, Sam Mendes, Richard Jones, Simon Stone, and Jamie Lloyd. Homegrown, though our own tradition doesn’t quite produce the auteur in the same way, we’ve got Sam Gold, Bartlett Sher, Kenny Leon, and Jack O’Brien. When an edgy new celebrity-driven Shakespeare heads to Broadway, or when the Park Avenue Armory announces that a radical new version of Such and Such is making its North American premiere this fall and you should get your tickets now — those productions, 99 out of 100 times, belong to the same guys, over and over again.\n\nSome of those shows are fantastic; some are abysmal; some are just meh. The issue is that our fieldwide institutional imagination has stalled out somewhere. My theory is that, shamefully, there’s still a residue of discomfort over the idea of women as visionaries. Men create; women administrate. I’d be willing to bet that women direct far more new plays nationwide than they do big-budget takes on classics at major theaters. New plays require sensitivity, people-handling, collaborative dramaturgy — in a word, midwifery. Never mind that old plays require all those things too, and also that women, in what should be the most obvious statement you’ll read today, don’t just deliver other people’s babies.\n\nWhich is all by way of saying, Robert Icke’s Oedipus has arrived on Broadway. Icke both directs the old behemoths and remakes them. British, not yet 40, and a protégé of Michael Grandage as well as the first “Ibsen Artist in Residence” at Ivo Van Hove’s Toneelgroep Amsterdam, he’s best known for adaptations of the Greeks that are, essentially, whole-cloth contemporary writing. Characters still have names like Agamemnon and Polyneices, and they still murder each other insatiably, but they also tend to wear suits and sneakers, to live in worlds of mass media, psychiatry, and surveillance, and to talk in a wordy, post-Freudian, deeply self-conscious modern vernacular. Icke’s scripts are full of slashes that mark interruptions, or brackets that indicate things an actor is supposed to imply but not say. Like this:\n\n’Killed by his wife.’ Not a person. Not a murderer. A woman. Because we love a female criminal, that strength a transgression, carnal, sexier or some[thing], the stronger weaker vessel or [whatever] — but this is not the world. Not now. The lights are on. Your houses have drawers full of knives. It’s not biology, not destiny, it’s just — balance, the law of moral appetite, the inevitable act that follows when when — he killed our daughter.\n\nThat’s Klytemnestra in Icke’s take on Aeschylus’s original happy-family trilogy, the Oresteia, after she’s killed her husband. It’s also a small part of why it’s worth having the conversation about men, women, and our reexaminations of the Big Old Plays. When it comes to the women in his Hellen-esque tragedies, Icke overcompensates. He gives them long speeches and he signals broadly to make sure his audiences know that he knows that being a woman is hard, that bad things happen to women, like rape and abuse and our husbands killing our children and men wanting us to be sexy even when we’re trying to murder them and so on. In this Oedipus — premiered in Dutch at Toneelgroep and then remounted in the West End with its current stars, Lesley Manville and Mark Strong, as the fated mother-and-son/wife-and-husband at its center — Icke puts an 11th-hour monologue roughly the size and weight of a city bus in Jocasta’s mouth. It’s where we learn her story in all its graphic detail, and though Manville is one hell of an actor — utterly at ease in one moment, ferocious in the next, destroyed in the one after that — even she can’t quite mask the overwriting, the authorial frisson over putting this character through really bad things, but, you know, in order to demonstrate that they’re really bad.\n\nIt’s a shame, because this Oedipus, when it tries a little less hard, is also full of potency. Manville and Strong crackle together — their chemistry is steamy and genuine and, in some of the production’s best moments, after all terrible secrets have been revealed, so is their body-wracking devastation. These heights arrive at the crux of the breakless two-hour play, after Oedipus (Strong) has been engaged in his bullheaded pursuit of the truth for some time. (“Your honesty fetish is going to pull everything apart,” snarls one of his allies.) Here, Sophocles’s king is figured as a people’s politician, holed up at his campaign headquarters on election night with his family and key staff, awaiting news of what’s sure to be his landslide victory. (Elected to what? Icke never likes to get down to terms, but the implication is president or prime minister, with more than a splash of supreme leader.)\n\nThe basic facts are still the same: Jocasta was, decades ago, married to the former leader Laius, now dead; now she’s married, extremely happily, to Oedipus. They’ve got several kids — Antigone (Olivia Reis) and the twins Eteocles (Jordan Scowen) and Polyneices (James Wilbraham). Icke has dispensed with poor Ismene, a seemingly small but telling gesture. Here, Jocasta’s brother, Creon (John Carroll Lynch), is Oedipus’s top adviser and speechwriter, constantly stressed by the charismatic candidate’s tendency to go off book. Icke begins the show with a press interview pre-recorded on a city street, where Strong gets to radiate calm confidence and manly progressivism: “The civic body is ill,” he tells the cameras. “While we were sleeping, while we were staring into our palms, they deliberately dragged us … backwards until rumors and lies were the same thing as truth.” In a pair of unplanned promises to the cheering populace, he pledges to reopen the investigation into the suspicious death of Laius and, since “my opponent loves the idea this country isn’t my country,” to release his birth certificate.\n\nSuch devices, meant to remind us that the Greeks still resonate, have a way of teetering right on the line between actually clever and too pat. “I have four children,” Jocasta jokes when her husband is being unruly, “two at 20, one at 23, and one at 52.” Later, she moans, “Ohh baby, baby,” as Oedipus ducks underneath her skirt for some private time. Icke isn’t opposed to low-hanging fruit. He’s at his most labored when he’s checking boxes, like having the kids supply exposition around the table Jocasta has set up for a celebratory meal. “Dad,” groans Eteocles as his father starts to wax rapturous about his mother, “if this is heading towards the story of how you two first met and how you were speaking in front of a tiny crowd …” Polyneices cuts in: “Mum talked to you, and from the first hello, you both just knew …” This kind of Weasley-brothers ribbing as a way of providing backstory isn’t particularly elegant. Nor are Antigone’s surly interruptions: “And one that died,” she drops in callously but also conveniently after Jocasta enumerates her kids. Icke is better when he lets some mystery back into the room. “I don’t believe in gods, I don’t think,” says Antigone later, talking to the woman she thinks is her grandmother, Merope (Anne Reid, whose unsentimental, existentially exhausted working-class matron gains in power over the course of the show). “Makes no difference whether you believe in them or not. Just because you don’t see it, doesn’t mean it isn’t happening,” Merope replies bluntly. It’s a brief moment, but it’s enough to open a necessary window onto the dark cosmos.\n\nLikewise, Teagle F. Bougere makes a striking appearance late in the play as the stranger who brings the final piece of evidence — here, the chauffeur who was driving the car Laius died in when it was hit by a reckless speeding teenager (our tragic hero, of course). Bougere enters the stage on cat-light feet, holding himself with equal parts dignity and suspicion: He’s in danger around all these power players, just a servant who probably signed multiple NDAs, but unlike them, he has no secret shame consuming his core. He talks quietly, blinking little, and exits like a ghost, staring at Strong’s Oedipus for just a few beats too long. The scene is a marvelous tension builder in the absolute granddaddy of “we already know what’s going to happen” plays.\n\nSo is a countdown clock that has been silently running in the background since the start of the show, ostensibly displaying the remaining minutes till the election results are declared. Icke loves a countdown clock (he also employs one, less effectively, in his Oresteia), but here the device works, especially as the digits approach zero. Those last awful moments of anagnorisis, as Manville and Strong expertly time their performances to the diminishing seconds, are legitimately stomach-turning. In an inspired twist, Icke also builds in a final tortured scene of intimacy after the characters know the truth. Here the abyss of the play opens up fully, and Strong and Manville — in her case, literally — drag themselves into it. It’s a stunning closer. Somewhere out there, Sophocles must be gratified: Oh yeah, still got it.\n\nOedipus is at Studio 54 through February 8.\n\nShow \n      \n    \n    Comment\n  \n\n\n\n      I’m a Cool Mom: Robert Icke Does Oedipus\n\n\n\n    \n      \n        \n  \n\n\n      \n      \n      \n        \n  \n\n\n      \n    \n\n  \n  \n\n\n\n  \n\n\n\n        Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1684,
  "archivePath": "data/archives/reviews/oedipus/new-york-magazine-vulture-sara-holdren--sara-holdren_2026-02-01.html",
  "textFetchedAt": "2026-02-01T14:56:05.880Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251218194300",
  "archiveOrgUrl": "http://web.archive.org/web/20251218194300/https://www.vulture.com/article/theater-review-robert-icke-sophocles-oedipus-broadway.html"
}
