{
  "showId": "oedipus-2025",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theaterscene.net/plays/broadway-plays/oedipus/victor-gluck/",
  "publishDate": null,
  "fullText": "Posted on December 14, 2025 by Victor Gluck, Editor-in-Chief in Broadway, Plays, Still Open Mark Strong as Oedipus and Lesley Manville as Jocasta in a scene from Robert Icke’s version of “Oedipus” after Sophocles at Studio 54 (Photo credit: Julieta Cervantes) Robert Icke has a superb way with making old plays new as demonstrated in his productions of The Oresteia, Hamlet and his adaptation of Schnitzler’s Professor Bernhardi (in his update simply called The Doctor) to reach the Park Avenue Armory. He is able to both update these plays of an earlier era as well as make them accessible and relevant for contemporary audiences. Now he has attempted the same feat with Sophocles’ Oedipus the King, often named the world’s greatest play, and the results are thrilling. With a remarkable cast led by Mark Strong (Ivo van Hove’s A View from the Bridge) and Lesley Manville (Long Day’s Journey into Night, Phantom Thread, Magpie Murders and Mrs. Harris Goes to Paris) the play (over two thousand years old) looks and sounds brand new, a study in politics and power and what we expect from our leaders. Icke’s version avoids the religious and ethical themes of the original but instead makes it a riveting thriller as the tension rises to almost unbearable heights – even if you know the outcome of this classic tale. In rearranging the story and telling it differently, Icke gives us the hope against hope that this time it will turn out differently. Set on the night of a political election in an unnamed country, Oedipus is first seen on video making a speech to reporters and the populace. He is not yet the ruler but a shoo-in to be elected on this night. However, he makes two promises that will lead to his downfall but he doesn’t know it yet; he will release his birth certificate and he will investigate the death of Laius, a previous leader and the previous husband of his wife Jocasta. Anne Reid as Merope and Olivia Reis as Antigone in a scene from Robert Icke’s version of “Oedipus” after Sophocles at Studio 54 (Photo credit: Julieta Cervantes) Back at his rented campaign headquarters, a now bustling room as it is being dismantled, his elderly mother Merope arrives from the country to tell him something important (in Sophocles’ version related by the Shepherd) but he assumes that she has come for the victory party and he puts her off temporarily. Creon, his wife’s brother and here also his campaign manager, tells him what a mistake it was to go off script and promise to release his birth certificate and re-open the death of Laius, but Oedipus insists he wants transparency before taking up the reins of government. With that Teiresias, a young blind revolutionary, breaks in to give Oedipus a warning that he says is already too late: that Oedipus is the killer of Laius that he seeks and that he will find out that he is his father’s killer and his mother’s lover, which Oedipus rejects out of hand believing Merope and Polybus (who is on his death bed) to be his parents. Just before Oedipus’ three college-age children arrive (daughter Antigone, and sons Eteocles and Polyneices, daughter Ismene has been eliminated here), he accuses Creon of having smuggled Teiresias into his presence as he was jealous and wanted to win the election himself though his name is not on the ballot. After the family dinner which includes Merope (but not the disgraced Creon) and at which various secrets of the children are revealed, Jocasta and Creon reveal to Oedipus that they have known all along that there was a cover up as to the death of Laius – he did not have a heart attack but was killed in a car crash at the crossroads. Could it be the same accident that Oedipus was involved in 30 years ago? And when Merope (not a messenger as in Sophocles) is finally allowed to confide to Oedipus that she and her husband could not have children and he was adopted, Jocasta begins to put the pieces together. The Cast of Robert Icke’s version of “Oedipus” after Sophocles at Studio 54 (Photo credit: Julieta Cervantes) If you know the original story, much of the dialogue is quite ironic, some lines from Sophocles, others written by Icke himself: early on Oedipus declares to Teiresias “I know who I am!” which of course he doesn’t, and when Merope later tells him he was adopted he cries “I don’t know who I am.” Some are more pointed: at the dinner table Jocasta castigates her daughter Antigone with “He’s your father, not your brother. For God’s sake speak to him with some respect.” (But of course he is not just her father.) About half way through the evening when alone, Oedipus and Jocasta begin to have sex and she says “ooh baby boy,” not yet realizing how ironic that will prove to be, though she is well aware of the age difference between them. Icke also has added a time clock in full view which counts down the one hour and 50 minutes of play both to the results of the election and the solution to the mystery surrounding Oedipus’s birth and the death of Laius. He has also grafted on a backstory of the marriage of Laius and Jocasta which is directly out of the #MeToo generation and gives Jocasta a much richer life story than in Sophocles. It also explains the age difference between Jocasta and her first husband. Mark Strong as Oedipus and Samuel Brewer as Teiresias in a scene from Robert Icke’s version of “Oedipus” after Sophocles at Studio 54 (Photo credit: Julieta Cervantes) As in Broadway’s 2015 A View from the Bridge, Strong is bigger than life, arrogant and seemingly self-righteous, the perfect personality for a terrible fall from grace. Manville who was terrific as Mary Tyrone in Sir Richard Eyre’s Long Day’s Journey into Night at the Brooklyn Academy of Music in 2017 again gives a searing, layered performance as she tries to stop Oedipus from asking all the right questions which will lead to truths they do not want to know. As the unusually unseen Merope, Anne Reid (known to American audiences from Public Television’s Last Tango in Halifax and Jane Austen’s Sanditon) is crotchety, conservative and easily shocked as she tries to keep her grandchildren from making inappropriate modern remarks. John Carroll Lynch as the efficient Creon is man who is a consummate bureaucrat who is frustrated by doing his job correctly. As the blind seer Teiresias usually played by an elderly actor in Sophocles, the younger Samuel Brewer is calm, collected and frighteningly assured. As Laius’ driver, Teagle F. Bougere is reverential, modest and solemn. The setting by Hildegard Bechtler who has worked with Icke on all his productions that have been staged at the Park Avenue Armory has created an off white box of a set with vertical Venetian blinds, floor-to-ceiling walls that swing open as doors, and a red-orange rug which is the perfect office environment for this political tragedy. In the course of the evening, the set is completely stripped of its furniture, symbolizing what is also happening to Oedipus. Wojciech Dziedzic has created contemporary costumes that make the characters look like ordinary people, not like royals or aristocrats, and easier to identify with. Natasha Chivers’ subtle lighting grows darker as the evening approaches its terrible revelation, and then in a new, added coda as flashback goes suddenly bright again. Tal Yarden’s video design for the news reports looks exactly like the real thing. John Carroll Lynch as Creon in a scene from Robert Icke’s version of “Oedipus” after Sophocles at Studio 54 (Photo credit: Julieta Cervantes) Robert Icke has made the old play Oedipus new again without sacrificing too much of the original and by finding modern equivalents to substitute. Performed by a superb cast led by British stage stars Mark Strong and Lesley Manville, this is one classic you can easily follow even if you do not know the story or the original play. Not only has the language been made contemporary but also relevant to our time as Oedipus talks of releasing his birth certificate as did Barack Obama and that “Lies have consequences,” something the current administration has not found out as of yet. Oedipus (through February 8, 2026) Roundabout Theatre Company & Internationaal Theater Amsterdam Studio 54, 254 W. 54th Street, in Manhattan For tickets, call 833-274-8497 or visit http://www.oedipustheplay.com Running time: two hours and five minutes without an intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1430,
  "archivePath": "data/archives/reviews/oedipus-2025/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:45:24.822Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}