{
  "showId": "oedipus-2025",
  "outletId": "theater-scene",
  "outlet": "Theater Scene",
  "criticName": "Deirdre Donovan",
  "url": "https://theaterscene.com/reviews/oedipus/",
  "publishDate": null,
  "fullText": "Mark Strong, Lesley Manville (Photo: Julieta Cervantes) Robert Icke’s Olivier Award–winning Oedipus arrives on Broadway as a sleek, nerve-jangling thriller, propelled by Mark Strong and Lesley Manville reprising their celebrated West End roles. Set on a tense national election night where every revelation threatens to upend the future, this electrifying adaptation thrusts Sophocles’ tragedy into an urgent modern arena where destiny collides with power, ambition, and truth. Icke has retooled Sophocles’ play for our times. Instead of ancient Thebes in the heroic age, he situates the drama in an unnamed contemporary country on election night, with polls predicting a landslide victory for Oedipus. What was once a mythic palace court becomes a political battleground charged with media frenzy, public scrutiny, and the pressure of absolute transparency. Hildegard Bechtler’s set design is arresting. As the lights come up, we are plunged into the nerve center of a modern political campaign—phones ringing, printers spitting out documents, screens cycling through relentless news updates. Oedipus’ face looms on a massive monitor while a digital countdown clock in the corner ticks away each hour, minute, and second. Onscreen, Oedipus delivers a final, impromptu address at an election night rally, making two pivotal promises: first, to release his birth certificate (“We’re going to release my birth certificate later tonight.”), and second, if elected, to reopen the investigation into the death of former leader Laius (“If I am [Laius’ successor], I’ll open the investigation into Laius’ death and I will lead it myself, on public record.”). The huge screen—part of Tal Yarden’s sharp video design—then rises to reveal Oedipus reentering campaign headquarters, where his aging mother Merope has arrived for an urgent conversation and his magnetic wife Jocasta readies herself to celebrate their predicted victory. Cast of Oedipus (Photo: Julieta Cervantes) The acting is the ace of the production. Mark Strong delivers a taut, psychologically layered performance as a savvy politician, devoted husband, and anxious father whose confidence frays scene by scene. Lesley Manville is superb as Jocasta, radiating both the mature authority (Jocasta is thirteen years older than Oedipus) and the sensual voltage the role demands. Among the supporting cast—many reprising their UK roles—there are several standouts. Samuel Brewer brings a chilling clarity to the truth-telling Teiresias. John Carroll Lynch, as strategist and brother-in-law Creon, blends arrogance with long-suffering patience. James Wilbraham and Jordan Scowen are excellent as Oedipus’ adult sons, Polyneices and Eteocles, especially in the family dinner scene where they refuse to divulge their own private lives while their parents freely expose theirs. “I think we have forgotten that Eteocles has cheated on his girlfriend,” Polyneices quips—only to be semi-outed himself when Oedipus teases, later toasts, his having a boyfriend (“I know that there is in fact a someone in your life… another young man”). Olivia Reis shines as Antigone, recast not as a divine-law loyalist but as a fiercely independent daughter. Anne Reid is pitch-perfect as Merope, the one person who holds the key to Oedipus’ shattering origin story. Anne Reid, Olivia Reis in Oedipus (Photo: Julieta Cervantes) Interestingly, Icke has radically reworked several elements of the original tragedy. The fateful altercation at the crossroads becomes a car crash—mundane, contemporary, and all the more chilling for its plausibility. He also shifts the dramatic weight toward Jocasta, giving her internal conflict greater space and allowing us to witness, in real time, the emotional unravelling that accompanies each new revelation. The addition of Oedipus’ adoptive mother, Merope (she remains off stage in Sophocles’ Oedipus Rex), further deepens the family’s psychological terrain, adding layers of history and tension. Purists may bristle at such departures, but Icke’s reframing feels aligned with modern sensibilities: Oedipus’ decision to publicly pursue the truth about his origins and the fatal crash that killed Laius preserves the core of Sophocles’ tale, even as it casts the tragedy in the unforgiving glare of political life today. Ultimately, Icke’s Oedipus succeeds not because it modernizes Sophocles, but because it reveals how little modernization is required for the story to sting. In a world saturated with political spin, data leaks, and public reckonings, the tragedy lands with unnerving immediacy: a man determined to control the narrative discovers that truth is the one force he cannot outmaneuver. Anchored by Mark Strong and Lesley Manville’s riveting performances and driven by Icke’s razor-edged vision, this Oedipus becomes less a revival than a stark reminder that the past—once unearthed—can still detonate the present. Running time: 2 hours with no intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Robert Icke retools Sophocles’ Oedipus Rex.\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "rejectedAt": "2026-02-04T09:54:40.770Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is just a headline and teaser text ('Read more'), not actual review content with any evaluation or opinion.; openai: The text provided is not a review but rather a brief mention of the production without any evaluative content.; gemini: The provided text is just a title and a 'read more' link, not a review with evaluative content.; kimi: The provided text contains only a descriptive statement about the production ('Robert Icke retools Sophocles' Oedipus Rex') with no evaluative content, opinion, or recommendation. It is not a review excerpt but rather a plot/production description.",
  "promptVersion": "5.2.0",
  "textWordCount": 741,
  "archivePath": "data/archives/reviews/oedipus-2025/theater-scene--deirdre-donovan_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:58:56.846Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 741,
  "tierReason": "Full review text"
}