{
  "showId": "oedipus-2025",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/article/theater-review-robert-icke-sophocles-oedipus-broadway.html",
  "publishDate": "November 14, 2025",
  "fullText": "It’s where we learn her story in all its graphic detail, and though Manville is one hell of an actor—utterly at ease in one moment, ferocious in the next, destroyed in the one after that—even she can’t quite mask the overwriting, the authorial frisson over putting this character through really bad things, but, you know, in order to demonstrate that they’re really bad. It’s a shame, because this Oedipus, when it tries a little less hard, is also full of potency. Manville and Strong crackle together — their chemistry is steamy and genuine and, in some of the production’s best moments, after all terrible secrets have been revealed, so is their body-wracking devastation.",
  "isFullReview": false,
  "dtliExcerpt": "It’s a shame, because this Oedipus, when it tries a little less hard, is also full of potency. Manville and Strong crackle together — their chemistry is steamy and genuine and, in some of the production’s best moments, after all terrible secrets have been revealed, so is their body-wracking devastation. These heights arrive at the crux of the breakless two-hour play, after Oedipus (Strong) has been engaged in his bullheaded pursuit of the truth for some time. (“Your honesty fetish is going to pull everything apart,” snarls one of his allies.) Here, Sophocles’s king is figured as a people’s politician, holed up at his campaign headquarters on election night with his family and key staff, awaiting news of what’s sure to be his landslide victory. (Elected to what? Icke never likes to get down to terms, but the implication is president or prime minister, with more than a splash of supreme leader.)",
  "showScoreExcerpt": "\"Manville and Strong crackle together â their chemistry is steamy and genuine and, in some of the productionâs best moments, after all terrible secrets have been revealed, so is their body-wracking devastation.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Mark-Strong-and-Lesley-Manville-Star-in-OEDIPUS-on-Broadway-20251113",
  "dtliThumb": "Meh",
  "bwwExcerpt": "It’s a shame, because this Oedipus, when it tries a little less hard, is also full of potency. Manville and Strong crackle together — their chemistry is steamy and genuine and, in some of the production’s best moments, after all terrible secrets have been revealed, so is their body-wracking devastat..."
}
