{
  "showId": "oedipus-2025",
  "outletId": "WRAP",
  "outlet": "The Wrap",
  "criticName": "Robert Hofler",
  "url": "https://www.thewrap.com/oedipus-broadway-review-mark-strong-lesley-manville/",
  "publishDate": "2025-11-13",
  "fullText": "&#8216;Oedipus&#8217; Broadway Review: Mark Strong and Lesley Manville Make the Same Old Mistakes A prestige theatrical event from London turns out to be more parody than tragedy Robert Hofler November 13, 2025 @ 9:00 PM Share on Social Media Share on Facebook Share on X (formerly Twitter) Share on LinkedIn Share on Email Mark Strong and Lesley Manville in \"Oedipus\" on Broadway (Julieta Cervantes) Maybe they should just call it “Eddie.” Playwright-director Robert Icke drops the “rex” in Sophocles&#8217; “Oedipus Rex” because he sets the tragedy in the contemporary world where the title character is running to be prime minister of the U.K. That country and that political office are not mentioned, but a short film that kicks off Icke’s two-hour play makes it clear that the politician Oedipus is running for highest office in what very much looks like London. And, of course, there are the British accents so adored by Broadway theatergoers. “Oedipus” opened Thursday at Studio 54 after an Olivier Award-winning run on the West End. Besides the update from Thebes, Icke’s biggest change is not having Oedipus (Mark Strong) murder Laius, his birth-father, out of road rage. It’s now a car accident, making the new Oedipus a victim of circumstances, which is melodrama, not tragedy. Granted, the Sophocles tragedy is a story of how you can’t mess with fate, but Oedipus needs to have some responsibility for what happens. Icke’s story makes more sense being set in the United States, since the playwright has lifted so many all-American tales. Think Barack Obama when this Oedipus promises to release his birth certificate. Think Jeffrey Epstein when Jocasta ( Lesley Manville ) recalls being raped at age 13 by Laius, who, as it turns out, was a serial child trafficker. The biggest pleasure of this prestige production is watching how Icke pastes these modern references onto a classic story. It&#8217;s often fun to watch, but never more than clever. Icke also panders to one of the theater’s largest demos by having one of Jocasta and Oedipus’ sons, Polyneices (James Wilbraham), be outed by his brother, Eteocles (Jordan Scowen), at a family dinner. Because he’s such a wonderful father, Oedipus reassures Polyneices of his love and support by delivering a speech written by someone at PFLAG. Beyond Sophocles, Icke’s sources aren’t so classic. Oedipus’ adoptive mother, Merope (Anne Reid), reveals to her granddaughter, Antigone (Olivia Reis), how her husband, Polybus, had an extramarital affair. The dialogue is right out of Clare Boothe Luce’s “The Women.” There’s also Jocasta’s confession about being raped by Laius. A similar speech in “Butterfly 8” helped to win Elizabeth Taylor her first Oscar. Actually, the monologue in that 1959 potboiler is far tougher, because Taylor’s character not only speaks of being sexually molested when she was 13 years old (just like Manville’s Jocasta) but that “I loved it!” Which recalls the moral difference between Oedipus murdering Laius and that death being a mere car accident. In the end, Ickes&#8217; updating turns the Sophocles classic into a parody. After all the secrets of incest, birth, murder and infidelity have been revealed, Oedipus tells Jocasta, &#8220;I think I&#8217;ve disappointed you.&#8221; Ya think? Icke’s direction puts a big digital clock on stage so that we can countdown the prophecy of Teiresias (Samuel Brewer) as it comes true in real time. If nothing else, Icke respects the three unities of Greek drama. Strong makes for a strong, sexy, charismatic politician. His Oedipus would definitely be a vote magnet after he replaces “Oedipus” with “Go Ed, Go!” on all those T-shirts. Manville disappoints. Except for her big Liz Taylor moment, her vocally weak Jocasta recedes into Hildegard Bechtler’s set design of a campaign office-suite. The Oedipus political machine has a real money-flow problem, apparently. Despite it being election night, various muscle men appear on stage to remove the rented office furniture. They can’t wait until the election results are announced? A nice touch is how Oedipus pokes out his eyes in this production. Sophocles has his title character use pins from Jocasta’s brooch. Icke definitely improves on Sophocles there. Read Next &#039;The Queen of Versailles&#039; Broadway Review: Kristin Chenoweth and Stephen Schwartz Reunite for a MAGA Musical Nightmare Sign Up to Breaking News. Daily updates of the most vital industry news in Hollywood. Email (required) By clicking Sign Up, you agree to receive emails from TheWrap. You can unsubscribe at any time Sign Up Now Robert Hofler Robert Hofler is the Theater Critic at TheWrap, writing reviews about Broadway and Off Broadway shows. He is an author of several books on the entertainment industry, including &#8220;The Man Who Invented Rock Hudson&#8221; and &#8220;Money, Murder, and Dominick Dunne.&#8221; Hofler was previously an editor at Variety and Life magazine, among other publications. if (window.matchMedia(\"(min-wid...",
  "originalScore": null,
  "assignedScore": 42,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:06:53.056Z"
}