{
  "showId": "hamlet-2009",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_News/Review-Hamlet-at-the-Armory/6537",
  "playbillVerdictUrl": "https://cititour.com/NYC_News/Review-Hamlet-at-the-Armory/6537",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Review: Hamlet at the Armory July 1, 2022, 1:13.17 am ET Things are still rotten in the state of Denmark, but in Robert Icke’s cleverly updated version of William Shakespeare’s “Hamlet,” now at the Park Avenue Armory, the castle’s interior resembles the chicest lounge in town; its exterior is monitored by a sophisticated video system; the unhappy prince carries a gun instead of a dagger; Ophelia displays more than a bit of cleavage; and – oh yes – Guildenstern is a woman. It’s still a tragedy, but it’s also a bit of a happening. Continue Reading Bernadette Peters and Sutton Foster to Host Broadway Barks Cititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": false,
  "textWordCount": 141,
  "archivePath": "data/archives/reviews/hamlet-2009/cititour--brian-scott-lipton_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:49:36.657Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "paywall_or_login_prompt"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 141 (min: 300)"
  ],
  "contentTier": "needs-rescrape",
  "wordCount": 141,
  "tierReason": "Truncation detected: paywall_or_login_prompt",
  "rejectedAt": "2026-02-07T05:03:00.829Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be a website navigation page or content preview rather than a complete review - it contains promotional text about Cititour.com and other unrelated content mixed with what seems to be a review fragment.; openai: The review is about a production of Hamlet at the Park Avenue Armory, not a current Broadway run.; kimi: This review covers Robert Icke's 'Hamlet' at the Park Avenue Armory in July 2022. The Park Avenue Armory is not a Broadway theater, and this is a previous Off-Broadway/special venue production, not a current Broadway run.",
  "promptVersion": "5.2.0"
}
