{
  "showId": "hamlet-2009",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2009/10/07/theater/reviews/07hamlet.html",
  "publishDate": "October 6, 2009",
  "fullText": "https://www.nytimes.com/2009/10/07/theater/reviews/07hamlet.htmlShare full articleAdvertisement\n\nIf vigor were all in acting Shakespeare, Jude Law would be a gold medal Hamlet. Playing the doomed Prince of Denmark in the barnstorming production that opened on Tuesday night at the Broadhurst Theater, directed by Michael Grandage, Mr. Law approaches his role with the focus, determination and adrenaline level of an Olympic track competitor staring down an endless line of hurdles.\n\nHold your breath, sports fans! Here’s Mr. Law, lithe and taut, bracing himself for that first tricky soliloquy, “O that this too too solid flesh would melt.” No melting here. Mr. Law, gesturing and enunciating violently, nails the speech with the attack of an electric hammer. But can he keep it up for “O what a rogue and peasant slave am I” and “To be or not to be” and “Alas, poor Yorick”? Yes, he can, bringing the same athletic gusto and no trace of fatigue (or modulation) to each and every one.\n\nPeople who ask for a little introspection from the man whose name is a byword for that activity may find it perplexing that this Hamlet never seems to look inward, which means that he never grows up  or grows, period. When Mr. Law’s hyperkinetic Dane announces early that “I have that within which passeth show,” it is a promise that will not be fulfilled.\n\nMr. Law, a rakish leading man of film, doesn’t disappear onstage the way some screen stars do. Though small-boned and delicately featured, he fills the theater to the saturation point. But the finer shades of feeling that a movie camera has been known to extract from his face  most notably in his Oscar-nominated performance in “The Talented Mr. Ripley” (1999)  are rarely in evidence here.\n\nHis Hamlet  which has only increased in intensity, if not in depth, since I saw it in London last summer  is, above all, an externalizer, never shy about acting out his inner conflicts and acting on his instincts. It is hard to understand the distress of Hamlet’s friends and family when he feigns madness, since the prince, in this case, appears to be as he always was: sarcastic, contemptuous, quick-witted and mad only in the sense of being really, really angry.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Mr. Law brings a refreshing sanity to a role that is often treated as a tour de force for neurotic exhibitionism. His Hamlet is tortured, yes, but he's not a show-off about it.",
  "originalScore": null,
  "assignedScore": 58,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mr. Law brings a refreshing sanity to a role that is often treated as a tour de force for neurotic exhibitionism. His Hamlet is tortured, yes, but he's not a show-off about it.",
  "contentTier": "complete",
  "contentTierReason": "Short text (33 words)",
  "textQuality": "full",
  "sources": [
    "web-search"
  ],
  "textWordCount": 397,
  "archivePath": "data/archives/reviews/hamlet-2009/nytimes--ben-brantley_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:14:08.294Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250326015118",
  "archiveOrgUrl": "http://web.archive.org/web/20250326015118/https://www.nytimes.com/2009/10/07/theater/reviews/07hamlet.html",
  "wordCount": 397,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-04T01:09:30.474Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be an incomplete excerpt that cuts off mid-review and ends with a technical error message about retrieving content, making it impossible to determine the critic's overall verdict.; openai: The review is about a 2009 production of Hamlet, not a current Broadway run.",
  "promptVersion": "5.2.0"
}
