{
  "showId": "hamlet-2009",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2009/legit/reviews/hamlet-1200476291/",
  "publishDate": "October 7, 2009",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Law brings a welcome sense of urgency and psychological complexity to the role, making this a Hamlet worth seeing despite some uneven elements in the production.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Law brings a welcome sense of urgency and psychological complexity to the role, making this a Hamlet worth seeing despite some uneven elements in the production.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 409,
  "archivePath": "data/archives/reviews/hamlet-2009/variety--charles-isherwood_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:14:41.182Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Sep 10, 2009 7:06pm PT \n\n \n\n \n \n \n\n \n\n \n You Might as Well Live\n \n \n\n \n\n A Napoleonesque (as in \"Dynamite\") tale of comic loserdom with a distinctly Canadian flavor.\n\nA Napoleonesque (as in “Dynamite”) tale of comic loserdom with a distinctly Canadian flavor, “You Might as Well Live” reps a promising first-feature collaboration for director Simon Ennis and co-writer/star Joshua Peace. While it’s seldom uproarious, there’s steady amusement in the luckless protag’s rise from universally proclaimed “biggest douchebag” to … well, anything would be an improvement. HD-shot pic, which opened Sept. 4 in Toronto, is a tad slender as theatrical fare but should win fans and offshore sales as an ancillary item.\n\nCorrectly convinced that almost everyone in the crappy town of Riverside (locations shot in Hamilton, Ontario) hates him, Robert Mutt (Peace) unsuccessfully attempts to commit suicide by jumping off a very, very low bridge, and is committed to the local asylum.Two years later, we see he’s earned some degree of self-esteem via competitive triumphs in such pursuits as pin-the-tail-on-the-raccoon. When he beats a new staff physician at air hockey, however, the sore loser pronounces him “cured” and chucks him out of the otherwise friendly institution. A still-hostile outside world is made even moreso by the fact that during his absence, nasty neighbor Mr. Steinke (Stephen McHattie) has blamed his own extensive computer collection of child porn on Robert — who has never touched a computer in his life.\n\n1/1\n\nSkip Ad\n \nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nThe resulting uproar chases the hapless hero from the house of his bedridden mom and aspiring-songbird sister (Kristin Fairlie) to the fetish-playpen manse of a TV weathercaster and, ultimately, the welcoming home of his Farm League baseball hero (Michael Madsen). A roller-disco interlude, as well as a tentative transvestite romance and preparatory bar mitzvah studies, are stopovers to appropriately catatonic happiness.\n\nThough it goes out farther on the gross-out limb in terms of unattractive nudity and drug-related humor than “Napoleon Dynamite” did, “You Might as Well Live” hews to that pic’s model in being more absurdist than crass or slapsticky, and caricaturing without being mean-spirited. Perfs rep a good mix of deadpan and over-the-top, with Peace creating an endearingly pathetic focal point.\n\nA couple of vintage Lee Hazelwood songs and one by Buck Owens are aptly deployed, though the soundtrack standout (duly reprised under closing credits) is “Stormy Blaze,” aka the sister’s hilariously heinous debut single. Production values are modest but nicely turned."
}