{
  "showId": "illinoise-2024",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani",
  "url": "https://www.broadwaynews.com/the-broadway-review-illinoise-is-a-rapturous-album-tenderly-brought-to-life/",
  "publishDate": "April 27, 2024",
  "fullText": "Director-choreographer Justin Peck’s unique dance-theater-concert hybrid is a commendable, imaginative rendering of Sufjan Stevens’ concept album. Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to the Broadway opening of “Illinoise.” The new Broadway production “Illinoise” draws inspiration from Sufjan Stevens’ near-eponymous 2005 concept album, “Illinois.” As that album blends genres, so here does director-choreographer and co-story author Justin Peck. “Illinoise” is a dance musical, a musical performance art piece, a theatrical indulgence. Though the work straddles two cities — Chicago and New York — and crackles with the sporty-casual aesthetic of the early aughts, Peck and his co-writer Jackie Sibblies Drury aren’t so much traversing specific settings as much as they are trying to evoke the higher-dimensional frequencies pulsing out of Stevens’ album. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": false,
  "dtliExcerpt": "Yet in all honesty, for all the obvious delight sprinkled over “Illionise,” it did not move me. It made me want to be moved though, which in a way, is its own sort of illumination.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "MEH",
  "dtliUrl": "https://didtheylikeit.com/shows/illinoise/",
  "needsScoring": true,
  "textWordCount": 148,
  "archivePath": "data/archives/reviews/illinoise-2024/broadway-news--brittani_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:58:41.354Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 148 (min: 300)"
  ]
}