{
  "showId": "illinoise-2024",
  "outletId": "digital-journal",
  "outlet": "Digital Journal",
  "criticName": "Markos Papadatos",
  "url": "https://www.digitaljournal.com/entertainment/review-illinoise-is-a-new-musical-on-broadway-directed-by-justin-peck/article",
  "playbillVerdictUrl": "https://www.digitaljournal.com/entertainment/review-illinoise-is-a-new-musical-on-broadway-directed-by-justin-peck/article",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "“Illinoise” is a new musical that premiered at the St. James Theatre on Broadway. “Illinoise” is a new musical that premiered at the St. James Theatre on Broadway. The production is inspired by Sufjan Stevens’ album “Illinois” and it features direction and choreography by Justin Peck. The musical’s story is by Peck and Pulitzer winner Jackie Sibblies Drury. It is set around a campfire as dancers, singers, and a live band lead audiences on an epic journey set to Stevens’ music, arranged by Timo Andres (who earned a Tony nomination for “Best Orchestrations”). Particularly impressive about this production is that it is told through live music performed by an 11-member band, three vocalists and dancers. As friends gather around a campfire, sharing stories of first love, grief and growing up, director and choreographer Justin Peck and Jackie Sibblies Drury craft a true musical and dancing experience that is filled with raw emotions, and it transports viewers to different realms. Strong performances led by Ricky Ubeda, Ben Cook, and Gaby Diaz, give this production its beating heart; moreover, everybody in the cast and the ensemble offers something unique to this musical. “Illinoise” received four 2024 Tony nominations, and rightfully so, including a nod for “Best Musical.” It will sustain the viewer’s attention for its entire 90-minute duration (with no intermission). Overall, “Illinoise” is an expressive new musical, which touches on such subjects as love, loss, and mystery through dance. It ought to be enjoyed for its beauty, melancholy, and simplicity. The choreography all around by Justin Peck is exquisite, and he also deserves to be commended for his direction in bringing this piece to life, which is gloriously empowering. The show starts out heartbreaking and then, evolves into a heartwarming production. This new musical is poignant, high-octane, and it garners 4.5 out of 5 stars. To learn more about “Illinoise,” check out its official homepage. Markos Papadatos is Digital Journal's Editor-at-Large for Music News. Papadatos is a Greek-American journalist and educator that has authored over 24,000 original articles over the past 19 years. He has interviewed some of the biggest names in music, entertainment, lifestyle, magic, and sports. He is an 18-time \"Best of Long Island\" winner, where for three consecutive years (2020, 2021, and 2022), he was honored as the \"Best Long Island Personality\" in Arts & Entertainment, an honor that has gone to Billy Joel six times. Actress Leila Collins (\"Anarchy Radio\") chatted about her inspirations as an actress, and being a part of the digital age. Alaska is the best state for a tech career, scoring 7.31 out of 10. Nvidia announced the plan in September to invest $100 billion in OpenAI. Actor Kristoffer Polaha chatted about his new film \"Missing the Boat,\" which premiered on Saturday, January 31st on Hallmark.",
  "isFullReview": true,
  "textWordCount": 463,
  "archivePath": "data/archives/reviews/illinoise-2024/digital-journal--markos-papadatos_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:44:09.180Z",
  "originalScore": "5/5",
  "originalScoreNormalized": 100,
  "scoreSource": "numeric-stars",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}