{
  "showId": "illinoise-2024",
  "outletId": "new-york-times",
  "outlet": "NEW YORK TIMES",
  "criticName": "Jesse",
  "url": "https://www.nytimes.com/2024/03/07/theater/illinoise-review-sufjan-stevens-justin-pick.html",
  "publishDate": "April 26, 2024",
  "fullText": "This is the review of the pre-Broadway staging of “Illinoise” that concluded its run at the Park Avenue Armory on March 23. The show has now transferred to Broadway’s St. James Theater, where it is scheduled to run through Aug. 10. The cast is unchanged except that Brandt Martinez is playing the role formerly played by Robbie Fairchild.\n\nWhen emotions get too big for speech, you sing; when too big even for song, you dance.\n\nOr so goes the standard theatrical formula. But what if the emotions are huge from the get-go?\n\nThat’s the challenge and, it turns out, the glory of “Illinoise,” a mysterious and deeply moving dance-musical hybrid based on Sufjan Stevens’s similarly named 2005 concept album. (The title has acquired an extra “e.”) Exploring the hot zone between childhood and adulthood, when emotions can be at their most overwhelming, the show dispenses with dialogue completely and leaps directly to movement and song.\n\nBut not together: Among a thousand other smart choices, Justin Peck (who directed and choreographed) and Jackie Sibblies Drury (who, with Peck, wrote the story) have delaminated the songs from the characters, thus avoiding the jukebox trap that diminishes both.\n\nInstead, in the show, which opened on Thursday at the Park Avenue Armory, Stevens’s wistful and sometimes enigmatic numbers, set in various Illinois locations, are performed by three vocalists on platforms high above the action, wearing butterfly wings as if to stay aloft. Below, the 12 acting dancers (or are they dancing actors?) perform a parallel story without being forced into overliteral connections.\n\nOr rather, they perform an anthology of stories, a kind of exquisite corpse of late adolescence. As they collect around a clump of lanterns that suggest an urban campfire — the poetic set, including upside-down trees, is by Adam Rigg — they engage in what seems to be a rite of passage: the sharing of deep truths with sympathetic friends. The truths are often traumas, of course: first love, first loss, first disillusionment, first death. They are “read” (that is, danced) from notebooks decorated, again, with butterflies, suggesting the privacy of cocoons and the fragility of emergence.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "But not together: Among a thousand other smart choices, Justin Peck (who directed and choreographed) and Jackie Sibblies Drury (who, with Peck, wrote the story) have delaminated the songs from the characters, thus avoiding the jukebox trap that diminishes both.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/illinoise/",
  "needsScoring": true,
  "textWordCount": 379,
  "archivePath": "data/archives/reviews/illinoise-2024/new-york-times--jesse_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:01:48.945Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250801015743",
  "archiveOrgUrl": "http://web.archive.org/web/20250801015743/https://www.nytimes.com/2024/03/07/theater/illinoise-review-sufjan-stevens-justin-pick.html"
}