{
  "showId": "illinoise-2024",
  "outletId": "theatermania",
  "outlet": "THEATERMANIA",
  "criticName": "David",
  "url": "https://www.theatermania.com/news/review-iillinoise-i-on-broadway-makes-audiences-hearts-dance-to-sufjan-stevens_1738430/",
  "publishDate": "April 26, 2024",
  "fullText": "Justin Peck&#8217;s folk ballet based on Stevens&#8217;s 2005 album Illinois opens at the St. James Theatre.\n\nIn a mostly dire season for musicals, the ones that actually have an imagination automatically stick out. They might not work all the way, but I&#8217;ll take a show that&#8217;s trying to do something over a chintzy production which has no discernible point of view. Justin Peck&#8217;s folk ballet Illinoise, an eleventh-hour entry into this Tony Awards race (so late that its first preview and opening night were the same 2pm Wednesday matinee), is perhaps the most original new musical of the past year. Reimagining Sufjan Stevens&#8217;s 2005 album Illinois into a tale of love, longing, zombies, and killer clowns, when Illinoise works, it works like gangbusters. And when it doesn&#8217;t, fear not; there&#8217;s still plenty of beauty to behold at the St. James Theatre.\n\nThe chief strength of Illinoise is its crystal-clear storytelling. Wordless save for Stevens&#8217;s dense lyrics (which are sung live by Elijah Lyons, Shara Nova, and Tasha Viets-VanLear, clad in Stevens&#8217; trademark butterfly wings), you can follow everything that&#8217;s going on, even in the weirder moments, which is a real feat for a dance show with no dialogue. The book itself, crafted by New York City Ballet resident artist Peck and Fairview Pulitzer winner Jackie Sibblies Drury, is structured around a group of friends on a hike in the woods who share entries from their journal around a campfire.\n\nPeck (who directs and choreographs) and Drury have somewhat rearranged the album tracks so the songs that don&#8217;t fit the eventual narrative arc are presented as standalones. Brandt Martinez is a dazzling Clark Kent/Superman in &#8220;The Man of Metropolis Steals Our Hearts.&#8221; In the simplest of theatrical touches, it&#8217;s thrilling how a gingham picnic blanket can become a cape flying through the sky without anyone leaving the stage floor. &#8220;They Are Night Zombies&#8221; finds dancer Jeanette Delgado haunted by the undead corpses of Andrew Jackson and Ronald Reagan, a semi-on-the-nose allusion to the hold that dead white men have on American mythology.\n\nThe biographical song about murderous pedophile clown John Wayne Gacy Jr. should have been cut between the Park Avenue Armory run and Broadway. It stops the show cold, and not in a good way, despite the best efforts of dancer Alejandro Vargas. Conversely, Byron Tittle&#8217;s &#8220;Jacksonville&#8221; tap routine is proof positive of dance&#8217;s expressiveness. Not merely a highlight of the show, it&#8217;s a highlight of the season.\n\nThe centerpiece of Illinoise is a coming-of-age love story. Henry (Ricky Ubeda) is in love with his BFF Carl (Ben Cook), who is in love with Shelby (Gaby Diaz). Carl and Henry embark on a cross-country road trip, ending up in New York when Carl is called home to visit the critically ill Shelby. Henry stays in New York and falls for Douglas (Ahmad Simmons), but still must process his feelings for the best friend who disappeared.\n\nUbeda and Cook have scintillating chemistry, and they wear as much emotion on their faces as they hold in their bodies. It&#8217;s no wonder they both received Outer Critics Circle Award nominations earlier in the week — without saying a word, you understand their whole journey in just the language of their movement.\n\nBut my mind did wander during this section of Illinoise. Unlike my colleague who reviewed the Park Avenue Armory staging last month, I preferred the short, clipped numbers in the first 45 minutes to the prolonged arc of the back half. I can&#8217;t fault the dancers, who become living works of art within Peck&#8217;s innately human choreography, where the tiniest of gestures become profound statements. His company of dancers are gorgeously in tune with not only the motives of their individual characters, but the super-objective of the piece as a whole.\n\nThe musical presentation is an undeniable highlight of the 90-minute production, with 14 band members playing nearly 30 instruments. Musical director Nathan Koci and his instrumentalists honor both Stevens&#8217;s haunting melodies, and orchestrator Timo Andres gives them an overwhelming symphonic feeling that one rarely experiences in a Broadway house. Garth MacAleavey&#8217;s crisp sound design (a little too light on the vocalists at the first performance, which will no doubt be adjusted) allows you to feel the bass in your chest, as thrilling a feeling as it gets for a music lover.\n\nPeck&#8217;s physical production is a synthesis of set (Adam Rigg) and lighting (Brandon Stirling Baker) that tells you exactly where to always look, while creating sculptures and images with shadows. I can&#8217;t quite figure out how Baker managed to create an indoor version of dusk so effectively simply by shining lights through hanging firtrees, but the effect is marvelous. Reid Bartelme and Harriet Jung&#8217;s athleisure costumes are equally resourceful.\n\nI&#8217;m not sure that the producers of Illinoise needed to rush to Broadway so quickly — especially since it doesn&#8217;t really seem like they fixed the various issues that other reviewers had with it — but with a free theater and a wide-open race for Best Musical, I get the thought process. Good luck to them.\n\nWhite. A Blank Page or Canvas. Or Is It? Art Proves Forever Fashionable in a Starry Broadway Revival                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: Roxana Ortega's Am I Roxie? Looks at the Burden of Caring for an Ill Parent                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: The Sound of Music Tours Again, Beautifully Relaunching at the Kennedy Center                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: In The Wild Duck, the Truth Doesn't Set Anyone Free                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: In Galas, Anthony Roth Costanzo Is the Greatest Diva                 \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            Color Theories, Julio Torres Explains Why You’re So Blue\">\n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: In Color Theories, Julio Torres Explains Why You’re So Blue                \n            \n        \n    \n\n                    \n\n            \n        \n\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n        \n            \n            \n            \n            \n            \n            Theater News & discounts\n                \n                    Get the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nThe Broadway and West End stars of the ABBA smash have a candid conversation.",
  "isFullReview": true,
  "dtliExcerpt": "Reimagining Sufjan Stevens’s 2005 album Illinois into a tale of love, longing, zombies, and killer clowns, when Illinoise works, it works like gangbusters. And when it doesn’t, fear not; there’s still plenty of beauty to behold at the St. James Theatre.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/illinoise/",
  "needsScoring": true,
  "textWordCount": 969,
  "archivePath": "data/archives/reviews/illinoise-2024/theatermania--david_2026-01-27.html",
  "textFetchedAt": "2026-01-27T15:05:08.404Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250917105548",
  "archiveOrgUrl": "http://web.archive.org/web/20250917105548/https://www.theatermania.com/news/review-iillinoise-i-on-broadway-makes-audiences-hearts-dance-to-sufjan-stevens_1738430/"
}