{
  "showId": "sondheim-on-sondheim-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://variety.com/2010/legit/reviews/sondheim-on-sondheim-1117942391/",
  "publishDate": "April 28, 2010",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "The evening is most successful when it focuses on the songs themselves, allowing Sondheim's sophisticated lyrics and intricate melodies to work their magic without excessive theatrical framing.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The evening is most successful when it focuses on the songs themselves, allowing Sondheim's sophisticated lyrics and intricate melodies to work their magic without excessive theatrical framing.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 622,
  "archivePath": "data/archives/reviews/sondheim-on-sondheim-2010/variety--charles-isherwood_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:14:44.633Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "wordCount": 622,
  "tierReason": "Full review text",
  "wrongFullText": "An American architect and Middle Eastern bureaucrat play out diplomacy's minuet.\n\nOur ongoing Iraq debacle — March 19 is the seventh anniversary — demands that artists devote their powers to explaining what the hell happened. David Hare’s “Stuff Happens” took up the investigative responsibility, and for a potent metaphor Howard Korder offers up the smoky cocktail of “In a Garden,” in which an American architect and Middle Eastern bureaucrat play out diplomacy’s minuet complicated by each side’s utter inability to understand the other. David Warren’s handsome South Coast Rep production never fails to stimulate, even if the dramatic impact is somewhat blunted by the play’s allegorical parameters.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nRepresenting America’s plain-speaking, can-do spirit is Andrew Hackett (Matt Letscher), a media-anointed “talent to watch” who can’t seem to get any of his designs built. Surely the oil-rich nation of Aqaat, whose reigning despot (a truly scary Jarion Monroe) is importing big-name architects, can find the bucks and will to fund one little commission.\n\nAndrew’s facilitator is his obstacle: Othman (Mark Harelik), the Western-educated minister of culture. An admirer of American cinema — “Dead Poets Society” is a particular favorite — Othman waxes enthusiastic for applying Andrew’s sensibilities to restore beauty to his scorched land. (The architectural alternative, a mass of constructivist concrete with a desert landscape beyond, wittily asserts itself in Christopher Barreca’s set.)\n\nAfter struggles to gain clarity on what exactly is envisioned as Andrew’s participation in the new Aqaat, a project is eventually decided upon: a modest summer house (or is it a gazebo?), nestled by the river surrounded by lemon trees.\n\nBut visit is followed by visit as months turn into years. Sketches are rejected without explanation and overtures rebuffed, the project going nowhere.\n\nOf course Aqaat is standing in for Iraq, complete with its Saddamesque “Brother Najid” and Kurd-like persecuted ethnic minority in the nation’s north. (The 30,000 refugees, Othman blandly explains, “are all visiting their relatives.”) And our protagonists — like the U.S. and Russian diplomats sharing Lee Blessing’s “A Walk in the Woods” — have more going on than their personal concerns. Andrew’s artistic energy butts heads with Othman’s caution and indirection, just as America’s determination to remake the world has collided with centuries of Middle Eastern conservative tradition.\n\nOnly catastrophe can result, as confrontations teeming with shaded meanings and partial understandings flare up into sudden grievance. “Never the twain shall meet” between East and West, Kipling told us, and Korder spells out why any reconciliation must always be chimerical.\n\nThe allegory’s scenes alternately cascade with laughter and seethe with dread, but at a price. In the manner of his nation’s overseas gamble, Andrew never gets any wiser; he actually seems to become more culturally obtuse over time. Letscher inhabits the guy down to the merest fumbled handshake, but it’s hard to accept this clueless pawn as a credible character, or care much about his personal and professional stakes in the protracted negotiations.\n\nHarelik’s unimprovable performance exudes feline grace and utter concentration from which it’s impossible for Andrew to avert his eyes, or us ours. Yet Othman’s meanings and motivations are so veiled as to leave us at an empathetic remove throughout. Despite his surface likability, the character’s potential complicity in the regime’s horrors — remember Baghdad Bob? — prevents us from full investment in his fate, even when he hobbles into a meeting as an obvious torture victim, gamely determined to maintain his sangfroid.\n\n“In a Garden” is never less than thoughtful and involving, but it’s not until the play’s end that a final scenic coup delivers the ultimate roundhouse punch.",
  "contentMismatchNote": "Wrong content detected by audit - fullText is about different show"
}
