{
  "showId": "kiss-me-kate-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2019/03/14/kiss-me-kate-its-all-right-with-me/",
  "publishDate": "2019-03-14T20:51:10",
  "fullText": "First things first: Reports of Kiss Me, Kate’s reinvention have been greatly exaggerated. The very fine Roundabout Theatre revival that just opened at Studio 54 is essentially the Kate you know and love: backstage drama, a Taming of the Shrew show-within-a-show, ego-tastic actors/former lovers Lilli Vanessi and Fred Graham (played by Kelli O’Hara and Will Chase), and starstruck gangsters.\n\nWriter Amanda Green, credited with additional material, didn’t rip up any of Cole Porter’s delicious ditties or take a hacksaw to Sam and Bella Spewack’s quip-filled book. The potentially objectionable (but hilarious) lyric in “Brush Up Your Shakespeare”—“If she says your behavior is heinous/ Kick her right in the Coriolanus”—is still there.\n\nGreen’s most obvious touch comes in the penultimate song “I Am Ashamed That Women Are So Simple,” now titled “I Am Ashamed That People Are So Simple.” Sung by Lilli as Katharine, the eponymous Shrew, it also eliminates the “bound to serve, love, and obey” line—words that may have been Shakespeare’s but have also been phased out of modern-day wedding vows.\n\nThere are more small changes, and fans are surely debating them over martinis at Glass House Tavern at this very moment. (Which, after all, is the best way to discuss such matters.) What’s on stage at Studio 54 works—because how could it not, when you have a company headlined by O’Hara and Chase singing such Porter gems as “Another Op’nin’, Another Show,” “So in Love,” and “Wunderbar”? And when choreographer Warren Carlyle is doing things that Fred Astaire could do only with a camera and a rotating set? Carlyle and company also bring down the house with the off-to-the-races second-act ensemble number “Too Darn Hot,” led by James T. Lane, which starts as a steamy slow jam and escalates into a breathless dance-off that blends swing, Lindy Hop, jitterbug, tap, and even a Fosse homage.\n\nThough this revival is buoyed by a few canny supporting turns (most notably Stephanie Styles, making a smashing Broadway debut as the airy ingenue Lois Lane), any Kiss Me, Kate rises and falls on the pairing of its Lilli/Kate and Fred/Petruchio. It’s a thrill to see Chase, after years of replacing in hit shows and starring in a string of flops, finally get a meaty role he can make his own, and he’s every inch the Parma ham that the part demands, especially in the tongue-twisting “I’ve Come to Wive It Wealthily in Padua” and “Where Is the Life That Late I Led.” (I do, however, hold a soft spot for his performance in 2006’s underrated blink-and-you-missed-it Tom Kitt–Amanda Green musical High Fidelity.)\n\nThere’s a reason Kelli O’Hara’s name comes up every time a classic musical revival is announced. (People are already clamoring for her to star opposite Hugh Jackman in the forthcoming Music Man.) She’s got that lush, made-for-the-Great-American-songbook voice that carried shows including The Pajama Game (2006), South Pacific (2008), and The King and I (2015), and she sounds glorious on the Porter standard “So in Love.” She’s a lower-key Lilli/Kate than you might expect—her delivery of “I Hate Men” is more resigned, sort of one big eye roll, than spiteful—but if she’d gone wildly over the top that wouldn’t have seemed genuine. A woman has to walk a very fine line in this role: She needs to be a shrew, as the play-within-a-play demands, but not too shrewish; she has to be smart, but not overtly calculating; she must be angry, but still lovable. Meanwhile, all that’s required for Fred/Petruchio is an abundance of charm. Some things never change.\n\nKiss Me, Kate opened March 14, 2019, at Studio 54 and runs through June 30. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
