{
  "showId": "bandstand-2017",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Michael Sommers",
  "url": "https://www.nytimes.com/2017/04/26/theater/bandstand-review-broadway.html",
  "publishDate": null,
  "fullText": "“Bandstand,” an openhearted, indecisive new musical, wants you clapping your hands and clenching your fists, tapping your toes and blinking back tears. It is both a peppy celebration of can-do spirit and a more somber exploration of what American servicemen experienced when they marched home from World War II.\n\nDirected and choreographed by Andy Blankenbuehler, the Tony Award-winning choreographer of “Hamilton,” with book and lyrics by the Broadway newcomers Richard Oberacker and Rob Taylor, and a 1940s pastiche score by Mr. Oberacker, “Bandstand” is an undercooked slice of apple pie, served with a dollop of anguish.\n\nPfc. Donny Novitski (Corey Cott) saw action in the Solomon Islands and saw hell on Bougainville. Back home in Cleveland in 1945, he wants to pick up life just where he let it fall. Big dreams for a guy who can’t even sleep through the night.\n\nA hunky pianist with restless fingers and floppy hair, Donny can’t book gigs at the nightclubs he used to play, as their piano benches are now filled with new talent, mostly men who didn’t serve. Haunted by a bad conscience and tempted by the bottle, he gets a reprieve when he hears about a Tribute to the Troops! contest. Bands from all 48 state will compete to write and perform the next great swing song “in honor of our boys in uniform.”\n\nFirst, Donny has to put together a group, which he does in the lilting, satisfying “I Know a Guy.” His lineup: bass, drums, trumpet, trombone, sax — with a twist. As Donny sings, “Every horn and clarinet/Will be a military vet.” All of the musicians he recruits have served. Not one came through the war unscathed. Which means they can really cook. And ache. And seethe.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"The musical’s angry climax is quite effective. What precedes it is scarcely so thrilling. The script and score are competently crafted but greater musical variety and certainly a richer infusion of humor are needed...Andy Blankenbuehler, who directs and choreographs, gives the production plenty of kinetic energy, but there tends to be a sameness to his post-jitterbug dances...The 21-member company never fails to animate this obviously sincerely meant yet curiously flat musical.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 314,
  "archivePath": "data/archives/reviews/bandstand-2017/nytimes--michael-sommers_2026-02-07.html",
  "textFetchedAt": "2026-02-07T05:50:20.405Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "archiveOrgTimestamp": "20241212080102",
  "archiveOrgUrl": "http://web.archive.org/web/20241212080102/https://www.nytimes.com/2015/11/01/nyregion/review-performances-of-comedy-of-tenors-and-bandstand.html",
  "wrongFullText": "Semi-fresh may be the best term to describe two new shows that are currently running in New Jersey. The first is a comedy that is rooted in an earlier work. The second is a new musical that embraces the dark side of a bygone era.\n\nConsiderable laughter can be found in Princeton, where the McCarter Theater Center is presenting Ken Ludwig’s “A Comedy of Tenors” in a premiere coproduction with the Cleveland Playhouse.\n\nWhether or not one is acquainted with Mr. Ludwig’s “Lend Me a Tenor,” this sequel to that popular hotel room farce packs a good deal of amusement.\n\nThe characters from the original who reappear here in a deluxe hotel suite in Paris in 1936 are Saunders (Ron Orbach), a cranky impresario from Cleveland; Max (Rob McClure), his trusty assistant who not so incidentally also sings; Tito (Bradley Dean), the temperamental Italian opera star; and Maria (Antoinette LaVecchia), Tito’s spitfire wife.\n\nSaunders is backing a sold-out concert headlined by Tito, Max and — after the tenor Jussi Bjorling unexpectedly cancels — Carlo (Bobby Conte Thornton), a rising luminary who is secretly romancing Tito’s daughter Mimi (Kristen Martin). The moody Tito’s jealousy over Carlo’s popularity and his mistaken belief that Maria and Carlo are enjoying an affair soon send him storming out.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "_showNotMentionedDiscoveryAttempted": true,
  "duplicateTextOf": "nytimes--alexis-soloski.json",
  "wordCount": 314,
  "tierReason": "Full review text",
  "previousUrl": "https://www.nytimes.com/2015/11/01/nyregion/review-performances-of-comedy-of-tenors-and-bandstand.html",
  "urlDiscoveredAt": "2026-02-07T05:50:20.410Z",
  "urlDiscoveryMethod": "show-not-mentioned-recovery"
}
