{
  "showId": "once-upon-a-mattress-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2024/08/12/once-upon-a-mattress-sutton-foster-of-the-swamps-reigns-triumphant/",
  "publishDate": "2024-08-12T21:56:26",
  "fullText": "If it’s Broadway clowning you want, with zany antics, extended gaggery, and wholesale chomping of the scenery (not to mention the props), hie thee to the Kingdom of Hudson on West Forty-Fourth Street, where Sutton Foster and friends romp their way through Once Upon a Mattress. Playgoers who don’t care to laugh, or guffaw, or wince at jabs and puns and hold their sides for the sake of decorum need not attend.\n\nThis fractured fairy-tale version of Hans Christian Andersen’s 200-year old “Princess and the Pea” was whipped up in 1959 by composer Mary Rodgers, lyricist Marshall Barer, and bookwriters Barer, Jay Thompson, and Dean Fuller. Revived on Broadway in 1996 (albeit by a director and production team who didn’t seem to realize that the show was supposed to be funny), Once Upon a Mattress has been somewhat overlooked of late—which makes this new-generation revisitation a welcome surprise.\n\nThe folks at City Center saw fit to give Mattress the Encores! treatment in January. Buoyed by the performances of Foster (as Princess Winifred the Woebegone) and fellow mummer Michael Urie (as Prince Dauntless who falls “in love with a girl named Fred”), director Lear deBessonet’s production offered a fast-paced joust of mischievously medieval joy.\n\nThe low comedy quotient was to be expected; this was the show that launched, back in the Eisenhower administration, the career of Carol Burnett. Burnett’s backwoods moat-swimming rustic Amazonian act proved impossible to follow by performers as diverse as Imogene Coca, Dody Goodman, Jane Connell, Sarah Jessica Parker, and Tracey Ullman.\n\nFoster—whose career has taken her from the tap-dancing Thoroughly Modern Millie to the good-time-girl Reno Sweeney of Anything Goes to the sensitive Violet to that meat-pie pummeling Mrs. Lovett—is nothing if not a specimen of all-round musical theatre versatility. That range in itself doesn’t necessarily translate into knockabout low-comedy top-banana ability, however. Suffice it to say that Foster’s got a bit of that old Burnett/Lahr/Nancy Walker buffoonery in her backpack—without which, methinks, this Mattress would not be so mirthful.\n\nUrie, another performer who has demonstrated a knack for high comedy (and highly neurotic comedy), also outdoes himself. While Prince Dauntless appears to have been intended as a mere featured foil for his Princess Fred, Urie elevates the role to something of co-star status. While I can’t imagine many Mattress watchers recalling who played the role formerly, present-day audiences are likely to relish the added value provided by the present prince.\n\nIf the Foster-Urie team has enhanced their skillfully constructed hilarity, and if there are other improved performances on display at the Hudson, the new production does not seem quite so off-the-wall frisky as it did this winter. The recent Encores! transfers of Parade and Into the Woods (to say nothing of the NYTW transfer of Merrily We Roll Along) seem to have been lavished with enhancements and improvements on their way to Broadway. Not quite so, here. Does the reduced size of choreographer Lorin Lattaro’s dance ensemble cut down the ebullience formerly seen in the gimmicky-by-design dance ensembles (starting with “An Opening for a Princess”)? Are music supervisor Mary-Mitchell Campbell and conductor Annbritt duChateau hampered by the reduction from 26 musicians to 16? Or is it due to the switch from the original 1959 orchestrations (Hershy Kay-Arthur Beck-Carroll Huxley) to what seems to be Bruce Coughlin’s effective but less rambunctious 1996 reduction?\n\nDavid Zinn’s Encores! scenery, with on-stage band platform, has been retained for the move. So have the costumes of Andrea Hood, although they don’t seem quite so comic-book colorful. On the other hand, lighting designer Justin Townsend (a new addition to the team) adds a palate of popsicle colors that are most helpful. Director deBessonet’s drolly comic touch remains in full flourish, while Amy Sherman-Palladino’s adaptation of the original script breezes along.\n\nThere would likely have been no Broadway transfer sans Foster and Urie, but four of the other six principal players have been recast with varying results. Let’s dwell on the improvements: Daniel Breaker, who developed his comedy chops as the Donkey alongside Foster’s Princess Fiona in the 2008 Shrek The Musical, makes a swell song-and-dance narrator of the proceedings. (One of the miscues of the Encores! staging, for this viewer, was the change in emphasis of the Jester to a more modernistic persona.) Brooks Ashmanskas, too, brings added value as the Wizard. Otherwise, Ana Gasteyer (as Queen Aggravain) and Will Chase (as Prince Harry) join the cast while David Patrick Kelly (as the silent King) and Nikki Renée Daniels (as Lady Larken) have accompanied Foster and Urie for the move.\n\nOnce Upon a Mattress offers laughs galore; flights of melody highlighted by the light-hearted romantic ballad “In a Little While,” that upbeat paean to “Normandy,” and that clarion-blasted swamp-heroine’s lament, “Shy”; and is likely to leave a wide grin on the face of happy playgoers. While it is not strictly a family musical just for families, it is sure to inculcate an appreciation for low-brow musical comedy artistry in younger audiences so bring ’em along.\n\nOnce Upon a Mattress opened August 12, 2024 at the Hudson Theatre and runs through November 30. Tickets and information: onceuponamattressnyc.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
