{
  "showId": "once-upon-a-mattress-2024",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Daniel D'Addario",
  "url": "https://variety.com/2024/legit/reviews/once-upon-a-mattress-review-sutton-foster-broadway-1236104236/",
  "publishDate": null,
  "fullText": "Aug 12, 2024 7:00pm PT \n\n \n\n \n \n \n\n \n\n \n ‘Once Upon a Mattress’ Review: Sutton Foster Is an Awkward Fit in a Musical That’s Not Quite Broadway Royalty\n\nClose to the climax of “Once Upon a Mattress,” now revived on Broadway for the second time, Princess Winnifred (Sutton Foster) has reached the end of her rope. After the frustrations of the preceding two hours or so, Winnifred, the beleaguered would-be bride to a feckless prince, screws up her face and declares “What are you, some kind of nut?”\n\nThe audience at the Hudson Theatre lost it, but it wasn’t hard to feel — in this moment and throughout the production — left outside of a seeming inside joke, and one that doesn’t quite work. “Once Upon a Mattress,” little-loved by critics since its 1959 debut but perennially revived in community theater, has precious little story to speak of. (It’s based on “The Princess and the Pea,” Hans Christian Andersen’s fairy tale whose plot could be conveyed in three sentences — four, if you’re feeling verbose.) And this production — adapted by “The Marvelous Mrs. Maisel” creator Amy Sherman-Palladino and previously seen early this year as part of City Center’s Encores series — tends to try to solve for the play’s deficiencies with an attitude that is something less than winning.\n\nAbout those deficiencies: As Winnifred, Foster is at the center of the story — she’s the suitor whose sensitivity is being tested by placing a single pea under a stack of 20 mattresses and seeing if it disturbs her sleep. But she only enters the proceedings fairly deep into the first act, after a somewhat relentless period of setting up the stakes and political environment of the kingdom. The heir to the throne, Michael Urie’s Prince Dauntless, wants to wed, but his mother, Ana Gasteyer’s Queen Aggravain, is too jealous to allow it, and sets up impassable tests for any bride. Simple enough — and yet the wait for Foster’s arrival grows tedious. Similarly, once the test is set up, the second act spins its wheels, with musical numbers tangent or basically unrelated to the plot of the show.\n\nAt least one of those, “Very Soft Shoes,” about the court jester’s relationship with his father, is very lovely, and carried across beautifully by Daniel Breaker (a standout). And yet there’s a conundrum at the heart of “Once Upon a Mattress.” The show cannot work without Winnifred, whose origins in a bog and whose poor etiquette enrage Aggravain. The story, such as it is, exists around her. And yet, when Foster is onstage, an element of her fundamental miscasting clangs. The role was first played by Carol Burnett, and Foster seems to be aiming for a Burnett-esque loopy comedy as she clambers across the stage; throughout the show, she shifts her weight like a prizefighter, as if so filled with energy she simply must express it. During “Shy,” Winnifred’s big introduction song, the actress scoots around the stage like a child shuffling their feet on the kitchen floor to imitate a figure skater.\n\nFoster is an eminently physical performer — her tap dance in the 2011 revival of “Anything Goes,” televised from the Tonys stage, is by now the stuff of legend. But she’s a precision artist, and playing a character who is by her nature sloppy and goofy doesn’t come naturally. “What are you, some kind of nut?” is a poorly written line, but it’s also one that Foster is too crisp by half to sell.\n\nWe feel her trying, though, and this effort gives “Once Upon a Mattress” an unsettled, nervous-making quality. (A key set piece in which Winnifred, hungry and unaccustomed to bounty, stuffs her face to bursting with grapes has an anxious, needy aspect — pushing toward laughter that the writing isn’t earning. It lands closer to “Fear Factor” than to musical theater.) Other performers fare better — Urie, playing his prince’s innocence big and broad, does well, and Gasteyer’s upright bearing and clear diction allow her to make a meal of the queen’s vanity and delusion.\n\nThese traits — a prince’s naivete, a queen’s grandeur — might seem to give “Once Upon a Mattress” a reason to be. At its best, in fleeting moments, the show feels like a “Fractured Fairy Tale” of the sort that “Rocky and Bullwinkle” popularized around the time this play was first mounted. One feels the desire, on the part of the production, to say something about children’s stories, to develop or complicate the myths we learn in our youth. “Into the Woods” is an impossible comparison, but an ounce of that show’s curiosity about the stories we tell would have been welcome.\n\nInstead, there’s a certain stubbornness to this show’s insistence on trying to get by on sheer nerve, its refusal to try anything beyond the realm of physical comedy (through which Foster will try everything). In its staging and production, it’s of the highest order — the costumes, by Andrea Hood, wowed me, for instance. (I was particularly partial to the gaudily looping sleeves on the garment worn by the Jester — an outfit with more indulgence and wit than anything in the script.) And the show finally cannot overcome the casting of Foster, a game and fantastic performer who simply can’t find her way into a character who’s all sloppy id. Like a legume under your mattress, this casting is a small thing that, as the evening wears on, comes to feel massive.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Instead, there’s a certain stubbornness to this show’s insistence on trying to get by on sheer nerve, its refusal to try anything beyond the realm of physical comedy (through which Foster will try everything). In its staging and production, it’s of the highest order — the costumes, by Andrea Hood, wowed me, for instance. (I was particularly partial to the gaudily looping sleeves on the garment worn by the Jester — an outfit with more indulgence and wit than anything in the script.) And the show finally cannot overcome the casting of Foster, a game and fantastic performer who simply can’t find her way into a character who’s all sloppy id. Like a legume under your mattress, this casting is a small thing that, as the evening wears on, comes to feel massive.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"the show finally cannot overcome the casting of Foster, a game and fantastic performer \"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "bwwScore": 5,
  "sources": [
    "show-score-playwright",
    "bww-reviews"
  ],
  "textWordCount": 911,
  "archivePath": "data/archives/reviews/once-upon-a-mattress-2024/variety--daniel-d-addario_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:21:06.871Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 911,
  "tierReason": "Full review text"
}