{
  "showId": "once-upon-a-mattress-2024",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Christopher Bonanos",
  "url": "https://www.vulture.com/article/review-once-upon-a-mattress-sutton-foster-theater-encores.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Scrapbooking (a much funnier word with not one but two k sounds) gets a big laugh and then so do glue and trust issues. This exchange, containing as it does so much phrasing from the present day, may not hold up in another revival 60-odd years from now, but it absolutely works today. Which is, frankly, a lot of what a revival like this is about. You stage it because, in this moment, Sutton Foster exists and can pull off Winnifred — with an endorsement from the grande dame, now 91, herself. You also stage it because, if you’re lucky, thousands upon thousands of theatergoers will say, “I was in that show in high school,” and they might buy tickets to see as well wrought a version as can be done. Which, given the limitations of the show itself, this one may well be.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ONCE-UPON-A-MATTRESS-Returns-To-Broadway-20240812",
  "showScoreExcerpt": "Foster is, as a performer, a little more eager and ingratiating than she is devil-may-care\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "playbillVerdictUrl": "https://www.vulture.com/2024/01/theater-review-encores-once-upon-mattress-city-center.html",
  "sources": [
    "show-score-playwright",
    "playbill-verdict",
    "nyc-theatre",
    "bww-reviews",
    "bww-roundup"
  ],
  "nycTheatreExcerpt": "She's good. I'd guess from her performance that she closely studied videos of Burnett in the role, and she has grasped that overdoing it is the key to this show. So she mugs and leans in and leans out and does a funny little loose waggle with her hips between lines.",
  "bwwScore": 7
}
