{
  "showId": "cirque-du-soleil-paramour-2016",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2016/05/26/theater/review-paramour-brings-cirque-du-soleil-to-broadway.html?_r=0",
  "playbillVerdictUrl": "http://www.nytimes.com/2016/05/26/theater/review-paramour-brings-cirque-du-soleil-to-broadway.html?_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "Pity the poor chanteuse. Flame-haired, beautiful and buxom, clad in a spangly dress and draped seductively against a piano, she’s singing her heart out, pouring her soul into a song about … er, something. Love? Loss? Her favorite nail salon?\n\nHard to remember, because while she was doing all that heartfelt warbling, the patrons in the speakeasy where she was performing were bouncing around the room like tennis balls, or rolling around on skates, or contorting themselves into peculiar poses on their tables. A few particularly enterprising folks were even swinging from the light fixtures. It was difficult to focus on the song when the room resembled a pinball machine heading toward tilt.\n\nWelcome to “Paramour,” or as I like to call it, “A.D.H.D.! The Musical.” The production, which opened on Wednesday at the Lyric Theater, represents the latest attempt by the French Canadian entertainment behemoth Cirque du Soleil to make a big splash in New York. This time the company, having failed to wow the local masses sufficiently with its traditional nouveau-circus spectacles, has decided to splice the time-tested yowza diversions — acrobats and gymnasts and jugglers, oh my! — into a traditional musical, with a plot, characters, show tunes and even a little tap-dancing.\n\nThe resulting show, I’m sorry to say, achieves the singular feat of being simultaneously frenetic and tedious.\n\nConceived and directed by Philippe Decouflé, the production pays lavish, if often ludicrous, homage to the “Golden Age” of Hollywood, the vague era when it is set, and features a star-is-born plot reeking of mothballs. The principal characters — really, the only ones — are the autocratic director AJ (Jeremy Kushnier, sporting a nice Brooklyn beard and ’stache); the aspiring singer Indigo (Ruby Lewis); and the songwriter Joey (Ryan Vona).\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 317,
  "archivePath": "data/archives/reviews/cirque-du-soleil-paramour-2016/nytimes--unknown_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:04:59.649Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240413235304",
  "archiveOrgUrl": "http://web.archive.org/web/20240413235304/https://www.nytimes.com/2016/05/26/theater/review-paramour-brings-cirque-du-soleil-to-broadway.html?_r=0",
  "contentTier": "complete",
  "wordCount": 317,
  "tierReason": "Full review text",
  "bwwExcerpt": "Welcome to 'Paramour,' or as I like to call it, 'A.D.H.D.! The Musical.' The production, which opened on Wednesday at the Lyric Theater, represents the latest attempt by the French Canadian entertainment behemoth Cirque du Soleil to make a big splash in New York. This time the company, having failed to wow the local masses sufficiently with its traditional nouveau-circus spectacles, has decided to splice the time-tested yowza diversions - acrobats and gymnasts and jugglers, oh my! - into a traditional musical, with a plot, characters, show tunes and even a little tap-dancing.",
  "bwwScore": 5,
  "rejectedAt": "2026-02-06T07:09:22.472Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: Text cuts off mid-review with technical error message about JavaScript and verifying access; openai: The review text is cut off, and the verdict or conclusion is missing, making it impossible to accurately score the review.",
  "promptVersion": "5.2.0"
}