{
  "showId": "cirque-du-soleil-paramour-2016",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Unknown",
  "url": "http://www.thewrap.com/paramour-broadway-review-theres-cirque-du-soleil-gold-amid-showbiz-dross/",
  "playbillVerdictUrl": "http://www.thewrap.com/paramour-broadway-review-theres-cirque-du-soleil-gold-amid-showbiz-dross/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The big surprise of Cirque du Soleil’s new show on 42nd Street is how Broadway it is. “Paramour,” which opened Wednesday at the Lyric Theatre, tells a very simple Hollywood story about a mad movie director (Jeremy Kushnier) who falls in love with his leading-lady discovery (Ruby Lewis) only to see her take off with a lowly pianist-composer (Ryan Vona). In comparison, “A Star Is Born” and “42nd Street” are Dostoevsky.\n\nWhere do all the standard Cirque du Soleil acrobats and aerialists fit into such a conventional musical?\n\nPhilippe Decoufle’s direction tries a number of ways. For the female lead’s first two songs, Decoufle takes an Academy Awards approach. Our ingenue sings, and around her there’s a mish-mash of stuff going on: jugglers, gymnasts, dancers, you name it. In one number, I focused on the guy balancing a long-stem rose on his forehead. In another, there’s a woman dangling by the back of her neck from a big suspended hoop.\n\n“Paramour” is most successful when it just chucks the plot entirely. In one scene, the crazy director is filming Cleopatra’s big entrance into Rome and part of the festivities involve two aerialists. They’re the blond twin brothers Andrew and Kevin Atherton, and they perform a very homoerotic double Icarus number that has their two bodies doing everything but kissing as they fly out over the audience, often attached to each other by a mere handshake. Don’t sit any closer than Row L. It’s truly breathtaking in so many ways.\n\nIn the next scene, the mad director chucks “Cleopatra” to film a hillbilly scene in what looks like “Seven Brides for Seven Brothers.” Daphne Mauger’s choreography has little of the athleticism of Michael Kidd’s, but who cares? In no time, acrobats start jumping up and down on a big seesaw and sometimes spin so high into the flies that they nearly disappear for a good minute.\n\nThat’s the first act. By the second act, the three very uncharismatic leads and their generic tunes (written by a bunch of people) have definitely worn out their welcome.\n\nThey sing a love-triangle song titled “Love Triangle.” Sadly, the Athertons don’t return. Instead, three equally inspiring gymnast-aerialists (Samuel William Charlton, Martin Charrat, Myriam Deraiche) show up to visualize the overwrought lyrics, and poor Deraiche gets tossed around more than a diced-up head of iceberg lettuce.\n\nAlso wonderful is a chase across Manhattan rooftops. It’s most wonderful because the three leads are now gone completely, impersonated by people on trampolines who have nothing to do with those characters or the plot, which stopped going anywhere about an hour before. The number puts much needed bounce back into “Paramour.”\n\nThere’s another reason to see the new Cirque du Soleil show. For aficionados of really bad Broadway shows, “Paramour” features one of the most outlandishly awful big musical numbers ever. Yes, ever!\n\nWhile “Paramour” is set in what’s called “the golden age of Hollywood,” the mad director puts his leading lady through a number of poses that replicate famous movie posters, from “The Blue Angel” to “Cleopatra.” Not the 1934 Claudette Colbert “Cleopatra.” This is the 1963 Elizabeth Taylor “Cleopatra,” complete with stand-ins for Richard Burton and Rex Harrison. The obvious anachronism here is the least of it. (They also impersonate the “Some like It Hot” poster.) The poster tableaux, from “King Kong” to “Gone With the Wind,” simply dazzle in their utter tackiness.",
  "isFullReview": true,
  "textWordCount": 566,
  "archivePath": "data/archives/reviews/cirque-du-soleil-paramour-2016/thewrap--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:08:43.625Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 566,
  "tierReason": "Full review text"
}