{
  "showId": "a-view-from-the-bridge-2015",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/theater-review-view-bridge-844752/",
  "publishDate": "November 13, 2015",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Mark Strong delivers a towering performance as longshoreman Eddie Carbone in this haunting revival of Arthur Miller's 1955 tragedy.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mark Strong delivers a towering performance as longshoreman Eddie Carbone in this haunting revival of Arthur Miller's 1955 tragedy.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (19 words)",
  "textWordCount": 673,
  "archivePath": "data/archives/reviews/a-view-from-the-bridge-2015/hollywood-reporter--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:04:33.362Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "showNotMentioned": true,
  "wordCount": 673,
  "tierReason": "showNotMentioned — wrong content scraped",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/arthur-millers-a-view-bridge-839854",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "wrongFullText": "×\n \n \n \n\n \n \n \n\n \n\n \n\n \n \n \n \n \n\n \n \n \n\n \n \n \n\n \n\n \n Skip to main content \n\n \n \n \n \n\n \n \n \n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n\n \n \n\n \n \n \n\n \n\n \n \n \n \n \n By \n\n Keith Caulfield, Billboard\n\nAdele’s 25 made music sales history, earned a milestone debut on the Billboard 200 chart, and instantly became the year’s top selling album in the U.S. in just one week.\n\nAnd that’s just three statistics behind 25’s huge arrival. Here are some more fun facts and figures associated with 25’s big bow:\n\n3.38 Million Sold: Total number of copies 25 sold in the U.S. in its debut week (ending Nov. 26) according to Nielsen Music. That’s the largest sales week for an album since Nielsen began tracking point-of-sale music purchases in 1991. (It beats the previous record, held by*NSYNC’s No Strings Attached, when it debuted with 2.42 million sold in the week ending March 26, 2000.) 25 is also the only album to sell more than 3 million copies in a week.\n\n41 Percent of All Albums Sold Last Week Were 25: In total for the week, there were 8.2 million albums sold in the U.S. Thus, 25’s 3.38 million represented 41 percent of all albums sold in America. Weekly U.S. album sales between late August and mid-November fluctuated between 3.5 million and 4.2 million per week. The lowest week in Nielsen history for album sales was the frame ending Sept. 17, when only 3.51 million albums were sold.\n\n335 Copies Sold Per Minute: With 10,080 minutes in a week, 25 sold about 335 copies per minute in the U.S. during its first week on sale.\n\n25 Sold More Than Twice the Combined Total of the Nos. 2-100 Titles on Top Album Sales Chart: 25 debuts at No. 1 on the Top Album Sales chart, and its enormous sales are more than double the rest of the chart combined. Nos. 2 (Justin Bieber’s Purpose, with 184,000) through 100 (The Descendants soundtrack, with 5,000) sold 1.48 million for the week.\n\n25 Is the Only Album to Sell at Least 2 Million Copies in All of 2015: 25 is just the fourth album to sell a million copies in 2015, and it immediately becomes the year’s top seller, surpassing the 1.78 million sold in 2015 by Taylor Swift’s 1989. To put 25’s staggering figure in further perspective, in 2014, only two albums sold more in the entire year than 25 did in a single week: Taylor Swift’s 1989 (3.66 million) and the Frozen soundtrack (3.53 million).\n\n1.71 Million CDs: Of its total 3.38 million sold, 25 moved 1.71 million copies on compact disc. To put that figure in perspective, 25 comprised 38 percent of all albums sold on CD in the week ending Nov. 26 (4.54 million).\n\n1.64 Million Digital Albums: 25 opens with 1.64 million digital copies sold, a new single-week download sales record for an album. It beats the previous record-holder by nearly a million copies: Lady Gaga’s Born This Way, when it arrived with 662,000 digital copies sold in the week ending May 29, 2011.\n\n49 Percent of All Digital Albums Sold Last Week Were 25: In total for the week, there were 3.43 million digital albums sold. 25’s 1.64 million downloads equate to 49 percent of all digital albums for the week.\n\n22,000 Vinyl Albums Sold: 25 sold 22,000 copies on vinyl LP — the third-largest sales week in Nielsen history for an album on vinyl. Only the debut weeks of Jack White’s Lazaretto (40,000) and Pearl Jam’s Vitalogy (34,000) were larger.\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice."
}
