{
  "showId": "a-view-from-the-bridge-2015",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/view-from-a-bridge-review-stripped-down-stunning-1.11117336",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/view-from-a-bridge-review-stripped-down-stunning-1.11117336",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Updated November 16, 2015 2:13 AM\n By Linda Winer linda.winer@newsday.com\n\nadvertisement | advertise on newsday\n\nWHERE Lyceum Theatre, 149 W. 45th St.\n\nINFO $20-$135; 212-239-6200; aviewfromthebridgebroadway.com\n\nBOTTOM LINE Stunning, stripped down and mythic\n\nFrom the first moments of director Ivo van Hove’s stripped-down and downright stunning production of “A View From the Bridge,” it is clear this will be unlike any other view of Arthur Miller’s 1957 Sicilian-American tragedy.\n\nInstead of the usual Red Hook tenement street, there is a structure that slowly opens like a hinged box to reveal just a three-sided glass bench and a blank wall with a cutout door. Instead of longshoremen pitching coins, we watch two sinewy, powerful men clean up after a long day on the Brooklyn docks.\n\nThen for almost two nonstop hours, van Hove — the Belgian-born provocateur, downtown New York superstar and head of the largest repertory theater in the Netherlands — takes us deep into the unadorned marrow of this drama about a decent man who loves his wife’s 17-year-old niece too much.\n\nWith one exception, the play has always struck me as uneasily conflicted between its slice-of-life realism and Miller’s desire to elevate it into Greek tragedy — complete with a portentous Greek chorus in the person of an immigration lawyer. That exception was Gregory Mosher’s 2010 Broadway revival with Liev Schreiber and Scarlett Johansson, a production so staggering in straightforward storytelling that the mythic ambitions became irrelevant.\n\nIn stark contrast, this “View” — which won Olivier Awards in London for the revival, van Hove and actor Mark Strong — moves with the terrifying inevitability of myth. Stripped of the distancing influence of Italian accents, ‘50s costumes and even of shoes, these terrific actors — all but one are Brits talking middle American — take a fierce stand on the primal nerves of jealousy, taboo, betrayal and violence so terrible it’s almost beautiful.\n\nadvertisement | advertise on newsday\n\nMost of this happens on designer Jan Versweyveld’s elevated plain square (with onstage audiences at two sides), with an emotional honesty that makes even Miller’s heavier lines seem almost improvised. Strong makes a tall, confident Eddie, so comfortable in his skin that he can’t begin to comprehend his catastrophic passions. As Catherine, Phoebe Fox, dressed in a tiny miniskirt designed by An D’Huys, has the unassuming ripeness of youth. When she flings her bare legs around Eddie’s torso, the sparks travel straight to the gut of Eddie’s neglected wife Beatrice (Nicola Walker).\n\nRussell Tovey and Michael Zegen are sympathetic as Beatrice’s relatives, illegal immigrants invited to stay in the house, while Michael Gould has none of the usual awkwardness as the lawyer/Greek chorus. Looking back at the bloody results, he says, “Now we settle for half.” Not with van Hove in charge they don’t.\n\n@Newsday\n Tweets from @Newsday/newsday-staff\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Coming soon: Newsday's Entertainment newsletter, for the latest on celebs, TV, more.\n\nNewsday.com now uses Facebook for our comment boards. Please read our guidelines and connect your Facebook account to comment.",
  "isFullReview": true,
  "textWordCount": 498,
  "archivePath": "data/archives/reviews/a-view-from-the-bridge-2015/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:26:38.011Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20151116071339",
  "archiveOrgUrl": "http://web.archive.org/web/20151116071339/http://www.newsday.com:80/entertainment/theater/view-from-a-bridge-review-stripped-down-stunning-1.11117336",
  "contentTier": "complete",
  "wordCount": 498,
  "tierReason": "Full review text"
}