{
  "showId": "a-view-from-the-bridge-2015",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "http://www.vulture.com/2015/11/theater-review-a-view-from-the-bridge.html#",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "web-search",
    "bww-roundup"
  ],
  "bwwExcerpt": "What makes this slight misfit of play and production finally unimportant is that the actors are so devastatingly good. Their habit of fealty to character as defined by dialogue survives the director's effacements. Mark Strong may be styled to look like a neutral Everyman of the past or future, but, in his bearing and cadence and anguish and bafflement, he is only Red Hook's Eddie Carbone, in full tragic tilt. Phoebe Fox makes Catherine's transition from baby doll to furious womanhood thrillingly transparent, just as Nicola Walker, as Eddie's wife, Beatrice, shows how every hopeful choice she and Eddie have made now closes in on her like a trap. (For once, Beatrice and Catherine actually look like aunt and niece.) The Italian brothers, Marco (Michael Zegen) and Rodolpho (Russell Tovey), are both excellent in difficult roles, and Michael Gould makes of Alfieri the perfectly regretful guide. Some of the credit for the cast's superb work obviously belongs to van Hove; he knew he needed actors who could stand up to his powerful, showy interventions. It's a fair trade; those interventions probably made this revival viable. Still, one looks on them, and on van Hove's upcoming Broadway production of The ­Crucible with, as Alfieri says, 'a certain alarm.'",
  "bwwScore": 7,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-A-VIEW-FROM-THE-BRIDGE-Opens-on-Broadway-Updating-LIVE-20151112",
  "showScoreExcerpt": "\"The lack of clutter is certainly chic, but without the furniture and props Miller specified, some points are unclear…What makes this slight misfit of play and production finally unimportant is that the actors are so devastatingly good…Some of the credit for the cast’s superb work obviously belongs to van Hove; he knew he needed actors who could stand up to his powerful, showy interventions. It’s a fair trade; those interventions probably made this revival viable.\"\n\nRead more",
  "publishDate": "November 13, 2015"
}