{
  "showId": "old-times-2015",
  "outletId": "abc-news",
  "outlet": "ABC News",
  "criticName": "Unknown",
  "url": "http://abcnews.go.com/Entertainment/wireStory/review-spring-awakening-opens-arms-34093481",
  "playbillVerdictUrl": "http://abcnews.go.com/Entertainment/wireStory/review-spring-awakening-opens-arms-34093481",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Little can contain the new, electrifying version of \"Spring Awakening\" now on Broadway.\n\nActors use their faces, mouths and hands to communicate. Projections offer song lyrics and dialogue. Performers run through the theater aisles, even occupying a box seat. Musicians roam the stage with their instruments. At one point, incense fills the theater.\n\nThe nonprofit Deaf West Theatre in Los Angeles, which brought Broadway the triumphant \"Big River\" in 2003, has done it again with Steven Sater and Duncan Sheik's rock musical — making inclusionary, astonishingly alive work.\n\n\"Spring Awakening,\" which opened Sunday at the Brooks Atkinson Theatre, mixes hearing and deaf performers with elegant ease, adding new depth to a show about the dangers of failing to communicate.\n\nDeaf actors communicate to the hearing audience by relying on colleagues elsewhere onstage to provide their spoken dialogue and singing voice, like alter egos. Hearing actors use American Sign Language — evocative and beautiful onstage — to communicate with deaf audience members. In this theater, no one is excluded.\n\nThe result is an exhilarating and fluid hybrid of song, word, dance and sign — and a sheer triumph for director Michael Arden and choreographer Spencer Liff. The songs sit seamlessly in the show, often as brightly lit fantasy sequences that snap back into the grim narrative.\n\n\"Spring Awakening\" focuses most prominently on three youngsters — Melchoir, the defiant but popular and handsome rebel (played by Austin McKenzie); Wendla, the shy young woman determined to learn about sex (acted by Sandra Mae Frank, voiced by Katie Boeck); and Moritz, done in by the repressive society around him (played by Daniel N. Durant, voiced by Alex Boniello).\n\nThere are also wonderful featured performances by Krysta Rodriguez, who was in the 2006 original, and Ali Stroker, the first actor who uses a wheelchair to make it to Broadway. The overly strict adults are played pitch perfectly by Camryn Manheim, Marlee Matlin, Patrick Page and Russell Harvard.\n\nSet in provincial 19th-century Germany, it tells the story of a group of teenagers trying to come to terms with life and their own sexuality. The language is coarse and plot points include premarital sex, abortion, homosexuality, autoerotism, sadomasochism and incest.\n\nBen Stanton's achingly gloomy lighting that includes silhouettes, long beams and shadows, and Dane Laffrey's scaffolding-and-ladders scenic design both work well. The use of a mirror and a blackboard are sublime.\n\nBut Laffrey's adherence to the boys dressed in knee britches gives the show an AC/DC vibe. With classrooms in turmoil and evil teachers being monstrous, it sometimes feels like \"Spring Awakening\" is what the poor kids from \"Matilda\" can look forward to in a few years.\n\nMany of the songs — including \"Mamma Who Bore Me\" and \"The Bitch of Living\" — haven't lost their vitality and there is simple elegance when cast members hold each other tight to become a tree or leap around with tiny flashlights attached to their fingers to perform \"The Mirror-Blue Night\" (perhaps inspired by the lyric \"flip on a switch\")\n\nIf anything, the brilliant staging reveals chips and holes in the book and lyrics, which simply don't measure up to the ingeniousness of the new show itself. (\"My junk is you\" is one lyric that hasn't aged well.) The slapdash nature of the happy ending after so much gloom also feels overly forced.\n\nBut those aren't knocks on Deaf West's ingenuity. Sign language unlocks so much in the dialogue and emotion that you might wish more shows follow its example. It has awakened \"Spring Awakening.\"\n\nOnline: http://www.springawakeningthemusical.com",
  "isFullReview": true,
  "textWordCount": 587,
  "archivePath": "data/archives/reviews/old-times-2015/abc-news--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:59:45.289Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 244 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 245 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20150930220001",
  "archiveOrgUrl": "http://web.archive.org/web/20150930220001/http://abcnews.go.com:80/Entertainment/wireStory/review-spring-awakening-opens-arms-34093481",
  "contentTier": "complete",
  "wordCount": 587,
  "tierReason": "Full review text"
}