{
  "showId": "old-times-2015",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "http://www.nydailynews.com/entertainment/theater-arts/clive-owen-confident-broadway-debut-old-times-article-1.2387675",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/theater-arts/clive-owen-confident-broadway-debut-old-times-article-1.2387675",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The late, great Harold Pinter installed wall-to-wall ambiguity in his 1971 memory play “Old Times.” So it’s remarkable when a flash of clarity comes in the Roundabout’s stylized revival.\n\nSeated in his living room, Deeley (Clive Owen), a filmmaker, suggestively manspreads. The randy action isn’t meant for his wife Kate (Kelly Reilly). It’s for Anna (Eve Best), a visitor from Kate’s, and, apparently, his past. No two ways about it, it’s a crotch-based “Hey, baby.” But exactly why Deeley does it and what it means remains unclear.\n\nThe rest of the work is also blurry and up for grabs. At the end of 70 minutes you may wonder: Is Anna really a friend? Did Deeley actually look up Anna’s skirt when she was wearing Kate’s underwear? Is Anna a part of Kate that was lost when she wed? Is Anna dead? Is Kate? Are all three? And, moreover, why does the bathroom door in director Douglas Hodge’s staging look like a giant block of ice? What is this, Better Homes and Glaciers?\n\nThe answer to all of the above is who knows. And it’s only frustrating if you expect pat answers. That’s not how Pinter, a Nobel Laureate who died in 2008, rolled. Hodge, a Tony-winning actor, adds his own abstractions.\n\nThe pleasures of the production come from watching three excellent actors — two Broadway rookies — confidently wind through the words, pauses and poses. Owen (“The Knick”) works his craggy good looks and is alternately rogueish and vulnerable. Reilly (“True Detective”) looks the picture of pretty melancholy with her perennially pursed lips, but eventually reveals a sharp tongue. Best, a two-time Tony nominee, recalls a creamsicle with cleavage in her off-white jumpsuit and lends sexiness, glamour and humor.\n\nAnna tells Deeley, “You have a lovely casserole.” She means wife, but the mind and tongue play tricks. So does Pinter. It’s easy to get mixed up watching his puzzling stew, er, play. In the end, you’re somehow satisfied though you don’t know exactly what you’ve eaten.\n\nUse of this website signifies your agreement to the Terms of Service and\n Privacy Policy.\n\n©",
  "isFullReview": true,
  "textWordCount": 352,
  "archivePath": "data/archives/reviews/old-times-2015/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:02:04.835Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20151010111224",
  "archiveOrgUrl": "http://web.archive.org/web/20151010111224/http://www.nydailynews.com:80/entertainment/theater-arts/clive-owen-confident-broadway-debut-old-times-article-1.2387675",
  "contentTier": "truncated",
  "wordCount": 352,
  "tierReason": "Missing proper ending or other signals"
}