{
  "showId": "aint-too-proud-2019",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Alexis Soloski",
  "url": "https://www.theguardian.com/stage/2019/mar/21/aint-too-proud-review-thrilling-music-but-shallow-drama-in-temptations-musical?CMP=twt_a-culture_b-gdnculture",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "There's a chilly irony at the shrink-wrapped heart of Ain't Too Proud: The Life and Times of the Temptations, the thrillingly performed and dramatically static jukebox musical on Broadway. This is a musical that's about (if it's about anything) the perils of fame. And a goose of fame is what it offers to the Temptations, the consummate R&B group that has been grooving in unison for almost six decades.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Critics-Come-See-About-AINT-TOO-PROUD-On-Broadway-20190321",
  "contentTier": "complete",
  "fullText": "Ephraim Sykes, Jeremy Pope, Jawan M Jackson, James Harkness and Derrick Baskin in Ain’t Too Proud. Photograph: Matthew MurphyView image in fullscreenEphraim Sykes, Jeremy Pope, Jawan M Jackson, James Harkness and Derrick Baskin in Ain’t Too Proud. Photograph: Matthew Murphy This article is more than 6 years oldReviewAin't Too Proud review – thrilling music but shallow drama in Temptations musicalThis article is more than 6 years oldImperial Theatre, New York\n\nBroadway’s latest jukebox music is electrified by fantastic singing and dancing but let down by some inert storytelling\n\nThere’s a chilly irony at the shrink-wrapped heart of Ain’t Too Proud: The Life and Times of the Temptations, the thrillingly performed and dramatically static jukebox musical on Broadway. This is a musical that’s about (if it’s about anything) the perils of fame. And a goose of fame is what it offers to the Temptations, the consummate R&B group that has been grooving in unison for almost six decades.\n\nRead moreLike most jukebox musicals, this is a show made for the group’s fans. After the first number, The Way You Do the Things You Do, Otis Williams (Derrik Baskins), the last surviving member of the original Temptations, turns to the audience and says, “’member that”. About half of the Imperial Theatre, a great Broadway barn, had been singing along. So yes, that is ’membered. But it’s surface-skating book and skip-hop chronology probably means that the less you know about the Temptations, the more you’ll enjoy it.\n\nThe story begins in 1950s Detroit when Otis does a brief stint in juvie, set to Runaway Child, and then meets Melvin Franklin (Jawan M Jackson), a nice kid with a brimstone bass. He picks up Eddie Kendricks (Jeremy Pope), a spun-sugar tenor, and Paul Williams (James Harkness), a satiny baritone, and they form the Elgins, who become the Temptations after signing with Motown’s Berry Gordy. When the first lead singer leaves, they poach David Ruffin (Ephraim Sykes), a raspy, high-voltage tenor, and the hits, most of them written by Smokey Robinson, keep coming.\n\nView image in fullscreenEphraim Sykes in Ain’t Too Proud. Photograph: Matthew MurphyBecause most of the Temptations early lyrics are generic – “The way you do the things you do” – the book hasn’t had to deform itself to set up the songs and the director, jukebox doyen Des McAnuff, can freight a number like Shout with a lot of storytelling. But while Dominique Morisseau (Skeleton Crew) is a tip-top playwright, firmly dedicated to the Motor City and finely attuned to social dynamics and interpersonal ones, the book is a cavalcade of banalities and bromides: “Things were about to change for the Temps in a big way.” “Sometimes you let go of one dream to get to something bigger.” “Thought my brothers would live forever. But I guess the only thing that really lives forever is the music.”\n\nBecause harmony is lovely to hear but tricky to show, the book mostly centers on brisk scenes of conflict. The theme: “Whenever your life is shaky, fame makes it worse.” But as the show is based on Otis Williams’s biography, even these scenes are softened and often undercut by Otis’s direct address. Morisseau doesn’t really give us an emotional hold on the characters (Too bad Smokey gave You Really Got a Hold on Me to the Miracles.) There’s a late-game attempt to wring father-son pathos and though it’s undergirded by real tragedy, it feels false. What would a musical centered around a more volatile member – Ruffin, say – have sounded like?\n\nSo why see Ain’t Too Proud? For the songs, of course, and the undiluted pleasure of watching five superb singers and dancers perform them. McAnuff, and the music director and arranger, Kenny Seymour, have given the actors enough space to make the songs their own. They’re still recognizable, but with intonations and accents that make them distinct. The choreography, by Sergio Trujillo, channeling “man with the moves” Cholly Atkins, is a little more athletic than what the Temps actually performed and Sykes an Alvin Ailey-trained dancer is electric as is his every vigorous pas de deux with the microphone stand. No one should be too proud to applaud that.",
  "isFullReview": true,
  "textWordCount": 696,
  "archivePath": "data/archives/reviews/aint-too-proud-2019/guardian--alexis-soloski_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:09:02.431Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "wordCount": 696,
  "tierReason": "Full review text"
}