{
  "showId": "aint-too-proud-2019",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Barbara Shuler",
  "url": "https://www.newsday.com/entertainment/theater/aint-too-proud-temptations-1.28731283",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "Told through the deep, memorable Motown catalog, the show, directed by Des McAnuff (\"Jersey Boys\"), works best when it relies on great songs like \"Papa Was a Rollin' Stone,\" \"My Girl,\" \"In the Still of the Night\" (though many are frustratingly interrupted or cut short). Choreographer Sergio Trujillo gives the singers slick moves considerably more polished than the originals ever managed, while Robert Brill's efficient turntable set is highlighted by Peter Nigrini's projections that provide locat",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Critics-Come-See-About-AINT-TOO-PROUD-On-Broadway-20190321",
  "contentTier": "complete",
  "fullText": "Derrick Baskin, left, Jeremy Pope, Jawan M. Jackson, Ephraim Sykes and James Harkness star in \"Aint' Too Proud -- The Life and Times of The Temptations.\" Credit: Matthew Murphy\n\nWHAT \"Ain't Too Proud -- The Life and Times of The Temptations\"\n\nWHERE Imperial Theatre, 249 W. 45th St.\n\nINFO From $49; 212-239-6200, telecharge.com\n\nBOTTOM LINE As jukebox musicals go, it's pretty predictable, but you can't beat the music.\n\nSince 1963, 24 singers have belonged to The Temptations (the latest incarnation of the renowned Motown group played NYCB Theatre at Westbury Saturday night). But in the beginning there were five talented young men, led by sole original surviving member Otis Williams, who started the group as a teenager in Detroit after a stint in juvie convinced him to seek another path.\n\nThat's how the story goes in \"Ain't Too Proud — The Life and Times of The Temptations,\" the new musical at the Imperial Theatre. And since it's based on Williams' biography of the group, it seems safe to rely on the facts as presented in this latest entry in the ever-expanding ranks of the \"Jersey Boys\" genre of jukebox musicals.\n\nThis one is often devastatingly sad, as it explores the back story of a group that rose from the rough streets of Detroit to become, in the show's words, \"the No. 1 R&B group in the world.\" With a book by Dominique Morisseau, known for heavy-duty plays like \"Pipeline,\" the show falls victim to the common pitfalls of the bio-musical, bogging down in too much history without a prayer of fitting it all in. Moving quickly past the early successes, it covers familiar territory — the clashing egos, the failed relationships, the debilitating excesses as the stress of life on the road leads to drink and drugs.\n\nWe see Williams (an endearing Derrick Baskin, who serves as narrator throughout) recruit the rest of the original five, after some mistakes ending up with Melvin Franklin, Eddie Kendricks, David Ruffin and (no relation) Paul Williams, played with impressive vocals by Jawan M. Jackson, Jeremy Pope (straight from \"Choir Boy\"), Ephraim Sykes and James Harkness.\n\nTold through the deep, memorable Motown catalog, the show, directed by Des McAnuff (\"Jersey Boys\"), works best when it relies on great songs like \"Papa Was a Rollin' Stone,\" \"My Girl,\" \"In the Still of the Night\" (though many are frustratingly interrupted or cut short). Choreographer Sergio Trujillo gives the singers slick moves considerably more polished than the originals ever managed, while Robert Brill's efficient turntable set is highlighted by Peter Nigrini's projections that provide location and historical context.\n\n\"I never meant to be the last one standing,\" says Williams, who ends the show talking about the passings of other members of the group, as well as the heartbreaking loss of the son he all but ignored, dead in a construction accident at 23. But \"nothing winds back but a song,\" he says, standing alone on stage, reflective, grieving but most definitely proud.\n\nBarbara Schuler is Newsday's theater critic, reviewing openings on and off Broadway as well as on the Island.\n\n2:15\n \n WATCH NOW\n LI's Kevin James brings 'The Crew' to Netflix\n \n \n \n \n \n \n \n \n \n 'How It Feels to Be Free': Fascinating, informative PBS doc\n \n \n \n \n \n \n \n \n \n TCM highlights: 4 Miss Marples, 'Out of the Past'\n \n \n \n \n \n \n \n \n 1:35\n \n WATCH NOW\n LI pastor stars in new reality series\n \n \n \n \n \n \n \n \n \n 'WandaVision': Marvel universe meets 1960s sitcoms\n \n \n \n \n \n \n \n \n \n Coming to a screen near you: 20 new movies to stream this winter\n \n \n \n \n Didn’t find what you were looking for?\n Try our new Search",
  "isFullReview": true,
  "textWordCount": 583,
  "archivePath": "data/archives/reviews/aint-too-proud-2019/newsday--barbara-shuler_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:09:36.128Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20210117155545",
  "archiveOrgUrl": "http://web.archive.org/web/20210117155545/https://www.newsday.com/entertainment/theater/aint-too-proud-temptations-1.28731283",
  "wordCount": 583,
  "tierReason": "Full review text"
}