{
  "showId": "aint-too-proud-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2019/03/21/aint-too-proud-a-ball-of-confusion/",
  "publishDate": "2019-03-21T21:33:12",
  "fullText": "A confession: I think Jersey Boys is, hands down, the best jukebox musical ever written. If you were, say, teaching a class on how to write a jukebox musical—and I’m sure somewhere, someone is doing just that—Jersey Boys could compose the entire curriculum. And like it or not, the 2005 Four Seasons–themed Tony-winning Broadway hit opened the floodgates to a whole series of pop-star-driven biomusicals—none of which could match its success or, more important, quality. (Except perhaps Beautiful, the Carole King musical, which lives up to its title.) Regrettably, that list of lesser jukebox shows now includes Ain’t Too Proud—The Life and Times of the Temptations, which just opened at Broadway’s Imperial Theatre.\n\nThe Jersey Boys comparison might seem unfair, but Ain’t Too Proud is practically begging for it. Both shows were masterminded by director Des McAnuff; they feature the military-style synchronized-step choreography of Sergio Trujillo (though his work here, incorporating the Temptations’ signature splits and microphone tosses, is definitely flashier); there’s the same blinding concert-style lighting by Tony winner Howell Binkley; and both stories are related by the singer characters themselves, speaking directly to the audience—here, our narrator is Temptations cofounder Otis Williams (Derrick Baskin), the sole remaining original group member. Heck, Jersey Boys and ATP even both involve the unexpected offstage death of a group member’s child.\n\nOf course, this isn’t the first time McAnuff and his team tried to recapture that old Jersey magic. (See Summer, last year’s ode to disco diva Donna Summer.) But ATP had four chances—out-of-town runs in Berkeley, Calif., Washington, D.C., Los Angeles, and Toronto (curiously, not the Tempts’ hometown, Detroit)—to, as Otis says of famous, and famously ego-driven, lead singer David Ruffin (Ephraim Sykes), catch “lightning in a bottle.” Sadly, there are few sparks at the Imperial.\n\nAs anyone who’s ever watched an episode of Behind the Music will tell you, offstage rock-star drama is the stuff of legend. It’s only natural to assume that the Temptations—there have been 24 Tempts between 1963 and today, and they still perform—would be as tempestuous as any other group. Even a story that focused only on the most famous ones, aka the Classic Five—Williams, Ruffin, high tenor Eddie Kendricks (the charismatic and cool Jeremy Pope, fresh off Choir Boy), rumbly bass Melvin Franklin (Jawan M. Jackson), and smooth baritone Paul Williams (James Harkness)— surely would have provided plenty of Broadway biomusical fodder.\n\nYet ATP possesses all the drama of a datebook; it’s a seemingly endless chronicle of entrances and exits, successes and flameouts, hirings and firings, and illnesses and deaths. A human-resources exec could have written a line like “David was getting addicted to the worst drug of all: the spotlight”—one of the many clunkers Baskin is saddled with. Bafflingly, top-notch playwright Dominique Morisseau, whose Motor City roots run deep—she was born and raised there, and penned the terrific Skeleton Crew, Paradise Blue, and Detroit ’67, aka The Detroit Project (A 3-Play Cycle)—wrote the libretto; it is, however, “based on” the book The Temptations by Otis Williams (with Patricia Romanowski), so perhaps the inspirational-poster-ready line “Sometimes you let go of one dream to get to something bigger” came from Williams, who’s also credited as an executive producer.\n\nBut everyone’s there for the music anyway. I know the woman in front of me, who was mouthing all the lyrics and doing her own intricate in-chair choreography, certainly was. You will hear all the Temptations songs you know and love: the mellow, melodic “My Girl”; the funky, soulful “Papa Was a Rollin’ Stone”; the wistful “Just My Imagination (Running Away With Me),” a showcase for Pope’s sweet falsetto; and many more. And you’ll hear about 10 more tunes from the “legendary”—that’s how it’s billed!—Motown catalog, including, strangely, the Isley Brothers’ “Shout” and three Supremes songs (one would have sufficed). Like the Tempts themselves, the guys take a bit of time to find their groove; their vocals aren’t super-tight (at least not on the night I attended) until more than halfway through Act 1—during their American Bandstand stint, when they sing “Ain’t Too Proud to Beg.” At least Ain’t Too Proud provides a sufficient dose of musical nostalgia.\n\nAin’t Too Proud—The Life and Times of the Temptations opened March 21, 2019, at the Imperial Theatre. Tickets and information: ainttooproudmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial"
}
