{
  "showId": "aint-too-proud-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2019/03/21/aint-too-proud-the-life-and-times-of-the-temptations-with-hits-and-misses/",
  "publishDate": "2019-03-21T21:34:23",
  "fullText": "As subjects for jukebox musicals go, you could hardly do better than the Temptations. If this commercially driven sub-genre generally provides limited creative opportunities, it can at least be a vehicle for great showmanship, a virtue in which the legendary R&B group remains unsurpassed.\n\nFor Ain’t Too Proud: The Life and Times of the Temptations, director Des McAnuff—a veteran of jukebox and rock-infused fare, with credits stretching from the recent Summer: The Donna Summer Musical back to The Who’s Tommy—has recruited a cast of spectacularly talented singers and dancers to celebrate the Temps’ prowess as dynamic, fluid performers, and their string of exuberantly soulful hits. The musical numbers in Ain’t Too Proud—charting such unforgettable singles as “My Girl,” “Just My Imagination (Running Away With Me)” and “Papa Was A Rollin’ Stone,” in addition to classics recorded by other Motown artists—offer more exhilarating entertainment than any delivered in this format since Jersey Boys, another McAnuff staging.\n\nThat’s the good news. The book is usually the trickiest element in a show like this, as the task of threading together a catalogue of familiar tunes can pose a challenge to even the most imaginative librettist. Pulitzer Prize finalist Dominique Morisseau was an intriguing choice for Ain’t Too Proud; like the Temptations, and Motown itself, she hails from Detroit, and has featured the Motor City prominently in a number of her probing plays, in which characters grapple with racism and socio-economic challenges.\n\nSuch concerns would certainly seem relevant in tracing a group of young black men whose music crossed color lines, but who nonetheless faced the same struggles as other African-Americans, as well as the turbulence experienced throughout the country during their rise in the 1960s. At one point in the musical, the group gets shot at while traveling in the South; at another, news arrives of the Reverend Martin Luther King Jr.’s assassination, setting up a plaintive reading of “I Wish It Would Rain.”\n\nBut Morisseau’s libretto—based on the book “The Temptations” by Otis Williams, founding member and sole survivor of the group’s original and classic incarnations—ends up resting heavily on platitudes, perhaps influenced too much by its source (which this reviewer hasn’t read, admittedly), or by demands to cater to nostalgia and sentimentality. The character of Otis, played by Derrick Baskin with a robust voice and easy charm, narrates the story, which traces tensions among the band members, particularly those in the “Classic Five” lineup, and with Motown founder Berry Gordy, slickly played by Jahi Kearse.\n\n“Once the white audience thinks they know you, you can’t go switching on them,” Gordy lectures at one point. “You have to serve them music in a way that’s digestible.” In another scene, the Temps’ Paul Williams, sweetly played and gorgeously sung by James Harkness, laments to Otis, “Who knew you could be on top of the world and still feel beneath it?”\n\nOther characters can flirt with unfortunate stereotypes, or seem underdeveloped. The Temptations’ longtime manager Shelly Berger, who is white and Jewish, is portrayed as callously consumed with business, with Joshua Morgan fretting and glowering dutifully in the part. As Otis’s wife, Josephine, the supple-voiced Rashidra Scott is relegated to the stock role of long-suffering artist’s spouse, alternately pining for and scolding her husband while worrying for their young son.\n\nOf course, few fans will flock to Ain’t Too Proud expecting fully fleshed out portraits of women or other identity groups. The songs are the draw, and on that count the musical delivers potently and consistently. There is, in some of the singing, the kind of overzealousness that makes a case for the American Idol-ization of certain Broadway musicals. Ephraim Sykes, as Ruffin, indulges his own dazzling virtuosity with little restraint—and with no shortage of encouragement from the audience, who at the preview I attended predictably rewarded each melisma-laden howl and acrobatic dance trick with rapturous applause.\n\nAs Eddie Kendricks, another member of the “Classic Five” lineup, Jeremy Pope—arriving fresh off his star turn in Choir Boy—better captures the discretion and sheer ease that also distinguished the group’s performances and recordings, wielding his fluttery tenor through “Just My Imagination” with a shimmering grace. Choreographer Sergio Trujillo, too, does an admirable job of channeling the Temptations’ famously smooth moves, as well as their effortless buoyance, injecting enough flamboyant athleticism to keep the crowd happy.\n\nAnd the hits keep coming. A trio of singers playing the Supremes, bedazzling in fitted, sparkling gowns—costume designer Paul Tazewell also captures the sartorial elegance Gordy insisted on for his top male group—arrives to perform a medley, and later joins the Temps for the sumptuous supergroup pairing “I’m  Gonna Make You Love Me.” Nasia Thomas gamely tries to emulate Tammi Terrell’s inimitable, tangy soprano for the Terrell/Marvin Gaye gem “If I Could Build My Whole World Around You,” performed here as a duet with Ruffin, Terrell’s troubled beau.\n\nIf none of the virtuosic performances in Ain’t Too Proud match the effortless sweetness and soulfulness of the original recordings, the abundance of talent and energy onstage is something to marvel at in its own right.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-roundup"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "If none of the virtuosic performances in Ain't Too Proud match the effortless sweetness and soulfulness of the original recordings, the abundance of talent and energy onstage is something to marvel at in its own right. Melissa",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Critics-Come-See-About-AINT-TOO-PROUD-On-Broadway-20190321"
}
