{
  "showId": "aint-too-proud-2019",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2019/03/21/theater/aint-too-proud-review-the-temptations.html?partner=IFTTT",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "While honoring all the expected biomusical clichés, which include rolling out its subjects' greatest hits in brisk and sometimes too fragmented succession, this production refreshingly emphasizes the improbable triumph of rough, combustible parts assembled into glistening smoothness.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Critics-Come-See-About-AINT-TOO-PROUD-On-Broadway-20190321",
  "contentTier": "complete",
  "fullText": "https://www.nytimes.com/2019/03/21/theater/aint-too-proud-review-the-temptations.htmlShare full article2727Advertisement\n\nAs befits a show about the Temptations, the most infectiously rhythmic of chart-topping R&B groups, “Ain’t Too Proud” keeps time in style. I don’t mean that solely in terms of a beat that makes you feel like dancing.\n\nOf course, as you watch this latest entry in Broadway’s ever-expanding jukebox musical sweepstakes, you will no doubt find your legs twitching, as if from muscle memory. That’s the urge being translated with such sublime grace by those five natty men on the stage, Platonic ideals of stepping high and looking fine.\n\nBut it is also true that time, unforgiving and unstoppable, is cannily presented as the shaping element in “Ain’t Too Proud: The Life and Times of the Temptations,” which opened on Thursday under the shrewd direction of Des McAnuff, with sensational choreography by Sergio Trujillo. As the show charts the changing fortunes of men who became synonymous with Motown’s glory days, the years keep moving forward with the relentlessness of a conveyor belt in an auto-making assembly line.\n\n[Read about Cholly Atkins, the real-life choreographer for the Temptations.]\n\nIt’s enough to wear a strong man down. And more than any of the (oh so many) pop-songbook shows that have befallen Broadway since the Abba-spouting behemoth “Mamma Mia!” opened in 2001, “Ain’t Too Proud” is a story of attrition. We watch as the core lineup of the original Temptations is whittled down to the last man standing. That’s the group’s leader and show’s narrator, Otis Williams, played with anchoring gravity by Derrick Baskin.\n\nUltimately, though, it’s the music that’s the sole survivor. And that’s what’s being celebrated here — the collective miracle of a blissfully silken sound forged out of clashing egos, many misfires and life-wrecking hard work into numbers that keep playing in our memories.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 322,
  "archivePath": "data/archives/reviews/aint-too-proud-2019/nytimes--ben-brantley_2026-02-05.html",
  "textFetchedAt": "2026-02-05T00:59:19.290Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203956",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203956/https://www.nytimes.com/2019/03/21/theater/aint-too-proud-review-the-temptations.html?partner=IFTTT",
  "wordCount": 322,
  "tierReason": "Full review text"
}