{
  "showId": "aint-too-proud-2019",
  "outletId": "san-jose-mercury-news",
  "outlet": "The Mercury News (Karen D'Souza)",
  "criticName": "Unknown",
  "url": "http://www.mercurynews.com/2017/09/15/review-new-temptations-musical-throbs-to-life-at-berkeley-rep/",
  "playbillVerdictUrl": "http://www.mercurynews.com/2017/09/15/review-new-temptations-musical-throbs-to-life-at-berkeley-rep/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Many a generation seduced by the Motown sound may well die and go to cloud nine after seeing “Ain’t Too Proud — The Life and Times of the Temptations.”\n\nA propulsive new musical driven by group founder Otis Williams’ life story, “Ain’t” is making its world premiere at Berkeley Repertory Theatre with its eyes on Broadway. Directed by a master of the genre, Des McAnuff, of “Jersey Boys” and “Tommy” fame, this ambitious Motown biography throbs with grit and groove. We learn the backstory of the legendary R&B band, how five young black men came to fame in a white world, how they found their voice in their music even as cries of despair filled the streets in the Civil Rights era.\n\nIf the audacious show sometimes overreaches its grasp at this point, the sheer pleasure and utter precision in the musical interludes buoys the rest of the production. At its finest moments, the songs and the subtext find a harmony. The more American society seemed to break down, the smoother and slicker the Temptations got. Their syncopation became their salvation.\n\nSergio Trujillo’s thrumming choreography nails the sense of freedom and rebellion that emanates from those groovy moves. Racists may shoot at their tour bus when they dare to play in the South, but on stage no one can touch them.\n\nMcAnuff sucks us in from the first doo-wop notes to the last flashy spins. The amiable Derrick Baskin rivets as Williams, the backbone of the group and the narrator of the tale. The intense Ephraim Sykes sweats his soul out onto the stage as the volatile showboat David Ruffin in “I Wish it Would Rain,” while Jeremy Pope sings like an angel as the cheeky Eddie Kendricks.\n\nBaskin and Jarod Joseph (as the group peacemaker Melvin Franklin) share a palpable camaraderie, the balm of brotherhood.\n\nStill some of show business tropes feel tired, from shattered marriages and neglected children to drug abuse. What elevates the production above the jukebox genre is Dominique Morisseau’s book, which grounds all that iconic music in the rawness and realness of staring bigotry in its ugly face and not backing down. Now more than ever, the magnitude of what the band accomplished, crossing over into the mainstream, and what they sacrificed to get there resonates. If the book delved even more forcefully into the political strife of the period, the musical would cut even deeper to the bone.\n\nAs it is, the narrative bogs down in talky patches that disrupt the flow. Otis’ narration sometimes repeats itself and the first act runs on too long.\n\nAlong the way there are some missed opportunities, notably not giving the character of Josephine (Rashidra Scott) Otis’ long-suffering wife, more chance to shine. Scott’s got the kind of honeyed pipes that beg to be heard.\n\nMeanwhile too much time spent on The Supremes only distracts from the heart of the story. If McAnuff can pare back the extraneous moments, the electrifying songs would pop that much harder.\n\nThis is music as the heartbeat of the times. The show feels truest to itself when that sublime sound washes over us. Jamming through iconic songs like “Papa Was a Rollin’ Stone,” “Just My Imagination” and the title song is a study in the craft of the crooner.\n\nThere’s nothing like the irresistible beat of the “Temptations” singing through the pain, singing through the fear, singing through the decades.\n\nBy Dominique Morisseau, presented by Berkeley Repertory Theatre\n\nWhere: Berkeley Rep’s Roda Theatre, 2015 Addison St.\n\nRunning time: 2 hours 40 minutes, one intermission\n\nTickets: $40-$125; 510-647-2949, www.berkeleyrep.org\n\nWarning\n \n \n \n \n\nEmail(required)\n\n \n \n \n \n \n \n \n \n Warning\n \n \n \n \n\nWebsite\n\n \n \n \n \n \n \n \n \n Warning\n \n \n \n \n\nMessage\n\n \n \n \n \n \n \n \n \n Warning",
  "isFullReview": true,
  "textWordCount": 603,
  "archivePath": "data/archives/reviews/aint-too-proud-2019/the-mercury-news-karen-dsouza--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:48:39.332Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 603,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T00:48:42.685Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about the world premiere at Berkeley Repertory Theatre, not the current Broadway run.; kimi: This review covers the world premiere production at Berkeley Repertory Theatre, not the current Broadway run. The text explicitly states the show is 'making its world premiere at Berkeley Repertory Theatre with its eyes on Broadway,' indicating this is a pre-Broadway regional production.",
  "promptVersion": "5.2.0",
  "wrongProduction": true
}
