{
  "showId": "take-me-out-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2022/04/04/take-me-out-a-solid-three-bagger/",
  "publishDate": "2022-04-04T21:55:58",
  "fullText": "To my knowledge, in the 20 years since Take Me Out won the Best Play Tony, no active major league baseball player has come out of the closet. Certainly not one on the superstar level of Darren Lemming, All-Star center fielder for the fabled New York Empires, whose personal revelation is the inciting incident for what Richard Greenberg’s characters keep calling a whole lot of “mess.” The absence of that particular cultural shift in real life means that in a central sense, the work has in no way dated.\n\nYet Greenberg’s biggest popular hit is much more than speculative fiction about fallout over a megastar’s sexuality. What’s truly impressive is the number, variety and depth of variations on the theme of personal identity that the author manages to coherently weave into his tale, most of which are successfully realized in Scott Ellis’ revival at the Helen Hayes Theater under the aegis of Second Stage.\n\nThere’s the phenom of the “pheenom,” the individual of godlike accomplishment (a comparison Darren and others make numerous times). Greenberg recognizes the dangers of extreme narcissism, when a gifted individual starts to believe their own press. (For instance, displays of ill-advised machismo on an awards show, or the announcement in a political campaign that one could shoot someone on Fifth Avenue without losing voters.) Jesse Williams, the assured Gray’s Anatomy star making his Broadway debut as Darren, recognizes the peril as well, executing an absolutely smashing transformation from a larger-than-life, remote icon to a lonely little – yes, little – figure, suddenly aware that his choices have left him bereft of intimacy, with only his World Series rings to keep him warm.\n\nIn that vein, Greenberg explores friendship in its many forms, particularly workplace friendship: To what extent have those thrust together by their livelihood, truly bonded? And in such possibly makeshift relationships, what is owed by one party to the other? These questions lead to a moral dilemma for Kippy (now played by Bill Heck), the Empires’ shortstop and resident team intellectual (translation: he’s read some books). Jesse Tyler Ferguson plays the key role of Mason Marzac, the gay accountant and baseball-phobe who becomes an ardent convert. Greenberg has spoken at length about his own late-in-life baseball passion, and you can feel that in the historical anecdotes and metaphorical perspectives that cascade from Mason throughout the evening. The role dovetails nicely with Ferguson’s sitcom Mitchell Pritchett, professional at work and bumbling at home. And though the droll Denis O’Hare owned the part (and a Tony) back when, the bubbly Ferguson is sweet where O’Hare was dry and makes it his own.\n\nIt’s not surprising that the author of Eastern Standard – the first Broadway play I can remember taking on the rich/poor divide with incisiveness and wit – should have class issues on his mind, especially considering the amount of baseball talent that emerges from the poverty spectrum. Enter the utterly inarticulate, boorish, racist Shane Mungitt (Michael Oberholtzer), up from Double A Utica with a wicked fastball promising to save the Empires’ season, and a wicked mouth making him Darren’s inadvertent but inevitable antagonist. Oberholtzer is a revelation in this part. He finds multiple variations in Shane’s thick-minded cluelessness, and you can see him go to pieces by inches (paralleling Williams’ disintegration, come to think of it). At its lowest ebb, the role could devolve into sheer shouting, but this actor turns it into a heartbreaking crescendo of grief. Amazing work.\n\nDirector Ellis keeps all the thematic balls in the air at a peppy pace, but with some loss of edge. A strong emphasis on humor means that moments that could be fraught are tamped down. The players’ ragging, for instance, feels much less authentically mean than in Joe Mantello’s original (which itself fell short of the All-Star sniping in the 1973 movie classic Bang the Drum Slowly). Antagonism of, and toward, the non-native born players (Julian Cihi, Hiram Delgado, and Eduardo Ramos) gets lost in the shuffle.\n\nMost crucially, the climactic standoff between Darren and Davey Battle (Brandon J. Dirden), his staunchly Christian best friend, is undercut by the conception of Davey as a jaunty hail-fellow, rather than as a star of equal intensity who seethes because he’s on a worse team. On past evidence Dirden can play anything, and probably the intent was to highlight the about-face when he rears back Biblically to condemn Darren as, in his words, “a pervert.” But the expected electric shock when preacher confronts pervert sputters; it’s too big of a leap.\n\nEllis places most of the play’s gut punches – notably the two act breaks, though the second intermission is omitted – in the capably Expressionist fists of set designer David Rockwell and lighting designer Kenneth Posner. The momentary effects are achieved but curiously seem unearned, out of scale somehow to the human confrontations. More seamless is Mikaal Sulaiman’s stellar sound design, layering cheers and gasps so you can’t separate the recorded ones from the live.\n\nAnd isn’t that how it should be? Ellis and Greenberg evidently share the belief that baseball is the most democratic of pastimes, perhaps even more so than theater, where a commonality of values often reigns. At the stadium, wealthy and strapped, left and right, white-collar and blue- come together in a celebration of teamwork and individual skill, and this play exploring individual identity knows that the group identity of “fan” unites us. It almost makes a trip to the Helen Hayes a requirement in these polarized times.\n\nTake Me Out opened April 4, 2022, reopened October 27 at the Gerald Schoenfeld Theatre and runs through January 29, 2023. Tickets and information: takemeoutbway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
