{
  "showId": "take-me-out-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "https://variety.com/2022/legit/reviews/take-me-out-review-broadway-jesse-williams-1235224000/",
  "playbillVerdictUrl": "https://variety.com/2022/legit/reviews/take-me-out-review-broadway-jesse-williams-1235224000/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Public and personal identities are constantly being examined, teased and tested in Richard Greenberg's \"Take Me Out,\" his grand paean to baseball and ontological quandaries, which is receiving a starry and satisfying Second Stage revival at the Helen Hayes Theatre on Broadway.\n\nIt's been 20 years since the play first stunned audiences with its rich writing, provocative themes and a locker room full of naked men. (And still an active major league player has yet to step up to the bat and come out as gay.)\n\nDirected by Scott Ellis, this revival, too, is a solid hit, despite a few grounding errors. It should also prove to be popular for all market segments, especially with its triple-play of television favorites: two who are taking their Broadway bows for the first time, along with a beloved stage veteran.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nJesse Williams, a popular star of \"Grey's Anatomy,\" is impressive as the embodiment of charisma and cool, Darren Lemming, a biracial, superstar hitter of the New York Empires (read Yankees). When the seemingly self-assured, Teflon-coated slugger nonchalantly announces he is gay, it sets in motion a series of events that ultimately reveal more than the players imagined about themselves.\n\nThe storyline moves forward — and sometimes effectively backward — with narration by erudite teammate Kippy Sunderstrom (a personable Patrick J. Adams of TV's \"Suits,\" who makes the most of the wry and observant shortstop).\n\nBut it's the arrival of Darren's new, nebbishy money manager, Mason Marzac (Jesse Tyler Ferguson) — a lonely, sports-averse, older gay man who gets swept up in the glory of the game — that elevates the play to a league of its own, giving it both heart and soul.\n\nMason is a stand-in not only for Greenberg but for any outsider who discovers a particular passion that brings them into a kind of clubhouse. As Mason movingly tells his new sports hero, \"Life is so tiny, so daily and you take me out of it.\"\n\nFerguson hysterically taps into the thrill of it all with his trademark comic flutters. But he also gives Mason a tender earnestness that makes the transformation into Number One Fan both real and profound. The character's rhapsodic soliloquies on why baseball is better than democracy and on the poetry of the home run trot are odes in which Ferguson exults.\n\nThings change and darken when loner Shane Mungitt (Michael Oberholtzer), a sizzling pitcher from the minor leagues, joins the team. When the redneck's racist and homophobic remarks result is a temporary suspension, it places the team in turmoil and reveals cracks in how the characters see themselves. Also complicating the play's psycho-social dynamics is image-conscious, self-actualizing Davey (a riveting Brandon J. Dirden), Darren's morally righteous baseball bud and a trigger that leads to tragic consequences.\n\nThe production has its share of whiffs: Some of Adams' narration is overly-measured; a jailhouse scene is a one-note yell-fest; Oberholtzer's Shane is cretinous to the point of unbelievability; the GQ handsomeness of every teammate takes one out of baseball's scruffier reality; and David Rockwell's set is underwhelming for a work that calls for at least a bit of visual majesty.\n\nWhile the play's title has a multitude of clever meanings (five, at last count), abundance is not always an asset. Despite some new tweaks, Greenberg's ambitious script still has a pile-on of themes, dealing with gender, race, sexuality, celebrity and spirituality, not to mention major league sports.\n\nBut the playwright and this production still manage to bring it home in the play's ninth inning with a graceful, bittersweet denouement that leaves characters still searching, still discovering and still in play for another season.",
  "isFullReview": true,
  "textWordCount": 631,
  "archivePath": "data/archives/reviews/take-me-out-2022/variety--frank-rizzo_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:18:53.321Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 631,
  "tierReason": "Full review text"
}