{
  "showId": "the-gin-game-2015",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "https://www.nytimes.com/2015/10/15/theater/review-james-earl-jones-and-cicely-tyson-shuffle-emotions-in-the-gin-game.html",
  "publishDate": "October 14, 2015",
  "fullText": "https://www.nytimes.com/2015/10/15/theater/review-james-earl-jones-and-cicely-tyson-shuffle-emotions-in-the-gin-game.htmlShare full article1919Advertisement\n\nWeller Martin and Fonsia Dorsey, residents of a modest retirement home and the sole characters in D. L. Coburn’s 1976 play, “The Gin Game,” have withdrawn from the world, willingly or not, and await the inevitable end with minimal protest. By contrast, James Earl Jones and Cicely Tyson, who are playing these roles in the excellent Broadway revival of Mr. Coburn’s flinty comedy, still seem to be in their glowing prime, actors with long and distinguished careers behind them who nevertheless keep seeking further heights to scale.\n\nScale them they do: Mr. Jones, 84, has appeared on Broadway a remarkable six times in the past decade. Ms. Tyson, 90, won a well-deserved Tony Award just two years ago for her luminous performance in “The Trip to Bountiful.”\n\nAlthough it won a Pulitzer Prize during a fairly lean period for American playwriting, Mr. Coburn’s play cannot exactly be called an Everest of contemporary drama. Still, it proves a sturdy, humming vehicle, its gentle comedy undergirded by dark emotional coloring. Onstage for virtually all of its two-hour running time, Mr. Jones and Ms. Tyson draw out all its nuances, as Weller and Fonsia bicker and make nice over a card table. These two superlative performers establish beyond doubt, if we needed any reminding, that great talent is ageless and ever-rewarding.\n\nOn its surface, “The Gin Game,” which opened on Wednesday night at the John Golden Theater in a production cleanly directed by Leonard Foglia, could hardly be simpler: Set entirely on the porch of the home where Weller and Fonsia have none too happily come to rest (designed in gritty detail by Riccardo Hernandez), it depicts their sometimes friendly, sometimes testy relationship, which is stirred into life when the terminally bored Weller first spies in Fonsia the potential card partner he’s been pining for.\n\nShe at first demurs, claiming little knowledge of gin rummy and requiring some rudimentary reminders. Soon, however, Fonsia is winning hand after hand, racking up points. Weller’s courtly surprise turns to frisky irritation and, ultimately, foul-mouthed fits of rage that send Fonsia stalking away.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Mr. Jones and Ms. Tyson bring such depth of feeling and lived experience to their roles that the evening becomes something deeper and more affecting than the sum of its parts.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mr. Jones and Ms. Tyson bring such depth of feeling and lived experience to their roles that the evening becomes something deeper and more affecting than the sum of its parts.",
  "contentTier": "complete",
  "contentTierReason": "Short text (31 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://www.nytimes.com/2015/10/15/theater/review-james-earl-jones-and-cicely-tyson-shuffle-emotions-in-the-gin-game.html",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "previousUrl": "https://www.nytimes.com/2015/10/15/theater/review-the-gin-game-stars-james-earl-jones-and-cicely-tyson.html",
  "urlDiscoveredAt": "2026-02-04T01:23:29.918Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 373,
  "archivePath": "data/archives/reviews/the-gin-game-2015/nytimes--charles-isherwood_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:23:29.921Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426204009",
  "archiveOrgUrl": "http://web.archive.org/web/20250426204009/https://www.nytimes.com/2015/10/15/theater/review-james-earl-jones-and-cicely-tyson-shuffle-emotions-in-the-gin-game.html",
  "wordCount": 373,
  "tierReason": "Full review text"
}