{
  "showId": "in-transit-2016",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "https://dougmarino.blogspot.com/2016/11/in-transit.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"It does most assuredly entertain. Are the stories fluffy, probably. Are they stereotypical, likely. But for sure, they are fun, they are mostly real, and definitely New York stories...It was basically tightened, honed, and amp'd up just a bit for the Broadway...Choreographed by Kathleen Marshall, the movements are brisk, crisp, and keep the show's train moving forward...This incarnation of the show is zippy, toe-tapping, touching, and upbeat with a heartwarming message.\"\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 403,
  "archivePath": "data/archives/reviews/in-transit-2016/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:39:22.360Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "We have a new incarnation of a show I saw off-Broadway in 2010 at 59E59 Theater. It really does take time to stew, to mature, and frankly to get the funds to mount an attack on Broadway. Of course you have to be good, but there was never any doubt even when I saw this show back 6 years ago that it was a keeper. Penned by a group of tremendously talented singers and artists - this a-capella musical may not contain the solution to solving world hunger or climate change - but it does most assuredly entertain. Are the stories fluffy, probably. Are they stereotypical, likely. But for sure, they are fun, they are mostly real, and definitely New York stories. The subway. The bowels all New Yorkers hate and equally need. They're dirty, they're crowded, and they are what brings us all together gets us where we are going - both literally and figuratively. This time around I am fairly sure the main components of the story have remained but without a video tape to watch the prior performance and only memory to go on, I'd say it was basically tightened, honed, and amp'd up just a bit for the Broadway. There's still a gay couple, Trent (Justin Guarini) and Steven (Telly Leung) with a wedding problem, an actress, Jane (Margo Seibert) looking for her big break, a spot-on subway clerk, Althea, behind the glass (Moya Angela), a wall street guy , Nate, who made a little email mistake trying to make a change (James Snyder), and of course a beat-boxer extraordinaire, Boxman, (Steven \"Heaven\" Cantor). All the sounds you hear come from someone's vocal cords - no instruments, all vocals. Subway seats fly on and fly off - actors parade back and forth on a narrow stage close up to the audience to reveal their stories in the round and up a flight of stairs on a platform above the tracks. Choreographed by Kathleen Marshall, the movements are brisk, crisp, and keep the show's train moving forward. Love is lost, then found again. Friends and enemies are made and the zany antics of the subway are ever present. This incarnation of the show is zippy, toe-tapping, touching, and upbeat with a heartwarming message. Some might say sappy, others would just say fun. Head over to Circle in the Square and head Deep Beneath the City in more ways than one.",
  "_showNotMentionedDiscoveryAttempted": true
}
