{
  "showId": "in-transit-2016",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Marcus Ben Brantley",
  "url": "http://www.nytimes.com/2016/12/11/theater/in-transit-review.html",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "show-score-playwright"
  ],
  "bwwExcerpt": "Every now and then, as yet another peppy cliché prances across the stage of the Circle in the Square Theater, you may pause to ponder the pioneering achievement of \"In Transit,\" the singing portrait of New York City subway travelers, which opened on Sunday night. After all, what you're listening to often gleams with the blended polyphony of a good-size band. Yet not an instrument has been used in the performance of this a cappella musical, staged by the Tony-winning director and choreographer Ka",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-IN-TRANSIT-Opens-on-Broadway-Updating-LIVE-20161211",
  "contentTier": "needs-rescrape",
  "showScoreExcerpt": "\"Every now and then, as yet another peppy cliché prances across the stage, you may pause to ponder the pioneering achievement of 'In Transit'...Acknowledging this is rather like admiring the ingenuity that must have gone into a sentimental picture of a rainbow...The likable, hard-working cast does achieve marvels of vocal synchronicity...But the Broadway-style belters’ voices, which are abrasively amplified, are often at odds with the aural smoothness of a cappella.\"\n\nRead more",
  "fullText": "Every now and then, as yet another peppy cliché prances across the stage of the Circle in the Square Theater, you may pause to ponder the pioneering achievement of “In Transit,” the singing portrait of New York City subway travelers, which opened on Sunday night. After all, what you’re listening to often gleams with the blended polyphony of a good-size band.\n\nYet not an instrument has been used in the performance of this a cappella musical, staged by the Tony-winning director and choreographer Kathleen Marshall. Everything we hear, as we are told in a (sung) preshow announcement, is created by human voices.\n\nAcknowledging this is rather like admiring the ingenuity that must have gone into a sentimental picture of a rainbow, perhaps with the Care Bears in the foreground, rendered entirely in bottle caps. It’s definitely something to have achieved such visual specificity out of bottle caps. But it’s still a picture of a rainbow with Care Bears.\n\nMuch collaborative good will and effort have clearly been poured into “In Transit,” written and composed by Kristen Anderson-Lopez, James-Allen Ford, Russ Kaplan and Sara Wordsworth. The production’s significant behind-the-scenes eminences include, in addition to its music supervisor (Rick Hip-Flores), the a cappella arranger Deke Sharon, the “vocal producer” on the “Pitch Perfect” movies and the star of the reality show “Pitch Slapped.”\n\nSuch shows suggest how mainstream the phenomenon has become. (Try typing “a cappella” in a YouTube search and you’ll see contributions from the Muppets and Key & Peele, as well as specialty artists like Pentatonix.) So why not bring it to Broadway, which has recently become uncharacteristically welcoming to nontraditional musicals? (See: “Hamilton,” “Natasha, Pierre & the Great Comet of 1812.”)\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 306,
  "archivePath": "data/archives/reviews/in-transit-2016/nytimes--marcus-ben-brantley_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:45:25.921Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251026172439",
  "archiveOrgUrl": "http://web.archive.org/web/20251026172439/https://www.nytimes.com/2016/12/11/theater/in-transit-review.html",
  "duplicateTextOf": "nytimes--ben-brantley.json",
  "wordCount": 306,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T14:58:32.023Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: Text ends with 'We are having trouble retrieving the article content. Please enable JavaScript' - this is a technical error message, not a complete review; openai: The review text is truncated and includes a message about retrieving article content, making it incomplete and not scoreable.; gemini: The review is incomplete and states \"We are having trouble retrieving the article content.\"",
  "promptVersion": "5.2.0"
}
