{
  "showId": "oslo-2017",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2017/legit/reviews/oslo-review-broadway-1202023735/",
  "publishDate": "April 13, 2017",
  "fullText": "Following a well-received Off Broadway run last year, the Lincoln Center Theater production of J.T. Rogers’ play “Oslo” opened April 13 at Broadway’s Vivian Beaumont Theater. The cast was the same, although the Broadway staging eliminated the second intermission of the Off Broadway original. The following is a lightly edited version of Marilyn Stasio’s review of that initial production, which ran in Variety on July 11, 2016.\n\nWhat would it take to get you to Lincoln Center Theater to see a three-hour political drama about the 1993 peace treaty between Israel and the Palestine Liberation Organization known as the Oslo Accords? I doubt this review is going to do it, which is really a shame, because “Oslo,” a new drama by J.T. Rogers, is unequivocally fascinating. Would that some playwright would write as gripping a play about some contemporary political issue.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Bedford Park’ Review: Two Children of Korean Immigrants Make an Unlikely Connection in Touching but Slightly Contrived Drama \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Bridgerton’ Season 4 Part 1 Succeeds Despite Benedict and Sophie’s Lackluster Romance: TV Review\n\nTerje Rod-Larsen (Mays) is the inspired and somewhat excitable academic who dares to reach out to the Israelis to start the delicate and dangerous process of these secret negotiations. Terje is a fussy fellow who dresses so well (costumer Catherine Zuber scores again) and whose manners are so refined that Yitzak Rabin insists on referring to him as a Frenchman. Mona Juul (Ehle), his wife and the narrator of the dramatic events, is the even-tempered government diplomat who does whatever has to be done — from ordering the liquor to putting out emotional fires — to make it happen.\n\n“It’s a very small country,” Mona says to the audience, graciously explaining the extremely tight personal and political relationships. “We take nepotism to an entirely new level.” No, that’s not a one-off quip. Rogers’ (“Blood and Gifts”) clever dialogue really is that witty. You get the facts, but you get them delivered with intelligence and humor by this dream of a cast. It’s the petty stuff — the pseudonyms, the clandestine phone calls, the drinking competitions, and all the other trappings of macho bravado — that makes these intimidating characters so human. And so funny.\n\nMichael Yeargan’s scenic design and 59 Productions’ projections of constantly breaking battles makes it clear that neutral Norway aspires to be a very soothing nation in a world gone mad. The walls of the classically designed meeting rooms are painted in a restful shade of grayish blue, the furniture is comfortable, and everyone gets exactly the same kind of chair to throw across the room in a rage.\n\nBut once the principals meet each other face-to-face for the first time, we might as well be in the blood-splattered ring of a cockfight. In that spirit, Rogers smartly allows all parties to attack their counterparts with a vengeance, drawing on generations of historical grievances. It actually takes three hours, which fly by like time spent at the circus, to make these mortal enemies calm down enough to listen honestly to one another and acknowledge that they have more in common than they would ever admit.\n\nThe impeccable casting of these superbly drawn characters acknowledges their individual differences, as well as the common humanity that ultimately wins out. Representing the Israelis, Shimon Peres (Daniel Oreskes) is the soul of statesmanship, while his right arm man, Yossi Beilin (Adam Dannheisser), growls like the Russian Communist bear he is. The third member of their group, the swaggering director general of the foreign ministry Uri Savir (Michael Aronov), is the star power, a dashing fellow who wears his floor-length leather coat like a movie star.\n\nThe Israelis are the comedians, deadly serious but always calculating how to disarm their enemies. When given the stage, they stun their PLO counterparts by telling jokes — which leaves the Palestinians to draw on their own ancient tongue and play the poets. No wonder it takes these guys so long to find a common language.",
  "isFullReview": true,
  "dtliExcerpt": "J.T. Rogers has written a gripping political thriller that reads like a John le Carré novel, but one based on real events that changed the course of Middle East diplomacy.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "What would it take to get you to Lincoln Center Theater to see a three-hour political drama about the 1993 peace treaty between Israel and the Palestine Liberation Organization known as the Oslo Accords? I doubt this review is going to do it, which is really a shame, because 'Oslo,' a new drama by J.T. Rogers, is unequivocally fascinating. Would that some playwright would write as gripping a play about some contemporary political issue.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-OSLO-Starring-Jefferson-Mays-and-Jennifer-Ehle-Bows-on-Broadway-Tonight-20170413",
  "showScoreExcerpt": "J.T. Rogers has written a gripping political thriller that reads like a John le Carré novel, but one based on real events that changed the course of Middle East diplomacy.",
  "contentTier": "invalid",
  "contentTierReason": "Short text (30 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://variety.com/2016/legit/reviews/oslo-review-play-1201812346/",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "rejectedAt": "2026-02-04T01:50:42.612Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single promotional sentence or excerpt describing the playwright's work, not a full review with critical evaluation of the Broadway production.; openai: This text is a brief description of the play's genre and style, not an evaluative review of the Broadway production.",
  "promptVersion": "5.2.0",
  "bwwScore": 8
}
