{
  "showId": "indecent-2017",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "https://dougmarino.blogspot.com/2016/06/indecent.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"There's something playing over at the Vineyard Theatre that is nothing short of spectacular. Paula Vogel has penned a superb play within a play. Well-written and crisply acted, this theatre troupe acting as a theatre troupe packs a powerful punch...Director Rebecca Taichman has cleverly and seamlessly nested this play within a play...Vogel's play keeps you riveted and holds your attention throughout the entire production.\"\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 395,
  "archivePath": "data/archives/reviews/indecent-2017/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:59:44.732Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "There's something playing over at the Vineyard Theatre that is nothing short of spectacular. Paula Vogel has penned a superb play-within-a -play based on a true story of a Yiddish theatre troupe in the early 20th century. Well written and crisply acted, this theatre troupe acting as a theatre troupe packs a powerful punch. Not overly Yiddish (as most of us would not understand), but the show employs a clever theatrical device to indicate when they are speaking in English and when they are supposed to be speaking in English. When they are supposed to be speaking Yiddish, they speak in clear, fluid English (and there are Hebrew sub-titles). When they are supposed to be speaking English they put on a thick accent. Director Rebecca Taichman has cleverly and seamlessly nested this play-within-a-play. To denote the passage of time (to speed things along) a subtitle occasionally pops up and the actors freeze momentarily (\"In A Blink of Time\" the subtitle reads). The lighting and most costumes are dark and grey - similar to the time and the feeling. Except for an occasional white nightgown, of course. The play-within-a-play focuses on a European Jew who wrote a play that shocked and entertained the high culture all around Europe. When the play came to the USA, it played well downtown (read Avant Garde) theatre scene but when it came to Broadway, the American sensibilities (even in the Jewish community) were outraged. They play was shut down and the cast and creatives arrested for indecency. The play focuses alternatively on the struggle of the playwright and the struggle of the actors. What on earth could be so scandalous? Two girls kissing. Two Jewish girls kissing. Written by a Jew. Acted by Jews. Outraged and already sensitive to being perceived as not fitting in around the world at this time - many love it - many shunned the idea of it. These circumstances are all wrapped up in Ms. Vogel's play which keeps you riveted and holds your attention throughout the entire production. As you would expect, it doesn't end well for this theatre troupe - ending up in the wrong city at the wrong time. The playwright who subsequently moved to America has his own demons and you'll just have to run down to the Vineyard to see how this is all plays out. It's worth the trip.",
  "_showNotMentionedDiscoveryAttempted": true
}
