{
  "showId": "indecent-2017",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Unknown",
  "url": "http://www.theguardian.com/stage/2016/may/17/indecent-broadway-review-lesbian-kiss",
  "playbillVerdictUrl": "http://www.theguardian.com/stage/2016/may/17/indecent-broadway-review-lesbian-kiss",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Adina Verson and Max Gordon Moore in Indecent at the Vineyard Theatre in New York. Photograph: Carol RoseggView image in fullscreenAdina Verson and Max Gordon Moore in Indecent at the Vineyard Theatre in New York. Photograph: Carol Rosegg This article is more than 9 years oldReviewIndecent review – Broadway's first lesbian kiss locks lips once moreThis article is more than 9 years oldVineyard Theatre, New YorkA tender unconventional new play explores the furore created by Sholem Asch’s play God of Vengeance, a flashpoint in Jewish and queer theatrical history\n\nIn 1923, God of Vengeance, a play by the Yiddish writer Sholem Asch moved from the Provincetown Playhouse to Broadway’s Apollo Theatre. Acclaim was not precisely universal. “Ugly, sordid, and repellent beyond any play that has yet been presented on the English-speaking stage,” read one review, by no means the most hysterical. The producer and the cast were promptly arrested and convicted for offering “obscene, indecent, immoral, and impure material”. That the show featured the first lesbian kiss on Broadway may have had something to do with the outcry.\n\nThis story, a small flashpoint in Jewish and queer theatrical history, has long fascinated the playwright Paula Vogel and the director Rebecca Taichman, who trace the origins of the play and the ensuing scandal in a tender, unconventional tribute, Indecent, now at the Vineyard Theater. (Did Obscene or Immoral not make as catchy a title?) In a series of scenes, heralded by supertitles in English and Hebrew and accompanied by klezmer music, seven actors and three musicians play supporters, adversaries and actors in various troupes, from Warsaw to Berlin to St Petersburg and beyond, as they recount Asch’s tale of the daughter of a brothel keeper who falls in love with one of the prostitutes and dares to challenge her father’s hypocrisy. One actor, Richard Topol (affable and deeply moving), plays a single character, Lemml, a young man who falls in love with the play and follows it through its many incarnations as the stage manager.\n\nView image in fullscreenSelf-conscious theatricality: the cast of Indecent. Photograph: Carol RoseggThose supertitles and self-conscious theatricality suggest Brecht, the figure of the stage manager and the air of rueful compassion conjure Thornton Wilder, another strong influence on Vogel. That she and Taichman have managed to mingle the styles of both of these writers, with the comedy and searching moral questioning characteristic of Yiddish literature testifies to the originality and vibrancy of their approach. The somber costuming, by Emily Rebholz, and the expertly stark and gloomy lighting, by Christopher Akerlind, indicate that this story won’t end well, but there’s a unassuming gentleness throughout and immense poignancy in a sequence near the end that pushes past the scandal to an illicit performance in the Łódź Ghetto in 1943.\n\nLike Shuffle Along, now running on Broadway, Indecent is a project of reclamation, an homage and a recuperation of a text that had its cultural moment and then vanished almost entirely. But whereas Shuffle Along seems accepting of only part of the original – the songs, the dances – Indecent has tremendous affection for the whole of the play and makes you long for the scenes – late arriving, but exquisite – when two of the women finally perform Asch’s love scene, a tryst in the spring rain, first in Yiddish, then in English. This was a scene apparently cut for the Broadway transfer as producers feared it would incite moral outrage, though it seems the decency alarmists were quite capable of inciting themselves without it. Their loss. Our great gain.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 609,
  "archivePath": "data/archives/reviews/indecent-2017/guardian--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:51:26.848Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 609,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-04T06:09:59.642Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production at the Vineyard Theatre, not the current Broadway run.; kimi: This review covers the Off-Broadway production at the Vineyard Theatre, not the subsequent Broadway transfer. The text explicitly mentions the Vineyard Theatre and notes the article is more than 9 years old, dating it to the 2016 Off-Broadway run rather than the 2017 Broadway production at the Cort Theatre.",
  "promptVersion": "5.2.0"
}
