{
  "showId": "indecent-2017",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/indecent-review-daring-1923-yiddish-drama-revived-with-wit-1.11805340",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/indecent-review-daring-1923-yiddish-drama-revived-with-wit-1.11805340",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "Updated May 17, 2016 9:00 PM\n By Linda Winer linda.winer@newsday.com\n\nadvertisement | advertise on newsday\n\nWHERE Vineyard Theatre, 108 E. 15th St.\n\nINFO $79; 212-352-3101; vineyardtheatre.org\n\nBOTTOM LINE Moving and important play-with-music about theater history, Jews and lesbians.\n\nAt the risk of oversimplifying, “Indecent,” the moving and fascinating new Paula Vogel work at the Vineyard, is like a “Shuffle Along” about Jews and lesbians. I’ll explain. “Shuffle Along,” the new Broadway hit, is a history-driven musical-about-a-musical that was a breakthrough black show on Broadway in 1921. Until now, it was forgotten by mainstream culture.\n\n“Indecent,” co-conceived with the probing director Rebecca Taichman, is a musical play-about-a-play, Sholem Asch’s “The God of Vengeance.” The Yiddish drama was an international hit throughout Europe, but was closed for obscenity by the vice squad at its censored English-language Broadway premiere in 1923. Until now, it was consigned to the dustbin of marginal dramatic scandals.\n\nSo, in a satisfying coincidence, here we have two thrilling mixtures of entertainment and education — genuine unknown histories of the theater, race and gender.\n\nComparisons aside, however, “Indecent” is also a singular achievement on its own. It is an intimate, 100-minute chamber-sized show, not a Broadway extravaganza. But it is infused with original onstage klezmer music by Lisa Gutkin and Aaron Halva, and tradition-flavored choreography by David Dorfman.\n\nIt is also graced with seven extraordinary actors who portray many different people — sometimes in Yiddish with English subtitles — from 1906 Warsaw to America in the ’50s, from Nazis to assimilated Americans, not to mention the characters in scenes from Asch’s drama.\n\nOur guide is Lemml, the stage manager (Richard Topel, enormously touching), a former village tailor whose life is transformed when he attends the first reading of a first script by young Asch (Max Gordon Moore). Lemml introduces us to the characters who, in many different incarnations, tell their stories. In the center is the story of the controversial play about a Jew who owns a brothel in the basement but tries to keep his daughter, his wife and his Torah pure.\n\n“God of Vengeance” was daring, not just because of the love that grows between his daughter (Adina Verson) and one of the older prostitutes (Katrina Lenk). As we learn through the evening, however, the greater offense was the ugly depiction of a Jewish father (Tom Nelis).\n\nadvertisement | advertise on newsday\n\nTaichman (who did her Yale thesis on “Vengeance”) takes us all over the world on a plain, raised stage powerfully transformed by Riccardo Hernandez’s visual designs, Tal Yarden’s projections and Emily Rebholz’s costumes. For all the darkness of the subject, the staging is witty. The historical perspective is vast and knowing. And the lost story of gay love is profound.\n\nNewsday.com now uses Facebook for our comment boards. Please read our guidelines and connect your Facebook account to comment.",
  "isFullReview": true,
  "textWordCount": 474,
  "archivePath": "data/archives/reviews/indecent-2017/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:51:49.507Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20160526113917",
  "archiveOrgUrl": "http://web.archive.org/web/20160526113917/http://www.newsday.com:80/entertainment/theater/indecent-review-daring-1923-yiddish-drama-revived-with-wit-1.11805340",
  "contentTier": "complete",
  "wordCount": 474,
  "tierReason": "Full review text",
  "bwwExcerpt": "After Paula Vogel's extraordinary play...burst open at the Vineyard Theatre last year, the sad and strange and wonderful piece landed on many annual best-play lists. Yet it was hard to imagine how its specialness...might hold up in a big Broadway house with broad commercial expectations. It is a thrill to report that this 105-minute, multilingual...adventure is a natural fit. It's a gripping and entertaining show with laughter and tears and a real rainstorm in which two women from the marvelous 10-member cast re-enact what, in 1921, had been the first lesbian kiss on an American stage...In her program note, Vogel writes, 'I believe the purpose of theater is to wound our memory so we can remember.' 'Indecent' does that, but it also enchants.",
  "bwwScore": 9
}
