{
  "showId": "hedda-gabler-2009",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/hedda-gabler-82395/",
  "publishDate": "January 26, 2009",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Mary-Louise Parker brings fierce intelligence and psychological complexity to Ibsen's manipulative heroine, making this revival crackle with dangerous energy.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mary-Louise Parker brings fierce intelligence and psychological complexity to Ibsen's manipulative heroine, making this revival crackle with dangerous energy.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 635,
  "archivePath": "data/archives/reviews/hedda-gabler-2009/hollywood-reporter--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:58:20.078Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "NEW YORK — A clothing company known for its racy ads is fighting a $10 million lawsuit brought by Woody Allen, arguing that it can’t have damaged his reputation by using his image because the film director has already ruined it himself.\n\nThe 73-year-old Allen started the fight against American Apparel Inc. when he sued the company last year for using his image on the company’s billboards in Hollywood and New York and on a Web site.\n\nAllen, who does not endorse products in the United States, said he had not authorized the displays, which the Los Angeles-based company said were up for only a week.\n\nNow the company plans to make Allen’s relationships to actress Mia Farrow and her adopted daughter Soon-Yi Previn the focus of a trial scheduled to begin in federal court in Manhattan on May 18, according to the company’s lawyer, Stuart Slotnick.\n\n“Woody Allen expects $10 million for use of his image on billboards that were up and down in less than one week. I think Woody Allen overestimates the value of his image,” Slotnick said.\n\n“Certainly, our belief is that after the various sex scandals that Woody Allen has been associated with, corporate America’s desire to have Woody Allen endorse their product is not what he may believe it is.”\n\nOne billboard featured a frame from “Annie Hall,” a film that won Allen a best-director Oscar. The image showed Allen dressed as a Hasidic Jew with a long beard and black hat and Yiddish text. The words “American Apparel” also were on the billboard.\n\nAllen’s lawsuit said the billboard falsely implied that Allen sponsored, endorsed or was associated with American Apparel.\n\nSlotnick said it was not a cheap shot to bring up Allen’s sex life in a lawsuit over the billboard and Internet ads.\n\n“It’s certainly relevant in assessing the value of an endorsement,” he said, noting that Olympic swimmer Michael Phelps lost endorsement power after a photograph surfaced of him using marijuana.\n\nFarrow starred in several of Allen’s movies during a relationship with the director that ended in 1992, when she discovered he was having an affair with her oldest adopted daughter, then 22. Allen married Soon-Yi Previn in 1997.\n\nDuring a bitter custody fight, Farrow accused Allen of sexually abusing their adopted daughter Dylan, 7. Allen was exonerated of the abuse charges, but Farrow won sole custody of the children.\n\nLeslee Dart, a spokeswoman for Allen, said Friday that she does not believe Allen wants to comment on the litigation at this point.\n\nAmerican Apparel is known for its provocative ads of scantily dressed young models in tight-fitting and sometimes see-through garments.\n\nAllen testified at a December deposition that he considered the company’s advertising to be “sleazy” and “infantile.”\n\nLawyers for American Apparel have complained that Allen has refused to turn over much of the information they have demanded to prepare for trial.\n\nAmong their demands were documents concerning any endorsement requests that were withdrawn after the sex scandal with Farrow and Previn became public.\n\nThe documents defined sex scandal as “your relationship with Soon-Yi Previn including the discovery … (of) nude pictures you took of Soon-Yi Previn.”\n\nThe lawyers also requested documents concerning Allen’s public image and reputation, including his contention during his deposition that he was a “special kind of entity” or a “special taste.”\n\nAllen’s attorneys said the request for documents related to the sex scandal and custody battle were “vexatious, oppressive, harassing” and not relevant.\n\nSlotnick said he could not discuss whether there were any settlement talks under way but he hinted that the company may be open to avoiding a trial.\n\n“All I can say is that the company has apologized for the use of Mr. Allen’s image, however brief. And the company apologized if they offended Mr. Allen’s sensibilities,” he said."
}