{
  "_meta": {
    "description": "LLM-generated Critics' Take summaries for shows (concise 1-2 sentence summary, max 280 chars)",
    "lastGenerated": "2026-01-26T01:56:20.269Z",
    "updatePolicy": "Regenerate weekly if 3+ new reviews added to any show"
  },
  "shows": {
    "two-strangers-bway-2025": {
      "text": "Critics are charmed by this modest rom-com musical's sincerity and breakout star Sam Tutty, though some find it overly slight and saccharine. The sweet two-hander divides audiences between those enchanted by its gentle warmth and those craving more edge.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 20
    },
    "maybe-happy-ending-2024": {
      "text": "Critics hail this robot love story as Broadway's most original musical in years, praising its charm, emotional depth, and visually stunning staging that balances cutting-edge tech with genuine heart.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 19
    },
    "the-outsiders-2024": {
      "text": "Critics find this adaptation of the beloved novel earnest and well-performed, with a gifted young cast and muscular choreography, but many question whether it needed to be a musical at all, citing overexplanation and a lack of dramatic punch.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 26
    },
    "hells-kitchen-2024": {
      "text": "Critics praise the powerhouse vocals and vibrant choreography in this Alicia Keys jukebox musical, though many find the coming-of-age story formulaic and overlong despite its emotional resonance.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 29
    },
    "operation-mincemeat-2025": {
      "text": "Critics find this British WWII musical clever and energetic, with strong performances and unexpected heart, though some deem it exhaustingly frenetic or too twee. Most praise its zany humor and charm.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 23
    },
    "oh-mary-2024": {
      "text": "Critics hail Cole Escola's farce as the funniest show on Broadway in years, delivering 80 minutes of nonstop laughs with breakneck pacing, though a few find its anarchic silliness too chaotic.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 27
    },
    "the-great-gatsby-2024": {
      "text": "Critics find this lavish Broadway adaptation prioritizes spectacle over substance, delivering dazzling visuals and excess but missing the novel's deeper themes and emotional resonance. Reception is mixed, with some charmed by the glamour.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 23
    },
    "bug-2026": {
      "text": "Critics mostly praise Carrie Coon's shattering performance in Tracy Letts's conspiracy thriller, though some find the 1996 play feels thin or struggles to fully burrow under the skin despite its timely paranoia themes.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 27
    },
    "wicked-2003": {
      "text": "Critics split sharply on this ambitious spectacle: some praise its dazzling production values and crowd-pleasing charm, while others dismiss it as an overstuffed, mechanically pandering mess with weak music.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 22
    },
    "hamilton-2015": {
      "text": "Critics hail Hamilton as a revolutionary, electrifying masterpiece that lives up to extraordinary hype. Miranda's hip-hop score, clever lyrics, and inventive storytelling earn comparisons to Sondheim, with most calling it the best Broadway musical in decades.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 47
    },
    "the-lion-king-1997": {
      "text": "Critics hail The Lion King as a visual marvel and theatrical triumph, with Julie Taymor's innovative puppetry and staging creating breathtaking spectacle. A few find it more dazzling than emotionally engaging, but most consider it an awe-inspiring achievement.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 19
    },
    "chicago-1996": {
      "text": "Critics praise Chicago's stripped-down revival as wildly entertaining, with a potent score and dynamic performances proving musicals don't need spectacle when the material is this strong.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 5
    },
    "moulin-rouge-2019": {
      "text": "Critics find this lavish, overstuffed spectacle visually dazzling but emotionally hollow, with exhilarating choreography and 70+ pop songs delivering maximum sensory excess over substance.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 29
    },
    "aladdin-2014": {
      "text": "Critics find Aladdin a visually dazzling spectacle elevated by James Monroe Iglehart's show-stopping Genie, but the production lacks emotional depth and the magic of its animated source material, settling for old-fashioned Broadway entertainment over innovation.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 41
    },
    "hadestown-2019": {
      "text": "Critics hail Hadestown as a gorgeously sung, stunningly original folk opera with sublime staging by Rachel Chavkin and a transporting score, though some find the thin narrative and slow pacing undercut the show's breathtaking theatrical artistry.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 56
    },
    "mj-2022": {
      "text": "Critics praise the electrifying choreography and Myles Frost's star-making performance, but fault the show for glossing over Jackson's controversies in favor of slick, estate-approved hagiography.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 22
    },
    "six-2021": {
      "text": "Critics embrace this 80-minute pop concert musical as a catchy, euphoric celebration of girl power, praising its infectious energy and talented cast, though some find the book thin and the concept derivative.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 25
    },
    "book-of-mormon-2011": {
      "text": "Critics overwhelmingly embrace this raucously funny, expertly crafted musical as a Broadway triumph, praising its sharp satire, surprising heart, and stellar performances, though a few find it overhyped or one-note.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 24
    },
    "and-juliet-2022": {
      "text": "Critics find this Max Martin jukebox musical a glittery, girl-power romp that's more fun than substantive. The pop hits and energetic performances charm many, though some dismiss the thin plot and Shakespeare jokes as silly.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 21
    },
    "oedipus-2025": {
      "text": "Icke's modern political thriller adaptation electrifies with Strong and Manville's captivating performances, though some critics find it more clever than profound. A gripping, timely update that mostly succeeds.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 26
    },
    "harry-potter-2021": {
      "text": "Critics praise the spectacular stagecraft and breathtaking illusions, calling it a visual marvel that redefines theatrical magic. While the plot proves convoluted and best suited for Potter fans, the emotional father-son story resonates universally.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 71
    },
    "mamma-mia-2025": {
      "text": "Critics find this touring production a joyful, if silly, crowd-pleaser powered by ABBA's irresistible hits, though some cite lackluster staging, flimsy sets, and sound issues that undercut the disco-era fun.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 19
    },
    "stranger-things-2024": {
      "text": "Critics are divided on this technically spectacular but narratively thin prequel. While Daldry's direction delivers jaw-dropping stagecraft and thrilling effects, many find the story muddled and overly reliant on fan service over substance.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 29
    },
    "cabaret-2024": {
      "text": "Critics are divided on this immersive revival: the transformed theater and strong turns from Neuwirth and Skybell earn praise, but Redmayne's mannered Emcee and Frecknall's style-over-substance approach leave many cold.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 26
    },
    "stereophonic-2024": {
      "text": "Critics hail this hyperrealistic studio drama as one of the best new American plays in years, praising its immersive design, miraculous cast, and transportive depiction of the creative process, though a few find it overlong.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 25
    },
    "water-for-elephants-2024": {
      "text": "Critics praise the dazzling circus spectacle and acrobatics, but find the musical's story and characters less compelling than its stagecraft. The show delivers visual thrills even if the script doesn't always match the excitement.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 7
    },
    "suffs-2024": {
      "text": "Critics find Taub's ambitious musical about suffragists inspiring and well-crafted, but overstuffed. The rousing protest songs and flawed female characters resonate, yet the nearly three-hour runtime feels rushed in places and struggles to balance past and present politics.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 8
    },
    "the-notebook-2024": {
      "text": "Critics are divided on this tearjerker adaptation, with some praising its emotional impact while others find it forgettable and overly sentimental, citing Ingrid Michaelson's understated score and a thin book.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 22
    },
    "marjorie-prime-2025": {
      "text": "Critics praise this timely AI drama for its sharp performances, especially 96-year-old June Squibb, and intelligent exploration of memory and technology, though some find Harrison's script emotionally distant and occasionally contrived.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 23
    },
    "liberation-2025": {
      "text": "Critics hail Wohl's ambitious feminist memory play as essential viewing, praising its emotional power, superior second act, and exceptional ensemble work, though some find the first act less compelling.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 21
    },
    "boop-2025": {
      "text": "Critics find \"Boop!\" unoriginal but undeniably fun, with Jasmine Amy Rogers earning raves as a breakout star. Jerry Mitchell's old-fashioned spectacle delivers escapist joy through dazzling choreography, though the show's reason for existing remains unclear.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 20
    },
    "queen-versailles-2025": {
      "text": "Critics find this opulent musical unfocused and hollow despite Kristin Chenoweth's powerhouse performance, with most faulting its inability to decide whether to satirize or sympathize with wealth and excess.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 26
    },
    "death-becomes-her-2024": {
      "text": "Critics largely embrace this campy musical adaptation, with Megan Hilty and Jennifer Simard's powerhouse performances elevating uneven material into raucously entertaining Broadway spectacle.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 16
    },
    "buena-vista-social-club-2025": {
      "text": "Critics praise the intoxicating music and vibrant dance, calling the show transportive and joyful, but note the book is thin and clichéd, leaving some wishing for deeper storytelling beyond the spectacular performances.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 16
    },
    "ragtime-2025": {
      "text": "Critics hail this stripped-down revival as newly vital and urgently relevant, praising Joshua Henry's powerhouse performance and the production's focus on the score over spectacle, though some find the staging overly presentational and the material's sentimentality heavy-handed.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 28
    },
    "chess-2025": {
      "text": "Critics agree the score remains thrilling, but the book still doesn't work. Strong voices and standout numbers can't overcome confusing plotting and baffling storytelling—Chess remains unfixed but undeniably catchy.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 15
    },
    "just-in-time-2025": {
      "text": "Groff dazzles in this crowd-pleasing but formulaic Bobby Darin bio-musical that prioritizes concert spectacle over depth. Critics praise the star's charisma and the immersive nightclub staging, though some find the show safe and timely questions lacking.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 22
    },
    "the-roommate-2024": {
      "text": "LuPone and Farrow deliver captivating performances that critics agree elevate a thin, uneven script. The stars' chemistry dazzles, but most find Silverman's comedy hollow and awkwardly paced beneath the stardust.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 9
    },
    "our-town-2024": {
      "text": "Critics are divided on this starry revival: some praise its emotional power and diverse casting, while others find it mired in reverence, unable to freshen Wilder's classic for contemporary audiences.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 8
    },
    "back-to-the-future-2023": {
      "text": "A technically dazzling spectacle with impressive effects and a crowd-pleasing DeLorean, but critics are divided on whether the bombastic production compensates for forgettable songs and lack of emotional depth beyond nostalgic fan service.",
      "lastUpdated": "2026-01-26",
      "reviewCount": 20
    }
  }
}