{
  "showId": "the-columnist-2012",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "http://theater.nytimes.com/2012/04/26/theater/reviews/john-lithgow-in-the-columnist-at-friedman-theater.html?ref=theater",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "...what “The Columnist” will be about has been laid out as conscientiously as it might be in the opening paragraph of a solid-A term paper. And in his first full-length play since the Pulitzer Prize-winning “Proof” (2000), Mr. Auburn carefully follows through and expands on every element in that early scene. As an old-fashioned architect, he can’t be faulted here. But he doesn’t furnish his rooms so that they feel genuinely lived in. The masterly director Daniel Sullivan (who also staged “Proof”) and a very good cast that also includes Margaret Colin and Boyd Gaines do their best to bring flesh to what remains essentially an annotated outline. Sometimes they succeed. But you always hear the dry rustle of reference materials in the background — of time lines, headlines and lists of famous names to be included.",
  "bwwScore": 8,
  "contentTier": "complete",
  "fullText": "Nudity has been so commonplace for so long on Broadway that it is now shocking when it shocks you. So give credit to the creators of \"The Columnist,\" David Auburn's scrupulously assembled historical drama, for delivering a truly troubling glimpse of exposed flesh in the play's opening minutes, a glimpse — it turns out — that is anything but gratuitous.\n\nThe Columnist John Lithgow at the Manhattan Theater Club’s Samuel J. Friedman Theater.\n\nFollow @NYTimestheater for theater news and reviews from Broadway and beyond.\n\nJohn Lithgow, left, as Joseph Alsop, with Brian J. Smith in David Auburn’s new play, “The Columnist,” set amid some news events of the mid-20th century.\n\nThe flesh is John Lithgow's, and let me hasten to add that a) Mr. Lithgow has been naked onstage before; b) his flesh in and of itself is not scary; and c) only his upper torso is on full view. But Mr. Lithgow is portraying Joseph Alsop, the powerful political writer of the mid-20th century, and a man you don't think of as even having a skin, except possibly in tweed or gray flannel.\n\nThere's a disconnect in what we see between the face — a bespectacled, patrician mask whose default expression is a sneer — and the body, which seems as soft and unprotected as a shucked crab. I found myself thinking of the director John Huston's description of Edward G. Robinson in a bathtub in the film \"Key Largo,\" looking like \"a crustacean without a shell.\"\n\nHold that image of the naked Mr. Lithgow in your mind during the rest of \"The Columnist,\" which opened on Wednesday night at the Friedman Theater, because it has a revelatory immediacy in a play that is otherwise more informative than illuminating. What we have witnessed in that early scene is, according to Mr. Auburn's script, Alsop's moment of greatest vulnerability in his long, prolific and combative years in punditry.\n\nThe year is 1954. The scene is a Moscow hotel room. And we infer that Alsop has just finished having sex with a handsome Russian youth (Brian J. Smith) and, what's more, has much enjoyed it. He is warmer and more open here than we will ever see him again. And, oh, sorry, Joe. But you've just been punked by the K.G.B.\n\nThat incident — in which photographs of Alsop in flagrante delicto were taken for purposes of blackmail — casts a shadow of varying hues over the rest of \"The Columnist,\" which is set in the 1960s and is mostly inspired by real events. Mr. Auburn's re-creation of that afternoon in Moscow efficiently sets up the tent poles for the political and personal themes that canopy this play.\n\nThrough his conversation with Andrei, the young hustler, we learn of Joe's childlike enthusiasm for the world of Washington politics. (\"Politics is human intercourse at its most sublimely ridiculous and intensely vital.\") Of his overweening professional self-esteem (\"Everyone knows me\") and feelings of unattractiveness. (\"Are you saying you came here because you wanted to?\") We are introduced to his contempt for all things Soviet and his unfortunate tendency to treat people as less than human.\n\nIn other words what \"The Columnist\" will be about has been laid out as conscientiously as it might be in the opening paragraph of a solid-A term paper. And in his first full-length play since the Pulitzer Prize-winning \"Proof\" (2000), Mr. Auburn carefully follows through and expands on every element in that early scene. As an old-fashioned architect, he can't be faulted here. But he doesn't furnish his rooms so that they feel genuinely lived in.\n\nThe masterly director Daniel Sullivan (who also staged \"Proof\") and a very good cast that also includes Margaret Colin and Boyd Gaines do their best to bring flesh to what remains essentially an annotated outline. Sometimes they succeed. But you always hear the dry rustle of reference materials in the background — of time lines, headlines and lists of famous names to be included.\n\nMany of those names are formidable. As a widely syndicated columnist, Alsop (1910-1989) spoke to power and even whispered in its ear. The play's second full scene takes place on the night of President John F. Kennedy's inauguration and ends with the imminent arrival of Kennedy at Joe's Georgetown residence. \"Jack will make the country exciting again,\" Joe says, contentedly adding shortly after, \"And he owes us.\"\n\nThe people on hand to share in the celebration are Stewart Alsop (Mr. Gaines), Joe's brother, with whom he shared a byline for many years; Susan Mary (Ms. Colin), his fiancée and already a celebrated political hostess; and Abigail (Grace Gummer), Susan Mary's teenage daughter.\n\nThe contentious, incomplete relationships he will have with each of these characters are established here. And nothing that happens after in these relationships is terribly surprising. Ms. Colin and Mr. Gaines, both excellent in limited roles, are asked to portray their characters reaching out to Joe again and again, only to be rejected. And the play might as well end with Joe singing, &agrave; la Anthony Newley, \"What kind of fool am I, who never fell in love?\"\n\nThat's the personal part of the equation. The political part presents Joe as a fearsome dinosaur, a fierce advocate of the war in Vietnam whose power begins its inexorable decline with the assassination of Kennedy. On hand to represent youth banging at the door is Stephen Kunken, doing brash and young as a brash and young reporter for The New York Times named David Halberstam. The play ends with the dawning of the Age of Aquarius, with Joe recoiling from the light like a vampire at sunrise.\n\nA Manhattan Theater Club production, \"The Columnist\" has been designed with taste and elegance by John Lee Beatty (sets), Jess Goldstein (costumes) and Kenneth Posner (lighting). And the acting is about as good as it could be. A two-time Tony winner, Mr. Lithgow has played arrogant power-wielding newspaper columnists at least twice before (in \"Sweet Smell of Success\" and \"Mr. and Mrs. Fitch\"), and he could do Joseph Alsop with his eyes closed.\n\nThat he remains wide awake and engaged — punctuating his performance with delicious moues of self-satisfaction that summon the charm wielded by some supreme egotists — is the reason you won't go to sleep either. Yet the only time I felt the conflicted empathy for Joe that I assume Mr. Auburn wants us to feel was in that prefatory scene in Moscow, where Alsop was literally laid bare. Sometimes flesh speaks louder than words.\n\nBy David Auburn; directed by Daniel Sullivan; sets by John Lee Beatty; costumes by Jess Goldstein; lighting by Kenneth Posner; music and sound by John Gromada; projections by Rocco DiSanti; hair and wig design by Charles G. LaPointe; production stage manager, Jane Grey; artistic producer, Mandy Greenfield; general manager, Florie Seery; production manager, Joshua Helman; artistic line producer, Lisa McNulty. Presented by the Manhattan Theater Club, Lynne Meadow, artistic director; Barry Grove, executive producer. At the Samuel J. Friedman Theater, 261 West 47th Street, Manhattan, (212) 239-6200, telecharge.com. Through June 24. Running time: 2 hours 10 minutes.\n\nWITH: John Lithgow (Joseph Alsop), Margaret Colin (Susan Mary Alsop), Boyd Gaines (Stewart Alsop), Stephen Kunken (Halberstam), Marc Bonan (Philip), Grace Gummer (Abigail) and Brian J. Smith (Andrei).\n\nTo shield targeted killings and other programs from public scrutiny, the C.I.A. is misusing a 35-year-old judicial doctrine.\n\nA broad anti-gay initiative in North Carolina threatens basic rights and ought to be watched closely nationwide.",
  "isFullReview": true,
  "textWordCount": 1246,
  "archivePath": "data/archives/reviews/the-columnist-2012/nytimes--ben-brantley_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:28:57.957Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20130123130538",
  "archiveOrgUrl": "http://web.archive.org/web/20130123130538/http://theater.nytimes.com/2012/04/26/theater/reviews/john-lithgow-in-the-columnist-at-friedman-theater.html?ref=theater",
  "wordCount": 1246,
  "tierReason": "Full review text"
}