{
  "showId": "gettin-the-band-back-together-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2018/08/13/gettin-the-band-back-together-deja-vu-all-over-again/",
  "publishDate": "2018-08-13T21:30:35",
  "fullText": "You’ve got to hand it to Ken Davenport. He is very, very enthusiastic about Gettin’ the Band Back Together. He’s the producer, he cowrote the book, and he’s essentially the musical’s opening act. He bounds up on stage to welcome the audience; explains that the show was “improvised…to life”; recalls his own days in a high school band, the Barely Manilows; asks who else had a band in high school; and so on. But first, he tells us about this unicorn-like thing that we’re about to see: “a totally original musical.” Pause for applause.\n\nDavenport—who’s done this preshow shtick every night since the start of previews (and apparently plans to continue)—isn’t incorrect. Gettin’ the Band Back Together is not based on a movie, like so many of last season’s new musicals, including the Best Musical and 10-time Tony winner, The Band’s Visit; it’s not a jukebox show, like another just-opened tuner on 44th Street, Head Over Heels. But it is most definitely not “totally original.”\n\nAn overwhelming feeling of déjà vu—or, to quote one of Mark Allen’s more insightful lyrics—“disappointment mixed with déjà vu”—underscores Gettin’ the Band Back Together. There’s something very Wedding Singer about it: the New Jersey setting; the waitress, Dani (Kelli Barrett, miscast in the best possible way as a woman pushing 40), who’s dating a dolt, Tygen Billows (Brandon Williams); the fact that the eponymous band actually ends up singing at a wedding. It’s a little Full Monty–esque: When the main character, Mitch (Rock of Ages alum Mitchell Jarvis), gets laid off, he rounds up his ragtag bunch of musically inclined old high school pals to rock their blue-collar town; both shows also feature a similar parade-of-no-talent-misfits audition scene. There’s also a School of Rock vibe: GTBBT culminates in a Battle of the Bands, where Mitch’s old group, Juggernaut, faces off against the aforementioned dolt, Tygen, and his unfortunately named band, Mouth Feel (plus: actors playing their own instruments!). Throw in a little Rock of Ages as well, thanks to the vaguely ’80s look—costume designer Emily Rebholz rounded up an impressive amount of acid-washed denim—and the supremely silly don’t-stop-believin’ plot.\n\nOne thing all those shows had: good-to-great scores, whether original like The Full Monty (the songs, by The Band’s Visit’s David Yazbek, are gritty, witty, and totally underrated) or recycled like Rock of Ages (which was blessed with a slate of head-banging hits from Journey, Quiet Riot, Whitesnake, and more). GTBBT, regrettably, has one—the title song. Maybe two if you count the “Hava Nagila” rap, winningly performed by 16-year-old Sawyer Nunes as Juggernaut’s hashtag-dropping axman, Ricky Bling. (Not everyone can pull off a lyric like “Make a ruckus with your tuchis.”)\n\nThough a Mazel-Tov call and response might not be everyone’s cup of Manischewitz, GTBBT’s best moments are its most ridiculous. That means virtually anything involving Williams and his leather-skinned, leather-wearing aging rocker/real-estate kingpin Tygen, who gets mega laughs by taking his character super seriously. (He also does this thing with his pecs that should be listed under “special skills” on his résumé.)\n\nAnd the show’s worst moments are its most sincere—such as the will-they-or-won’t-they-OMG-of-course-they-will love story between ex–high school sweethearts Mitch and Dani. Mitch actually has to say the line “Tell me you don’t feel something.” And Dani is ticked off that Mitch traded his garage-band dreams for stockbroker stability all those years ago. “And then you left town,” she spits. “Like I’m sure you will again as soon as Wall Street calls.” She is aware that he went to New York City, not New Delhi, right? (Incidentally, the book is credited to Davenport and The Grundleshotz, a dozen actors/writers/improvisers; The 25th Annual Putnam County Spelling Bee’s Sarah Saltzberg supplied “additional material.”)\n\nBut why spend so much time thinking about Dani—or any of the women in GTBBT? The creators certainly didn’t. They’re only there so the guys in Juggernaut have love interests: Dani is supposed to end up with Mitch—you know they’re meant to be because she buys him Springsteen on Broadway tickets on her out-of-work-waitress budget; drummer Sully (Paul Whitty), the cop, falls for a handcuff-carrying coworker, Roxanne (Tamika Lawrence); dermatologist/keyboardist Robbie (Manu Narayan) ditches his arranged marriage for vegan fro-yo queen Tawney Truebody (Becca Kötte); Ricky finds the girl of his social-media dreams in Dani’s pink-haired daughter, Billie (Noa Solorio); and bassist Bart (Jay Klaitz), a MILF-loving math teacher, gets tied up—literally—with Mitch’s mom (age-defying actress Marilu Henner).\n\nYou can also find Henner passing out Rice Krispies Treats during intermission. Completely ridiculous! But who doesn’t love a gooey, crunchy marshmallow treat?\n\nGettin’ the Band Back Together opened Aug. 13, 2018, at the Belasco Theatre and runs to September 16. Tickets and information: gettinthebandbacktogether.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars"
}
