{
  "showId": "gettin-the-band-back-together-2018",
  "outletId": "the-three-tomatoes",
  "outlet": "The Three Tomatoes",
  "criticName": "Valerie Samaldone",
  "url": "http://thethreetomatoes.com/gettin-the-band-back-together",
  "publishDate": null,
  "fullText": "by Valerie Smaldone · Published August 18, 2018 · Updated August 17, 2018 I had big hopes for the new musical “Gettin’ the Band Back Together.” It seemed like a harmless and fun premise, maybe better suited to a television sitcom series, but hey, I will go with the flow. The first sign that things might be amiss is that the show actually begins with the lead producer, and co-writer of the book, Ken Davenport, taking to the stage with a microphone, welcoming the crowd. He explains that this is an original musical, and that people can relate to being in a high school band. The best line is when he talked about his band from back in his teen years, called “The Barely Manilows.” Now, that is one clever name. That introduction, I understand, was not just because he happened to be in the house the night I saw the show. It seems he introduces the show with that opening every night. Not sure why, or what value it adds, but once again, hey, I go with the flow. The premise is simple. A Wall Street trader, Mitch Papadopoulos (I saw understudy Scott Richard Foster) is let go from his job. With no prospects, he heads back home to Sayreville, N.J. to live with his mom, Sharon, played by the sexy Marilu Henner. While there, he meets up with an old buddy, Bart (a funny Jay Klaitz) and they decide to rekindle their high school band. The reason? Sharon’s house is in foreclosure and about to be gobbled up by Tygen, their nemesis, who also went to high school with them and had a competing band. There will be a band competition to save his family home or loose his house to Tygen, (Brandon Williams) who, by the way, wants to win back the one band trophy he lost to Mitch 25 years before. He wants the trophy. Bad. So the plot for the show is launched. There are various love interests along the way, most notably Mitch’s old high school flame, Dani (Kelly Barrett), who is now living with Tygen, but really still likes Mitch. I guess she had a thing for musicians. Credit: Jay Klaitz and Marilu Henner Photo credit: Joan Marcus Look, as I said, it’s harmless and could be fun, but the book needs an infusion of sharp wit and better plot lines. To be fair, the show does improve in the second act, and by the end, audience members were clearly enjoying themselves. It just takes a long time to get there. The characters and the story are contrived. What are supposed to be really funny ideas just aren’t, but the songs by Mark Allen are actually enjoyable. There are a couple of good numbers, including a great prison tune, “Life Without Parole,” an over the top “Bart’s Confession,” a sweet song, “I Just Want Real,” and a rocking version of “Hava Nagila,” which kicks off the second act. There is a funny, but shoe-horned character who is a depressed lounge singer in a diner (played by a very funny Ryan Duncan) singing “Second Chances” and then of course there’s the title song, “Getting’ The Band Back Together,” which we hear alot. This could have been a really fun night. But maybe “Gettin’ the Band Back Together,” even though it is already on Broadway, needs some serious fine tuning. https://gettinthebandbacktogether.com/ Valerie Smaldone is a 5-time Billboard Magazine Award winner and is well known for her unprecedented success holding the #1 on-air position in the New York radio market on 106.7 Life-FM, an iHeart station. She has hosted, produced, and created several award-winning nationally syndicated programs featuring in-depth interviews with stars like Paul McCartney, Celine Dion, Rod Stewart, Elton John and Mariah Carey among others. Her radio talk show \"Bagels and Broadway\" highlighted theatre and food personalities. She is an accomplished interviewer and voice artist heard on commercials, narrations, promos and audiobooks, as well as a sought after live announcer. Most recently, Valerie produced and directed a film, The Thursday Night Club, featuring pop diva Gloria Gaynor in her movie acting debut. She is one of the creators and producers of a docu-series, Divine Renovation, starring Erik Estrada, on streaming networks soon. Tags: broadway reviewsgetting the band back togethermarylou hennervalerie smaldone Valerie Smaldone is a 5-time Billboard Magazine Award winner and is well known for her unprecedented success holding the #1 on-air position in the New York radio market on 106.7 Life-FM, an iHeart station. She has hosted, produced, and created several award-winning nationally syndicated programs featuring in-depth interviews with stars like Paul McCartney, Celine Dion, Rod Stewart, Elton John and Mariah Carey among others. Her radio talk show \"Bagels and Broadway\" highlighted theatre and food personalities. She is an accomplished interviewer and voice artist heard on commercials, narrations, promos and audiobooks, as well as a sought after live announcer. Most recently, Valerie produced and directed a film, The Thursday Night Club, featuring pop diva Gloria Gaynor in her movie acting debut. She is one of the creators and producers of a docu-series, Divine Renovation, starring Erik Estrada, on streaming networks soon. by Valerie Smaldone · Published November 25, 2017 · Last modified November 24, 2017 by Valerie Smaldone · Published February 11, 2022 by Valerie Smaldone · Published February 27, 2016 · Last modified February 29, 2016 by Valerie Smaldone · Published October 18, 2019 · Last modified October 20, 2019 by Valerie Smaldone · Published July 10, 2015 · Last modified July 16, 2015 by Valerie Smaldone · Published November 24, 2018 · Last modified November 23, 2018 by Valerie Smaldone · Published April 10, 2020 by Valerie Smaldone · Published June 3, 2017 · Last modified June 2, 2017 by Valerie Smaldone · Published June 18, 2016 · Last modified June 17, 2016 by Valerie Smaldone · Published June 2, 2018 · Last modified June 1, 2018 Your email address will not be published. Required fields are marked * This site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"It’s harmless and could be fun, but the book needs an infusion of sharp wit and better plot lines. To be fair, the show does improve in the second act, and by the end, audience members were clearly enjoying themselves. It just takes a long time to get there. The characters and the story are contrived. What are supposed to be really funny ideas just aren’t, but the songs are actually enjoyable...This could have been a really fun night. But...needs some serious fine tuning.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 1011,
  "archivePath": "data/archives/reviews/gettin-the-band-back-together-2018/the-three-tomatoes--valerie-samaldone_2026-02-06.html",
  "textFetchedAt": "2026-02-06T05:36:40.086Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 1011,
  "tierReason": "Full review text",
  "isMultiShowReview": true,
  "multiShowReason": "Roundup article: 3 other shows mentioned 3+ times (high, november, well)"
}
