{
  "showId": "the-waverly-gallery-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2018/10/25/the-waverly-gallery-real-talk-with-kenneth-lonergan/",
  "publishDate": "2018-10-25T21:50:36",
  "fullText": "Was The Waverly Gallery always this hard to watch?\n\nI remember the original off-Broadway production, which starred Eileen Heckart in what would turn out to be her final role, at the Promenade Theatre (R.I.P.) in 2000. I have a faint memory of her moving performance as a Greenwich Village–dwelling octogenarian suffering from Alzheimer’s disease—but I don’t recall feeling so drained and despondent afterward.\n\nSo what’s changed in the 18 years since Waverly’s New York premiere and its current Broadway revival, which stars the magnificent actress/writer/comic genius Elaine May? Well, I’m, ahem, 18 years older. As are my parents. As is my grandmother, who’s going on 91. Suddenly The Waverly Gallery is hitting a lot closer to home. Damn you, Kenneth Lonergan, for getting it so right.\n\nThe reason Lonergan got it right is because, unfortunately, he lived it; the play is about his own grandmother. To tell the story, he’s given himself a Glass Menagerie–style stand-in, Daniel (played by his Manchester by the Sea star Lucas Hedges), who recounts Gladys’ decline through a detached, reporter-style lens: “I want to tell you what happened to my grandmother, Gladys Green, near the end of her life,” he begins matter-of-factly.\n\nWe collectively sigh as Daniel explains to Gladys that he pens speeches for the EPA; we know he’s explained this to her once or twice or five times already. Yet still, Gladys cheerfully inquires: “Are you still…writing for the newspaper?” (Later, when she’s less lucid, she asks him if he’s still working “for the—the television”? And later: “For the magazine? And people call you and you bring them here and fix up what you want them to do for you?”)\n\nWe collectively wince as her daughter, Ellen (Joan Allen), adjusts her hearing aid only to have Gladys futz with it immediately afterward. We collectively roll our eyes as Ellen’s husband, Howard (The Band’s Visit director/newly minted Tony winner David Cromer, a delight in one of his infrequent acting appearances), tries to put Gladys at ease with very loud attempts at humor: “IT’S NO FUN GETTING OLD!” Retorts Gladys: “Nobody wants to hear that!”\n\nWe collectively shake our heads as Gladys lectures a New England artist, Don (Lonergan favorite Michael Cera, whose accent arrives somewhere in the vicinity of Boston), on the changing demographics of her beloved Greenwich Village: “This one’s sellin’ drugs, and that one’s tryin’ to—get your money—and that one’s boppin’ people on the head. They have all kinds of signals, they have red hats and blue hats, and you can’t tell one from the other, and there are a lot of people now from South Korea.” And don’t get her started on the bank around the corner! “I knew the manager for many years, and it was always a very friendly place,” she tells the family at dinner. “Now, the whole place is black.”\n\nWe collectively hold our breath as Gladys starts to lose her words—not her mind, but her words. Of a bottle of wine: “Do you want some of this—bottle— some of this—Do you want some of this—liquor?” Of a piece of cheese: “Does anybody want some of this—stuff!” Because we know it’s only getting worse, much worse, from there.\n\nDirector Lila Neugebauer (Mary Page Marlowe, The Wolves) moves things at a methodical, molasses-slow pace—which is entirely appropriate given the material. The events should feel painfully slow. While Hedges’ performance might seem too restrained, it matches Lonergan’s unsentimental tone perfectly. And May—returning to the very theater where in 1960 she starred in the groundbreaking An Evening With Mike Nichols and Elaine May—makes Gladys wonderfully lovable, frustrating, funny, and, to use one of her favorite words, kooky. She’s Every-grandma.\n\nThe Waverly Gallery opened Oct. 25, 2018, and runs through Jan. 27, 2019, at the Golden Theatre. Tickets and information: thewaverlygalleryonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
