{
  "showId": "the-waverly-gallery-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2018/10/25/the-waverly-gallery-lonergans-memory-play-slim-but-heartbreaking/",
  "publishDate": "2018-10-25T21:45:26",
  "fullText": "In her prime, Gladys Green was, to use a term my grandmother would have, quite a pistol. She still is, but not like she used to be. Gladys is at the center of Kenneth Lonergan’s The Waverly Gallery, and she’s an aging lady, still full of life, but well past the prime of it—and getting worse.\n\nWe meet Gladys and her grandson, Daniel, in the first scene of this handsome and moving if not entirely fulfilling revival that opened tonight at the Golden Theatre, directed by Lila Neugebauer.\n\nThey’re in Gladys’s small, dingy gallery in Greenwich Village, and Daniel is playing a dutiful visit. Gladys can’t hear so well, but, boy, can she talk. She doesn’t stop. She wants to know about Daniel’s life, about what he’s done to the family apartment he’s living in, about what’s going on around her, and she wants to reminisce about her life, the neighbor, Daniel’s family. His father’s mother, she tells him, “was a little kooky, you know?” He does, but she goes on. “She was charming as hell, but she never knew what to do with him.” There’s more. “I liked her, but she was a nut, she was meshugge. Do you know what that word means?” He does, he tells her, but she doesn’t hear, or doesn’t want to. “It means kooky, you know. A nut.” And so it goes, circularly, because she has both a big mouth and, these days, a short memory.\n\nThat short memory is the problem. Gladys (the legendary Elaine May) is increasingly terrorizing her grandson, Daniel (played by Lucas Hedges, sweetly excellent, if a bit too blond for this family), who lives in the apartment next to her in the Village building she and her husband bought before World War II, and the rest of her family: Ellen (Joan Allen), Gladys’s put-upon daughter and Dan’s mom, and Ellen’s second husband, Howard (David Cromer). Daniel is Gladys’s main interlocutor, and he also periodically addresses the audience, to track her decline.\n\nMay is, like Gladys, an aging icon, Mike Nichols’ partner in their pathbreaking comedy team. She brings a wonderful comedic yiddishkeit to the role, but she also brings a poignancy: She is fully in command of her scenes and her part, but she does not always seem to be entirely in command of her lines. It’s not clear whether she’s simply delivering a detailed performance of a woman losing her memories or whether she’s sometimes instead feeling her way through the script, but either way it reminds us of what makes this play so affecting, that we’re all—Gladys and Elaine and our parents and us—going to end up like this.\n\nTo some degree, there’s not a lot that happens in this play dramatically. Gladys’s mind deteriorates through the course of it, and the landlord of her gallery—entirely separate from that deterioration, it seems—wants to evict her from the space, so he can open a cafe attached to the hotel he owns upstairs. The gallery does essentially no business; running it is an activity to keep Gladys, who was once a social butterfly, Greenwich Village activist, and, perhaps, if we are to believe some what she tells us, a practicing attorney, busy through her days, something to get her out of the house. The climax comes when Ellen and Howard must move a half-cognizant but very angry Gladys out of her apartment and into theirs, uptown. (Allen and Cromer are quite fine in these roles, by the way—especially Allen, portraying the frustrated rage that comes to a caregiver who repeatedly finds herself infuriated by a parent who she knows doesn’t know any better.)\n\nThere’s one more character, an aspiring artist named Don, who wanders into Gladys’s gallery and becomes a family hanger-on. Don is from Massachusetts, stays with his sister in New Jersey, and arrives in the Village “with an expensive car and no money,” as Daniel puts it. As played by Michael Cera, he’s almost entirely vacant. (But, then, so many of Cera’s stage characters are.) The actor does the part no favors, but it’s unclear why the role is there. I suppose the point is that his New York trajectory—excited arrival, triumph of a gallery show, downslide of unattended opening, slow sales, car windows broken, departure back to Massachusetts—mirrors in capsule Gladys’s decline. But that’s all clear enough without him. Certainly he adds no drama: There are no revelations about Don or prompted by him, nor plot mechanics set in action.\n\nBut, of course, Don, a foreigner, is not the point. What makes this play succeed is precisely its familiarity. When it debuted in New York nearly 20 years ago, it was in Ellen and Howard’s neighborhood, at the now-defunct Promenade Theatre on the Upper West Side. Its heart is very much in the two locations where it’s set: Greenwich Village and the Upper West Side. Lonergan is a New Yorker through and through, and he’s telling a New Yorker’s story—and, as must be noted in this woke era, a rather privileged New Yorker’s story. (There’s the Greenwich Village apartment building, the long-sold place on Fire Island that Gladys keeps confusing with Ellen and Howard’s one in Vermont, the empty gallery space that’s held onto as a sort of self-directed adult day care.)\n\nUltimately, we know these people, and the slow sadness of Gladys’s condition, the sad way so many die today when modern medicine—and, yes, some privilege—keeps them physically fine even as their minds disappear, is heartbreaking. I watched it happen to my grandmother. Sitting in the Golden, I thought about it happening one day to my parents. And eventually to me. That’s why I found myself sobbing in the second act. And that’s why this flawed play nevertheless packs a punch.\n\nThe Waverly Gallery opened October 25, 2018, at the John Golden Theatre. Tickets and information: thewaverlygalleryonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
