{
  "showId": "the-waverly-gallery-2018",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Matt Windman",
  "url": "https://www.nytimes.com/2018/10/25/theater/review-waverly-gallery-elaine-may-kenneth-lonergan.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2018/10/25/theater/review-waverly-gallery-elaine-may-kenneth-lonergan.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "https://www.nytimes.com/2018/10/25/theater/review-waverly-gallery-elaine-may-kenneth-lonergan.htmlShare full article36Advertisement\n\nFrom the moment Gladys Green opens her mouth — which is the moment that the curtain rises on Kenneth Lonergan’s wonderful play “The Waverly Gallery” at the Golden Theater — it’s clear that for this garrulous woman, idle conversation isn’t a time killer. It is a lifeline.\n\nAn octogenarian New Yorker, former lawyer and perpetual hostess for whom schmoozing and kibitzing have always been as essential as breathing, Gladys operates on the principle that if she can just continue to talk, she can surely power through the thickening fog of her old age. That she has clearly already lost this battle makes her no less valiant.\n\nThat it’s Elaine May who is giving life to Gladys’s war against time lends an extra power and poignancy to “The Waverly Gallery,” which opened on Thursday night under Lila Neugebauer’s fine-tuned direction. Long fabled as a director, script doctor and dramatist, Ms. May first became famous as a master of improvisational comedy, instantly inventing fully detailed, piquantly neurotic characters who always leaned slightly off-kilter.\n\nHer partnership with Mike Nichols is still considered the gold standard for such quick-sketch portraiture. And their appearance on Broadway together in the early 1960s is recalled by those who saw it as if they had been divine visitations, blazing and all too brief.\n\nOne can imagine Gladys Green having attended “An Evening With Mike Nichols and Elaine May,” and saving the program. She might even have perceived a glimmer of her own vivacious self in that couple’s determined loquacity.\n\nIn any case, the Gladys we meet in “The Waverly Gallery” — the title comes from the small rented Greenwich Village space where she shows art of dubious distinction — is conducting what might be called extreme improvisation. She’s bluffing, fabricating, groping for a direction in what must often seem like a void.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 331,
  "archivePath": "data/archives/reviews/the-waverly-gallery-2018/nytimes--matt-windman_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:20:43.706Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250811161728",
  "archiveOrgUrl": "http://web.archive.org/web/20250811161728/https://www.nytimes.com/2018/10/25/theater/review-waverly-gallery-elaine-may-kenneth-lonergan.html",
  "duplicateTextOf": "nytimes--ben-brantley.json",
  "contentTier": "needs-rescrape",
  "wordCount": 331,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T16:40:45.318Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The text cuts off mid-review with a technical error message about retrieving content and enabling JavaScript, making it impossible to determine the critic's verdict; openai: The text is an incomplete article with a technical issue message, not a full review.",
  "promptVersion": "5.2.0"
}
