{
  "showId": "the-waverly-gallery-2018",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Matt Windman",
  "url": "https://variety.com/2018/legit/reviews/waverly-gallery-review-elaine-may-broadway-1202994026/",
  "playbillVerdictUrl": "https://variety.com/2018/legit/reviews/waverly-gallery-review-elaine-may-broadway-1202994026/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Oct 25, 2018 5:07pm PT \n\n \n\n \n \n \n\n \n\n \n Broadway Review: Kenneth Lonergan’s ‘The Waverly Gallery’ With Lucas Hedges\n\nIn 1989, Greenwich Village was still the kind of place where a nice old lady like Gladys Green could own and operate an art gallery for unknown artists who never sold a painting to impoverished patrons who never came. Played with great warmth, sensitivity, and good humor by the legendary Elaine May in the Broadway production of Kenneth Lonergan’s “The Waverly Gallery,” Gladys was once a practicing attorney with plenty of clients and a busy social life. These days, she’s happy just to have an occasional lost soul drop by.\n\nDon Bowman is one of those lost souls. Played with sweet cluelessness, if a certain degree of hesitancy, by Michael Cera, Don is an endearingly untalented painter who seems to have no idea that Gladys is a bit, well, out of it. Her verbal hesitancy (the nouns keep escaping her) and general vagueness don’t seem to register at all with him. What does register loud and clear is her willingness to mount a show of his work.\n\n“I like helping young people,” says Gladys. “All they want is a little chance. But they don’t have anyone to help them.” Yes, she really is that nice, and Don rewards her kindness with the company she craves. “This whole thing is kind of like a dream come true for me,” he poignantly exclaims at his opening, at which not a soul shows up. “I’ve been waiting for this day my whole life.”\n\nOkay, so the poignancy is a bit heavy-handed, even under the thoughtful direction of Lila Neugebauer. But the sentiments are genuine (Lonergan has said that he wrote the play about his own aging grandmother) and the emotions they raise are potent. Truth to tell, this is a hard play to watch — like a play that opens with a deathly ill person and doggedly follows that person to the grave. In fact, if they gave a prize for Most Depressing Play of the Season, this one would win in a walk.\n\nTo be fair, there are moments of relief when the tight focus on Gladys at the gallery expands to include her daughter, Ellen Fine, played by Joan Allen (lucky us!), and her second husband, Howard Fine (David Cromer, the perfect match). Scenes at their apartment on Wednesday nights, the night when Gladys comes to dinner, gives the audience a much-needed break by letting us know that someone is looking out for the old lady. Even her grandson, Daniel Reed (Lucas Hedges), who narrates events directly to the audience, earns our affection because of his concern for his grandmother.\n\nIn following the trajectory of Gladys’s decline, Lonergan is also tracking the decline of the Village as a tight-knit neighborhood where people looked out for one another. “The whole neighborhood is changing,” Gladys keeps saying, not realizing that she’s the one going who’s going through the most dramatic changes of all. The changes are real, but gradual, and May is most adept in noting the incremental losses that are slowly erasing Gladys’s personality.\n\nWhenever she gets the chance, the actress is also happy to show us that Gladys is still something of a wit. Her son-in-law’s insensitive observation that “it’s no fun getting old” provokes the whiplash retort: “Why do you always say that to me? Nobody wants to hear that! That’s not a helpful thing to say.” May makes a meal out of painfully funny moments like that.\n\nGladys’s family, who describe themselves as “liberal Upper West Side atheistic Jewish intellectuals,” are further unnerved by her deterioration because it offers intimations of their own mortality. After checking in with his own parents, Howard is taken aback: “So things are good all over with the old folks, right?” he says. “If you don’t lose your marbles and one of you doesn’t die young, you get old together and torture each other to death.”\n\nThere’s no lack of sympathy from this family, although Daniel seems to be most moved by watching his grandmother slip away. “Her mind was smashed to pieces, and the person she used to be hadn’t really been around for a long time,” he observes. “But the pieces were still her pieces.”\n\nThat’s nice writing, if difficult to hear and fully absorb in a play that’s guaranteed to tear you apart — piece by piece, as Lonergan might put it.",
  "isFullReview": true,
  "textWordCount": 736,
  "archivePath": "data/archives/reviews/the-waverly-gallery-2018/variety--matt-windman_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:22:04.275Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 736,
  "tierReason": "Full review text"
}