{
  "showId": "hairspray-2002",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2016/12/08/arts/television/review-hairspray-live.html?_r=0",
  "playbillVerdictUrl": "http://www.nytimes.com/2016/12/08/arts/television/review-hairspray-live.html?_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "For “Hairspray Live!” on Wednesday night, NBC lassoed some talented performers with fine singing voices but sacrificed cohesion by cramming the evening with too much interstitial fluff.\n\nBased on the 1988 John Waters film, the musical’s story of social outcasts and racial barriers is set in 1962, and it should amaze and distress us with its continued relevance in 2016. The broadcast, though, didn’t generate as much power as it could have because of all the shots of the cast members golf-carting from one set to another, of viewing parties in various cities and so on. Only Jennifer Hudson, who played Motormouth Maybelle, found the real strength of this Tony Award-winning musical, delivering a knockout rendition of “I Know Where I’ve Been,” a gospel-infused power number, late in the show.\n\n[Related: After 7 TV Musicals in 3 Years, Here’s What Works]\n\nThe production, directed by Kenny Leon, was the fourth installment of what has become a December tradition for NBC. (“The Sound of Music,” “Peter Pan” and “The Wiz” preceded it.) Maddie Baillio, a newcomer selected from an open casting call, played Tracy Turnblad, the plump teenager who becomes a dance-show sensation and helps bring down racial divides.\n\nShe did pretty well, though no novice is going to compete with voices like those of Ms. Hudson and Kristin Chenoweth, who portrayed Velma Von Tussle, the Turnblad family’s nemesis. Harvey Fierstein growled his way through the role of Tracy’s mother, Edna, which he played on Broadway. He’s probably more entertaining in a theater than he proved to be over the air; John Travolta, in the 2007 film version of the musical, made better use of the close-ups the TV cameras make possible.\n\nThe secondary players included Martin Short as Edna’s husband, Ariana Grande as Tracy’s friend Penny and Andrea Martin as Penny’s overly protective mother. The standout in the supporting cast, though, was Ephraim Sykes, a veteran of Broadway’s “Hamilton,” who put an athletic charge into the role of Seaweed, Penny’s love interest. It’s too bad he wasn’t around more.\n\nMr. Leon moved his cast all over the place, both on studio sets and outdoors, a technique that is becoming the norm for these television-stage show hybrids. He made especially good use of the medium on a number early in the show, “Mama, I’m a Big Girl Now,” mixing split-screen moments with traditional stagecraft.\n\nThe ancillary nonsense, though, sapped the momentum of the show, which ran three hours and somehow still didn’t have room for “The New Girl in Town,” a smart, punchy number from the film version. Happily, though, it did fit in another song from the movie, “Ladies’ Choice,” albeit giving it to Corny Collins (Derek Hough) rather than Link Larkin (Garrett Clayton).\n\nAll in all, it wasn’t an unpleasant revisiting of a great musical; it just wasn’t a particularly coherent or revelatory one. Now someone just needs to mount a Broadway revival and cast Ms. Hudson in it.",
  "isFullReview": true,
  "textWordCount": 490,
  "archivePath": "data/archives/reviews/hairspray-2002/nytimes--unknown_2026-02-06.html",
  "textFetchedAt": "2026-02-06T06:23:45.488Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250723182812",
  "archiveOrgUrl": "http://web.archive.org/web/20250723182812/https://www.nytimes.com/2016/12/08/arts/television/review-hairspray-live.html?_r=0",
  "contentTier": "complete",
  "wordCount": 490,
  "tierReason": "Full review text"
}