{
  "showId": "noises-off-2016",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "http://dougmarino.blogspot.com/2016/01/noises-off.html",
  "publishDate": null,
  "fullText": "In what might be the most anticipated production of the season, Roundabout's 50th Anniversary, Noises Off hits the boards this week at the American Airlines Theatre. I saw the last NYC incarnation of this gem 14 years ago - Click Here - with Peter Gallagher, Patti Lupone, Katie Finneran, TR Knight, Faith Prince, and Edward Hibbert. Needless to say I have fond and vivid memories of the hilarity that ensued. Of course when I saw the show for the first time I had no idea what was going to happen - this time around, I sort of knew what was going to play out. This time around, the indomitable Andrea Martin (Dotty) brought her physical comedy to the stage. Campbell Scott (Lloyd Dallas), tackles the prickly and frustrated director. David Furr (Garry Lejeune), Megan Hilty (Brooke Ashton), Kate Jennings Grant (Belinda Blair), and Jeremy Shamos (Frederick Fellows) tackle the interlopers. Tracy Chimo (Poppy Norton-Taylor) and Rob McClure (Tim Allgood) tackle the stage crew roles and Daniel Davis (Selsdon) is the bungling alcoholic burglar. Anyone who knows anything about Nothing On (the play within the play) knows it is a physical comedy inside the physical comedy Noises Off - Three progressively \"worse\" acts repeated with disastrously funny consequences. Timing is more than half the battle and tuning the characters just right is the rest. I'd say they did a great job at the first part - the timing and physicality was nifty. The set (Derek McLane) was quite literally exactly what I remembered it to be - as if they pulled it out of storage. What the production lacked, I thought, was a sense of mad-cap pace and hilarity. It was almost very deliberate and plodding. Certainly Ms. Martin had moments of glory - mostly in Act I as she labored over the sardines and later when she got tangled in the phone cord. I remember TR Knight having a bigger part than Mr. McClure - and I don't know why. Ms. Hilty delivered those stilted and quite literally memorized lines perfectly - and by perfectly I mean at just about the most incorrect time and always mugging to the audience like her character is supposed to. This time around Mr. Scott walked around the entire theater including the mezzanine with his booming director's voice and I don't remember Mr. Gallagher doing the same except for right down front. There were plenty of stars in this production although none of them shone overly brightly. There was plenty of talent and great timing in this production, but nothing transported me. That could be a bit of the 2nd time around syndrome, or it just might possibly be that the production seemed a bit more farcical and deliberately physical than it needed to be. In the end, it doesn't much matter. The family behind me had no idea what was going to happen and half my fun was listening to their reactions in Act 2. I enjoyed this production but not quite as much as I enjoyed my first one.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Timing is more than half the battle and tuning the characters just right is the rest. I'd say they did a great job at the first part - the timing and physicality was nifty. The set was quite literally exactly what I remembered it to be - as if they pulled it out of storage. What the production lacked, I thought, was a sense of mad-cap pace and hilarity. It was almost very deliberate and plodding.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 507,
  "archivePath": "data/archives/reviews/noises-off-2016/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:44:00.790Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 507,
  "tierReason": "Full review text"
}