{
  "showId": "equus-2008",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2008/legit/reviews/equus-1200472195/",
  "publishDate": "September 26, 2008",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "While Radcliffe acquits himself reasonably well in his Broadway debut, bringing touching vulnerability to the emotionally shattered Alan, he lacks the primal ferocity that makes the role truly compelling.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "While Radcliffe acquits himself reasonably well in his Broadway debut, bringing touching vulnerability to the emotionally shattered Alan, he lacks the primal ferocity that makes the role truly compelling.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 637,
  "archivePath": "data/archives/reviews/equus-2008/variety--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:30:28.480Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "The thrill of the chase loses all its appeal in Electronic Arts' Parkour-inspired \"Mirror's Edge.\" Repetitive, difficult and visually dull, the game is undone by its use of a highly constrained first person viewpoint in a world of high-speed running and jumping where perspective is everything. Though it deserves some credit for originality, \"Mirror's Edge\" is too fundamentally misconceived to avoid tumbling down the sales charts.\n\nThe thrill of the chase loses all its appeal in Electronic Arts’ Parkour-inspired “Mirror‘s Edge.” Repetitive, difficult and visually dull, the game is undone by its use of a highly constrained first person viewpoint in a world of high-speed running and jumping where perspective is everything. Though it deserves some credit for originality, “Mirror’s Edge” is too fundamentally misconceived to avoid tumbling down the sales charts.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Industry' Season 4 Premiere Viewership Jumps 20% From Season 3 \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Knight of the Seven Kingdoms' Premiere Draws 6.7 Million Viewers in Three Days\n\nThe game takes place in a futuristic police state where the government monitors everything except, apparently, the rooftops, leading dissidents to spread information via “runners” — alt-rock types who leap across conveniently arranged buildings. Main character Faith quickly gets caught up in a generic conspiracy involving politicians, police and characters with a series of increasingly ridiculous names like “Jackknife” and “Rope Burn.”\n\nThe plot is conveyed entirely through cartoony cutscenes that serve to connect the levels, in which Faith traverses roofs, vents, fences and ledges while avoiding her inept pursuers. At first glance, the world of “Mirror’s Edge” is stunning, bathed in nearly blinding light and seemingly full of paths for a runner to explore. But that scope turns out to be a facade. Save for minor detours, there’s only one right way to go, and the developers at Dice use barbed wire, ramps and brightly colored hints to mark the path. When players do discover alternate routes that look interesting, they’ll find that Faith suddenly can’t grab ledges or survive falls she normally should.\n\nInstead of allowing exploration, “Mirror’s Edge” is focused entirely on speed. To make the bigger jumps, Faith needs to build up a full head of steam. Many levels are also populated by cops who, while not smart enough to block escape routes, fire their guns nonstop, making it tough to stop and get one’s bearings. Combined with the first-person POV, this often means the only way to figure out the correct series of jumps, slides and swings needed to escape a dangerous area is to die over and over until one has memorized the route (or given up out of sheer annoyance).\n\nWhen everything’s going right, it’s possible to get a rush out of a perfectly executed series of wall-runs, jumps and slides. Thanks to the limited perspective, though, it’s difficult to appreciate them visually as in similar third-person games like “Prince or Persia.”\n\nLevel design is repetitive, meaning players will quickly learn to look for the air conditioners, zip lines and other items Faith uses to navigate the environment. The game makes up for this increasing simplicity by progressively turning down its hint system that marks the path with bright primary colors to stand out from the oversaturated landscape in which even plants are white. Outside in the bright sun, the look makes sense, but indoors, the duochromatic design just feels like an attempt to gloss over the complete lack of detail.\n\nThe game actually works best when players escape the story and unlock “time trials,” where they try to get through levels as fast as possible. In a cool touch, players can even race against “ghosts” of themselves or ones downloaded from the best competitors around the world. With no police in the way and a singular goal in mind, “Mirror’s Edge” boils down to a simple but enjoyable racing game on foot."
}