{
  "showId": "the-little-foxes-2017",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "https://dougmarino.blogspot.com/2017/04/lilian-hellmans-little-foxes.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "“With Mr. Sullivan's fine vision, I really felt I was in the South…These two actresses are masters of their craft…And what a tremendous supporting cast these two marvelous actresses get the pleasure of working with. Regina's brothers, Michael McKean and Darren Goldstein are the perfect mix of evil and jocularity. Richard Thomas knows how to inhabit his deceptively revengeful character with aplomb.”\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 327,
  "archivePath": "data/archives/reviews/the-little-foxes-2017/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:59:04.300Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "The only thing I did not like about this production was its title. I hate it when an author feels that their name needs to be attached to the title - ala Edward Albee. Now, onto all the good stuff. Daniel Sullivan's directorial job could not have been more different from the last time I saw this show at the New York Theatre Workshop in 2010 with Ivo Van Hove at the helm. This time, with Mr. Sullivan's fine vision, I really felt I was in the South. The set (kudos Scott Pask) was a magnificent reproduction of a fine southern home. (Boy those stairs seemed very steep!). Completely contrary to Mr. Van Hove's bare set and modern costumes - context really does make the story come alive in a way Mr. Van Hove could not replicate although his production certainly succeeded in many aspects that I won't go into now. As you may know, The two leads, Regina Giddens (Laura Linney on my night) and Birdie Hubbard (Cynthia Nixon on my night) trade roles regularly! I immediately thought that the casting as I saw it may have been the better combo - but these two actresses are masters of their craft and I left the theater thinking what a different person each one must inhabit as they trade roles. And what a tremendous supporting cast these two marvelous actresses get the pleasure of working with. Regina's brothers, Michael McKean (Ben Hubbard) and Darren Goldstein (Ben Hubbard) are the perfect mix of evil and jocularity. Richard Thomas (Horrace Giddens) doesn't appear until Act II and when he does it is evident he knows how to inhabit his deceptively revengeful character with aplomb. Ms. Hellman really does bring this family to the brink and then back again. What a pleasure it was to watch these fine actors take their evil and deceptive journey each night deep in the south way back in 1900. Which cast did you see?"
}