{
  "showId": "the-little-foxes-2017",
  "outletId": "newsday",
  "outlet": "Newsday (Linda Winer)",
  "criticName": "Linda Winer",
  "url": "http://www.newsday.com/entertainment/theater/the-little-foxes-review-good-reason-to-see-it-twice-1.13489444",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/the-little-foxes-review-good-reason-to-see-it-twice-1.13489444",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "The next time anyone challenges the need to have nonprofit Broadway houses alongside the commercial theaters, I'm going to shout out, 'The Little Foxes.' It's possible to imagine a profit-motivated producer deciding to stage Lillian Hellman's 1939 drama about a greedy Southern family these days if a megastar - recall Elizabeth Taylor in 1981 - wanted to claw her way through the carnivorous role of Regina Giddens, the Cruella of small-town 1900 society. But the nonprofit Manhattan Theatre Club has not merely dared to cast Laura Linney and Cynthia Nixon - sublimely intelligent actors, but hardly summer tourist-bait - to play grasping, glamorous Regina and her mousy, quietly alcoholic sister-in-law Birdie Hubbard in the company's Broadway venue. To complicate matters deliciously, the two are alternating roles equally through the run.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Cynthia-Nixon-and-Laura-Linney-Swap-Roles-in-THE-LITTLE-FOXES-Opening-Tonight-20170419",
  "showScoreExcerpt": "\"More interesting than a competition, however, is the crackling seriousness with which director Daniel Sullivan approaches this strongly cast revival...I was struck by the snappy, tight writing and the psychological truth in the people...As Regina...Linney has the gutsy, snazzy elegance...And Nixon makes a sublime Birdie...The reverse casting is enlightening, but, in comparison, feels a bit more stagy...The rest of the cast is far more than background.\"\n\nRead more"
}