{
  "showId": "the-little-foxes-2017",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2017/legit/reviews/the-little-foxes-review-cynthia-nixon-laura-linney-1202034033/",
  "publishDate": "April 19, 2017",
  "fullText": "It wasn’t trick casting on the part of director Daniel Sullivan to have Laura Linney and Cynthia Nixon alternate lead roles in “The Little Foxes,” Lillian Hellman’s brilliant, blistering indictment of a rapacious southern family in post-Civil War America. Each actress, in her own way, finds drama in the life-and-death conflict between the declining aristocracy and the rise of the decadent merchant classes at the turn of the 20th century.\n\nInfrequent revivals of Hellman’s work tend to make us forget how astonishingly well-constructed her plays are. The machinery of this scorching family drama is swiftly set in motion when we learn that brothers Ben (Michael McKean) and Oscar (Darren Goldstein) Hubbard are anxious to go into business with a Chicago developer who wants to build a cotton mill near the Hubbards’ cotton plantation. Their sister, Regina (Linney in the opening night performance), is eager to come up with the remaining share of the investment. But women did not inherit family assets in 1900, and her ailing husband, Horace Giddens (Richard Thomas), who has sole control over their fortune, is being treated at Johns Hopkins Hospital in Baltimore.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nMore than a hundred years on from when the play was written, we can still relate to the Hubbards and those bruising battles over money that can tear families apart and leave everyone involved bleeding on the floor.\n\nThe Hubbards’ tug of war over money will eventually take its toll on other members of the household: the aristocratic Birdie Hubbard (Nixon on opening night), who lost home and happiness when she married into this avaricious family; her beloved niece, Alexandra (Francesca Carpanini); and the loyal house servants, Addie (Caroline Stefanie Clay) and Cal (Charles Turner).\n\nWith Horace in the hospital, business negotiations are at a standstill and may, indeed, collapse altogether. This is where Regina comes in. One of the strongest female characters in all of American drama, Regina is both a grotesque caricature of traditional southern womanhood and a spirited modern woman cruelly restrained by the social conventions of her time. At the end of the play, when Regina bitterly exclaims “If only Papa had left me the money!,” it’s obvious what Hellman had in the back of her mind when she wrote this devastating portrait.\n\nRegina does, indeed, have the intelligence and shrewdness to handle the family business and to do a far better job of it than either of her brothers or even her husband. But with no socially proper outlet for her talents, she’s become a manipulative monster, using her gifts as weapons of her raging dissatisfaction.\n\nDirector Sullivan has done brilliant work with this revival. His casting is flawless, his team of designers couldn’t be better chosen, and the technical detail that has gone into the production is amazing. But he took a chance in letting two A-list stage actors alternate in the roles of Regina and Birdie — and the coup pays off because it encourages us to look deeper into both characters.\n\nI can’t imagine a more moving portrayal of Birdie than Nixon’s. Costumer Jane Greenwood has designed a heartbreaking wisp of a lace-trimmed gown that illustrates the delicate and doomed aristocratic life that Birdie lost in the war and still mourns. The quiet intensity of Nixon’s gaze reflects that lost paradise, and the horror of seeing what has replaced it. Seeing the pain in her eyes, who could blame Birdie for drinking?\n\nBoth actresses bring their insights to Regina. Nixon goes for an aura of cold detachment that could freeze the blood of the foolish men she has to deal with. For all her gutter-level wheeling and dealing, there’s something of the ice queen about her.\n\nLinney’s Regina is pure Machiavellian cunning, a sly fox waiting for those dumb rabbits to hop into her den. For those family battles, Greenwood has designed her several fashionable sets of armor, one a severely tailored suit and underblouse in a deep, gorgeous shade of teal. Properly suited up, she’s a formidable opponent who fights to the death — quite literally in her harrowing scenes with husband Horace (superbly played by Thomas), whom she drags home from the hospital to sign away his money.\n\nLinney is ferocious when Regina is thwarted, but she never gives up. She flashes her dimples, she flirts, she bullies, she teases, she commands, she seethes with rage. And when all else fails, she looks you in the eye and says: “I hope you die.” I don’t know about you, but I give up.",
  "isFullReview": true,
  "dtliExcerpt": "Laura Linney and Cynthia Nixon alternate in the roles of scheming sisters Regina and Birdie in this handsome revival that's heavy on star power but light on dramatic revelation.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Linney's Regina is pure Machiavellian cunning, a sly fox waiting for those dumb rabbits to hop into her den. For those family battles, Greenwood has designed her several fashionable sets of armor, one a severely tailored suit and underblouse in a deep, gorgeous shade of teal. Properly suited up, she's a formidable opponent who fights to the death - quite literally in her harrowing scenes with husband Horace (superbly played by Thomas), whom she drags home from the hospital to sign away his money. Linney is ferocious when Regina is thwarted, but she never gives up. She flashes her dimples, she flirts, she bullies, she teases, she commands, she seethes with rage. And when all else fails, she looks you in the eye and says: 'I hope you die.' I don't know about you, but I give up.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Cynthia-Nixon-and-Laura-Linney-Swap-Roles-in-THE-LITTLE-FOXES-Opening-Tonight-20170419",
  "showScoreExcerpt": "Laura Linney and Cynthia Nixon alternate in the roles of scheming sisters Regina and Birdie in this handsome revival that's heavy on star power but light on dramatic revelation.",
  "contentTier": "complete",
  "contentTierReason": "Short text (29 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://variety.com/2017/legit/reviews/the-little-foxes-review-cynthia-nixon-laura-linney-1202034033/",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "previousUrl": "https://variety.com/2017/legit/reviews/the-little-foxes-review-laura-linney-cynthia-nixon-1202022447/",
  "urlDiscoveredAt": "2026-02-04T01:49:33.540Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 775,
  "archivePath": "data/archives/reviews/the-little-foxes-2017/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:49:33.546Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 775,
  "tierReason": "Full review text",
  "bwwScore": 9
}
