{
  "showId": "a-dolls-house-2023",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Gloria Oladipo",
  "url": "https://www.theguardian.com/stage/2023/mar/09/a-dolls-house-review-jessica-chastain-broadway",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2023/mar/09/a-dolls-house-review-jessica-chastain-broadway",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "fullText": "Okieriete Onaodowan and Jessica Chastain in A Doll’s House. Photograph: Courtesy of A Doll's HouseView image in fullscreenOkieriete Onaodowan and Jessica Chastain in A Doll’s House. Photograph: Courtesy of A Doll's House This article is more than 2 years oldReviewA Doll’s House review – Jessica Chastain captivates in minimalist revivalThis article is more than 2 years oldHudson Theatre, New York\n\nThe Oscar winner makes for an exceptional Nora in a visually muted yet emotionally effective remount of Ibsen’s classic drama\n\nGone is the elaborate 19th-century home. Gone are the time-specific corsets and floor-length petticoats. In Jamie Lloyd’s minimalist reimagining of A Doll’s House lies a new iteration of the seminal classic.\n\nThe latest remount follows Ibsen’s original formula. Nora Helmer (Jessica Chastain), an infantilized housewife, fraudulently borrows money from disgraced banker Krogstad (Okieriete Onaodowan). Krogstad threatens to expose Nora’s secret unless she can secure his job at the bank with her husband Torvald (Arian Moayed), who was recently promoted.\n\nRead moreBut now Nora and those who occupy her universe wear modern-day clothing. On the simple, rotating set (designed by Soutra Gilmour), the only props are wooden chairs. A singular projection reminds us that it is indeed 1879.\n\nIn some ways, it feels disappointing to lose the visual fullness of Ibsen’s world. Despite it being Christmastime in the Helmer house, a plentiful one at that, staples such as presents or sweets are discussed but never shown. The facade of Nora’s life that is typically in play are dissolved onto a minimalist slate.\n\nBut in this muted revival, adapted by Amy Herzog, the modernization emphasizes the legitimacy of Nora’s life and what she can control. Nora is not just a mother, or just a wife. Under Lloyd’s direction, Chastain emphasizes the responsibility and reverence of these identities that Nora firmly grasps, the real grief that swallows her when she fears she has corrupted it all.\n\nIn the play’s preamble, Chastain sits stone-faced as she is rotated by the moving set. Akin to a figurine in a music box, Nora lives trapped under the watchful eye of others. But Nora remains at the center and in control, able to carve out agency in a world that relishes in its thievery. With a lobbed compliment to her husband, Nora woos him into giving Kristine (Jesmille Darbouze) a job. Nora maintains individual and tender relations, particularly with the dying Dr Rank (Michael Patrick Thornton) or the family’s nanny Anne-Marie (Tasha Lawrence). Nora thrashes to hold her husband’s attention during a feverish dance scene, choreography that becomes increasingly sinister given Chastain’s enthralling performance. “I am a human being, just like you are,” proclaims Nora.\n\nChastain is captivating as Nora, providing a robust understanding of Nora’s inner life beyond the cruelty she suffers. Chastain fully understands the various pieces that make up Nora: her humor, wit and (at times) incomprehension. A fuller, infinite portrait is painted of the long-time heroine through Chastain’s work.\n\nSome aspects of the modernization misfire. Lloyd’s version feel slackened in its finale, as Nora realize just how her husband (and recently departed father) view her. Nora’s decision to leave – and eventual departure – thuds along, despite Herzog’s adaption remained tenuous throughout.\n\nRace is a current in Lloyd’s revival, with Krogstad and Kristine played by people of color. The play nudges at that acknowledgement, specifically underlined in Krogstad’s mistreatment by his white associates and Nora warning Christine that Krogstad will “hurt” her (a white Nora assuming that Krogstad, a Black man, is capable of violence). But the reality of racism is treated as a point of view that Krogstad and Christine share, versus an operating framework the characters live in.\n\nKristine’s independent arc is still sidelined in Herzog’s adaption. Darbouze delivers a tender performance, particularly in moments of kinship with Krogstad. But Kristine remains largely relegated as a tool for Nora’s self-actualization. Like much of white feminism, her own desires are swept in the storm of Nora’s needs.\n\nAmid the hangups, all members of the cast excel. Lloyd delivers an ensemble worthy of taking on Ibsen’s masterwork. Moayed intensely spotlights the casual cruelty in Torvald. Skating between sweet quips and eager putdowns, his portrayal emphasizes the disparate nature of violence. Onaodowan is magnetic as Krogstad, bringing a quiet pain and dignity to a character usually colored in blind rage.\n\nThornton and Lawrence, despite brief appearances, are evocative and moving. Thornton embraces a needed curtness and humor as Rand’s life comes to an end, keying into a love for Nora that is part erotic and part protective. Lawrence acts as an essential parallel to Nora’s motherhood, bringing a sensitivity and love to her moments with Nora.\n\nOverall, Lloyd’s interpretation strips the work to its bones, but still keeps Nora intact.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 804,
  "archivePath": "data/archives/reviews/a-dolls-house-2023/guardian--gloria-oladipo_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:33:16.321Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 804,
  "tierReason": "Full review text",
  "bwwExcerpt": "Amid the hangups, all members of the cast excel. Lloyd delivers an ensemble worthy of taking on Ibsen’s masterwork. Moayed intensely spotlights the casual cruelty in Torvald. Skating between sweet quips and eager putdowns, his portrayal emphasizes the disparate nature of violence. Onaodowan is magnetic as Krogstad, bringing a quiet pain and dignity to a character usually colored in blind rage.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-A-DOLLS-HOUSE-Opens-On-Broadway-Starring-Jessica-Chastain-20230309"
}
