{
  "showId": "a-dolls-house-2023",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/entertainment/broadway/ny-broadway-dolls-house-jessica-chastain-review-20230310-x3lpq3t3endkbpsgvj3mx4bdta-story.html",
  "publishDate": null,
  "fullText": "Opt-Out Signal is being honored Your Opt-Out Signal is active and being honored by this site\n\nExperiencing the fascinating new revival of Henrik Ibsen’s “A Doll’s House,” which reduces the iconic proto-feminist drama to its barest thematic essentials, is not unlike listening to a podcast.\n\nFor anyone interested in Broadway trends, here is a remarkable example of how the rise of Audible and Airpods — and the huge popularity of stories playing in your ear — has made spectacle not only inessential but maybe even an unnecessary risk. Even on Broadway, which made its bones on frills and feathers.\n\nIn fact, you could close your eyes for much of this show, which stars Jessica Chastain and Arian Moayed (Stewy on “Succession”) and still grasp most of the ideas from the adaptor, Amy Herzog and the British director Jamie Lloyd. Only at the surprise ending — and the final dramatic punch is not the famous slam of the door — does that not apply.\n\nThe actors wear microphones inches from their lips, allowing the show to be even more conversational than actual conversation. Actors are dressed in shades of black and there is no physical business whatsoever: It doesn’t matter if if we’re talking letters ex machina or shorn wedding rings, the action of this famously naturalistic play is merely described verbally. You are asked to see it in your mind’s eye.\n\nActors hardly move; Chastain’s Nora is seated for most of the play as a turntable brings along her husband, her flirtatious old friend (Dr. Rank, played by Michael Patrick Thornton), the nanny who cares for her children (Anne-Marie, played by Tasha Lawrence) and the two characters who are disrupting Nora and Torvald’s hollow marriage, Krogstad (Okierete Onaodowan) and Kristina Linde (Jesmille Darbouze).\n\nChastain, a formidable actress of stage and screen, is being asked to perform with the intimacy of a movie close-up but also live at the huge Hudson Theatre, a most interesting fusion. It’s the same with everyone: Onaodowan and Thornton’s performances are almost entirely driven by their voices.\n\nThe point? To remove the unnecessary clutter, I assume, and the trappings of original location (Scandinavia) and period (1879). This show, which has no intermission, is not a deconstruction in the common-these-days sense of critiquing old material while also trading on its popularity. Lloyd is not going after Ibsen or this canonical play in that sense; rather he clearly wants to allow its words to float through time, maybe to get the audience to reflect on the pitiful level of support they might find in their own relationships or, given how the plot turns on old crimes of forging signatures, ponder the presence of hypocrisy in societies past and present.\n\nIn “A Doll’s House,” cornered men squirm like scared rats in a trap. This production makes the point that you don’t need to see much to know.\n\nThe strengths of the show? Depth of intimacy. There is something very arresting about hearing these famous old lines given this kind of immediacy. The cast is made up of highly skilled and experienced actors and it’s really and truly something to hear how well all of them handle the need for dramatic tension to build in their mouths, even if their bodies often seem to writhe against their own director’s constraints. The piece is not boring: it has weight and power and gravitas. And, at times with Chastain, Nora’s mental pain (and Herzog’s deft adaptation focuses strongly on the leading character’s mental health) overflows to the actress’ tear-stained face.\n\nIf you are a fan of Chastain’s work, this is not something to miss, if only to watch how she builds outwards from inside a theatrical, and marital, box.\n\nThese kinds of shows always beg the valid question of whether audiences dropping Broadway bucks are happy with so little to see, albeit here plenty to feel and hear. Sometimes directors seeking to peel back more and more layers of a dramatic character’s onion, ever in search of the primal, go too far for the regular folks paying their bills. There are only so many stories; how they have been framed over the years actually matters. Clutter can matter; it lets audiences find their own way without holding a director’s hands.\n\nBut while I don’t think this show would have pleased an audience as much a decade ago, cultural delivery systems have changed. And this one, about a hitherto complacent woman facing down a crisis and taking charge of her own destiny for the first time, lands right in your ear.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "The strengths of the show? Depth of intimacy. There is something very arresting about hearing these famous old lines given this kind of immediacy. The cast is made up of highly skilled and experienced actors and it’s really and truly something to hear how well all of them handle the need for dramatic tension to build in their mouths, even if their bodies often seem to writhe against their own director’s constraints. The piece is not boring: it has weight and power and gravitas. And, at times wit",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-A-DOLLS-HOUSE-Opens-On-Broadway-Starring-Jessica-Chastain-20230309",
  "showScoreExcerpt": "\"If you are a fan of Chastain’s work, this is not something to miss, if only to watch how she builds outwards from inside a theatrical, and marital, box.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright",
    "bww-roundup"
  ],
  "textWordCount": 758,
  "archivePath": "data/archives/reviews/a-dolls-house-2023/nydailynews--chris-jones_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:32:28.609Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "wordCount": 758,
  "tierReason": "Full review text"
}