{
  "showId": "a-dolls-house-2023",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Johnny Oleksinski",
  "url": "https://nypost.com/2023/03/09/a-dolls-house-broadway-review-jessica-chastain-is-trapped/",
  "playbillVerdictUrl": "https://nypost.com/2023/03/09/a-dolls-house-broadway-review-jessica-chastain-is-trapped/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Oscar winner Jessica Chastain returns to Broadway in \"A Doll's House.\" \n Courtesy of A Doll's House \n \n \n \n \n \n \n\nUsually stripping a play down to the bare essentials — simple costumes, a few chairs — renders it rawer and more authentic.\n\nNot so in the uneven revival of “A Doll’s House,” starring Oscar winner Jessica Chastain, that opened Thursday night on Broadway.\n\nRunning time: 1 hour and 40 minutes. At the Hudson Theatre, 141 W. 44th St.\n\nDespite an absorbing performance from the “Eyes of Tammy Faye” actress, British director Jamie Lloyd’s staging is as sterile as an operating room.\n\nIf only the actors donned colorful blue medical scrubs.\n\nInstead, everybody here wears drab, metropolitan black clothes. The set of wooden seats is dimly lit by eye-straining fluorescents. The cast speaks softly into body mikes, which gives the play an NPR calmness. All things considered, it’s a lot of high-minded ideas that never cohere into a riveting whole.\n\nEven before the play starts, a Nordic chill settles over Norwegian playwright Henrik Ibsen’s classic 1879 tale of Nora Helmer, a repressed housewife with a destructive secret.\n\nWant to see “A Doll’s House” on Broadway? Grab tickets here.\n\nAs the audience shuffles into its seats at the Hudson Theatre, they gawk and snap pictures of Chastain sitting silently in a chair — Marina Abramović style — while a turntable rotates the A-lister around. The actress almost never leaves her seat for the entire 100 minutes.\n\nThe pre-show spin cycle is surely a shout-out to Nora’s climactic famous early-feminist speech in which she comes to the realization she has merely been “performing tricks” for her husband Torvald (Arian Moayed), who views his wife and the mother of his children as little more than a flesh-and-blood ornament.\n\nSo, Chastain becomes a doll for us, too. But that instant self-awareness introduces another problem: the production jumps the gun on the ending.\n\nThere is hardly any suspense or sense of surprise. Rather, we get an all-around mood of resignation.\n\nNora’s marriage to Torvald, a proud banker, comes across as immediately doomed and loveless, because Chastain’s Nora is especially aloof and Moayed, while charismatic, plays the hubby as a contemporary jerk out of a Judd Apatow movie.\n\nThe story, therefore, stays even-keeled with a slow-and-steady pace, like an animatronic ride called “It’s A Doll’s World After All.”\n\nThe intrusion of her old friend Kristine (Jesmille Darbouze) and the vengeful Krogstad (Okieriete Onaodowan) mixes things up, of course, but only as much as this production of lifeless gray and whispered lines will allow.\n\nBoth actors have forceful presences, but are scarily clinical here — Terminators searching for Nora, instead of Sarah Connor.\n\nHow can such a static tone possibly work for a play in which the main character announces “I have changed” in the end?\n\nDuring that final speech, Chastain is at her most alive and thrilling.\n\nActually, her Nora is a pleasure to watch throughout for her aura alone, which has come a long way from her “Heiress” days. She’s held back in more ways than one by Lloyd’s direction.\n\nStill, there is a spark of intrigue and playfulness to whatever move she makes, and as Nora’s burdensome debt comes to light, Chastain approaches it with quiet, modern anxiety.\n\nShe’s also gripping when opposite the excellent Michael Patrick Thornton as Dr. Rank, Nora’s flirty confidant.\n\nHe does best with playwright Amy Herzog’s added colloquial dialogue, and smartly seizes upon the microphone as an opportunity to be more natural and vulnerable — not another sexy Siri.\n\nWhat will have everybody talking, though, is the ending.\n\nDuring Lloyd’s take on the play’s well-known final moment, people seated around me giggled, “ooo”d and “ahh”d as if a chandelier had just plummeted over the orchestra.\n\nWhat do you think? Post a comment.\n\nBack in 1879, Nora’s ultimate decision caused a societal uproar, so the director is probably trying to give us the “I Can’t Believe It’s Not Butter” version of that.\n\nAnd, on its own, it’s a fun trick.\n\nYet, call me old fashioned, but to take a play about a woman who powerfully realizes she’s not just a plaything for men, but her own human being, and end it with a cutesy gimmick is wrongheaded.\n\nIt’s another silly toy in the dollhouse.",
  "isFullReview": true,
  "textWordCount": 709,
  "archivePath": "data/archives/reviews/a-dolls-house-2023/nypost--johnny-oleksinski_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:33:48.555Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 709,
  "tierReason": "Full review text"
}