{
  "showId": "a-dolls-house-2023",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Unknown",
  "url": "https://www.vulture.com/2023/03/theater-review-dolls-house-ibsen-herzog-chastain-broadway.html",
  "playbillVerdictUrl": "https://www.vulture.com/2023/03/theater-review-dolls-house-ibsen-herzog-chastain-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nThe cast in rehearsal.\n Photo: Emilio Madrid\n \n \n \n Jamie Lloyd’s production of A Doll’s House peaks before the play itself begins. As members of the audience file into the Hudson Theatre, Jessica Chastain sits motionless in a wooden chair, circling the bare stage on a slow revolve. In a simple black dress and black heeled boots, she leans back and stares outward, ignoring the bustle of theatergoers climbing over each other to their seats and muttering about how well they know the play or Chastain’s movie stardom. Often, they raise a phone to record a video as she spins past (it makes for a great Instagram Story). Closer to curtain time, the rest of the cast assembles around her in chairs and dark outfits of their own in a tableau combining the aesthetics of the Apple Genius Bar and a Shaker museum. The year 1879, when Henrik Ibsen’s drama was first published and is set, is projected behind them. They are still. Chastain spins. The doll, as it were, is present — cooking under the scrutiny of the crowd like a Barbie in a microwave.\n\nIf only the rest of the production lived up to — or, really, departed from — that first image. Lloyd puts Chastain in that chair, then keeps her there almost all evening. The stage remains bare, and the actors play their scenes in ways that only gesture toward the action described in dialogue. You get the conceptual point rather more quickly than Lloyd thinks you will: Nora Helmer (Chastain) is trapped by the expectations placed on her as a bourgeois housewife. She performs for her husband, Torvald (Arian Moayed), playing a happy little songbird, but it strains and exhausts her. If you know Ibsen’s famous ending, or even if you’re going off of obvious context clues, you’ll surmise that, eventually, Nora will get up out of that chair. Waiting for an action that’s so clearly foreshadowed pinches the emotional effect. I thought of a rubber band being pulled back from a thumb to launch across the room that’s held for too long, losing its elasticity.\n\nChastain is, of course, the big draw — in only her second appearance on Broadway (after The Heiress in 2012) despite her public persona as one of Hollywood’s biggest Juilliard-trained theater kids. In some ways, Lloyd’s staging works in her favor, since like a lot of film actors, she’s most comfortable acting in close-up — always projecting thought with her roving eyes and arching a cheekbone against the light, so you can see a misty tear on it. The larger actions, however, become forced. That’s not all on her: No matter how seriously the action is played, watching someone try to dance a tarantella while sitting in a chair is innately goofy. The performance might better fit in a smaller theater, where the whole audience is within breathing distance, but with the spaciousness of a Broadway house (even a relatively small one like the Hudson), the just-the-bones approach makes for thin broth.\n\nThere’s also a problem of pace. Chastain’s Nora seems to be onto something from the start, never totally oblivious to her situation, with a bit of flint near the surface — a kind of self-certain type she has done on film before. It’s a noble interpretation of the character but one that, like the staging, over-anticipates the woman she becomes before the play itself gets there. Ibsen’s text, in contrast with those choices, lays its track slowly, sitting with Nora amid her attempts to keep up with the Johansens before she has a grasp of her own unhappiness. Nora has been secretly paying off a debt she incurred from a trip to Italy that she believes saved her husband’s life. Her creditor, Nils Krogstad (Okieriete Onaodowan), works under Torvald at the bank but is at risk of losing his job once Nora convinces her husband to hire her recently widowed friend, Kristine Linde (Jesmille Darbouze). Ibsen inches toward a climax through mundanity. Lloyd over-eggs the dread, distrusting your ability to get subtext. Early on, he has Nora and Nils sit back to back while discussing the terms of her loan with a beam of projected light (the lighting design is by Jon Clark) closing in around them. Oh no, bad things will happen if Nora doesn’t pay up! You might already intuit that, because you know how loans work.\n\nWithin this austerity, the supporting cast does, like Nora, still manage to scrimp and save and come up with something good. Moayed, perhaps because his jerkwad performance on Succession is on the mind, makes Torvald a believably insecure mansplainer in skinny jeans (it all makes his bank sound like a 19th-century Norwegian start-up). Onaodowan brings out a sadness in Nils that seems to be choking him even as he imposes over Nora, and Michael Patrick Thornton lends a sweetness to his Dr. Rank, a frequent visitor to the Helmer household who likes to flirt with Nora. Thornton and Chastain’s scenes together are the production’s gentlest, in which both the actors and their characters are at ease, happy to be in a moment together, not telegraphing toward something else.\n\nIt all ends up making this production of A Doll’s House feel like an exercise that acting students might do to get a better bearing on their characters: Do a scene without props. Okay, now do it sitting in chairs. I started to wonder whether Lloyd might come out onstage near the end of the show and announce, “Great work, now hold on to those discoveries when we do this for real.” The restraint must be appealing for an actor, because it gives you so much to push against — like training your jumping height with ankle weights at the gym. But it’s not to the benefit of the audience. We like to watch competitions, not just working out. At the end of the play, Lloyd stages a grand exit for Nora that involves a sudden shifting of the set. Sitting in my perfectly located critic’s seat at the center of the orchestra, I could clearly see Chastain stagger off into a new world. When I talked to a friend afterward who was a few rows away and to the side, she told me she nearly had to stand up to see where Nora was going.\n\nA Doll’s House is at the Hudson Theatre through June 10.\n\nShow \n \n \n Comment\n \n\n Gut-Renovating A Doll’s House With Jessica Chastain\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1098,
  "archivePath": "data/archives/reviews/a-dolls-house-2023/vulture--unknown_2026-02-03.html",
  "textFetchedAt": "2026-02-03T22:26:05.269Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250831151733",
  "archiveOrgUrl": "http://web.archive.org/web/20250831151733/https://www.vulture.com/2023/03/theater-review-dolls-house-ibsen-herzog-chastain-broadway.html",
  "contentTier": "complete",
  "wordCount": 1098,
  "tierReason": "Full review text"
}