{
  "showId": "next-to-normal-2009",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/movies/movie-reviews/normal-theater-review-93046/",
  "publishDate": "April 16, 2009",
  "fullText": "You can’t accuse producers of the new Broadway musical “Next to Normal” of timidity. The show, which deals with a suburban housewife’s descent into mental illness and its traumatic effect on her family, is not exactly surefire commercial fare, despite the generally positive reception it received in earlier productions.\n\nIt would be nice to report that the musical is an artistic triumph, but it remains a decidedly mixed bag despite many laudable aspects. It has been retooled extensively since its off-Broadway premiere at the Second Stage — mostly for the better — but still doesn’t live up to its artistic ambitions.\n\nBrian Yorkey’s book and lyrics track the disintegrating mental state of Diana (Alice Ripley), traumatized years earlier by an event that — in the interest of maintaining the surprise of one of the show’s more strained plot twists — will not be revealed here.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Movies\n \n \n \n \n\n \n \n \n \n Rotterdam Film Festival: 'Variations on a Theme' and 'Master' Win Top Awards \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Berlinale Exclusive\n \n \n \n\n \n \n \n \n Mighty 'Mouse': Inside a Scrappy Indie Success Story\n\nHer loving husband Dan (J. Robert Spencer) is at a loss to deal with her condition, which has failed to be controlled by an endless series of doctors and medications, and teenage daughter Natalie (Jennifer Damiano) is dealing with identity issues of her own and a burgeoning romantic relationship with a pot-smoking fellow student (Adam Chanler-Berat). Only teenage son Gabe (Aaron Tveit) seems unfazed by the chaos.\n\nEventually, Diana finds herself in the hands of a “rock star” therapist (Louis Hobson) who subjects her to shock-therapy treatments with an unfortunate side effect of memory loss.\n\nThe pop-rock musical score by Tom Kitt (“High Fidelity”) boasts catchy numbers, notably Gabe’s passionate declaration “I’m Alive” and Diana’s witty ode “My Psychopharmacologist and I.” But the music, delivered by a six-piece band, proves repetitive, lacking the stylistic variety the complex subject matter demands.\n\nWhile admirably attempting to examine an undeniably important and too-little-discussed health issue, “Normal” is too superficial to be taken seriously, and its explanation of the cause of Diana’s illness feels entirely too pat. (This might be a minority opinion, judging by the reactions of many clearly moved audience members.)\n\nDirector Michael Greif gives his staging the full “Rent” treatment, infusing the proceedings with perhaps more energy than advisable. And Mark Wendland’s abstract, three-tiered set is more redolent of a futuristic cell block than a suburban house.\n\nThere should be no quibbles, though, about Ripley’s powerfully fierce and moving performance, which should garner significant attention come awards time.\n\nVenue: Booth Theatre, New York (Runs indefinitely)Cast: Alice Ripley, J. Robert Spencer, Aaron Tveit, Jennifer Damiano, Adam Chanler-Berat, Louis HobsonMusic: Tom KittBook/lyrics: Brian YorkeyDirector: Michael GreifMusical staging: Sergio TrujilloSet designer: Mark WendlandCostume designer: Jeff MahshieLighting designer: Kevin AdamsSound designer: Brian Ronan",
  "isFullReview": true,
  "dtliExcerpt": "The show succeeds in making audiences care deeply about these characters while never minimizing the devastating impact of mental illness on families.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The show succeeds in making audiences care deeply about these characters while never minimizing the devastating impact of mental illness on families.",
  "contentTier": "truncated",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 458,
  "archivePath": "data/archives/reviews/next-to-normal-2009/hollywood-reporter--david-rooney_2026-02-07.html",
  "textFetchedAt": "2026-02-07T08:38:46.881Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "wrongFullText": "By Jay A. Fernandez, The Associated Press \n\n \n\n November 12, 2009 1:23pm\n\nEmmy-winning writer Stan Berkowitz has been chosen to receive the WGA West Animation Writers Caucus’ animation writing award.\n\nThe lifetime achievement honor will be presented Thursday night at the AWC’s annual awards ceremony at WGAw headquarters in Los Angeles.\n\nBerkowitz’s animated TV writing credits include “Legion of Super Heroes,” “The Batman,” “Transformers: Animated,” “Superman,” “Spider-Man,” “Justice League,” “Static Shock,” “Ben 10” and “The Brave and the Bold.” In live-action, Berkowitz has written for “Dragnet: The 90’s,” “Power Rangers: Space Patrol Delta,” “The New Adam 12,” “Mike Hammer,” “T.J. Hooker” and “The Adventures of Superboy and Cover Up.”\n\nHis screenwriting credits include “Street Corner Justice” and “Acapulco Gold.”\n\n“While Stan has built an acclaimed writing career bringing superheroes to the screen,” said WGAw president John Wells, “he’s a real-life superhero to the animation writing community — not only helping to raise the profile of animation writers through his many creative gifts, but also by playing a lead role in the Guild’s ongoing efforts to organize animation writing.”\n\nRecent AWC Writing Award recipients include Brad Bird, Jules Feiffer, Alan Burnett, Michael Reiss and Linda Woolverton.",
  "misattributedFullText": true,
  "extractedByline": "Jay A. Fernandez",
  "expectedCritic": "David Rooney",
  "_showNotMentionedDiscoveryAttempted": true,
  "wordCount": 458,
  "tierReason": "Missing proper ending or other signals",
  "previousUrl": "https://www.hollywoodreporter.com/news/next-normal-theater-review-91244/",
  "urlDiscoveredAt": "2026-02-07T08:38:46.887Z",
  "urlDiscoveryMethod": "show-not-mentioned-recovery"
}
