{
  "showId": "cyrano-de-bergerac-2012",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2022/04/14/cyrano-de-bergerac-james-mcavoy-as-a-swoon-worthy-swashbuckling-poet/",
  "publishDate": "2022-04-14T21:00:05",
  "fullText": "If you’ve ever wanted to see 900 people hold their collective breath, get thee to the Brooklyn Academy of Music’s Harvey Theater and wait—just wait—for the balcony scene in the Jamie Lloyd Company’s sizzling Cyrano de Bergerac.\n\n“I love you, I need you, I want you, I go to sleep thinking about you and wake up with your voice winding through my head,” begins our intrepid hero, Cyrano (James McAvoy). He’s wooing his beloved Roxane (Evelyn Miller) under cover of night—and technically in the voice of her beloved Christian (Eben Figueiredo)—but he’s speaking from the depths of his about-to-be-shattered heart. “I burn myself alive for you, I worship you, I strip you, I clothe you, I do up the tiniest buttons at your sleeve.… all I can say is I want ― I want ― I want ―” Cyrano has never been so hot.\n\nOf course, there’s actually no balcony to speak of in this barest-of-the-bare-essentials British import production. Nor are there any swords, foppish white plumes, or frilly 17th-century French fashion (as in Betrayal, also directed by Jamie Lloyd, designer Soutra Gilmour sticks to contemporary clothing in cool blues and grays). All the props have pretty much been dispensed with. And that includes The Nose. “When you first see it you say to yourself NO! ―/ that is a party-trick ― take it off, Cyrano,” says Madame Ragueneau (Michele Austin), attempting to describe the magnitude of the man’s deformity. “You expect him to reach up and somehow unscrew it./ But the damage is done: he can never undo it.” So yes…you’ll just have to imagine that McAvoy is in possession of the humongous, hideous schnoz everyone on stage can’t stop talking about.\n\nIn previous productions—including one that Lloyd directed on Broadway in 2012 starring Douglas Hodge (a far more traditional version)—Cyrano has garnered more pity than admiration, despite his skilled swordplay and wordsmithery. Yet here, as soon as McAvoy’s Cyrano, in a well-worn T-shirt and shit-kicker boots, barrels onstage to destroy Valvert (Nari Blair-Mangat) in a rap battle–style “rapier lesson,” we are completely won over by Cyrano’s I’ll-fight-anyone-in-this-room attitude, not to mention his unbridled passion for poetry. Later, he goes off to fight 100 men who are about to descend on his F-the-establishment scribe pal Lignière (Nima Taleghani)—“I’ll give those hundred men a lesson/ in free-speech and the writer’s right to self-expression,” he insists—and emerges with barely a scratch. Making his New York stage debut, McAvoy—who previously partnered with Lloyd in Macbeth, The Ruling Class, and Three Days of Rain—is dominant from the jump, spitting rhymes like a mad-genius slam poet on speed.\n\nAnd it’s not only the physical production that’s stripped down. Lloyd stages many of the scenes with the actors facing front—almost concert-style—with military-precision blocking. It’s low-key and unfussy, and puts the spotlight squarely on the verse. (The very free, and very accessible, adaptation of Rostand’s text is by playwright Martin Crimp.) In case you were confused about the star of the show, just read the phrase on the back wall: “I love words, that’s all.”\n\nCyrano de Bergerac opened April 14, 2022, at the BAM Harvey Theater and runs through May 22. Tickets and information: bam.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "wrongProduction": true,
  "wrongProductionNote": "2022 James McAvoy/Jamie Lloyd production, not the 2012 revival. No cyrano-de-bergerac-2022 entry exists in shows.json."
}