{
  "showId": "appropriate-2023",
  "outletId": "broadwaynews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.broadwaynews.com/the-broadway-review-branden-jacobs-jenkins-appropriate-is-a-paragon-of-southern-drama/",
  "publishDate": null,
  "fullText": "A relentless probe into the wickedness of one family’s history and the intoxication of their ignorance. Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “Appropriate.” From its opening beat, “Appropriate” keeps the Lafayette family in the dark. It’s a literal blackout, engulfing the Hayes Theatre’s stage — as estranged siblings Toni (Sarah Paulson) and Franz (Michael Esper) reunite in the wee hours of night — but also a figurative one, as brother, sister and a third sibling called Bo (Corey Stoll) harbor secrets like precious stones. “Appropriate” introduces a scenario you’ve heard (or lived) before: a group of siblings pack clothes, shoes and age-old grievances and descend on their family home after a parent’s death. The creaking Arkansas-plantation home sits on two disturbing plots: a family crypt and a clearing of unmarked slave graves. America’s greatest sin haunts the “old earth” as the Lafayettes blindly bicker, snarl and reminisce. When plays demonstrate as much merit as “Appropriate,” it’s difficult to identify which star in director Lila Neugebauer’s galaxy shines brightest. Is it Branden Jacobs-Jenkins’ masterful script, laced with insightful irony and biting prose? Is it scenic design collective dots’ lifelike erection of the aging home, littered with racist relics? Or is it the hypnotizing synergy of this ensemble, all of whom balance the horrible actions and the redeeming hearts of these human beings with ease? Yes to all. If special attention must be paid, it’s to Sarah Paulson as the raw, menacing and darkly hilarious Toni. As the eldest sibling and the executor of the family estate (both are trying jobs), she bears most of the grunt work here as she has for several years, taking care of her dying father and, at times, the troubled Franz (Frank, as she knew him). The power in Paulson’s performance feels ancient; she’s Medea protecting what, ultimately, is a tender heart with a vicious mouth and an iron fist. She barks at all who dare muddy her father’s legacy with their accusations of racial prejudice; the result of which is deeply felt. Paulson fights the dirtiest because Toni cares the most. Sooner or later, though, every character earns moments of grit and suspense under Neugebauer’s anxiety-inducing (a compliment in this instance) direction. The play runs 165 minutes and you’ll hold your breath for every one, gobsmacked by the deluge of insults, biases and revelations these family members hurl at one another. Damn if they aren’t all horrible people — liars, perverts, bigots. Damn if they aren’t all trying — repenting, repairing, mothering. Damn if they aren’t all human. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 85,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 456,
  "archivePath": "data/archives/reviews/appropriate-2023/broadwaynews-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:29:09.998Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "scoreSource": "extracted-strong-positive",
  "scoreConfidence": "medium",
  "extractedPhrase": "raves"
}