{
  "showId": "appropriate-2023",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://cititour.com/NYC_Broadway/Appropriate/1193",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $209\n\t Buy Tickets\n\nCititour.com Review\n    Raucous laughs. Loud gasps. Stunned silence. All turn out to be appropriate responses to “Appropriate,” Branden Jacobs-Jenkins’ provocative play, now getting a belated – and yes, excellent -- Broadway production via Second Stage at the Hayes Theater. \n\nCombining elements of everything from “August; Osage County” to “The Shining” – with a strong racial element thrown in, although everyone on stage is white – it’s a singular work that commands our attention, especially in Lila Neugebauer’s excellently calibrated production.\n\nAfter a somewhat extended opening blackout, we find River (a superb Elle Fanning, showing off some unknown stage chops), a new-agey-type young woman and her somewhat older, boyfriend Franz (a pitch-perfect Michael Esper) climbing into what appears to be an abandoned, extremely cluttered Arkansas plantation (brilliantly designed by the scenic collective dots). What appears to be a middle-of-the-night burglary is anything but. Indeed, as we will discover repeatedly throughout the play, what we (and some of the characters) initially think is true may not be at all!\n\nAs it happens, Franz – real name Frank – is no intruder, but the youngest son of the plantation’s now-deceased owner, but he hasn’t been back to his childhood home since fleeing a decade ago after a very disturbing incident. Nor, in the intervening years, has he seen his bossy, emotionally spent oldest sister Toni (a magnificent, scene-stealing Sarah Paulson in a very welcome return to Broadway) or often angry middle brother Bo (the very fine Corey Stoll), both of whom are also present since the house is up for auction the next day.\n\nSoon, the proverbial knives are drawn among this highly dysfunctional clan as their long-held resentments come to the forefront, partially triggered by Frank’s mysterious and sudden re-appearance. In addition to verbal barbs being thrown at fever pitch, a physical brawl even ensues between Toni and Bo’s rather brittle and somewhat overprotective Jewish wife Rachael (a first-rate Natalie Gold).\n\nWhen she’s not berating Toni. Rachael spends most of her time yelling at her kids Ainsley (Lincoln Cohen) and Cassidy (Alyssa Emily Marvin), the latter of whom has a somewhat awkward “crush” on Toni’s older teenaged son, Rhys (Graham Campbell), who has emotional troubles of his own.\n\nAll this in-fighting, alternatively horrifying and hilarious, is exacerbated by the discovery of a photo album of former Black slaves being lynched that probably belonged to the house’s patriarch. The photos (which we never see) engender disgust, fascination, eventually, even greed – and further complicate the three siblings’ memories of their childhood and their dad. \n\nWas he a racist (and an antisemite?). Bo recalls how his dad never looked his African-American college roommate in the eye, while Rachael swears she overheard her father-in-law on the phone refer to her as “Bo’s Jew wife.” (And, as Bo reveals late in the play, he’s not without prejudices of his own!)\n\nOr was such a personality trait truly unthinkable in a man who Toni tells us was almost a Supreme Court judge. Moreover, as Toni asserts, does it even matter to her if her father was the only person she believes truly loved her? That question, albeit in a different form, also confronts River once she learns the real reason Frank left home so many years ago.\n\nFor all the absorbing interfamily drama, perhaps the most interesting section of “Appropriate” occurs after everyone has left the house – a remarkably staged sequence that justifies the play’s longer-than-average running time, It may be --along with Paulson’s performance -- what haunts you long after the curtain comes down.\n    \t    By Brian Scott Lipton\n\nVisit the Sitehttps://2st.com/shows/appropriateOpen/Close DatesOpening 12/18/2023Closing 6/30/2024\nTheatre Info\nHayes Theatre240 West 44th StreetNew York, NY 10036\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 673,
  "archivePath": "data/archives/reviews/appropriate-2023/cititour-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:30:13.908Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}