{
  "showId": "appropriate-2023",
  "outletId": "culturesauce-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://culturesauce.com/2023/12/18/appropriate-broadway-review-sarah-paulson/",
  "publishDate": null,
  "fullText": "Michael Esper, Corey Stoll and Sarah Paulson in 'Appropriate' (Photo: Joan Marcus) Every once in a while, a new play comes along that both honors the traditions of the past and pushes it forward in exciting new ways. Branden Jacobs-Jenkins’ Appropriate, which opened Monday at Broadway’s Hayes Theater is a modern masterpiece that seems to crib elements of dysfunctional family dramas from Tennessee Williams, Eugene O’Neill, Arthur Miller, Horton Foote and Tracy Letts — and then shuffle them in ways that feel entirely fresh and of this particular moment. The setting is a former plantation home in present-day Alabama where we are primed to witness the gathering of the adult children of the just-passed patriarch — a former judge said to have been on the short list for a Supreme Court appointment at one point. The realistic home interior, designed by the collective dots, fittingly evokes both an antebellum grandeur and a hoarder’s haven, piled high as it is with books, boxes and the detritus of a life that is about to be sold off via an estate sale that the heirs hope will repay some of the debt dad racked up in his later years. Sarah Paulson plays the mostly embittered eldest daughter, Toni, who has looked after daddy’s care in his final years and whose prickly personality has pushed away both her now-ex-husband as well as her teenage son (Graham Campbell, endearingly gawky), who’s recently announced plans to move in with his dad after completing a stint in juvie. As magnificently played by Paulson, Toni is a waspish curmudgeon who resents how her contributions to the family have been overlooked, resulting in a hair-trigger temper that’s locked and loaded, ready to deliver cutting takedowns to anyone in her path. That includes her brother Bo (Corey Stoll, the embodiment of a distracted workaholic who does not want to enflame any more drama), who’s descended from a high-power media job in New York City with his wife, Rachael (Natalie Gold), and their two kids, a precocious, meddling 13-year-old (Alissa Emily Marvin, ever-watchful and bristling at her still-a-child treatment) and a rambunctious 8-year-old (Lincoln Cohen, who alternates the role with Everett Sobers). Finally, there’s the black sheep of the family, Franz (Michael Esper, whose hooded eyes betray a lifetime of woundedness), the much younger baby who’s been estranged from his father and siblings for a decade and who turns up with his barely-legal fiancée (Elle Fanning, an avatar of Gen Z all-knowingness), a vegan hippie who calls herself River and spouts aphoristic affirmations that don’t just get under Toni’s skin. Franz, whose siblings can’t shake his old nickname “Frank,” arrives wanting to recite his amends as part of a recovery program from drug and alcohol addiction, a state that contributed to the legal controversy that forced his prompt exit from the family homestead years before. This gesture does not go well, especially for Toni, who suspects that Franz’s interests are more monetary than peace-making, an idea that’s reinforced when River discloses that her parents are both lawyers. The fact is there’s not much of an estate for the siblings to fight over — the house is a mess, there’s a family cemetery plot on the grounds as well as a mostly unmarked gravesite for the plantation’s former slaves. As Bo points out, “You think anyone’s gonna wanna be bothered with all the historical ordinance crap it’ll take to turn this place into a Walmart or whatever-the-hell?” The family legacy is complicated further by the discovery of an old photo album containing images of dead Black men who have been lynched. Was this their father’s? Was he (or one of his ancestors) involved in the horrific deeds captured on film? Answers are in short supply, but tellingly, the family’s response divides them further. Rachael sees an opportunity for a teaching moment for her kids about racial history; Bo eyes a possible financial windfall after calling dealers in race-tinged artifacts; and Franz whiffs an opportunity to cleanse the family of its bad karmic juju. Meanwhile, Toni stands at a stubborn remove from it all — unwilling to confront the increasing likelihood that everything she thought she knew about her family is mistaken. Director Lila Neugebauer orchestrates the scenes with clockwork precision, setting up the siblings’ individual speeches and breakdowns so that the nearly three-hour production seems to fly by. Her staging can sometimes be simplistic, shuffling her characters into a choral half-circle around the stage in key moments. But Jacobs-Jenkins’s tautly crafted script allows for this kind of generosity of focus; we find ourselves watching not only the speaker but the real-time reactions of the other family members as the tension builds. And the entire cast’s performances reward our focus. These are juicy roles, full of rich speeches that smartly reveal character and backstory as they advance the crackerjack plot, but they remain tethered to reality even as they push to Real Housewives-like extremes of emotion. They also grapple with some thorny capital-I issues, from white resentment and entitlement to whether people have the capacity to change (and whether those around them have an obligation to acknowledge that change). The action culminates in an epic blowup that tops the dinner-party scene in August: Osage County and crackles with the kind of raw emotions that only blood relations can generate. And then Appropriate goes further, in a coup-de-theatre epilogue that underscores the deep roots of family dysfunction. There’s no escaping our past, Jacobs-Jenkins suggests — and there’s no denying how powerful, and how powerfully entertaining, this play is. ‘Give Me Carmelita Tropicana!’ celebrates the indie theater scene of old (Off Broadway review)November 10, 2024In \"Theater\" ‘Purpose’ grills a boujee Black family to perfection (Broadway review)April 12, 2025In \"Theater\" Off Broadway review: Branden Jacobs-Jenkins’ truly sensational ‘An Octoroon’February 26, 2015In \"Branden Jacobs-Jenkins\" Δ /* <![CDATA[ */ document.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() ); /* ]]> */",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 85,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 983,
  "archivePath": "data/archives/reviews/appropriate-2023/culturesauce-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:30:19.534Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "scoreSource": "extracted-strong-positive",
  "scoreConfidence": "medium",
  "extractedPhrase": "raves"
}