{
  "showId": "appropriate-2023",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/appropriate-sarah-paulson-broadway-review-8417802",
  "publishDate": null,
  "fullText": "Elle Fanning, Corey Stoll, Natalie Gold, and Michael Esper also star in the Broadway debut of Branden Jacobs-Jenkins’ 2013 play. Lester Fabian Brathwaite is a staff writer at Entertainment Weekly, where he covers breaking news, all things Real Housewives, and a rich cornucopia of popular culture. Formerly a senior editor at Out magazine, his work has appeared on NewNowNext, Queerty, Rolling Stone, and The New Yorker. He was also the first author signed to Phoebe Robinson's Tiny Reparations imprint. He met Oprah once. Sarah Paulson is brilliant at playing villains. It’s not so simple as humanizing them, as human nature is a fickle thing to begin with. No, in her hands, a character’s villainy is impressive, monumental even, without coming off over-the-top or cartoonish. Whether she’s throwing a decanter directly in Lupita Nyong’o’s face in 12 Years a Slave or wiretapping and betraying her best friend as Linda Tripp in Impeachment: American Crime Story, Paulson has a remarkable ability to make acts of moral turpitude thrilling — uncomfortably so. In Appropriate, which opened on Dec. 18 at the Hayes Theater, Paulson is monumental. As Antoinette “Toni” Lafayette, the eldest sibling of the highly dysfunctional Lafayette family, she bulldozes her way through her younger brothers Bo (Corey Stoll) and especially the baby of the family Frank (Michael Esper) as they descend on their Arkansas plantation over a summer weekend to liquidate the dilapidated house their recently deceased father left to rot between them. The Lafayette kids mostly grew up in D.C., but came to Arkansas, where their father’s roots were, every summer. Late in his life, their father bought an old plantation and planned to turn it into a bed and breakfast. But Frank’s twin alcohol and drug addictions, as well as his scandalous affair with an underage girl, depleted the funds and the house fell into disrepair, as all institutions do when left unattended. Written by Branden Jacobs-Jenkins and originally produced in 2013, Appropriate feels very, well, appropriate as social commentary. Toni’s been taking care of everyone her whole life and has grown bitter and resentful as a result. But she is also a martyr, refusing help, always put-upon but by choice, or some sort of self-designated obligation. She was the one who was left to take care of their dying father, even if Bo was the one actually footing the bill, and Frank bears his own emotional scars from time spent alone with their old man. But Toni refuses to see the world in any way but hers; hers is the only right way, her pain is the only valid pain. So when Frank comes back after years of estrangement, now calling himself Franz and sporting a young, hippy-dippy girl on his arm named River (Elle Fanning), with stated hopes of reconciliation (and his unstated hope for money), Toni assumes the worst and is immediately on the defensive. Then Bo has the nerve to accept Franz’s apology...and Toni unhinges her jaw and devours everyone. “That apology isn't for you to accept!” she screams at Bo. “That forgiveness isn't for you! It's for me! It's mine!” Paulson powers through her monologues with such dexterity and force that the audience has no choice but to applaud after she eviscerates her brothers. Also, because they kind of deserve it. As a strong woman saddled with weak-willed brothers in the South, Paulson’s Toni is a sinister sister in solidarity with Regina Giddens, Lillian Hellman’s anti-heroine in The Little Foxes, made legendary by Tallulah Bankhead on Broadway in 1939 and made immortal by Bette Davis on film in 1941. Like The Little Foxes, Appropriate tells the story of the ruin of a white American family trapped by its own history. When Bo’s kids find a book of photos of lynchings among the Lafayette’s patriarch’s things, Toni refuses to believe it belonged to her father. Not her father. She cannot fathom the possibility that the man who raised her and loved her could be someone who fetishized racial violence, even when the kids find jars of ancient appendages, grotesque souvenirs of the white terrorism of the Jim Crow South. Bo’s wife Rachael (Succession’s Natalie Gold), however, has no problems calling a spade a spade. And Toni has no problem calling Rachael an anti-Semitic slur after they get into a battle of wills, as Rachael is literally the only person willing or able to stand up to Toni. Anyone privy to the news and the proposed changes to academic curricula around slavery knows that white America has real problems reckoning with the sins of its past. The first and only real attempt, Reconstruction, ended in bloodshed and brutality. With the passing of enough years and generations, white Americans can now feel absolved of complicity in slavery as well as the lasting effects of discrimination that are all but unignorable to the lives of Black Americans. “I didn’t enslave anybody!” Bo yells at one point, his breaking point. “I didn’t lynch anybody!” As a white man, he’s tired of being society’s villain. Yet, once Bo finds out those abhorrent photos are worth a lot of money, he’s more than willing to sell them, regardless of their history or their implications to his father. He may not have lynched anybody but he’s just fine capitalizing on it. Despite its dark subject matter, Appropriate keeps things surprisingly light and, at two hours and 40 minutes, breezy, thanks, no doubt, to director Lila Neugebauer. The playwright Jenkins is also most concerned with the Lafayette family dynamic, and a family that screwed up is rife for comedy. Paulson is deliciously sardonic as the high-strung Toni, someone who you can just feel the veins throbbing in their temple at all times. The entire cast does fine work, with Gold stealing a fair number of scenes as the equally high-strung Rachael. At first, River seems an odd choice for Fanning’s Broadway debut, the much younger, naïve girlfriend to the man-child Franz. But River’s complexity is a fine match for Fanning, who honed her comedic skills on The Great and brings that same level of steely charm to the role of River. Toni bullies everyone in the family but she can’t bully someone like River, who meets her aggression with frustrating calm. Yet for all her liberal, left-leaning, Portland-living, veganism, River has no qualms about selling the photos, either. They’re not hers to sell, but she speaks on behalf of Franz, who has his own intentions for the photos. Before the play starts, the curtain is lit up with all the definitions of “appropriate.” Sure, it can be an adjective, meaning suitable or proper, but it can also be a verb: to take without permission, to steal. The question of the photos’ ownership is all but answered by the end, leaving Toni to deal with the appropriation of her father’s legacy and what that means for her family — what’s left of it. Toni’s not so much a villain as a victim of her own obstinance, stubbornly clinging to a past that never existed. She’s monumental, all right, but some monuments are eventually torn down. Grade: A",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1183,
  "archivePath": "data/archives/reviews/appropriate-2023/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:32:32.380Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright"
}