{
  "showId": "appropriate-2023",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=-22BY6S",
  "publishDate": null,
  "fullText": "For his 2014 work, now making a scorching Broadway debut, Branden Jacobs-Jenkins has imagined the most spectacularly dysfunctional family since the Westons of August: Osage County. Congregating at an Arkansas plantation that isn't far, as the crow flies, from Tracy Letts' Oklahoma ménage, they're every bit as sharp-elbowed, each of them possessing a black belt in emotional ju-jitsu. While Letts' play has an undertone of race, Jacobs-Jenkins ingeniously puts the issue front and center, laying bare a horrifying secret that has explosive repercussions. Nobody gets out of this one unscathed. In the ironically titled Appropriate the middle-aged siblings Toni and Bo have assembled at the family manse, occupied by seven previous generations and now up for sale. Most recently, it was the home of their late father, a retired Supreme Court judge who, plagued by depression after the death of his wife, developed hoarder tendencies. (This explains the proliferation of junk that stretches past the show curtain.) On the hook for half a million dollars thanks to an aborted bed-and-breakfast scheme, Toni and Bo's prospects are grim; as Bo notes, any large commercial purchaser will be deterred by the presence of two graveyards, one for the family and another filled with the unmarked graves of the plantation's slave population. As it happens, this may be the least of the horrors they must contend with. Bo, a magazine executive, is fixated on profit-and-loss matters because his job is in peril; Toni, a major handful, has emerged from her broken marriage with a wrecked career in education and an adolescent son, Rhys, who was recently incarcerated for drug dealing. \"Rhys is looking so healthy. Maybe we could all use a little juvie,\" comments Bo, making a joke that gets an Arctic reaction from his sister. There's plenty to argue about, including Toni's mishandling of their father's finances and her willful firing of the estate agents the day before the sale. But a whole new war front opens with the arrival of Franz (née Frank), the youngest son, missing in action for a decade after years of booze- and drug-fueled bad havoc capped by a statutory rape charge. Franz, who has come to either make amends or to help himself to his third of the sale's proceeds, is accompanied by his twenty-three-year-old girlfriend Rainbow, who is on hand to stage-manage his repentance. \"She looks legal, right?\" asks Toni, hopefully. The playwright flings an additional stick of TNT into the fray with the discovery of an album containing dozens of photos showing lynched Black men, not to mention a box of jars containing discrete body parts such as ears. This finding raises some ugly questions about their father, cueing standard arguments about him being of his time and thus not to be judged -- but what sort of person keeps such ghastly memorabilia? Things get really squirrely when, following the requisite declarations of horror, someone discovers that the photos might be sold, in the six figures, to private collectors. In its original production, Appropriate had a clanky, monotonous quality that undermined the playwright's premise; the characters came off as shrill and uninteresting, a gaggle of one-note harpies having at each other at a high decibel level. I can't tell what, if any, rewriting has taken place but, under the direction of Lila Neugebauer, a superb cast revivifies the play's foreground, bringing its legacy-of-slavery backdrop into sharper relief. Pulling off the niftiest trick of the season so far, Appropriate engages both as a cankered, poisonously funny black comedy and as a scalding satire on white privilege. Even when you think you've seen it all, Jacobs-Jenkins has more bombshells at his disposal, all of them relevant to his theme. Leading the company in bravura fashion is Sarah Paulson as Toni, the production's prima donna of grievance. Having been disappointed professionally as well as a daughter, wife, and mother, she spares no one with her caustic honesty, dismissing Bo as \"a greedy sack of crap,\" River as \"a walking rape fantasy,\" Franz as a \"juvenile delinquent,\" and Rhys (her own son!) as \"a fuckup.\" She even responds, nervily, with racial epithets when Rachel, who is Jewish, dares to suggest that she might, unconsciously, be a little bit antisemitic. Like all bullies, she is stunned when anyone pushes back, and the miracle of Paulson's performance is how, even in her worst moments, Toni's unappeased pain shines through. This is especially so when she sadly notes, \"There's no one alive who's held me. Isn't that sad? There's no one left in this family -- in this whole world -- who could have told me about the whole me -- the me before I became...this.\" As the most polarizing character currently on Broadway, Paulson simply dazzles, giving no quarter even as she breaks one's heart. She is in excellent company: Corey Stoll is increasingly slippery as Bo, trying to explain away evidence that his father was a Klansman with the excuse \"I don't think he wasn't social enough for this sort of thing,\" and positively salivating at the possibility of cashing in on those hateful photos. Michael Esper will keep you guessing about Franz's motives, especially during his supremely awkward making-amends ritual and in an impulsive climactic gesture that has devastating consequences. Elle Fanning makes a striking stage debut as River, who, behind the beads, burning sage, and New Age platitudes, knows a thing or two about lawyering up. Natalie Gold makes a stunning impression as Rachel, who, fed up with Toni's abuse, all but nails her to the wall in an epic takedown. Representing the younger generation are Graham Campbell as sullen, sleepy-eyed Rhys, exhausted by his mother's intensity, and Alyssa Emily Marvin as Cassidy, Bo and Rachel's thirteen-year-old, who, having seen it all on the Internet, isn't at all shocked at her grandfather's atrocious photos. Adding to the atmosphere, the scenic collective dots delivers a modern, tumbledown Tara that, when first seen, is filled with debris; the design has an effectively haunted look. Jane Cox daringly lights entire scenes keyed off candlelight or a single floor lamp, backing them up with eerie moonlight washes seen through the upstage windows. She also ends most scenes with unsettling green-out effects. Bray Poor and Will Pickens work up surround-sound swarms of cicadas worthy of a Blumhouse horror film. Dede Ayite's costumes are highly character-specific, especially River's studiedly casual look, which leads Bo to mistake her for a Native American. Scenery, lighting, and sound come together for a final flash-forward sequence detailing the house's dire fate. Neugebauer stages the infighting with brio, controlling their pace and punch for maximum effect. Other deftly handled sequences include a midnight break-in and a bit of farce in which Franz, catching Rhys masturbating, tries to stage an escape. A perfectly managed bit of business with a Klan hood fills the house with shocked laughter. (When the family fracas turns physical, the crew from UnkleDave's Fight-House makes the action feel thoroughly real.) Even with all the fireworks, one of the most memorable moments features Paulson alone, on the set's gallery level, lost in contemplation, for once unsure of herself and her next move. Jacobs-Jenkins has been a comer for some time, thanks to the twisty shocker Gloria and, earlier this season, the mordant state-of-the-nation drama The Comeuppance, but this production should give him an even bigger profile. Appropriate, which takes the citation for Most Improved Play of 2023, arrives at the perfect moment, offering a jaundiced, yet penetrating, comment on our collective inability to make sense of America's bloody history. It's a brazen piece of holiday counterprogramming and, in its cold blast of common sense, it couldn't be more welcome. -- David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1292,
  "archivePath": "data/archives/reviews/appropriate-2023/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:34:03.541Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}