{
  "showId": "appropriate-2023",
  "outletId": "nystagereview-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nystagereview.com/2023/12/18/appropriate-check-your-expectations-at-the-door-for-this-brilliantly-subversive-family-drama/",
  "publishDate": null,
  "fullText": "★★★★★ Branden Jacobs-Jenkins's acclaimed play makes its Broadway debut in a revelatory staging. There have been dysfunctional family dramas as long as there have been plays. (After all, what would you call Medea?) But playwright Branden Jacobs-Jenkins definitely ups the ante in Appropriate, his searing 2013 play only now receiving its belated Broadway premiere in a galvanizing staging by Lila Neugebauer. Featuring a stellar cast headed by Sarah Paulson, Corey Stoll, and, making her stage debut, Elle Fanning, this Second Stage Theater production about a family with enough skeletons in its closet to fill a dozen catacombs makes an already powerful play even more powerful. It’s the standout of the Broadway season thus far. The play, set in the summer of 2011, concerns the extended members of the Lafayette clan, who have returned to the now-decrepit, former plantation home of their patriarch who has recently died. During their planning of an impending estate sale, they come across a truly disturbing artifact — a book of old photographs showing the dead bodies of lynched African-Americans. The ensuing repercussions threaten to tear the family dynamics apart. Not that they were strong to begin with. Eldest daughter Toni (Paulson), who cared for their father in his last days, is full of anger toward everyone except her teenage son Rhys (Graham Campbell), for whom she displays an almost disturbing affection. Her brother Bo, short for “Beauregard” (Corey Stoll), who arrives from New York with his wife Rachel (Natalie Gold, Succession) and their children Cassidy (Alyssa Emily Marvin) and Ainsley (Lincoln Cohen and Everett Sobers, alternating), is most interested in monetizing the huge amount of detritus left in the home. Both are surprised by the appearance of their long-estranged younger brother Frank (Michael Esper), who now calls himself Franz, and his much younger, bohemian girlfriend River (Fanning). [Read Melissa Rose Bernardo’s ★★★★☆ review here.] Tensions arise in the play’s opening minutes and barely let up for a second, with decades worth of resentments and recriminations flaring up with white-hot intensity, audibly mirrored by the deafening sounds of cicadas buzzing from outside the house’s peeling walls. Jacobs-Jenkins has clearly immersed himself in the family dramas of O’Neill, Williams, Hellman, Letts and virtually every other playwright who’s trafficked in the genre, making Appropriate feel at times like either a parody or pastiche. But he also brings much originality to the mix, including the disturbing racial themes that make this work by a Black playwright featuring exclusively Caucasian characters feel particularly daring. Incest, pedophilia, masturbation, racism, anti-Semitism, and virtually every other scandalous activity you can think of are all part of the play’s equation, and yet it somehow never feels exaggerated. This is due to the playwright’s ability to create both memorable, three-dimensional characters and the sort of smart, crackling dialogue that brings them fully to life. There’s also tremendous theatricality at work here, including a stage image late in the play that is horrifying in its hilarity and hilarious in its horror, and a coda in which the spiritual decay of the family is allegorically illustrated in vivid scenic terms. I saw the play in its original New York production and was impressed by it. But I don’t remember that version having the sheer visceral impact of this one, which benefits tremendously from the superb production elements courtesy of Dede Ayite (costumes), Jane Cox (lighting), Bray Poor and Will Pickens (sound, including those chilling cicadas) and the scenic design collective known as dots, the latter of whom have devised an ultra-realistic set that seems to be growing mold before your eyes. Director Neugebauer has elicited brilliant performances from Paulson, Stoll and Gold, who turn angry tirades into comic arias; Esper, who at one point brilliantly delivers a monologue that is heartbreaking in its pathos, and Fanning, scoring sly comic points as the hippy-dippy River (even if she is a bit vocally underpowered, as often happens with screen actors making their stage debuts). The younger performers are pitch-perfect as well. The evening begins with a projection detailing the various definitions of the word that gives the play its title. Whether you take it to be a verb, or a noun, or both, probably says as much about you as it does the play. Appropriate opened Dec. 18, 2023, at the Hayes Theater; transferred to the Belasco on March 25, 2024; and runs through June 30. Tickets and information: appropriateplay.com Frank Scheck has been covering film, theater and music for more than 30 years. He is currently a New York correspondent and arts writer for The Hollywood Reporter. He was previously the editor of Stages Magazine, the chief theater critic for the Christian Science Monitor, and a theater critic and culture writer for the New York Post. His writing has appeared in such publications as the New York Daily News, Playbill, Backstage, and various national and international newspapers.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 809,
  "archivePath": "data/archives/reviews/appropriate-2023/nystagereview-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:37:05.532Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}