{
  "showId": "appropriate-2023",
  "outletId": "pagesonstages-wordpress-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.wordpress.com/2024/02/06/appropriate/",
  "publishDate": null,
  "fullText": "Appropriate – [Helen Hayes Theatre] – 06 February 2024 On the surface, Appropriate seems to be about three siblings discovering that their father had been racist to the point of owning photographs of lynchings and a KKK hood. Yet what drew me in was not the universal revulsion, but rather the fact that these three children of the same man, who grew up more or less together, were somehow shaped into very different moral viewpoints of what to do with unseemly information, appropriate ways to interact with fellow humans, and what kind of legacy can be passed on to one’s own children if this is one’s history. For me, one of the most interesting questions Appropriate posed was about the inappropriate/perverse attitudes of his children, all of whom seemed genuinely shocked by the extent to which their father was messed up and twisted. Each sibling embodied a different lens, element, and definition of what was so very wrong in their father—a delineation cleverly alluded to by the pre-show projection showing all of the different yet related definitions of the word “appropriate.” The effects on the siblings and how they were divided was coupled with a story about inheriting property, losing property, and a legacy where people were property. The extent to which the characters struggled with that concept (and how to pass on the lessons of that legacy to the next generation), left me feeling that the most significant, and, in this case, only, thing a person can inherit is intergenerational trauma. The character who picked up the most morally abhorrent elements of his father was Franz, the youngest child. Franz (Frank) exploited bodies in a literal sense. He raped and impregnated a 12-year-old girl. Despite seeming to have changed and evolved into a better person, perhaps due to the overbearing influence of his fiancée River (Tricia), he is in some ways plagued by not having fully grown up and being very susceptible to pressure and influence. He ultimately seeks approval, and doesn’t always see that the manners in which he explores this are, at times, juvenile and inappropriate when not properly tailored to the specific person/context he is talking about. The middle son, Bo, seems at first to be the most open-minded of the siblings. Bo seems to be the most progressive, with his Jewish wife and put-together life. But underneath the surface, lurks a sinister attitude also surrounding exploitation. Bo is incredibly indifferent to the suffering of the victims whose photographs were found in an album of his father’s—that is until he finds out that the photographs could be worth a large sum of money. This is the point in the play where Bo’s perceived morality starts to dissolve. Bo leans into the idea that most of his life’s difficult question can be answered with, “I don’t know.” Rather than use this as a starting point for exploration, up until his final break down, Bo uses “well, we don’t really know” as an ambiguous conversation-ender to avoid having to answer or even think about difficult questions. Worth noting, his daughter Cassidy, is one generation better. She is the first character to think about these horrific photos being worth money, but she seems to have gotten some curiosity from her mother, Jessica, who aptly asks “who would want to buy them?” Though not terribly concerned about the buyers of the photographs, Cassidy is asking questions and trying to parse through this dense jungle of adult thoughts, feelings, and conflicts. Rather than seeking confirmation that her moral impressions are correct, she seems to be seeking reassurance and validation for thoughts that are uniquely her own that she is genuinely uncertain about the morality of. With Franz exploiting bodies for pleasure and Bo exploiting lynching victims for money, what’s left for the oldest (and only female) sibling, Toni, to exploit? In my mind, the most heinous—Toni exploits emotions. In doing so, she seems to wield the poster of any of them. She is a master of manipulating a room on an individual and collective basis. In her quest to tell her truth, she reveals her own ugliness and, in a way, becomes a player in her own emotional exploitation. Toni does not believe in one of the most fundamental hallmarks of what it means to human—the ability to change. She buys into an incredibly constricting double standard: that she has the right and the moral high ground to judge and shame everyone else while she believes herself exempt from all scrutiny. In her touching closing moments of wanting to be held, Toni is not seeking comfort or love. Her words are aimed to kill—to sever herself completely from her siblings while she stands above them on the landing, looking down with disdain and a distinct feeling of her superiority (and her right to assert said superiority), and even play the victim card, to escape any and all potential options to mitigate this disastrous situation. She wants to be held– not to be a better person. She wants to know who she has always been – not who she might be capable of becoming. This is an attitude deeply rooted in a past-oriented outlook that is chillingly recognizable in a post-civil war southern world. Another major theme of this work is about trusting that people are who they say they are. While the siblings are second-guessing their father, they are also second-guessing each other within the realm of what they know. Yet not all characters know all puzzle pieces. Even the younger generation has secrets they’re concealing. No one knows that Rhys is gay and Franz’s lecture on perversion and inappropriate behavior could not have been worse for Rhys because it defined morality in a black and white way that somehow still left Rhys in an uncertain gray area. Although they were having two different conversations (Franz thought Rhys was masturbating looking at the lynching photographs, not the pornography Rhys was watching on his phone—we know that this was gay porn because of the sound cue from his phone before he found his headphones). Even though Rhys realized at some point what Franz thought he had seen, Rhys decided he would rather let Franz believe he was sick and racist than gay. I would wager this conversation made Rhys feel less able to seek acceptance from his family, especially as he was witnessing intolerance from his family the entire weekend. Most significantly, Toni, his mother, perpetuated strong beliefs about strong beliefs and sexual perversion, antisemitism, and lack of appropriate racial sensitivity. How could he come out to a mother who holds nothing but disdain for everyone who is different from her, even within her own family? There were other disturbing elements of Rhys’s generation—particularly in Cassidy. Ainsley runs down the stairs in a KKK hood because he doesn’t know what it is and is too young to see it as anything but a costume piece. I find this to be commentary on context and how children are not born knowing history, or even morality, and have to be taught or exposed to a context that teachers them. But Cassidy? In her own words, she is practically an adult. When looking at these lynching photographs, not only does she not have the historical context to fully understand them (she asks River who Emmett Till was after a quick Google search), but she seems emotionally unaffected by them. She asks River what she’s supposed to feel looking at mangled and mutilated bodies, which refutes the idea that children are born with an innate sense of right and wrong. Why haven’t Bo and Jessica education her on morality? This is just another example of emotional baggage being handed down through generations and how the easiest route is to turn away and decide not to know (which, in a big picture sense, is how the play ends– the siblings not wanting to know each other). After the siblings leave the stage, we see the house die and be forgotten, just as history somehow manages to fade over time, even when it’s vitally important to keep processing the to prevent future generations from continuing the cycle. The final piece of this equation and perhaps the most interesting is River, the one character in the show who is not part of the family. Her radically different, peace/love/joy hippie viewpoint is off putting to these characters, who reject her ideas as nonsense. The idea of white people overstepping their bounds in their desire to be woke or do good is a familiar theme at Second Stage in the past year—most notably in The Thanksgiving Play, and, as an aside, I find it interesting that both of these shows exploring the stupidity of wokeness/leftist ideas were shows without a single person of color in the cast. Although River seeks love and validation too, she seeks it in a different way and from a different perspective, tying together the idea that no matter what walk of life or political background or religion or family history a person comes from, it is still appropriate to want to be loved and respected. I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1529,
  "archivePath": "data/archives/reviews/appropriate-2023/pagesonstages-wordpress-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:38:48.499Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}