{
  "showId": "appropriate-2023",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/Appropriate.html",
  "publishDate": null,
  "fullText": "Musical theatre soundtracksLincoln CenterPear TheatreRegional theater ticketsLyric ArtsStage lighting equipmentPlay directing guidesmusicTheatre news updatesActing classes workshops\n\n\n\n\n\n\n\n\n\n\n            \t\t                  \n                                            \n \n\n\t\n\n\n \n \n\n\n\n Past ReviewsBroadway Reviews\n\nTheatre Review by Howard Miller - December 18, 2023\n\nAppropriate by Branden Jacobs-Jenkins. Directed by Lila Neugebauer. Set design by dots. Costume design by Dede Ayite. Lighting design by Jane Cox. Sound design by Bray Poor and Will Pickens. Fight direction by UnkleDave's Fight-House. Vocal coach Kate Wilson.\nCast:  Graham Campbell, Lincoln Cohen, Michael Esper, Elle Fanning, Natalie Gold, Alyssa Emily Marvin, Sarah Paulson, and Corey Stoll.\nTheater: Second Stage, Hayes Theater, 240 West 44th Street (Between Broadway and 8th Avenue)\nTickets: 2st.com\n\nEven with a decade gone by, there is nothing dated about the play or the production, skillfully directed by Lila Neugebauer to bring out all of its carefully crafted nuances. Indeed, it couldn't be more timely, with a subject matter that has emerged in recent years to be a significant topic of public discourse, getting right at the heart of what is sometimes referred to as \"America's original sin,\" that of slavery, racism, white privilege, and all that these encompass, including a hefty dose of denial and disavowal among those who vehemently proclaim, as one of the characters here does at one point: \"I didn't enslave anybody! I didn't lynch anybody!\"\n\nJacobs-Jenkins, a Black playwright, does not load the deck with blame, shame, and guilt cards, at least not directly. Rather, he allows the play's characters, all of whom are white, to hoist themselves on their own petard over the course of a rancorous, outlandish, and even occasionally darkly funny evening during which we spend time with a group of people whose company few of us would wish to keep. Yet these are folks whose closets are filled with the skeletons of the sort that are likely to be familiar to anyone with an extended family whose differing worldviews are the grist of stomach-churning Thanksgiving feasts.\n\nAppropriate (the title is meant to be pronounced in two different ways and with both meanings, as an adjective and as a verb) takes place in an old family homestead where three adult siblings and their spouses, children, and significant others have gathered to dispose of the house and its contents following the death of their father.\n\nSignificantly, the sprawling if run-down property at the center of the storm, captured in all its faded and dubious glory by the scenic design group known as dots, is a former plantation house in Arkansas, whose land includes a run-down family cemetery (seven generations are interred there, we are told) and another unmarked area where the plantation's enslaved were buried. You'll never hear a peep from the dead on either side, but their presence definitely haunts the play, as does a core mystery about the dear departed paterfamilias, unleashed when an atrocious set of memorabilia is found.\n\nMuch of the interplay in Act I will surely remind you of Tracy Letts' family horror show August: Osage County, with Sarah Paulson's Toni seemingly cut from the same cloth as Letts' wrathful Violet. But for all her malevolence, Toni's story is far more complicated, as the play peels back the layers and reveals the source(s) of her resentment toward her siblings and, really, toward everyone at whom she hurls her venomous screeds that spare no one, not even her son Rhys (Graham Campbell).\n\nToni may be the central force here, but the wellspring of the siblings' pain is their late father, who, as she puts it, may have spent \"the last twenty years of his life rotting away in this house, but he was a brilliant, civilized man.\" You will likely wonder at that assessment after a while, but, in truth, you also will learn that, among his descendants, the apples don't fall far from the tree. You'll not be sorry to see them part company with a final brush-off, and it is likely you will get a lot of satisfaction from the visual display of stage magic that unfolds after everyone has left the stage. As the New Age hippie River reminds us: \"the universe is not a simple thing. It is ancient and complex.\" Appropriate frequently stretches the limits of what it means to be \"over the top,\" but the portrait it paints of human frailty and corruption is as ancient and complex as they come.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 721,
  "archivePath": "data/archives/reviews/appropriate-2023/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:41:47.623Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata"
}