{
  "showId": "appropriate-2023",
  "outletId": "USATODAY",
  "outlet": "USA Today",
  "criticName": "Melissa Ruggieri",
  "url": "https://www.usatoday.com/story/entertainment/theater/2023/12/19/appropriate-broadway-review-sarah-paulson/71968094007/",
  "publishDate": "December 19, 2023",
  "fullText": "BUCKEYESSportsAdd TopicOhio State women's basketball falls to No. 2 UCLAPhil HarrisonStaff WriterDec. 18, 2023, 11:20 p.m. ETThe Ohio State women's basketball team couldn't quite reel-in No. 2 UCLA during a rally in the fourth quarter, losing 77-71 inside of Value City Arena on Monday night.\n\nThings started off well for the Buckeyes as they raced out to an early lead, but the Bruins slowly took control of the contest later in the second quarter and headed into the locker room up 37-31. The Bruins would further exert their will in the pivotal third quarter, stretching the lead out to a commanding 63-45 advantage heading into the fourth.\n\nFrom there, Jacy Sheldon and Ohio State used a 14-2 run beginning at around the eight minute mark to pull to within 69-59 make things interesting, but UCLA had an answer before the Lady Bucks went on another run to close the deficit to just six points with under a minute left.\n\nIt was too little too late as the Bruins closed things out at the free throw line.\n\nSheldon had one whale of a game, scoring 30 points on 12-of-23 field goals, including 3-of-6 from beyond the arc. She also chipped in three rebounds, three assists, and one steal, while turning the ball over just once. Taylor Thierry also scored in double figures with 20 points.\n\nhttps://twitter.com/OhioStateWBB/status/1736924011500835305?s=20\n\nOhio State's inability to match the Bruins on the glass (40 rebounds to 30) and its poor shooting (just 38.5%) ultimately ended up being the Buckeyes demise.\n\nWith the loss, OSU drops to 9-2 on the year and will next host Belmont on Friday afternoon at 1 p.m. ET.\n\nContact/Follow us @BuckeyesWire on X (formerly Twitter), and like our page on Facebook to follow ongoing coverage of Ohio State news, notes, and opinion. Follow Phil Harrison on X.",
  "isFullReview": true,
  "dtliExcerpt": "Sarah Paulson delivers a powerhouse performance in this searing family drama that confronts uncomfortable truths about legacy and prejudice.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 303,
  "archivePath": "data/archives/reviews/appropriate-2023/usatoday--melissa-ruggieri_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:50:08.670Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ]
}