{
  "showId": "appropriate-2023",
  "outletId": "variety",
  "outlet": "VARIETY",
  "criticName": "Aramide",
  "url": "https://variety.com/2023/legit/reviews/appropriate-review-broadway-sarah-paulson-corey-stoll-1235841181/",
  "publishDate": "December 18, 2023",
  "fullText": "Death is cruel to the living. Mourning and memories often bring out a viciousness in those left behind. Hidden secrets and things left unsaid usually come spilling forth, fueled by the rage of grief. The weight of a dead loved one&#8217;s burdens isn&#8217;t easily suppressed. Branden Jacobs-Jenkins&#8217; &#8220;Appropriate,&#8221; now playing on Broadway, is a searing narrative about family ties, past hurts and unbridled pain. It&#8217;s a shocking play centering on legacy, race and the fragility of memory.\n\n&#8220;Appropriate&#8221; opens on the dilapidated estate of the Lafayette family in the dead of summer in rural Arkansas, where the cicadas can be heard loudly buzzing at night. Six months after their father&#8217;s death, three siblings, Toni (Sarah Paulson), Bo (Corey Stoll) and Franz (Michael Esper), come face to face for the first time in a decade to settle their dad&#8217;s affairs and rid themselves of the family home that has become overrun with junk.\n\n\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\t\n\t\t\t\t\n\n\n\t\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\t\n\t\t\n\t\t\t\t\t\t\t\n\n\t\n\t\n\t\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\n\t\n\t\t\n\t\t\t\t\n\t\t\t\t\t\n\n\t\n\n\tVIP+\n\t\n\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\tThe State of Generative AI in Hollywood: A Special Report\t\t\n\t\t\t\n\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\n\t\n\t\n\t\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\t‘Feel-Good’ Raunch-Fest ‘Spermageddon’ Scooped Up by Square One Entertainment: ‘The Funniest Animation We Have Ever Seen’ (EXCLUSIVE)\n\nThis is no happy reunion. Exhausted, with her personal life falling apart at the seams, Toni has long felt the burden of being the eldest — and the only daughter. Having spent years caring for her father, for her youngest brother Franz, and for her son Rhys (Graham Campbell), she is intolerant of new ideas or input.\n\n\n\n\t\t\t\n\t\t\tPopular on Variety\n\nFranz, a recovering addict, has returned home with his new fianc&eacute;, River (Elle Fanning in her Broadway debut), to make amends and to reveal the truth about the father he knew. However, the horrors of his own past misdeeds, including drunken episodes, drug binges and an incident involving an underage girl, are fresh in the memories of his brother and sister.\n\nThe middle child and the mediator of sorts, Bo has brought his wife, Rachael (Natalie Gold), and two young children along for a weekend of family bonding. It&#8217;s clear from the onset, however, that he&#8217;s determined to return to his life in New York City as quickly and seamlessly as possible. Used to throwing money at his problems, this amount of hands-on action and time near his siblings is grossly uncomfortable for him. But unlike Toni, Bo is at least willing to hear Franz out.\n\nAs the weekend progresses and the estate sale draws near, horrific revelations regarding the trio&#8217;s father&#8217;s racism and their own troublesome present come tumbling forth. Though the siblings hurl insults at one another, it&#8217;s clear that they aren&#8217;t without their own monstrosities, no matter how eager they are to showcase how different they are from each other.\n\nUnder director Lila Neugebauer, &#8220;Appropriate&#8221; creates one of the most engaging family dynamics presented on stage. The set, by multi-disciplinary collective dots, is highly effective: Packed full of boxes and trinkets, it&#8217;s a breath away from an episode of &#8220;Hoarders.&#8221; This adds to Toni, Franz and Bo&#8217;s feelings of claustrophobia. The intervals between scenes, however, plunge the audience into total darkness, surrounded by the shrill roaring of cicadas, creating an effect that&#8217;s more jarring than haunting. Additionally, with a runtime approaching three hours, even the humorous bits that slice through the heaviness of the material can&#8217;t save some of the overlong sections and monologues.\n\nStill, the story holds together with incredible performances from the entire cast, particularly Paulson and Stoll, as well as from Alyssa Emily Marvin, who plays Rachael and Bo&#8217;s precocious 13-year-old daughter. More than a family drama, &#8220;Appropriate&#8221; displays the inner thoughts of white people, those who label themselves as well-meaning and progressive, and others who hold disdain and bitterness for minorities and for having to answer to the horrors of their lineage and bigoted ideals.\n\nRacist histories and artifacts are appalling, of course, but it&#8217;s the unwillingness to discuss the past that allows these prejudices to fester across generations. These beliefs not only continue to suffocate us as a society but are also wreaking havoc on the lives of families like the Lafayettes every day.",
  "isFullReview": true,
  "dtliExcerpt": "Branden Jacobs-Jenkins’ “Appropriate,” now playing on Broadway, is a searing narrative about family ties, past hurts and unbridled pain. It’s a shocking play centering on legacy, race and the fragility of memory.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/appropriate/",
  "needsScoring": true,
  "textWordCount": 674,
  "archivePath": "data/archives/reviews/appropriate-2023/variety--aramide_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:24:09.456Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240617112718",
  "archiveOrgUrl": "http://web.archive.org/web/20240617112718/https://variety.com/2023/legit/reviews/appropriate-review-broadway-sarah-paulson-corey-stoll-1235841181/"
}