{
  "showId": "appropriate-2023",
  "outletId": "vulture-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.vulture.com/2023/12/theater-review-branden-jacobs-jenkinss-appropriate.html",
  "publishDate": null,
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nSarah Paulson and Elle Fanning in Appropriate.\n                Photo: Joan Marcus\n              \n            \n              \n        Plenty of therapists will tell you: When you have the urge to say but, pause and replace it with and. It sounds a little hokey, but — and — it’s a small, shockingly easy-to-open door into spaces of greater complexity. Those spaces can be terrifying to enter — people structure their whole lives so as to avoid acknowledging the existence of the door — and if we forced ourselves over the threshold more often, we might live in a different world altogether. I love you and you’re hurting me. He’s suffering and what he’s done isn’t okay. Violent antisemitism is real and once again rising in the world, and Israel is acting indefensibly in Palestine.\n\nBranden Jacobs-Jenkins’s writing lives entirely and electrically in the space of “and.” The cataclysms he builds toward are the result of simultaneous truths — every one of them unfaceable, identity-destroying, or even, in plain fact, fatal for someone — crowding and thickening the atmosphere like gas slowly leaking from a stove, until at last the igniter sparks. In Appropriate, the air is so clotted it’s barely breathable. Jacobs-Jenkins’s 2013 play takes place during a queasy reunion of three adult siblings at the former plantation in Arkansas that belonged to their recently deceased father — and, if anything, the past ten years have only taken a whetstone to the story’s blade. “There was a big debate about whether to update it,” Jacobs-Jenkins told the New York Times. “I didn’t think I could, because these people would look like true idiots if they had not paid attention to what everyone else has paid attention to since then.” Although that makes sense, what’s striking is that the play doesn’t sound like a smart period piece. The voices Jacobs-Jenkins has fashioned for his cast of white characters — all talking like white people around other white people, in their private home, in the South — are still devastatingly credible, even after that decade of cultural shift. In the sensitive hands of director Lila Neugebauer and her top-notch cast, these people are complicated and they’re blinkered, monstrous and pitiable, trying and failing, not individually hateful and collectively matured in a slow cooker of unexamined bias and malice.\n\nFirst, there’s Toni (the absolutely fearsome Sarah Paulson), eldest of the Lafayette siblings. With a bitter divorce and a messy job loss right in the rearview mirror, Toni has arrived in Arkansas in a righteous fury, dragging her teenage son, Rhys (Graham Campbell), in her wake and determined to organize the estate sale and auction of her father’s house herself (“Mom fired the estate people,” Rhys dully informs one of his uncles). In from New York are the Kramer-Lafayettes: Toni’s brother Bo (a perfectly pitched Corey Stoll); his wife, Rachael (Natalie Gold); and their kids, 13-year-old Cassidy (Alyssa Emily Marvin, wonderful in her repeated frustrated howls of “I’m almost an adult!”) and 8-year-old chaos-rocket Ainsley (I saw Lincoln Cohen, who alternates with Everett Sobers in the role). And if that’s not enough personality already packed into the old plantation, the estranged youngest sibling, Franz (Michael Esper), has just snuck in through the window with his willowy, sage-burning, part-time-vegan-chef fiancée, River (Elle Fanning, making her Broadway debut with serene “She’s making jewelry now” energy).\n\nJacobs-Jenkins, who often speaks of his fascination with the 19th-century melodramatist Dion Boucicault (and whose stupendous adaptation of Boucicault’s The Octoroon won him the 2014 Obie, jointly with that year’s Off Broadway premiere of Appropriate), knows how to build an intricate structure on top of a land mine. The Lafayette siblings and their various familial appendages are already bringing enough of their own combustible material onto the stage to power a three-act play, but we know from the beginning that the clamor of their bickering will be dwarfed inside a greater symphony of nightmarish uproar. We know because the first thing we hear, as soon as the theater goes dark, is the droning of cicadas, rising and warping until sound designers Bray Poor and Will Pickens have our brains vibrating with the shrieking cacophony — part mesmerizing and part horrible, like so many banshees. (The play’s opening stage directions specify that this “incessant chatter” should go on long enough to make the audience wonder, Is this it? Is this the whole show?) “Spirits are as real as we are,” warns River, and she’s more right than she knows. The Lafayette homestead has blood in the floorboards, in the lake, in the trees. The cicadas are the hum of all this unacknowledged carnage, all this buried history — and, in their mating dance, they’re also the hum of desire, the desperate struggle of something new trying to be born. Their song softens but never goes away (Is this the whole show? No and yes). It’s always in the background — and in the moments when the characters have the wool ripped from their eyes, it surges like a cresting wave.\n\n“What are you — Oh my God,” says Rachael, distractedly grabbing something Ainsley has pulled off a shelf somewhere in the big old house. It’s the bomb we’ve been waiting for: an old photo album full of pictures of the lynched bodies of Black people. Rachael drops it as if it has just emerged from a 500-degree oven. It lies there smoking. Now, for the rest of the play, the family will play a particularly grisly game of hot potato. That Jacobs-Jenkins recognizes and structures the consequent appalling events with such ludic precision is part of what makes his play so sharp: He’s using the building blocks of comedy, even farce, to reveal a smoldering chasm of cruelty, cowardice, equivocation, and shame. It is funny, and it does burn.\n\nCrucially, though, it’s not played for laughs. Neugebauer understands that the layer Jacobs-Jenkins is adding to the conventional undulations of melodrama — a family with damning secrets, a haunted estate on the brink of loss, a plot full of gaspy twists — is to turn its stock cutouts into people, catastrophic failings and all. In 2014, my predecessor, Jesse Green, disagreed: He saw the Lafayettes as nasty and flat. I can’t speak to that production, but I can imagine an Appropriate that pushes too hard for morbid humor, that tries to send up its floundering souls — which is a way of saying, “Look at these fools; we know better” — rather than granting them, however unearned, a measure of grace. Neugebauer has bravely steered in the opposite direction. She and her actors are taking the risk of taking these people seriously.\n\nAnd it is a risk. The Lafayettes are those other white people, exactly the ones we — and here I mean we lefty white theatergoing folks, in all our anxious 2023 hyper-self-awareness — want to distance ourselves from. But Paulson, Stoll, Esper, and their castmates are all doing their goddamned job, which is to make it hard, despite everything, for us to dismiss them and their pain out of hand. “I believe that everyone onstage is suffering,” Jacobs-Jenkins told the Times. “They all believe they are suffering. But how do we judge — how can we judge — someone else as suffering or not?” When Franz crumples in agony, shouting, “It’s been ten years! How much more am I supposed to suffer for my mistakes, Toni?! … Why won’t you let me be different?,” we know the nauseating depths of Franz’s “mistakes,” and yet we have to consider the question. To Franz’s siblings, he’s “Frank,” and River admits to Toni that her given name is Patricia. Their desire for total transformation becomes a real ethical quandary: They say they want to change — should they be allowed to? Who grants permission? Whose forgiveness is needed?\n\n“That apology isn’t yours!” shrieks Toni at her brother Bo as he half-heartedly moves to accept an “I’m sorry” from wayward Franz. “That apology isn’t for you to accept! That forgiveness isn’t for you! It’s for me! It’s mine!” Paulson’s voice hoarsens and cracks; fury leaks out of her pores. She’s enacting the tragedy of the play’s double-edged title: Its root words mean to own. The verb “to appropriate” still carries its etymology more overtly, but the adjective is what’s interesting — something is “appropriate” if it feels comfortably ownable, if we want to acknowledge and possess it. It’s “inappropriate” if we don’t want to associate with it, if we refuse to lay claim to it. Descended from enslavers, the Lafayettes are still as brutally certain of what is theirs — “that apology,” “a third of this house,” “my daddy” — as what absolutely isn’t. “Who is Emmett Till?” asks Cassidy, Googling around on her phone. “I don’t know,” replies River. “I didn’t enslave anybody!” screams Bo, his reasonable façade finally crumbling into the jagged shards of shortsighted white resentment.\n\nNeugebauer is doing fine work with the whole ensemble, and Paulson and Stoll provide a supercharged core. He tries to stay rational and cool while she runs molten hot, but even as Toni may seem like the most closed off of the three siblings, the most resolutely in denial of the accumulating facts, what’s really going on is thornier than that — and sadder. “Wasn’t I doing what I was supposed to be doing?” she asks wretchedly. “Taking care?” She’s the “crazy” person, the “bitch,” the “sabotaging fucking cunt” — and she meekly asks her teenage son for a hug every time she talks to him. In a moment of deadly calm, she says to her brothers, “You know what I just realized? I’ve known both you idiots your whole entire lives … I remember holding both of you … There’s no one alive who’s held me … And think whatever you want about him now, but Daddy held me.”\n\nToni sees herself as having spent her life caring for others. She sees her father as having cared for her. It’s not that she’s in denial over the photos, the history, the facts — it’s that she’s incapable of prioritizing them above her own emotional experience. Horribly, both are the truth.\n\nIn the introduction to James Baldwin’s play Blues for Mister Charlie — which is distantly based on Emmett Till’s murder — he described how he long avoided sitting down to write the piece because he feared he wouldn’t be able to create a true picture of the murderer. “In life,” he wrote,\n\nobviously, such people baffle and terrify me and, with one part of my mind at least, I hate them and would be willing to kill them. Yet, with another part of my mind, I am aware that no man is a villain in his own eyes. Something in the man knows — must know — that what he is doing is evil; but in order to accept that knowledge the man would have to change … The human being, then, in order to protect himself, closes his eyes, compulsively repeats his crimes, and enters a spiritual darkness which no one can describe.\n\nBut if it is true, and I believe it is, that all men are brothers, then we have a duty to try to understand this wretched man; and while we probably cannot hope to liberate him, begin working toward the liberation of his children.\n\nIn this schema, the Lafayette siblings are both parent and child, and it’s not their active malevolence that has begun to trickle down to the younger generation but their selfishness and unconcern. Things come out of Rhys’s and Cassidy’s mouths that give the lie to Oscar Hammerstein’s optimistic lyric “You’ve got to be carefully taught.” The dreadful truth is that it’s just the opposite: The teaching is automatic, easy — the poison enters by osmosis. What really takes care is the unlearning. But that is a house that the Lafayettes haven’t yet acknowledged they own.\n\nAppropriate is at the Hayes Theater.\n\nShow \n      \n    \n    Leave a Comment\n  \n\n\n\n      An Estate That Divides: Branden Jacobs-Jenkins’s Appropriate\n\n\n\n  \n  \n\n\n  \n\n\n\n        Things you buy through our links may earn Vox Media a commission.\n\nEditor’s Picks\n    \n      \n          \n            \n              \n                \n              \n              \n                trump on trial\n                \n                  Donald Trump Found Guilty on All Counts: Live Updates\n                  Donald Trump Found Guilty on All Counts: Live Updates\n                \n              \n            \n          \n          \n            \n              \n                \n              \n              \n                the national interest\n                \n                  Trump’s Conviction Means Less Than You Might Think\n                  Trump’s Conviction Means Less Than You Might Think\n                \n              \n            \n          \n          \n            \n              \n                \n              \n              \n                the inside game\n                \n                  Does Trump’s Conviction Mean This Is a New Campaign?\n                  Is This a New Campaign Now?\n                \n              \n            \n          \n      \n\n\n  \n\n\n\n\n    \n      \n        \n        Sign In to Comment\n    \n\n\n      \n  \n    Most Popular\n  \n\n  \n            \n      \n        \n          Cinematrix No. 69: May 30, 2024\n        \n      \n    \n            \n      \n        \n          The Double Loss of Under the Bridge\n        \n      \n    \n            \n      \n        \n          The Trump Verdict Memes Are for the History Books\n        \n      \n    \n            \n      \n        \n          Hacks Season-Finale Recap: How to Succeed in Business\n        \n      \n    \n            \n      \n        \n          Fire Jeff Probst\n        \n      \n    \n  \n\n  \n          \n      \n        \n          The Double Loss of Under the Bridge\n        \n      \n    \n          \n      \n        \n          Cinematrix No. 69: May 30, 2024\n        \n      \n    \n          \n      \n        \n          Tom Sandoval Spent 18 Episodes Asking to Get Punched\n        \n      \n    \n          \n      \n        \n          Hacks Season-Finale Recap: How to Succeed in Business\n        \n      \n    \n          \n      \n        \n          Fire Jeff Probst\n        \n      \n    \n  \n\n\n\n\n  \n\n\n  \n    \n    \n\n    \n        \n\n    \n\n    \n        \n\n    \n\n    \n        \n  \n    \n  \n  \n    \n\n    \n    \n      Email\n    \n    \n\n    \n    \n      You\\'ll receive the next newsletter in your inbox.\n    \n    \n      *Sorry, there was a problem signing you up.\n\nThis email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n\nPassword must be at least 8 characters and contain:\n\nYou’re in!\n        As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.\n\nThis email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n\nPassword must be at least 8 characters and contain:\n\nYou’re in!\n        As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.",
  "isFullReview": true,
  "dtliExcerpt": "“Neugebauer is doing fine work with the whole ensemble, and Paulson and Stoll provide a supercharged core.”\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 2295,
  "archivePath": "data/archives/reviews/appropriate-2023/vulture-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:28:20.885Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240531022124",
  "archiveOrgUrl": "http://web.archive.org/web/20240531022124/https://www.vulture.com/2023/12/theater-review-branden-jacobs-jenkinss-appropriate.html"
}