{
  "showId": "appropriate-2023",
  "outletId": "whatsonstage-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.whatsonstage.com/news/appropriate-on-broadway-review-sarah-paulson-and-elle-fanning-star-in-branden-jacobs-jenkins-jaw-dropping-drama_1559990/",
  "publishDate": null,
  "fullText": "The play was seen on UK shores at the Donmar Warehouse\n\n“The feudal ownership of land did bring dignity,” E M Forster opines in Howards End, “whereas the modern ownership of movables is reducing us again to a nomadic horde.” And in the age of steep rents, unaffordable homes, and high interest rates, it is easy to see Foster’s point, however myopically focused on the landed aristocracy it happens to be. Who among us hasn’t fantasised about inheriting an English manor — or perhaps the preferred dwelling of a US-based would-be aristocracy, a plantation house?\n\nOf course, historical baggage comes with the heirloom furniture, as becomes all too clear in Branden Jacobs-Jenkins&#8217; Appropriate, now making its jaw-dropping Broadway debut with Second Stage at the Helen Hayes Theater. It is easily the most electrifying Broadway play of 2023 — something I didn’t expect from a drama that received mixed notices when it first performed off-Broadway in 2014.\n\nFollowing the death of their father, the Lafayette siblings have returned to the Arkansas plantation house that has been in their family for seven generations. The eldest, Toni (Sarah Paulson), is the executor of the estate and was more personally involved in dad’s care, while her brother Bo (Corey Stoll, perfectly cast as a smug big-city elite) wrote checks from New York. Both are surprised by the arrival of their wayward younger brother, Frank (Michael Esper), who now goes by “Franz” and has a girlfriend named River (Elle Fanning). They live in Portland.\n\nNone of them will inherit the house, which must be sold to pay off a $500,000 bank loan taken as part of a failed scheme to transform it into a bed and breakfast. And with the value depressed by the presence of two graveyards on the premises (one for family members, one for the enslaved), it’s unclear they will even make that much. The siblings and their children furiously attempt to clean up the house in preparation for the auction (daddy was a hoarder), separating the junk from anything that might have value. In the process, they make several grim discoveries, including an album full of lynching photos.\n\n“Your father was a somebody long before you came along,” says Rachael (Natalie Gold), Bo’s Jewish wife, “and certainly somebody else when you weren’t in the room.” She has reason to think her father-in-law was an antisemite. But Toni, a daddy’s girl to the end, refuses to accept what is obvious: Her father was either in the Klan, or was content to display the gruesome trophies of his ancestors who were.\n\nThrough a series of increasingly fraught confrontations, Jacobs-Jenkins shows us a family on the verge of unraveling as old resentments are exhumed and cherished beliefs about the deceased are punctured. The playwright is particularly shrewd in his portrayal of the hazy line between family and personal secrets — how people living under the same roof can keep information hidden from one another for decades, often through the willful ignorance of those who don’t want to know.\n\nThis isn’t just true of old dad: Toni’s teenage son Rhys (Graham Campbell, furtive and skulking, but with flashes of sweetness) has secrets of his own, while Franz is trying to shield River from certain aspects of his old life (Esper conveys an ideal balance of pain and self-delusion for this character who goes west to start over). Even Bo and Rachael’s 13-year-old daughter, Cassidy (Alyssa Emily Marvin, beautifully navigating her character’s wild swings between overconfidence and anxiety), contains mysteries her helicopter parents have yet to discern.\n\nPerhaps the most transparent character in the play is Toni, who reveals her wound-up personality from her first line and only doubles-down from there. Paulson brings magnificent intensity and incandescent rage to the role, making sure the back row can feel the full force of Jacobs-Jenkins’s choicest invective. Her presence is so powerful that she need only clear her throat or shift her weight from one leg to the other to make us brace for impact.\n\nWhile Paulson burns the hottest, there’s not a dim bulb in this megawatt cast, all of whom benefit from a gorgeously staged and well-paced production from director Lila Neugebauer. Dede Ayite’s costumes march right up to the border of excess (without going over) in their clear delineation of the various factions of white people exiting within one family (River’s Burning Man fairy princess get-up is a riot). The set (by the design collective dots) makes a striking first impression of faded antebellum glory with its high ceilings, sturdy woodwork, and peeling fresco. A tall staircase annexed as a bookshelf and a stack of three obsolete televisions immediately lets us know what kind of person occupied this formerly grand space. Jane Cox’s elegant natural lighting streams in from high windows, giving the show a touch of the gothic. The sound of nature underscores everything (goosebump-inducing audio effects by Bray Poor and Will Pickens). Even in this space that was built to convey permanence, we sense the constant churn of life and death in the din of cicadas.\n\nA stunning final segment, in which the house itself emerges as the main character of this story, stands out as one of the most poetic and arresting things I’ve ever witnessed on a Broadway stage. With Appropriate, Jacobs-Jenkins demolishes the myth of perpetuity, which has never actually existed for property or power. Generational wealth is nice, but when that material boost becomes more of a burden, it’s time to pull up stakes and go somewhere else.\n\nAppropriate at Donmar Warehouse full cast joining Monica Dolan announced\">\n                        \n                                    \n            \n        \n        \n            \n                \n                    Appropriate at Donmar Warehouse full cast joining Monica Dolan announced                \n            \n        \n    \n\n                                                            \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            Appropriate at the Donmar Warehouse: Adrian Lester, Lolita Chakrabarti and more celebrate with the cast\">\n                        \n                                    \n            \n        \n        \n            \n                \n                    Appropriate at the Donmar Warehouse: Adrian Lester, Lolita Chakrabarti and more celebrate with the cast                \n            \n        \n    \n\n                                                            \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            Appropriate cast celebrate opening night at the Donmar Warehouse\">\n                        \n                                    \n            \n        \n        \n            \n                \n                    Monica Dolan and Appropriate cast celebrate opening night at the Donmar Warehouse                \n            \n        \n    \n\n                                                            \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            Appropriate (Donmar Warehouse)\">\n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: Appropriate (Donmar Warehouse)                \n            \n        \n    \n\n                                                                                \n                    \n                            \n\n            \n\n\n        \n\n        \n\n        \n\n\n        \n\n            \n                        \n\n\n\n\n            \n            \n            \n                \n                    Tagged in this Story\n                \n\n                \n                                            \n                            \n                                    Appropriate\n                            \n                        \n                                        \n            \n                        \n\n            \n\n\n\n\n\n\n\n\n\n\n\n\n            \n            \n\n\n    \n        Latest Reviews\n        \n        \n            See all\n        \n    \n    \n                            \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Cyrano de Bergerac with Adrian Lester at the RSC’s Swan Theatre – review                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Troilus and Cressida at Shakespeare’s Globe – review                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Hamlet at the National Theatre review – Francesca Mills provides the heart in an insightful production                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    13 Going On 30 musical review – a sugar rush of a show, set to thrive                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    The Importance of Being Earnest review – three scene-stealers make this a comedy cracker                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Frantic Assembly’s Lost Atoms at Curve and on tour – review                \n            \n        \n    \n\n                    \n\n            \n        \n\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n        \n            \n            \n            \n            \n            \n            Theatre news & discounts\n                \n                    Get the best deals and latest updates on theatre and shows by signing up for WhatsOnStage newsletter today!\n\nNo matter when or where or who&#8230; we&#8217;re excited!",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1115,
  "archivePath": "data/archives/reviews/appropriate-2023/whatsonstage-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:51:39.773Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251008092231",
  "archiveOrgUrl": "http://web.archive.org/web/20251008092231/https://www.whatsonstage.com/news/appropriate-on-broadway-review-sarah-paulson-and-elle-fanning-star-in-branden-jacobs-jenkins-jaw-dropping-drama_1559990/"
}