{
  "showId": "oklahoma-2019",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Kristen Baldwin",
  "url": "https://ew.com/theater/theater-reviews/oklahoma-sexy-revival-loses-provocative-edge-on-tour-review/?srsltid=AfmBOoom7VZ_54EvlPd--5i__K84I0APjrqTUE9ABmgA-BqlBOpp03zm",
  "publishDate": "April 8, 2019",
  "fullText": "Oklahoma is now playing at the Ahmanson Theatre in Los Angeles. When Daniel Fish's production of Oklahoma hit Broadway in 2019, it quickly earned the affectionate nickname, \"the Oklahoma that f---s.\" Now, the touring production, which strips the Rodgers & Hammerstein classic down to its feral core, is more like the Oklahoma that makes it to second base. Fish's in-the-round staging made the action intimate and raw, bringing the text's sexuality and violence to the forefront. Now, reconfigured to accommodate the proscenium arch of stages around the country, it's lost some of that visceral immediacy. But the concept itself is still there. Now playing at Los Angeles' Ahmanson Theatre, this remains an Oklahoma unlike one anyone's ever seen before, where Laurey (a mesmerizing Sasha Hutchins) is truly conflicted between her attraction to the arrogant, cocksure Curly (Sean Grandillo) and something darker that draws her to misunderstood cowhand Jud Fry (Christopher Bannow). Its stark wood paneled set, onstage band, and modern take on the dream ballet all work toward a notion stripping the musical down to brass tacks. Oklahoma has always had this dark underbelly in its tale of frontier violence, rejection of the \"other,\" and uneasy marriage negotiations — but very few productions are willing to cede the floor to it. That's what makes Fish's revival truly revelatory, his ability to plumb the depths of a musical that has long been whitewashed and revered as a piece of Americana, rather than understood as a critique of it. But it's difficult to connect with that on the same instinctual level when the action is forced into the box of the proscenium and played to theaters that are closer to arenas in size than most Broadway houses. Much of the sexual tension between Laurey and Curly has been nullified or simply swallowed up here, the simmering want and constant threat of violence that defined the Broadway staging given a backseat to some of the wider comedy. Sasha Hutchings is a luminous Laurey, turning her ballads — marked by their confused yearning — into moments of vocal power and precision. She lends the ingenue role a defiant sass that belies the troubled heart at her core, while still allowing those moments of doubt to shine through. We feel her waver between Curly and Jud, as a woman who wants to both embrace and is terrified by her own desire. Here, Curly, played as a blond and toothy golden boy by Sean Grandillo, is just as much of a threat as the sullen Jud Fry, a lonely man who feels more grunge Nirvana than brutish farmhand. They're two sides of the same coin, consumed by their want of Laurey and their sense of entitlement when it comes to her. They are both creatures of lust — sexual lust and bloodlust. The only difference is that Curly has the confidence bestowed by his attractive features that Jud lacks. Grandillo is a less appealing Curly than Damon Daunno was on Broadway, with Grandillo's college athlete good looks eliminating some of Curly's more disarming qualities and replacing them with a sense that this is a man who doesn't understand the word \"no\" because he's never been denied a thing. It's an intriguing read on the role, but it blunts his chemistry with Laurey in ways that undercut their romance. And, perhaps more than Fish intended, it chips away at any sympathy for Curly and Laurey at the conclusion, transforming Curly into an outright murderer. In contrast, Bannow is a heartbreaking Jud, hiding behind a curtain of hair and the comfort of his worn hoodie. Fish's production has always painted Jud as an unloved man deserving of sympathy until we see how his desires have pushed him into creepy incel territory. Bannow pulls back from that even further, making Jud a laconic, clumsy man who's never been given an opportunity to fit in. We can feel Laurey's intrigue, her push and pull between a repulsion fed by his place in the community and a genuine interest in his lonely soul. The comedic relief is out in full force as well, with an audacious Sis as Ado Annie, her performance a full-throated ode to thirsty women who know what they want and take it with both hands. In her hands, Ado Annie isn't a naive girl easily swayed by her desires, but rather a woman whose lust for life (and men) is given free rein over the territory. She's flanked by Hennessy Winkler as the dim-witted Will Parker and Benj Mirman as the slippery Ali Hakim. They're perfect foils to each other, one's scheming outplaying the other's earnestness, and both Winkler and Mirman lean into the outright comedy of their roles. (One small aside: A quibble I've always had with this production is my complete lack of comprehension as to why, when modernizing the show in every other way, there has been no desire to cast Hakim with a Persian actor. I realize that the gag is that everything about him is a lie, but it still rankles.) Barbara Walsh rounds out the core cast as a wry Aunt Eller with a spine of steel, emphasizing the woman's edges over her warmth with effective results. It's a shame then that these extremely fine performances from a markedly talented ensemble are blunted by the tour's staging. Moments that were radical and breathtaking on Broadway feel stagey in this setting, the nuance and intimacy understandably muted in playing to an audience that is miles further away. What made this Oklahoma fresh and sexy was its nearness, its immediacy — the sense of being plopped into the world of these characters to eavesdrop on their better angels and their devilish desires. Here, the Oklahoma that \"f---s\" becomes a less-than-memorable one-night stand as opposed to a ground-shaking, all-consuming encounter that fundamentally transforms one's relationship to the text. Who knew that when it comes to sex, a sense of true intimacy in a dark room is just as important onstage as it is off? B",
  "isFullReview": true,
  "dtliExcerpt": "This Oklahoma! is a thrilling, unsettling, and ultimately triumphant reinvention that honors Rodgers and Hammerstein's masterpiece while giving it a much-needed 21st-century update.",
  "originalScore": 87,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This Oklahoma! is a thrilling, unsettling, and ultimately triumphant reinvention that honors Rodgers and Hammerstein's masterpiece while giving it a much-needed 21st-century update.",
  "contentTier": "complete",
  "contentTierReason": "Short text (23 words)",
  "textQuality": "partial",
  "previousUrl": "https://ew.com/theater/2019/04/08/oklahoma-broadway-review/",
  "urlDiscoveredAt": "2026-02-04T03:43:36.261Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1001,
  "archivePath": "data/archives/reviews/oklahoma-2019/ew--kristen-baldwin_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:43:36.269Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 1001,
  "tierReason": "Full review text"
}