{
  "showId": "oklahoma-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2019/04/07/oklahoma-it-may-not-be-necessary-to-21st-century-update-a-classic/",
  "publishDate": "2019-04-07T20:51:57",
  "fullText": "The commercial for the newest Oklahoma! revival announces that the superb Oscar Hammerstein II-Richard Rodgers musical has been “rewritten for the 21st century,” which begs the musical question, “Does the classic truly need to be rewritten for the 21st century?\n\nI’m steadfastly inclined to say it doesn’t. Of course, it’s acceptable for liberties to be taken for any new treatment, which Daniel Fish, directing this one, has done. Much of it is fine and dandy. Moreover, there are any number of elements here that are just plain super as shaped for a version which appeared earlier this season at St. Ann’s, having originated in a 2015 Bard College tryout.\n\nAt St. Ann’s the audience sat on opposite sides of the theater space, and now the audience wraps around the lozenge-shaped area that has a seven-person band—led by Nathan Koci, at one end and a mural showing flat Oklahoma territory at the other end, Set designer Laura Jellinek stations a few tables and wooden folding chairs on the playing area, lighted (sometimes an eerie green) by Scott Zielinski. The numerous rifles which hung on the wall opposite the farm-land mural at St. Ann’s, are now scattered across the side walls of the auditorium.\n\nIt’s only fair play to first itemize the many pluses of this handled (not quite manhandled) Oklahoma! tale—taken from the Lynn Riggs’ play, Green Grow the Lilacs. The major dramatic suspense hangs on whether likable, fun-loving Curly McLain (Damon Daunno) or bad ‘un farm hand Jud Fry (Patrick Vaill) will take saucy and independent Laurey Williams (Rebecca Naomi Jones) to the social that night—and whether or not they’ll ride in a surrey with fringe on top and whether or not complications will arise when they and other folks, like Laurey’s Aunt Eller (Mary Testa), gather round to auction off the young women’s picnic hampers.\n\nDaunno, who plays his guitar a good bit, and Jones sing out with gusto and swap insults not far from the level of Benedick and Beatrice in William Shakespeare’s Much Ado About Nothing. Testa has fun with Aunt Eller’s orneriness and adds to the evening’s singing (in a traditionally non-singing role). Special praise has to be aimed the way of Ali Stroker, who’s taken on the prairie-promiscuous Ado Annie. She bounds about with fervor in a wheel chair. It may be that her countrified version of “I Cain’t Say No” is the highest of the highlights on display. James Davis comes purty close with his sung and danced “Everything’s Up to Date in Kansas City.” Will Brill doesn’t lift his voice in song much, but he nails down the meddling peddler well enough, particularly on his “mind your own business” line.\n\nSpeaking of countrified versions: The idea (idey, in this context, to rhyme with “Fridy”) behind this new Oklahoma! is that with statehood looking these homesteaders in the eye, a country-westernized Hammerstein-Rodgers isn’t a stretch. Fer sure, “The Farmer and the Cowboy” gladly lends itself, although composer Rodgers, who was a stickler when it came to hearing his scores exactly as he wrote them, may not have been pleased as punch with all the musical gumption going on. Hammerstein would likely have been more polite. Both would probably have missed the inimitable Robert Russell Bennett orchestrations.\n\nBut okay. Another alteration deserving of a nod is Vaill’s ability to convey Jud’s sinister nature while simultaneously lending him some sympathy for not knowing how to express himself favorably to Laurey and everyone else. Fish enlarges the crafty Jud change by projecting on the tall back wall close-ups of Curly and Jud while they sing “Pore Jud Is Daid.”\n\nThere are, however, a few additional shifts that don’t seem to add 21st-century moxie. Not too troubling is Curly’s entrance. In the original version, the first notes heard—and from off-stage—are Curly’s. He enters while singing, as Aunt Eller, who doesn’t see him, is churning butter. Losing the churning is no big deal—now Aunt Eller looks to be preparing the corn bread which will be served to the audience during intermission—but Curly’s being heard before seen is a loss. Maybe this is minor in 2019, since in 1943, when huge chorus opening numbers were the thing, Curly’s appearance was truly startling. Nevertheless, the entrance as written remains effective.\n\nAlso the absence of the shivaree isn’t criminal. The shivaree? What’s that? A shivaree is (was?) a kind of cheerful-jeerful newly-wed razing. In bookwriter Hammerstein’s script, it takes place late in act two and is geared toward Laurey and Curly. It’s good fun but now it’s been dropped. A small shame, because it could be an amusing backward glance at 20th-century customs for 21st-century onlookers.\n\nMore disturbing at one crucial juncture is John Heginbotham’s choreography. It may be news to some but hardly to all that the original—and ground-breaking—choreography was Agnes de Mille’s. Her great contribution was the dream ballet in which Laurey attempts to decide between Curly and Jud.\n\nIt involved a sizable group of dancers, but now has been reduced to one (Gabrielle Hamilton), wearing a light-reflecting T-shirt that says, “Dream Baby Dream.” Although some of the de Mille movements are kept, the (very long) piece looks like nothing so much as a Vassar senior dance thesis.\n\nThe irritatingly gratuitous 21st-century updating has to do with the fight in which Curly and Jud engage after the wedding. Hammerstein (and Riggs, presumably) call for Jud’s flashing a knife and the ugly ramifications. Fish thinks differently. He has Jud hand Curly a wedding-gift pistol. No further details on that are necessary at the moment, but if the outcome is sanguine, it’s only in the harshest way.\n\nIf the genuinely shocking incident is meant to resonate with our jarring culture, let’s all hope that most of us won’t have to see whatever the 22nd-century update turns out to be. Instead, why don’t we all acknowledge that the 20th-century version is the one that will stand the test of time?\n\nOklahoma! opened April 7, 2019, at Circle in the Square and runs through January 19, 2020. Tickets and information: oklahomabroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "show-score-playwright",
    "playbill-verdict",
    "bww-roundup"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2019/04/07/oklahoma-it-may-not-be-necessary-to-21st-century-update-a-classic/",
  "showScoreExcerpt": "\"It’s acceptable for liberties to be taken for any new treatment, which Daniel Fish, directing this one, has done. Much of it is fine and dandy...The irritatingly gratuitous 21st-century updating has to do with the fight in which Curly and Jud engage after the wedding...If the genuinely shocking incident is meant to resonate with our jarring culture, let’s all hope that most of us won’t have to see whatever the 22nd-century update turns out to be.\"\n\nRead more",
  "bwwExcerpt": "Daunno, who plays his guitar a good bit, and Jones sing out with gusto and swap insults not far from the level of Benedick and Beatrice in William Shakespeare's Much Ado About Nothing. Testa has fun with Aunt Eller's orneriness and adds to the evening's singing (in a traditionally non-singing role)....",
  "bwwRoundupUrl": null
}