{
  "showId": "oklahoma-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2019/04/07/oklahoma-back-on-the-farm-but-without-the-bright-golden-haze/",
  "publishDate": "2019-04-07T20:52:33",
  "fullText": "The last time Oklahoma! was revived on Broadway, in 2002, the production had originated in the U.K., where under Trevor Nunn’s direction it earned praise for sharpening the musical’s darker edges. For this fan, though, Nunn tried too hard to illuminate what was already obvious: that the show, like all Rodgers and Hammerstein gems, recognized both the bitter and sweet in its subject matter—in this case, life in early-20th century farm territory grasping towards statehood—with a frankness that was well ahead of its time. (How many musicals can you think of that feature a porn-ogling, trigger-happy stalker as a principal character?)\n\nSo it was with some trepidation that I approached the new, homegrown, more radically reimagined revival of Oklahoma! that just opened at Circle in the Square, again following another acclaimed staging—two, in fact, both of which I cravenly avoided.  Don’t get me wrong: I fully endorse the premise that great American musicals should be as open to new interpretations as any classic theater. But as anyone who’s sat through a clunky or pretentious take on, say, Shakespeare could tell you, not all innovation is created equal.\n\nWhile I’m relieved to report that Broadway’s new Oklahoma! is not as joyless as its last was, this is, in truth, faint praise. As John Lahr wrote in his perceptive review of Nunn’s staging, in The New Yorker, “American optimism has its root in abundance and in the vastness of the land that Oklahoma! celebrates. Britain, on the other hand, is an island the size of Utah. Its culture is one of scarcity; its preferred idiom is irony—a language of limits.” (The Brits do seem more accepting of bombast, as evidenced by Andrew Lloyd Webber’s career and the popularity of jukebox musicals abroad.)\n\nFor director Daniel Fish, who grew up in New Jersey, the issue would seem less cultural and more an overeager desire to dig deeper into characters who have become iconic to musical theater fans, and make their stories more widely accessible to contemporary audiences. Thus we get a Curly who, in Damon Daunno’s performance, could sooner be pictured fronting an indie band than roping cattle. An actor and musician who accompanies himself on guitar during several songs, Daunno can be endearing and even charming in Curly’s goofier moments, but he croons Rodgers’s ravishing melodies in a strained warble that suggests a lounge singer more than a leading man.\n\nIt’s notable that a few members of Fish’s pared-down company, which consists only of principals and a sprinkling of small roles, list little musical theater experience in their credits. James Davis and Will Brill, respectively cast as the dim-witted but lovable cowboy Will Parker and the lusty peddler Ali Hakim, are superb comedic actors, but if they have an affinity for the sense of heightened reality crucial to a form in which characters regularly burst into song and dance, Fish gives them no real showcase for it. In Kansas City, one of several production numbers stripped down to accommodate the lack of a full ensemble, Davis dances about Circle’s thrust stage with plenty of manic energy but little of the finesse required by Agnes de Mille’s groundbreaking original choreography, little of which is tapped here.\n\nPerhaps such touches are supposed to make Oklahoma!’s characters more relatable for those who eschew musicals as contrived. But in striving for realness, Fish can actually reduce the level of their appeal, or the degree to which they earn our empathy. The latter is especially true for the show’s darkest figure, the farmhand Jud, a troubled loner obsessed with Curly’s love interest, Laurey. Though Jud is sometimes played merely as a heavy, better productions have conveyed his own psychological suffering, and pronounced carnality. Here, in Patrick Vaill’s sulking, seething portrayal, he’s a walking mug shot, lifted straight from a news report of the latest shooting spree. (In one scene, projection designer Joshua Thorson casts Vaill’s twitching face larger than life on a screen looming at the back of the set.)\n\nThe women generally fare better. I’ve certainly never seen a sexier Laurey than that of the radiant Rebecca Naomi Jones; pacing the stage in painted-on jeans, Jones underlines the headstrong independence that made her character a progressive ingénue back in the day. There is a purposefully deadened, affect-less quality to some of her lines, particularly those addressing Jud, who terrifies Laurey. But for the most part, Fish wisely chooses not to suppress the actress’s natural vivacity. This extends to Jones’s singing, in an earthy belt that gives way to soft, ethereal top notes; it’s not the pristinely virtuosic soprano we associate with Laurey, but here, the different approach is both credible and compelling.\n\nMary Testa’s marvelously dry Aunt Eller is, likewise, distinctive while making perfect sense in context, a maternal figure whose wit and wisdom would clearly serve her, and her community, in any setting. As Laurey’s frisky pal Ado Annie, Ali Stroker injects a tangy country accent into her singing, accommodating the rootsy orchestrations by Daniel Kluger.\n\nKluger is also among this Oklahoma!‘s most valuable players, fashioning musical arrangements for only eight musicians (a few play two or three instruments) that capture the harmonic richness and poignance, if not the sweep, of Rodgers’s score. The vocal parts, too, are cannily handled, so that fewer than a dozen performers infuse numbers normally delivered by at least twice as many voices with heft and beauty. The modern dance sequence offered in lieu of the Dream Ballet, choreographed by John Heginbotham, is more of a mixed bag, with the charismatic dancer Gabrielle Hamilton hurling and writhing to distorted strains of electric guitar. At one point, Hamilton’s face is projected on screen as mercilessly as Vaill’s had been earlier, so that our noses are rubbed in both Laurey’s conflict and Jud’s derangement.\n\nThese sequences are juxtaposed with fun gestures, from the rows of colored tinsel hanging over Laura Jellinek’s spare set—which also makes prominent, pointed use of gun racks—to the cups of chili and corn bread distributed onstage during intermission. Fun is not joy, though, and too often in this Oklahoma! I found myself missing the sense of magic and transcendence that comes from seeing life, with all its pleasure and pain, elevated by this particular art form.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
