{
  "showId": "the-seafarer-2007",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Ben Brantley",
  "url": "http://www.nytimes.com/2018/04/18/theater/the-seafarer-review-matthew-broderick.html",
  "playbillVerdictUrl": "http://www.nytimes.com/2018/04/18/theater/the-seafarer-review-matthew-broderick.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "https://www.nytimes.com/2018/04/18/theater/the-seafarer-review-matthew-broderick.htmlShare full article4Advertisement\n\nThe Devil wears Matthew Broderick in the Irish Repertory Theater’s production of “The Seafarer,” Conor McPherson’s wonderful 2006 play about a brimstone-scented Christmas Eve in Dublin. And no, Mr. Broderick has not, to my knowledge, created a clothing line.\n\nBut it is the unlikely, enduringly cherubic body of the man who found cinematic immortality as Ferris Bueller that Old Scratch has hijacked to spread tidings of great misery in this solid revival, which opened on Wednesday night under the direction of Ciaran O’Reilly. Or, to be specific, the body of Mr. Broderick in the role of a Mr. Lockhart, who is presumably dead.\n\nSatan isn’t too thrilled about the mortal shape he’s been forced to assume. “I hate these stupid insect bodies you have!” he thunders, in one of the show’s wittiest moments. He flaps his wrists in disgust, as if trying to shake slugs or bird droppings off his hands.\n\nYou can understand his objection. Mr. Broderick has plied his nice-guy puckishness to subversive effect in less-than-lovable roles onscreen and onstage, including in Wallace Shawn’s “Evening at the Talk House” last year. But he is perhaps too naturally passive a presence to be proactively evil. Even when his Mr. Lockhart erupts into barking rage, it is hard to take him seriously as someone who’s a threat to your soul.\n\nThis seeming innocuousness is not entirely out of keeping with the worldview of “The Seafarer,” memorably staged on Broadway in 2007, with Ciaran Hinds as Mr. Lockhart. Like much of the work of Mr. McPherson, one of the greatest playwrights working today, “The Seafarer” blurs the lines between the everyday and the eternal, folding supernatural forces into deceptively natural forms.\n\nMr. O’Reilly’s production, however, is perhaps a bit too scrupulously realistic. For a McPherson drama to have full impact, you need to sense the glow of the numinous within the normal, of the possibility that life as we know it might suddenly catch fire and melt. The flammability quotient here is never very high.\n\nBut if you’re willing to forgive the absence of miracles, this “Seafarer” offers a lucid and straightforward reading of a play that seems to grow only richer with increased acquaintance. Certainly, it is one of the best portraits I know of alcoholism as an existential condition, and of the woes and the balms of heavy drinking.\n\nPotent potables — including that lethal elixir known as poteen — are fuel and sustenance for this play’s five characters, who assemble for drink and cards in the home of the bossy, whiny Richard Harkin (Colin McPhillamy) and his brooding, put-upon brother, Sharky (Andy Murray). And, as realized with exactingly shabby detail in Charlie Corcoran’s wonderful two-story set, a slovenly home it is.\n\nRichard is blind, having lost his sight after falling into a dumpster, and this is his first Christmas “in the dark,” as he puts it. Problems of vision are rampant in “The Seafarer.” The agreeably sodden Ivan Curry (Michael Mellamphy) spends much of the show looking for his eyeglasses.\n\nBut everyone — including the late-arriving Nicky Giblin (Tim Ruddy), who’s dating Sharky’s ex-wife and is accompanied by the dapper Mr. Lockhart — is plagued by a sense of disorientation, of not knowing where he is or how he got there. Drink, of course, can do that to a fellow.\n\nBut in “The Seafarer,” boozing becomes a metaphor for the human condition itself, in which sight functions “through a glass darkly,” to borrow from the New Testament. An unapologetically Christian philosophy pulses throughout this Christmas story, which includes a memorable description of a dream in which a house fly has the eye of God.\n\nMr. McPherson’s dialogue continually coaxes poetry out of mundane conversation. (Richard, for instance, describes his brother as behaving “like a stray cat in a sock.”) And the cast here delivers such speech confidently and entertainingly.\n\nWhat’s lacking — most crucially in Mr. McPhillamy’s blustery Richard, who must become the play’s unexpected moral center — is the sense of a surprising grace at work within these garrulous drunkards. Only Mr. Murray’s excellent Sharky, a self-destructive man who is struggling to stay off the bottle, seems naturally (and un-self-consciously) to straddle two worlds.\n\nThen again, it’s Sharky who has the most at stake here. In the play’s climactic second-act card game, it is his very soul that he has anted up and appears destined to lose.\n\nMr. Lockhart, as might be expected, has a silken way with words. “Time deepens and slows down somehow in a card game,” he says. “It could be any moment. It’s always the same moment.”\n\nThe game, in this rendering, never achieves that state. But Mr. O’Reilly’s scrupulously produced, clearsighted “Seafarer” definitely doesn’t squander time, even if it never quite transcends it.",
  "isFullReview": true,
  "textWordCount": 794,
  "archivePath": "data/archives/reviews/the-seafarer-2007/nytimes--ben-brantley_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:00:02.603Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251010091656",
  "archiveOrgUrl": "http://web.archive.org/web/20251010091656/https://www.nytimes.com/2018/04/18/theater/the-seafarer-review-matthew-broderick.html",
  "contentTier": "complete",
  "wordCount": 794,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2018 outside valid range 2004–2009 for show opening 2007"
}