{
  "showId": "uncle-vanya-2024",
  "outletId": "timeout-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.timeout.com/newyork/theater/uncle-vanya-broadway-review-steve-carell-chekhov-modern",
  "publishDate": null,
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Marc J. Franklin | Uncle VanyaReview\n\n3 out of 5 starsTheater, DramaRecommendedWednesday April 24 2024ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\nThe fraying country estate where Uncle Vanya unfolds is peopled, in the main, by thwarted souls. Its characters wallow in regret, especially the loveless Vanya (Steve Carell). He has sacrificed his money and time, and what he believes to have been his great potential—”I could have been a Schopenhauer, or a Dostoevsky,” he sputters—to support his pompous brother-in-law, Alexander (Alfred Molina), an academic who once enjoyed a great reputation. But now, in middle age, Vanya feels that his reverence for the professor was misplaced. His dutiful work has taken him nowhere, and now he has nowhere to go.\n\nUncle Vanya is set in Russia at the end of the 19th century, but it is perhaps the Chekhov play that feels closest to 21st-century sensibilities, and it is sometimes strikingly prescient of today’s concerns: Vanya’s doctor friend Astrov (William Jackson Harper), for example, is an environmentalist who plants trees to replace those mowed down by industrial loggers, and his artwork paints a worrisome picture of impending “total obliteration.” It’s relatable. There is logic, then, to the decision to dispense with fidelity to Chekhov’s period and update the play to a contemporary setting for Lincoln Center Theater's new production, adapted by Heidi Schreck and directed by Lila Neugebauer. To some extent, the gambit succeeds: Many of the production’s most pleasurable moments are connected to this modernization. But it’s also, I think, where the production falls short.\n\nUncle Vanya | Photograph: Courtesy Marc J. Franklin\n\nSchreck’s lively and attentive translation cleverly retains as much of Chekhov’s language as possible while making it sound fresh. And some of the original details morph felicitously into new forms, especially among the older characters set in their ways: Vanya’s mother (Jayne Houdyshell) as an aging women’s libber; their neighbor Waffles (a delicious Jonathan Hadary) as a hapless cuck; the elderly servant Marina (Mia Katigbak) as a religious Asian nanny. (When she reminisces fondly about noodles, the line has a serendipitous click.)\n\nIt’s in the play’s central characters—who flirt with romance that can’t be consummated—that the concept hits snags. Vanya throws himself abjectly at the professor’s indolent second wife, Elena (Anika Noni Rose), much to her annoyance. Though constrained by her marriage vows, she is fascinated by Astrov, who returns her interest and begins visiting the estate daily. This both delights and tortures the plain, hardworking Sonia (Alison Pill), the professor’s daughter and Vanya’s niece, who has a crush on Astrov but can’t compete with Elena’s beauty. The performances have moments: Carell’s peevish and sardonic Vanya is a sympathetic and often funny depiction of redirected self-disgust; Harper is quirkier (and a lot drunker) than the usual Astrov, but his sexual connection with Rose’s Elena is clearer than I’ve ever seen it, and more central to the action.\n\nUncle Vanya | Photograph: Courtesy Marc J. Franklin\n\nBut because the modernization is more subtractive than additive—old references are pruned away, but few new ones are planted in their place—the characters’ basic decisions seem unmoored from reality. Nothing quite adds up: Why doesn’t this Elena just get a divorce? Why doesn’t this Sonia get a makeover, or try online dating? Why must this family scrimp to support the famous, prolific and presumably tenured professor? In Uncle Vanya’s original setting, the characters are constrained by very real limits, financial and social; here, they seem trapped by authorial mandate—by a shadow fidelity to the mores of a different time and place. Perhaps that explains why this production, despite the talent involved, left me unmoved, and with a nagging question that Vanya might relate to: So much work has gone into this, but what’s it all for?\n\nUncle Vanya. Vivian Beaumont Theater (Broadway). By Anton Chekhov. Adapted by Heidi Schreck. Directed by Lila Neugebauer. With Steve Carell, William Jackson Harper, Anika Noni Rose, Alison Pill, Alfred Molina, Jonathan Hadary, Jayne Houdyshell, Mia Katigbak. Running time: 2hrs 20mins. One intermission.\n\nFollow Adam Feldman on X: @FeldmanAdamFollow Time Out Theater on X: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nUncle Vanya | Photograph: Courtesy Marc J. Franklin\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "dtliExcerpt": "Schreck’s lively and attentive translation cleverly retains as much of Chekhov’s language\n\nRead more",
  "originalScore": null,
  "assignedScore": 100,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1005,
  "archivePath": "data/archives/reviews/uncle-vanya-2024/timeout-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:40:17.007Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "designation": "Critics_Choice",
  "scoreSource": "time-out-stars",
  "scoreConfidence": "medium",
  "originalRating": "5/5 stars"
}