{
  "showId": "giant-2026",
  "outletId": "inews",
  "outlet": "iNews",
  "criticName": "Fiona Mountford",
  "url": "https://inews.co.uk/culture/arts/giant-review-john-lithgow-tyrant-roald-dahl-blistering-antisemitism-play-3298295",
  "playbillVerdictUrl": "https://inews.co.uk/culture/arts/giant-review-john-lithgow-tyrant-roald-dahl-blistering-antisemitism-play-3298295",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "An incisive, powerhouse production, Giant makes us reconsider that age-old dilemma - can we separate the artist from the art? Share this story from The i Paper - and spark a conversation. Gift up to 10 articles a month to a friend, so they can read for free Share this story from The i Paper - and spark a conversation. Gift up to 10 articles a month to a friend, so they can read for free David Byrne’s first season as artistic director of the sleeping giant of British theatres is already well under way, but this powerhouse production provides all the fireworks and fanfare necessary to herald a new era of brighter hopes. The stinging subject matter could not be more timely: Mark Rosenblatt’s blast of a debut play looks at an episode in the summer of 1983 when author Roald Dahl wrote a fiercely antisemitic article and closed his mighty ears to the clamour that ensued. As Rosenblatt shows so incisively, this giant of the international publishing industry was big, yet anything but friendly. It says something – and not something good – about the nature of fame that this incident had no lasting impact on Dahl’s reputation: it is hard to imagine a less profitable author, or a less male one, emerging unscathed in the same way. Dahl (John Lithgow, who in addition to giving an imperious performance has the added bonus of looking decently like the man himself) is a witty tyrant with an unseen policeman on guard after anonymous death threats. His house is in chaos due to tumultuous renovation work supervised by his fiercely protective fiancée Liccy (Rachael Stirling) and his British and American publishers have arrived for crisis talks to beg him to retract, or at least mitigate, his incendiary comments, not least because his new book The Witches is due out imminently. Brit Tom Maschler (Elliot Levey, wonderfully world-weary) is the veteran of myriad bruising past encounters with Dahl, a “human f**king booby trap” of a man who enjoys jibing Maschler about his Kindertransport past. The fictional creation of American newbie Jessie Stone (Romola Garai, in another notable stage turn after her work in The Years earlier this summer) is unversed in this combat, but her hopes that Dahl might prove pliable swiftly evaporate. Stone, Dahl swiftly discovers, is herself Jewish and a blistering speech from Garai ends the first half of Nicholas Hytner’s sharp and focused production. Rosenblatt forces us to consider valid, difficult points: when does rightful concern about the actions of the state of Israel tip over into something else entirely? Dahl speaks with eloquent passion about the suffering caused by Israel’s 1982 invasion of Lebanon but continues, with malignant glee so beautifully conveyed by Lithgow, to goad and provoke, calling Maschler a “house Jew, one of the friendly ones”. Genuine geopolitical concern is eclipsed by fiendish egotism, perverse pleasure-taking and a chilling confidence in his own untouchability. Stirling is deliciously ambivalent as the complicit Liccy, who nonetheless attempts to smooth things over for the sake of Dahl’s putative future knighthood. Levey’s veneer of affability wears ever thinner, while Garai’s Stone looks increasingly shell-shocked at what she is being made to confront. Her disabled son is a huge fan of Dahl’s books, but Rosenblatt wants us all to reconsider the age-old dilemma: can we – should we – separate the artist from the art? To 16 November, Royal Court Theatre (020 7565 5000, royalcourttheatre.com)",
  "isFullReview": true,
  "textWordCount": 575,
  "archivePath": "data/archives/reviews/giant-2026/inews--fiona-mountford_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:09:04.919Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 575,
  "tierReason": "Full review text"
}