{
  "showId": "seminar-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2011/legit/reviews/seminar-1117946828/",
  "publishDate": "November 20, 2011",
  "fullText": "Those wishing columnist Molly Ivins (1944-2007) could cast her caustic, gimlet eye on the GOP primary doings will likely be drawn like a magnet to the Geffen's \"Red Hot Patriot,\" with Kathleen Turner reprising her Philly turn as the lonely liberal from the Lone Star State.\n\nThose wishing columnist Molly Ivins (1944-2007) could cast her caustic, gimlet eye on the GOP primary doings will likely be drawn like a magnet to the Geffen’s “Red Hot Patriot,” with Kathleen Turner reprising her Philly turn as the lonely liberal from the Lone Star State. Ivins was an entertaining force of nature irrespective of one’s politics, but Margaret and Allison Engel’s text doesn’t exactly throw red meat to blue staters. And the star does better by the heart than by the “kick-ass wit” of the fearless cheerleader for civil liberties in the land of football and oil money.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Chicago Fire,’ ‘Med’ and ‘P.D.’ Set Crossover Episodes on NBC in March \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Chicago P.D.' Stars Jesse Lee Soffer and Tracy Spiridakos Set to Return for Crossover\n\nEvery monodrama needs a rationale, and the Engels’ is more logical than many. When we meet Ivins, she’s trying to end a column — one in praise of her beloved, lifelong debating nemesis, her right-winger daddy. Blocked and antsy, she does what millions of scribes have done before her: kill time by thinkin’. Hence the justification for 75 minutes of musing over life and career highlights.\n\nThe text is composed of one part reminiscence; one part exhortation to the audience to become involved citizens instead of passive patsies to the special interests; and two or three parts Molly Ivins’ greatest hits, meaning a string of one-liners. Re why she’s not furious when a corrupt official’s widow is acquitted of his murder: “In Texas, we don’t like to punish people for public service.”\n\nThe zingers, though amusing, don’t amount to any kind of sustained indictment of anyone or anything, not even the fish-in-a-barrel of our previous president whom she takes credit for dubbing “Shrub.”\n\nMoreover, Turner’s characteristically choppy delivery — bursts of talk broken up by pauses in illogically placed places — makes a hash of the droller punch lines, and works against any sense of Pecos drawl. Where Ivins’ flowing, measured delivery conveyed iron conviction in every raised-eyebrow observation, Turner’s Ivins works too hard and comes across as desperate.\n\nWhat Turner excels at are the heartbreak points: the absence of a long-term relationship in her life; regret over the sloppy drinking; sadness (albeit mixed with pride) at her Quixotic quest to knock some sense into the right heads; above all, sorrow at the waste of Vietnam and Iraq.\n\nHelmer David Esbjornson gives her plenty of opportunities to stop and mourn, and plenty of motivation in the acutely chosen projections from her scrapbook, some seemingly doctored up to include Turner’s Ivins in scenes from midcentury America.",
  "isFullReview": true,
  "dtliExcerpt": "Alan Rickman brings his trademark sardonic wit to the role of Leonard, a successful novelist who terrorizes aspiring writers in this comic drama by Theresa Rebeck.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Teaching the young proves a treacherous business for both tutor and students in 'Seminar,' Theresa Rebeck's dark comedy about a literary lion and the young writers he eats for breakfast at his private seminars. Alan Rickman is heaven-sent as the sexy, sneering, snarling literary legend who condescends to tutor four aspiring novelists who have paid through the nose for the privilege of being abused. But these clever youngsters know how to play this intellectual contact sport, and even though everyone stops short of drawing blood, the civilized games they play are enormously entertaining.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-SEMINAR-on-Broadway-Starring-Alan-Rickman-Updating-LIVE-20111120",
  "showScoreExcerpt": "Alan Rickman brings his trademark sardonic wit to the role of Leonard, a successful novelist who terrorizes aspiring writers in this comic drama by Theresa Rebeck.",
  "contentTier": "complete",
  "contentTierReason": "Short text (26 words)",
  "textQuality": "partial",
  "rejectedAt": "2026-02-04T13:42:31.810Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be a brief plot description or promotional blurb rather than an actual review with critical evaluation; openai: The text is a brief description of Alan Rickman's role and does not provide any evaluative content or overall assessment of the production.",
  "promptVersion": "5.2.0",
  "bwwScore": 8,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ]
}
