{
  "showId": "seminar-2011",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2011/11/theater-review-writing-about-seminars-writing-about-writing.html",
  "publishDate": "October 28, 2011",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Jeremy Daniel\n \n \n \n Writer writes about writing: Now, there’s a headline that generally trips my every mental spam filter. Few subjects register higher on my Tediumeter than the struggle of scribes, the agony of creation, the precarious balance of discipline and insanity, the rare thrill of — hey, look at me, trying to make it sound interesting! See, that’s what we do. We self-justify, we self-mythologize. (We have to. We spend a lot of time by ourselves.) All writers want to write about writing, for the same reason the media wants so desperately to cover itself. At least when Stephen King spins this sort of endoscopic yarn, he has courtesy to spill a little blood, as a sop.\n\nNobody dies in Theresa Rebeck’s Seminar, and for approximately two thirds of this delightfully, effervescently empty play, we don’t even want anyone to. That’s a significant achievement, considering how intrinsically irritating all of these characters are and how vastly Rebeck’s interest in them outstrips our own, often by several orders of magnitude. We open in a one-panel New Yorker cartoon: a palatial rent-controlled apartment on the Upper West Side, packed with no-longer-young dilettantes. Poor little rich girl Kate (Lily Rabe), whose family owns the joint, is hosting a writing seminar for a klatch of friends, associates, and connected types, including her platonic longtime pal Martin (Hamish Linklater), a penniless, overeducated do-nothing with a cramped outer-borough apartment as badge and bona fide of his “authenticity.” Also aboard is Douglas (Jerry O’Connell), a poseur with a famous surname and connections aplenty, who mostly surfs between designer-label writers’ colonies, accruing cachet and pseudo-academic buzz phrases. Rounding out the quartet is the hot-to-trot climber Izzy (Hettienne Park), who’s post-feminizing her way to the top of a still mostly male publishing establishment. Into these wobbly pins crashes the instructor, Leonard (Alan Rickman), a once-celebrated, now-embittered novelist who makes a living brutalizing aspiring authors with something he calls “the truth.”\n\nThings you buy through our links may earn Vox Media a commission.\n\nEditor’s Picks\n \n \n \n \n \n \n \n \n the city politic\n \n On Patrol With the New York City Rat Czar\n On Patrol With the New York City Rat Czar\n \n \n \n \n \n \n \n \n \n \n trump on trial\n \n Free the Trump Trial Transcripts\n Free the Trump Trial Transcripts\n \n \n \n \n \n \n \n \n \n \n just asking questions\n \n The Reporter Behind the Trump Hush-Money Trial\n The Reporter Behind the Trump Hush-Money Trial\n \n \n \n \n \n\n \n\n \n \n \n Sign In to Comment\n \n\n \n \n Most Popular\n \n\n \n \n \n \n A Hidden Sexual-Assault Scandal at the New York Philharmonic\n \n \n \n \n \n \n A Reasonable List of Demands for Season Two of Fallout\n \n \n \n \n \n \n Did Drake Finally Record a Kendrick Lamar Diss Track?\n \n \n \n \n \n \n Saturday Night Live Recap: Ryan Gosling Breaks Up with You\n \n \n \n \n \n \n How Can Anyone Keep a Straight Face Around Beavis and Butt-Head?\n \n \n \n \n\n \n \n \n \n A Hidden Sexual-Assault Scandal at the New York Philharmonic\n \n \n \n \n \n \n A Reasonable List of Demands for Season Two of Fallout\n \n \n \n \n \n \n Saturday Night Live Recap: Ryan Gosling Breaks Up with You\n \n \n \n \n \n \n Fallout Series-Premiere Recap: Orange Colored Sky\n \n \n \n \n \n \n Did Drake Finally Record a Kendrick Lamar Diss Track?\n \n \n \n \n\n \n\n \n \n \n\n \n \n\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n\n \n \n Email\n \n \n\n \n \n You\\'ll receive the next newsletter in your inbox.\n \n \n *Sorry, there was a problem signing you up.",
  "isFullReview": true,
  "dtliExcerpt": "The play is funny in spots, but it's also deeply unpleasant, and not in a good way. Rebeck seems to think that making her characters awful will automatically make them interesting.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The play is funny in spots, but it's also deeply unpleasant, and not in a good way. Rebeck seems to think that making her characters awful will automatically make them interesting.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Short text (31 words)",
  "textQuality": "truncated",
  "previousUrl": "https://www.vulture.com/2011/10/theater_review_seminar.html",
  "urlDiscoveredAt": "2026-02-05T05:29:49.427Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 515,
  "archivePath": "data/archives/reviews/seminar-2011/vulture--jesse-green_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:29:49.433Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240415123950",
  "archiveOrgUrl": "http://web.archive.org/web/20240415123950/https://www.vulture.com/2011/11/theater-review-writing-about-seminars-writing-about-writing.html",
  "wordCount": 515,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T01:31:20.700Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This text is heavily corrupted with navigation menus, ad copy, newsletter signup prompts, and other website elements mixed into what might have been a review; openai: The text includes navigation menus, unrelated articles, and sign-up prompts, making it non-scoreable.; gemini: The provided text is incomplete and ends abruptly with newsletter signup information, making it impossible to determine the reviewer's overall assessment of the play.",
  "promptVersion": "5.2.0",
  "sources": [
    "web-search"
  ]
}
