{
  "showId": "the-whos-tommy-2024",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani",
  "url": "https://www.broadwaynews.com/the-whos-tommy-maximum-hertz-maximum-heart/",
  "publishDate": "March 29, 2024",
  "fullText": "Director Des McAnuff’s high-frequency revival pushes Broadway’s boundaries and possibly, its sound barriers. Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “The Who’s Tommy.” If the first 10 minutes of a show are supposed to rope you in, “The Who’s Tommy” dares you to need more than 10 seconds. Director Des McAnuff’s revival staging of the electric rock opera he co-wrote explodes onto the Nederlander Theatre stage in a paroxysm of booming sound, blinding light and crackling projections. That digital gluttony carries throughout this high-octane production about a traumatized young boy named Tommy, who morphs into a “pinball wizard” and then a rock music demigod. At first, it may seem odd that McAnuff encases his and co-book writer Pete Townshend’s story about a young man’s spiritual ascension in so much high-tech, but that juxtaposition is exactly where the magic (and music, also by Townshend) lies. Because amid the digital frenzy, the heart of this musical is still the sad, abused human at its center. There is a darkness to the way Ali Louis Bourzgui plays Tommy — crooning through Townshend’s iconic, primarily sung-through score, his posture erect as he pulls haunting focus. And what a score it is: Townshend’s layered compositions have never sounded better, and sound designer Gareth Owen maintains control. The full band is so loud, yet we can still hear individual chord progressions. There is a cacophony of guitar strums and drum beats, but we can still hear individual zippy sound effects of the pinball machine. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": true,
  "dtliExcerpt": "If the first 10 minutes of a show are supposed to rope you in, “The Who’s Tommy” dares you to need more than 10 seconds. Director Des McAnuff’s revival staging of the electric rock opera he co-wrote explodes onto the Nederlander Theatre stage in a paroxysm of booming sound, blinding light and crackling projections",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/the-whos-tommy/",
  "needsScoring": true,
  "textWordCount": 280,
  "archivePath": "data/archives/reviews/the-whos-tommy-2024/broadway-news--brittani_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:30:05.939Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 280 (min: 300)"
  ]
}