{
  "showId": "the-whos-tommy-2024",
  "outletId": "exeunt-nyc",
  "outlet": "Exeunt NYC",
  "criticName": "Unknown",
  "url": "https://exeuntnyc.com/reviews/review-the-whos-tommy-at-the-nederlander-theatre/",
  "playbillVerdictUrl": "https://exeuntnyc.com/reviews/review-the-whos-tommy-at-the-nederlander-theatre/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "Loren Noveck can’t find the “why” in this revival. The company of The Who’s Tommy. Photo: Matthew Murphy and Evan Zimmerman Revivals are how we engage with theater history–the only way to get audiences to revisit and with the work of the past is to put it up on stage all over. But to do that well and meaningfully, the bridge between past and present needs to be built sturdily: Why this piece should be seen again now. Why I as an audience member want to see it now. Why this director wants to direct it; this star wants to play the role; this theater institution believes the play has something to say. In 1993, The Who’s Tommy took Broadway by storm, winning two Tonys and garnering a rare New York Times rave from Frank Rich. Des McAnuff, who co-wrote the book and won a Tony for directing the original production, returns to reimagine his own work here. Tommy’s themes—the cult of personality and the magnetic pull of celebrity culture, the scarring psychological effects of sexual abuse and bullying, family trauma, autism—seem as relevant as they did in 1969, when Pete Townshend’s original rock opera was released; in 1975, when Kenn Russell’s overwrought film version came out; in 1993. (Possibly even more relevant, in the age of influencers, whose rise to fame seems to this Old about as irrational as pinball wizardry.) The technology of Broadway spectacle has only improved in the past 30 years, especially the use of projections (which are used here by Peter Nigrini in complex, layered ways). Townshend’s musical structure is as complex as it ever was, and the hit songs that emerged from Tommy (“Pinball Wizard,” “I’m Free”) are just as anthemic. And yet I find myself not finding the “why” in this revival, unless appealing to the nostalgia of the well-off middle-aged classic rock lover is reason enough. (That was not enough to buoy Almost Famous; I’ll be interested to see what it does for the Broadway transfer of Stereophonic, which may hit a sweet spot between music geek and theater geek.) There’s no failure of execution here, but to me, there’s not a lot but execution, as if the whole thing feels built to make you admire its ingenuity and craft more than to experience it. Like the opera it was constructed as, it trades in archetypal characters and a not-always-logical plot. And while Tommy isn’t a jukebox musical at all, it is a musical whose songs are staples of the classic rock canon, which makes it behave a little like a jukebox musical: a machine to get you to the next big production number where the audience knows all the words. In trading some of 1993’s multimedia bells and whistles and saturated colors for a stripped-down, techno-futuristic palette and more immersive environmental projections, McAnuff has succeeded with ambience and visual elegance, but has also revealed how broad are the strokes that comprise the characters and plot. That plot: Captain Walker (Adam Jacobs), missing in action in WWII, returns home to find his wife (Alison Luff) in another man’s arms, and kills the rival in front of their young son, Tommy. (Tommy is played by a pair of young actors at ages four and ten; I saw Cecilia Ann Popp and Reese Levine.) Told by his parents that he didn’t see or hear anything, Tommy becomes effectively blind, deaf, and mute, trapped inside himself, doing nothing but rocking back and forth and staring at his own reflection in a mirror. In that mirror, he is also able to commune with his future self (Ali Louis Borzgui): an adult who can issue Tommy’s famous plea, “See me, feel me, touch me, heal me.” Other family members—an alcoholic uncle (John Ambrosino), a brutish cousin (Bobby Conte, with all the swagger of the self-satisfied thug)—take advantage of Tommy’s inability to serve as witness to abuse him: sexually in the case of Uncle Ernie and with casually vicious bullying in the case of Cousin Kevin. (A big swath of the piece comprises various instances of Tommy’s parents swinging back and forth between doggedly bringing him to medical specialists and leaving him completely alone with dangerous caregivers.) Only in discovering a preternatural gift for pinball is Tommy able to express himself. And, when his mother is finally able to break through his trauma—quite literally by smashing the mirror of his obsession—he becomes a guru/demagogue, until he comes full circle and reunites with his family (and his childhood selves). McAnuff starts the show, and then returns late in act II, in a nebulous “future”— perhaps the future as imagined from the original piece’s 1969, as it’s got a Tron-meets-All-Tomorrow’s-Parties aesthetic, with sleek metal headsets and gunmetal gray jumpsuits, patrolled by lightly fascistic thugs. This is the world of Tommy-as-guru, a “very online” world that he will leave behind at the end, in search of a more human existence. From there we snap back to WWII–with Nigrini’s projections building a dizzying environment out of headlines, newsreels, and video layered on multiple scrims and screens–and proceed forward through the 1950s and 1960s. Tommy gets older, but remains inert; only his older mirror self communicates throughout Act 1 and well into Act 2. And we don’t ever really get a sense of what makes Tommy tick; those video projections are never used to give him a sense of interiority, for example. But it’s even weirder that we don’t really get pinball either; this is the thing that allows Tommy to at long last connect with the world, and McAnuff and his design team withhold it from us. The projections build all kinds of environments: an airplane hangar, a church, the various medical institutions in which the Walker family tries to get Tommy cured—but the world of pinball remains tantalizingly abstract. And the problem with withholding pinball is that we need something to bridge the gap between Tommy as victim/pariah and Tommy as messiah. We don’t see what the crowd sees in him either. Perhaps that’s intentional, a metaphor for the insubstantiality of fame in the influencer age, but it feels like a crucial missing link. We don’t really get inside the grim technology future, either; its headsets imply a pinball-to-VR link, but we aren’t granted too much access (another missed opportunity, given the available stage technology). It feels almost like character is being intentionally tamped down here in general; we fill it in around the gaps, but the most compelling scenes are the ones full of intricate movement that tells the story: The opening sequence that goes wordlessly from the meeting of the parents through the missing-in-action knock on the door, with special mention of the effect used to create a sky full of paratroopers. The various hospital visits, with Tommy’s young body passed around from authority to authority, stiff and unengaged. And when the spectacle works, it works very well indeed. David Korins’s set design, built around frames and boxes, presents constantly surprising surfaces for Nigrini’s projections, throwing images back to us like the mirror Tommy can’t stop staring into. Sarafina Bush’s costumes are mostly studiously neutral but pops of sunny yellow recut. Lorin Latarro’s boisterous choreography brings vigor and energy, and cleverly uses dancers almost as human puppeteers to move Tommys old and young in magical ways. The dancing can get a little presentational, but in big numbers like “Pinball Wizard,” it works, though sometimes feels a bit too show-offy. The ensemble is marvelously versatile, filling in the one-song roles like the Pinball Wizard and the Acid Queen as well as soldiers, family, teenagers, giving each group its own identity. The child actors playing Tommy at 4 and 10 have suitable gravitas and sweetness, and their mirroring interactions with Ali Louis Bourzgui as grown Tommy are the emotional heart of the show. And while there’s not much acting to do in the role of Tommy, Bourzgui has a killer voice, and handles the transition from catatonic Tommy to messiah Tommy with a wicked flash of humor. Bobby Conte’s Cousin Kevin relishes his sadism and then puts it to good use as Tommy’s bodyguard, and John Ambrosino finds some pathos in the drunken pedophile uncle, which only makes his behavior toward his nephew more chilling. There’s plenty to mildly enjoy about The Who’s Tommy, but I want a little more from theater. Maybe I’m not quite enough of a Who fan to get in on the nostalgia factor that had the crowd at the Nederlander cheering, nor young enough to see this as new and fresh. It just feels inessential to me, a revival taking us on one more hero’s journey without a lot of sustaining detail. Loren Noveck is a writer, editor, dramaturg, and recovering Off-Off-Broadway producer, who was for many years the literary manager of Six Figures Theatre Company. She has written for The Brooklyn Rail, The Brooklyn Paper nytheatre.com, and NYTheater now, and currently writes occasionally for HowlRound and WIT Online. In her non-theatrical life, she works in book publishing. Read more articles by Loren Noveck",
  "isFullReview": true,
  "textWordCount": 1508,
  "archivePath": "data/archives/reviews/the-whos-tommy-2024/exeunt-nyc--unknown_2026-02-02.html",
  "textFetchedAt": "2026-02-02T05:05:23.697Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_read_more_prompt",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}