{
  "showId": "the-whos-tommy-2024",
  "outletId": "pagesonstages-wordpress-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.wordpress.com/2024/05/23/tommy/",
  "publishDate": null,
  "fullText": "When perusing the libretto of The Who’s Tommy, discerning the story feels like fitting together an intricate puzzle of traumatic moments in a way that doesn’t always quite make logical sense. We typically accept it because music pulsates through our bodies and the rock and roll genre makes us feel alive and transported to another space. But this Broadway revival wasn’t like that. This Broadway revival was directed by Des McAnuff, who not only directed the original Broadway production, but was also a co-writer. 30 years later, the grand vision of these interlocking moments can finally connect in a visual, visceral way that makes everything click and fall into place. But Des McAnuff is not actually the man we have to thank for that. It’s projection designer Peter Nigrini. Right from the beginning, Nigrini steals the show by transporting us through time and space in an effortless way. Using every tool from forced perspective to actual historical footage to document fabrication to live feeds, the nearly five minute overture sets the stage for a story told primarily through choreography (Lorin Latarro), costume design (Sarafina Bush), lighting design (Amanda Zieve), and Peter Nigrini’s aforementioned projection design. Not only was every moment fantastic visually, but Nigrini’s transformation of the space transitioned the story into moments that were incredibly raw and painful, and moments that were simply out of this world into an imaginary future. My favorite moments involved forced perspective, which made the stage feel like it was expanding and contracting, Zieve’s incredibly surreal lighting design interplay for “Acid Queen”, and, of course, when Peter Nigrini put the entire audience inside a pinball machine. I also very much enjoyed the collaboratively clever lighting and costume choices that made it look like Tommy himself was floating through time, space, and ideas unconnected to the floor. My seat was in the rear center mezzanine, and as a sound designer myself, I know that I was not in the sweet spot of who the show was mixed for. But I do think a combination of actor choices and sound design choices (Gareth Owen) made certain bits less intelligible to those who didn’t have the words memorized. The singing was very stylized to rock and roll, which is Owen’s specialty, so I was surprised to find myself straining to hear the phrases in “Cousin Kevin” (though I do think actor Bobby Conte contributed to that as well). I thought the actual sound effects were brilliant and embellished the score in all the right places, but I found myself wishing for a little less reverb, or at least more selective use of it, particularly in ensemble moments. The show is muddy and takes place in weird, liminal space, and I do see how Owen’s choices were consistent with those of his fellow designers. Yet in order for a story like this that spans a lot of conceptual space in its two and a half hours to truly be appreciated, a little more vocal clarity would have gone a long way toward keeping the big picture ideas easily intelligible. The score, of course, is amazing and Owen truly does a fantastic job making sure that music and orchestrations are not just heard, but truly felt in your body. So while we lose some of the words, we lose none of the feelings. A lot happened to the actors themselves, and in particular I want to acknowledge all of the actors who at some point play Tommy. Their bodies are carried around and manipulated and screamed at and poked and prodded—I can’t imagine having to remain so still and emotionless while surrounded by movement, infectious rock and roll music, light, color, and the human impulse to let your feelings show on your face. There’s a palpable nostalgia in the audience of this show, and The Who’s Tommy stands out to me as one of the better Broadway shows that evolved from a concept album because it assigns different meanings and feelings to these songs than the original album was able to by virtue of more unique voices, more instruments, and more mediums to create the kind of texture that put this show over the edge of a performance and into the realm of an experience. Though disappointed that The Who’s Tommy did not receive more Tony nominations, I tangibly felt it accomplish theatre’s true aim—reaching people with a powerful story that genuinely moves them. The audience was attentive, excited, and electric in their own way. In my eyes, this sensation was truly a success. I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 765,
  "archivePath": "data/archives/reviews/the-whos-tommy-2024/pagesonstages-wordpress-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:35:35.392Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "playwright"
}