{
  "showId": "the-whos-tommy-2024",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/TheWhosTommy.html",
  "publishDate": null,
  "fullText": "Broadway Reviews\n \n\n The Who's Tommy\n\n\nTheatre Review by Howard Miller - March 28, 2024\n\n\nThe Who's Tommy. Music and lyrics by Pete Townshend. Book by Pete Townshend and Des McAnuff. Directed by Des McAnuff. Music supervision and additional arrangements by Ron Melrose. Choreography by Lorin Latarro. Scenic design by David Korins. Projection design by Peter Nigrini. Costume design by Sarafina Bush. Lighting design by Amanda Zieve. Sound design by Gareth Owen. Music director and additional orchestrations by Rick Fox. Orchestrations by Steve Margoshes. Wig and hair design by Charles G. LaPointe. Associate director Michael Bello. Associate choreographer Dee Tomasetta. Fight director Steve Rankin. Music coordinator John Miller.\nCast: Ali Louis Bourzgui, Alison Luff, Adam Jacobs, John Ambrosino, Bobby Conte, Christina Sajous, Quinten Kusheba, Reese Levine, Cecelia Ann Popp, Olive Ross-Kline, Haley Gustafson, Jeremiah Alsop, Ronnie S. Bowman Jr., Mike Cannon, Tyler James Eisenreich, Sheldon Henry, Afra Hines, Aliah James, David Paul Kidder, Tassy Kirbas, Lily Kren, Brett Michael Lockley, Nathan Lucrezio, Alexandra Matteo, Mark Mitrano, Reagan Pender, Daniel Quadrino, Jenna Nicole Schoen, Dee Tomasetta, and Andrew Tufano.\nTheater: Nederlander Theatre \nTickets: TommytheMusical.com\n\n\nAli Louis BourzguiPhoto by Matthew Murphy and Evan ZimmermanThe thing about Post Traumatic Stress Disorder is that before you can get to the \"post\" part, you are going to have to endure the trauma part. And there is trauma aplenty in the first half of the revival of the rock opera The Who's Tommy, opening tonight at the Nederlander Theatre. So much so that, at the performance I attended, a child's voice from a few rows behind me rang out: \"I don't like this. I want to get out of here.\"\n\nUnderstandable. Worthy even of a trigger warning, what with scenes of war, a murder, pedophilia, and sadistic bullying all within the first forty minutes or so. All of it in your face and loud the way you'd expect from a hard rock performance.\n\nBack in 1969, when The Who released its recording of \"Tommy,\" as it was called then, the album quickly rose to the top of the LP pile among members of \"my generation\" (which happens to be the title of a very popular song by the group from four years earlier). I mention this because the show as it is currently being performed onstage grabbed me by the throat, swept me in, and brought me fully back to those days in a thoroughly unexpected flashback experience, albeit without the enhancements of headphones and self-medication. \n\nBut even absent these accoutrements, The Who's Tommy is, by any measure, a visual and auditory tour de force, under the direction of Des McAnuff, who also helmed the original 1993 Broadway production that garnered 11 Tony nominations and five wins. There's been some tinkering along the way (by McAnuff and The Who's Pete Townshend who are the book's writers), but the fundamentals remain, even with a puzzling second act that can't seem to decide whether it wants to carry the show into a darkly satirical mode (Tommy as a messianic cult leader) or to celebrate the post-trauma healing process with a prodigal son motif.\n\nThe CastPhoto by Matthew Murphy and Evan ZimmermanSo who is the titular character of Tommy? Hero? Antihero? Up to you to interpret, but, certainly, for the longest time he is a victim. Captured in a series of short scenes supremely abetted by Peter Nigrini's wondrous projection design, the plot kicks off in Britain during World War II. Tommy is born to a teenaged Mrs. Walker (Alison Luff) while his father, Captain Walker (Adam Jacobs), is in a German POW camp and thought to be dead. War ends. Captain Walker comes home, only to find Mrs. Walker in the arms of another man.\n\nA fight breaks out. A shot is fired. Lover dies. And BOOM, we are off and running as the parents take hold of the only other witness, their 4-year-old son Tommy, and corner him: \"You didn't hear it. You didn't see it. You won't say nothin' to no one.\" And just like that, Tommy becomes blind, deaf and mute. He will stay that way for a long time while Mum and Dad seek a cure, which includes visits to shrinks, quacks, and that epitome of sex, drugs, and rock 'n' roll, the Acid Queen (Christina Sajous, who totally owns the stage during her hot and heavy production number).\n\nAlong the way, the Walkers also make some very poor child-care choices in Tommy's sleazebag pedophile Uncle Ernie (John Ambrosino) and his sadistic Cousin Kevin (Bobby Conte). Not your typical Bildungsroman, this, as the performances meander between painfully realistic and trippily surrealistic. (I cannot possibly overpraise the creative design elements; they are consistently thrilling.)\n\nThere are three Tommys on hand, portrayed by three actors doing uncommonly compelling work. Ali Louis Bourzgui is charismatic and a hell of a singer as the older version of Tommy, while two young actors play the character at the age of 4 and at the age of 10. At the performance I attended, Cecilia Ann Popp and Quinten Kusheba were outstanding in these roles, in which Tommy comes as off as essentially catatonic and is hauled around like a rag doll, all splendidly choreographed as is the entire production by Lorin Latarro, who gives us an exciting blend of movement that seamlessly combines the worlds of rock and Broadway performance. The trio of Tommys, all dressed in white by costume designer Sarafina Bush, are the standout characters, whether they are performing individually or collectively, linked by the show's anthem: \"See me. Feel me. Touch me. Heal me.\"\n\nFor fans of the original concept album or of the show's previous Broadway production, or even of Ken Russell's truly weird film incarnation, a ticket to The Who's Tommy is a no-brainer. For anyone else, it will be quite the theatrical experience, a rock opera that truly earns its reputation as the genuine article.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                  \n\n                                                  \n                \n              \n            \n          \n        \n      \n    \n  \n\n\n\n\n\n\n\n\n    \n    \n    \n                \n                \n                \n\n            \n             \n            \n                \n                    \n                        Share:",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 981,
  "archivePath": "data/archives/reviews/the-whos-tommy-2024/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:38:07.064Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250601150516",
  "archiveOrgUrl": "http://web.archive.org/web/20250601150516/https://www.talkinbroadway.com/page/world/TheWhosTommy.html"
}