{
  "showId": "the-whos-tommy-2024",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.theaterscene.net/musicals/broadway/the-whos-tommy/joseph-pisano/",
  "publishDate": null,
  "fullText": "Posted on April 8, 2024 by Joseph Pisano in Broadway, Musicals Alison Luff as Mr. Walker, Olive Ross-Kline as Tommy, aged four, Adam Jacobs as Captain Walker in a scene from the revival of “The Who’s Tommy” at the Nederlander Theatre (Photo credit: Matthew Murphy and Evan Zimmerman) While it certainly aspires to deeper meaning, The Who’s Tommy is, ultimately, a feverish ode to excess, both entertaining and empty, despite serious subject matter that shouldn’t yield either result. Based on Pete Townshend’s 1969 concept album for his band The Who, the quintessential rock opera’s strange mix of youthful agony and thrilling guitar riffs was first brought to full visual life by Ken Russell’s 1975 film, with the idiosyncratic director embracing a memorably deranged approach to the source material. In taking our seats at the Nederlander Theatre, my companion recalled a creatively gloppy scene involving Ann-Margret and wondered if attendees in the front rows of the orchestra should prepare themselves for a shower of baked beans. Alas, when it comes to possessing an anarchic spirit, Des McAnuff, who won a Tony award for helming the original Broadway production three decades ago and has returned to guide the revival, is no Ken Russell. But, as the book’s co-writer with Townshend, McAnuff is self-aware enough to recognize that The Who’s Tommy needs to blow one’s mind through sensory overload. That way, thoughts can’t interfere with the emotional gloss covering the bizarrely bleak world, replete with both Nazis and Nazi wannabes, the show’s “deaf, dumb, and blind” protagonist must endure. Its cheeriest passage is, in fact, the British victory over Germany in World War II, which occurs early on and quickly curdles after Captain Walker (Adam Jacobs), an airman thought killed in action, returns home to London in 1945, to discover that Mrs. Walker (Alison Luff) already has found another fella (Nathan Lucrezio), who her rightful husband promptly murders. Ali Louis Bourzgui as Tommy (center) and the ensemble of “The Who’s Tommy” at the Nederlander Theatre (Photo credit: Matthew Murphy and Evan Zimmerman) The Walkers’ four-year-old son Tommy (Olive Ross-Kline alternating performances with Cecilia Ann Popp) witnesses this death, causing his young parents to berate the poor kid like a potential stoolie: “You didn’t hear it/You didn’t see it/You won’t say nothing to no one.” These commandments prove biblically effective, as Tommy loses each of the corresponding physical senses, freeing the putative grown-ups from any legal worries. As the years pass, the boy’s mysterious afflictions befuddle the swarming efforts of medical science, while the Walkers fret that Tommy’s impairments mean he will never know Jesus and, therefore, remain unsaved. Curiously, the Walkers don’t seem particularly troubled about their own immortal souls, not for that unpunished homicide, or for exposing their son to it, or for further hurting him by letting creepy Uncle Ernie (John Ambrosino) babysit a ten-year-old Tommy (Reese Levine alternating performances with Quinten Kusheba) so that they can enjoy a night on the town. Sexual predators are, of course, often insidiously clever about hiding their behavior, but Mrs. Walker singing, “Do you think it’s alright/To leave the boy with Uncle Ernie?,” suggests that Tommy’s parents are taking a calculated risk that tragically does not work out. For whatever reason, the Walkers also do not protect Tommy from Cousin Kevin (Bobby Conte), a budding National Front member, who dehumanizes Tommy out of sheer sociopathic boredom, placing a lampshade on his head before standing back to admire this cruelty. If that isn’t enough to solidify Townshend and McAnuff’s dim view of familial relations in post-war, middle-class Britain, the outwardly pious Captain Walker–rather than confessing his jealous rage, apologizing for Uncle Ernie, or telling Cousin Kevin to bugger off–brings Tommy to a strung-out prostitute, self-dubbed the Acid Queen (Christina Sajous), to, um, help him. Bobby Conte as Cousin Kevin and the ensemble of “The Who’s Tommy” at the Nederlander Theatre (Photo credit: Matthew Murphy and Evan Zimmerman) As a response to Tommy’s suffering, it obviously doesn’t make much sense, which is apparently the point. Townshend and McAnuff aren’t putting on a kitchen-sink drama. Instead, they’ve created an echo chamber of trauma, impenetrable to anyone but the young adult Tommy (Ali Louis Bourzgui) and his childhood selves who plaintively chant “See me/Feel me/Touch me/Heal me,” occasionally while gaping at each other in their own time-collapsing, mirrored reality. Whatever is happening, the audience is not mentally a part of it. As Tommy progresses through his pain, eventually becoming a world-famous, differently abled pinball wizard who must finally save himself by rejecting this all-consuming celebrity (critic shrugs shoulders and adjusts ear plugs), we get everything but the kitchen sink. There are people in silver fencing masks thrashing on guitars, possibly from a future where swordplay has defeated nuclear technology (does that count as hope?); lighting effects from Amanda Zieve, crafted with all the subtlety of a retinal exam; projections from Peter Nigrini that orient us to the past, present, and future, presumably just in case Gen Z-ers–already confused by what a pinball machine is–should mistakenly think fencing had a crucial role in World War II; Sarafina Bush’s motley mix of costumes, inspired by science fiction, mid-20th-century London fashions, and, most disturbingly, the SS; and Gareth Owen’s sound design, which, à la Spinal Tap, cranks the amps to eleven. But it’s Lorin Latarro’s arresting choreography that truly carries the show, even at various points raising crucified Tommys into the air, so that not a single messianic metaphor is lost amid all the gargantuan sights and sounds. The company of “The Who’s Tommy” at the Nederlander Theatre (Photo credit: Matthew Murphy and Evan Zimmerman) If that type of Christian imagery seems incongruous given Townshend and McAnuff’s withering appraisal of organized religion elsewhere in The Who’s Tommy, then the problem is you’re paying attention. Similarly, it’s also best not to think about the anti-commercial stance of a Broadway show, especially as it shoehorns in a shallow social media critique to entice other ticket-buying demographics. That one will really blow your mind. The Who’s Tommy (through July 21, 2024) Nederlander Theatre, 208 West 41st Street, in Manhattan For tickets, visit http://www.tommythemusical.com Running time: two hours and 10 minutes including one intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1029,
  "archivePath": "data/archives/reviews/the-whos-tommy-2024/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:43:01.472Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}