{
  "showId": "the-whos-tommy-2024",
  "outletId": "timeout-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.timeout.com/newyork/theater/the-whos-tommy-broadway-musical-review-revival-pete-townshend",
  "publishDate": null,
  "fullText": "Thanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nPhotograph: Courtesy Matthew Murphy | The Who's TommyReview\n\n4 out of 5 starsThe classic-rock opera about a traumatized boy returns.Theater, MusicalsRecommendedThursday March 28 2024ShareCopy LinkFacebookTwitterPinterestEmailWhatsAppBuy ticketWritten by Adam FeldmanTheater and Dance Editor, Time Out USAAdvertisingTime Out says\nBroadway review by Adam Feldman\n\n“I’m a sensation!” declares the title character of The Who’s Tommy when, as a 10-year-old boy, he first stands before a pinball machine. We hear this feeling through narration sung by the grown-up version of Tommy (Ali Louis Bourzgui), because the child version is mute; in a psychosomatic reaction to trauma years earlier, he has become a “deaf dumb and blind kid,” albeit one with an astonishing gift for racking up points in arcades. It may be hard for the audience to relate to Tommy, who spends most of the show in the expressionless mien of a child mannequin. The sensation we experience in the trippy nostalgia of this 1993 musical’s Broadway revival is closer to that of a pinball: batted and bounced from one flashy moment to the next in a production that buzzes and rings with activity.\n\nTommy is based, of course, on the 1969 concept album that Pete Townshend wrote for his band, the Who. The plot of this rock opera is not entirely clear just from listening, so the stage musical—adapted by Townshend with director Des McAnuff—reorganizes a few of the songs and fills out the story in a different way than Ken Russell’s outré 1975 film did. During the overture, we see Tommy’s father (Adam Jacobs), an officer in the Royal Air Force, get captured by the German soldiers. (Between this, Harmony, Lempicka, Cabaret and White Rose, it’s quite a year for Nazis in musicals.) When Captain Walker returns to his wife (the very fine Alison Luff), he winds up killing her brutish lover in self-defense. The four-year-old Tommy, who witnesses the crime, takes his parents’ panicked admonitions—”You didn’t hear it / You didn’t see it / You won’t say nothing to no one”—too much to heart.\n\nThe Who’s Tommy | Photograph: Courtesy Matthew Murphy\n\nThe somewhat Pippin-like voyage of self-discovery and showbiz disillusionment that follows has the feel of a fable or allegory, though exactly what it means is up for interpretation. As a character, Tommy is highly passive and impassive: When he is not being ushered from event to event by members of his family, he stares into the mirror to connect with his inner children—until, cured of his affliction, he rises briefly to extreme extroversion as the leader of a cult.\n\nTommy’s blankness means we can project a lot onto him. More clearly than ever, Tommy strikes me as the quasi-autobiographical story of a queer artist’s development. As in the classic Freudian model, a sensitive little boy—who is played, as in 1993, by a little girl—has an absent father and a dominant mother, and becomes trapped in a narcissistic fixation. His parents try to change him through religion (“How can he be saved / From the eternal grave?”), medical treatment (“There’s a man I’ve found could remove his sorrow”) and even a visit to a strung-out prostitute who calls herself the Acid Queen (“If your child ain’t all he should be now / This girl will put him right”). Meanwhile, unable to tell anyone about his plight, he is molested by his tippling uncle (John Ambrosino) and mercilessly bullied by a sadistic cousin (Bobby Conte) and other local toughs. Only later is he able to transmute his pain into expression, leading to mass stardom and screaming fans.\n\nThe Who’s Tommy | Photograph: Courtesy Evan Zimmerman\n\nAll of the above is conjectural: Tommy’s rainbow arc remains, at most, hazy. But the musical’s individual beats hit cleanly. Townshend’s score delivers punch after punch of classic rock, threaded together with emotional motifs, and it is sung powerfully by Bourzgui and the rest of the cast, which includes Christina Sajous as the Acid Queen and Sheldon Henry as her pimp. McAnuff has retained some signature elements of his original staging, such as the white boxes, while souping up the rest as a sleek, creepy retrofuturist playground for his superb designers: David Korins (set), Peter Nigrini (projections), Sarafina Bush (costumes), Amanda Zieve (lighting) and Gareth Owen (sound). Choreographer Lorin Latarro is the production’s most valuable player; because the songs are mostly short and ambiguous, much of Tommy is effectively a dance show, and Latarro comes through with remarkable numbers—the Broadway season’s best choreography to date—that are executed with thrilling energy and skill by the ensemble.\n\nThe deaf and blind would miss a great deal of what makes Tommy work, but it might actually help to be a little dumb. It’s best, at least, not to think too hard about this show, which is dramaturgically unwieldy—drawn out in the first act, rushed and overstuffed in the second—and sometimes doesn’t make sense. (McAnuff sets a big chunk of it in “the future,” which the projections make clear is our future, even though the action is explicitly set in post–World War II England.) And yet, despite these problems, the show works, and its epic choral finale somehow feels genuinely rousing and healing. As musical theater, Tommy is limited. On its own terms, it’s often sensational.\n\nThe Who's Tommy. Nederlander Theatre (Broadway). Music and lyrics by Pete Townshend. Book by Townshend and Des McAnuff. Directed by McAnuff. With Ali Louis Bourzgui, Alison Luff, Adam Jacobs, John Ambrosino, Bobby Conte, Christina Sajous, Sheldon Henry. Running time: 2hrs 5mins. One intermission.\n\nFollow Adam Feldman on X: @FeldmanAdamFollow Time Out Theater on X: @TimeOutTheaterKeep up with the latest news and reviews on our Time Out Theater Facebook page\n\nThe Who’s Tommy | Photograph: Courtesy Evan Zimmerman\n\nBeen there, done that? Think again, my friend.\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nDiscover Time Out original video\n\nBack to TopCloseGet us in your inbox\n\nBy entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\ntiktokfacebooktwitteryoutubeAbout us\n\nPay to remove ads with contentpass\n\nAccess Time Out and over 600 other websites without banner ads, personalized tracking and video ads for only £3.49 per month.\n\nAlready have a contentpass account?\n\nMore information about our ads is available in our privacy manager\n\nYou can withdraw your consent at any time by visiting Privacy Preferences in the footer. Your consent only applies to this website. For more information, please see our Privacy Policy.\n\nThe following vendors use this purpose:",
  "isFullReview": true,
  "dtliExcerpt": "\"As musical theater, Tommy is limited. On its own terms, it’s often sensational.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1235,
  "archivePath": "data/archives/reviews/the-whos-tommy-2024/timeout-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:44:35.238Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}