{
  "showId": "the-whos-tommy-2024",
  "outletId": "variety-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://variety.com/2024/legit/reviews/tommy-review-broadway-musical-2024-1235954615/",
  "publishDate": null,
  "fullText": "There are two kinds of people in this world: Those that love bone-shaking, ear-splitting spectacles, like fireworks and arena-sized heavy metal concerts, and those who want nothing more than to miss such events for a night on the couch with a good book and a cup of hot chocolate.\n\nOne such person had a seat in the orchestra during a Broadway performance of \"The Who's Tommy\" and said as much at the top of his lungs. \"I don't like this!\" the small child screamed during a rare lull in the overwhelming action. \"Get me out of here!\"\n\n\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\t\n\t\t\t\t\n\n\n\t\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\t\n\t\t\n\t\t\t\t\t\t\t\n\n\t\n\t\n\t\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\t&#039;Running Point&#039; Season 2 Casts Ray Romano in Recurring Role\t\t\n\t\t\t\n\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\n\t\n\t\n\t\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\t\t\n\n\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\t\tItaly&#039;s &#039;The Monster of Florence&#039; Hits No. 1 on Netflix Globally, Highlighting the &#039;Power and Reach of Great Storytelling No Matter Where It Emanates From&#039; (EXCLUSIVE)\n\nThe child's upset was so understandable that the audience laughed for a good long while. \"Tommy\" is pure sensory overload, with lights flashing, scrims rising and falling, photographs carousel-ing across the back wall, and the chorus constantly running, jumping, goosestepping and swinging each other across the stage. It's like a machine: Once it's switched on, it just keeps going, regardless of audience outbursts — there's not a moment of stillness or silence until the lights come up.\n\n\n\n\t\t\t\n\t\t\tPopular on Variety\n\nOn top of all that, there&#8217;s Pete Townshend's music, beautifully overseen by Ron Melrose and conducted by Rick Fox, but sung here without the heart and soul that The Who brought to their album \"Tommy\" in 1969. But what the music lacks in feeling, it makes up for in volume. It&#8217;s the kind of loud that rings in your ears for days.\n\nThe plot of \"Tommy&#8221; is inappropriate for anyone under three feet tall. Five-year-old Tommy (Cecila Ann Popp) becomes &#8220;deaf, dumb and blind&#8221; (to quote the album&#8217;s original lyrics, unchanged here) after witnessing the murder of his mother's lover by his estranged father (Adam Jacobs), just back from War War II. So Tommy, now damaged and vulnerable, is poked and prodded by doctors, diddled by his alcoholic uncle (John Ambrosino), brutalized by his sadistic cousin (Bobby Conte) and left alone in an alley with a drug-addled maniac who can't wait to get her hands on him (the Acid Queen, played by Christina Sajous). Years later, when Tommy regains his ability to see and hear, he becomes a cult leader. But that doesn't last long because even Tommy, in the end, just wants to go home.\n\nDon't get me wrong: Judging from the performance I saw, the audience loves the show, with a story by Who guitarist Townshend and Des McAnuff (who also directs). But most likely it wasn't about the plot, which is pointless, or Lorin Latarro's choreography, which is surprisingly uninspiring. Boomers can rock out in their seats and cheer when the cast breaks into old favorites like \"It's a Boy, Mrs. Walker\" and \"Pinball Wizard,\" however sanitized the renditions. (The projection design by Peter Nigrini and the lighting design by Amanda Zieve would fit right into a Who concert, though it might induce psychosis in any theatergoers who smoked a doobie during the show.)\n\nAnd there are standout performances. Mop-headed Ali Louis Bourzgui, who plays Tommy as a young adult, has stage presence and good pipes, and Alison Luff, playing Tommy's mother, Mrs. Walker, brings real grit to her one solo, \"Smash the Mirror.\"\n\nMaybe if you'd missed the '70s, when The Who's exceptional album stirred the hearts of kids making enough noise to change the world, you wouldn't care that this production of \"Tommy\" is basically for old people, and not for a new generation.",
  "isFullReview": true,
  "dtliExcerpt": "\"...this production of 'Tommy' is basically for old people, and not for a new generation\"\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 604,
  "archivePath": "data/archives/reviews/the-whos-tommy-2024/variety-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:27:16.699Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251113141756",
  "archiveOrgUrl": "http://web.archive.org/web/20251113141756/https://variety.com/2024/legit/reviews/tommy-review-broadway-musical-2024-1235954615/"
}