{
  "showId": "lysistrata-jones-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2011/legit/reviews/lysistrata-jones-1117946832/",
  "publishDate": "December 14, 2011",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "The show has energy and good intentions, but the forced merger of Aristophanes' ancient Greek comedy with contemporary basketball culture never quite gels into a satisfying theatrical experience.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The show has energy and good intentions, but the forced merger of Aristophanes' ancient Greek comedy with contemporary basketball culture never quite gels into a satisfying theatrical experience.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 554,
  "archivePath": "data/archives/reviews/lysistrata-jones-2011/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:36:10.054Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (507): Request failed with status code 507"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "\"Lost Girl\" proves unexpectedly fun -- a sort of diluted version of \"True Blood,\" about a Succubus coming to grips with her own lethal attributes and origins.\n\nAt first glance, “Lost Girl” looks like another one of those Canadian imports picked up mostly for financial reasons. The pilot, however, proves unexpectedly fun — a sort of diluted version of “True Blood,” about a Succubus coming to grips with her own lethal attributes and origins. Granted, the pilot spends a lot of time explaining the rules (Succubi lack the familiarity of vampires and zombies), but the show has wit, style and an enticing lead in the leather-clad Anna Silk. Original it’s not, but “Lost Girl” doesn’t suck.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Noomi Rapace Talks 'Angry' Public Image, Calls for More Money for Swedish Film and Dedicates Nordic Honorary Dragon Award to Son Lev: ‘My Closest Witness’ \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Peter Mullan, Star of ‘The Fall of Sir Douglas Weatherford,’ Talks ‘Horrors’ of Trump and the Killing of Alex Pretti: ‘They Are Rewriting History as We Speak’ (EXCLUSIVE)\n\nSilk’s Bo is introduced tending bar, where she intervenes to prevent a young girl, Kenzi (Ksenia Solo), from becoming a victim after her drink’s spiked with a date-rape drug. Yet when she kisses the perp, she draws his very essence out of him, to the point where he withers and dies.\n\n“I sort of drain people,” Bo explains to Kenzi, who manages to document the moment on her cellphone.\n\nBo’s actions also arouse attention from a detective, Dyson (Kris Holden-Ried), who turns out to be working on behalf of the Fae, a species of Succubi living among — and preying upon — humans, putting the truth in ancient folklore. But until now, Bo had no idea who she or what she is, suddenly thrusting her into a long-simmering skirmish between Dark and Light Fae, with only the uneasy truce between the dueling factions preventing all hell from breaking loose.\n\nSeries creator Michelle Lovretta dangles lots of portentous dialogue — lines like, “It’s beginning, then,” and, “What’s meant to be, must be.” Most of it hinges on Bo being highly important in the bigger scheme of things, even as she’s put through a series of tests by the Fae, and starts seeking answers about her past.\n\nObviously, this sort of outsider-unaware-of-her-destiny plot is hardly new, any more than the “Xena, Warrior Princess” buddy dynamic that emerges between Bo and Kenzi.\n\nStill, “Lost Girl” is stylishly done, and happily doesn’t take itself too seriously, with Bo referring to one Fae’s abode as “early Tolkien.” Bo also describes a kiss from another Succubus as “like the Fourth of July in my mouth.”\n\nThe merits aside, the show nearly bogs down in the second hour trying to explain its arcane mythology, and still remains fuzzy on what happens if, say, Bo doesn’t satiate her hunger. How long can a Succubus go without, er, eating?\n\nFortunately, Silk (whose resume includes “Ghost Whisperer”) provides the requisite mix of seductiveness and danger, establishing a character that could connect with the core of the Syfy crowd — particularly those who already know that “Succubi” is the plural version of her condition.\n\n“Lost Girl” isn’t a great show, certainly, but for those who appreciate such fare, it’s a respectable addition to their genre menu, if not likely to become many people’s fae-vorite.",
  "_showNotMentionedDiscoveryAttempted": true
}
