{
  "showId": "mary-jane-2024",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani",
  "url": "https://www.broadwaynews.com/the-broadway-review-mary-jane-a-heart-shattering-drama-that-puts-care-at-its-core/",
  "publishDate": "April 24, 2024",
  "fullText": "Amy Herzog’s play about a mother and her ill son is an expertly-crafted exploration of allegiance and love. Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “Mary Jane.” Theater has the potential to transport us to new worlds, but sometimes the most impactful shows take the time to mirror our own. Amy Herzog’s humanistic marvel of a play, “Mary Jane,” drops us into a sentiment we can all relate to — loving an ill person — but a situation most of us can’t: mothering a two-year-old with congenital cerebral palsy, seizure disorder and lung disease. Herzog sets her revival to “nowish” New York City so that other monstrous virus, while never specifically named, also hovers over the world of this play. Herzog loves this; she loves to drop hints and turns her nose up at exposition. Herzog trusts her audience, dumping us into conversations that began long before we arrived at the theater. Her characters are everyday people — supers and tenants, nurses and nieces — that already know each other intimately. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": false,
  "dtliExcerpt": "There are two sick people in Mary Jane’s home, we realize, and Herzog has coaxed us into falling in love with both of them. The realization, just like the play, is gutting.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/mary-jane/",
  "needsScoring": true,
  "textWordCount": 203,
  "archivePath": "data/archives/reviews/mary-jane-2024/broadway-news--brittani_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:30:34.165Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 203 (min: 300)"
  ]
}