{
  "showId": "mary-jane-2024",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.theaterscene.net/uncategorized/mary-jane-2/joel-benjamin/",
  "publishDate": null,
  "fullText": "Posted on May 5, 2024 by Joel Benjamin in Broadway, Plays Rachel McAdams and Brenda Wehle in a scene from Manhattan Theatre Club production of Amy Herzog’s “Mary Jane” at the Samuel J. Friedman Theatre (Photo credit: Matthew Murphy) [avatar user=”Joel Benjamin” size=”96″ align=”left”] Joel Benjamin, Critic[/avatar] Mary Jane by Amy Herzog is yet another transfer from Off Broadway to Broadway this season. It is a dark story about a mother’s heroic efforts to care for her disabled son leavened by the finely honed performance of its lead actor, Rachel McAdams. McAdams, an Academy Award nominated actress, has taken on the title role, a mother whose son, Alex, was born with a cluster of life-threatening birth defects. Her husband quickly defected leaving Mary Jane to fend for herself. Mary Jane begins with just one of the bothersome issues she has had to contend with. Even though her son is totally unable to move and is tied to his hospital bed with oxygen tanks and other medical paraphernalia her building super Ruthie (Brenda Wehle) insists that she keep safety guards on her windows. Alex loves to look out the window and these devices which place bars on the panes make it impossible for him to view the outside world. Rachel McAdams and Lily Santiago in a scene from Manhattan Theatre Club production of Amy Herzog’s “Mary Jane” at the Samuel J. Friedman Theatre (Photo credit: Matthew Murphy) Sherry (April Matthis) is a stalwart nurse and helper in whom Mary Jane can confide and young Brianne (Susan Pourfar), a wide-eyed caregiver, cannot believe Mary Jane’s optimistic take on her son’s lot. Sherry’s niece, Amelia (Lily Santiago) visits just as Alex has a life-threatening seizure in the next room. The setting changes from Mary Jane’s Queens home to an emergency neonatal intensive care unit in a hospital. The lack of an intermission forces a surprising scene change that is worth the price of admission. Lael Jellinek’s realistic sets are cleverly detailed and make great locations for the emotional lives of the characters to unravel. In the quietly intense second scene all the supporting actors return as different characters. Santiago is now a music therapist, Kat, whose timing is humorously off; Matthis, a harried but sympathetic physician; Pourfar, a level-headed Orthodox Jewish mother who has her own problems; and, Wehle is now the hospital chaplain in the form of a calming, meditative Buddhist monk. April Matthis and Rachel McAdams in a scene from Manhattan Theatre Club production of Amy Herzog’s “Mary Jane” at the Samuel J. Friedman Theatre (Photo credit: Matthew Murphy) Each in her way helps Mary Jane deal with the ever-worsening plight of Alex who is slowly fading. All the actors shine in their double roles, but McAdams’ Mary Jane is a layered human whose sweet tower of strength façade disguises the terror of dealing with the possible loss of Alex whom she has endowed with a plethora of wish-fulfillment qualities. Can he really understand her? Does he absorb all that he sees and hears? Can he feel…anything other than pain? The play is an expression of the quiet whirlwind within Mary Jane’s soul, exquisitely expressed by the warm McAdams, surrounded by the boundless support of the others. Director Anne Kauffman masterfully allows the play to express vast emotions in the most subtle ways. What might have been a tearjerker is so much more, a chance to completely belong in this character’s mind and heart. Rachel McAdams and Susan Pourfar in a scene from Manhattan Theatre Club production of Amy Herzog’s “Mary Jane” at the Samuel J. Friedman Theatre (Photo credit: Matthew Murphy) Brenda Abbandandolo’s costumes are particularly apt and Ben Stanton’s lighting is unobtrusively mood enhancing. Unlike most contemporary dramas, Mary Jane reveals its emotional heft delicately and intriguingly. First performed in 2017 at the New York Theater Workshop, this re-staging is under the auspices of the Manhattan Theatre Club at their Samuel J. Friedman Theatre. Mary Jane (extended through June 30, 2024) Samuel J. Friedman Theatre, 261 West 47th Street, in Manhattan For tickets, visit http://www.manhattantheatreclub.com Running time: one hour and 40 minutes without an intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 686,
  "archivePath": "data/archives/reviews/mary-jane-2024/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:41:43.718Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}