{
  "showId": "glengarry-glen-ross-2012",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Emlyn Travis",
  "url": "https://ew.com/glengarry-glen-ross-review-kieran-culkin-seals-deal-broadway-revival-11705926",
  "playbillVerdictUrl": "https://ew.com/glengarry-glen-ross-review-kieran-culkin-seals-deal-broadway-revival-11705926",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nTop Stories\n\nMet Gala red carpet looks\n\nChristina Applegate says daily life with MS is really hard\n\nHolly Madison hated some sex acts with Hugh Hefner\n\nBest moments from Conan O'Brien's Mark Twain Prize ceremony\n\nKieran Culkin and Bob Odenkirk seal the deal in star-studded Broadway revival of Glengarry Glen Ross\nThe Emmy award-winning actors star alongside Michael McKean and Bill Burr as effin' complicated salesmen in David Mamet's expletive-ridden play.\n\nEmlyn Travis is a news writer at Entertainment Weekly with over five years of experience covering the latest in entertainment. A proud Kingston University alum, Emlyn has written about music, fandom, film, television, and awards for multiple outlets including MTV News, Teen Vogue, Bustle, BuzzFeed, Paper Magazine, Dazed, and NME. She joined EW in August 2022.\n\nEmlyn Travis is a news writer at Entertainment Weekly with over five years of experience covering the latest in entertainment. A proud Kingston University alum, Emlyn has written about music, fandom, film, television, and awards for multiple outlets including MTV News, Teen Vogue, Bustle, BuzzFeed, Paper Magazine, Dazed, and NME. She joined EW in August 2022.\n\nThat’s what greet audiences see when they first arrive at the Palace Theatre to settle in for the latest Broadway revival of David Mamet’s Pulitzer- and Tony-winning play, Glengarry Glen Ross. The image is undoubtedly a nod to the second place prize mentioned in Alec Baldwin’s infamous expletive-ridden monologue in the 1992 film adaptation, but it also serves as an apt representation of the entire production, which follows a group of sharp, pointed, power-hungry real estate salesmen who gleefully take pride in cutting down others on their way to the top.\n\nIt’s been more than 40 years since Mamet’s crop of caustic salesmen first hit the Broadway stage, becoming both a darling among critics and, seemingly, the dream production of every middle-aged male actor. (Liev Schreiber, Al Pacino, David Harbour, Christian Slater, and Bobby Cannavale are just a few of the stars who have put their stamp on Mamet’s alpha males over the decades.)\n\nNow, a new production is taking the material for a spin, this time led by director Patrick Marber (who previously helmed a 1997 West End production of Mamet’s The Old Neighborhood) and headlined by Emmy award winner Bob Odenkirk and his Grammy award-winning Better Call Saul costar Michael McKean; comedian Bill Burr; and recent Oscar winner Kieran Culkin. The result is a zippy production that might not exactly break the mold or push its cast outside of their career-established comfort zones, but still buzzes with life and unexpected humor all the same.\n\nIt all kicks off in a Chinese restaurant, where elder salesman Shelley “The Machine” Levene (Odenkirk) is trying to coerce office manager John Williamson (Donald Webber Jr.) to give him better leads in an attempt to cull his recent losing streak. Meanwhile, acerbic tough guy Dave Moss (Burr) presents his airy coworker George Aaronow (McKean) with a plan to stick it to their ungrateful bosses by stealing all of the Glengarry real estate leads and selling them to another agency. And, elsewhere, office hotshot Richard Roma (Culkin) showcases the art of the effin' deal by luring in everyman James Lingk (John Pirruccello) with stories of hook-ups and cafe au lait before casually showing him some prime real estate.\n\nTragedy doesn’t strike, however, until the second act, when it’s revealed that the aforementioned leads have been stolen overnight and authorities like Detective Baylen (Howard W. Overshown), who sets up camp in one of scenic and costume designer Scott Pask’s enclosed offices. With the police away, the cast will play, kicking their feet up at their desks, attempting to swindle their clients (and each other), and, of course, cursing up a storm like it's their f---ing job. As for who really committed the crime? Well, audiences will have to wait and see, but there’s a reason why it’s important to never open your mouth until you know what the shot is.\n\nOdenkirk, known by many for his performance as the morally grey lawyer and conman Saul Goodman, succeeds in bringing a great sense of depth to Levene as he fights tooth and nail to get back to his former glory as the ground crumbles underneath his feet. Don't get me wrong: He’s still just as ruthless and conniving as the rest of his coworkers, especially when he eviscerates Williamson for screwing over Roma’s deal, but Odenkirk also manages to imbue the character with his own solid comedic timing (especially when masquerading as a very important CEO) and a wistful affinity for his superstar past that makes him — for one, brief moment — someone that audiences could almost get behind. That is, of course, until the chips are down and his true colors are once again brought to light.\n\nFollowing his recent Oscar win for A Real Pain, Culkin continues his hot streak as Roma, devouring every scene he's in like it's the most delicious meal of his life. Taking a page from his Succession character Roman Roy, the actor plays the slick sales pro with a heady mixture of smarminess, crudeness, and charm, making him both an objectively terrible person and someone whose magnetism is so captivating that you’re not even aware you’re being swindled until your check's been cleared and he’s speeding away in a Cadillac El Dorado. Even when he's not selling a false fantasy or reaming his coworkers, Culkin naturally pulls focus, whether it be his little reactions to his costars' diatribes, his tugs at his hair in frustration, or even by loudly blowing his nose.\n\nIt’s common knowledge that Burr and cursing go hand-in-hand, so it makes sense that his take on Moss is filled to the brim with unbridled rage and an arsenal of insults at the ready. While his performance is perhaps the most one-dimensional, he successfully launches each and every attack against his coworkers with viper-like precision, picking them apart and leaving no scraps behind. Conversely, McKean, a comedic legend in his own right, is an absolute delight as Aaronow, seizing the moment and effortlessly wringing every comedic beat for laughs as he floats around pestering the team and making pit stops to water the office money tree. I truly never wanted him to head into police questioning.\n\nAdd in Pirruccello's solid performance as the sullen and sympathetic Lingk; Webber’s subtle, yet controlled turn as Williamson; and Overshown’s brusque, classic cop energy; and Glengarry Glen Ross’ 105 minute runtime whizzes by. That is especially the case when all of its salesmen are onstage, the retro building suddenly bubbling forth with a vicious and vivacious energy as they volley a wide array of mothereffin' insults back and forth, all set to the tune of Mamet’s unrelenting cadence.\n\nWith such an impressive list of actors, audiences will likely flock to Glengarry Glen Ross simply because they want to see Odenkirk, Burr, McKean, and Culkin knock it out of the park — and that is what they will find in spades. Any further exploration into the play's themes of toxic masculinity, morality, and corruption, however, have been largely left at the wayside in favor of watching these men work. Which, of course, creates a thrilling experience, but also leaves something more to be desired. Grade: B",
  "isFullReview": true,
  "textWordCount": 1209,
  "archivePath": "data/archives/reviews/glengarry-glen-ross-2012/ew--emlyn-travis_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:16:55.496Z",
  "originalScore": "B",
  "originalScoreNormalized": 83,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250506015021",
  "archiveOrgUrl": "http://web.archive.org/web/20250506015021/https://ew.com/glengarry-glen-ross-review-kieran-culkin-seals-deal-broadway-revival-11705926",
  "contentTier": "complete",
  "wordCount": 1209,
  "tierReason": "Full review text"
}