{
  "showId": "glengarry-glen-ross-2012",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Juan A. Ramirez",
  "url": "https://www.theatrely.com/post/a-curiously-beta-glengarry-glen-ross-review",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Not much is at stake for these alleged sharks, who glide through the lofty waters of Scott Pask’s two sets. Having to blow out this small piece to fit this massive theater, the ornate Chinese restaurant of the first act and the office of the second reflect comfort, not the cesspool that could breed the Darwinism their actions involve. Polished, starry, and with nothing to say, this Glengarry sells a McMansion, neither a scam nor a Palace.",
  "bwwScore": 6,
  "contentTier": "complete",
  "fullText": "The Company | Photo: Emilio Madrid\n\nTo stage David Mamet’s Glengarry Glen Ross in 2025, starring Bill Burr, Kieran Culkin and Bob Odenkirk, would appear to be a huge win for the meninist movement. Your brother’s favorite TV stars cursing up a storm as real estate agents engaging in all sorts of chicanery to stay at the top of their food chain? The Palace Theater fills itself. And yet, for all its promised brazenness, this latest production of the 1983 play (its third revival in twenty years) is a curiously cucked rendering of a piece which requires all-cylinders machismo to fire off.\n\nDirector Patrick Marber presents a cleaner, more low-key take on the material. His is not the livewire sleazefest which has allowed actors like Al Pacino, Joe Mantegna and Bobby Cannavale to find poetry in peacocking. The pace here is set by their successor, Culkin, who deploys his shtick of frazzled, hair-tousled stammering into a sales asset, luring marks into his trap the way a conspiracy video turns raised eyebrows into slow surrender. As with this production, it’s a quieter tactic that works – it gets the play through to the end of the story successfully – but is not one delivering anything other than what’s immediately onstage.\n\nSay what you will about Mamet (the less, the better, at this point), but his material works so long as it is allowed to dive as far deep into the mud to find some sort of insight into the brokenness of bravado. The cursing, the backstabbing, the nastiness should all spell out, in bold and all caps, the grossness of his characters’ worlds. Paradoxically, that sleaze also tempers the effect of their worst behaviors; here it’s casual racism. Grotesqueness tuned down and an overarchingly inoffensive relatability allowed to prevail, their extended forays into bigotry come off as just edgy humor from lovable rogues instead of the words of the damned.\n\nBurr commands that middle ground, a natural with the acidic rhythm of Mamet’s language, but has too few scenes to display it. (Same with Michael McKean, in a less showy role.) And though he fares better in the second act, Odenkirk stumbles into his aging, pathetically unlucky salesman, never capturing the character’s life-or-death desperation the way it was immortalized, if sideways, in The Simpsons’ collar-tugging Gil Gunderson (himself based on Jack Lemmon’s film portrayal).\n\nNot much is at stake for these alleged sharks, who glide through the lofty waters of Scott Pask’s two sets. Having to blow out this small piece to fit this massive theater, the ornate Chinese restaurant of the first act and the office of the second reflect comfort, not the cesspool that could breed the Darwinism their actions involve. Polished, starry, and with nothing to say, this Glengarry sells a McMansion, neither a scam nor a Palace.\n\n‍Glengarry Glen Ross is in performance through June 28, 2025 at the Palace Theatre on West 47th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 603,
  "archivePath": "data/archives/reviews/glengarry-glen-ross-2012/theatrely--juan-a--ramirez_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:44:05.334Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250909203029",
  "archiveOrgUrl": "http://web.archive.org/web/20250909203029/https://www.theatrely.com/post/a-curiously-beta-glengarry-glen-ross-review",
  "wordCount": 603,
  "tierReason": "Full review text"
}