{
  "showId": "queen-versailles-2025",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/The-Queen-of-Versailles/1335",
  "publishDate": "November 9, 2025",
  "fullText": "When is enough, enough? It's a question that only briefly flickers in the mind of the seemingly superficial socialite Jackie Siegel (dazzlingly played by Kristin Chenoweth), the \"title character\" of the disappointing new musical, \"The Queen of Versailles,\" now at the St. James Theatre.\n\nMore dispiriting than the final product – which is based on the fascinating 2012 documentary of the same name -- is that this same question seems to have eluded the show's top-tier, award-winning creators. Shockingly, director Michael Arden, librettist Lindsey Ferrentino and composer-lyricist Stephen Schwartz have put together an extravagantly overstuffed yet intellectually empty and surprisingly heartless show, one that never gives its protagonist a clear point of view – or theatergoers a good reason to watch it.\n\nInstead, for reasons best known to them, \"Queen of Versailles\" spends part of its almost three hours on unfulfilling (and dramatically unfulfilled) scenes set in 17th and 18th-century France, songs about dead lizards and diary entries, and a long, dreary number about how Jackie's much-older billionaire husband David (a fine but underused F. Murray Abraham) became the so-called \"Timeshare King\" – all of which belong on the proverbial cutting-room floor.\n\nIn a story that proves truth to be stranger than fiction, David and Jackie – his third wife, her second husband – visit France on vacation where he proposes building a 90,000-square-foot home in Orlando, Florida based on the famous palace that was built by Louis XIV (and eventually belonged to Louis XVI and Marie Antoinette). As much as he may want to make his trophy spouse happy, it's pretty clear that David is doing this mostly because he can!\n\nThe reasons for Jackie's decade-long obsession with the project -- even after the property is foreclosed in the wake of the 2008 stock market crash and the couple become temporarily \"broke\" – are far less well-defined, testing our sympathy for her despite Chenoweth's star-turn performance (complete with four big solos which take great advantage of her still remarkable voice).\n\nWas Jackie really so influenced by watching Robin Leach's \"Lifestyles of the Rich and Famous\" alongside her working-class parents (a truly wasted Isabel Keating and Stephen DeRosa) in upstate New York? Is she that concerned about giving her eight (!) children a \"better life,\" especially since the only one we meet, the deeply unhappy Victoria (an outstanding Nina White), just wants a normal one? Or is the house (the clever set is by Dane Laffrey) merely a distraction, given that it's fairly obvious that her marriage has always had a shaky foundation?\n\nMoreover, are we supposed to hate her – and especially David – just because they're rich and entitled, and, as the script makes clear, not altogether different than the current occupants of the White House or the former owners of Versailles? Honestly, your guess is as good as mine.\n\nYet, despite some repulsive and thoughtless behavior, Jackie isn't evil personified. She takes in her teenaged niece Jonquil (Tatum Grace Hopkins) after her parents can no longer take care of her; she does seem genuinely concerned about Victoria's well-being (even if she focuses on the wrong things); and she helps start a foundation for first responders dealing with drug overdoses. Perhaps she's not really bad, she's just drawn that way! (Christine Cowan's costumes for Chenoweth are quite stunning.)\n\nIndeed, the person you most root for – besides Victoria – is the loyal housekeeper Sofia (an excellent Melody Bittu) who gives up her own life in the Philippines to care for Jackie's family and pets. (You also root for the adorable pup, Adam, who is blessed to not have any lines!) Meanwhile, as the curtain falls, Jackie's ultimate fate, which isn't documented in the show, feels of little concern.\n\nIn the end, \"The Queen of Versailles\" really is the only show on Broadway that has everything but Yul Brynner – and it firmly remains a puzzlement!",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": null,
  "source": "webfetch-scraped",
  "dtliThumb": "Down",
  "scrapedAt": "2026-01-24T00:10:00.000Z"
}
