{
  "showId": "queen-versailles-2025",
  "outletId": "nydailynews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.nydailynews.com/2025/11/09/queen-of-versailles-broadway-review-kristin-chenoweth/",
  "publishDate": null,
  "fullText": "A whopping Broadway show called &#8220;The Queen of Versailles&#8221; and dedicated to the dissection of unhinged American materialism needs two fundamental things. One is a show crammed to the rafters with the kind of gilded excess that can take an audience&#8217;s breath away. The other is a resplendent monarch reigning at its heart.\n\nAnd if the measure of a great ruler is that you cannot imagine anyone else surviving on the same dangerous throne, then the fabulous Kristin Chenoweth is your one and only queen, folks. What a star performance!\n\nNever mind Glinda. Here, Chenoweth drives the new musical from Stephen Schwartz and Lindsey Ferrentino with a singular combo of raw determination and a beguilingly empathetic commitment to veracity. Chenoweth, with the help of the director Michael Arden, gets Jackie Siegel exactly right. The star refuses the temptation to ironically detach herself from the pile-driving, poor-born woman who watches &#8220;Lifestyles of the Rich and Famous,&#8221; marries rich and old, and then tries to build Versailles in Central Florida, only to find in the end that it&#8217;s no fun alone. Instead, Chenoweth just plays her as a complex human. Like the rest of us.\n\nI should note that the real Jackie was holding court across the aisle at the performance I attended. Her look mirrored the onstage costumes, replete with a little white dog she held triumphantly above her head at the curtain call. Staring like everyone else, I could not decide if Siegel had made herself look like Chenoweth (as costumed by Christian Cowan) or vice versa. Maybe somewhere in the middle. (Siegel thrust upon me a little piece of jewelry, but I dropped and lost it, which says a lot about my inadmissibility to any Floridian Versailles.)\n\nAnyone who saw the sourcing 2012 Lauren Greenfield documentary about Jackie and her sugar daddy David Siegel (a timeshare and hotel developer king, very dryly played here by F. Murray Abraham) knows that its success came from its clear-eyed vision and its refusal to turn the boom-bust-boom Siegels into loathsome caricatures.\n\nArden and his cast (which includes Nina White as Jackie&#8217;s troubled daughter and Tatum Grace Hopkins as her sardonic niece) similarly avoid the traps that felled last season&#8217;s awfully smug musical &#8220;Tammy Faye,&#8221; even though the Siegels are in some ways a secular Jim and Tammy Faye Bakker. Arden has become very good at underplaying the spectacular reveal, winning him ever-deeper audience responses.\n\nSchwartz has written some lovely and strikingly earnest new songs, especially a paradoxical ode to simple living in a ballad called &#8220;Little Houses.&#8221; &#8220;Pretty Wins,&#8221; movingly sung by White, will get a lot of likes, too, as will the show&#8217;s 11 o&#8217; clock Versailles special, &#8220;Grow the Light.&#8221;\n\nFerrentino&#8217;s book uses both the frame of the real Versailles (which doesn&#8217;t bring much to the party) and the video-enhanced device of the making of the documentary, a la &#8220;MJ The Musical.&#8221; Arden and his brilliant set and video designer, David Laffrey, mitigate that cliche with enough fluidity and flourish to never let it take over from old-school Broadway theatricality.\n\nThere&#8217;s an Act II dip, partly because the Siegels&#8217; postcrash reversal of fortunes feels arbitrary and the personal crises that follow have too little stage time to fully manifest. This is not uncommon with musicals drawn from documentaries or movies — the book writer spends too long on the first parts and runs out of time. But it will be overlooked by most Broadway audiences, especially when Chenoweth is front and center, which is pretty much always. This is a musical that knows whose story it&#8217;s telling.\n\n&#8220;The Queen of Versailles&#8221; is neither camp (well, mostly not) nor an empty spectacle nor, thank God, a morality tale. It&#8217;s an honest effort to explore why some people just keep wanting more stuff, while also admiring the force of personality it takes to procure them. At some points in the show, one blinks up at Jackie and thinks, &#8220;Well, I could have been crazy rich like her.&#8221;\n\nMaybe one could have been. Or maybe Jackie Siegel is singular. That&#8217;s the question Chenoweth is exploring, singularly.\n\nI suspect some will want far more blue state judgment with their big Broadway night out. Not I. I&#8217;m all for a huge, morally complicated show that sends your head spinning through the mirrored funhouse of Versailles in Central Florida, musing on all-American achievement and aspiration and realizing family and friends are the only way to happiness.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 740,
  "archivePath": "data/archives/reviews/queen-versailles-2025/nydailynews-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T05:19:41.074Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20260106173259",
  "archiveOrgUrl": "http://web.archive.org/web/20260106173259/https://www.nydailynews.com/2025/11/09/queen-of-versailles-broadway-review-kristin-chenoweth/"
}