{
  "showId": "queen-versailles-2025",
  "outletId": "pages-on-stages",
  "outlet": "Pages on Stages",
  "criticName": "Mason Pilevsky",
  "url": "https://pagesonstages.com/2025/11/15/the-queen-of-versailles/",
  "publishDate": "November 13th, 2025",
  "fullText": "The Queen of Versailles – 13 November 2025 Opulence and decadence abound as Jackie Siegal, embodied on stage by Kristin Chenoweth, transforms Broadway’s St. James Theatre into a lavish home for expensive dreams. Showcasing riches beyond rationality, The Queen of Versailles highlights that one person‘s dreams can be another person‘s nightmare. Its chilling second act magnifies the flaws in Jackie’s unending craving for more, and the effects it has on others, particularly her daughter Victoria (Nina White) and the nanny, Sofia (Melody Butiu). Jackie’s dreams are built on the back of an incredibly large work force who she keeps wrapped around her little finger, at her beck and call, and the harm her family experiences is truly heartbreaking. Structurally, the musical uses wit, hyperbole, allegory, and juxtaposition to show the audience an unimaginably beautiful world, as well as its chilling cost. The reality is that nothing is unending, and mirrors like those in Versailles are devices in which one sees oneself. At the end, Jackie has an opportunity to see herself alone, and even though she’s accomplishing material elements of her dreams, she has to convince herself that she’s okay. As is Stephen Schwartz’s way, the first act of the musical is primarily focused on world-building so that the second act can relentlessly tear it down. And what a world the first act creates! A rags-to-riches story of a beautiful woman ascending to glory, lucky in every way, but always wanting (and getting) more, thanks to her husband, David (F. Murray Abraham). Her disconnect from her husband is shown most clearly in her lack of inclusion of him in her story. The song about his life, “The Ballad of the Timeshare King” has a radically different tenor than the rest of the show. It is clear that they are each other‘s side piece – his grab at youth and beauty, her grab at fortune and fame. Most of the relationships in the show are transactional, so it’s not surprising that they come at a cost. David is always gracious to Jackie “because [he] can,” but in moments when he can’t, his behavior more closely resembles cruelty. Jackie takes in this cold dismissiveness, and it is reflected in the way she treats her daughter Victoria, and her niece Jonquil (Tatum Grace Hopkins). Jackie acts as if throwing money at problems solves them, when sometimes it’s barely a Band-Aid on an open wound. Kristin Chenoweth is vivacious, and her character is augmented by beautiful, thoughtful design and direction. A memorable visual moment I treasure took place towards the end of act one when Jackie looked in the mirror and, instead of seeing herself, saw the ensemble alive, reprising their embodiment of 18th century France on the other side. The lighting (Natasha Katz) in this moment was a golden flourish that both emphasized Jackie‘s break from reality and questioned it. After all, what does it mean to see your dreams dangling inches before you if they might really come true? The second act started with Jackie Siegal singing a duet with Marie Antoinette (Cassondra James). This moment comes after an economic crash, when Jackie’s dreams are threatened, and its operatic absurdity foreshadows how opulent rulers, however beautiful, can lose it all – of course, we see this come true for both of them at The Queen of Versailles’s conclusion. The frivolous first act and the stirring second act deliciously dance together as they hold space for multiple truths. The duality of the world is such that riches can be never enough, just enough or far too much. People are built differently, and, for those who struggle, it is difficult to imagine how people like Jackie and Victoria could have everything and still long for change. The Queen of Versailles is a show directed at one audience, yet best enjoyed by another. The pointed critique of excessive materialism is meant to unsettle those who live that kind of lifestyle. Yet the show is best enjoyed by those who can unflinchingly laugh in its face— namely, those who, like Jonquil, feel that, if given the chance to upgrade their lives, they “could get used to this.” Those who look in the mirror and see Victoria, Jonquil, or even Gary (Greg Hildreth) get to have a good laugh. Those who see Jackie, an anti-hero in a lot of ways, feel rebuked – but those who are willing to look truthfully at themselves the next time they confront a mirror might honestly have a life-changing cry. By showing a world that is utterly fake The Queen of Versailles leaves us wanting to examine what is real. I attended this production on a press pass from DKC/O&M.",
  "isFullReview": true,
  "showScoreExcerpt": "The frivolous first act and the stirring second act deliciously dance together.",
  "showScoreUrl": "https://www.show-score.com/broadway-shows/the-queen-of-versailles-broadway",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 779,
  "archivePath": "data/archives/reviews/queen-versailles-2025/pages-on-stages--mason-pilevsky_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:28:49.415Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "playwright"
}