{
  "showId": "queen-versailles-2025",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/TheQueenofVersailles.html",
  "publishDate": null,
  "fullText": "You Will Get SickPalo Alto PlayersMicrophone audio gearLyric ArtsPlay scriptsOff-Broadway show ticketsTony Awards coverageTheatre review subscriptionBroadway cast recordingsCostume design supplies\n\n\n\n\n\n\n\n\n\n\n            \t\t                  \n                                            \n \n\n\t\n\n\n \n \n\n\n\n Past ReviewsBroadway Reviews\n\nTheatre Review by Howard Miller - November 9, 2025\n\nThe show, with a book by Lindsey Ferrentino and music and lyrics by Stephen Schwartz (Godspell, Pippin, and a little something called Wicked), contains a number of underdeveloped if potentially clever ideas, along with a completely vapid one that, unfortunately, takes up 90 percent of the time, sucking all the air out of the room in its wake. It's simply one of those \"what were they thinking?\" sort of evenings. Until someone does a thorough insider's analysis, scratching our heads is about as far as the rest of us can get.\n\nThe Queen of Versailles, Ferrentino's first musical script, is based on a 2012 documentary film of the same title that follows the story of David and Jackie Siegel, one of those famous-for-being-famous couples about whom the term \"conspicuous consumption\" might have been coined and for whom \"more\" is never enough. Swimming in money like Donald Duck's Uncle Scrooge, the Siegels decide they will build the biggest single family home in the United States on a piece of property outside of Orlando, Florida \"because we can.\"\n\nWhile the rest of us count on winning the Mega Millions lottery, David Siegel made his billions by becoming the \"timeshare king,\" founding and running the largest privately held timeshare company in the world. David is being played here by F. Murray Abraham, best known for his serious dramatic acting but who has appeared in at least a couple of musicals before this one (1997's Triumph of Love on Broadway and a 2014 Off-Broadway revival of The Threepenny Opera). To the modest extent he is asked to here, he can carry a tune, and he lends some credence to the role of the driven entrepreneur: gregarious when things are going well, sourly self-isolated when they are not.\n\nJackie Siegel, his much younger wife, is played by none other than Stephen Schwartz's Wicked pal Kristin Chenoweth. You saw her float down in a bubble as Glinda in 2003, and now, 22 years later, she floats once again, this time in a bubble of champagne as Jackie. Indeed, \"Champagne Wishes and Caviar Dreams\" are the lyrics to one of the show's songs, a catchphrase borrowed from the popular TV show \"Lifestyles of the Rich and Famous,\" Jackie's touchstone from her girlhood, we are told.\n\nIs The Queen of Versailles meant to be a satirical waltz into the world of glamor photo spreads? Or is it all meant to be a cautionary tale? And if it is the latter, who among us will ever be in a position in which we will need to be cautioned against the kind of massive excesses the Siegels wallowed in? Surely we are not meant to merely ooh and ahh over Dane Laffrey's ultra set design, impressive as it is.\n\nWhen originality does pop up, it comes in the form of the parallel universe of King Louis XIV's actual Palace of Versailles and the costumed-to-the-teeth courtiers and liveried servants. It's a hoot watching the ensemble strutting around in these scenes, and it looks like they are having fun as well. If only the creative team could have found ways to strengthen the connection. (A duet between Chenoweth as Jackie and Cassondra James as Marie Antoinette is a decided, if all-too-short, highlight).\n\nBut for some reason, the creative team decided to make virtually all of the first act into a this-happened-and-then-that-happened bio of Jackie's life before she met David, sort of mimicking the documentary on which the show is based. It's just not all that interesting. What director Michael Arden, who nabbed Best Direction of a Musical Tony Awards in 2023 and 2025, had in mind in anyone's guess.\n\nIn Act II, chronicling the indulgent life among the Siegels, much is made of the fact that Jackie and David raised eight children, including six of their own. There is also Jackie's daughter Victoria (Nina White, who generally manages to rise above the thin material) and Jackie's niece Jonquil (Tatum Grace Hopkins), who came to live with them. I guess we are supposed to think of Jackie as a big-hearted caring mom, but in actuality it is the family's nanny Sofia (Melody Butiu) who raises them.\n\nThe insurmountable problem with The Queen of Versailles is that we are given no reason to care one way or the other about this spendthrift family, not even when they nearly lose their property during the 2008 financial crisis. Here you've got people who are spending their own money on what they want to spend it on. Why should we care? Indeed, why is it even our business? How about making a show about the soon-to-be trillionaire Elon Musk or the guy who is revamping the East Wing of the White House to accommodate a ballroom, while SNAP food aid payments are being curtailed for the poor? That might hold an audience's attention far more than the story of the Siegels.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 846,
  "archivePath": "data/archives/reviews/queen-versailles-2025/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:55:24.034Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "sourceMethod": "brightdata"
}