{
  "showId": "my-name-is-lucy-barton-2020",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Michael Billington",
  "url": "https://www.theguardian.com/stage/2018/jun/07/my-name-is-lucy-barton-review-laura-linney-triumphs-as-a-writer-confronting-her-past",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2018/jun/07/my-name-is-lucy-barton-review-laura-linney-triumphs-as-a-writer-confronting-her-past",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "A story full of mysterious resonances … Laura Linney in My Name Is Lucy Barton. Photograph: Manuel HarlanView image in fullscreenA story full of mysterious resonances … Laura Linney in My Name Is Lucy Barton. Photograph: Manuel Harlan This article is more than 7 years oldReviewMy Name Is Lucy Barton review – Laura Linney triumphs as a writer confronting her pastThis article is more than 7 years oldBridge theatre, LondonElizabeth Strout’s novel works outstandingly on stage, thanks to sole performer Linney’s nuanced command of the narrative\n\nNovels, depending on the stream of time, rarely make good plays. Elizabeth Strout’s first-person narrative, longlisted for the Man Booker prize in 2016, however, breaks the rules and fits perfectly on the stage. That’s partly because of the quality of the writing and partly because of a beautifully nuanced solo performance by Laura Linney: a space that recently looked underpopulated with a four-character play, suddenly feels colonised by Linney’s commanding presence. Fans of the book will know that it is the reminiscence of a writer hospitalised for nine weeks in New York by a mysterious illness. But the focus is on five days when the eponymous heroine renews acquaintance with her mother, who has come to visit her from rural Illinois and from whom she has been long estranged. The two women talk, gossip about people from Lucy’s past, warily seek each other’s love. In the end, the mother departs as abruptly as she came and you feel the two women have briefly bonded without ever addressing their shared guilt: in the mother’s case, over Lucy’s impoverished childhood and, in Lucy’s, over her own necessary desertion.\n\nRead moreIt sounds slight: in fact, it’s a story full of mysterious resonances. What comes out in performance, even more than in reading the book, is the idea that, even if you totally reinvent yourself, your past remains inescapable. Lucy has sought to overcome a childhood in which she and her siblings were beaten and deprived of the consolations of TV, films and magazines. Her father, who fought in the second world war, suffered from what we would now call post-traumatic stress disorder. Fleeing Illinois, Lucy has settled in New York, married, had children and acquired the ruthlessness that is part of a successful writer’s equipment. Yet, as Lucy admits, the Barton family provided a structure she was unaware of, until it was ended by death.\n\nView image in fullscreenShe carries the evening … Laura Linney in My Name Is Lucy Barton. Photograph: Manuel HarlanAlthough I was sorry not to hear more of Lucy’s literary mentor, Sarah Payne, Rona Munro’s adaptation is sensitive to Strout’s structure. Richard Eyre’s production also has a distilled clarity: Bob Crowley’s set consists of a hospital bed and chair, while Luke Halls’s video design modulates between vistas of the gleamingly geometric Chrysler building and Illinois acres of soybeans and corn, which seem to stretch to infinity.\n\nBut it is Linney who triumphantly carries the evening. I’d seen her once before on stage, in Eyre’s Broadway production of The Crucible, where she caught perfectly Elizabeth Proctor’s puritan severity. Here she switches easily between different modes. She talks to us, the audience, with warmth and ease. When she characterises Lucy’s mother, prattling on about the marital misfortunes of sundry relations, her voice acquires a rasping, midwestern edge. As Lucy relives her hospital memories, Linney is even more extraordinary: she shifts between exasperated fury at her mother’s wilful incuriosity and loving astonishment at this unworldly old woman’s ability to negotiate labyrinthine hospital corridors and the New York jungle. You can see the story in several ways but it is partly about the enforced loneliness of the writer who, at the same time, reinforces our common humanity. Linney, as a performer, has mastered the art of public solitude and gives you the uncanny feeling that you are listening not to an invented story but a slice of lived experience.",
  "isFullReview": true,
  "textWordCount": 652,
  "archivePath": "data/archives/reviews/my-name-is-lucy-barton-2020/guardian--michael-billington_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:56:13.791Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 652,
  "tierReason": "Full review text"
}