{
  "showId": "my-name-is-lucy-barton-2020",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "Leslie Felperin",
  "url": "https://www.hollywoodreporter.com/review/my-name-is-lucy-barton-theater-1117960",
  "playbillVerdictUrl": "https://www.hollywoodreporter.com/review/my-name-is-lucy-barton-theater-1117960",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Elizabeth Strout’s delicate, deceptively intricate novella My Name Is Lucy Barton is adroitly adapted for the stage by playwright Rona Munro and director Richard Eyre, creating an elegant setting for the bright jewel that is Laura Linney‘s solo performance. Representing Linney’s debut on the London stage but a reunion for her with Eyre, who directed her in the 2002 Broadway revival of The Crucible, this one-act drama utilizes little more than lighting shifts and subtle video projections to create a fine-boned meditation on class, memory, domestic abuse and pain passed across generations. The production's brief run at the Bridge Theatre, Nicholas Hytner's newish riverside venue, is sure to sell out quickly on the back of Linney's fame, positive reviews and strong word of mouth. No plans have yet been announced for a cross-Atlantic transfer.\n\nEver since her breakthrough performance as flyover-state refugee Mary Ann Singleton in the TV adaptation of Armistead Maupin’s Tales of the City, Linney has worked her wholesome features to play seemingly “ordinary” women, often ones with darker sides or more complex characters than the blonde hair and dimples might suggest, for example in You Can Count on Me or The Truman Show. A protean performer, she can just as easily do a sharp-elbowed urban neurotic (see, for instance, The Squid and the Whale or The Savages).\n\nThe role of Lucy Barton here allows her to span those two extremes, embodying a character who hails from deepest, poorest, darkest rural Illinois but has made it to New York City where she has married, had two daughters and is on her way to becoming a professional writer. In other words, she “just went ahead and... did it!” — moved to the big city and reinvented herself, as her mother notes admiringly, although the transition hasn’t always been smooth.\n\nWith just some adjustments in accent, vocal pitch and posture, Linney transforms herself instantly onstage from Lucy to Lucy’s garrulous mother, the elder woman visiting from Illinois while Lucy struggles with an infection in the hospital, picked up after a routine appendectomy. (Her husband, she explains, can’t handle the hospital after his own childhood trauma.) Shifting between the two characters throughout, Lucy both narrates directly to the audience and talks with her visitor, a woman who has faced the terrors of catching a plane from Chicago and then a taxi from LaGuardia in order to be at her daughter’s bedside.\n\nNot that she’s exactly overflowing with maternal concern and solicitude. A brusque, tamped-down lady of a certain age, she chooses to entertain her daughter by remembering the misfortunes of neighbors from the old days, like former dressmaking client Kathie Nicely, who left her husband for a man who turned out to be a “homo” and ended up living miserable and alone, just a few miles from her similarly isolated, embittered ex-husband.\n\nAt first, just like in Strout’s book, the stories and anecdotes seem almost pointless and quotidian until through lines and connections start to emerge. Kathie Nicely’s supposedly gay lover rhymes with Lucy’s brother, who was brutally humiliated as a teen by their father, forced to walk the street dressed in the women's clothes he was found furtively trying on. The truck that plays a role in that story becomes a key character, the villain, if you will, in another tale of repeated abusive trauma created when Lucy was locked in the vehicle over and over again as punishment or mere containment, at one point with a snake that leaves her with a lifelong phobia.\n\nTo help the audience visualize the scene, Eyre’s staging — with assists from Luke Halls’ video design and Peter Mumford’s understated lighting — creates the interior of the truck with just a projection of a car's windows, seen from the inside smeared with rain and a barely visible view beyond. The image falls across three flats that suggest the layers of memories within memories, a quiet matryoshka doll of pain. Elsewhere, following the scene-setting of the book, the backdrop shows an image at various times of the day of the Chrysler Building that Lucy can see out her hospital window, an iconic structure that becomes as familiar and beloved as the lone tree on the land near her family’s house that Lucy as a child thought of as her only friend.\n\nThe lifelong taste of loneliness which lingers still in her mouth, as Strout’s prose so evocatively puts it, becomes a dominant theme here, and a motivation that leads Lucy to seek out father figures in the various men in the story to substitute for the violent, shell-shocked man that is her real father. She sees alternatives in her husband William, the avuncular doctor who turns out to be a Holocaust survivor, and the courtly psychoanalyst neighbor Jeremy from upstairs who, in another tinkling narrative leitmotiv, is a witness to the AIDS epidemic that has just begun in the period when Lucy got sick. Sitting on their building’s stoop with Jeremy, she remarks how she envies the clearly sick men with HIV for their community, and his silent look of understanding and compassion seems to signal depths of meaning to her.\n\nAll credit to Linney for making these details, conveyed simply through dialogue, feel so vivid it’s as if they’ve just been performed on film for us. Throughout, her delivery is so rich and nuanced that only a few words, or an arched eyebrow, are enough to speak volumes far thicker than the slim but densely meaningful volume on which the play is based, drawing tears by the end.\n\nLike Strout’s other work, such as the Pulitzer-winning novel Olive Kitteridge (which itself became the basis for a remarkable set of performances in the HBO miniseries that starred Frances McDormand), miniaturist observation unlocks profound, maximalist truths. This sprightly, intelligent production does justice to that artfulness, creating something new that adds to the work even as Munro’s craft filets the story to a few essential plot points.\n\nVenue: Bridge Theatre, London\n Cast: Laura Linney\n Playwright: Rona Munro, based on the novel by Elizabeth Strout\n Director: Richard Eyre\n Set and costume designer: Bob Crowley\n Associate designer: Ros Coombes\n Lighting designer: Peter Mumford\n Sound designer: John Leonard\n Video designer: Luke Halls\n Presented by The Bridge Theatre",
  "isFullReview": true,
  "textWordCount": 1037,
  "archivePath": "data/archives/reviews/my-name-is-lucy-barton-2020/hollywood-reporter--leslie-felperin_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:05:33.901Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1037,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-04T06:04:29.958Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review discusses a production at the Bridge Theatre in London, not the current Broadway run.; kimi: This review covers the London production at the Bridge Theatre, not a Broadway production. The text explicitly states the venue is 'Bridge Theatre, London' and notes that 'No plans have yet been announced for a cross-Atlantic transfer.'",
  "promptVersion": "5.2.0"
}
