{
  "showId": "my-name-is-lucy-barton-2020",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Matt Trueman",
  "url": "https://variety.com/2018/legit/reviews/my-name-is-lucy-barton-review-laura-linney-1202835795/",
  "playbillVerdictUrl": "https://variety.com/2018/legit/reviews/my-name-is-lucy-barton-review-laura-linney-1202835795/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Stories have a way of opening up on a stage. Elizabeth Strout's bestselling novel \"My Name Is Lucy Barton\" looks, at first glance, like a curious choice for a theatrical adaptation. It's ruminative, reflective, and all but becalmed: a bedbound writer's hazy recollections looking back on her life. There's little action, still less drama, scant theatricality. And yet, in Richard Eyre's understated staging, exquisitely performed by Laura Linney, its stillness and slowness come to seem like strengths. Lucy Barton's personal meditation blossoms into something bigger than itself – a portrait of America, perhaps even of history as a whole.\n\n\"My Name Is Lucy Barton\" is, as its title suggests, a search for identity. Laid up in a Manhattan hospital bed, battling a life-threatening illness after a routine appendix operation, its protagonist reaches for a sense of herself. She's lost enough weight that her reflection has changed, and the family she defines herself by — a husband, two daughters — can't be at her bedside. Instead, she wakes to find her estranged mother sat at the foot of her bed, a visit that trips her back to childhood and the cornfields of Amgash, Ill., a long way from New York and the life she leads now.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n João Nicolau Talks Casting Portuguese Eurovision Star Salvador Sobral in Rotterdam Opener ‘Providence and the Guitar’ \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Bedford Park’ Review: Two Children of Korean Immigrants Make an Unlikely Connection in Touching but Slightly Contrived Drama\n\nLinney plays both women brilliantly, her gilded, authorial voice hardening into a sharp, midwestern twang to highlight the difference, and the distance, between mother and daughter. They've a prickly, fond, complicated relationship, steeped in shared memories, yet long grown apart. But there’s no healing here: no final, conciliatory declaration of love. Lucy seems to have constructed herself in counterpoint to her mother, rejecting her roots and her rural beginnings. Strout's point, however, is that we all contain our ancestors; that each of us carries their pasts into our present.\n\nOnstage, the text feels strangely shaped — a meander through memories with an associative flow — but elegantly so. It slows you down, and Rona Munro's lapping script makes you lean in, as Linney, addressing us with a gentle TED Talk authority, drifts back through Lucy's life. She skips from the impoverished isolation of her childhood, with no TV and a tree for a best friend, to the steps of her West Village tenement where AIDS-stricken neighbors walk by, and back to a moment of early-years trauma: locked in her father's truck with a brown snake for company. Rather than drive, Lucy Barton dwells – on herself, her family, and on others: gossipy mothers, fathers with PTSD, German POWs, Jewish doctors.\n\nBehind the personal, if you squint, something political appears: a sense of America itself. Lucy's family were first-wave settlers who lived off the land, but in those that landed later, you understand America as an amalgam nation. And like Lucy herself, it seems forged by its traumas, from the Second World War that so scarred her father, to the AIDS crisis via Vietnam – even, in glances, colonization itself. Bob Crowley's crisp, bare stage is backed by three screens, stretching back like generations, onto which Luke Halls beams watercolor-like landscapes. Outside Lucy's hospital window, New York's skyline suggests sedimentary rock: architecture as history, the city as collage.\n\nIt's a rich, contemplative piece that entwines a human story with a historical one, as an individual and a nation start to unfold. Naturally sunny with a sadness beneath, Linney suits Lucy Barton to a T and, as she chases down the darkness that somehow defines her – the scar tissue and trauma she hides from the world – you see it reflected in others and in America at large. It's an incredible performance, never showy, always subtle, keeping big emotions in check in a way that allows quieter undertones to come through, and lets \"My Name Is Lucy Barton\" reach into America's heart.",
  "isFullReview": true,
  "textWordCount": 662,
  "archivePath": "data/archives/reviews/my-name-is-lucy-barton-2020/variety--matt-trueman_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:06:30.948Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 662,
  "tierReason": "Full review text"
}