{
  "showId": "bright-star-2016",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "http://dougmarino.blogspot.com/2016/02/bright-star.html",
  "publishDate": null,
  "fullText": "It's always a bright day on Broadway when brave souls pen a new musical. These brave souls are famous in their own right - none other than Steve Martin and Edie Brickell. This would seem to be a match made in heaven. Mr. Martin and Ms. Brickell both lay claim to the music and the story - while Mr. Martin penned the actual book, Ms. Brickell penned the lyrics. It all makes sense so far. What, perhaps, this duo lacks is experience in writing for a Broadway stage. The music has Ms. Brickell's stamp all over it. No doubt she influenced the overall sound and tones. The music was fantastically written and there were the requisite show tune type songs and love songs/ballads spread throughout the entire show. While there were way too many banjos for my taste on the Broadway stage, (it's not a country music festival after all), the overall theme supported them. Whether this was director Walter Bobbie's idea or simply embedded in the core book by the creators, the idea of placing the orchestra (more a band) on stage in a floating house-like structure that spun around and traversed back and forth across the stage was a brilliant tie-in to the plot and served the actors well allowing them to treat it like a house with doors at times. This major centerpiece aside, sets (Eugene Lee) seemed to get a low budget allocation which was disappointing. I hope that building a model train and track at the top of the proscenium didn't take too much of the funds. Cute idea for a toy store, but not for a Broadway show that only ran the train 3 times by my count. The leads of this show - all 4 of them - Carmen Cusack (Alice), Paul Alexander Nolan (Jimmy) and A.J. Shively (Billy), Hannah Elless (Margo) were strong, talented each in their own way, and tremendously entertaining. Michael Mulheren (Mayor) turned in yet another remarkable performance as a strong yet tragic figure with a booming voice. And lastly, I suspect Mr. Martin had a strong hand in character Daryl Ames played to perfection by Jeff Blumenkrantz who just about stole the show! Despite the solid casting, this show is one that has two branches that collide further down the line. Act I is incredibly important to set this up and Mr. Martin and Ms. Brickell need to do something to better establish both story lines. I was caught off-guard trying to figure out where the second story line came from. After some mental calisthenics, I sorted out what I thought was going on - and as soon as I did, I figured out where it was ultimately all going to end up. Trouble is, I think I missed a chuck of the exposition in Act I trying to figure this confusing point out. Act II was significantly better than Act I - higher energy, musically, and story-wise. What started out as a confusing story with two branches became crystal clear and the proverbial (and literal) train began to barrel down the tracks. Bringing the band out of the floating house for the entre-act was a brilliant and well received move - as the music is certainly one of the bright stars of Bright Star. Overall, the confusion generated in Act I couldn't be forgotten, but Bright Star is a solid, heartwarming story that has to be told in about 2 hours. I'm sure the musical has been ripped apart from head to toe since it's birth, but a bit more work is needed to turn this into a Broadway hit. Make no mistake, the cast and crew were absolutely ready for their first Broadway performance and none of the criticism here is reflective of their top notch performances. The names of the creatives will propel an audience to buy tickets and perhaps enjoy. Ironing out the confusion will spur the Tony nominators into action turning this show into a big hit.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Overall, the confusion generated in Act I couldn't be forgotten, but 'Bright Star' is a solid, heartwarming story...but a bit more work is needed to turn this into a Broadway hit. Make no mistake, the cast and crew were absolutely ready for their first Broadway performance and none of the criticism here is reflective of their top notch performance.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 664,
  "archivePath": "data/archives/reviews/bright-star-2016/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:57:22.271Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 664,
  "tierReason": "Full review text"
}