{
  "showId": "bright-star-2016",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2016/03/25/theater/review-bright-star-beams-nostalgia-underscored-by-fiddles-and-banjos.html?_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "The musical is gentle-spirited, not gaudy, and moves with an easygoing grace where others prance and strut. And it tells a sentiment-spritzed story...that you might be more likely to encounter in black and white, flickering from your flat-screen on Turner Classic Movies. The protagonist, Alice Murphy, portrayed by Carmen Cusack -- making a simply gorgeous Broadway debut -- is a spunky girl in her late teens in the scenes set in the 1920s. A dreamer with a rebellious streak and a hunger for literature, she's causing a fine ruckus in the sleepy town of Zebulon...While the story certainly skirts (if not embraces) sentimentality and the overripeness of melodrama, the production's soft-hued style -- and the sometimes wry tone of Mr. Martin's book -- keeps it from curdling into treacle. The songs boast simple but seductive melodies, and lyrics that have a sweet, homespun quality.",
  "bwwScore": 8,
  "contentTier": "needs-rescrape",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-BRIGHT-STAR-Opens-on-Broadway-Updating-LIVE-20160324",
  "fullText": "https://www.nytimes.com/2016/03/25/theater/review-bright-star-beams-nostalgia-underscored-by-fiddles-and-banjos.htmlShare full article47Advertisement\n\nBluegrass on Broadway? Yes sirree. The warming sounds of banjos, fiddles and even an accordion are filling the Cort Theater, where the musical “Bright Star” opened on Thursday, bringing a fresh breeze from the South to the spring theater season.\n\nPerhaps more surprising is the source of the songs that give a heady lift to this nostalgia-tinged show, a romantic tale set in North Carolina in the 1920s and the 1940s. The authors are Steve Martin, better known as a comic, actor and occasional novelist, and Edie Brickell, who rose to pop-chart fame some time ago. (They collaborated on the music and the story, with Mr. Martin providing the book and Ms. Brickell the lyrics.)\n\nIt’s not just the unusual flavor of its music that makes “Bright Star” something of an outlier on Broadway. The musical is gentle-spirited, not gaudy, and moves with an easygoing grace where others prance and strut. And it tells a sentiment-spritzed story — of lives torn apart and made whole again — that you might be more likely to encounter in black and white, flickering from your flat-screen on Turner Classic Movies.\n\nThe protagonist, Alice Murphy, portrayed by Carmen Cusack — making a simply gorgeous Broadway debut — is a spunky girl in her late teens in the scenes set in the 1920s. A dreamer with a rebellious streak and a hunger for literature, she’s causing a fine ruckus in the sleepy town of Zebulon, striking up a clandestine romance with Jimmy Ray Dobbs the son of the powerful mayor, with traumatic consequences.\n\nBut before we meet the younger Alice, we meet the grown woman, in 1945, in Asheville, where she has become editor of The Asheville Southern Journal, a prestigious literary magazine — contributors include Eudora Welty and Carson McCullers — and lives an independent life. The heart of the show is the rough road Alice traveled during the years in between, how the backwoods girl became the mature, educated woman, and the hard price she paid for her wisdom.\n\nOn one recent Tuesday, we spent an hour each with a dozen upcoming Broadway shows as they worked under looming deadlines. From the costume shop to the first curtain call, here's how the steps and stories, the stitches and salesmanship come together.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 405,
  "archivePath": "data/archives/reviews/bright-star-2016/nytimes--charles-isherwood_2026-02-05.html",
  "textFetchedAt": "2026-02-05T01:28:37.670Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250713165906",
  "archiveOrgUrl": "http://web.archive.org/web/20250713165906/https://www.nytimes.com/2016/03/25/theater/review-bright-star-beams-nostalgia-underscored-by-fiddles-and-banjos.html?_r=0",
  "wordCount": 405,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T15:00:33.119Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The text cuts off mid-review and ends with technical error messages about JavaScript and content retrieval, making it impossible to determine the critic's verdict.; openai: The text provided is incomplete and contains navigation elements and error messages, making it not a scoreable review.; gemini: The review text is incomplete and contains error messages, making it impossible to determine the critic's opinion of the show.",
  "promptVersion": "5.2.0"
}
