{
  "showId": "buena-vista-social-club-2025",
  "outletId": "ny-stage-review",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2025/03/19/buena-vista-social-club-how-to-make-beautiful-music-in-havana/",
  "publishDate": "March 19, 2025",
  "fullText": "A glowing celebration of Afro-Cuban musical heritage, Buena Vista Social Club packs airy dancing, warm personalities, distinguished musicianship and a solid story. What makes the lively new Broadway attraction that opened on Wednesday so unique is its radiant collection of lovely yesteryear songs that many Hispanic viewers probably have known since infancy.\n\nGiving authenticity to this latest jukebox show, notable Hispanic artists appear among the dozen musicians who grace a bandstand usually kept at center stage during the proceedings. They masterfully deliver variously swinging or sorrowful or sensual arrangements of vintage heartbreakers like “Dos Gardenias” that illustrate and/or decorate a nostalgic, at times dramatic, storyline set mostly in mid-1950s Havana as the coming Cuban Revolution smolders. I am no authority on Afro-Cuban anything, but it is wonderfully easy to drown in the dreamy music lovingly being made by the artists who light up the Gerald Schoenfeld Theatre.\n\nSome theatergoers already may be aware of Buena Vista Social Club as a best-selling and award-winning album made by veteran Cuban musicians and vocalists that was produced on a shoestring in Havana in 1996 and became a global hit. Playwright Marco Ramirez (The Royale) lightly fictionalizes the saga of how this legendary album was recorded and employs it to frame another, more romantic fictional story involving several of its performers during their 1950s youth.\n\n[Read Bob Verini’s ★★★★★ review here.]\n\nBoth stories center on Omara (Natalie Venetia Belcon), a testy diva being coaxed out of retirement by a fanboy American producer (Justin Cunningham) to participate in the recording in 1996. Flashbacks to 40 years previously reveal Omara (Isa Antonetti) as a sweet young singer doing a nightclub act with her strait-laced sister Haydee (Ashley De La Rosa) for the American tourists – cue up the tumultuous Desi Arnaz-y party number “El Cumbanchero.” Conflicts arise between the sisters over music, culture, politics and an American recording contract. Ramirez’s script is quick, neatly written, and gets the job done, which is to cogently interweave two narratives in support of the Buena Vista Social Club songbook. How the writer neatly manages to mesh double stories with over a dozen disparate songs –  all sung with their Spanish language lyrics – and still leave time for instrumental sessions is admirable, particularly since the entire two-act show runs scarcely more than two highly entertaining hours.\n\nJuan de Marcos, musical director and bandleader of the original 1996 recording, is a consultant on the music, so the beautiful sounds that float the show likely are true to their roots and traditions. The second act opens with a hot jam session on a naughty “El Cuarto de Tula” that gives the band members a blazing showcase under pianist Marco Paguia’s musical direction. Standout artists on the bandstand or among the stories include Renesito Avich, a sunny, smiling master of the Cuban tres guitar; David Oquendo, a venerable Havana-born guitarist who contributes to the arrangements; Leonardo Reyna, a bright young keyboard whiz and a pretty good actor; Julio Monge, a splendid actor who illuminates the 1996 scenes; and well, let’s just say they’re all the real deal up there. Natalie Venetia Belcon, whose smoky vocal on “Candela” is among the highlights, lends the crusty Omara a regal presence that contrasts with her uncertain younger self, demurely acted and vibrantly sung by Isa Antonetti.\n\nDeveloped and keenly directed by Saheem Ali, who fluently stages the action and its transitions, Buena Vista Social Club is enhanced by handsome visuals. Designer Arnulfo Maldonado provides a romantic neoclassical background of high arched windows above a terrace, below which materialize specific locations such as a recording studio. The lighting by Tyler Micoleau often suffuses the atmosphere with a rosy, golden glow. Such lighting and the costumes designed by Dede Ayite further the swirling charm of several lyrical dance sequences choreographed by Patricia Delgado and Justin Peck.\n\nA nice 20-page booklet with informative notes by documentary producer Hugo Eugenio Perez regarding the songs (illustrated by Hery Paz, the show’s flutist) is inserted 1nto every Playbill. It makes a fine souvenir of a very good time on Broadway.\n\nBuena Vista Social Club opened March 19, 2025 at the Schoenfeld Theatre. Tickets and information: buenavistamusical.com\n\n-->\nAbout Michael SommersMichael Sommers has written about the New York and regional theater scenes since 1981. He served two terms as president of the New York Drama Critics Circle and was the longtime chief reviewer for The Star-Ledger and the Newhouse News Service. For an archive of Village Voice reviews, go here. Email: michael@nystagereview.com.\n\nPrimary SidebarSearchSearch",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": null,
  "source": "scraped",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-23T21:55:51.537Z"
}
