{
  "showId": "buena-vista-social-club-2025",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Juan A. Ramirez",
  "url": "https://www.theatrely.com/post/buena-vista-social-club-brings-the-music-to-life-review",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "On a recent Saturday matinee, the roars of the crowd following every song were akin to a [insert any popstar] at MSG. The music won the world over in the late nineties for a reason. Its delicious blend of Cuban rhythm and Afro-Cuban percussion harkens back to the heyday and Golden era of Havana, yet feels timeless and perfect for today. It’s a sound we don’t get all that often on Broadway, and boy, do I hope it stays a while.",
  "bwwScore": 8,
  "contentTier": "complete",
  "playbillVerdictUrl": "https://www.theatrely.com/post/buena-vista-social-clubs-rhythm-of-life-review",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundups-BUENA-VISTA-SOCIAL-CLUB-Opens-On-Broadway-20250319",
  "fullText": "The company of Buena Vista Social Club | Photo: Matthew Murphy\n\nI had never heard of the Buena Vista Social Club before this musical existed. When it was announced for an Off-Broadway run at the Atlantic in 2022, I was curious what director Saheem Ali would dream up at the intimate downtown venue. It was a pure delight.\n\nThat sentiment holds true with the Broadway transfer, which opened earlier tonight at the Gerald Schoenfeld Theatre.\n\nWith a book by Marco Ramirez, Buena Vista Social Club tells the story of the Grammy Award-winning 1997 album, and the artists behind it who rose to international fame later in life.\n\nAs our sturdy narrator Juan de Marcos (Justin Cunningham) tells us early on in the show: “Some of what follows is true, some of it only feels true,” but there is no doubt by the time you leave, you will have been transported to the heart of Havana with a smile on your face.\n\nIn 1996, we find de Marcos meeting with the storied singer Omara Portuondo (Natalie Venetia Belcon) and pleading with her to come record an album of music to revive the Cuban sounds of yesteryear that have been lost to history. After some convincing from old friends, Omara reluctantly shows up to the studio when we flashback to 1956 and see the origins of these relationships. A tried and true musical theatre writing motif, here effortlessly flows back and forth thanks to the tremendous sound from the fabulous on-stage band led by Marco Paguia.\n\nOn a recent Saturday matinee, the roars of the crowd following every song were akin to a [insert any popstar] at MSG. The music won the world over in the late nineties for a reason. Its delicious blend of Cuban rhythm and Afro-cuban percussion harkens back to the heyday and Golden era of Havana, yet feels timeless and perfect for today. It’s a sound we don’t get all that often on Broadway, and boy, do I hope it stays a while.\n\nThanks to married duo Patrica Delgado and Justin Peck (Illinoise), the music comes alive with invigorating choreography that electrifies the Schoenfeld stage. Arnulfo Maldonado's gorgeously stunning Havana scenic design feels like I’ve stepped into the Cuban Epcot pavilion (positive connotation!!) and when paired with Tyler Micoleau’s striking lighting design is jubilant.\n\nA terrific ensemble transforms Buena Vista Social Club into a dazzling feast for the eyes and ears. This music has been enchanting audiences for decades, and now a whole new generation will get to dive head first into this world, and for that, we should all be thankful.\n\n‍Buena Vista Social Club is now in performances at the Gerald Schoendfeld Theatre on West 45th Street in New York City. For tickets and more information, visit here.\n\nHailing from sunny South Florida, Kobi Kassal founded Theatrely (formerly Theatre Talk Boston) while attending Boston University. He is an avid theatre attender and can be found seeing a performance most nights of the week (in normal times!) He is interested in the cross section of theatre, popular culture, hospitality, and politics. He also loves a good bagel!\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 561,
  "archivePath": "data/archives/reviews/buena-vista-social-club-2025/theatrely--juan-a--ramirez_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:16:45.496Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251112230544",
  "archiveOrgUrl": "http://web.archive.org/web/20251112230544/https://www.theatrely.com/post/buena-vista-social-club-brings-the-music-to-life-review",
  "duplicateTextOf": "theatrely--kobi-kassal.json",
  "wordCount": 561,
  "tierReason": "Full review text"
}