{
  "showId": "buena-vista-social-club-2025",
  "outletId": "theatermania",
  "outlet": "TheaterMania",
  "criticName": "Zachary Stewart",
  "url": "https://www.theatermania.com/news/review-buena-vista-social-club-a-wild-cuban-dance-party-trapped-in-a-broadway-musical_1768054/",
  "publishDate": "March 19, 2025",
  "fullText": "The band takes the final bow in Buena Vista Social Club, the new musical at the Gerald Schoenfeld Theatre on Broadway—and that’s as it should be. The music is so good, the performances so alive, and the band so sexy that I frequently found myself wondering: Couldn’t this just be a concert?",
  "isFullReview": false,
  "dtliExcerpt": "The Grammy Award-winning album of Cuban music is now a Broadway show.\n\nOmara Portuondo (a commanding Natalie Venetia Belcon) is elevated to the central role despite singing just one track on the album. She’s a living legend when Juan de Marcos (Justin Cunningham) attempts to recruit her with an aggressive sales pitch: “&#8230;one day, with the right record, this island might remind the world that Mozart’s got nothing on us,” he tells her with typical Cuban humility. And it works.\n\nShe enters the studio with Compay Segundo (a charming Julio Monge), Eliades Ochoa (a magnetic Renesito Avich), and “Picasso on the keys” Rubén González (Jainardo Batista Sterling), who is by now quite senile but is present as a “good luck charm.” Ever the diva, Omara initially bristles at de Marcos’s arrangement of “Candela,” which features a flute solo. “It’s not the right sound,” she scoffs. But, after crossing himself and going for it, the magnificent Hery Paz proves her wrong with the greatest flute interlude since Jethro Tull—to which Omara assents with a little ass shake (the multi-talented Paz also drew the lovely illustrations in the program insert).\n\nSuch recording studio squabbles have proven the stuff of\n\nSuddenly we are transported back to 1958, the eve of the revolution, when young Omara (the powerfully expressive Isa Antonetti) had an act at the Tropicana with her sister, Haydee (Ashley De La Rosa). Their accompanists, a young Compay (Da’Von T. Moody) and Rubén (Leonardo Reyna), entice Omara out to the Buena Vista Social Club, a Black-run establishment decidedly not on any tourist maps. That’s where she meets a honey-voiced busboy named Ibrahim Ferrer (Wesley Wray in the 50s, Mel Semé in the 90s) who seems like the perfect collaborator. But with the sisters on the verge of signing a record contract and taking the last flight out of Havana before the commies roll in, Omara has a choice to make.\n\nDirector Saheem Ali partially succeeds in distracting the audience from the actual play with top-notch production values, including a multi-level set by Arnulfo Maldonado that portrays the salt-eaten masonry of old Havana. Dede Ayite’s costumes artfully conjure two historical periods, the 50s and the 90s, and the color of the fabric explodes under Tyler Micoleau’s lighting, which feels directly connected to the percussive heartbeat of this music. So does the choreography by Patricia Delgado and Justin Peck, which references traditional Cuban forms without being hemmed in by them. Most importantly, Jonathan Deans delivers pristine sound design so that we don’t miss a note.\n\nThank goodness, because music director Marco Paguia is serving up a feast for the ears, breathing new life into a well-known album with his clever arrangements and resourceful orchestrations. Some of the best moments in the show feature Avich on tres and David Oquendo on guitar leading the band, like in the second act opener “El Cuarto de Tula,” which invites band members to improv both musically and lyrically with what contemporary drag queens might call\n\nAmong the many quaint artifacts of the American century is the expectation that absolutely every square peg story and musical style fit into the round hole of the book musical, a distinctively American form we treat as timeless but which really only\n\nThat thoroughly banal explanation still doesn’t justify the mediocre book musical before us—a gorgeous night of sound and color that really could have just been a concert.\n\nGet the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nBroadway performances start on March 27 at the Majestic Theatre.\n\nGet the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nBy providing information about entertainment and cultural events on this site, TheaterMania.com shall not be deemed to endorse, recommend, approve and/or guarantee such events, or any facts, views, advice and/or information contained therein.\n\n©1999-2026 TheaterMania.com, Inc. All Rights Reserved.",
  "showScoreExcerpt": "\"The music is so good, the performances so alive, and the band so sexy\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Meh",
  "scrapedAt": "2026-01-23T21:59:35.874Z"
}