{
  "showId": "buena-vista-social-club-2025",
  "outletId": "THEDAILYBE",
  "outlet": "The Daily Beast",
  "criticName": "Tim Teeman",
  "url": "https://www.thedailybeast.com/review-buena-vista-social-club-rouses-broadway-to-fabulous-life-and-we-had-a-world/",
  "publishDate": "March 19 2025",
  "fullText": "To CBS Tony Award show producers, one word: “Candela.” This brilliant number, a dazzling distillation of music and dance, is just one of a terrific series of musical set-pieces in the Broadway transfer of Buena Vista Social Club (Gerald Schoenfeld Theatre, booking through Jan. 4, 2026). The show—unsurprisingly given its rousingly gorgeous aural and visual tableaux—is a bigger treat on a bigger stage, after its 2023/4 off-Broadway engagement at the Atlantic Theater downtown. Developed and directed by Saheem Ali, with a book by Marco Ramirez and music by the Buena Vista Social Club itself, the musical switches between Havana in the mid-1950s and mid-1990s, with us seeing the legendary Afro-Cuban band in its spry, radical infancy and then being reformed 40 years later to record the songs long left behind. That record would go on to become the best-selling world music album of all time, selling more than 8 million copies worldwide. The musical features an anchoring, powerhouse performance by Natalie Venetia Belcon as the adult Omara Portuondo (Isa Antonetti plays her as a younger woman). Imperiously regal, with a gorgeous, theater-filling voice, every scene featuring her singing is bravura, and she’s also very funny—eyeing the presence of a flute with suspicion before happily conceding that it’s a great addition for a song, or simply announcing her presence when she enters a room. Isa Antonetti. Matthew Murphy The still-too-slight and vague book tells the story of her relationship with her sister Haydee (Ashley De La Rosa). In the mid-1950s, they were a popular singing duo at Havana’s Tropicana club. When revolution comes, Haydee decides to leave for the US, and Omara stays behind—the trauma of their separation and estrangement eventually leads her to stop singing. The musical maps her renaissance alongside the renaissance of the Buena Vista Social Club band many years later. The musical is bounded at beginning and end in the mid-1990s, with a young producer, Juan de Marcos (Justin Cunningham), overseeing the making of the album that will become a record-breaking global phenomenon—and for that album Omara and singer Ibrahim Ferrer (Wesley Wray as a young man, Mel Semé, older) are poignantly reunited. Eight Andrew Scotts Star in One of NYC’s Hottest Tickets SEEING DOUBLE Tim Teeman The discrimination that Ibrahim experienced in the 1950s—his skin was deemed too dark, and he was forced to sing below the stage of one venue—has marked his entire life, denying him the trajectory of fame and approbation that Omara has received. The musical assumes—maybe rightly, maybe wrongly—those coming to the show know the story of the band, Cuban history, and the real-life people represented on stage. If not, then it’s up to you to bone up through the 1997 album, Wim Wenders’ Oscar-nominated and award-laden 1999 film, or in reading generally about the era and figures like Portuondo, Compay Segundo (Da’Von T. Moody as a young man, Julio Monge as older), and pianist Rubén González (Leonardo Reyna as a young man, and Jainardo Batista Sterling as older). Leonardo Reyna (seated at piano) and the company of Buena Vista Social Club. Matthew Murphy Do not disregard the best Playbill accessory of the season—de Marcos, the show’s music consultant, has written an excellent booklet explaining the meaning and genesis of the show’s stunning songs, including the romantic melodrama of “Dos Gardenias” (1945), “Veinte Años” (1935; the first song Portuondo recalls singing with her father as a precocious four-year-old), and Compay’s “Chan Chan” (1985), which became a global hit after the 1997 album was released. The slightness of the book, and the understated historical context for what we are watching, does not undermine the musical—because the music is the thing. Arnulfo Maldonado’s triple-wow design—one of the most beautifully realized stages of the season so far, tangily redolent of Cuban musical venues of the 1950s—even has an upper raised platform, perfect to stage bruised sunsets along the Malecón. Why ‘Purpose’ Is the Most Explosive Family Drama on Broadway TRUTH BE TOLD Tim Teeman The choreography (Patricia Delgado and Justin Peck), costumes (Dede Ayite), and atmosphere-enhancing lighting (Tyler Micoleau) are all era-specific perfect for the thrilling stage-filling numbers Ali, Delgado, and Peck craft with the cast and ensemble (Angélica Beliard, Carlos Falú, Carlos Gonzalez, Héctor Juan Maisonet, Ilda Mason, Marielys Molina, Andrew Montgomery Coleman, Sophia Ramos, Anthony Santos, Martín Sola, and Tanairi Sade Vazquez). The other stars of the show are the band: music supervisor Dean Sharenow, music director Marco Paguia (also conductor and on piano), associate music director David Oquendo (also on guitar), Renesito Avich (tres), Gustavo Schartz (bass), Javier Díaz, Román Diaz and Mauricio Herrera (percussion), Jesus Ricardo (trumpet), Eddie Venegas (trombone), Hery Paz (woodwinds), and Leonardo Reyna (piano). (L-R) Justin Cunningham, Marco...",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 82,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T04:58:22.417Z"
}
