{
  "showId": "buena-vista-social-club-2025",
  "outletId": "THENEWYORK",
  "outlet": "The New York Times",
  "criticName": "Elizabeth Vincentelli",
  "url": "https://www.nytimes.com/2025/03/19/theater/buena-vista-social-club-review-broadway.html",
  "publishDate": "March 19 2025",
  "fullText": "Performances in N.Y.C. Broadway Guide Free Events This Summer ‘Queen of Spades’ ‘The Last Bimbo of the Apocalypse’ BAM&#x27;s Next Wave Advertisement SKIP ADVERTISEMENT Supported by SKIP ADVERTISEMENT Critic’s Pick ‘Buena Vista Social Club’ Brings the Thrill of Music Making to Broadway A new musical inspired by the 1997 hit album gives a fictional back story to the veteran performers of the Havana music scene. Listen to this article · 6:27 min Learn more Share full article Natalie Venetia Belcon as Omara, with Renesito Avich, left, David Oquendo, right, and other band members in “Buena Vista Social Club” at the Gerald Schoenfeld Theater in Manhattan. Credit... Sara Krulwich/The New York Times By Elisabeth Vincentelli Published March 19, 2025 Updated June 2, 2025 Buena Vista Social Club NYT Critic’s Pick The spirit of the musical “Buena Vista Social Club” is evident in its opening scene. Audience members have barely settled into their seats before a group of onstage musicians strikes up the number “El Carretero,” with the rest of the cast gathered around and watching. Some are leaning in from their chairs, others get up and dance on the side. The music is center stage, and we immediately understand its power as a communal experience that binds people. Therein lies the production’s greatest achievement. For a place where music so often plays a crucial role, Broadway hardly ever highlights the thrill of music making itself. Oh, there have been shows that have effectively pulled the curtain on the process — David Adjmi’s play “Stereophonic” takes place inside recording studios, and the most effective scenes in “Beautiful: The Carole King Musical” are set in one as well. But the interconnections between musicians, songs and a society have rarely been evoked as vividly, and as lovingly, as they are in “Buena Vista Social Club,” which opened on Wednesday at the Gerald Schoenfeld Theater. (This improved version follows the show’s Off Broadway run at Atlantic Theater Company, which premiered in December 2023 .) As its title indicates, this production, directed by Saheem Ali, is inspired by the 1997 hit album “Buena Vista Social Club,” on which veterans of the Havana scene performed beloved sons, danzones and boleros from the traditional Cuban repertoire. Many of those songs and others are in the musical (a booklet in the Playbill introduces each one, with illustrations by the flutist Hery Paz), along with most of those musicians and singers. Or at least versions of them are. Tellingly, the book by Marco Ramirez ( “The Royale” ) identifies the characters by their first names only, as if to underline that this is more of an evocative flight of fancy than a biomusical — Ramirez makes the most of musical theater’s notoriously loose relationship with facts. The action travels back and forth between 1956, in the tense time leading up to the toppling of the autocratic Batista regime, and 1996, when the young producer Juan de Marcos (Justin Cunningham) assembles a backing band for the older singers he’s brought into the studio. (The British executive producer Nick Gold and the American guitarist and producer Ry Cooder played important parts in the “Buena Vista Social Club” album and the Wim Wenders documentary that followed , but the musical doesn’t mention them. Instead it focuses on de Marcos’s role in putting together the band and singers.) Image The show toggles between 1996 and 1956, where the young performers Compay (Da’von T. Moody), Omara (Isa Antonetti) and Ibrahim (Wesley Wray) bond over their love of traditional Cuban music. Credit... Sara Krulwich/The New York Times The show’s de Marcos brings in the vocalist Compay (Julio Monge), who in turn helps lure Omara (Natalie Venetia Belcon) out of self-imposed retirement. Compay and Omara’s original meeting is explored in the flashback scenes, along with its decades-long repercussions on Omara’s life. In 1956, Omara (the charismatic Isa Antonetti), then 19, and her sister Haydee (Ashley De La Rosa) sing tunes like the fast-paced “El Cumbanchero” that are palatable to the visitors flocking to the fancy Tropicana club. The young Compay (Da’Von T. Moody) and the virtuoso pianist Rubén (Leonardo Reyna) take her to the Buena Vista Social Club, a smaller, rougher spot that draws a very different audience and moves to a different beat. “There are no tourists,” an excited Omara tells her appalled sister, “they’re playing for us! ” It doesn’t hurt that a doe-eyed and velvet-voiced busboy, Ibrahim (Wesley Wray), hangs out at the Buena Vista, too. Eventually, Omara will have to make a decision that will have grave consequences for her future, and Haydee’s. The real Omara Portuondo was actually 26 and already an experienced performer in 1956. She was also almost 25 years younger than Compay Segundo, but the show suggests a generation coming of age together — not to mention romantic sparks between Omara and Ibrahim Ferrer. Ramirez cooked up this back story to create more emotional ",
  "originalScore": null,
  "assignedScore": 82,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "waybackUrl": "http://web.archive.org/web/20250609194012/https://www.nytimes.com/2025/03/19/theater/buena-vista-social-club-review-broadway.html",
  "fetchedAt": "2026-01-23T05:59:37.303Z"
}