{
  "showId": "buena-vista-social-club-2025",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jackson McHenry",
  "url": "https://www.vulture.com/article/buena-vista-social-club-broadway-marco-ramirez-theater-review.html",
  "publishDate": "March 19, 2025",
  "fullText": "All that adds up to a rousing evening at the theater, if also something less than a great musical. With its book whittled down so much and its careful hedging to only speaking the broadest generalities about Cuba’s history, Buena Vista Social Club only aims modestly high, just above the level of a tribute concert.",
  "isFullReview": false,
  "dtliExcerpt": "theater review The Buena Vista Social Club Gets Bigger and Smaller on Broadway By Jackson McHenry , a Vulture critic covering theater, film, and TV Mar. 19, 2025 save d Save this article to read it later. Find this story in your account&#x2019;s &#x2018;Saved for Later&#x2019; section. Comment Photo: Matthew Murphy In musical theater, the book’s often the trickiest thing to get right and the easiest target for criticism. If you don’t believe that the characters have a reason to break into song, blame the book. If the night feels like it’s dragging, blame the book. And if the songs are already hits, and the dancers are already fantastic, but you’re not quite achieving liftoff? Well, there’s always one place to look. That’s what I have to assume happened in production meetings for Buena Vista Social Club somewhere between its Off Broadway run in 2023 and its arrival at the Schoenfeld Theatre this spring. Back when my colleague Sara Holdren reviewed the musical, very loosely based on the true-life stories of the sensational Cuban supergroup, she noted that “the play side of Buena Vista feels like it’s been carefully assembled by committee.” It had a convoluted, rushed, and generically inspirational narrative about how these players met, weathered the revolution, and returned to each other. You might expect that book writer Marco Ramirez and director Saheem Ali took feedback like that and deepened and extended the thing in rewrites. Instead, they’ve just hacked through Buena Vista ’s Gordian knot. Why not simply cut as much of the book as possible? The remarkable thing is how much that approach works. The Broadway Buena Vista clocks in a little shorter than its Off Broadway iteration — now, it’s just two hours with intermission — and breezes through its set-up with quick dashes of exposition. Juan de Marcos (Justin Cunningham) is a young record producer enamored with classic Cuban songs who’s come up with a plan to record “a love letter to Golden Age Cuban music,” but first he needs to convince the diva Omara Portuondo (Natalie Venetia Belcon, exuding confidence in a series of power shawls by Dede Ayite) to come to the studio. Juan’s already recruited the eager old hand Compay (Julio Monge, wry and foxy, able to land even the hoariest jokes) among a company of younger musicians, but as Compay tells Omara when she gets in the studio, “These old songs … they kick up old feelings.” Soon it flashes back to a younger Omara (Isa Antonetti) and her officious sister (Ashley De La Rosa) preparing for their performances at the Tropicana before the revolution and hiring a younger Compay (Da’Von T. Moody) and his pianist compatriot Rubén (Leonardo Reyna) as their accompanists. The two boys lure Omara off to their rowdier club on the bad side of town; she meets a busboy with a voice of gold named Ibrahim (Wesley Wray). Her sister would never approve! I remember the Off Broadway plot contorting itself into a few more curlicues — there was one confusing side plot about that club being a hub for weapon-smuggling, and a lot more of the characters talking around the politics of the revolution while saying little. Here, Ramirez’s script is more skeletal: It tends to hit the clichés then segue into music as quickly as possible. The younger Rubén was “Picasso on the keys.” The older Rubén (Jainardo Sterling Batista) can barely walk anymore, but when Juan puts on a recording of a classic song, he suddenly remembers the notes. After the young Omara and Ibrahim fall for each other and then are separated by circumstance, have no fear that she will eventually find an older Ibrahim (Mel Semé, movingly poised) and the two will sing together again. Thinning the book of Buena Vista , however, has left the other aspects of the production expand in its absence, and that’s where the show is on its surest feet. First, there is the music: Those standards from the original album, a grab bag of genres and styles from a Cuba several decades ago, no surprise, still kill. Belcon brings the house down with “Candela,” maybe the most famous entry in the album, with more than a little help from Buena Vista’s band — in character, Omara disproves of a flute solo, until she hears the show’s flautist Henry Paz wail away on the instrument (a moment that wows the audience, too). You get to know the players in the band through their riffing, their personalities just if not more vivid than the paper characters that surround them. The band, composed of musicians from around the globe, also gives the show its center of gravity. They’re almost always onstage, whether in a central platform that doubles as the actual space of Juan’s recording studio or watching the action from the sidelines. Downtown, that could cramp the action, with dancers trying to negotiate around a small space with a double bass. At the Schoenfeld, everything has more space to luxuriate. The musicians can wander and engage with the theater audience as they jam, while the choreography of husband...",
  "showScoreExcerpt": "\"All that adds up to a rousing evening at the theater, if also something less than a great musical.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T04:58:33.981Z",
  "dtliThumb": "Meh"
}