{
  "showId": "sea-wall-a-life-2019",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Laura Collins-Hughes",
  "url": "https://www.nytimes.com/2019/08/08/theater/sea-wall-a-life-review-broadway-gyllenhaal.html?smtyp=cur&smid=tw-nytimesarts",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright"
  ],
  "bwwExcerpt": "Directed by Carrie Cracknell, 'Sea Wall/A Life' - a hit downtown early this year, at the Public Theater - is the most stripped-down storytelling on Broadway right now. The quiet spectacle these plays offer is in the acting of tragicomedies of love and loss, young men's stories about fatherhood and family, and about the hole that grief can blast right through a person's center.",
  "bwwScore": 8,
  "contentTier": "needs-rescrape",
  "fullText": "If it wasn’t the absolute worst time someone’s electronic device could have gone off during “Sea Wall,” Simon Stephens’s exquisite one-act monologue that’s part of a Broadway double bill, it still might well have sabotaged the show.\n\nThe British actor Tom Sturridge had held us entranced all the way to the pin-drop quiet of the play’s delicate final seconds when a robotic voice intruded from the orchestra of the Hudson Theater to deliver — what was it, an Amber Alert?\n\nA less masterful performer, or one of stormier temperament, might have let the audience’s reflexive anger overwhelm the moment. Without breaking character, Mr. Sturridge chose a smarter, more graceful course.\n\n“It’s O.K.,” he said gently, definitely to us but maybe also partly to himself, and the words were a balm: soothing the room and restoring the spell he’d cast, almost as soon as it had been shattered. He paused a long while, then resumed the play’s last little wordless bit, a coda now.\n\nWitnessing such a coup of craft and professionalism is part of the reason we go to live theater, where the best actors are sharply attuned to whatever is happening in the room. And that’s very much the case with “Sea Wall/A Life,” the program of twinned monologues that opened on Thursday night. Its second half, Nick Payne’s “A Life,” is performed by Jake Gyllenhaal.\n\nMr. Sturridge and Mr. Gyllenhaal, co-stars in Netflix’s recent “Velvet Buzzsaw,” are veterans of these playwrights’ work. Mr. Sturridge made his professional debut in Mr. Stephens’s “Punk Rock” in London, while Mr. Gyllenhaal has done Mr. Payne’s plays Off Broadway (“If There Is I Haven’t Found It Yet”) and on (“Constellations”).\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 302,
  "archivePath": "data/archives/reviews/sea-wall-a-life-2019/nytimes--laura-collins-hughes_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:26:09.326Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250723100400",
  "archiveOrgUrl": "http://web.archive.org/web/20250723100400/https://www.nytimes.com/2019/08/08/theater/sea-wall-a-life-review-broadway-gyllenhaal.html?smtyp=cur&smid=tw-nytimesarts",
  "wordCount": 302,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T08:47:16.332Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is truncated and ends with an error message about retrieving article content and enabling JavaScript, making it impossible to assess the critic's overall verdict; openai: The text is interrupted with a technical issue message, indicating incomplete content and preventing a full review assessment.; gemini: The review is cut off mid-sentence, so the final verdict is unknown.",
  "promptVersion": "5.2.0",
  "showScoreExcerpt": "CRITIC’S PICK \"Quiet Tragicomedies of Love and Loss: In a tender pair of monologues, Tom Sturridge and Jake Gyllenhaal portray young fathers shaken out of complacency.\"\n\nRead more"
}
