{
  "showId": "sea-wall-a-life-2019",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2019/legit/reviews/sea-wall-a-life-review-jake-gyllenhaal-broadway-1203292445/",
  "playbillVerdictUrl": "https://variety.com/2019/legit/reviews/sea-wall-a-life-review-jake-gyllenhaal-broadway-1203292445/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "The Broadway production “Sea Wall/A Life” opened at the Hudson Theatre Aug. 8, following a successful Off Broadway run at the Public Theater earlier this year. The following is Marilyn Stasio’s original review of the show, updated to reflect the new elements.\n\nComfy? Okay, let's talk Death: sudden death, painful death, lingering death, accidental death, and whatever other kinds of death happen to come into the receptive minds of playwrights Simon Stephens (\"Sea Wall\") and Nick Payne (\"A Life\"). The writing in these separate monologues — playing together on a double bill at Broadway’s intimate Hudson Theatre — is excellent, as are the solo performances by Tom Sturridge (\"Sea Wall\") and Jake Gyllenhaal (\"A Life\"). But this is no show to see on a first date.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nBoth plays take place on the same stone-cold set — two levels of solid brick walls — designed by Laura Jelinek and lighted with beautiful bleakness by Guy Hoare. The rest is left to the imagination in this stark production directed by Carrie Cracknell.\n\n\"People like me,\" says Alex in \"Sea Wall.\" \"They think I'm gentle.\" In Sturridge's devastating performance, Alex's demeanor seems more like shell-shock. That's perfectly understandable, given the harrowing tale he tells.\n\n\"As terrifying as anything I've seen,\" Alex says of his first encounter with an underwater sea wall, a strikingly vivid symbol of the hidden dangers that can upend a life without warning. \"I had no idea that the bed of the sea was built like that,\" he says. \"I thought it was a gradual slope.\" And so it is with the journey Alex envisions for his young daughter — a gentle glide through a happy life, followed by a gradual and painless descent into the darkness of death. It’s the loss of this comforting myth that is, in part, what has Alex in despair.\n\nStephens continually interrupts Alex's fluid narrative with remembrances of his wife Helen and the birth of his daughter. The chunks of these two separate stories aren't necessarily cohesive, but they're always jolting. As is Sturridge's performance, an aching and deeply disturbing cry of pain.\n\nLike \"Sea Wall,\" Payne's \"A Life\" is also about a death and told in alternating chunks of narrative. And no less than Sturridge, Gyllenhaal is out to break your heart. He’s always been a soulful actor (those eyes!), and if there's one thing the guy in this play has, it's soul. The narrator is named Abe and he's got two things on his mind: the death of his father and the birth of his first child.\n\nAbe speaks the most moving lines of this emotional evening when he defines what Payne calls the three kinds of death: the physical death when the body stops functioning, the emotional death when the body is buried, and the eternal death when our names are spoken aloud for the very last time on earth. To his credit, Gyllenhaal avoids the temptation to exploit these bruising lines. His delivery is simple and direct, but the feeling he projects is suffering incarnate.\n\nPayne has written the only pure laugh line of the entire evening when he has Abe describe what he sees on a sonogram as \"an X-ray of a pile of tiny kitten bones.\" There are light moments, as well, when Abe recounts the harrowing experience of watching a birth. \"It's nothing like I've seen it in films,\" he declares of the moment when his wife's water breaks. If there's a single line that Gyllenhaal does seem to chew over and thoroughly enjoy, this is it. His grin is endearing and his eyes shine with delight.\n\nBut in the context of these monologues, a word like \"delight\" must be taken with caution. There's pleasure to be had at the sound of pretty prose, and it's a joy to watch two fine actors perform in flawless character. But it might take a couple of stiff drinks to get the ashen taste of death out of your mouth.",
  "isFullReview": true,
  "textWordCount": 686,
  "archivePath": "data/archives/reviews/sea-wall-2019/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:26:01.039Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 686,
  "tierReason": "Full review text",
  "bwwExcerpt": "But in the context of these monologues, a word like 'delight' must be taken with caution. There's pleasure to be had at the sound of pretty prose, and it's a joy to watch two fine actors perform in flawless character. But it might take a couple of stiff drinks to get the ashen taste of death out of your mouth.",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Jake-Gyllenhaal-and-Tom-Sturridge-Star-In-SEA-WALLA-LIFE-See-What-The-Critics-Are-Saying-20190808"
}
