{
  "showId": "english-2025",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/English/1273",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/English/1273",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $58\n Buy Tickets\n\nCititour.com Review\n Many of us define ourselves primarily by our political beliefs, sexual orientation, race, religion or gender. But as we are savvily reminded in Sanaz Toossi’s oh-so-smart, Pulitzer Prize-winning play “English,” now at the Roundabout’s Todd Haimes Theatre (in a co-production with the Atlantic Theater, which first presented the play in an identical production), which language we speak – and what language others force us to speak – is often the predominate component of one’s identity, especially outside of the United States.\n\nToossi’s set-up is simple but proves effective enough to raise its complex topics. In a small city in Iran in 2008, Marjan (the lovely Marjan Neshat) – an Iranian woman who spent nine years living in England and speaks both English and Farsi beautifully – teaches a class for those taking the TOEFL (Test of English as a Foreign Language). \n\nHer four students all have their own motives for being there: Elham (a superb Tala Ashe) is a brash, sometimes insensitive medical student who needs to pass the test to work in Australia, but struggles with English because she resents having to learn it; Goli (an endearing Ava Laleharzadeh) is an 18-year-old enchanted with the language, even if she thinks it would be just fine to speak it exactly like the pop singer Ricky Martin; and Roya (a commanding Pooya Morseni) is trying to please her son, now living in Canada – where she hopes to relocate permanently -- and who only wants Roya to speak English to his daughter.\n\nThe big enigma here is Omid (the charismatic Hadi Tabbal), who says he needs to improve his skills to get a Green Card, but speaks seemingly perfect, almost unaccented English. Indeed, during a word association game, his ease in choosing such words as “windbreaker” and “Tupperware” belies his protestations of being less than fluent. Moreover, his eagerness to spend “office hours” time with Marjan, whether watching movies such as “Notting Hill” or engaging in highly personal conversations, continually makes us wonder if he has romantic designs on his teacher. (Yes, eventually all will be revealed.)\n\nWhile the entire play is performed in English, the characters are speaking in Farsi much of the time, and the entire cast brilliantly makes these distinctions clear; the characters talk with a different sense of ease and speed when conversing in the native language, while their English always carries a trace of an accent. Indeed, Toossi’s overwhelming point is that whatever these characters’ proficiency is in English (or lack thereof), each of them – even Marjan -- can only truly express their feelings in Farsi, whether that’s pain, recrimination, self-doubt, and, on occasion, joy.\n\nDirector Knud Adams is to be commended for guiding this excellent cast in doing uniformly fine work. But he can’t overcome the decision (whosever it was) to use Marsha Ginsberg’s unnecessarily distracting set, an ever-revolving classroom with too many (and too tall) chairs which frequently blocks audience members’ view of who is speaking. It’s a choice which seems painfully contradictory (and severely ill-advised) in a play about the importance of language.\n\nVisit the Sitehttps://www.roundabouttheatre.orgOpen/Close DatesOpening 1/23/2025Closing 3/2/2025\nTheatre Info\nTodd Haimes Theatre 227 W 42nd StNeighborhood: West 40sNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 589,
  "archivePath": "data/archives/reviews/english-2025/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:39:06.068Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 589,
  "tierReason": "Full review text"
}