{
  "showId": "english-2025",
  "outletId": "deadline",
  "outlet": "Deadline",
  "criticName": "Unknown",
  "url": "https://deadline.com/2025/01/english-broadway-review-1236262749/",
  "playbillVerdictUrl": "https://deadline.com/2025/01/english-broadway-review-1236262749/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Disney Names Parks Chief Josh D'Amaro As CEO To Succeed Bob Iger, Ups Dana Walden To New President Role; Pay Packages Set \n \n \n\n \n \n \n \n\n \n \n \n\n Read the full story\n\n \n\n \n\n \n\n \n\n \n \n \n \n\n \n\n \n \n\n \n\n \n\n \n \n\n \n\n \n\n \n\n \n\n \n\n \n \n \n \n By Greg Evans\n\nAbsolutely nothing gets lost in the translation of Sanaz Toossi’s English as the Pulitzer Prize-winning play about a group of Iranians longing for the West finally makes its Broadway debut, two years after its Off Broadway bow garnered critical raves and regional stagings won over audiences with its unfailing wit, grace and compassion.\n\nMaybe the two-year wait was fortuitous. This comedy-drama – the seriousness isn’t a shocker, the humor is – comes at a moment in history when listening seems as rare a thing as the desire to be heard is urgent. Toossi and her director Knud Adams issue a plea that couldn’t be more timely.\n\nThe setting is a classroom in Karaj, Iran – Marsha Ginsberg’s fine scenic design is, essentially, a rotating cube that all but demands we consider and re-evaluate fresh perspectives – where adult students attempt to learn English for a proficiency exam crucial to their aspirations. Some catch on quickly, others seem somehow blocked, and each has a deep need for connection, whether they can or can’t express it.\n\nAs the English course progresses over a series of weeks, the students, and their teacher (a wonderfully moving Marjan Neshat), make themselves known for better or worse, with secrets revealed and old hurts surfacing. There’s even the potential for romance, emphasis on the word potential.\n\nRoundabout Theatre Company has imported this flawless original cast, the actors bringing depth to each character: Tala Ashe plays Elham, a young woman whose honesty frequently crosses into rudeness, and whose repeated test failures suggest a deep ambivalence about desires; Ava Lalezarzadeh is the 18-year-old Goli, whose youthful enthusiasm for exploration puts her classmates’ reluctance into stark contrast; Hadi Tabbal as Omid, the sole male in the group whose ease with the new language suggest a past he only gradually reveals.\n\nPerhaps most intriguing of all is Roya, played by the remarkably composed Pooya Mohseni. She wants nothing more than to join her son and her young granddaughter in Canada, but her son has stipulations: She must learn English and she must leave behind her old-fashioned – i.e., non-Western, ways, lest they influence the little girl.\n\nIn a remarkable scene of classroom show-and-tell, Roya, her steely reserve finally showing an underlying heartbreak, recounts her sons recent use of the word “visit” to what Roya had planned as a move. She plays voicemail messages left by her son, one in English, the other in Farsi:\n\n“Do you hear how much more soft he is in his mother tongue?,” she asks her classmates. “Do you hear he remembers where he is from and who he comes from? He forget in English but in Farsi he remember.”\n\nRoya’s bewilderment is just one of the deep reactions prompted by what would seem to be a non-threatening endeavor, but Toossi knows full well that language and words and even accents can say more than meets the ear. Issues of self-perception and identity, of dignity and kindness and rudeness and bigotry are all wrapped up not just in what we say, but how we say it.\n\nAnd in a near-genius conceit that allows the audience to listen in as the characters show who they are when they speak one language and who they are as they speak another, each of the actors adopts a broken English style of speech when the characters are attempting their new language. When they speak in their native Farsi, the words are spoken in a flowing, even slangy English that telegraphs just how comfortable these students (and their teacher) are in their own skins, when they’re not trying to be something else.\n\nWithout giving away too much by way of plot developments, each of the characters will get at least one revelatory moment, one will disappear from the storyline almost entirely (and more’s the pity), one will show some true colors and at least two will find some unexpected common ground.\n\nThe cast, without exception, plays every twist, turn, beat and emotion beautifully. If you had to be in a classroom struggling with something that seems always to remain beyond your grasp, you’d be lucky to share space with folks like these. English is a wonder.\n\nTitle: EnglishVenue: Broadway’s Todd Haimes TheatreWritten By: Sanaz ToossiDirected By: Knud AdamsCast: Tala Ashe, Ava Lalezarzadeh, Pooya Mohseni, Marjan Neshat, Hadi TabbalRunning Time: 1 hr 40 min (no intermission)\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nDeadline is a part of Penske Media Corporation. © 2026 Deadline Hollywood, LLC. All Rights Reserved.\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice.",
  "isFullReview": true,
  "textWordCount": 888,
  "archivePath": "data/archives/reviews/english-2025/deadline--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:05:20.263Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 888,
  "tierReason": "Full review text"
}