{
  "showId": "english-2025",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/2025/01/23/broadway-review-english-by-sanaz-toossi/",
  "playbillVerdictUrl": "https://www.nydailynews.com/2025/01/23/broadway-review-english-by-sanaz-toossi/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright"
  ],
  "showScoreExcerpt": "“The strikingly thoughtful and moving new Broadway play… looks at multilingualism from a different angle.”\n\nRead more",
  "fullText": "We think of speaking in a foreign language as an enviable skill, a marker of intelligence, adaptability and future promise. But the strikingly thoughtful and moving new Broadway play at the Roundabout Theatre, the Pulitzer Prize-winning “English,” looks at multilingualism from a different angle. It’s exploring what you give up when you express yourself in a tongue not fundamentally your own.\n\nAre you always a stranger when speaking in a second language, an “other,” someone destined never to be fully known?\n\nThose of us lucky enough to have English as a native language are to some degree inoculated from this issue, given its status as the language of business, aviation and international education. But “English,” which is set in Tehran and follows the teacher and student of a so-called TOEFL class, a typical qualification for anyone hoping to pursue graduate study in the U.S. or the U.K. and qualify to teach a class, is looking at native Farsi speakers.\n\nThe class that we watch over the course of some weeks practices total immersion, which is typical best practice in the teaching of foreign languages and in this case means, basically, all English all the time. Demerits follow any student who lapses back into Farsi.\n\nThere might be good pedagogical reasons for that, playwright Sanaz Toossi is saying, but it’s also a kind of forced cultural denial. “To learn a language, you have to be willing to abase yourself,” one of the feistier students comes to see.\n\nAnd while the play might be directly focused on matters of language, it invites the audience to broaden such observations to elsewhere within the geopolitical power structure. Smart young people in nations like Iran have a tough choice to make, it suggests. Stick around and limit their own ambitions or seek out a new world where they can never fully be themselves because they and others will always be hearing “the gap between not from here, not from there.”\n\nTo speak in English in order to function in a new place, the play argues, forces non-native speakers to live forever in that gap.\n\n“English,” which is directed by Knud Adams and features the uniformly excellent Tala Ashe, Ava Lalezarzadeh, Pooya Mohseni, Marjan Neshat and Had Tabbal, hardly is in sync with the new political realities in the U.S. and beyond, and it certainly does not spend a lot of time exploring the benefits of speaking an international language; that’s just not Toossi’s point.\n\nBut this is a very deftly structured play that figured out how to overcome the central problem with any play involving two languages. Rather than deal with subtitles or translations, the characters use accents when speaking English in the play but then remove them when speaking Farsi, thus replicating the experience of non-native speakers from the audience’s perspective.\n\nThe intent here is to get us to see beyond syntax and sounds and to think about how much we focus on such skills when speaking to those who have had to resort to another language when, say, moving to another country. It’s a highly effective device that further humanizes people almost all of us think we know, but perhaps do not.\n\nI’ve seen “English” before, in Chicago (it also was seen Off-Broadway at the Atlantic Theatre). The separate Goodman Theatre production had more of a sense of the world outside, to its betterment, and suggested that the classroom wasn’t just a place where you lost yourself but an escape from chaos. But Adams has chosen a rather more ethereal path, scoring the show with emotive piano music and revolving the set in such a way as you feel like these students, and their teacher, are floating in a kind of linguistic netherworld, denying themselves with the prize of getting ahead.\n\nIs it worth it? As this country sees huge changes in immigration enforcement, that’s the question of the night.",
  "isFullReview": true,
  "textWordCount": 647,
  "archivePath": "data/archives/reviews/english-2025/nydailynews--chris-jones_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:07:24.647Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 647,
  "tierReason": "Full review text"
}