{
  "showId": "english-2025",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Christian Lewis",
  "url": "https://variety.com/2025/legit/reviews/english-review-broadway-play-1236282770/",
  "playbillVerdictUrl": "https://variety.com/2025/legit/reviews/english-review-broadway-play-1236282770/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright"
  ],
  "fullText": "Unlike casual language learners — say, in a high school French class, or on Duolingo — for the characters in Sanaz Toossi's Pulitzer-winning “English,” language acquisition feels imperative. Set in Karaj, Iran in 2008, the play centers on a group of four adults taking a class to pass the Test of English as a Foreign Language (TOEFL) exam.\n\nEach has their own reasons for needing a good score: Elham (Tala Ashe) requires it to go to med school in Australia; Omid (Hadi Tabbal) to get a green card; Roya (Pooya Mohseni) to appease the demands of her son in Canada, who is raising his daughter in English; and Goli (Ava Lalezarzadeh) may not have a plan for what's next, but she knows that English fluency is a must. While there is some fun to be had — show and tell, a vocab drill game involving tossing a ball, and screenings of classic rom coms — passing this exam is a matter of the utmost importance for this quartet of English language learners. \n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'White Lotus' Season 4 Casts Steve Coogan, Caleb Jonte Edwards \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Knight of the Seven Kingdoms' Premiere Draws 6.7 Million Viewers in Three Days\n\nAs a policy students are only supposed to speak in the language of instruction, though of course this rule gets broken all the time. In a clever feat of playwriting, Toossi has devised a system to avoid supertitles: when the characters speak English, they have thick Iranian accents, but when they are ostensibly speaking Farsi, they speak in unaccented English. This distinction is abundantly and immediately clear onstage, never explained but automatically comprehensible to audiences as soon as the dialogue begins, and a testament to the strength of the writing and conception of the piece. Every detail about the way language works in this play is meticulously thought out and executed with a masterful touch. \n\n \n \n \n\n \n \n \n\n \n \n\n \n Popular on Variety\n\nLeading the group is their teacher, Marjan (Marjan Neshat), who grew up in Iran, lived in Manchester, England, for nine years, and then came back. Because all the other characters want to leave Iran, Marjan's choice to return confounds them. When first asked why she came back, she gestures to Iran's fraught history: \"We used to come back in those days\" (a ghostly echo to Toossi's \"Wish You Were Here,\" a play about the difficulties of leaving and returning during the Iranian Revolution). Later, she more intimately admits that in Manchester she got tired of having to live in English 24/7, constantly focusing on translating and trying to assimilate at the cost of having a personality. She painfully asks, \"How long can you live in isolation from yourself?\"\n\nMarjan is a fascinating case whose linguistic and cultural identification are often at odds with the other characters. She admits, \"I always liked myself better in English,\" and enjoyed being called Mary, explaining that \"small sacrifices,\" like anglicizing your name, \"can open our world.\" Her students object: Elham tells her Marjan is not a difficult name to say and Roya mournfully declares \"Our mothers get to name us. Not foreigners.\" They accuse her of hating her language, her culture, and of finding where she's from \"repulsive.\"\n\nAt various points Marjan shows clear favorites, like the nearly fluent Omid, and clashes with Elham, who struggles the most. Sometimes, Marjan replicates the biases of the outside world, regurgitating trauma she likely experienced, as she goes from gently coaching to harshly criticizing Elham's accent (even as her own begins to slip, triggering a cycle of self-hatred).\n\nKnud Adams' direction embraces all the linguistic intricacies of the play, keeping our focus on the words, what they mean, how they are said, and what's behind each struggle to find a word, each carefully chosen phrase, each misaccented \"w\" sound. His subtle direction also basks in critical moments of silence: a smoke break outside the classroom, the frustrated focus during an exam, and the pensive, haunting opening and closing image of Marjan looking out through semi-transparent curtains.\n\nThe cast does commendable work bringing their characters to life: Ashe's Elham is ferocious, prickly, and competitive; Tabbal's Omid is lovable but too good; Lalezarzadeh's Goli is young, bright-eyed, yet wise; Pooya's Roya is queenly, imposing, and devoted. Neshat's Marjan is a bit slippery, oscillating between kind and strict, biting and supportive, self-deprecating and wistful. While Neshat's is the star-turn performance, Ashe and Pooya make meals out of their roles, and Lalezarzadeh is a delight.\n\nMarsha Ginsberg's set is a rotating cube; most of the time we are inside the classroom with two removed walls. There's a pesky column at the corner, which manages to just barely obstruct sightlines — though perhaps this has meaning of its own, revealing a potential non-linguistic barrier between us and them, while also helping to give the classroom its necessary claustrophobic tension.\n\nMeanwhile, the lights, by Reza Behjat, are a marvel. More gestural than naturalistic, but rooted in sunsets and shadows, Behjat's work gorgeously captures the light as it travels through gauzy curtains, and deftly works around the design challenge of a set with a ceiling. In one corner of the stage there is a large rig for a light that glides upward to evoke the sun's path, making the lines of the window panes dance gloriously across the floor.\n\nEarly on, Goli says that she likes English because \"English does not want to be poetry like Farsi.\" In the same breath, though, she metaphorizes English into rice, a flexible culinary staple you can use to \"make whatever you like.\" She explains that when you cook rice, it doesn't sink, but floats on top of the water. The irony here is unspoken and beautiful: Goli cannot help but speak in poetry, even in her uneasy English. The genius of Toossi's writing is that despite the dialogue being in English, it always feels like it was composed in Farsi. We can witness each of her characters clearly thinking in Farsi, translating their own speech into English, relying on the idioms, grammar, and syntax, and perhaps most poignantly, the poetry of Farsi.\n\nThe politics of linguistics, translation, and learning a foreign language make for a play that is as emotionally compelling as it is intellectually stimulating. \"English\" very rightfully won the Pulitzer Prize for Drama in 2023, and it's hands down a masterpiece of theater. Undeniably one of the best plays of the decade, it is both thought-provoking and deeply affecting. This Broadway run will thankfully allow even more audiences to enroll in Toossi's class. After all, even for native speakers, there is a lot about English that we still have to learn, especially what it means to those who have to learn it.",
  "isFullReview": true,
  "textWordCount": 1112,
  "archivePath": "data/archives/reviews/english-2025/variety--christian-lewis_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:36:09.751Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1112,
  "tierReason": "Full review text",
  "showScoreExcerpt": "\"Undeniably one of the best plays of the decade, it is both thought-provoking and deeply affecting. This Broadway run will thankfully allow even more audiences to enroll in Toossi’s class.\"\n\nRead more"
}