{
  "showId": "once-on-this-island-2017",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2017/12/03/theater/review-once-on-this-island-revived-and-ravishing.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2017/12/03/theater/review-once-on-this-island-revived-and-ravishing.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "What a delight it is to enter the world of 'Once on This Island'...The hallmark ingenuity, warmth and intensity bordering on excess that characterize Mr. Arden's style is recapitulated everywhere within the production, from the frankly stupendous singing (Chris Fenwick is the music supervisor) to the electric choreography of Camille A. Brown. Everyone is working on the same crammed page.",
  "bwwScore": 9,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-ONCE-ON-THIS-ISLAND-Begins-its-Quest-on-Broadway-Updating-Live-20171203",
  "showScoreExcerpt": "\"A ravishing revival...A pastiche Caribbean score whose words are restrained and delicately rhymed but whose music is relentlessly grabby and emotional...Arden has aced every theatrical trick he’s torn from the ancient handbook, freshening the show, and the tricks, in the process...The hallmark ingenuity, warmth, and intensity bordering on excess that characterize Arden’s style is recapitulated everywhere within the production, from the frankly stupendous singing to the electric choreography.\"\n\nRead more",
  "fullText": "I wasn’t expecting the goat in diapers.\n\nNor did I arrive at Circle in the Square the other night anticipating the panorama of village folk barbecuing on the beach, fishing in the lagoon and going about their daily business in a joyful preshow panorama on the theater’s lozenge-shaped stage.\n\nHad the show never started, I would have been quite content.\n\nBut then it did, and all I can say is that after a dismal theatrical fall, in which even the highlights seemed ashen, what a delight it is to enter the world of “Once on This Island.” The musical, first seen on Broadway in 1990, opened on Sunday in a ravishing revival directed by Michael Arden.\n\nYou may not know that name, though if you saw Mr. Arden’s reformulated “Spring Awakening” for Deaf West Theater in 2015, you’d remember his signature. It’s a big signature, maximally decorative and triply underlined.\n\nThat ornateness is perfectly suited to “Once on This Island,” a fable of love and death and temperamental gods set in the French Antilles. Like all fables, it is very simple in outline — and thus arguably better suited to literary rather than theatrical expression. After all, what happens? A girl from one clan falls for a boy from another, the impossibility of their match leading to tragedy and transformation.\n\nOh wait, that’s “Romeo and Juliet.”\n\nSo is this, except that here the boy and girl are named Daniel and Ti Moune. They do not represent Shakespeare’s “two households both alike in dignity” but rather, as the opening number puts it, “two different worlds on one island.” Daniel is a son of the “grands hommes,” with their “pale brown skins” and French ways. Ti Moune, a “peasant,” is poor and “black as night.” The problem of colorism added to class prejudice gives this slim folkloric story as much complexity as it can handle on the page.",
  "isFullReview": true,
  "textWordCount": 316,
  "archivePath": "data/archives/reviews/once-on-this-island-2017/nytimes--jesse-green_2026-02-07.html",
  "textFetchedAt": "2026-02-07T14:58:19.020Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 316,
  "tierReason": "Full review text"
}