{
  "showId": "fool-for-love-2015",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Unknown",
  "url": "http://www.theguardian.com/stage/2015/oct/08/fool-for-love-sam-rockwell-nina-arianda-sam-shepard",
  "playbillVerdictUrl": "http://www.theguardian.com/stage/2015/oct/08/fool-for-love-sam-rockwell-nina-arianda-sam-shepard",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Sam Rockwell as Eddie and Nina Arianda as May in Fool For Love. Photograph: Joan Marcus/SuppliedView image in fullscreenSam Rockwell as Eddie and Nina Arianda as May in Fool For Love. Photograph: Joan Marcus/Supplied This article is more than 10 years oldReviewFool for Love review – Sam Rockwell sizzles in slow-burning tragedyThis article is more than 10 years oldManhattan Theatre Club, New YorkThe two leads have sex appeal to spare – but this Sam Shepard play only really sets sparks flying in its final 15 minutes\n\nOnce in a while Nina Arianda gets to keep her clothes on. Not often. Hers is a combustible sexuality and of course producers want to exercise and exploit it. The erotic fire she kindles with her co-star, the indie film darling Sam Rockwell, is a highlight of Daniel Aukin’s shrewd if somewhat slow-burning revival of Sam Shepard’s 1983 play, a hyperreal drama that is part allegory, part romance, part Western and part the kind of tragedy Sophocles would have thought A-OK.\n\nMay (Arianda) has fled to a spare motel room, somewhere in the arid Mojave desert. She’s found a job and a boyfriend, a sliver of a life. “I’m a regular citizen here now,” she says, with defiance and irony. But Eddie (Rockwell), a rodeo stuntman, has followed her. He has dreams of spiriting her away to a plot of land in Wyoming. But May isn’t interested in Wyoming. “I hate chickens! I hate horses! I hate all that shit!” she says. She knows that Eddie will eventually desert her, just as he has so many times before. Maybe Eddie knows this, too. But he won’t leave the room. And she doesn’t want him to.\n\nAs they dance their violent, amorous pas de deux, they’re observed by an older man (Joseph Gordon Weiss), seated on a porch chair, who watches the action while remaining just outside of it. He is most likely their shared father, a fact they learned in high school, after they had already “fooled around”.\n\nView image in fullscreenRide ’em, cowboy: Rockwell as Eddie. Photograph: Joan Marcus/SuppliedThey are older now, but their bond of blood and desire has never quite been severed. They are each other’s sin and salvation, punishment and reward. They have fought this bout before – in other cities, in other motels. They will fight it again. “You do nothing but repeat yourself,” says May. “You just go in a big circle.” Both do. That’s the thing about tragedy – you can’t extricate yourself from its cyclical pull.\n\nUntil its brilliant final 15 minutes, Aukin’s production doesn’t have that magnetic force. Arianda is vital and absorbing, Rockwell is easy in his body and forceful in his affect. He is also surprisingly good with a lariat. They kiss and punch and slam each other against walls and doors, which boom in Ryan Rumery’s neatly extravagant soundscape. But they often seem to be marking time.\n\nIn an interview in 1984, Shepard admitted that the stories his characters tell and by extension his own stories “are always fractured and fragmented and broken”. But it’s the lead-up to the story that feels ancillary here. However much May and Eddie knock each other around in the opening rounds, the script pulls its punches until the end. Shepard has described the play in a letter as a highly personal drama, “a very emotional play and in some ways embarrassing for me to witness but somehow necessary at the same time”.\n\nIn this production, it isn’t until that final fight and kiss and conflagration that the play faces up to the fervour at its core.",
  "isFullReview": true,
  "textWordCount": 600,
  "archivePath": "data/archives/reviews/fool-for-love-2015/guardian--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:14:57.416Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 600,
  "tierReason": "Full review text"
}