{
  "showId": "fool-for-love-2015",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/fool-for-love-review-the-right-ingredients-without-the-spark-1.10934119",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/fool-for-love-review-the-right-ingredients-without-the-spark-1.10934119",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Updated October 8, 2015 9:00 PM\n By LINDA WINER linda.winer@newsday.com\n\nadvertisement | advertise on newsday\n\nBOTTOM LINE: Hard-driving performances but not much chemistry in Shepard revival.\n\nWe're in a used-up motel room on the outskirts of the Mohave, where people talk about the hot desert wind, swig tequila from the bottle and, when a dog barks in the distance, you want to spell it dawg.\n\nIn other words, the revival of \"Fool for Love\" puts us firmly in Sam Shepard country, circa 1983, a land of primal American gothic family mythology, the love/hate relations with dual identities and exiled desert-rat fathers who haunt young beauties from the outlaw graveyard.\n\nEverything is in place for what really ought to have been a deeply scary, even deliriously entertaining visit back to midcareer Shepard-land. We have Tony winner Nina Arianda as an impossibly slinky, outrageously bold May and Sam Rockwell as a dirt-kicking Eddie who makes the most out of cleaning his rifle and can lasso a cheap dinette chair until you almost feel sorry for it.\n\nIn fact, Rockwell doesn't just rope the furniture in director Daniel Aukin's hardworking physical production. The actor, who has clearly been practicing, also lassos Arianda -- a feat we wish had not turned out to be the most exciting part of the 75-minute workout.\n\nEd Harris and Kathy Baker first made the erotic duel a bit of an Off-Broadway legend in '83. Shepard himself starred with Kim Basinger in Robert Altman's 1985 movie.\n\nAlthough Arianda and Rockwell have the looks, the presence and the guts, there isn't the down-and-dirty chemistry that makes the fate of the lovers' long and conflicted relationship feel inevitable and dangerous. They seem more like beautiful roughhousing puppies than people caught in the push/pull torrents of a forbidden relationship.\n\nWe're not going to describe the taboo here, but it's announced early in the play by the old guy (Gordon Joseph Weiss) and discussed between clutches and brawls. Suffice it to say that the violence feels phony and it's hard to get overheated about the fate of the characters. The rope tricks, however, are terrific.\n\nadvertisement | advertise on newsday\n\nWHERE Friedman Theatre, 261 W. 47th St.\n\nINFO $70-$150; 212-239-6200; foolforlovebroadway.com\n\nComing soon: Newsday's Entertainment newsletter, for the latest on celebs, TV, more.\n\nNewsday.com now uses Facebook for our comment boards. Please read our guidelines and connect your Facebook account to comment.",
  "isFullReview": true,
  "textWordCount": 399,
  "archivePath": "data/archives/reviews/fool-for-love-2015/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:15:23.874Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20151011230511",
  "archiveOrgUrl": "http://web.archive.org/web/20151011230511/http://www.newsday.com:80/entertainment/theater/fool-for-love-review-the-right-ingredients-without-the-spark-1.10934119",
  "contentTier": "complete",
  "wordCount": 399,
  "tierReason": "Full review text"
}