{
  "showId": "fool-for-love-2015",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "http://www.nydailynews.com/entertainment/theater-arts/sam-rockwell-nina-arianda-combust-fool-love-article-1.2390493",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/theater-arts/sam-rockwell-nina-arianda-combust-fool-love-article-1.2390493",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "ExpandBad romance: Sam Rockwell and Nina Arianda in “Fool for Love.\"\n\nSam Rockwell has earned a reputation for bringing a whiff of weirdness and explosive emotion to his roles. He delivers the goods — and so does costar Nina Arianda — in Broadway's combustible revival of \"Fool for Love.\"\n\nIn Sam Shepard's ill-starred love story, Rockwell plays Eddie, a cowboy who's hauling a trailer full of horses and a truckload of psychological wreckage. Arianda, a Tony winner for \"Venus in Fur,\" is May, Eddie's long-estranged lover. She's got demons of her own.\n\nTogether they share history and a dark secret locking them in a neurotic, push-pull ritual. Adding a percussive beat are slamming doors that boom like thunder.\n\nThey have no business being together. But Eddie tracks her down to a fleabag Mohave Desert motel to win her back. May wants none of it and taunts him by saying she's got a date. Pity the sweet and dim Martin (an ace Tom Pelphry), who arrives to take May to the movies and gets more than he bargained for. Gordon Joseph Weiss is an omnipresent old man with links to May and Eddie.\n\nFirst seen in 1983, the play is a compact yet rich work. It's also a showcase for its leads. Daniel Aukin directs a well-paced production and guides the cast to juicy performances.\n\nArianda, ever fascinating, turns on a dime from light to dark. Her May is sad, sexy and desperate. Rockwell's Eddie is seductive, scary and impressive with a lasso. He slings it around bedposts, chairs and finally May, always without a miss. In short order, she slips free of the rope. Catch and release is the story of their lives — forever. They'd be fools to believe otherwise.",
  "isFullReview": true,
  "textWordCount": 291,
  "archivePath": "data/archives/reviews/fool-for-love-2015/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:15:27.195Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20220701051838",
  "archiveOrgUrl": "http://web.archive.org/web/20220701051838/https://www.nydailynews.com/entertainment/theater-arts/sam-rockwell-nina-arianda-combust-fool-love-article-1.2390493",
  "textIssues": [
    "Word count too low: 291 (min: 300)"
  ],
  "contentTier": "truncated",
  "wordCount": 291,
  "tierReason": "Short text (291 words)"
}