{
  "showId": "romeo-juliet-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2024/10/24/romeo-juliet-star-crossd-lovers-in-star-crossd-for-our-time-production/",
  "publishDate": "2024-10-24T22:56:02",
  "fullText": "Apparently, the conjunction “and” has become old hat these days, hardly in synch with our current  youth culture, at least when it comes to anything William Shakespeare-related. The musical & Juliet, running on Broadway for some time, replaces “and” with the ampersand, and now what for centuries has been formally known as The Tragedy of Romeo and Juliet is joining & Juliet on the Great White Way without an “and” but with a plus sign as Romeo + Juliet.\n\nThe revival might be categorized as one of the “for our time” productions of classics we’re habitually handed these noisy days. Directed by Sam Gold—who rarely approaches a revival without shaking it up like a mishandled martini—this Romeo + Juliet treats the Bard as if in 2024 he’s running the risk of becoming embarrassingly passé. Gold is one of a growing revival-director contingent out to prove they understand the expectations of this year’s up-to-the-cool-minute audiences.\n\nHow does he fool with The Tragedy of Romeo and Juliet to the extent that for much of it he seems to be helming The Comedy of Romeo and Juliet? Gold bombards the audience with a reworking short on poetry and long on physical and vocal horseplay.\n\nExcept for the performance of Kit Connor, that is. The twenty-year-old Connor, best known as the bisexual Nick in Netflix’s Heartstopper, has been on film or stage since he was eight; he speaks his lines, as Hamlet demands, trippingly on the tongue. Buff as any Romeo has likely ever looked, he’s marvelous throughout. Born in London’s Croydon neighborhood, perhaps he has an innate DNA understanding. He looks to have a grip on it. Note especially his chin-up in the balcony scene. Not spoken, of course, it’s one of his myriad highlights.\n\nMost of his fellow cast members, however, speak the lines not trippingly but as if tripping over them. Rachel Zegler, so effective as Maria in Stephen Spielberg’s recent West Side Story—therefore already having been a contemporary Juliet—doesn’t do nearly as well now. She treats rhymed iambic pentameter as if it’s intended to be sing-songed. Moreover, from the git-go her supposedly innocent 14-year-old Juliet Capulet comes across as a red-hot mama.\n\nAmong her colleagues, all ready to expend endless  undiminishing energy, the recited results are mostly less than a true appreciation of the poetic text. For one instance, what Gabby Beans does with Mercutio’s Queen Mab speech borders on travesty. From start to finish she’s gesticulating for laughs, as if the doomed Montague’s mesmerizing declaration is a stand-up’s shtick.\n\nIn catering to the patrons, whom Gold obviously expects will in large part represent Gen Z, he stages a Shakespearean rock concert. The audience enters to music, while many players, skimpily attired by Enver Chakartash, get jiggy. Some ticket buyers may think they’ve already seen this pre-show routine at the still-going Cabaret dust off. (The movement direction and choreographer is Sonya Tayeh.)\n\nThe flibbertigibbet (Shakespeare includes the word in King Lear) production is placed in the round and has the actors running up and down stairs, calling from pathways above the seats, and providing other kinds of surround-sight-and-sound presence. The above-mentioned balcony scene doesn’t take place with a balcony—heaven forbid!—but with Juliet on a bed that drops from on high.\n\nWooing her, Connor gets himself hither and thither in a complete 360-degree jog, the routine all but thoroughly detracting from the dialogue’s romantic beauty. Whether spectators take the words in or merely absorb the effect is up for grabs. Throughout, this is true of much, if not most, of Shakespeare’s one-time deathless words.\n\nIt needs be said that not only is music wafted from before the action gets going, it’s also heard during the one intermission and repeatedly in both acts. There’s even a moment in act two when Gían Pérez—so strong this past summer as both Dromios in the Public Theater’s Comedy of Errors—shouts out for a version of Janell Monáe’s “We Are Young.” He doesn’t get it, but it does give him the opportunity to lard the f-word into the oh-so-contemporized proceedings. All music is provided by 11-time Grammy-winning Jack Antonoff somewhat below his Bleachers band best.\n\nSince designer dots generally keeps Romeo + Juliet furnishings at a minimum, an unusual furnishing is draped at one end of the stage. Positioned in Romeo’s supposed bedroom is a large stuffed animal whose legs the love-besotted supine hero pulls around him for several seconds. In addition, at least one metal cart pushed around the stage is stuffed with more stuffed animals. The production is so stuffed-animals-possessed that even the lobby columns are adorned with them. Perhaps they’re metaphors for the stuffed-animal portrayals the acting ensemble is offering.\n\nA last impression: As this Romeo + Juliet is wrought “for our time,” the purpose is carried through everywhere under Isabella Bird’s lights and by Cody Spencer’s sound. For one particularly notable example, check out Drew Leary’s credit for what ordinarily would be “Fight Director.” On the Playbill’s title page his credit is “Violence.”\n\nOh, yes, this revival does everything it can to reflect the unfortunate time in which not only the Montagues and the Capulets but we, too, are living. Somehow, it’s sad to be confronted with the news that the violence so stealthily and widely afflicting our society today has infiltrated so far as to include treating Shakespeare’s text violently.\n\nRomeo + Juliet opened October 24, 2024 at Circle in the Square and runs through February 16, 2025. Tickets and information: romeoandjulietnyc.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars"
}
