{
  "showId": "romeo-juliet-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2024/10/24/romeo-juliet-shakespeare-for-the-tiktok-generation/",
  "publishDate": "2024-10-24T22:57:29",
  "fullText": "Brat summer may be over, but it’s alive and well inside Circle in the Square, where it looks like a scrappy group of drama kids are putting on a show, Mickey and Judy-style.\n\nOf course, Mickey and Judy never brought their own BORG. (For those unfamiliar with the TikTok drink trend, the Black Out Rage Gallon is a plastic gallon-size jug that mixes flavored water, vodka or another spirit, and electrolytes. Consider it your own personal portable party punch.) Grab your emotional support stuffed animals; this isn’t your grandma’s Romeo and Juliet. This isn’t even Baz Luhrmann’s Romeo and Juliet. It’s a Gen Z Romeo + Juliet, and director Sam Gold’s plan is working—at least marketing-wise. Look around the theater and you’re likely to witness one of the youngest audiences you’ve ever seen at a Broadway show.\n\nMany of them are there to see Kit Connor, the dynamic young English actor playing Romeo, as evidenced by the many screams that greet his entrance. (If Netflix gets a spike in streaming for the coming-of-age teen drama Heartstopper, in which he stars alongside Joe Locke and Olivia Colman, the platform can thank R+J.) They’re equally besotted with his Juliet, Rachel Zegler, star of the upcoming animated and live-action fairy-tale films Spellbound and Snow White, respectively; you might also have seen her as Maria, aka the Juliet role, in the 2021 West Side Story movie musical, directed by Steven Spielberg. The stage door, as you can imagine, is a scene.\n\nGold seems to have an affinity for Circle in the Square; it served his intimate productions of Fun Home (for which he won a Tony) and An Enemy of the People extremely well. The in-the-round space demands a small, at least in Shakespeare terms, cast, so he’s used only 10 actors to play all the parts; but double- and even triple-casting has its pitfalls. Those not familiar with the story of the star-crossed lovers are likely to be baffled when they see the same actor, the wonderful Gabby Beans, Tony-nominated as Sabina in 2022’s The Skin of Our Teeth, playing Romeo’s pal Mercutio and the benevolent Friar Lawrence. (Perhaps that’s why at one point Beans says “I’m the Friar” before shifting roles. Or maybe it’s just a comic bit.) Tommy Dorfman plays the pivotal roles of Juliet’s Nurse and Juliet’s cousin Tybalt, but she captures neither the Nurse’s depth nor Tybalt’s single-minded hatred for all things Montague. If we don’t see the fire behind Tybalt’s eyes, we don’t comprehend the gravity of this whole Sharks-Jets—sorry, Capulets-Montagues—feud.\n\nThe production has style to spare: Isabella Byrd’s super-saturated mood-ring lighting; Enver Chakartash’s fast-fashion costumes (extra points for Romeo’s mesh tank top and sequined party pants); original synth-pop songs from 11-time Grammy winner Jack Antonoff, which, smartly, give Zegler a change to sing. Gold has also pared the text down to the bare minimum, excising, among other things, Romeo’s parents and the Act 5 scene where Romeo kills Paris just before killing himself—a smart cut, because no one wants to see Romeo kill anyone else. (One thing he could have cut: the onstage vaping that smells like rancid Froot Loops.) Are the piles of teddy bears a bit much? Probably. But to each generation its own. And if plushies are your thing, you can buy one at the merch stand.\n\nThe most gorgeous moments in this Romeo + Juliet are the simplest, when all the noise falls away and it’s just Connor and Zegler: their first meeting, when they spontaneously proclaim their love in a shared 14-line sonnet; the famous Act 2 balcony scene, a positively swoon-worthy moment that no future production should ever attempt to re-create; their too-brief moment of post-wedded bliss. As Gertrude wisely commented in Hamlet: “More matter with less art.”\n\nRomeo + Juliet opened Oct. 24, 2024, at Circle in the Square and runs through Feb. 16, 2025. Tickets and information: romeoandjulietnyc.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
