{
  "showId": "romeo-juliet-2024",
  "outletId": "observer",
  "outlet": "Observer",
  "criticName": "David Cote",
  "url": "https://observer.com/2024/10/review-juliet-is-fire-romeo-got-mad-rizz-in-this-shakespeare-glowup/",
  "playbillVerdictUrl": "https://observer.com/2024/10/review-juliet-is-fire-romeo-got-mad-rizz-in-this-shakespeare-glowup/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "nyc-theatre",
    "bww-reviews"
  ],
  "nycTheatreExcerpt": "\"Looking back on his Hamlet, Othello, Lear, Macbeth, I'd say Gold has a mixed track record with the major tragedies (watch out, Titus!). This one I'll remember fondly.\"",
  "contentTier": "needs-rescrape",
  "tierReason": "Only aggregator excerpts available",
  "showScoreExcerpt": "\"...director Sam Gold's hyperpop reimagining of 'Romeo + Juliet.'\"\n\nRead more",
  "rejectedAt": "2026-02-04T13:36:26.643Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be a truncated web snippet or navigation element, not actual review content that can be evaluated.; openai: The text provided is an incomplete excerpt with no evaluative content or verdict about the show.; gemini: This is a single line of text that does not constitute a review. It's just a description.; kimi: The provided text is merely a descriptive fragment ('director Sam Gold's hyperpop reimagining of Romeo + Juliet') with no evaluative content, critical opinion, or recommendation regarding the show's quality. It functions as production context rather than a review.",
  "promptVersion": "5.2.0",
  "bwwExcerpt": "Apart from the Zoomer window dressing, Gold engages in thoughtful and amusing double casting. Sola Fadiran plays both Capulet and Lady Capulet, neatly distinguishing between the husband and wife without overdoing gender stereotypes. Capulet’s angry rant at the recalcitrant Juliet is especially terrifying. The absolutely electric Tommy Dorfman is a study in opposites as Juliet’s daffy, chatty Nurse and ice-cold killer Tybalt. Gían Pérez takes on various clown roles, such as the douchey Paris and feckless Peter. The always-stunning Gabby Beans plays both Mercutio and Friar Lawrence with tremendous panache and humor. Both characters think they know what’s best for Romeo yet end up hastening his self-destruction. Beans’s Mercutio is an acid-tongued stoner perpetually in shades, whereas the friar is a gentle, optimistic soul. She juggles a third character speaking Chorus lines and delivering exasperated edicts from the Duke of Verona. The first act ends as a bloody brawl on a bed of flowers an alarming juxtaposition of brutality and romance. Choreographer Sonya Tayeh gives the movement her signature mix of muscularity and abandon. In the final scene (a bit rushed perhaps so Gold could keep the action more or less at two hours) Romeo and Juliet die splayed over each other. Their cruciform positioning mirrors the giant LED crucifix against the wall behind the DJ. A pretty tableau, but nothing terribly deep. You could say the same of other directorial flourishes, but they’re easily overlooked, since the language is well-delivered and the ensemble appealing. It’s the least boring or cringe Shakespeare I’ve seen in a long time.",
  "bwwScore": 8
}
