{
  "showId": "romeo-juliet-2024",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Trish Deitch",
  "url": "https://variety.com/2024/legit/reviews/romeo-and-juliet-review-kit-connor-rachel-zegler-broadway-1236189568/",
  "playbillVerdictUrl": "https://variety.com/2024/legit/reviews/romeo-and-juliet-review-kit-connor-rachel-zegler-broadway-1236189568/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "You'd think in a world so divided by war and pain as ours, a story about ill-fated young lovers torn apart by their families' senseless but devastating feud would be treated with more gravitas than director Sam Gold treats it in his somewhat vulgar Broadway adaptation of Shakespeare's \"Romeo and Juliet.\"\n\nThe Bard's \"Romeo and Juliet\" is a somber play: The audience is told from the very start that the lovers will die tragically, and they're told why. So no matter how sweet their first kiss, or heartbreaking their two nights of youthful romance, there's a pall hanging over the play. Both Romeo and Juliet have terrible premonitions on the night they meet, so the vibe couldn't be clearer.\n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nBut Gold's \"Romeo + Juliet,\" while using Shakespeare's language, feels like it's designed to draw in tweens, teens and theater-averse adults who might not otherwise be interested in Shakespeare; the trick is to woo them and then keep them in their seats with a fun hipster spectacle led by a British TV heartthrob (Kit Connor from \"Heartstopper\") and a movie star with good pipes (Rachel Zegler, from Steven Spielberg's \"West Side Story\"). Throw in a couple of original tunes by singer-songwriter Jack Antonoff and a gaggle of young actors in high-tops and baggy jeans humping teddy bears and dancing to club music, and you've got two hours of fun. Who needs tragedy or relevance when you've got pop music and disco balls?\n\n \n Popular on Variety\n\nAnd the production is fun: The actors use the in-the-round theater to its fullest, performing from the rafters and in every corner. (Although Connor running around the theater expressing his love for Juliet to audience members is preposterous, it's also funny.) Juliet's balcony, designed by dots, is a single bed that appears from the ceiling like a four-poster swing. At one point the floor opens like a book to reveal a bed of flowers for Romeo to lay in, thinking of his love.\n\nEnver Chakartash's costumes are inventive, too: Romeo wears a gold-sequined outfit to the Capulet's party where he sees Juliet for the first time, and it sparkles in Isabella Byrd's flashing lights. Juliet wears jean shorts and Doc Martens at one point, and pink bike shorts as pajama bottoms.\n\nAlthough the production has a heartbeat, it's missing a heart. Connor is adorable in \"Heartstoppers,\" where he plays a high school jock who falls in love with a skinny, unconventional boy, but that's the same energy he brings to Juliet — he's a goofy puppy. When the shit hits the fan, though — when his best friend, Mercutio (Gabby Beans), is murdered by Juliet's cousin, Tybalt (Tommy Dorfman) — Connor doesn't register the pain of the loss, but stands dumbly on the stage. When he kills Tybalt in revenge, the moment is empty of real feeling. In the moments after that — when he's exiled and so must leave his love; when he discovers Juliet is dead; etc. — there is no heartbreak at all. There's not a wet eye in the house.\n\nZegler is competent as Juliet, more like a teenager in a sitcom who has to decide what to wear on a date to the malt shop than a girl who has accidently fallen in love with her father's enemy.\n\nIt’s early in the run, and it's possible that Gold spent less time with his actors on the second act of the play. But it's also possible that it takes real genius to pull off the death scene in \"Romeo and Juliet.\" The audience has to believe that these are not just two children caught up in the early days of first love, but that they're fated by the Gods and the universe to have met and to have died. What we have here instead is a fun night out and a hangover.",
  "isFullReview": true,
  "textWordCount": 666,
  "archivePath": "data/archives/reviews/romeo-juliet-2024/variety--trish-deitch_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:02:01.953Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 666,
  "tierReason": "Full review text"
}