{
  "showId": "romeo-juliet-2024",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Aramide Tinubu",
  "url": "https://variety.com/2001/legit/reviews/romeo-juliet-1200466926/",
  "publishDate": "October 25, 2024",
  "fullText": "Whatever square the blank oval windows of set designer John Gunter's pale palazzo front are supposed to oversee, it isn't quite in the Verona of Shakespeare's \"Romeo and Juliet,\" where hot-blooded Italians, constrained by hierarchy, tradition and proximity, view each other with inflammatory suspicion.\n\nWhatever square the blank oval windows of set designer John Gunter’s pale palazzo front are supposed to oversee, it isn’t quite in the Verona of Shakespeare’s “Romeo and Juliet,” where hot-blooded Italians, constrained by hierarchy, tradition and proximity, view each other with inflammatory suspicion. Instead, the play is cast in the theatrical never-neverland of multicultural America, where people of many races stand in living moment, stripped of the antecedent that flavors their identity.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Taylor Swift Dances and Dates a Rock in ‘Opalite’ Music Video With Domhnall Gleeson, Greta Lee, Jodie Turner-Smith and More \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Class on Hitmaker Max Martin's Work to Be Introduced at New York University’s Clive Davis Institute of Recorded Music\n\nMost of the time this kind of experiment doesn’t work, because most people who try it fail to realize that universality is gained through the specific, not the general. In this “Romeo & Juliet,” the Montague family is black and the Capulets are white. But unlike “Othello” or “The Merchant of Venice,” racial antagonism isn’t a subtext of the play. So the background element of family wrath tends to shrivel, despite a certain amount of expository finger-pointing, and with it the sense of alarm we feel at watching these kids play with fire.\n\nInstead, the emphasis on Romeo’s retribution falls on his murder of Tybalt — and it works; he’s a fugitive trying to make it back to the girl he loves.\n\nIn general, the production moves solidly through the binding force of director Peter Hall’s theatrical intelligence. Some of the performances are uneven, but the ensemble is never ragged; moments in the production, particularly in the first act, feel flat.\n\nBut the sweeping, intricate pace never sags, and language that ranges from the plain-spoken to Elizabethan Shakespeare at his most auto-intoxicated neither tangles up nor pales from familiarity.\n\nAnd there are specifics, those fresh moments an audience hopes for. The heart-stopping instant when Miriam Margolyes’ Nurse, heretofore a rollicking tea-kettle figure out of Daumier, thinks she’s discovered Juliet dead and doesn’t know what to do about it. Dakin Mathews in Capulet’s fierce patriarchal reproach of Juliet’s mooning teen nonsense. Mark Deakins’ prideful Tybalt, eager for a fight. Any number of affecting touches from Lynn Colleens’ Juliet, caught between teen vulnerability and womanly sensuality, surrendering herself to wherever love will send her, including suicidal grief.\n\nDB Woodside’s Romeo is problematic. He may get it together later in the run, but right now he’s working on a variety of externals, including speech, that don’t blend into a performance that comes from within. Early on he’s over-gestural, ironic (one thing Romeo is not), a touch jive.\n\nBut just when you’re ready to write him off, he flares into a powerful confrontation with Tybalt that seems to offer a key for a performance that becomes stronger and unembellished — even if his speech remains geared to empty sound-studio perfection.\n\nNo small tribute is owed Gunter’s fluid, elegant set and Robert Wierzel’s astute lighting, which captures, for example, the low sharp sunlight of 8 o’clock in the morning streaming through a window.\n\nAnd if this production has its dead spots, the black portion of the cast is magisterial. Most of all, it reminds us of why “Romeo & Juliet” remains a classic tribute to the lyricism of overfull hearts, and love we can long for through others, but not die for ourselves.",
  "isFullReview": true,
  "dtliExcerpt": "Connor and Zegler are perfectly cast as the young lovers, bringing both youthful exuberance and genuine chemistry to Shakespeare's timeless tragedy.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Connor and Zegler are perfectly cast as the young lovers, bringing both youthful exuberance and genuine chemistry to Shakespeare's timeless tragedy.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "nycTheatreExcerpt": "\"Although the production has a heartbeat, it's missing a heart... When he kills Tybalt in revenge, the moment is empty of real feeling. In the moments after that  when he's exiled and so must leave his love; when he discovers Juliet is dead; etc.  there is no heartbreak at all. There's not a wet eye in the house.\"",
  "sources": [
    "web-search",
    "nyc-theatre"
  ],
  "previousUrl": "https://variety.com/2024/legit/reviews/romeo-juliet-broadway-review-kit-connor-rachel-zegler-1236189876/",
  "urlDiscoveredAt": "2026-02-07T09:39:53.462Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 606,
  "archivePath": "data/archives/reviews/romeo-juliet-2024/variety--aramide-tinubu_2026-02-07.html",
  "textFetchedAt": "2026-02-07T09:39:53.469Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "wordCount": 606,
  "tierReason": "Full review text"
}