{
  "showId": "days-of-wine-and-roses-2024",
  "outletId": "amny-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.amny.com/entertainment/theater/review-days-of-wine-and-roses/",
  "publishDate": null,
  "fullText": "Nineteen years after winning a Tony Award for the enchanting and sweeping score of “The Light in the Piazza,” Adam Guettel — the extremely gifted and adventurous composer and lyricist who also happens to be the grandson of legendary composer Richard Rodgers and son of Mary Rodgers (composer of “Once Upon a Mattress”) — has finally returned to Broadway with “Days of Wine and Roses,” another musically literate and individualized work that is far more acidic in sound and style.\n\nOne can’t help but wonder what drew Guettel and playwright Craig Lucas to the 1962 film melodrama of the same name it is based upon, in which Jack Lemmon and Lee Remick play Joe and Kirsten, a married man and woman who fall victim to alcohol addiction, which ultimately ruins their lives and ends their relationship. While Joe relies on the help of Alcoholics Anonymous to stay sober, Kirsten (who never touched alcohol before meeting her husband) finds that she cannot shake her dependence.\n\nThe film (which is often aired on Turner Classic Movies and is currently available using the Watch TCM app) may strike one as the kind of moralizing, heavy-handed, “scared straight” warning about substance abuse to be endured in high school. But if taken on its own terms, it is a brutal and disturbing portrait of helplessness. (When I saw the show over the summer when it premiered Off-Broadway, I was shaking in terror at times.) Ironically, one can purchase an alcoholic beverage from the theater bar and enjoy it during the intermission-less show.\n\nWhile the musical respects the film’s structure and setting (though the location is moved from San Francisco to New York City) and recycles much of the original dialogue, it proves to be one of the relatively few theatrical adaptations that expands upon its cinematic source material, as seen in how the score (which is grounded in mid-century jazz) artfully captures the characters’ circumstances (including the high-flying, euphoric rush of endless cocktails) and subsequent breakdowns and melancholy.\n\nMusically speaking, there is a huge difference between “Days of Wine and Roses” and virtually all of the other musicals to play Broadway in recent years, which generally either have scores of made up of prerecorded pop hits (i.e. jukebox musicals) or original scores that are influenced by contemporary pop or traditional Broadway. In fact, “Days of Wine and Roses” often sounds like contemporary opera. (But don’t just take my word for it. The cast album was just released and is now available for streaming.)\n\nThe compelling production (directed by Michael Greif, “Next to Normal”) stars Kelli O’Hara and Brian d’Arcy James, who shine vocally and dramatically in finely-textured performances. As it happens, 22 years ago, before they went on to become stage celebs, O’Hara and James played opposite each other in a musical adaptation of “Sweet Smell of Success,” another cityscape tragedy that is about vice and is based on a black-and-white film.\n\nHere’s hoping we don’t have to wait another two decades for Guettel to premiere another new musical. In the meantime, “Floyd Collins,” Guettel’s extraordinary first (and probably his greatest) musical, which received a short Off-Broadway run in 1996, is long overdue for a major revival.\n\nStudio 54, 254 W. 54th St., daysofwineandroses.com. Through April 28.\nRead more: Ballers&#8217; Actor London Brown&#8217;s Character Arc",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 550,
  "archivePath": "data/archives/reviews/days-of-wine-and-roses-2024/amny-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:28:59.730Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_read_more_prompt",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250721191009",
  "archiveOrgUrl": "http://web.archive.org/web/20250721191009/https://www.amny.com/entertainment/theater/review-days-of-wine-and-roses/"
}