{
  "showId": "days-of-wine-and-roses-2024",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://cititour.com/NYC_Broadway/Days-of-Wine-and-Roses/1198",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $78\n\t Buy Tickets\n\nCititour.com Review\n    It’s almost irrefutable that one will step into “Days of Wine and Roses,” now at Studio 54 after an earlier run at the Atlantic Theatre Company, wondering why JP Miller’s shattering source material about a couple battling alcoholism – first presented on television in 1958 and then memorably filmed in 1962 – has been musicalized. And full truth be told, you may leave this unusual show without a truly satisfactory answer, but unless you have a heart of stone, you will be moved.\n\nEven then, at the very least, you will be unbearably grateful to have heard the clarion, celestial voices of the wonderful Kelli O’Hara, in her finest stage performance to date as the naïve secretary Kirsten Arnesen, and the sublime Brian D’Arcy James as the more worldly PR man Joe Clay, who fall in love with each other and the bottle.\n\nAdmittedly, we’re asked to suspend a bit of disbelief at the beginning of the show, since O’Hara and D’Arcy James – perfect-looking as they are (especially in Dede Ayite’s stunning period costumes) – are at least a decade or two older than their characters should be. Fortunately, these two actors are so completely compelling from the get-go it barely matters. \n\nFurthermore, as we soon learn, their characters are so obviously fragile despite their outward strength that we can’t help being slowly drawn into their story, which twists and turns on its way through joy and despair to an honest, not-so-happy ending.\n\nIn his first major full score since “The Light in the Piazza,” composer-lyricist Adam Guettel reminds us exactly what can be expressed in song. Among the score’s gems are Kirsten’s self-reflective solo “There Go I,” such haunting, ballads as “Forgiveness” and “As the Water Loves the Stone,” and the jaunty duet “Evanesce.” \n\nAs in “Piazza,” Guettel’s lyrics are often stand-ins for traditional dialogue, while Craig Lucas’ solid book – which is basically faithful to the film – provides just enough background, repartee, and just a touch of exposition.\n\nDirector Michael Greif has dotted his very fluid production with an ensemble of seven actors often scurrying about the many clever sets by Lizzie Clachan, and occasionally executing Sergio Trujilo and Karla Puno Garcia’s minimalist choreography. \n\nOnly three of the supporting performers, however, are allowed to make any significant impression. Byron Jennings is chilling (as usual) as Kirsten’ strict but loving widowed father, willing to do anything for his only child; David Jennings is quite effective as Joe’s no-nonsense AA sponsor Jim; and Tabitha Lawling is endearing as the couple’s daughter, Lila, who learns to be almost completely self-sufficient.\n\nOf course, it’s basically impossible to outshine O’Hara and D’Arcy James, who deserve to drink in every bit of applause they receive after 105 minutes of singing and acting their hearts out in this cautionary tale, which is still sadly relevant after five decades.\n\n    \t    By Brian Scott Lipton\n\nVisit the Sitehttps://daysofwineandrosesbroadway.com/Open/Close DatesOpening 1/28/2024Closing 3/31/2024\nTheatre Info\nStudio 54254 West 54th StreetNew York, NY 10019\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 561,
  "archivePath": "data/archives/reviews/days-of-wine-and-roses-2024/cititour-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:30:09.574Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee"
}