{
  "showId": "days-of-wine-and-roses-2024",
  "outletId": "hollywood-soapbox-john-soltes",
  "outlet": "Hollywood Soapbox (John Soltes)",
  "criticName": "John Soltes",
  "url": "https://www.hollywoodsoapbox.com/review-days-of-wine-and-roses-is-a-heartbreaking-mesmerizing-musical/",
  "playbillVerdictUrl": "https://www.hollywoodsoapbox.com/review-days-of-wine-and-roses-is-a-heartbreaking-mesmerizing-musical/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "Photo: Days of Wine and Roses stars Brian d’Arcy James and Kelli O’Hara. Photo courtesy of Joan Marcus / Provided by BBB with permission. NEW YORK — The new musical Days of Wine and Roses, which transfers to Broadway’s Studio 54 from the Atlantic Theater Company’s off-Broadway space, is a chamber piece that proves to be a powerful vehicle for its two stars, Kelli O’Hara and Brian d’Arcy James. The two actors, Broadway royalty at this point, bring to life a couple who find love and alcohol in mid-century New York. They are enablers of each other’s penchant for drink, and this causes them to descend into the darkest depths of addiction and a momentous struggle to keep their family together, their jobs uninterrupted and their love intact. There are many reasons to welcome Days of Wine and Roses to Broadway with such fanfare. First off, it’s an original musical, featuring a book by Craig Lucas and music and lyrics by Adam Guettel. Yes, there’s source material to the story — a play and movie came before — but this is no jukebox show or well-known IP. It’s a fair bet that many, if not most, of the attendees at Studio 54 will be brand new to this story of heartbreak and debilitating self-destruction. Guettel’s songs are understated and beautiful, with virtually every note sung by O’Hara and James over the course of 105 intermissionless minutes. There are a few theatrical flourishes when the belters get to belt, but for the most part this is emotional, intimate musicality. There is some catchy instrumentation and clever lyrics, all employed to better serve the story and these two central characters. The narrative follows O’Hara’s Kirsten Arnesen and James’ Joe Clay. The two meet at a work party and hit it off, starting a romantic journey that will last many years. Almost immediately, they share a passion for mixing cocktails and cracking a bottle of liquor. Joe is a veteran drinker and convinces Kirsten to follow him down the path. At first, the drinks ease the tension of their budding romance and help dampen the negatives of a tough day at work. Eventually they cannot stop having a few too many, which results in a strained relationship with their daughter (Tabitha Lawing), with Kirsten’s father (Byron Jennings) and with each other. The arc of emotions that O’Hara and James are able to pull off is truly mesmerizing. They are so believable at every stage of this rollicking roller-coaster ride. They exude youth and romance when first talking to each other, and they find love and passion when they grow older and begin a family together. But almost like a shadow that refuses to go away, there’s a drink to be had every few minutes. They exhibit many of the tell-tale signs of alcoholism, especially when their imbibing becomes less of a social lubricant and more of a means to block out the world. There’s no specific reason why they head down this path, but when they do, they find it difficult to change course. Michael Greif directs the production, which has a fitting and simple scenic design by Lizzie Clachan. They utilize the neon signs of liquor stores to maximum effect, and the set is able to seamlessly transition between the couple’s house and the greenhouse of Kirsten’s father. Dede Ayite’s costume design helps transport this plot to the 1950s and 1960s. Strong supporting work from Jennings and Lawing is matched by David Jennings, Tony Carlin, Sharon Catherine Brown and others, but the lasting impression is the touching and unforgettable performances by O’Hara and James. They enliven their characters with honesty and humanity, even when facing an uncertain future and the dread of the sickness that has taken hold of their minds and bodies. Theirs is a descent that is so difficult to watch, but it’s buoyed by an earned reality that taps into the strength (and fragility) of what it means to be human. Days of Wine and Roses is the best new musical of the Broadway season. By John Soltes / Publisher / John@HollywoodSoapbox.com Days of Wine and Roses, starring Kelli O’Hara and Brian d’Arcy James, features a book by Craig Lucas and music and lyrics by Adam Guettel. Directed by Michael Greif. Running time: 105 minutes with no intermission. Currently playing Studio 54 on Broadway. Click here for more information and tickets.",
  "isFullReview": true,
  "textWordCount": 732,
  "archivePath": "data/archives/reviews/days-of-wine-and-roses-2024/hollywood-soapbox-john-soltes--john-soltes_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:11:57.966Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}