{
  "showId": "days-of-wine-and-roses-2024",
  "outletId": "nystagereview-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nystagereview.com/2024/01/28/days-of-wine-and-roses-musical-on-alcoholic-sorrows-shakes-and-stirs/",
  "publishDate": null,
  "fullText": "★★★★☆ Kelli O'Hara, Brian d'Arcy James fine performances highlight Adam Guettel-Craig Lucas tuner. Joe Clay (Brian d’Arcy James), a 1950s-60s corporate pr guy whose duties include what looks like pimping, and Kirsten Arnesen (Kelli O’Hara), an executive secretary, meet not quite cute at a company party. Drink in hand, he works his way around her even though she claims she doesn’t like the taste of alcohol. She does admit to a yen for chocolate, which cues him to order a Brandy Alexander. She sips the cocktail. She deems it “good.” That’s all it takes for them to develop a long-term romance. They marry, become parents and set off on a descent into alcoholism that threatens not only their lives but their daughter’s and Pop Arnesen’s greenhouse business, which is almost destroyed during a disastrous bender Joe goes on. The all but unrelentingly somber tale — right down to a hardly hopeful fadeout — started as a 1958 JP Miller Playhouse 90 teleplay starring Cliff Robertson and Piper Laurie. It became a 1962 film starring Jack Lemmon and Lee Remick. Now it’s an Adam Guettel-Craig Lucas musical seen earlier this season at the Atlantic in an intimate, somewhat chamber musical version. (Lizzie Clachan is the set designer.) It’s moved to Broadway’s not quite so intimate Studio 54, which in its previous incarnation saw plenty of liquor consumed. [Read Bob Verini’s ★★★★☆ review here.] The result is a tough-minded, heart-pounding work that bookwriter Lucas extracted skillfully from Miller’s original script (some of the major scenes appear close to unedited) and to which Guettel inserted a score intricately fusing classical touches with jazz. First gratitude for this Days of Wine and Roses reshuffle goes, however, to leading lady O’Hara, who worked with d’Arcy James 22 years back in the short-run Sweet Smell of Success. When that one closed, she decided she’d like them working together again one day, and saw Days of Wine and Roses as an ideal opportunity. She got that right. Joe and Kirsten are spectacularly demanding roles. Robertson, Laurie, Lemmon, and Remick registered possibly their best performances in the previous iterations. O’Hara and d’Arcy James, expertly directed by Michael Greif, reach those levels memorably. Talk about running the acting gamut A-to-Z-and-back! Watch and listen to O’Hara in early sequences, intelligent, charming. Watch her in Dede Ayite’s astute costumes become increasingly dependent and careless as Kirsten decides she enjoys matching Joe shot for shot. Watch her when Kirsten retreats to a motel room where she wants only to guzzle and entreats Joe, sober thanks to Alcoholics Anonymous support, to join her. Watch her futile last attempt to return home, still hopelessly dependent on the sauce, still insisting she can’t face life without it. Watch d’Arcy James as goodtime press guy Clay (is his surname a symbol of his malleability?) celebrating every quaff. That’s until he realizes how far down the slurping slippery slope he’s taken Kirsten and him as well as daughter Lila (the wise, endearing Tabitha Lawing) and Pop Arnesen (Byron Jennings, grizzled, stymied). His major transcendent moments are those plundering his father-in-law’s greenhouse in desperate search for a bottle he’s hidden there. A great plus supplied this Days of Wine and Roses is the singing. O’Hara with her operatic soprano (at the Met this season in The Hours) lends ear-dazzling gleam to everything she’d handed, such as “Are You Blue.” Surely, she suspected what chances she’d be granted after earning boffo reviews in the 2006 Guettel-Lucas Light in the Piazza. D’Arcy James owns his strong baritone and uses it to advantage in his recitative-y “Magic Time” opener and later in the scorching “Forgiveness,” another showstopper. Both d’Arcy James and O’Hara deliver Guettel’s best item, “As the Water Loves the Stone” with intensity. That’s not too long after their ebullient “Evanesce,” which choreographers Sergio Trujillo and Karla Puno Garcia nicely enhance. Guettel’s notable contribution warrants further discussion. It once was the belief that Broadway scores were there to ignite sheet music and record sales, nail radio play, gain entry into the Great American Songbook. Those days have pretty much passed. (When was the last time a Broadway tune hit the Top 40? Is there still a Top 40?) Guettel is one of the newer standard bearers, out strictly to tailor the score to fit the material without one ear fixed on step-outs. This score is, in the best sense, unique. Guettel has said his response to the grim subject matter stems from problems he’s faced. The evidence here seems to reflect as much. Compare this one to his very different Light in the Piazza numbers. Those are easily more melodic, pointedly resonant of the Italian locales. Here he regularly, if not completely, hews to quick outbursts, taut arias, the blunt expressions of two distressed alkies. There are no group numbers, despite an intermittently appearing six-member supporting cast, including David Jennings as Joe’s sincere AA sponsor. One strength of the 90-minute intermissionless piece is its refusal to offer any easy explanation of addiction’s origins, on the assumption that explanations don’t carry much meaning when the alcoholic’s throes are what need to be immediately addressed. When Kirsten and Joe first spend time together at a waterfront, she tells him that she prefers to watch the water farther out. The water immediately below her, she insists, is too dirty. That’s all the rationale needed to set the parameters for this bold, unflinching musical gaze at drinking to cruel excess. Days of Wine and Roses opened January 28, 2024, at Studio 54 and runs through April 28. Tickets and information: daysofwineandrosesbroadway.com David Finkle is a freelance journalist specializing in the arts and politics. He has reviewed theater for several decades, for publications including The Village Voice and Theatermania.com, where for 12 years he was chief drama critic. He is also currently chief drama critic at The Clyde Fitch Report. For an archive of older reviews, go here. Email: david@nystagereview.com.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": 80,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 985,
  "archivePath": "data/archives/reviews/days-of-wine-and-roses-2024/nystagereview-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:39:21.563Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "scoreSource": "extracted-unicode-stars",
  "scoreConfidence": "medium",
  "extractedStars": "4/5"
}