{
  "showId": "days-of-wine-and-roses-2024",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.theaterscene.net/musicals/broadway/days-of-wine-and-roses-the-musical/joseph-pisano/",
  "publishDate": null,
  "fullText": "Posted on February 7, 2024 by Joseph Pisano in Broadway, Musicals Brian d’Arcy James and Kelli O’Hara in a scene from “Days of Wine and Roses: The Musical” at Studio 54 (Photo credit: Joan Marcus) If there’s a saving grace to enduring Days of Wine and Roses as a musical, it’s the opportunity to remind others of its much superior source material about the perils of the bottle. That wouldn’t be the 1962 film co-starring Jack Lemmon and Lee Remick, itself a bastardization of JP Miller’s sterling teleplay from several years earlier that unmatchably paired the harrowing Cliff Robertson and Piper Laurie. Like their cinematic predecessors, the creators of the shiny new stage adaptation have prioritized style over substance, giving Brian d’Arcy James and Kelli O’Hara, in their turns as the wretchedly besotted couple Joe Clay and Kirsten Arnesen, plenty of chances to look and sound fantastic but not a single moment to perform convincingly. With an almost documentarian intent, Miller’s Playhouse 90 script took late 1950’s television viewers behind the curtain of Alcoholics Anonymous, using Joe’s “share” at an AA meeting to frame the story. Though that plot device was jettisoned for the film, Joe’s AA participation is still pivotal to the big-screen narrative. By contrast, the musical never specifically mentions AA, alternatively providing Joe with a “volunteer” (David Jennings) to impart inspirational advice as he navigates the difficult road to recovery. Perhaps composer and lyricist Adam Guettel wanted to spare himself and co-choreographers Sergio Trujillo and Karla Puno Garcia the tasteless temptation of an AA chorus line. Brian d’Arcy James and Kelli O’Hara in a scene from “Days of Wine and Roses: The Musical” at Studio 54 (Photo credit: Joan Marcus) Reteaming with O’Hara and book writer Craig Lucas for the first time since the 2005 Tony-award-winning The Light in the Piazza, Guettel’s hodgepodge of a score equates jazz with blithe inebriation and opera with soul-crushing regret, a mostly tiresome juxtaposition that includes the gobsmacking discordance of Kirsten drunkenly bebopping around her apartment while vacuuming it. That O’Hara is never less than luminous, coordinated, and note-perfect during this ill-conceived pas seul fundamentally captures what’s wrong with the musical: it’s much too beautiful. Admittedly, however, as the consequences of Joe and Kirsten’s excessive drinking take hold, scenic designer Lizzie Clachan’s glossy urban locales are replaced by humbler settings, both within the city and outside it. But unlike in Miller’s teleplay, Guettel, Lucas, and director Michael Greif (“e” before “i” apparently makes all the difference), have set the floor for Joe and Kirsten’s misery much too high. Beneath the trio’s false bottom is a far more painful and squalid existence that Miller knew was the brutal heart of the matter, including an excised scene Robertson wonderfully underplays and Lemmon tackles aggressively: Joe detoxing in a straitjacket. It’s comprehensible why Guettel was not up for the challenge of writing a song to accompany such a sight. Still, impossible as it may have been to pull off, if a credible adaptation of Miller’s work in either of its Hollywood forms was the honest goal, then that was the assignment. Kelli O’Hara and Brian d’Arcy James in a scene from “Days of Wine and Roses: The Musical” at Studio 54 (Photo credit: Joan Marcus) Miller’s unflinching teleplay begins bleakly, with both Joe and Kirsten already alcoholics, and descends from there until a forever fragile and solitary hope is bitterly achieved through tragedy. As for the cause of the couple’s substance abuse, Miller initially depicted it not simply as a genetically predisposed sickness but also as a symptom of a postwar American prosperity whose insidious social costs have transformed Joe into a self-loathing corporate shill and Kirsten into a rich man’s pretty little secretary. It’s actually loneliness and despair that are at the root of their mutual attraction, which the booze nourishes and, despite its mind-obliterating reputation, never lets them forget. Adhering to the creative compromises of the film, the musical also sacrifices this emotional and historical depth for a contrived romance undone by Joe’s foisting of Brandy Alexanders on the previously teetotaling Kirsten. At the outset, it’s all part of a glamorous, sophisticated whirlwind that, especially when accompanied by James and O’Hara’s enviable elegance, comes across as a stern rebuke to the casually dressed patrons in a Broadway theater imbibing from their sippy cups. After Joe and Kirsten elope–a most unwelcome surprise for the latter’s virtuous Norwegian father (Byron Jennings)–the “good times” keep rolling at Joe’s insistence, despite the domestic responsibilities of marriage and a daughter (Tabitha Lawing). As with the teleplay and film, the musical has Joe manipulate Kirsten into choosing their alcoholic bond over motherhood, malignantly denying his mid-century American wife the only salvation available to her. Brian d’Arcy James and Kelli O’Hara in a scene from “Days of Wine and Roses: The Musical” at Studio 54 (Photo credit: Joan Marcus) Unfortunately, much like the film, Lucas adds nothing to Miller’s original work that doesn’t diminish it, which is an unscalable problem for O’Hara who suffers the brunt of Lucas’ lesser words when trying to make sense of Miller’s good ones, particularly the heartbreaking line, “The world looks so dirty to me when I’m not drinking.” The ugliness Kirsten sees around her certainly is palpable in Miller’s teleplay and, to a significantly lesser extent, in the film, but Lucas himself completely fails to comprehend it, dramatically focusing too much of his book instead on whether or not Kirsten will choose recovery, too, for the sake of her child, as if she weren’t long past that choice. James doesn’t fare much better in his role, with Lucas uninventively ascribing Joe’s alcoholism to PTSD from service in the Korean War. You could, of course, spend time trying to figure out how a middle-aged guy in the 1950s was unlucky enough to get drafted into that conflict while somehow managing to avoid World War II. But then, you would be giving the script a lot more realistic thought than anyone associated with the musical did. Days of Wine and Roses: The Musical (through March 31, 2024) Studio 54, 254 West 54th Street, in Manhattan For tickets, call 833-274-8497 or visit http://www.daysofwineandrosesbroadway.com Running time: one hour and 55 minutes with no intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1037,
  "archivePath": "data/archives/reviews/days-of-wine-and-roses-2024/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:45:43.386Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}