{
  "showId": "days-of-wine-and-roses-2024",
  "outletId": "theaterpizzazz-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theaterpizzazz.com/days-of-wine-and-roses-love-danger-abandon/",
  "publishDate": null,
  "fullText": "Theater Review by Carole Di Tosti . . . .\n\nIn its iconic exploration of alcohol’s seductive toxicity, Days of Wine and Roses (the Musical), directed by Michael Greif, is even more searing and poignant in its transfer to Broadway from its initial premiere at the Atlantic Theater Company. Adapted from JP Miller’s 1962 film and original 1958 teleplay, Days of Wine and Roses the Musical is running at Studio 54 for a limited engagement through April 28. It is a must-see that is superbly performed.\n\nThe duo of Craig Lucas and Adam Guettel, who created the award-winning The Light in the Piazza, engage our interest in the attractive, self-possessed Kirsten and Joe (Kelli O’Hara and Brian d’Arcy James), who meet at a work event in 1950s New York City. In Lucas’ tightly wrought book and Guettel’s dynamically charged music and poetic lyrics, we are drawn to Kirsten and Joe’s love story. However, we watch with growing alarm as their drinking life, magnified by the sensual allure behind whiskey, overwhelms their stability and success.\n\nIn the 1950s, many like Kirsten’s father, Arnesen (the fine Byron Jennings), didn’t recognize or understand alcoholism as a disease, where the susceptible abandoned their rational sensibilities to daily seek the initial heightened sensory pleasures that, over time, devolved to chaotic, destructive behavior. Raised in a non-drinking home, Kirsten doesn’t know her vulnerability until Joe guides her into the magical realm of feeling’s indulgence, and a fabulous new world of enjoyment opens for her.\n\nWisely, Lucas and Guettel focus on alcohol’s deliciously fun aspects that bond Kirsten and Joe in the exuberance of love’s adventure, where seeking the high becomes indistinguishable from the exhilaration of finding love and pleasure in each other. They move beyond acquaintance, (“Magic Time”), where Kirsten’s edgy jokes stir Joe to apologize for his objectification of her. Finding Kirsten more forward-thinking than the average “gal,” she intrigues him to establish a relationship (“The Story of the Atlantic Cable”).\n\nFrom then on, their drinking merges with the exciting danger of romance, indulgence, and intimacy (“There Go I” and the profound “Evanesce”). With an alcoholic buzz, Kirsten and Joe, once “stranded at sea,” are a “team” and everything is possible.\n\nWith sensational, spot-on authenticity, O’Hara’s Kirsten and d’Arcy James’s Joe soar into the delights of the buzz, as they expand the ever-increasing freedom of losing control, their sensibilities overcome with boozy elation. Joe sings rhythmically, echoing his emotional state: “I’m flying in the ocean, swimming in the air.” Kirsten spins parallel beats singing, “I’m dowsing in the desert, and I don’t hardly care.” Importantly, they share the same dynamic, melodic chorus, “‘Cause I have you now, and you are all I need.” Guettel’s music captures the seductive ebullience of inebriation as falling in love.\n\nAlcohol and the passion of their own personalities impulsively drive them to Arnesen late one evening for introductions and the announcement of their marriage. The terse, remote Arnesen is not impressed by Joe. They leave unsettled, as if they’ve been censured. Of course, they’ve been carousing, and Kirsten’s father disapproves.\n\nTheir feelings of completion are fueled by their drinking life, which doesn’t leave much room for baby Lila (“Sammen I Himmeln”). When Joe returns at 2 AM, smashed from entertaining clients, he is ready to relax with his Kirsten. However, she reminds him that she shouldn’t pollute her milk with whiskey. The situation infuriates the drunken Joe. He is soothed only when Kirsten joins him, so they can rekindle their special bond (“As the Water Loves the Stone”). The emotional drama the actors create in this number is ruefully, powerfully heartbreaking.\n\nWhat initially is success, romance, and intimacy searching for the high, after seven years devolves into emotional and psychological decline. O’Hara and d’Arcy James nuance the declension specifically and authentically with terrific clarity. Lila (Tabitha Lawing), is forced to take care of herself and parent Kirsten, while Joe, who has been demoted, is sent to Texas. In a terrifying sequence, brilliantly acted by O’Hara, we note her frenetic, rollercoaster emotions from happiness to depression, superbly rendered to Guettel’s jazzy “Are You Blue,” then the slower more melodic “Underdeath.” Blacking out, Kirsten nearly kills herself and Lila.\n\nKirsten and Joe are forced to stop drinking, move with Lila to Arnesen’s, and work in his greenhouse (beautifully fabricated by Lizzie Clachan’s scenic design). As we are immersed in their relationship and empathize with them, we question their progress. Two months after sobriety, they “fall off the wagon.” They need help. Will they ever receive it to change?\n\nLucas’ book presents the danger of their condition heightened by Guettel’s music. Will this couple and their child survive? Addiction and alcoholism are never mentioned. Even Jim Hungerford (David Jennings), who befriends Joe (AA is suggested but not identified), never references the disease.\n\nThe creative team, along with the previously mentioned Lizzie Clachan, effects the fine transfer to Studio 54. These include Kimberly Grigsby (music direction), Sergio Trujillo and Karla Puno Garcia, Dede Ayite (costume design), Ben Stanton (lighting design), Kai Harada (sound design), and David Brian Brown (hair and wig design).\n\nThis is a haunting, striking production. Don’t miss it.\n\nDays of Wine and Roses. Through April 28 at Studio 54 (254 West 54th Street, between Broadway and Eighth Ave). www.daysofwineandroses.com\n\nJoanne & Bernie Furshpan\nJane H. Goldman\nJamie deRoy & friends\nJudy Stewart\nJudy Davis\nCarol Ostrow\nAmerican Popular Song Soc. (APSS)\nJanet Fein\nAlyce Finell\n\nYour donation will help us to bring you the latest in NYC theater and cabaret. DONATE TODAY!\n\nJoin our mailing list to receive the latest news and updates from Theater Pizzazz.\n\nJoin our mailing list to receive the latest Theater Pizzazz news.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 946,
  "archivePath": "data/archives/reviews/days-of-wine-and-roses-2024/theaterpizzazz-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:45:36.298Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250316201651",
  "archiveOrgUrl": "http://web.archive.org/web/20250316201651/https://theaterpizzazz.com/days-of-wine-and-roses-love-danger-abandon/"
}