{
  "showId": "radio-golf-2007",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2007/legit/reviews/radio-golf-1200556194/",
  "publishDate": "May 9, 2007",
  "fullText": "Super Bowl LX \n \n \n\n \n \n \n \n \n All the ads and trailers from the big game\n\nWinners, snubs and surprises from music's major night\n\nNetflix, Paramount Skydance face off\n\nDisney's new structure ensures Josh D'Amaro will lean heavily on Dana Walden's veteran skill and relationships in Hollywood's creative community.\n\nWall Street seemed to prefer D'Amaro, who has knowledge of parks and attractions, areas of Disney's business that are growing.\n\nThe cast of “Saturday Night Live U.K.” has been unveiled.\n\n Hammed Animashaun, Ayoade Bamgboye, Larry Dean, Celeste Dring, George Fouracres, Ania Magliano, Annabel…\n\nIn February 2011, Jeffrey Epstein was in need of an assistant. He asked his friend Barry Josephson, a producer of the Fox show “Bones,” if he knew of any “amazing women&#8221…\n\nFollowing Joaquin Phoenix’s exit last year, Todd Haynes’ subversive love story “De Noche” is back on track with Pedro Pascal officially set to play a hard-boiled…\n\nEarly reactions are calling the steamy literary romance a \"bodice-ripping crowd-pleaser\" that is \"destined to be a massive hit for Warner Bros.\"\n\nThe two discuss 'Wicked: For Good,' what makes them cry and loving 'The Waterboy.'\n\nThe two on their life-changing 'Mummy' friendship, loneliness and learning to stop trying so hard.\n\nA Variety and iHeartRadio Podcast\n\nRachel McAdams thrives on a desert island in Sam Raimi's twisted survival thriller. Going back to his roots, Raimi wickedly flips the dynamic between a number cruncher and her nightmare boss.\n\nIn a mockumentary that plays it straight, Charli xcx is teamed with a doofus director (Alexander Skarsgård) who wants to clean up her image. But why would any version of Charli xcx say yes?\n\nBrett Ratner's First Lady documentary is a cheeseball infomercial of staggering inertia. There's no drama to a film that should have been called \"Day of the Living Tradwife.\"\n\nThe first feature by the YouTube gamer personality Markiplier is a murky sci-fi horror tale that confines us to a midget submarine. The claustrophobic perils are plentiful but wear thin.\n\n'Interior Chinatown' Struggles to Turn an Allegorical Novel Into a Show\n\nHBO Prequel Series 'Dune: Prophecy' Capably Tailors the Epic Franchise to Television\n\nTaylor Sheridan's 'Landman' Gives the West Texas Oil Fields the 'Yellowstone' Treatment\n\nEddie Redmayne and Lashana Lynch's 'The Day of the Jackal' Is an Exhilarating Assassin Thriller\n\nBillie Eilish and producer Finneas keep up their winning streak with a surprising and intimate third album.\n\nChildish Gambino's latest is a masterpiece, and a kaleidoscopic showcase for his seemingly endless talents.\n\nVince Staples searches for light on his new album, his most vulnerable project to date.\n\nDua Lipa's new album is a joyous blast of pop savvy.\n\nSam Gold's production is an actorly face-off between Jeremy Strong and Michael Imperioli, but the script ultimately let's the audience off the hook.\n\nPatricia Clarkson gives a luminous performance in an otherwise uneven revival of Eugene O'Neill's family drama.\n\nThe stage adaptation has escapism, enchantment and heart, all elevated to new, literal heights that blend theater and cirque.\n\nPopular on Variety\n\n \n \n \n\n \n\n \n \n ‘Joybubbles’ Director Rachael Morrison and Editors Bradford Thomason and Patrick Lawrence on Their Retro Phone Hacker Doc\n \n \n \n\n \n \n Perfection is rarely achieved in movies, but this heaven-sent concert doc hits the sweet spot. Over two days in January 1972, the Queen of Soul, Aretha Franklin — she was 29 at the time — sweeps into the New Temple Missionary Baptist Church in Watts in front of a congregation and testifies to God in song. The blessed thing took nearly half a century to come out because director Sydney Pollack failed to sync the image with the sound. Then digital angels stepped in, and glory, glory, hallelujah!\n\nPopular on Variety\n\n \n \n \n\n \n\n \n \n ‘Joybubbles’ Director Rachael Morrison and Editors Bradford Thomason and Patrick Lawrence on Their Retro Phone Hacker Doc\n \n \n \n\n \n \n Perfection is rarely achieved in movies, but this heaven-sent concert doc hits the sweet spot. Over two days in January 1972, the Queen of Soul, Aretha Franklin — she was 29 at the time — sweeps into the New Temple Missionary Baptist Church in Watts in front of a congregation and testifies to God in song. The blessed thing took nearly half a century to come out because director Sydney Pollack failed to sync the image with the sound. Then digital angels stepped in, and glory, glory, hallelujah!\n\nPopular on Variety\n\n \n \n \n\n \n\n \n \n ‘Time and Water’ Editors Erin Casper, Mark Harrison and Jocelyne Chaput on Capturing the Generational Trauma of Climate Change in Iceland\n \n \n \n\n \n \n Perfection is rarely achieved in movies, but this heaven-sent concert doc hits the sweet spot. Over two days in January 1972, the Queen of Soul, Aretha Franklin — she was 29 at the time — sweeps into the New Temple Missionary Baptist Church in Watts in front of a congregation and testifies to God in song. The blessed thing took nearly half a century to come out because director Sydney Pollack failed to sync the image with the sound. Then digital angels stepped in, and glory, glory, hallelujah!\n\nPopular on Variety\n\n \n \n \n\n \n\n \n \n ‘Undertone’ Editor Sonny Atkins and Colorist AJ McLauchlin on Bringing the A24 Podcast Horror Movie to Life\n \n \n \n\n \n \n Perfection is rarely achieved in movies, but this heaven-sent concert doc hits the sweet spot. Over two days in January 1972, the Queen of Soul, Aretha Franklin — she was 29 at the time — sweeps into the New Temple Missionary Baptist Church in Watts in front of a congregation and testifies to God in song. The blessed thing took nearly half a century to come out because director Sydney Pollack failed to sync the image with the sound. Then digital angels stepped in, and glory, glory, hallelujah!\n\n'Sinners' Dominates With 16 Nods, 'One Battle After Another' Follows With 13",
  "isFullReview": true,
  "dtliExcerpt": "While it may lack some of the blazing intensity of Wilson's earlier work, 'Radio Golf' provides a satisfying capstone to the cycle, with sterling performances and direction that serves the material well.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "While it may lack some of the blazing intensity of Wilson's earlier work, 'Radio Golf' provides a satisfying capstone to the cycle, with sterling performances and direction that serves the material well.",
  "contentTier": "needs-rescrape",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 938,
  "archivePath": "data/archives/reviews/radio-golf-2007/variety--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T17:11:10.541Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "wordCount": 938,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T08:46:30.167Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be a website navigation menu or aggregated content feed from Variety's homepage, not a theater review. It contains fragments about Super Bowl ads, Disney executives, SNL casting, and various unrelated entertainment topics, but no actual review of a Broadway show.; openai: The text provided is a mix of unrelated content, including ads, trailers, and other media topics, with no discernible review of the target show.; gemini: This is a roundup of various movies, TV shows, and music. There is no single review of a play.; kimi: The text is a corrupted concatenation of multiple unrelated Variety headlines, navigation menus, and article fragments (covering Super Bowl ads, TV casting announcements, film reviews, and music albums), not a coherent review of a single Broadway show. It contains no evaluative content about 'Radio Golf' or any identifiable target production.",
  "promptVersion": "5.2.0"
}
