{
  "showId": "my-fair-lady-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2019/01/27/my-fair-lady-benanti-and-burstein-enhance-the-enchantment-of-lerner-and-loewe-classic/",
  "publishDate": "2019-01-27T20:41:25",
  "fullText": "When Lerner and Loewe’s My Fair Lady opened at the Beaumont last April, I opined that it was “absobloominlutely loverly.” It has been charming audiences these many months. Cast members come and go, inevitably; and the show, in these chilly January days, now has newcomers in four of the six main roles. Under normal circumstances, this might set an impeccably conceived production off kilter or more. But the folks at Lincoln Center Theater are not operating under normal circumstances. I found the production to be grand when it opened, albeit with a couple of minor qualms. Now, it is as if that delectable My Fair Lady has been boosted with vitamin shots. What kept us dancing all night, back then, now positively soars.\n\nThe biggest boost comes from Ms. B-12 herself, Laura Benanti. Here is Eliza Doolittle, folks. While her predecessor gave a perfectly satisfactory performance, Benanti is Eliza down to her fingertips: flower girl dirt-soiled at the street-market opening, princess-grade perfect after the Cinderella-like transformation. She has long been celebrated along Broadway as a top-notch singer with an uncanny comedic touch (most recently in She Loves Me, Women on the Verge of a Nervous Breakdown, and Gypsy, not to mention her occasional sidesplitting small-screen cameos as a certain politician’s wife). Here, Benanti is the Eliza of one’s dreams, which makes the production all the more entrancing.\n\nOne can see where we’re at from the start, even before the she starts dreaming about lots of choc’late. Sitting under the portico of the church at Covent Garden, Eliza jokes and japes about the toff who has been surreptitiously copying down her every word and treating her like a draggle-tailed guttersnipe. But when Professor Higgins explains to his scholarly peer Pickering that “it’s ‘Aooow’ and ‘Garn’ that keep her in her place, not her wretched clothes and dirty face,” Benanti’s Eliza is hit by an unexpected thunderbolt: Could he be right! She immediately recovers her equanimity and certainly doesn’t admit her momentary weakness, but that very early moment of unexpected truth drives this Eliza through the evening, and that’s something we haven’t seen before.\n\nNeedless to say, Benanti is enchanting as she sits on a workman’s crate and dreams of a warm room with an enormous chair and all those choc’lates, vengefully wrathful as she dispatches the tormentful professor to a handy firing squad, and proudly (and surprisingly) triumphant as she properly hits her aitches in the tale of “The Rain in Spain.” When Benanti almost immediately thereafter explodes into “I Could Have Danced All Night,” we are dancing—figuratively—right alongside.\n\nA second B-jolt comes from Danny Burstein, who has slipped into Alfred P. Doolittle’s leather dustman cap. His predecessor was a fine and celebrated musical comedy star, but seemed an uncomfortable fit in this low comedy/high wit role. Burstein is successful from the moment he makes his appearance; he doesn’t need to play drunk, lather on an accent, or act anything; we immediately accept him as the real thing. (If Benanti performs with relish—and she does, from curtain to curtain—Burstein offers relish with a dollop of Colman’s Mustard slathered on.) While Burstein handily triumphs with his two Music Hall production numbers (“With a Little Bit o’ Luck” and “Get Me to the Church on Time”), he simultaneously lifts the level of Shavian sophistication in his “undeserving poor” interview with Higgins. Let it also be noted that there seems to be a hint that Doolittle-of-Tottenham-Court and Tevye-of-Anatevka might well be not-so-distant cousins.\n\nWhat happens, you might ask, to Harry Hadden-Paton when his Wimpole Street domicile is invaded by expert Broadway pros? The actor—formerly of Downton Abbey, who made his Broadway debut as Higgins in what is apparently his first musical role—keeps up with them, step by step. I expect that his Higgins grew stronger as he became accustomed to the musical stage in the half-year since the opening; but it appears that the presence of Benanti and Burstein has sparked him altogether. He is now playing on nearly the same level as these prime musical comedy clowns. Allan Corduner, the Pickering of the occasion, is also caught up in the increased pitch and now displays exuberant flair.\n\nAdding to the high charm of the production is Rosemary Harris, dripping class and nobility even while looking sideways at her infuriatingly non-social son. Yes, Ms. Harris—a Tony winner who played Ophelia to Burton’s Othello and Desdemona to Albert Finney’s Hamlet, the latter being the premiere production of London’s National Theatre Company—is 91 in calendar years; which is to say, she was trodding the London boards while GBS was still bent over his typewriter. But every move and moment is carefully sculpted and perfectly executed. The wide expanse of the Beaumont stage—with those wings that go on and on and on—necessitates a significant amount of walking throughout. Don’t even suggest that Harris be offered a cane, wheelchair or strong chorister’s arm; she has it all under control, and appears to be having an altogether grand time (and itching for a couple of dance steps, please).\n\nAn added fillip is provided by the fourth replacement, Christian Dante White. Freddy Eynsford-Hill is something of a blank among the explicitly realized characters of My Fair Lady. His main purpose is to stand, open-faced and naïvely lovestruck, on the street where Eliza lives until the music strikes up and he sings “On the Street Where You Live.” White does this—the acting and the singing—so well as to garner cheers. Those who have watched him since he appeared as one of Kander and Ebb’s Scottsboro Boys (and as one of the two trashy ladies who accuse the boys), and caught him last winter as a perfectly dandy Cornelius Hackl to Bernadette Peters’ Dolly, will be most pleased by his performance as this idle upper-cruster.\n\nBartlett Sher’s staging and the exquisite production he assembled with his long-time design team of Michael Yeargan, Catherine Zuber, and Donald Holder remain in pristine condition; and the music from Ted Sperling’s pit sounds so good that we know we are at a hit from those first eight clarion notes of the overture. This is one of those rare cases when Broadway producers see fit to retain the original orchestrations (these among our most exquisite, by Russell Bennett and Phil Lang). This necessitates hiring an orchestra large enough to play them; and yes, it does pay off in audience enchantment, even if the audience is oblivious to the reason.\n\nSo let’s not see this as a mere replacement cast. The Lincoln Center My Fair Lady is enhanced by the addition of Benanti, Burstein and the others, and the results are even more exquisite than before.\n\nMy Fair Lady opened April 19, 2018, at the Vivian Beaumont Theater. Re-reviewed: January, 2019. Tickets and information: ltc.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "http://nystagereview.com/2018/04/19/my-fair-lady-lerner-loewe-bartlett-sher/"
}
