{
  "showId": "oh-mary-2024",
  "outletId": "culturesauce-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://culturesauce.com/2024/02/08/cole-escola-oh-mary-off-broadway-review/",
  "publishDate": null,
  "fullText": "Conrad Ricamora and Cole Escola in 'Oh, Mary!' (Photo: Emilio Madrid) With the hilarious new play Oh, Mary, which opened Thursday at Off Broadway’s Lucille Lortel Theatre, Cole Escola establishes themself as a comedic genius who’s a worthy heir to earlier Queens of Camp like Charles Ludlum and Charles Busch. Escola, who uses they/them pronouns, both wrote the show and stars as Mary Todd Lincoln, the sort of plus-size heroine that Ludlum and Busch long favored. In this cross between Drunk History and a well-crafted SNL sketch, she’s an overly dramatic alcoholic oblivious not only to the weighty demands on her husband but to the very fact that the nation is at war. (“With who?” she asks more than once and when told, “The south!” replies without hesitation, “Of what?”) Aside from digging up a hidden bottle of hooch, Mary’s chief concern is to return to the stage as a cabaret performer — a passion she once shared with her now-very-much-closeted husband. (“You always said you loved my madcap medlies!” she reminds him.) It’s easy to sympathize with poor Abraham, brilliantly played with straight-man stoicism by Conrad Ricamora, who is distracted not only by the pressures of the Civil War but also by his longing for sexual release, principally with his decidedly male uniformed assistant (Tony Macht). After all, Escola’s Mary is an over-the-top mess whose boozy bellicosity would shame two dozen seasons of Real Housewives. Escola leaps into the role, modulating their raspy clarinet of a voice to get unexpected laughs, contorting their expressive face to punctuate a thought, and flouncing about the set (designed by the collective dots) in a billowy, aptly period-seeming crinoline-supported frock (designed by Holly Pierson). The president tries multiple methods to control his wife, enlisting the help of a chaperone/companion named Louise (Bianca Leigh) whom Mary goes to great lengths to shrug off. Asked about Louise’s whereabouts after she succeeds in ditching her, Mary blurts out, “Why would I throw an entire woman down the stairs? Because it’s hilarious? That doesn’t make any sense…. It was an accident. It could have happened to anybody I wanted to get rid of.” It’s jokes like these that reveal how Escola has taken the camp sensibility of Ludlum and Busch while updating it with the absurdity and contemporary rhythms they honed on the alt-comedy circuit and in TV shows like Difficult People, Search Party and their lo-fi Logo series Jeffery & Cole Casserole. To appease Mary’s cabaret obsession, Abe eventually agrees to hire an acting coach (You alum James Scully, looking irresistibly hunky) in hopes that the lessons will prove enough of a distraction. But Mary’s lust for fame proves indomitable. “I don’t need acting lessons,” she proclaims. “There’s no difference between theatre and cabaret. Theatre is just fewer feathers and flatter shoes.” And indeed, the entire show is building to an over-the-top antihistorical climax — and a medley-laden denouement that would be right at home at the Carlyle. Under Sam Pinkleton’s clockwork-perfect direction, Oh, Mary delivers a solid 80 minutes of gut-busting laughs without overstaying its welcome. The best divas know when to milk a laugh, when to cede the spotlight to a supporting player, and when to get off the stage. Escola knows all this — and they clearly have learned these lessons from the best. In this master class of millennial mayhem, Escola slyly embraces multiple generations of queer comedy and storytelling. This is a serious work that knows how to play. ‘Oh, Mary!’ establishes Cole Escola as the new first lady of comedy (Broadway review)July 11, 2024In \"Theater\" Why Off Broadway is the final destination for many hit shows these daysFebruary 28, 2025In \"Theater\" Best theater of 2024, from ‘Maybe Happy Ending’ to ‘Oh, Mary!’December 19, 2024In \"Theater\" Δ /* <![CDATA[ */ document.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() ); /* ]]> */",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 641,
  "archivePath": "data/archives/reviews/oh-mary-2024/culturesauce-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:41:22.283Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "sourceMethod": "playwright"
}