{
  "showId": "oh-mary-2024",
  "outletId": "EW",
  "outlet": "Entertainment Weekly",
  "criticName": "Christian Holub",
  "url": "https://ew.com/oh-mary-broadway-review-cole-escola/",
  "publishDate": "2024-07-11",
  "fullText": "​ Page Not Found This is not the page you are looking for. We hope you can go about your business by using our menu or search option. By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Accept All Cookies",
  "isFullReview": false,
  "bwwExcerpt": "h as Oh, Mary! did—and my reaction was shared by the rest of the audience, which burst into applause at the end of every scene. Fasten your seatbelts: This 80-minute show is a fast and wild joy ride. Christian Holub, Entertainment Weekly: Oh, Mary! is laugh-out-loud funny from the first moments; though much of the humor comes from Escola’s unbelievable delivery and the slapstick combination of actors on stage. But what makes Oh, Mary! such a fulfilling theatrical experience is that it also has a real message about the dangers of repression, both societal and personal. Letting people express themselves and live their truth may not solve every political problem, but it can certainly make life way more fun. Escola’s doing that, and the rest of us should too. Grade: A- Adrian Horton, The Guardian: The real Mary Todd Lincoln was, by most accounts, erratic, often bedridden by sadness and prone to lavish spending. Not exactly a comic figure, though in the hands of the inimitable Cole Escola,",
  "originalScore": null,
  "assignedScore": 92,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-OH-MARY-Opens-On-Broadway-20240711",
  "textStatus": "partial",
  "textWordCount": 59,
  "archivePath": "data/archives/reviews/oh-mary-2024/ew--christian-holub_2026-01-25.html",
  "textFetchedAt": "2026-01-25T05:00:59.460Z",
  "textIssues": [
    "Word count too low: 59 (min: 300)",
    "Show title not found in text"
  ],
  "textQuality": "excerpt",
  "sourceMethod": "bww-roundup",
  "scoreSource": "sentiment-rave",
  "scoreConfidence": "medium",
  "dtliExcerpt": "“Oh, Mary!” plays even better on Broadway than it did downtown at the Lucille Lortel Theater earlier this year. Experiencing this comedy with a few hundred more theatergoers takes the laughter from boisterous to atomic and the effect is absolutely radioactive.",
  "dtliThumb": "Up"
}