{
  "showId": "oh-mary-2024",
  "outletId": "nystagereview-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://nystagereview.com/2024/02/08/oh-mary-first-lady-mary-todd-lincoln-on-a-sometimes-funny-rampage/",
  "publishDate": null,
  "fullText": "★★★☆☆ Cole Escola writes and stars, Sam Pinkleton directs, Conrad Ricamora is Mary's bamboozled husband All I knew about Oh, Mary! on the way in was this: the Mary of the title would be Mary Todd Lincoln. That slim fact had me wondering why the Oh, Mary! title sounded so much like it should be attached to a sitcom. It wasn’t long before I found out. Perhaps I should also be embarrassed to admit I knew nothing about Oh, Mary! playwright and leading, uh, lady Cole Escola, whose pronouns are they/them. But waiting for the production to begin, I had the distinct impression that many in the audience around me knew very well who they (Escola) were. There was that kind of anticipatory air abounding. (Okay, all right, a reviewer can’t be ahead of the curve on every already acclaimed performer.) Then Cha See’s lights went up, revealing Abraham Lincoln, or as the program has it, “Mary’s Husband” (Conrad Ricamora) and an assistant (Tony Macht). Mary’s Husband interrupts news of the day’s Civil War developments to complain about his wife’s unstoppable rummaging for booze. He exclaims, “The last time this happened she scaled a clock tower, derailed a freight train, and pissed all over the senate floor.” (Are you laughing already? If so, Oh, Mary! is the ticket for you.) [Read Steven Suskin’s ★★★★☆ review here.] Mary’s Husband and assistant soon exiting the smart office (designed by the always clever dots), Mary enters, frantically searching for a bottle she believes her husband has hidden. What follows from that sequence on is, indeed, sit-com-y with an all-stops-out farce edge to it. And as Mary rip-roars through action, the audience, or most of the audience — as I had suspected they might — chuckled, tittered, giggled, chortled, guffawed at just about everything Escola did. I’m obliged to admit I agreed with the jollity during some of the time. Occasionally, playwright Escola had an amusing notion, the most amusing of the dozen or so during the play’s 80 intermissionless minutes being Mary’s having had a past life as — get this — a cabaret performer. (More about that genuinely hilarious twist later.) But Escola made it difficult for me to find all that much funny in a script that seeks hilarity by having Mary Todd Lincoln gleefully blast not only the f-word but also the c-word — one time each. Having a character resort to these obscenities is just about the easiest way to prompt a laugh in the theater these days. And maybe needless to say, Escola gets them, but getting them only further alerts patrons to the base comic zone in which they’re happily laboring. (Does the current state of dumbed-down comedy levels indicate something about today’s shrinking culture? What would Noël Coward say? What would Neil Simon say? Just asking.) To Escola’s credit, they come up with a series of plot pivots that keep the audience guessing right up to a final revelation that demonstrates what they can come up with when thinking on a higher plane. Nevertheless, it would be unfair to give details or even details preceded by spoiler alerts. What can comfortably be said for those eager to join ticket buyers doting on Escola’s broad sense of humor is that Mary doesn’t entirely give up booze-hounding but does agree to take acting lessons with a prominent coach. Mary’s Husband insists on the lessons, though not because he wants Mary to go into acting – rather than cabaret, which he despises. His reasoning is vague. Nevertheless, Mary’s coach does let her know there’s an audition at Ford’s theater for a replacement in Our American Husband. On another diminished front, Mary’s Husband has homosexual longings that at one eye-popping moment take on a Monica Lewinsky aspect. That’s probably enough of everything storyline-wise. On the other hand, Escola has surrounded themself with an accomplished, willing cast, directed with no holds barred by Sam Pinkleton. Chief among them is Ricamora, who’s gruff in his disgust at Mary’s behavior and tormented by those gay lusts of his. As the acting coach of some renown, James Scully throws himself into a part that includes certain extra-curricular activities that cannot be divulged here. Mary’s Husband’s assistant is Tony Macht, understated and slyly effective. Bianca Leigh appears regularly as Mary’s forceful chaperone and makes the most if it. Then, of course, there’s Escola in a black period hoopskirt designed by Astor Yang with no petticoats but affording a couple glimpses of frilly red-and-white panties. They — Escola, not the panties – know who and what they want to be on stage and elsewhere (for examples, Amy Sedaris credits and HBO Max’s Search Party) and follow through with it all. More power to them, I suppose. Since my favorite Oh, Mary! plus is the reference to the often thought mentally challenged first lady as a onetime cabaret icon, I instantly wanted nothing better than to see that intimate-room act. I sat through the frantic goings-on in the unceasing hope that I’d get the opportunity. Did I and the others in that gleeful crowd receive the enormous treat? That won’t be blabbed here. It may be, however, that Escola has already primed themselves an Oh, Mary! sequel: 80 minutes of a giddy ooh-la-la Mary turn, complete with cabaret favorites. How about Mary on Sam Cooke’s “A Change is Gonna Come,” Joni Mitchell’s “Both Sides Now,” and, maybe more pertinent, “Drinking Again”? I cannot wait. Oh, Mary! opened February 8, 2024 at the Lucille Lortel Theatre and runs through May 12. Tickets and information: ohmaryplay.com David Finkle is a freelance journalist specializing in the arts and politics. He has reviewed theater for several decades, for publications including The Village Voice and Theatermania.com, where for 12 years he was chief drama critic. He is also currently chief drama critic at The Clyde Fitch Report. For an archive of older reviews, go here. Email: david@nystagereview.com.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 985,
  "archivePath": "data/archives/reviews/oh-mary-2024/nystagereview-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:47:35.447Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "sourceMethod": "playwright"
}