{
  "showId": "oh-mary-2024",
  "outletId": "NYTG",
  "outlet": "New York Theatre Guide",
  "criticName": "Austin Fimmano",
  "url": "https://www.newyorktheatreguide.com/reviews/oh-mary-broadway-review",
  "publishDate": "2024-07-11",
  "fullText": "Whoops! Page not foundWe're sorry you couldn't find what you were looking for.Return to homeYour experience mattersWe use cookies to personalise your experience, including improving the quality of your show recommendations. By clicking \"accept all\", you consent to our .Accept allReject allMore options",
  "isFullReview": false,
  "bwwExcerpt": "tching up with Escola’s work, let’s hope more people travel all over the world to see Mary’s “short legs and long medleys.” Or at least enough to turn a strictly limited run into a Broadway mainstay. Austin Fimmano, New York Theatre Guide: Together with James Scully as Mary’s handsome drama teacher, Bianca Leigh as Mary’s long-suffering chaperone, and Tony Macht as Abe’s extremely pliant assistant, the entire ensemble elevates very silly jokes into a work of art that keeps you riveted from start to finish. Suffice it to say that when the lights went up after the curtain call, my guest and I agreed we had literally laughed until our faces hurt. Average Rating: 93.5% REVIEW ROUNDUP REAL-TIME ALERTS To read more reviews, click here ! Discuss the show on the BroadwayWorld Forum Buy Tickets to Oh, Mary! Opening Night Coverage Photos: OH, MARY! Takes Its Opening Night Bows On Broadway Photos: Company of OH, MARY! Hits The Red Carpet On Opening Night Photos: Austin Butler, Kaia Gerber, LuPone",
  "originalScore": null,
  "assignedScore": 88,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-OH-MARY-Opens-On-Broadway-20240711",
  "textStatus": "partial",
  "textWordCount": 43,
  "archivePath": "data/archives/reviews/oh-mary-2024/nytg--austin-fimmano_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:10:00.522Z",
  "textIssues": [
    "Word count too low: 43 (min: 300)",
    "Show title not found in text"
  ]
}