{
  "showId": "oh-mary-2024",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Amelia Merrill",
  "url": "https://www.newyorktheatreguide.com/reviews/oh-mary-off-broadway-review-cole-escola",
  "publishDate": null,
  "fullText": "Read our review of Oh, Mary! off Broadway, a new play created by and starring comedian Cole Escola alongside Conrad Ricamora, James Scully, and more. Cole Escola’s fascination with Mary Todd Lincoln is unexplained, but the depressed first lady has nevertheless captured their attention. In Escola’s new play Oh, Mary! at the Lortel Theatre, Escola dons pin curls and Todd’s signature black mourning gown (costumes are by Astor Yang), whirling about as an abrasive, acerbic, altogether immature version of Abraham Lincoln’s wife. Perhaps the fact that Todd is remembered and defined by her relationship to a man led Escola to dramatics – or because a defining moment of her life and legacy came in a theatre. In Oh, Mary!, what Todd wants most of all is to return to the stage. She misses the “madcap medleys” she performed as a “rather well-known niche cabaret legend” before she was first lady and resents that Lincoln won’t tell the public that they met at a cabaret show. Frustrated and pent-up, Mary resorts to drinking excessively, tormenting her caretaker Louise (Bianca Leigh), and negging her husband (Conrad Ricamora, who inspires both laughter and a little revulsion in his bouts of anger). None of this is based in truth, but it’s not not based in truth either. Todd’s mental health problems, brought on by migraines and the loss of her sons (though Escola’s Todd cares not for her unseen children), were well documented. She spent money wildly while the public recorded her every move. She sought alcohol and opium as a balm for her nerves – and though Ricamora’s Lincoln protests, this was simply what you gave so-called hysterical women at the time. Leigh’s sweet but scheming Louise is possibly based on Todd’s dressmaker, Elizabeth Keckley, who wrote a tell-all about the first lady (though Keckley was Black and born enslaved). Tony Macht’s meek but manipulative Simon, assistant (and then some) to Lincoln, may be based on Joshua Speed, Lincoln’s former roommate (and then some). There’s no reason not to queer these historical characters in the name of theatricality and fun, and if my audience is any indication, fans of Escola will eat up every move of Mary’s head. Fandom and pandering aside, the play is funny enough to stand on its own merits, unless you reject the premise of its absurdity. Mary’s desire to return to the stage intensifies as she grows attracted to her new teacher, a certain famous actor (James Scully), but her pride suffers when he degrades her true love. “Think of the subtext; this isn’t a cabaret act,” Mary’s teacher implores her over a scene from The Tempest. Escola’s attempts to make Mary a Shakespearean actor are a comedic highlight (though it’s always a risk to include the Bard’s words in contrast to your own), but here she eviscerates her mentor: “While you were ‘dost thou-ing’ and ‘thine art-ing’ for a cold dinner and a hard cot, I was taking my 10th and 11th curtain calls!” The crux of Oh, Mary! is Todd’s realization that the men in her life seek to undermine her, even when they claim to have her best interests at heart. It is this understanding that grounds director Sam Pinkleton’s production, ridiculous as it may be, in a certain pathos. Oh, Mary! is at the Lucille Lortel Theatre through March 24. Get Oh, Mary! tickets on New York Theatre Guide. Photo credit: Conrad Ricamora and Cole Escola in Oh, Mary! (Photo by Emilio Madrid) Originally published on Feb 8, 202421:00",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"The crux of Oh, Mary! is Todd’s realization that the men in her life seek to undermine her, even when they claim to have her best interests at heart.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "rejectedAt": "2026-02-05T08:22:01.003Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about 'Oh, Mary!' at the Lortel Theatre, which is an off-Broadway production, not a Broadway show.; kimi: The text explicitly reviews the Off-Broadway production at the Lucille Lortel Theatre ('Read our review of Oh, Mary! off Broadway'), not the current Broadway run.",
  "promptVersion": "5.2.0",
  "textWordCount": 585,
  "archivePath": "data/archives/reviews/oh-mary-2024/nytg--amelia-merrill_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:33:27.578Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 585,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "sources": [
    "show-score-playwright"
  ]
}