{
  "showId": "oh-mary-2024",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/ob/02_08_24b.html",
  "publishDate": null,
  "fullText": "As performed by Escola, Mary does, indeed, embody these qualities, and with all the charm of a pit viper, lashing out in ways that even she sometimes seems surprised by. And yet, over the course of 80 minutes punctuated by frequent laugh-and-shudder moments, we come to sympathize with her as a forcibly restricted woman, a victim of the expectations that have been imposed upon her owing to her place in the social pecking order in which everyone's public image is subject to gossip and reproach (not unlike the world of social media and reality television today).\n\nAnd then there is hubby Abraham (Conrad Ricamora, fresh off his stint as Ninoy Aquino in the Broadway production of Here Lies Love), a deeply closeted and horny gay man who, between episodes that bring to mind a variation on the Bill Clinton/Monica Lewinsky White House scandal, can be found bargaining with God, pledging to \"never do anything homosexual again\" in exchange for winning the Civil War and \"keeping my wife from ruining my name.\"\n\nSo there you have it. Two wounded and wounding individuals who lash out at one another in ways that would give pause even to George and Martha from Edward Albee's Who's Afraid of Virginia Woolf?\n\nOf course, \"Mary's husband,\" as Abraham is referred to in the program, has no intention of giving up his sexual exploits with his assistant (Tony Macht). And in order to keep Mary off his back, he enlists both the aid of a chaperone (Bianca Leigh) and the services of an acting coach (James Scully), who is charged with preparing her for a longed-for career on stage, with the intent of merely keeping her occupied in a permanent state of rehearsal.\n\nThe first half of Oh, Mary! is filled with raucous mayhem, and the cast and director Sam Pinkleton (best known as a choreographer, having done the Tony-nominated honors for Natasha, Pierre & the Great Comet of 1812), milk the play for all the low comic farce they can muster. But things really begin to soar when it moves into the realm of theatrical absurdism that carries it to the end, including some surprising and clever moments that turn our Mary into a model of 19th century feminism.\n\nThe cast overall is terrific, with design elements that raise the production above anything you might expect to see in this old stalwart of a West Village theatre. The design collaborative known as dots has created three separate sets; the perfect-period costumes are by Holly Pierson (with Astor Yang providing the gowns worn by Cole Escola); and Cha See's lighting and Daniel Kluger and Drew Levy's sound design are top-notch. And do try to arrive a few minutes early to catch the random crazy quilt selection of recorded music that will put you in the right spirits for this altogether savory production.\n\nOh, Mary!\nThrough March 24, 2024\n121 Christopher Street New York NY\nTickets online and current performance schedule: OvationTix.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 494,
  "archivePath": "data/archives/reviews/oh-mary-2024/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:50:03.418Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "sourceMethod": "brightdata"
}