{
  "showId": "oh-mary-2024",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Nolan Boggess",
  "url": "https://www.theatrely.com/post/cole-escolas-oh-mary-on-broadway-is-a-stupid-masterpiece-review",
  "publishDate": "July 11, 2024",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Cole Escola's Broadway debut in Oh, Mary! is a triumph of absurdist comedy. The show centers on Mary Todd Lincoln in the weeks before Abraham Lincoln's assassination, reimagined as a former cabaret performer struggling with alcoholism.\n\nThe premise involves President Lincoln (portrayed as gay and conflicted) hiring an acting teacher to redirect his wife from drinking and performing cabaret into respectable theatre. The setup allows Escola to explore themes of identity and artistic legitimacy while delivering spectacular physical comedy.\n\nEscola's performance dominates the 80-minute production with feral hog energy—searching frantically for hidden alcohol, throwing furniture, and sustaining inventive slapstick. The supporting cast, including Conrad Ricamora as Lincoln and James Scully as the acting teacher, provides excellent comedic foils.\n\nDirector Sam Pinkleton orchestrates precise physicality, with a single mug generating audience laughter. The design elements—including Cha See's lighting and Holly Pierson's costumes—enhance the show's tonal flexibility between period and contemporary performance.\n\nThe show is also a piece of history. While transferring a peculiar Off-Broadway jewel to a commercial run is not unusual, Oh, Mary! does stand apart from its peers on Broadway. If one were inclined to look for a deeper meaning in Oh, Mary!, it is a rebuttal against the legitimacy, good taste, and straightness of most self-serious art. The fact that this piece of radically queer comedy has become the buzziest show of the season is a hopeful sign of work to come.\n\nOh, Mary! is at the Lyceum Theatre.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-23T23:50:00.000Z"
}
