{
  "showId": "oh-mary-2024",
  "outletId": "thewrap-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.thewrap.com/oh-mary-off-broadway-review-cole-escola/",
  "publishDate": null,
  "fullText": "Skip to content\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\t\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\n\n\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\t\t\n\t\t\n\n\t\t\n\t\t\t\n\n\n\t\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\n\nIt’s unusual in the camp world of drag that you sit through the play on stage to see how it turns out. Usually, it’s more than enough to guffaw at the outrageousness of crossdressing and actors delivering zingers loaded with filthy double entendres.\n\nIn the new play “Oh, Mary!,” playwright and star Cole Escola delivers that whole delicious enchilada &#8212; and, along the way, also manages to reinvent and turn into an inspired comedy the assassination of President Abraham Lincoln.\n\nYou won&#8217;t get more plot than that here, because I sat in riveted suspense on what would happen next. The conclusion genuinely shocked me and created comic pandemonium the likes of which I&#8217;ve rarely experienced in the theater. “Oh, Mary!” had its world premiere Thursday at the Lucille Lortel Theatre, and if you want to get more plot, read the recent New York Times profile of Escola that’s chock full of spoilers.\n\nEscola plays Mary Todd Lincoln, and from the moment this First Lady enters the Oval Office (terrific sets by dots), it’s like watching the last reel of “The Valley of the Dolls” with Patty Duke in full drunken fury. Escola not only brilliantly overacts from the get-go, this performer possesses Duke’s doll-like features, and wig designer Leah J. Loukas has concocted a set of long coiled curls that’s a dead-ringer for what Duke wears in the “Dolls” scene that replicates Judy Garland getting fired from “Annie Get Your Gun.” (That sentence is a test: if you don&#8217;t get it, maybe &#8220;Oh, Mary!&#8221; is not for you.)\n\nIn the world of camp, heterosexuality is the biggest joke of all. Except in “Oh, Mary!” On any other stage, Escola’s Mary would steal the show, but fellow actors Conrad Ricamora and James Scully often snatch it right back. And both actors have the far more challenging role of playing a man who wears trousers. (The lavish costumes are designed by Holly Pierson.) The Playbill credits Ricamora and Scully as “Mary’s Husband” and “Mary’s Teacher,” respectively. Escola is an equal-opportunity offender, and lampoons gay sex even more than the straight variety.\n\nFor anyone who has read “The American People: A History,” it’s clear that this playwright devoured the tome and believed every word Larry Kramer wrote about the 16th president of the United States.\n\nBianca Leigh and Tony Macht round out the cast, which Sam Pinkleton directs with all the subtlety of a wild man wielding a buzzsaw.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 409,
  "archivePath": "data/archives/reviews/oh-mary-2024/thewrap-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:54:43.539Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251116093304",
  "archiveOrgUrl": "http://web.archive.org/web/20251116093304/https://www.thewrap.com/oh-mary-off-broadway-review-cole-escola/"
}