{
  "showId": "just-in-time",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2025/04/26/just-in-time-a-bio-musical-blast/",
  "publishDate": "2025-04-26T21:59:24",
  "fullText": "The star of the new musical at Broadway’s Circle in the Square effectively sets the parameters right from the beginning: “I’m Jonathan, I’ll be your Bobby Darin tonight,” Jonathan Groff self-effacingly informs the audience. And sure enough, the recent Tony Award-winner for Merrily We Roll Along, who doesn’t really look or sound anything like his subject, makes no attempt to imitate Darin in the course of the show. Instead, he celebrates Darin’s love of live performing and the incredible rapport that he had with his audiences. They’re things that Groff shares with Darin to the max, and it’s his sheer joy in putting them over is what makes Just in Time such a blast.\n\nBased on an original concept by Ted Chapin, the show is an obvious labor of love that its star has spent years developing. It gloriously succeeds in its goal of shining a light on Darin, largely forgotten these days despite such smash hits as Mack the Knife, Dream Lover, and Beyond the Sea (the latter providing the title of Kevin Spacey’s badly received 2004 biopic, also very much a labor of love), although the net effect is more a celebration of Groff than Darin.\n\nAnd that turns out to be just fine, since Groff is such an endlessly charming, charismatic and dynamic performer that he often makes the evening feel like a one-man show despite the fact that it has a large supporting cast. And though the theater has been beautifully transformed into the sort of elegant nightclub in which Darin plied his trade in the late ’50s and much of the ’60s, the musical isn’t just a glorified theatrical concert. It’s also a bio-musical in the same vein as Jersey Boys and Beautiful, with a book by Warren Leight and Isaac Oliver that covers many of the bases of Darin’s life and career, albeit in sketchy form.\n\nWe’re thus treated to scenes depicting his relationships with Connie Francis (a radiant Gracie Lawrence, showcasing a killer voice) and first wife Sandra Dee (Erika Henningsen, perfectly capturing her character’s Sandra Dee-ness), as well as the mother whom he adored (Michele Pawk, terrific) and sister (Emily Bergl) with whom he had a sometimes contentious relationship. Late in the evening, there’s also a dramatic revelation about Darin’s personal life that will come as quite a surprise to those who don’t know much about him.\n\nMore interestingly, the evening chronicles the chameleon-like performer’s frequent shifts in musical styles — from rock (“Splish Splash”) to pop (“Dream Lover”) to standards (“Mack the Knife) to folk (“If I Were a Carpenter”) — with numerous digressions along the way. He was also an accomplished actor, receiving an Oscar nomination for his supporting turn in the 1963 movie Captain Newman, M.D.\n\nHis outsized ambitions were fueled not only by his talent, but also his prophetic fatalism that he would die at an early age because of a heart weakened by recurring bouts with rheumatic fever in childhood. That sense of mortality permeates the musical, with Groff occasionally clutching his chest or seeming to nearly collapse as we hear ominously amplified heartbeat sounds.\n\nJust in Time succeeds greatly more as an experience than a cohesive musical, with Leight and Oliver’s book eventually succumbing to typical bio-musical choppiness in its second act as Darin’s personal and professional lives unravel. Much of the writing, though, proves adept, with the combination of dialogue scenes and Groff’s narration benefiting from a breezy cleverness.\n\nIt’s the staging and the star’s performance that truly elevate the evening, however. Alex Timbers’ limber, imaginative direction uses the space fantastically, with a large stage at one end of the theater providing enough room for a terrific big band, another smaller one at the opposite side for more intimate interludes, and cabaret tables in the middle. Groff works the room like nobody’s business, going from one end to the other, wandering into the aisles, and, at one point, standing atop one of the small tables which magically starts spinning. It’s no wonder that he apologizes in advance for the profusion of his sweat and saliva that frequently soaks audience members in the best seats, bringing an all too literal meaning to “Splish Splash.”\n\nThere are sturdy supporting turns by such actors as Joe Barbara, Lance Roberts and Caesar Samayoa, all playing a variety of roles, and the three sexy “Sirens,” embodied by Valeria Yamin, Christine Cornish, and Julia Grondin, sing and dance beautifully. But Just in Time is really all about Groff, who delivers the sort of magnetic star turn that instantly becomes Broadway legend. No, he’s not really embodying Bobby Darin. He’s just being Jonathan Groff, and that’s more than enough.\n\nJust in Time opened April 26, 2025, at Circle in the Square. Tickets and information: justintimebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
