{
  "showId": "the-pitmen-painters-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "http://www.variety.com/review/VE1117943767.html?categoryid=33&cs=1&nid=2580",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Here it is, only the beginning of a new theater season, and Broadway already has a feel-good -- make that a feel-great -- hit in 'The Pitmen Painters.' Scribe Lee Hall draws on the same inspirational themes that served him so well in 'Billy Elliot the Musical' with this heartbreakingly funny play about a group of Northumberland coal miners who in 1934 sign up for a union-sponsored art appreciation course and become the darlings of the U.K. art set. Max Roberts' helming is flawless, and bully for Equity for preserving the extraordinary ensemble of character actors from the original British production.",
  "bwwScore": 10,
  "contentTier": "complete",
  "fullText": "Christopher Connel, Michael Hodgson, Deka Walmsley and David Whitaker in 'The Pitman Painters.'\n\nEverything about this show, from the depressingly bare union hall where the miners meet for their weekly classes to the rough regional dialect with which they assault the tender ears of their upper-class instructor, says: This is real. This is life.In fact, Hall took his inspiration from a book art critic William Feaver wrote about the art collective known as the Ashington Group, whose member artists (reduced in number here for dramatic purposes) took their name from their hometown in Northumberland. In the 1930s, hundreds of mines were operating in this northeastern region, sending more than a million men underground to work 10-hour shifts in the pits.In this gritty environment, it seems a miracle that an insular community like Ashington could produce a bona-fide talent like Oliver Kilbourn, the muscular painter played with devastating impact by Christopher Connel -- let alone a whole labor collective of miner-artists.Many of the men from this part of England, like Jimmy, the not-too-bright workhorse played with disarming good humor by David Whitaker, left school at 10 to work underground. \"I was scared stiff, I was,\" he says of the dangerous job he performed in pitch darkness, in a moving speech that pours out when he loses himself in contemplation of a white-on-white abstract painting.Some men, like George, the stern disciplinarian played with scowling conviction by Deka Walmsley, found greater meaning in their lives by working for the union -- the union that will abandon them all when the mines start shutting down. Given his rigid work ethic and inflexible moral code, it's great fun to watch George get apoplectic when the teacher brings in a model (a saucy turn by Lisa McGrillis) to pose nude for a life class -- and a joy to see him on a field trip to the London art galleries, rapturously responding to traditional Chinese art at the Royal Academy.Other miners take heart from their Socialist political principles, like Harry (a wonderful thundering perf by Michael Hodgson), the blustery dental mechanic whose lungs are so shot from being gassed in the muddy trenches of the Somme that he's not fit to work in the mines. And some men can't find work at all, a curse borne in humorous agony by Brian Lonsdale as the Young Lad who shows up in class to keep warm.They may never have seen a painting or even read a book (there's no library in Ashington), but they are all proud men. \"We're very punctual, we are miners,\" George loftily informs their tardy tutor, Robert Lyon, who both nurtures them as artists and exploits them to advance his own career -- and has the grace to look guilty about that, in Ian Kelly's subtle perf.So, what kind of artists are they, anyway? Amazing, actually. Their deeply felt and boldly expressed paintings -- projected on three large hanging screens -- depicting scenes from their lives are proof of Lyon's conviction that culture is not the exclusive preserve of the upper classes, that \"fundamentally, underneath, anybody can have a creative gift.\"Ironically, it's Lyon's own star pupil, the genuinely gifted Oliver, who puts the lie to that patronizing line of B.S. \"It's talent, isn't it?\" challenges Oliver, whose astonishing portrait of a heavily pregnant mother and her desperately clutching child could hang in any gallery.In his emotionally blistering perf, Connel captures every shade of feeling that art brings out in Oliver: the longing, the joy, the frustration, the anger and, ultimately, the anguish of having to choose between his art and his working class community. The agony of indecision carves lines in his face as he weighs the offer of a rich patron (Phillippa Wilson) to take him out of the mines and up to her mansion studio.Although familiar enough from \"Billy Elliot,\" this dramatic conflict is treated with less sentimentality here, largely because the art discussions between the technically naive painters and their tutor are so intellectually engaging and such rollicking good fun. Who should make art? What makes art? What does art make of its maker? Who owns art? And how much should art cost, anyway?The conversation that comes out when these guys sit down and try to figure it all out is an art in itself.\n\nSets and costumes, Gary McCann; lighting, Douglas Kuhrt; sound, Martin Hodgson; production stage manager, Charles Means. Reviewed Sept. 29, 2010. Opened Sept. 30. Running time: 2 HOURS, 25 MIN.",
  "isFullReview": true,
  "textWordCount": 743,
  "archivePath": "data/archives/reviews/the-pitmen-painters-2010/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:30:17.313Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 0 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20101008025922",
  "archiveOrgUrl": "http://web.archive.org/web/20101008025922/http://www.variety.com:80/review/VE1117943767.html?categoryid=33&cs=1&nid=2580",
  "wordCount": 743,
  "tierReason": "Full review text"
}