{
  "showId": "the-phantom-of-the-opera-1988",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "https://www.nytimes.com/2014/08/18/theater/the-phantom-of-the-opera-retains-its-luster.html?_r=0",
  "publishDate": null,
  "fullText": "https://www.nytimes.com/2014/08/18/theater/the-phantom-of-the-opera-retains-its-luster.htmlGive this articleAdvertisement\n\nIs there a truism more rarely true than the notion that absence makes the heart grow fonder?\n\nIn my experience, this sentimental cliché just as often proves false, whether applied to people, places or things. Take Broadway musicals. It has been more than 15 years since I first saw, and was not particularly entranced by, “The Phantom of the Opera,” the Andrew Lloyd Webber musical that has been playing for more than 26 years in New York (longest-running show in Broadway history!) and grossed $6 billion dollars worldwide (more than any other musical or even, gasp, movie!).\n\nHow to explain, then, the unexpected tingle of anticipation that ran through me as I entered the Majestic Theater, where “Phantom” has been installed since it first opened? Part of it was the rare chance to visit this aptly titled theater, monopolized by one show for so many years. And “Phantom” now boasts two accomplished Broadway performers in its leading roles: Norm Lewis, nominated for a Tony in 2012 for his role in “The Gershwins’ Porgy and Bess,” and Sierra Boggess, who played the title role in Disney’s waterlogged “The Little Mermaid.”\n\nAt this point the crowds flocking to see “Phantom” are making a pilgrimage to a pop shrine more than they are coming to see a Broadway musical, to say nothing of any particular performers in it. “Phantom” has become a permanent attraction in the tourist playground that New York increasingly has come to resemble, while residents grumble about having to elbow their way through multiplying Elmos to wade through Times Square.\n\nI, of course, would be judging the show with a sterner eye. But soon after the orchestra struck up those thundering, ominous organ chords, I found my expectations upended, my jaded armor melting away. With the distance of more than a decade — and a couple hundred new musicals — since my last visit, I found myself with a new appreciation for this beloved show’s gothic theatricality; the waltzing sweep of Harold Prince’s direction; the grandly soaring melodies of its most celebrated songs; and the surprising vivacity and spark that the new leads, and even the lesser players, bring to this tale of love, obsession and murder in the bowels of a French opera house in the 19th century.\n\nMr. Lewis is, perhaps surprisingly (dismayingly?), the first black actor to play the title role in the Broadway production — although he is only the 14th actor to play it. His sonorous baritone has been among the most reliably impressive voices on Broadway for many years now. In his big solo “The Music of the Night,” Mr. Lewis’s supple phrasing and power combined to gorgeous effect.\n\nThe Phantom isn’t really the most rewarding of roles for a leading man. He spends his time onstage with his face covered, or with a gruesome scar distracting from whatever authentic feeling an actor can manage to squeeze into the histrionic outlines of the role. He’s also offstage a lot, darting around the rafters, making trouble whenever he feels his adored, the soprano Christine Daaé (Ms. Boggess), isn’t being treated with due deference, or his monthly payment of 10,000 francs hasn’t arrived on time. (Ghosts in 19th-century opera houses must have had a good union.)\n\nStill, Mr. Lewis makes a fine meal of the role. His Phantom is imposing in his willfulness, as his lustrous voice comes booming down from the heavens, and touching in his energetic but unrequited love for Christine. The moment of anguish when she instinctively recoils in disgust as his disfiguration struck a note of sharp pathos.\n\nMs. Boggess’s bright, clear voice meets the challenges of her music with ease, flying through the pseudo-coloratura passages in Mr. Lloyd Webber’s mock-operatic music. She could possibly improve her swoon, but that’s a small quibble in what is a stylish and ardent performance in a fairly colorless part. As Raoul, the Phantom’s handsome and aristocratic rival for Christine’s love, Jeremy Hays looks and acts, well, handsome and aristocratic, and displays vocal chops in the big love duet, “All I Ask of You.”\n\nAmong many other pleasurable details I’d forgotten: how genuinely funny some of Mr. Prince’s staging and Mr. Lloyd Webber’s music can be. The parody of French grand opera in the first act, with Michele McConnell as a preening Italian diva and Christian Sebek as her lap dog tenor (with the hilarious name of Ubaldo Piangi), plays wittily with the overwrought conventions of Halévy-Meyerbeer oeuvres. And as the Mrs. Danvers-like Madame Giry, the stern ballet mistress who appears to be in secret communication with the Phantom, Cristin J. Hubbard stalks the stage commandingly, pounding the floor with her walking stick as if the stage were a lawn in desperate need of aerating. (Although I’m afraid she’s since left the production.)\n\nThe physical production has been kept in tip-top shape. All the gilt in Maria Bjornson’s set looks freshly polished. I couldn’t spot a single snuffed light in the candelabras that so picturesquely light the way through the lagoon where the Phantom takes Christine on a spooky-romantic gondola ride. (Half of that 10,000 francs a month must be spent on candles.) The acres of swagged and tasseled curtains draping the décor — it’s like Joan Rivers’s apartment up there — show no evidence of moth holes. The lavish costumes sparkle as if examined for missing sequins after every performance.\n\nIt may or may not be a great musical, according to your tastes, or even a good one, but Broadway’s “Phantom of the Opera” certainly remains, now if not forever, a grand, lavishly decked-out galleon of a show, surging on into the 21st century showing few signs of decay.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"I found my expectations upended, my jaded armor melting away...I found myself with a new appreciation for this beloved show’s gothic theatricality; the waltzing sweep of Harold Prince’s direction; the grandly soaring melodies of its most celebrated songs...It may or may not be a great musical, according to your tastes, or even a good one, but 'Phantom of the Opera' certainly remains a grand, lavishly decked-out galleon of a show, surging on into the 21st century showing few signs of decay.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 947,
  "archivePath": "data/archives/reviews/the-phantom-of-the-opera-1988/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:38:56.321Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20230409064634",
  "archiveOrgUrl": "http://web.archive.org/web/20230409064634/https://www.nytimes.com/2014/08/18/theater/the-phantom-of-the-opera-retains-its-luster.html?_r=0",
  "wordCount": 947,
  "tierReason": "Full review text"
}