{
  "showId": "the-phantom-of-the-opera-1988",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Richard Hummler",
  "url": "http://variety.com/1988/legit/reviews/the-phantom-of-the-opera-5-1200427363/",
  "publishDate": null,
  "fullText": "The London audiences aren't wrong. \"The Phantom Of The Opera\" is romantic musical theater hokum in the grand manner - hokum cordon blue - and it justifies the feverish buildup that has given it a $16,500,000 advance. It's good for a Broadway run of several years.\n\nThe London audiences aren’t wrong. “The Phantom Of The Opera” is romantic musical theater hokum in the grand manner – hokum cordon blue – and it justifies the feverish buildup that has given it a $16,500,000 advance. It’s good for a Broadway run of several years.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Variations on a Theme’ Wins at Rotterdam: ‘Thoughtful and Moving’ \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Bring Her Back' Leads 2026 Australian Academy Awards; Margot Robbie, Jacob Elordi, Sarah Snook Among Winners\n\nAndrew Lloyd Webber has taken the Gaston Leroux potboiler about the love-crazed disfigured genius who lives in the catacombs of the Paris Opera and fashioned it into a thrilling and musically rich mass legit entertainment. The 19th century period spectacle, scenic legerdemain, soaring melodies and exceptional singing are at the service of an involving and piquantly offbeat love story, all of it staged with brilliantly organized flair by Harold Prince, back in top form.\n\nGiven the near-hysterical anticipation aroused by this latest, big bertha West End musical smash, “it’s not that good” will probably become a familiar refrain along the byways of Broadway. No, it’s not “South Pacific” or “Fiddler On The Roof,” but it’s a major achievement in the musical theater and a high water mark in the phenomenal Lloyd Webber career. The bonus this time is that the glittering technical wizardry and pop-opera music have been wedded to a strong story and characters.\n\nChill-seekers may be disappointed, because this is a romantic “Phantom” in which the title hero is a sensitive artist ravaged by unrequited love, and not a rampaging early slasher. Lloyd Webber and co-librettist Richard Stilgoe have put the emphasis on the beauty-and-the-beast theme and develop an affecting yarn in the scarred recluse’s obsessive passion for the beautiful opera chorine.\n\nThe show has a flashback structure, opening in 1911 with an eerily effective auction of props from the Paris Opera and jumping back to the 1881 melodramatics when the supernaturally gifted dungeon-dweller terrorized the theater. The period glitz is an eye-popping delight, with the onstage and backstage atmosphere artfully heightened but not cartooned.\n\nThe authors lay in the exposition smoothly, then move into high gear as the masked man of mystery whisks the entranced actress to his dungeon lair at the nether side of an underground lake beneath the opera house. The trip’s a visceral pip as he ferries her to his cave across the lake lit by scores of candles rising from the water, to the throbbing music of the title song.\n\nFew if any “Phantom” -goers will remain unhooked as title roler Michael Crawford seduces the dazed heroine in his candelabra-lit hideout to the propulsive chords of “The Music Of The Night,” a patented Lloyd Webber rouser and a model of dramatic musical construction.\n\nThat’s just one among an abundance of big-melody tunes in a great score that evokes period Hollywood film music, opera grand and light, operetta and especially pop Broadway of the classic era. The love ballad for heroine Christine and her aristocratic swain, “All I Ask Of You,” is irresistible and worthy of comparison to Rodgers and Kern.\n\nNot the least of the show’s pleasures is the pride of place it gives to vocalizing. No musical in years has had better singing. Sarah Brightman’s voice gets a through workout, and while it may not be of premier operatic quality, it’s a lovely lyric soprano ideally suited to Lloyd Webber’s clever music.\n\nCrawford shows himself to be an exceptional singing actor who knows how to vary his sound for dramatic effect. And Judy Kaye, playing the large-ego diva whom Brightman supplants, sings the opera parodies with pleasing skill. The choral singing is clear and full-bodied.\n\nThe show’s stagecraft is sensational, with scenic transitions that dazzle with their speed and ingenuity. Maria Bjornson’s designs are marvels of period atmospheric detail and technical savvy (that Tony can be bestowed right now), and the costumes are grandly extravagant fun.\n\nFrom Prince, it’s the best show business staging since “Follies,” always theatrical but in tight focus for the key moments of dramatic import.\n\nPlaying behind a mask, Crawford makes a fully developed human figure of the larger-than-life mad genius. His climactic scene with Brightman, as he sobs at her expression of love, has real pathos and moves the audience.\n\nBrightman, as noted, is an exceptional singer and a competent if less than overpowering acting personality. Judy Kaye makes and expert pro’s contribution as singer and comic actress. Steve Barton sings robustly and acts forcefully as the straight-arrow winner of the heroine’s heart. Leila Martin, Cris Groenendaal and Nicholas Wyman supply accomplished performances in the secondary roles.\n\nIf it can’t be said that “Phantom” advances the artistic frontier of the musical theater, it’s more than welcome as a gloriously old fashioned romantic musical spectacle. And while Lloyd Webber may not be the most original of composers, he’s an undeniably great showman with a seemingly unerring sense of popular taste. He’s making musical theater history, and “Phantom” will be making musical theater money for years to come.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "“Andrew Lloyd Webber has taken the Gaston Leroux potboiler about the love-crazed disfigured genius who lives in the catacombs of the Paris Opera and fashioned it into a thrilling and musically rich mass legit entertainment. The 19th century period spectacle, scenic legerdemain, soaring melodies and exceptional singing are at the service of an involving and piquantly offbeat love story, all of it staged with brilliantly organized flair by Harold Prince, back in top form.”\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 879,
  "archivePath": "data/archives/reviews/the-phantom-of-the-opera-1988/variety--richard-hummler_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:39:19.389Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 879,
  "tierReason": "Full review text"
}