{
  "showId": "love-letters-2014",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "https://ew.com/article/2014/09/18/love-letters-ew-review/?srsltid=AfmBOooS4njRa6vnPPYgiZ5tEvjgkwrOoDQTv7a14jqC3KzeZwv_hvmF",
  "playbillVerdictUrl": "http://www.ew.com/ew/article/0,,20364394_20854393,00.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "previousUrl": "http://www.ew.com/ew/article/0,,20364394_20854393,00.html",
  "urlDiscoveredAt": "2026-02-04T02:45:54.431Z",
  "urlDiscoveryMethod": "google-serp",
  "fullText": "A.R. Gurney’s Love Letters comes straight out of the literary cul-de-sacs of Cheever or Updike. Two WASPs meet in grade school and begin an off-and-on correspondence that extends for decades as he (bearing the uber-WASPy name Andrew Makepeace Ladd III) becomes a U.S. senator and she (a better-off debutante named Melissa Gardner) mostly flails at marriage, motherhood, and her spotty career as an artist. Gurney’s 1988 drama, a theatrical version of an epistolary novel staged simply with two actors seated at a table reading the script aloud, has become a kind of touchstone for theatergoers as well as actors of a certain age. And no wonder: The roles require no memorization, no movement, little rehearsal, and a fleet 90-minute running time. Director Gregory Mosher’s superlative new Broadway revival has attracted an impressive roster of performers who will rotate through the production in monthly increments: Some—such as Carol Burnett, Martin Sheen, Anjelica Huston, and Diana Rigg—are back on Broadway after more than a decade away. First up, and performing through Oct. 11, are Brian Dennehy and Mia Farrow. Dennehy, a two-time Tony winner, has been a steady presence on Broadway in the last few decades—and he brings a stalwart, hunched-over gravitas to Andrew, a self-serious young man who’s brief youthful indiscretions naturally give way to a Rockefeller-Republican conservatism. The real surprise here is Farrow, returning to the Main Stem for the first time in 18 years. Sitting primly erect in a cushioned Windsor chair, she quickly makes you forget the activist/tabloid staple/hyperactive Twitterer she’s become in recent years. She’s a real actress, and she uses her considerable tools and her wonderful voice to evoke Melissa’s girlish naivete, her teenage petulance, and then her grown-up insecurity. Yes, there’s something a little off-putting about Gurney’s star-crossed lovers, with their talk of butlers and boarding school and furtive hookups on the weekend of the Harvard-Yale game. ”Nobody sends Easter cards except for maids,” Melissa writes at one point. You might be tempted to think of them, as Andrew jokes late in the show, as ”two uptight WASPs going at it like a sale at Brooks Brothers.” But Gurney uses the stilted language of these well-bred characters, and their coded markers of all that is proper, as blunt instruments. Tellingly, Farrow seems to swallow Melissa’s teenage confession that her stepfather, the improbably named Hooper McPhail, ”was a jerk and a pill, and he used to bother me in bed, if you must know.” In instances like that when real emotion starts to slip in at the edges, both characters tend to retreat very quickly to the safety of decorum—or to simply change the subject. Love Letters reminds us that class can not only us in our place, but thwart any effort to forge real connections outside of ourselves. B+ (Tickets and performer schedule: lovelettersbroadway.com)",
  "isFullReview": true,
  "textWordCount": 469,
  "archivePath": "data/archives/reviews/love-letters-2014/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:45:54.434Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 469,
  "tierReason": "Full review text"
}