{
  "showId": "love-letters-2014",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/love-letters-theater-review-747316/",
  "publishDate": "September 18, 2014",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "The stars bring warmth and wit to A.R. Gurney's epistolary two-hander, though the production feels more like a polished reading than a fully realized theatrical experience.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "A table, two chairs and a pair of actors reading from scripts on an otherwise bare stage sounds like one notch up from a radio play. But A.R. Gurney's deceptively simple 1988 epistolary two-hander, Love Letters, is that rare work whose emotional richness requires no embellishment in order to become ...",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-LOVE-LETTERS-Opens-on-Broadway-Updating-LIVE-2014",
  "showScoreExcerpt": "The stars bring warmth and wit to A.R. Gurney's epistolary two-hander, though the production feels more like a polished reading than a fully realized theatrical experience.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "bww-roundup",
    "playbill-verdict"
  ],
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/love-letters-theater-review-734169",
  "textWordCount": 499,
  "archivePath": "data/archives/reviews/love-letters-2014/hollywood-reporter--david-rooney_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:33:06.730Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Logo text\n \n\nUncharted, Sony's long-gestating adaptation of the video game Uncharted: Drake's Fortune, is getting a shot in the arm. Oscar-winning screenwriter Mark Boal (The Hurt Locker) has been brought on to work on the film’s screenplay, which will be directed by Seth Gordon.\n\nDavid Guggenheim (Safe House) wrote the most recent version of Uncharted that got the studio excited and brought it to the finish line. Boal has come on board to do a three-week production polish.\n\nThe action project might seem an odd choice for the journalist-turned-filmmaker, who is known for hard-hitting news-oriented dramas like Zero Dark Thirty and its depiction of the killing of Osama bin Laden by a team of Navy SEALs. But Boal, who recently launched his Page 1 production company with backing from Megan Ellison, is said to be a fan of the popular video game, which is being envisioned as a swashbuckling adventure in the vein of Indiana Jones.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Movies\n \n \n \n \n\n \n \n \n \n How Markiplier's 'Iron Lung' Proved the Studios Wrong: \"There Is Still a Stigma Against YouTube\" \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Business\n \n \n \n \n\n \n \n \n \n Robbie Daymond and Ray Chase's Sassy Chap Games Signs With CAA (Exclusive)\n\nWatch more THR’s Awards Season Roundtable Series 2012: The Writers\n\nThe video game centers on a treasure hunter named Nate Drake, a descendent of explorer Sir Francis Drake, who believes he has learned the whereabouts of the fabled golden South American city El Dorado from a cursed statue. His search for El Dorado becomes competitive when a rival hunter joins the fray. Both face creatures, mutated descendants of Spaniards and Nazis, that begin attacking those hoping to learn the treasure’s true secrets.\n\nSony still needs to find its leading man for the film before it can move forward. Mark Wahlberg had been attached but eventually moved on. More recently, the studio made an offer to Chris Pratt, but he passed.\n\nBoal isn’t the first writer with an Oscar pedigree to take a crack at the property. Oscar nominee David O. Russell also penned a draft of Uncharted when he was attached to direct. But that version, which was a departure from the video game, never gained any traction at the studio.\n\nRead more What’s Behind Hollywood’s Renewed Interest in Political Movies\n\nOther writers who have worked on the project over the years include Thomas Dean Donnelly, Joshua Oppenheimer and Cormac and Marianne Wibberley.\n\nAvi Arad, Ari Arad, Charles Roven and Alex Gartner are producing Uncharted.\n\nRead more The Unorthodox Relationship Between Kathryn Bigelow and Mark Boal\n\nBoal is currently writing an untitled film on Bowe Bergdahl for his frequent collaborator Kathryn Bigelow to direct. That film centers on the controversial Army soldier who was imprisoned by the Taliban and freed this year in a trade for prisoners held by the U.S. at Guantanamo Bay.\n\nBoal is repped by CAA, Management 360 and attorney Alan Wertheimer.\n\nNov. 12, 8:00 p.m.: This story was updated to include writer David Guggenheim’s role in writing the most recent draft of the screenplay.\n\nEmail: Tatiana.Siegel@THR.com\n Twitter: @TatianaSiegel27"
}