{
  "showId": "love-letters-2014",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Unknown",
  "url": "http://www.nytimes.com/2014/09/19/theater/brian-dennehy-and-mia-farrow-in-love-letters-on-broadway.html?_r=0",
  "playbillVerdictUrl": "http://www.nytimes.com/2014/09/19/theater/brian-dennehy-and-mia-farrow-in-love-letters-on-broadway.html?_r=0",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "The dying art of putting pen to paper to exchange news is being celebrated on Broadway this fall. “Love Letters,” A. R. Gurney’s durable epistolary play, in which two actors sit on comfortable chairs onstage and read from the lifelong correspondence between a man and a woman from the East Coast upper crust, has made it to the big time, commercially speaking.\n\nA rotating cast of stars, beginning with Brian Dennehy and Mia Farrow, will be taking the stage of the Brooks Atkinson Theater, where the production opened Thursday night under the expert direction of Gregory Mosher, to remind us that before emails and texts, before emoticons and emojis and Facebook and Instagram, people communicated their fondest hopes, their casual observations and their lame jokes on paper, with pen or pencil or perhaps a typewriter, and then stuffed the results into quaint things called mailboxes.\n\nI had a suspicion that Mr. Gurney’s play, first seen in New York in 1989 and trotted out regularly since then at regional and amateur theaters the world over, might by now feel as dated as the means by which its characters trade their thoughts. I also thought I detected a little cynicism in bringing what is essentially a staged reading to Broadway, sprucing it up with big names, and charging roughly $140 for a top-price ticket. But before long, my qualms began to erode under the sweet, sad spell of Mr. Gurney’s deceptively simple and quietly moving play. As performed by a sterling Mr. Dennehy, playing the rock-solid, letter-loving Andrew Makepeace Ladd III, and an utterly extraordinary Ms. Farrow, as the flighty, unstable and writing-averse Melissa Gardner, Mr. Gurney’s intimate drama gains steadily in power, as life keeps ripping away at the seams of its characters’ well-tailored existences. The play’s means may be economical, but it etches a deep portrait of life’s painful vicissitudes.\n\nTrue, the early passages can be cloying, as the young Andy and Melissa meet as children and exchange brief, dutiful notes about birthday parties and later pass more intimate notes in class. (“Will you be my valentine?” Andy asks. “Unless I have to kiss you,” Melissa grudgingly replies. Aww!) As their genteel names suggest, however, Andy and Melissa reside in the regimented world of the well-heeled Protestant class — her family is considerably wealthier — and soon they have been sent to separate private schools. A friendship that blossomed in proximity isn’t easy to sustain. Andy loves to write letters about anything and everything; Melissa doesn’t even much like to read them, and complains that he goes on too long.\n\nThe teenage years bring the expected bursts of tumultuous feeling, as Andy and Melissa attempt to sort out their feelings for each other. Melissa scolds Andy for not dancing with her at a party she hosted. He blames it on a “stretched groin” from hockey-playing: “The only reason I danced with Ginny Waters is she takes tiny steps, but you always do those big spins.” Both performers treat these early letters with an admirable respect for the sincere feelings they contain, however impulsive and immature.\n\nHow to wade through the crush of culture coming your way this season? Here’s a guide to 100 events that have us especially excited, in order of appearance.\n\nMs. Farrow is particularly fine at capturing the young voice of her character, with her impetuousness, bursts of temper and affectionate confidences. “Guess what? I’m going to a psychiatrist now,” Melissa writes, and Ms. Farrow makes us feel both the girlish pride in this announcement and the unsettled emotions roiling beneath it. And while he takes part in the pastimes of his gender and class, Andy has a maturity beyond his years that is effectively transmitted in Mr. Dennehy’s rich voice. His responses remain measured and loyal, even when Melissa’s fits of pique try his patience.\n\nThe performances of both actors deepen and evolve as their characters do. Despite a carefully navigated life that leads to a career in politics, Andy suffers his share of disappointment, signaled with stiff-upper-lip fortitude tinged with sensitivity by Mr. Dennehy. And the news that Melissa has begun seeing a therapist hints at a psychological frailty that will become more pronounced as Melissa grows up in the frigid bosom of a fracturing family. Her parents divorce, and Melissa acquires a hated stepfather. Later, she exults in his ouster, but by then, her mother has become an alcoholic. Melissa takes refuge in a love for painting.\n\nMs. Farrow gives a remarkable performance, so vividly felt and fully realized that you forget that she is merely reciting notes and letters. (She was equally wonderful as Honey in an unforgettable staged reading of “Who’s Afraid of Virginia Woolf?” I saw more than a decade ago. That she hasn’t done more stage work is a sad loss to the theater.) Her portrayal casts a heartbreaking spell as Melissa’s fragility slowly emerges.\n\nEven the moments in which Melissa sits silent, as Andy’s letters go unanswered, are movingly rendered, with Ms. Farrow’s luminous transparency of feeling suddenly disappearing, as if a light were suddenly switched off inside her. (Until the final moments, the actors do not look at each other, which gently emphasizes the distance that remains between them even when their affections are most entangled.)\n\nThe play’s title is, on one level, tinged with irony: for much of their lives, the relationship between Andy and Melissa remains one of flirting and friendship that somehow never bloomed into romance. The sense of regret that we read between the lines of their correspondence gives the play a melancholy underpinning, as we (and they) consider what might have been, and whether their lives might have turned out differently had they found a way to come together for good.\n\nWhat ultimately makes the play so haunting is the recognition that the heart of Andy and Melissa’s relationship cannot be captured in the many thousands of words they exchange. Even today, when people broadcast their every waking thought on any number of social media platforms, we only really manage to record a small sliver of what it means, and how it feels, to grow and change, to experience love and endure loss. In its oblique and unaffected way, “Love Letters” illustrates this universal truth, that so much of life, probably most of it, is a solitary journey, a letter we write only to ourselves.",
  "isFullReview": true,
  "textWordCount": 1062,
  "archivePath": "data/archives/reviews/love-letters-2014/nytimes--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:00:30.412Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "connect ECONNREFUSED 207.241.237.3:80"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 1062,
  "tierReason": "Full review text"
}