{
  "showId": "love-letters-2014",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Unknown",
  "url": "http://www.thewrap.com/love-letters-theater-review-mia-farrow-and-brian-dennehy-perform-postcards-from-their-hedge-fund/",
  "playbillVerdictUrl": "http://www.thewrap.com/love-letters-theater-review-mia-farrow-and-brian-dennehy-perform-postcards-from-their-hedge-fund/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "The most remarkable thing about A.R. Gurney’s two-hander “Love Letters,” which opened Thursday at the Brooks Atkinson Theatre, is that it was first performed professionally in 1988, years before email was a common form of communication.\n\nAlthough the two characters, Melissa and Andrew, read aloud letters and postcards they’ve shared for decades, most of those missives emerge as the kind of short “dialogues” people today have via email.",
  "isFullReview": false,
  "textWordCount": 68,
  "archivePath": "data/archives/reviews/love-letters-2014/thewrap--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:48:15.110Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "excerpt",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Word count too low: 74 (min: 300)"
  ],
  "contentTier": "invalid",
  "wordCount": 68,
  "tierReason": "Short text (68 words)",
  "rejectedAt": "2026-02-04T10:51:45.457Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This text only provides background context about the play's history and communication themes, with no critical evaluation or recommendation about the current Broadway production.; openai: The text provided is a plot summary and historical context with no evaluative content or critique of the current production.; gemini: This is a plot summary with no evaluation or recommendation.; kimi: Text contains only plot summary and historical context about the play's premise (characters reading letters aloud), with no evaluation of performances, direction, production quality, or recommendation to see the show. Appears to be an excerpt lacking critical assessment.",
  "promptVersion": "5.2.0",
  "bwwExcerpt": "Aside from being prescient, Gurney is not a subtle playwright. Melissa and Andrew's childhood exchanges are as cute as they are dull...She's born rich, he services the rich. So what's their problem? Unlike Farrow, Dennehy doesn't affect a kid-like sing song voice for his early readings. But this actor could read the phone book and be engaging. Instead, he's performing 'Love Letters,' so we don't have a choice. Farrow has the far juicier part...Farrow gets to show evidence of alcoholism, substance abuse, artistic failure, and the pressures of being the Other Woman to a well-known politician. Gurney may have written a caricature, but Farrow colors it with a heartfelt performance...Hopefully Farrow's month-long stint in 'Love Letters' leads to future Broadway assignments.",
  "bwwScore": 6
}
