{
  "showId": "love-letters-2014",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Unknown",
  "url": "http://www.vulture.com/2014/09/theater-review-love-letters.html",
  "playbillVerdictUrl": "http://www.vulture.com/2014/09/theater-review-love-letters.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "bwwExcerpt": "Gurney has an overfondness for structural tricks; another is currently on view in The Wayside Motor Inn at the Signature. But in Love Letters, at least, the artificial restriction brought out something compensatory in him, especially when the letters are allowed to escape their strict my-turn-your-turn alternation. Most moving are the holes, the lacunae left by one character's refusal, in a snit or in trouble, to reply, or to accept the feeble cajolery of the other, sometimes for years. The result, tellingly, is a spongiform record of a relationship. Are not all relationships as much empty space as connective tissue? But the pitfalls of the play's structure are just as evident, and Gurney steps right into them. How, for instance, do you end such a correspondence? Gurney does it, unfortunately, with an explicitly heart-tugging coda that breaks the frame - too little, too late. In a play (or even just an event) clearly meant to be a love letter to writing letters, he settles for a most uncomplimentary close.",
  "bwwScore": 5,
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Carol Rosegg The older the money, the stingier the meal — or so goes a persistent Wasp stereotype. Onstage, too, the rich can be unforthcoming. A.R. Gurney’s Love Letters, an epistolary play about such withholding among the upper crust, also suffers from it, partly the result of its stuntlike conception. It tells the story of stuffy but successful Andrew Makepeace Ladd III and free-spirited but doomed Melissa Gardner from the time they first encounter each other in second grade to about the age of 55, a period roughly coinciding with Earth years 1940 through 1988, when the play was first produced.\n\nI say “story,” but of necessity Love Letters is more of a précis, dropping in on representative moments in the two characters’ lives not only through the proper letters they write but via valentines, picture postcards, RSVPs, Halloween cards, thank-you notes, condolence notes, and notes passed in class. Despite the variety of mail, this is a limited palette. For most of the show’s 90 minutes they do not even share a glance, let alone anything that passes for dialogue; there is no set but a table that cuts off their bottom halves and chairs from which they never rise. This dramaturgy, evidently meant to scrape away all distraction and focus our attention on the purity of actors reading (they have scripts on little lecterns), mostly succeeds in proving that “starve a cold, feed a fever” doesn’t apply to the theater. Starve a play and you don’t have a play.\n\nShow \n 0 Comments / 0 New\n \n Comment\n \n\n Theater Review: Love Letters\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 302,
  "archivePath": "data/archives/reviews/love-letters-2014/vulture--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:04:11.001Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 302,
  "tierReason": "Full review text"
}