{
  "showId": "love-letters-2014",
  "outletId": "wsj",
  "outlet": "Wall Street Journal",
  "criticName": "Unknown",
  "url": "http://online.wsj.com/articles/theater-review-love-letters-1411093815",
  "playbillVerdictUrl": "http://online.wsj.com/articles/theater-review-love-letters-1411093815",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Mia Farrow and Brian Dennehy in 'Love Letters' on Broadway.\n Carol Rosegg\n\nYou know a playwright has really arrived when he has plays simultaneously running on and Off-Broadway. A.R. Gurney, Terrence McNally and Tom Stoppard are all being so honored this fall, and it's Mr. Gurney who's getting the fanciest treatment. While \"The Wayside Motor Inn\" is currently being performed by Signature Theatre, \"Love Letters,\" his perennially popular two-character epistolary play about a pair of aging childhood friends who should have been more, has just received its first Broadway revival since the original 1989 production, with Mia Farrow and Brian Dennehy leading a roster of nine stars who will rotate in and out of the show during its five-month run.\n\nOne reason why \"Love Letters\" is so frequently produced is that it's written in such a way as to facilitate both come-and-go celebrity casting and bargain-basement staging. Not only is there no set, but the actors sit together at a table and read from scripts instead of memorizing their lines. But the enduring success of \"Love Letters\" is far more than a mere matter of logistical convenience. It's one of Mr. Gurney's best plays, a tender study of thwarted love: Melissa is a scatty upper-class rebel, Andy is a stuffy upper-middle-class striver, and as they read a lifetime's worth of letters out loud, you come to know them so well that their parallel sorrows seem as familiar as your own.\n\nTo watch Mr. Gurney use stealthy, unstressed indirection to fill in the blanks in his characters' lives is to receive the equivalent of a master class in dramatic technique. A less secure artist, for instance, would have made the biggest of deals out of the fact that one of Melissa's stepfathers molested her, but he is content to throw it away in a single sentence that resounds throughout the theater: \"He was a jerk and a pill, and he used to bother me in bed, if you must know.\"\n\nWhile Mr. Dennehy may not have been born to play a WASP named Andrew Makepeace Ladd III, his bluff, heartfelt simplicity of manner leaves little to be desired. Unlike him, Ms. Farrow has done comparatively little stage acting, and so the quivering intensity of her fearlessly projected, fully involved performance (you'd never guess that she hasn't appeared in a commercial Broadway play since 1980) is the most gratifying of surprises, as is the total assurance with which she sustains Melissa's evening-long journey from carefree childhood to desperate middle age. It's the safest of bets that Gregory Mosher, the director, deserves most of the credit for the uncanny timing of this production, in which every pause, however brief, lands like a skipped heartbeat.\n\nFor the record, Ms. Farrow will be replaced by Carol Burnett on Oct. 11, after which three new couples are set to appear in succession between Nov. 9 and February: Candice Bergen and Alan Alda, Diana Rigg and Stacy Keach, and Anjelica Huston and Martin Sheen. Choose according to your liking, but remember: The play's the thing.\n\n—Mr. Teachout, the Journal's drama critic, is the author of \"Duke: A Life of Duke Ellington,\" out in paperback from Gotham Books in November. Write to him at tteachout@wsj.com\n\nAn error has occurred and your email has not been sent.\n Please try again.\n\nContent engaging our readers now, with additional prominence accorded if the story is rapidly gaining attention. Our WSJ algorithm comprises 30% page views, 20% Facebook, 20% Twitter, 20% email shares and 10% comments.",
  "isFullReview": true,
  "textWordCount": 584,
  "archivePath": "data/archives/reviews/love-letters-2014/wsj--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:48:55.637Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "Insufficient text in archive: 0 chars"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140922121944",
  "archiveOrgUrl": "http://web.archive.org/web/20140922121944/http://online.wsj.com:80/articles/theater-review-love-letters-1411093815",
  "contentTier": "complete",
  "wordCount": 584,
  "tierReason": "Full review text"
}