{
  "showId": "leopoldstadt-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2022/10/02/leopoldstadt-stoppard-examines-his-roots-in-extraordinary-fashion/",
  "publishDate": "2022-10-02T21:52:58",
  "fullText": "Tom Stoppard, who started his dramatic excursions in 1966 with a somewhat skewed representation of the royal court of Elsinore and has over the decades traversed the worlds of academia, arcadia, and absurdia, has now examined the undiscovered country of his own hidden heritage. Consider Leopoldstadt Stoppard’s very own and very personal Roots a là Viennese. Given the playwright’s unparalleled knack for devising sturdily dramatic enigmatic conundrums, it is heartening to report that he has once and again outdone himself.\n\nStoppard begins his melting-pot tale at the very fin de siècle, just days before the beginning of the last century. “Like the curtain going up on something,” one character enthuses, while the professorial Ludwig Jakobovicz (Brandon Uranowitz) notes that “new centuries just depend on when you start counting.” The extended clan—and it is extended indeed, calling for a stage-filling company of 38, many portraying multiple characters—is nothing if not assimilated. Even so, it is pointed out that no matter how high one of their community might rise—neighborhood contemporaries cited include Freud, Klimt, and the recently-converted Mahler (“another Christian still wet from his baptism)”—ultimately, “he can’t not be a Jew.” Stoppard needn’t add, but does, that “in the end, if it doesn’t catch up on him, it will catch up on his children.” Welcome to the 20th century.\n\nThe action takes place not in Leopoldstadt—a ghettoized neighborhood of Vienna, the name mentioned with derision by these members of the Austrian bourgeoisie—but in a grand manse off the Ringstrasse. It is quite clear from the opening moments, when the kinder top their massive Christmas tree with a star of David, just where this tale is heading. The story culminates a half-century later, by which point survivors are few.\n\nThe family is so interwoven that you almost need a scorecard to track them. They include matriarch Emilia (Betsy Aidem) and her grown children: Hermann (David Krumholtz), who controls the family business, and Eva (Caissie Levy). Central to the play are Hermann’s Catholic wife Gretl (Faye Castelow) and Eva’s husband Ludwig; you might well consider Ludwig to be the moral center of the group, while Gretl sits on the immoral edge. Also on hand are Ludwig’s sisters, Hannah (Colleen Litchfield) and Wilma (Jenna Augen), and Wilma’s gentile physician-husband Ernst (Aaron Neil).\n\nProminent among their collective progeny are Jacob (Seth Numrich), Nellie (Tedra Millan), Hermine (Eden Epstein), and Rosa (Augen); plus, at the play’s searing climax, survivors Leo (Arty Froushan) and Nathan (Uranowitz). Standing out among outsiders are banker Otto (Japhet Balaban) and Brit journalist Percy (Numrich), both of whom marry daughters; the rakish dragoon Fritz (Froushan), who plays two key scenes in the 1900 section; and an antagonistic visitor to the flat who brings destruction to all, listed in the cast simply as Civilian (Corey Brill).\n\nClearly, this subject and this play are intensely personal to the playwright: the character Leopold Rosenbaum—who escapes Vienna at the age of 8 and Anglicizes himself into a successful writer called Leonard Chamberlain—is surely patterned on the author, whose own Jewish heritage was long cloaked from him. But Stoppard (née Tomáš Sträussler) was born in Czechoslovakia, not Austria; he is almost a decade younger than the fictional Leo/Leonard; and as a toddler his mother escaped not to London but to Singapore and then Darjeeling (India). Even so, this long obscured exhumation of family ghosts and guilt had a belated effect on the playwright, bringing forth this admittedly non-Stoppard-like but exceptional play.\n\nThe expansive action unfolds in five extended sections over a swift two and a quarter hours. The management has wisely excised the intermission that punctuated the play in its 2020 London premiere (just before the intrusion of that pandemic). Stoppard seems to have also slightly trimmed the proceedings for Broadway, culminating in an extended-but-manageable single act. You’re likely to be so grippingly involved in the emotional storm that you won’t notice when they rush past the two-hour mark.\n\nIt could be said, and some viewers might well say, that it is at times difficult to keep track of just who’s who and married to whom. The playwright could indeed have arranged matters so that all familial relations are reinforced; but that would come at the expense of the swift pace. (This viewer found Stoppard’s The Coast of Utopia enthralling, but the playwright did take nine hours to weave that particular tale.) Leopoldstadt begins with the matriarch paging through the family photo album, striving to remember the names of some of those faded ancestors staring out from the pages. Loss of identity and actual existence are, indeed, part of Stoppard’s lesson on this occasion.\n\nThe performers are uniformly excellent. Uranowitz stands out from beginning (as mathematician Ludwig) to end (as his equally mathematical great-nephew Nathan). Krumholtz is equally adept as the conflicted family breadwinner, while Castelow impresses as the out-of-place trophy wife who models for Klimt and nearly disrupts the household. Uranowitz, Augen, and Froushan do stunning work in the play’s shattering final scene. (Augen and Froushan, along with Castelow and Neil, played these roles in London.) That said, the stage is filled with too many worthy performances to individually cite.\n\nThe production is fluidly staged by Patrick Marber, director of the 2018 revival of Stoppard’s Travesties and author of Closer. The grand family living room, designed by Richard Hudson (The Lion King), thins out as the decades pass until little remains other than that massive grand piano. The costumes by Brigitte Reiffenstuel aptly reflect the changing times and family fortunes. Strong contributions also come from lighting designer Neil Austin and sound designer/composer Adam Cork.\n\nGiven its size, scope, and length, Leopoldstadt marks a brave and daring enterprise from leading West End producer Sonia Friedman (The Ferryman, Harry Potter and the Cursed Child, The Inheritance) with a raft of producing partners. Like The Ferryman and The Inheritance, Leopoldstadt is brilliant, memorable, and dynamic, warranting an immediate visit to the Longacre.\n\nStoppard’s large stage family is torn asunder over a half-century, violently wrenched apart by time and the times. Even so, the disparate strands of the Merz-Jakobovicz clan remain tied together as if by unseen, but ever, durable cords. Or, as Stoppard’s mathematician explains it, a cat’s cradle of invisible string with knots which remain inviolate.\n\nLeopoldstadt opened October 2, 2022, at the Longacre Theatre and runs through July 2, 2023. Tickets and information: leopoldstadtplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
