{
  "showId": "leopoldstadt-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2022/10/02/leopoldstadt-tom-stoppard-at-his-absolute-autobiographical-best/",
  "publishDate": "2022-10-02T21:51:34",
  "fullText": "“It’s not a play about me” Tom Stoppard has said, referring to Leopoldstadt, which had a January 2020 London bow. He’s also stated that it’s his last play, although he’s apparently having second thoughts now.\n\nWhether it is or isn’t, it’s added to his list of astonishing works – Rosencrantz and Guildenstern Are Dead, Travesties, The Real Thing, The Invention of Love, Rock ‘n’ Roll, The Hard Problem, to name a few. It undeniably ranks, perhaps with Arcadia and The Coast of Utopia, as his most exhilarating, most comprehensive, most serious accomplishment.\n\nIt’s also his most autobiographical work, or, taking him at his clarifying word, it’s close enough to being about someone very like the man born Tomáš Sträussler in Zlin, Czechoslovakia to Jewish parents. After his widowed mother, Martha, traveled widely with him and his brother, he was raised in England from age eight.\n\nHis mother married Ken Stoppard, a military man whose surname the incipient playwright took on. (Ever the man with an advanced skill at British wordplay, Stoppard has labeled himself “a bounced Czech.”) And Stoppard’s Jewish beginnings were suppressed by his mother, perhaps in part because his stepfather harbored anti-Semitic sentiments.\n\nSpecific details of Stoppard’s past aren’t incorporated into Leopoldstadt. Instead, he imagines the sizable Merz and Jakobovicz families who regard themselves as non-practicing Jews comfortably assimilated in an upscale section of 1899 Vienna, that isn’t the more Jewish-centric Leopoldstadt quarter.\n\nThe family members are intermarried, businessman Hermann Merz has a gentile wife Gretl (Faye Castelow). Ludwig Jakobovicz (Brandon Uranowitz) is a leading mathematician. They’re all celebrating Christmas, even as Young Jacob (Joshua Satine at the performance I saw) is placing a Jewish star atop the Christmas tree. The gesture is, of course, a shining metaphor for the spiritual conflicts with which Stoppard is so intricately dealing.\n\nWhile holiday cheer noisily abounds, Stoppard eventually narrows his focus on a debate Hermann and Ludwig are formidably waging. The former insists that the endlessly wandering Jews have at last found a long-sought permanent home in welcoming Vienna, while the latter adamantly contends otherwise, Zionist Theodor Herzl being repeatedly invoked.\n\nThroughout the following explosive, and deeply emotionally moving Leopoldstadt parts, Stoppard backs Ludwig’s beliefs about how tenuous a grip Jews have on their position in any society. What he’s considering profoundly is the oppressive weight of history.\n\nExpanding on those dark views, Stoppard skips to 1900, where Gretl philanders with Fritz (Arty Froushan) a Jew-hating dragoon. Eventually, there’s a far-reaching aftermath to their affair. Constantly raveling and unraveling his ingenious plot, Stoppard jumps over World War I to 1924 where young Jacob is now a cynical former soldier (Seth Numrich), and Cousin Hermine (Eden Epstein) a flapper with an ill-advised eye for Aryan banker Otto (Japhet Balaban).\n\nNext, Stoppard moves to November 8, 1938 (Kristallnacht), where the current Merz-Jakobovicz generations, hoping they’re safe under Hitler’s advances, brutally learn they are not. Citizen (Corey Brill), an official who enjoys humiliating Jews, arrives.\n\nIn Stoppard’s final scene, it’s 1955, when only three Merz-Jakobovicz family members have survived the false Vienna 1899 promise. (No one today should miss the signal to 2022 anti-Semitism.) Rosa (Jenna Augen), has for some time created a Manhattan life as a Freudian analyst, whereas Nathan (Uranowitz again, nailing the production’s stand-out performance) is an understandably bitter, accusatory man.\n\nThe third is Leo (Froushan again and like the entire cast, excellent). He’s the Stoppard-like figure but hasn’t written plays or screenplays, only two amusing books that “caught on.” He resembles Stoppard in that he has grown up with no more than the vague sense that he was born, if not raised, Jewish.\n\nRelatives Rosa, Nathan, and Leo are in the Merz apartment (altered throughout the play’s action by designer Richard Hudson) for the express purpose of the former two wising up the latter to his Jewish heritage. As Nathan sharply informs the resistant Leo, “No one is born eight years old.” The succinct comment and a further revelation from his childhood awaken Leo to his entire past, just before Stoppard creates a final tableau that rivals every denouement in the annals of modern playwrighting history.\n\nSo yes, Stoppard’s play is more autobiographical than he wants to delineate. Perhaps that’s due to his wanting the nine-scene, intermisssionless 130-minute play to be seen not simply through a personal lens but as the cat’s cradle of a manuscript it is as it scrolls grimly through the decades. (Ludwig plays cat’s cradle several time with the children, the game becoming another symbol of time’s tricks).\n\nDirector Patrick Marber – a reliable Stoppard collaborator these years – works wonders with his 30-plus cast members (some original London cast players, some new to the piece) as he  does with costumer Brigitte Reiffenstuel, lighting designer Neal Austin, sound and clever original music designer Adam Cork, projection designer Isaac Madge, and certainly the Campbell Young Associates wig, hair and makeup designers.\n\nFor the Broadway transfer Stoppard and Marber have trimmed the London version. At least one episode –1924 – has undergone a weakened sea change. One or two other sequences – not 1938 or 1955 – are delivered more broadly than required.\n\nPerhaps, there’s another explanation for Stoppard’s demurral – purely speculative on a reviewer’s part. Among many Holocaust survivors, no matter where they were during World War II, a strain of survival guilt persists. Could it be that Stoppard (born 1937) has composed Leopoldstadt from that depth? Just wondering.\n\nLeopoldstadt opened October 2, 2022, at the Longacre Theatre and runs through July 2, 2023. Tickets and information: leopoldstadtplay.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "show-score-playwright",
    "playbill-verdict"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "showScoreExcerpt": "\"Stoppard’s play is more autobiographical than he wants to delineate.\"\n\nRead more",
  "playbillVerdictUrl": "https://nystagereview.com/2022/10/02/leopoldstadt-tom-stoppard-at-his-absolute-autobiographical-best/"
}
