{
  "showId": "leopoldstadt-2022",
  "outletId": "nytg",
  "outlet": "New York Theatre Guide",
  "criticName": "Gillian Russo",
  "url": "https://www.newyorktheatreguide.com/reviews/leopoldstadt-broadway-review-tom-stoppard",
  "publishDate": null,
  "fullText": "In the opening tableau of Tom Stoppard's Leopoldstadt, a Jewish family, nearly 30 strong, assembles in a lavish sitting room and looks forward as if posing for a family portrait. A camera flashes. Haunting piano music plays. This moment dares us to remember — to sear these people, their multitude, their grandeur into our minds — before it's too late to salvage them from history. It is, indeed, a deeply personal dare from Stoppard himself, who never knew of his own Jewishness until his 50s, when a previously unknown relative made contact. With Leopoldstadt, the playwright declares his own heritage in first-rate, epic, and urgent fashion, seemingly atoning for lost time. Forgetting one's ancestors, he suggests, is its own tragedy: \"It's like a second death,\" one character says, \"to lose your name in a family album.\" Leopoldstadt spans 1899 to 1955, so another tragedy looms large: the Holocaust. The extended Merz-Jacobowitz family are well-off Viennese citizens who largely believe themselves Austrian above all else — that is, assimilated, and therefore immune from any anti-Semitism worse than being denied admission into a jockey club. As they inch closer to the onset of World War II with each scene, their home gets shabbier, their numbers smaller, and their Jewishness inescapable. Smartly, Stoppard did not write Leopoldstadt as a Holocaust play. Impending doom lurks in Adam Cork's chilling score, but otherwise, the show is a lively, rich family drama. We're invited into the Merz-Jacobowitzes' commonplace gatherings, debates, trysts, squabbles, and playtimes as though we, too, are kin. There's a healthy helping of intellectual talk — Stoppard's specialty — but it's not esoteric, and in the hands of a superb Brandon Uranowitz, who gets to philosophize the most as the mathematician Ludwig, it's endlessly captivating. Plus, subjects like math are just as often the butt of jokes, of which there are plenty. Stoppard also warms us up to the characters with his trademark witty humor; a misunderstanding between a circumciser and a cigar cutter even provides a full-blown laugh-out-loud moment. Elevating Stoppard's smart writing is Patrick Marber's equally smart direction. He paces Leopoldstadt perfectly, such that its intermissionless two-plus hours fly, and ensures that none of the 30-plus characters get lost, despite only a few having a consistently large presence. Together, they allow us to know the Merz-Jacobowitzes as full people and not just as victims, so by the play's climax — a harrowing repossession of the family home by Nazis, the beginning of the end — we're shaken and shocked, even though history has already dictated what will happen. In other words, true to its goal, Leopoldstadt presents stories one won't easily forget, and won't want to. But lest we might, the play's final scene urges us even more explicitly to remember, finishing the work that opening portrait started. Uranowitz appears again, this time as Nathan, one of the family's few survivors who is now grown. He's visiting his now-derelict family home once more, this time with Rosa, his aunt who had escaped to New York, and Leo, a cousin from England with almost no recollection of that fateful repossession, and no connection to his Jewish heritage. (Yes, the character is a stand-in for Stoppard.) As Nathan chastises Leo for forgetting, he also succeeds in sparking one memory. And suddenly, the family comes flooding back on stage as a bygone era comes to life once more. Again, they look out at the audience, but now they have names. Journeys. Causes of death. Stories of life. Like Stoppard and the masterwork that is Leopoldstadt itself, they will be immortalized in history. Leopoldstadt is at the Longacre Theatre. Get Leopoldstadt tickets now. Photo credit: Brandon Uranowitz, Caissie Levy, Faye Castelow, and David Krumholtz in Leopoldstadt. (Photo by Joan Marcus) Originally published on Oct 3, 202211:14",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Smartly, Stoppard did not write Leopoldstadt as a Holocaust play. Impending doom lurks in Adam Cork's chilling score, but otherwise, the show is a lively, rich family drama. We're invited into the Merz-Jacobowitzes' commonplace gatherings, debates, trysts, squabbles, and playtimes as though we, too, are kin. There's a healthy helping of intellectual talk — Stoppard's specialty — but it's not esoteric, and in the hands of a superb Brandon Uranowitz, who gets to philosophize the most as the mathematician Ludwig, it's endlessly captivating. Plus, subjects like math are just as often the butt of jokes, of which there are plenty. Stoppard also warms us up to the characters with his trademark witty humor; a misunderstanding between a circumciser and a cigar cutter even provides a full-blown laugh-out-loud moment.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-LEOPOLDSTADT-Opens-on-Broadway--Updating-Live-20221002",
  "showScoreExcerpt": "\"True to its goal, 'Leopoldstadt' presents stories one won't easily forget, and won't want to.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/leopoldstadt-broadway-review-tom-stoppard",
  "sources": [
    "show-score-playwright",
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "textWordCount": 630,
  "archivePath": "data/archives/reviews/leopoldstadt-2022/nytg--gillian-russo_2026-02-04.html",
  "textFetchedAt": "2026-02-04T16:52:20.230Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 630,
  "tierReason": "Full review text",
  "bwwScore": 10
}
