{
  "showId": "leopoldstadt-2022",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/leopoldstadt-makes-it-to-broadway-with-more-work-to-go-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/leopoldstadt-makes-it-to-broadway-with-more-work-to-go-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "It is, unfortunately, not a very good play. Though intelligently directed by Patrick Marber as a drawing room drama perpetually intruded upon by antisemitism, it manages to say very little during its 2-hour-without-intermission runtime. Stoppard apparently had not realized his own connection to Judaism until the 1990s, and the suddenness of his engagement with these themes is evident. His characters, the males one at least, spend the better part of the first hour explaining antisemitism to each other in increasingly dull ways. As such, it is a 'now more than ever' / 'til it happens to you' hit parade that extinguishes not only dramatic tension but any sort of dynamic engagement with what little plot there is, aside from a love triangle early on that coalesces into absolutely nothing.",
  "bwwScore": 5,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-LEOPOLDSTADT-Opens-on-Broadway--Updating-Live-20221002",
  "fullText": "The company of Leopoldstadt | Photo: Joan Marcus\n\nWith its huge, 38-person cast, sumptuous period costumes and raked stage, Tom Stoppard’s Leopoldstadt feels like a major Broadway play—the kind we haven’t seen in decades. Set across several of those as well, from 1899 through 1955, its scope is as impressive as its subject matter: the steady othering experienced by a Jewish family in Vienna, whose initial agnosticism solidifies into a strong sense of ethnic pride as the world closes in on them.\n\nIt is, unfortunately, not a very good play. Though intelligently directed by Patrick Marber as a drawing room drama perpetually intruded upon by antisemitism, it manages to say very little during its 2-hour-without-intermission runtime. Stoppard apparently had not realized his own connection to Judaism until the 1990s, and the suddenness of his engagement with these themes is evident. His characters, the males one at least, spend the better part of the first hour explaining antisemitism to each other in increasingly dull ways. As such, it is a “now more than ever” / “til it happens to you” hit parade that extinguishes not only dramatic tension but any sort of dynamic engagement with what little plot there is, aside from a love triangle early on that coalesces into absolutely nothing.\n\nThe men—standouts David Krumholtz and an overly sentimental Brandon Uranowitz—are unlikable, frazzled and self-righteous, mouthpieces for dueling ideologies delivered here as if we haven’t been wallowing in them for the past century. The bulk of their dialogue consists of history lessons, Marxist ideals, and reminders of treaties signed and crossed. They also get some jokes, none of which land, such as “Poor boy, baptized and circumcised in the same week, what can you expect?” (The family contains a large Catholic segment.)\n\nThe women are at least allowed to have fun, with Eden Epstein as a 1920s flapper and Faye Castelow resplendent (and snatched, in a gorgeous gold corset designed by Brigitte Reiffenstuel, and wigs by Campbell Young Associates) among the best. The rest of the cast ranges from solid to very solid, depending on how much material the Avengers-style setup allows them to actually deliver. Later scenes, tightening in on the fewer family members left, is certainly more engaging, if you’re still paying attention.\n\nAn overreliance on projections (Isaac Madge) and sentimental music (Adam Cork) only drive home the littleness of the experience, though Richard Hudson’s decreasingly decorated set is quite a sight. Stoppard is a playwright of exquisite craft and fascinating interests, and I have to believe that this late-in-life turn inwards into his own history was satisfying and offered some sort of deliverance. I’m very glad for him.\n\n‍Leopoldstadt is in performance through January 29, 2023 at the Longacre Theatre on West 48th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 572,
  "archivePath": "data/archives/reviews/leopoldstadt-2022/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:12:33.762Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251212011702",
  "archiveOrgUrl": "http://web.archive.org/web/20251212011702/https://www.theatrely.com/post/leopoldstadt-makes-it-to-broadway-with-more-work-to-go-review",
  "contentTier": "complete",
  "wordCount": 572,
  "tierReason": "Full review text"
}