{
  "showId": "buena-vista-social-club",
  "outletId": "new-york-theatre-guide-gillian-russo",
  "outlet": "New York Theatre Guide (Gillian Russo)",
  "criticName": "Gillian Russo",
  "url": "https://www.newyorktheatreguide.com/reviews/buena-vista-social-club-off-broadway-review",
  "playbillVerdictUrl": "https://www.newyorktheatreguide.com/reviews/buena-vista-social-club-off-broadway-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Read our four-star review of Buena Vista Social Club, a new musical inspired by the Cuban music group of the same name, now off Broadway through December 31. \"This is not the story of a nation; this is the story of a band,\" music producer Juan De Marcos (Luis Vega) says at the top of Buena Vista Social Club. Maybe the musical isn't the story of Cuba, from where the same-named group hailed, but it is much more than the story of a band, too. \"Buena Vista Social Club\" is synonymous with a lightning-in-a-bottle cultural phenomenon: the group of Cuban musicians brought together, largely post-retirement, by De Marcos and others to record an album; that Grammy Award-winning album, which ushered in a renaissance of old-school Cuban dance music; the documentary film made about them, which was named to the National Film Registry in 2020; and the physical hall where many of BVSC's musicians got their start before the Cuban Revolution set in, upending their careers and shuttering the club alongside many others like it. That singular tale — of forgotten friendships, sounds, and struggles alike getting an unexpected and irreplicable second act — is the story of Buena Vista Social Club, part true, part dramatized. The resulting plot may be predictable, but the staging and music of Buena Vista are lush, vibrant, and celebratory. Director Saheem Ali's production is clearly designed as a showcase for the music anyway, and that's apparent from the the opening number, \"El Carretero.\" (All the songs are either instrumental or sung in Spanish.) The full band is front and center, and a large ensemble fluidly grooves along as though the song is a current, sweeping them up and carrying them where it desires. That irresistible impulse to just fall into the music carries throughout the show and extends to the audience. (Buena Vista is actually a show that makes you want to get up and dance, especially when Patricia Delgado and Justin Peck's explosive choreography kicks into high gear, but that's frowned upon in the theatre.) But nowhere is that submission more apparent than in Omara Portuondo (a potent Natalie Venetia Belcon), who abandons a mainstream singing career with her sister (\"a life we can control,\" her sister notably calls it) to remain in Cuba, even as the revolution mounts and her family leaves, and perform Cuban music at the BVSC. Decades later, her past regrets have hardened her — she eventually did pursue a solo career and left Compay Segundo and Ibrahim Ferrer, who introduced her to the BVSC, behind — but we watch in real time as recording with the BVSC dissolves her steely shell. A highlight of the show is the number \"Candela,\" particularly the part in which the exacting Omara dismisses the flute player — \"No one ever recorded a scorching rendition of anything with a flute,\" she claims — but when De Marcos asks him to play anyway, sure enough, the flute notes dance atop the melody like sparks, and Omara's charmed. Buena Vista leaps back and forth between this album recording in the '90s and the characters' early careers in the '50s. Ali achieves these shifts seamlessly and in a swift two hours. Some Act 2 plot points, including the rise of the Revolution, get rushed in the process, as does the musical's exploration of how colorism impacts the musicians' opportunities, particularly Ferrer's. The ending is thus bittersweet — that in this version of Buena Vista Social Club's story, it took decades for Ferrer and others to get the recognition they deserved. But getting to hear their music live at the Linda Gross Theater now is a unique and worthwhile treat. Buena Vista Social Club is at Atlantic Theater Company's Linda Gross Theater through December 31. Photo credit: Jared Machado (at microphone with guitar) and the company of Buena Vista Social Club. (Photo by Ahron R. Foster) Hear the Grammy-winning eponymous album by Buena Vista Social Club come to life on stage in this 10-time Tony Award-nominated production. Discover how the pioneering music group revitalized the Cuban music scene and ushered in its Golden Age in this show that honors the vibrant, timeless sounds of the Caribbean. The running time of Buena Vista Social Club is 2hr 10min. Incl. 1 intermission. Buena Vista Social Club is playing at Gerald Schoenfeld Theatre . The theatre is located at 236 West 45th Street (between Broadway and 8th Avenue), New York, 10036. Tickets for Buena Vista Social Club start at $64. The recommended age for Buena Vista Social Club is Ages 8+. Children under 4 are not permitted in the theatre.. Book tickets for Buena Vista Social Club on New York Theatre Guide. Originally published on Dec 13, 202321:30",
  "isFullReview": true,
  "textWordCount": 787,
  "archivePath": "data/archives/reviews/buena-vista-social-club/new-york-theatre-guide-gillian-russo--gillian-russo_2026-02-01.html",
  "textFetchedAt": "2026-02-01T15:11:11.504Z",
  "designation": "Recommended",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright"
}