{
  "showId": "mj-2022",
  "outletId": "amny-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.amny.com/entertainment/theater/review-mj-is-a-sanitized-michael-jackson-tribute/",
  "publishDate": null,
  "fullText": "“What do you have to say about the recent allegations?” a mob of reporters and paparazzi ask Michael Jackson at a press conference towards the end of the first act of the new Broadway musical “MJ.”  While it’s unclear what particular “allegations” they are referring to, accusations of child molestation are never mentioned in “MJ.”\n\nConveniently, “MJ” (which is being produced by special arrangement with the Michael Jackson Estate) takes place in 1992 (along with repeated flashbacks to the past) as Jackson rehearses for the Dangerous World Tour. The child molestation charges against Jackson (which received new attention in 2019 with the airing of the HBO documentary “Leaving Neverland”) did not first become public until 1993.\n\nDepending on one’s inclination, “MJ” can be seen as a slick and lively tribute concert (with dancers, back-up singers, Jackson impersonators, and elaborate homage choreography), a by-the-numbers bio-jukebox musical (really not so different from all the others out there), or a defiant public relations effort to rebrand and refocus Jackson’s image, reputation, and legacy.\n\nPerhaps in an attempt to gain artistic credibility, “MJ” has direction and choreography by Christopher Wheeldon (“An American In Paris”) and a book by two-time Pulitzer-winning playwright Lynn Nottage (“Intimate Apparel,” “Sweat”). However, as it stands, “MJ” could have easily been the work of less talented and innovative artists.\n\nThe biographical concept behind “MJ” is that Jackson (Myles Frost, smooth and tender), prodded by questions from an insistent documentary filmmaker (Whitney Bashor, doing her best in an empty vessel sort of role), recalls and revisits his past, including the formation of the Jackson 5, his troubled relationship with his family, and his 1980s glory days. To make this happen, Jackson’s co-workers take on new roles in his mind. For instance, Quentin Earl Darrington, who plays the director of Jackson’s tour, suddenly morphs into a brusque and threatening Joseph Jackson. In a device carried over from jukebox musicals about Donna Summer and Cher, younger versions of Jackson also pop up.\n\nJackson is depicted sympathetically as a misunderstood artist, perfectionist showman, merry prankster, mega-philanthropist, and tragic victim of unrealistic expectations, invasion of privacy, physical and emotional abuse, and opioid addiction.\n\nThe show includes no less than 37 songs, including all the familiar favorites (i.e. “Thriller, “ “Beat It,” “Don’t Stop Til You Get Enough,” “Bad,” “Smooth Criminal,” “Black or White,” “Man in the Mirror”) and some unexpected entries, including Rodgers & Hammerstein’s “Climb Every Mountain” (which Jackson sings at a first-grade talent show) and “For the Love of Money” (as the Jackson family pressures Michael to appear in the Victory Tour). Attempts to integrate the songs directly into dialogue (such as when Katherine Jackson sings “I’ll Be There” to her son) are less than successful.\n\nIt is entirely possible to accept “MJ” for what it is and have a decent enough time. But what’s the point of spending money to attend “MJ” when one can easily watch Jackson’s greatest music videos on YouTube – in addition to countless uncensored documentaries about Jackson. Ironically, in “MJ,” Jackson urges people to ignore the scandals and focus on his music. Perhaps the producers of “MJ” should have taken Michael’s advice and instead done a plotless, dance-centric revue rather than awkwardly try to tiptoe around the scandals.\n\n&#8220;MJ&#8221; plays at the Neil Simon Theatre, 250 W. 52nd St., mjthemusical.com.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "partial",
  "textWordCount": 553,
  "archivePath": "data/archives/reviews/mj-2022/amny-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:28:00.128Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250803025521",
  "archiveOrgUrl": "http://web.archive.org/web/20250803025521/https://www.amny.com/entertainment/theater/review-mj-is-a-sanitized-michael-jackson-tribute/",
  "textIssues": [
    "Show title not found in text"
  ]
}