{
  "showId": "mj-2022",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Charles Isherwood",
  "url": "https://broadwaynews.com/2022/02/01/review-a-flashy-mj-dazzles-and-distracts-with-dance/",
  "publishDate": "February 1, 2022",
  "fullText": "“Is it really possible to separate your life from your music?” asks the pesky documentary filmmaker in “MJ,” the Michael Jackson musical at Broadway’s Neil Simon Theatre.\n\nThe question hangs like a fog of stage smoke over this slickly produced show, as it attempts to weave together both the life and the music — but without quite delving into the more disturbing aspects of the former. (This comes as little surprise, since the musical was produced “by special arrangement with the estate of Michael Jackson.”)\n\n            This post is for paying subscribers only\n            Subscribe now\n            Already have an account? Sign in\n\n      Review — MJ — Natasha Katz — Lynn Nottage — Roy Furman — Latitude Link — James L. Nederlander — Quentin Earl Darrington — Peter Nigrini — Paul Tazewell — Gareth Owen — Derek McLane — John Gore Organization — Christopher Wheeldon — Lia Vollack — Jason Michael Webb — Whitney Bashor — Gabriel Ruiz — Antoine L. Smith — Joey Sorge — Raymond Baynard — John Edwards — Ayana George — Kali May Grinder — Apollo Levine — Ryan VanDenBoom — Lamont Walker II — Zelig Williams — Kumiko Yoshii — Sony Music Entertainment — Charles LaPointe — Sony Pictures Entertainment — Myles Frost — Tavon Olds-Sample — Carina-Kay Louchiey — Walter Russell III — Christian Wilson — Devin Trey Campbell — Michelle Mercedes — Kyle Robinson — John Branca — John McClain — Cue to Cue Productions — Naoya Kinoshita — Candy Spelling — Stephen C. Byrd — Sandy Robertson — Ed Walson — Peter W. May — CJ ENM — Martin Bandier — Michael Cassel Group — Albert Nocciolino — Playful Productions — Ken Schur — Willette & Manny Klausner — David Holcenberg — Joe Dulude II\n\n                    Introductory Offer\n\n                $1/month for 3 months\n\n                Subscribe\n\n              Already have an account?\n              Log in",
  "originalScore": null,
  "assignedScore": null,
  "dtliThumb": "Down",
  "source": "dtli",
  "scrapedAt": "2026-01-23T22:02:20.446Z"
}