{
  "showId": "mj-2022",
  "outletId": "deadline",
  "outlet": "Deadline",
  "criticName": "Greg Evans",
  "url": "https://deadline.com/2022/02/mj-broadway-review-michael-jackson-musical-1234922944/",
  "publishDate": "February 1, 2022",
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": "Myles Frost in 'MJ' Matthew Murphy Has any Broadway production in recent (or even not so recent) memory arrived with as much emotional baggage &#8211; or carried it as lightly &#8211; as the visually and sonically ravishing MJ ? The Michael Jackson musical, as unlikely as such a prospect might have seemed a year ago, now appears poised to take Manhattan with the same hurricane force that the real Jackson funneled when he moonwalked into television history on Motown 25 . If MJ can&#8217;t contain the shock of the new that turned his 1983 television performance into an era-defining moment, it is in no short supply of its own thrills, not least the reminder, after all these years of scandal and accusations, that we once observed, in real time, the blossoming of undeniable talent into unavoidable genius. That&#8217;s a transition, not since equaled, that director-choreographer Christopher Wheeldon, book write Lynn Nottage and an impeccable cast led by the star-is-born Myles Frost, bring to pulse-quickening life on the stage. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-dsk-tab-mid-article1-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid\",\"mid-articleX\",\"mid-article\",\"300x251\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[2,2],[300,250],[620,350],[300,251],[501,282],[3,3],[2,4],[4,2],[620,366]]) .exemptFromSleep() .setClsOptimization(\"minsize\") ; }); Related Stories Casting &#039;Just In Time&#039;: Jeremy Jordan To Succeed Jonathan Groff As Broadway&#039;s Bobby Darin",
  "showScoreExcerpt": "\"Watching MJ, one easily suspects its top-flight creative team was motivated by the same near-maniacal drive. Aside from the pedestrian framing device, MJ pushes hard and unceasingly to move beyond the just-good-enough nostalgia that can turn even second-rate jukebox productions into crowd pleasers. It succeeds: MJ is a wildly entertaining marvel.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:05:12.838Z",
  "dtliThumb": "Up"
}
