{
  "showId": "mj-2022",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "Lovia Gyarkye",
  "url": "https://www.hollywoodreporter.com/lifestyle/arts/mj-broadway-review-lynn-nottage-1235085086/",
  "publishDate": "February 1, 2022",
  "fullText": "MJ, a remarkable Broadway musical written by Lynn Nottage and directed and choreographed by Christopher Wheeldon, deftly probes this weighty topic. The show was produced by arrangement with the musician’s estate, and uses Jackson’s archives and place within the public’s imagination to conduct a Freudian analysis of the artist’s life. How do you tell a story of a person who dissolved into the roles he created for himself and the roles the public created for him? Well, it depends on where and when you start.",
  "isFullReview": false,
  "dtliExcerpt": "MJ, like its subject, is captivating and hard to shake. The musical takes audiences through Jackson's life and catalog with impressive ease, expertly chronicling major milestones. After breaking up with Motown records, Michael goes to Epic, where he works with Quincy Jones to produce Off the Wall and Thriller. His vision and work ethic become more exacting, his drive to best himself at once breathtaking and worrisome. As the narrative burrows deeper into Michael's mind, the toll his artistry took on him is clear. He wanted to bring his audiences joyful and spectacular experiences, but he felt isolated and misunderstood.",
  "showScoreExcerpt": "\"During a preview I attended, an audience member rose to her feet and waved her hands in the air, as if she had caught the Holy Spirit: an affirmation that to be in Jacksonâs presence â even if only through gifted performers â is to experience a spiritual rapture. \n\nMJ, like its subject, is captivating and hard to shake. The musical takes audiences through Jacksonâs life and catalog with impressive ease, expertly chronicling major milestones.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-MJ-Opens-on-Broadway--See-What-the-Critics-Are-Saying-20220201",
  "dtliThumb": "Up"
}