{
  "showId": "mj-2022",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=ON975H",
  "publishDate": null,
  "fullText": "First, there's the dancing. Indeed, MJ, the Michael Jackson bio musical, throbs with movement -- swift, angular, a melding of tension and energy that can't help but captivate. Director/choreographer Christopher Wheeldon, from the world of ballet but an astute student at the MTV school of dance, creates any number of dynamic, gravity-defying compositions that have audience members rocking in their seats. (He is aided by the longtime Jackson associates Rich + Tone Talauega.) Indeed, Wheeldon gives the entire production a restless pulse, moving through time with cinematic fluidity. Among the highlights: A hit parade of soul stars seizing the stage for a medley of \"(Your Love Keeps Lifting Me) Higher and Higher,\" \"Shout,\" and \"Papa's Got a Brand-New Bag.\" A performance of \"Wanna Be Startin' Somethin' that turns, in an instant, into a night of revelry at Studio 54 followed by a triumph at the Grammy Awards. A press conference that morphs into a nightmarish feeding frenzy set to \"They Don't Care About Us.\" Throughout, Wheeldon works in the tradition of Jerome Robbins and Michael Bennett, deploying people, scenery, and lighting in a frenzy of perpetual motion. Still, the fanciest choreography is executed by Lynn Nottage, whose book tap-dances around the many too-hot-to-handle issues attached to its central character. One of our boldest and most accomplished playwrights has turned surprisingly timid, nervously raising sensitive matters before instantly whisking them away, all but condemning the audience for harboring such wicked thoughts. Nottage gives into her inner fangirl, rendering Jackson as a wounded, saintly figure, too pure for a fallen world populated with bean-counting executives and other philistines. This combination of stunning technical expertise (including a superb production design) and faint-hearted playwriting yields a show that is both startlingly better and infinitely worse than the average Broadway bio musical. Because Jackson's story doesn't fit one of the genre's two templates -- the friends-fall-out theme seen in Jersey Boys and Ain't Too Proud, or the triumphant diva scenario of Beautiful, Tina, and The Cher Show -- Nottage builds MJ's action around rehearsals for the Dangerous Tour, catching her leading character in a moment of vulnerability. It is 1992; he isn't selling tickets like he once did, and musical tastes are changing thanks to the onset of hip-hop and the Seattle grunge crew. Moreover, people are getting uneasy about the star's increasingly bizarre behavior. The choice of year is interesting, as it frees Nottage from dealing with Jackson's bizarre marital episodes and the accusations of child molestation, all of which came later. The really damaging scandals are banished offstage, left waiting in the wings. Instead, the Jackson we get is a lonely, driven figure, haunted by his father's withheld love, his pursuit of perfection starting to have destructive consequences on his finances and well-being. Hell-bent on topping his previous tours, he scraps one elaborately staged sequence after another, demanding new and untried staging tricks involving toaster lifts and jetpacks. The constant indecision drives Rob, his director, up the wall, while Dave, his accountant, warns that money is running out and it may be necessary to mortgage Neverland, Jackson's self-described sanctuary. Meanwhile, an MTV reporter hovers on the margins, taking note of Jackson's dependence on painkillers. This putting-on-a-show scenario, which is as old as Ruby Keeler and Dick Powell, works reasonably well for the first act, which slips between 1992 and the more distant past, as Joe Jackson assembles the Jackson 5, Berry Gordy rockets the act to fame, and Michael, sick of his father's abuse and desperate for his approval, hones a solo act, leaping across the racial barrier into MTV rotation and netting an armful of Grammys for the album Off The Wall. This economically structured scenario, staged to some of the most irresistible pop music ever written and backed by company of dancers who seem to have wires and springs in place of musculature, delivers plenty of theatrical excitement. Furthermore, a top design team delivers a constantly shifting environment that catches the musical's ever-changing moods. It's a beautiful example of multiple disciplines working to unified effect. The side windows in Derek McLane's industrial-looking dance studio admit an array of set pieces, allowing for rapid transitions to hotel rooms, TV studios, and the Apollo Theatre on amateur night; the designer's chef d'oeuvre is a dark Manhattan alley, lit with neon signs, that adds a distinctive film noir touch. Behind the studio's large upstage window is a screen displaying Peter Nigrini's projections of The Ed Sullivan Show, the Cotton Club, an art deco skyline right out of a Fritz Lang film, and the familiar animated opening of Soul Train. Scenery and video work in perfect tandem during the press conference sequence: Two drops, depicting shards of broken glass, fly in, with images of tabloid headlines delivered to each jagged surface. Similarly, lighting designer Natasha Katz works with entire batteries of set electrics, including miles of LED tape, shifting with perfect ease between straightforward rehearsal-room washes and boldly theatrical effects, many of them using sweeping light curtain looks. Gareth Owen's sound design is packed with punch, especially the reverberant bass lines that support many numbers. (Crystalline diction is not a priority with the cast, so don't expect to get most of the lyrics; I suppose the numbers are so well-known that it scarcely matters.) All the design elements come together at the climactic moment, at the opening of the Dangerous Tour, for a coup de théâtre that is the most exciting bit of staging I've seen all season. Paul Tazewell's decades-spanning (and sometimes highly stylized) costumes feel unfailingly right throughout, especially when recreating Jackson's signature looks. As MJ, the adult Michael Jackson, Myles Frost dances with brio and captures the star's distinctive vocals; he also nails the character's soft-spoken, choir-boy voice and steely pursuit of perfection. He doesn't shy away from showing the character's spiky defensiveness and his knack for dropping people who are no longer useful. But this is as far as MJ is willing to go, preferring to see him as the put-upon victim of malign forces. (\"The media. The lies,\" he says in anguish. \"Have you read what they're saying?\") The book's peekaboo strategy toward its subject is a source of frustration. \"What do you have to say about the recent allegations?\" barks a reporter. And what allegations would they be? \"Can you tell me who the hell is this family that he wants to bring on the tour?\" asks the stage manager. \"It's gonna raise some questions.\" It sure will, but don't expect answers here. Defending his boss, Rob says, \"He's battling demons I don't understand.\" Nor, apparently, does anyone involved with MJ. The refusal to deal with Jackson's character means that there is virtually no second act, so Wheeldon rolls out a trio of dream ballets. \"Smooth Criminal,\" performed with Fred Astaire, The Nicholas Brothers, and a gaggle of Bob Fosse dancers, delights. \"Human Nature,\" delivered against pink and orange-tinted LA skylines, is a pleasant head-scratcher. Hold on for \"Thriller,\" staged in a day-of-the-dead carnival filled with flower-adorned skulls and featuring Jackson being devoured by zombies who represent his personal demons. It's as bonkers as anything in Diana, the now-closed farrago about the British Royals. The refusal to examine Jackson's dark side, to say nothing of musical staging that shows him menaced by monsters and transformed into a helpless marionette, adds an unwelcome note of sanctimoniousness. His philanthropic side is showcased in his plan to raise $100 million for his charity Heal the World. And he waxes theological, saying \"I want people to feel that closeness to God that I feel when I'm writing music.\" In the eleven o'clock slot, \"Man in the Mirror\" is used to suggest that Jackson is finally making his peace with the past. It is, to put it mildly, a bit of a stretch. So, too, is the moment when he literally embraces his inner child. Frost is unfailingly skilled throughout, the very definition of a triple threat, even if he can't quite get at the authority, mixed with coiled rage, that defined Jackson's performances at the time. The only other substantial role goes to the fine Quentin Earl Darrington, double-cast as Rob, the director, and the tyrannical Joe Jackson. Walter Russell III, who alternates with Christian Wilson, is solid as the ten-year-old Little Michael, and, at the performance I attended, Lamont Walker II capably covered the role of Michael, the young adult Jackson. As the singer's mother, Katherine, Ayana George delivers \"I'll Be There\" in warmly maternal fashion. Whitney Bashor nicely handles the thankless role of Rachel, the prying MTV journalist. MJ is a strange experience, at once dazzling and unsatisfying, a peerless display of pizzazz with nothing underneath. If you go, stay for the sheer showbiz thrill of it all. (Readers of LSA will want to study the plentiful design/tech expertise on tap.) But even if you don't believe the worst about Michael Jackson, he was, by all accounts, possessed of a deep-dyed eccentricity to which this show never comes close. Indeed, it has no interest in trying. --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "partial",
  "textWordCount": 1523,
  "archivePath": "data/archives/reviews/mj-2022/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:31:20.901Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ]
}