{
  "showId": "mj-2022",
  "outletId": "THLY",
  "outlet": "Theatrely",
  "criticName": "Juan A. Ramirez",
  "url": "https://www.theatrely.com/post/mj-the-musical-is-a-monument-to-misconduct-review",
  "publishDate": "2022-02-01",
  "fullText": "Walking into MJ: The Musical, the new Michael Jackson bio-jukebox now in performances at the Neil Simon Theatre, I was going up against two things: while it is catchy and influential, I’ve never particularly enjoyed the man’s art, and I was skeptical that his estate, which is producing the show, would venture into the child sexual assault allegations that plagued the later half of his life. \n\nI was surprised on both counts. The sharp, talented cast sold me on music Jackson himself often couldn’t, and the story not only addresses the allegations, however sideways, but raises a defiant middle finger to anyone who dares bring up concerns about the late performer’s conduct when discussing his legacy. Of course, as the words “child sexual assault” would make for kind of a musical theatre bummer, the “allegations” leveled against him only amount to whether he sleeps in an oxygen chamber or got a nose job. \n\nLynn Nottage’s book has an MTV film crew interviewing Jackson (Myles Frost, selling it) and his team as they prepare for 1992’s Dangerous World Tour and, through Rachel (Whitney Bashor) the documentarian’s questions, we get relevant flashes to his past, musical and historical, where he is played as a teenager, by the phenomenal Tavon Olds-Sampler, and as a child, by the alternating Christian Wilson (at the performance I attended) and Walter Russell III. These flashbacks are further tied to his present by having the same actors play family members and current collaborators; the capable Quentin Earl Darrington, for example, plays both his abusive father, Joseph, and his tour director. As far as biomusical concepts go, it’s pretty ingenious, but any reach towards truth or reckoning in Nottage’s work is hampered (I should assume, and hope) by the estate’s demands to deify Jackson.\n\nRachel is a familiar villain, a nosy tabloid creature who cares less about Jackson’s music than about getting the scoop on his front-page scandals. A few times, she questions him directly and, though word associations between “Michael Jackson” and “allegations” point straight in one direction, the story is conveniently set the year before the first wave of accusations, so the vague term is used to channel contemporary concerns of reprehensible behavior into public relation softballs. Nottage plays “Gotcha!” with the audience a few times, like when Rachel asks if the rumors are true… that he dyes his skin! “No,” he replies, “I love being a Black man.” Applause; subject is buried, and act one closes with a melodramatic showdown between Jackson and, again, “the accusations.”\n\nSo we’re made to side with Jackson — frustrating, but understandable enough. What do we learn about him? We hear of his being demanding during rehearsals, that he’s “going through a lot,” that he had a tough life, but none of this is explored or even explained in any meaningful way. We’ve seen troubled backstories before, heard how exacting and uncompromising A-listers can be, so if MJ: The Musical is going to wash away the sins and focus on the person, at least bring something new to the table that matches the brilliance of his artistry.\n\nAn all-out number where Jackson dances with Bob Fosse, Fred Astaire, and the Nicholas Brothers is touching and electric, a tribute to a long lineage of showmanship. Christopher Wheeldon directs the scene well and, in also choreographing, mostly sticks to the original moves, expertly performed by the cast. Most numbers, though, only get the one-verse-one-chorus treatment, underwhelmingly semi-staged within Derek McLane’s rehearsal studio set. It’s easy to see how an Estate full of lawyers dreamed this production up, as its production’s go-to solution is to throw money at a problem until it goes away. So we have near-constant costume changes (by Paul Tazewel), a blaring sound design (Gareth Owen), and expensive looking lighting and projections (by Natasha Katz and Peter Nigrini, respectively) overstimulating the senses, in case anyone should raise any objections to the material.\n\n“The songs are the real star, not the singer,” Michael says he learned from Berry Gordy. So the cheers continue, the hips involuntarily shake during “Billie Jean,” the discourse inevitably winds itself up. “It’s a generational thing! His work is so influential!” Sure, but there’s separating the art from the artist — what you choose to listen to on your daily jogs is your business — and there’s mounting a multi-million dollar monument to a man whose last headline appearance was in 2019, when Leaving Neverland, a blistering documentary about the trauma sustained by two of his alleged child victims, premiered on HBO. We cannot deny Michael Jackson his talent and earth-shattering impact, but blind worship is, at this point, grossly irresponsible.\n\nI also cannot take away from the ensemble, which is uniformly terrific. As for the leads, Ayana George delivers a lovely “I’ll Be There” as Jackson’s mother; anything Wilson does as the teenage Michael is sensational; and Frost manages to bring out the best from the man in the cracked mirror. But as Jackson says in the second act, “We have the icing, but it doesn’t mean anything unless the cake tastes good,” and no amount of frosting could make this amoral mud pie any easier to swallow.\n\nMJ: The Musical is now in performance at the Neil Simon Theatre on West 52nd Street in New York City. For tickets and more information, visit here.",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 40,
  "source": "scraped",
  "needsFullText": true,
  "scrapedAt": "2026-01-23T21:55:11.096Z",
  "bwwExcerpt": "So we're made to side with Jackson - frustrating, but understandable enough. What do we learn about him? We hear of his being demanding during rehearsals, that he's \"going through a lot,\" that he had a tough life, but none of this is explored or even explained in any meaningful way...."
}
