{
  "showId": "mj-2022",
  "outletId": "timeout-ny",
  "outlet": "Time Out New York",
  "criticName": "Adam Feldman",
  "url": "https://www.timeout.com/newyork/theater/mj-broadway-review-michael-jackson-musical",
  "publishDate": "February 1, 2022",
  "fullText": "Toward the end of MJ, If you look closely, there are signs of what might be interpreted as foreshadows of the times to come. “I can give people what they want, but when I step off stage, it, um, gets complicated,” Michael admits. “And do you think people really wanna see my life? There’s been some dark struggles&#8230;Things I can’t…” There he drifts off, to finish singing “Human Nature” and move on to “Bad.” A climactic dark-carnival staging of “Thriller” follows, which is ostensibly about Jackson’s fear of his controlling father but also involves demon versions of himself. “Listen to my music,” says Michael to his interviewer. “It answers any questions you might have.” Does it? I left the theater entertained, but not convinced I had really seen the man in the smoke and mirrors.",
  "originalScore": null,
  "assignedScore": null,
  "dtliThumb": "Meh",
  "source": "dtli",
  "dtliExcerpt": "Toward the end of MJ, If you look closely, there are signs of what might be interpreted as foreshadows of the times to come. “I can give people what they want, but when I step off stage, it, um, gets complicated,” Michael admits. “And do you think people really wanna see my life? There’s been some dark struggles&#8230;Things I can’t…” There he drifts off, to finish singing “Human Nature” and move on to “Bad.” A climactic dark-carnival staging of “Thriller” follows, which is ostensibly about Jackson’s fear of his controlling father but also involves demon versions of himself. “Listen to my music,” says Michael to his interviewer. “It answers any questions you might have.” Does it? I left the theater entertained, but not convinced I had really seen the man in the smoke and mirrors.",
  "showScoreExcerpt": "\"The dancers and singers of the ensemble, who double as secondary characters, are first-rate, and Wheeldon gives them a lot to do. Most of the songs are performed as rehearsals or flashbacks, which is to say as full-on production numbers. (Tracks from Jacksonâs 1995 album HIStory are cannily placed by Nottage as character moments.) Like Summer and The Cher Show before it, MJ uses three actors to play its central character at different ages. As the 1992 incarnation, Frost carries the bulk of the role, and not only nails Jacksonâs signature sound and movesâyes, of course thereâs a moonwalkâbut also his otherworldly affect: his diffident grandiosity, his mixture of grievance and mischief, his high and breathy way of talking (at once floaty and determined, like Diana Rossâs spoken-word section of âAinât No Mountain High Enoughâ).\""
}