{
  "showId": "mj-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Charles Isherwood",
  "url": "https://au.variety.com/2025/music/news/mj-the-musical-sydney-preview-tickets-20180/",
  "publishDate": "February 2, 2022",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "The show offers a glossy, sanitized celebration of Jackson's artistry that sidesteps the more troubling aspects of his legacy while delivering the elaborate song-and-dance spectacle that Broadway audiences crave.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The show offers a glossy, sanitized celebration of Jackson's artistry that sidesteps the more troubling aspects of his legacy while delivering the elaborate song-and-dance spectacle that Broadway audiences crave.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "previousUrl": "https://variety.com/2022/legit/reviews/mj-the-musical-review-broadway-1235179126/",
  "urlDiscoveredAt": "2026-02-06T08:32:42.823Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 319,
  "archivePath": "data/archives/reviews/mj-2022/variety--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:32:42.826Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251016191048",
  "archiveOrgUrl": "http://web.archive.org/web/20251016191048/https://au.variety.com/2025/music/news/mj-the-musical-sydney-preview-tickets-20180/",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Due to overwhelming demand for tickets, front row seats can now be snapped up for the upcoming “MJ the Musical” Sydney season.\n\nVariety AU/NZ can confirm that front row seats to the upcoming previews from February 26th for the Tony Award-winning musical at the Sydney Lyric Theatre are now available to purchase due to almost all preview performances being sold out.\n\nThe demand for tickets has been so high, that the season has been extended through to May 2025\n\n“We’ve been amazed by Australia’s overwhelming enthusiasm for this show,” Australian producer Michael Cassel told Variety AU/NZ.\n\n“People simply can’t wait to celebrate the music, the artistry, the inspiration and the extraordinary creativity of Michael Jackson.”\n\n“We are delighted to be able to give the biggest fans access to the best seats in the house, and the chance to be among the first people in the country to see this phenomenal production from the genius minds of Tony award-winning director and choreographer Christopher Wheeldon and Pulitzer Prize-winning writer Lynn Nottage.”\n\nRoman Banks, who made history as the first African American performer to star in “Dear Evan Hansen” on Broadway, will make his Australian debut with “MJ.” Since then, he’s appeared in Disney+’s “High School Musical: The Musical: The Series” and led the US national tour of “MJ,” earning rave reviews.\n\n“MJ the Musical” takes audiences back to 1992, offering a behind-the-scenes look at the creation of The King of Pop’s “Dangerous” World Tour. It explores the collaborative process that shaped the tour and delves into Jackson’s creative vision and personal challenges.\n\nFeaturing over 25 of Jackson’s greatest hits, including “Beat It,” “Smooth Criminal,” “Man in the Mirror” and “Thriller,” the musical has wowed audiences worldwide. Since opening on Broadway in February 2022, it’s been seen by over a million people and won four Tony Awards, including Best Choreography for Christopher Wheeldon and Best Actor in a Musical for Myles Frost.",
  "_showNotMentionedDiscoveryAttempted": true
}
