{
  "showId": "mj-2022",
  "outletId": "WASHPOST",
  "outlet": "The Washington Post",
  "criticName": "Peter Marks",
  "url": "https://www.washingtonpost.com/theater-dance/2022/02/01/mj-michael-jackson-musical/",
  "publishDate": "2022-02-01",
  "fullText": "Myles Frost as Michael Jackson with the ensemble of “MJ.” (Matthew Murphy) Placeholder while article actions load NEW YORK — It’s such a glittering piece of bio-drama — slickly constructed, devised for maximum dazzle — that even the famous white glove dotted with Swarovski crystal gets its own round of applause. I’m speaking, of course, of “MJ,” the new Broadway musical that dares to present the mountain of evidence for counting Michael Jackson among the greatest entertainers of the 20th century. Wp Get the full experience. Choose your plan ArrowRight I say dares because it took nerve for book writer Lynn Nottage and director-choreographer Christopher Wheeldon merely to have put the subject of Jackson before audiences at the Neil Simon Theatre, where the show had its official opening Tuesday. Jackson died in 2009 at the age of 50, dogged by tabloid stories of a bizarre private life and more seriously, accusations of sexual abuse of young boys that led to police investigations and civil and criminal lawsuits. That sordid history would not seem to have foretold a jukebox musical devoted to the upside of Jackson’s genius — and certainly not by artists of the caliber of two-time Pulitzer winner Nottage (“Ruined,” “Sweat”) and the celebrated ballet world fixture Wheeldon. The show’s decidedly selective memory may be off-putting to theatergoers appalled by the stories of Jackson’s alleged misdeeds. Nevertheless, the creative team’s painstaking work has resulted in a riveting, adrenaline rush of a show, propelled by remarkable dancing and a mesmerizing central performance by Myles Frost as the sleek, soft-spoken pop megastar. Lynn Nottage's Broadway play about life after incarceration finds its most avid audience in a New York jail Filled with exhilarating versions of the songs Jackson made into music videos and took on world tours, “MJ” is a dance musical of the first rank. If you look back at the choreography in those videos of the late 1980s and early 1990s — “Billie Jean,” “Beat It,” “Smooth Criminal” and, of course, “Thriller” — you’ll see that by comparison Wheeldon and the exquisite dancers of “MJ” have boosted the muscularity and grace of the pop star’s signature movements. It’s now a veritable Corps de Moonwalking. Advertisement The show includes some of the standard-issue building blocks of entertainment biography, of the sort popularized by precursors like “Jersey Boys,” “Ain’t Too Proud: The Life and Times of the Temptations” and “Tina: The Tina Turner Musical.” Jackson is played by three actors at the various stages of his career: Little Michael (pint-size dynamo Christian Wilson at my performance), in the Jackson 5 era; a maturing Michael (equally dynamic Tavon Olds-Sample); and Frost as adult Michael. The musical is largely set in 1992 in a Los Angeles rehearsal studio, where perfectionist MJ is preparing for a pivotal world tour and driving his director (the superb Quentin Earl Darrington) and his manager (Joey Sorge) crazy with budget-busting brainstorms and demands: Can he be catapulted onto the stage? Are banks of neon billboards possible? Can the dancers refine their techniques to his obsessive standards? The early-1990s cutoff gives the production a convenient out for not dealing head-on with the facets of Jackson’s story that have so tarnished his reputation — though not, perhaps, his popularity; the theater’s box office will be the judge of that. Nottage employs a bit of narrative sleight-of-hand, with only the most opaque of acknowledgments of the accusations to emerge later. “Who is this family he wants to bring on tour?” one of Jackson’s minions inquires, suggesting vaguely something untoward. Later, in the requisite news conference scene — why are reporters always costumed in trench coats? — someone shouts: “What do you have to say about the recent allegations?” (The question goes unanswered.) An MTV reporter, excellently handled by Whitney Bashor, is on hand during rehearsals, her observations of unsettling behavior limited to Frost’s Jackson downing too many painkillers and other pills. And Darrington doubles as Jackson’s taskmaster father, Joseph, portrayed in one flashback scene as hitting Little Michael for daring to stand up to him. Advertisement That’s about it for the most troubling aspects of Jackson’s biography. (While Jackson’s brothers in the Jackson 5 are characters in the show, Janet Jackson, oddly, is not. Sister La Toya is briefly mentioned.) What “MJ” seeks to sell you on is the importance of Jackson the artist. And on that score, it’s a convincing venture. Wheeldon and Nottage seamlessly weave Jackson’s backstory into the proceedings, even handing off a few numbers to Jackson’s mother, Katherine (the sublime Ayana George), and other subsidiary characters. Derek McLane’s industrial rehearsal-hall set proves to be a flexible springboard for the biographical and performative sequences, especially in the musical’s most beguiling montage number. It incorporates a detailed ac",
  "isFullReview": true,
  "showScoreExcerpt": "\"That sordid history would not seem to have foretold a jukebox musical devoted to the upside of Jacksonâs genius â and certainly not by artists of the caliber of two-time Pulitzer winner Nottage (âRuined,â âSweatâ) and the celebrated ballet world fixture Wheeldon. The showâs decidedly selective memory may be off-putting to theatergoers appalled by the stories of Jacksonâs alleged misdeeds. Nevertheless, the creative teamâs painstaking work has resulted in a riveting, adrenaline rush of a show, propelled by remarkable dancing and a mesmerizing central performance by Myles Frost as the sleek, soft-spoken pop megastar.\"",
  "originalScore": null,
  "assignedScore": 85,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "waybackUrl": "http://web.archive.org/web/20220705105915/https://www.washingtonpost.com/theater-dance/2022/02/01/mj-michael-jackson-musical/",
  "fetchedAt": "2026-01-23T08:42:13.355Z",
  "bwwExcerpt": "That sordid history would not seem to have foretold a jukebox musical devoted to the upside of Jackson's genius - and certainly not by artists of the caliber of two-time Pulitzer winner Nottage (\"Ruined,\" \"Sweat\") and the celebrated ballet world fixture Wheeldon. The show's decidedly selective memor..."
}
