{
  "showId": "mj-2022",
  "outletId": "WRAP",
  "outlet": "The Wrap",
  "criticName": "Robert Hofler",
  "url": "https://www.thewrap.com/mj-broadway-review-michael-jackson/",
  "publishDate": "2022-02-01",
  "fullText": "&#8216;MJ&#8217; Broadway Review: Michael Jackson Musical Is Less Thriller Than Dangerous There are villains in Lynn Nottage&#8217;s new musical “MJ,” however, they are not Michael Jackson By Robert Hofler February 1, 2022 @ 6:15 PM Share on Social Media Share on Facebook Share on X (formerly Twitter) Share on LinkedIn Share on Email Photo: Matthew Murphy His singing voice is divine. His dance moves dazzle. And just when we’re waiting for another verse of “Dancing Machine,” Michael Jackson stops the rehearsal cold. He has changed his mind. He does that a lot in rehearsals. He’s a perfectionist. He’s a genius. Maybe he&#8217;s even God. The problem is, he doesn’t want to sell out by including any of the old standards in his new &#8220;Dangerous&#8221; concert tour. To do so would be “sentimental.” Hello? “MJ” is a jukebox musical that is nothing but the late King of Pop’s greatest hits. Would Jackson himself approve of such a sentimental journey? More to the point is that his estate has approved it. And that is only one of the minor offenses on display in “MJ,” which opened Tuesday at Broadway&#8217;s Neil Simon Theatre. Read Next Michael Jackson’s Neverland Ranch Finally Sells in $22 Million Deal Anyone who has written a biography of a dead person, and I’ve written a few, must deal with the demands of the deceased person’s estate. And sometimes the tough word that must be spoken by a responsible biographer is “no.” Book writer Lynn Nottage didn’t say no. And that is the mortal sin of “MJ.” Clearly, there was a list of words not to be uttered in this life story of Michael Jackson, and top of the list was “pedophile.” This whole dirty, dark and open secret is referred to once in “MJ.” It is called “allegations.” Is that “allegations” as in “fake news”? There are villains in “MJ,” however, and they are not Michael Jackson (convincingly incarnated by Myles Frost) or even his cruel taskmaster of a father (Quentin Earl Darington). In one of Nottage’s few insightful touches, the son becomes the father here, treating his dancers and staff just the way dad mistreated the Jackson Five. Only Michael is more devious. He fires someone in his sweet soprano and then says, “Just kidding.” Charming. No, the villains of “MJ” are reporters, specifically one named Rachel (Whitney Bashor) who is brought in to shoot footage of the rehearsals for an MTV News piece to promote the tour. Nottage shows some discretion here. She doesn’t name the character Karen. People like Rachel have made Michael’s life hell because they won’t give him any privacy. And worse, they keep asking him invasive questions about his chimp, Bubbles, and if he had his skin bleached and why he has had so much plastic surgery. Read Next ‘Janet Jackson’ Review: Superstar Opens Up But Remains in Control in A&E/Lifetime Docuseries What Rachel and other reporters at a press conference do not ask Michael is the question they should be asking him: Are you screwing little boys? Perhaps if those journalists had blown the lid off Jackson&#8217;s lies, a few children’s lives would have been spared. In “MJ,” the star&#8217;s Neverland is described as a “sanctuary.” To whom? To Jackson, or to his victims? The latter group would call Neverland &#8220;the scene of the crime.” The political right in American hates the press. Donald Trump recycles the old Stalin line “enemies of the people.” What never gets discussed is how much the cultural left in America also hates the press. The character of Rachel has become standard fare in the movies, TV and the theater. Nottage clearly would prefer for the press to act as Jackson’s publicist. And that is why wealthy, powerful and very talented men like Bill Cosby, Jeffrey Epstein, Harvey Weinstein and, yes, Michael Jackson were able to perpetrate their abuse for decades. Reporters were acting as these men’s publicists. Reporters weren’t doing their job. Nottage cleverly sets “MJ” at a rehearsal in 1992, the year before the LAPD launched its first investigation into Jackson on reports that he had molested four children as young as 13; in this way the show tries to have it both ways. The adult Michael plays narrator to his child self (Walter Russell III and Christian Wilson alternate in the role) and his younger adult self (the very empathetic Tavon Olds-Sample). It’s a little like enjoying everything in Woody Allen’s oeuvre pre-“Manhattan,” but burning anything post-“Bullets Over Broadway.” The problem is that Jackson in 1992 was already well-known in Hollywood circles for throwing boys out of his bed as soon as those adolescents started sprouting pubic hair &#8212; accusations that several of his accusers detailed in depth in the 2019 docuseries &#8220;Leaving Neverland.&#8221; (He was acquitted of criminal charges in 2005, four years before his death; he previously settled two sexual abuse cases out of court and died before two other cases were dismissed because the statute of limitations had expired.) Read Next Michael Jackson’s Mole...",
  "originalScore": null,
  "assignedScore": 35,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:05:09.732Z"
}