{
  "showId": "lucky-guy-2013",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/lucky-guy-theater-review-tom-437039/",
  "publishDate": "April 2, 2013",
  "fullText": "Hanks brings his trademark blend of intelligence, humor and decency to the role of McAlary, making him a character you want to root for even when he's being pigheaded.",
  "isFullReview": false,
  "dtliExcerpt": "Hanks brings his trademark blend of intelligence, humor and decency to the role of McAlary, making him a character you want to root for even when he's being pigheaded.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "A frequent stumbling block in any dense dramatic chronicle is too much tell, not enough show. But the late Nora Ephron circumvents that problem in her entertaining salute to the tabloid newspaper business of the 1980s and '90s, Lucky Guy. She smartly enlists a garrulous crew of reporters and editors to serve as the oral-history vessel for her nostalgic look back at old-school, foot-in-the-door journalism...Directed with warmth and vitality by George C. Wolfe, it's performed with relish by a dynamic cast of pros, piloted by an uncharacteristically rough-edged Tom Hanks...Is it exceptional drama? Not by any means. It's talky, cursory in its conflict exploration, and not exactly packed with complexity. Yet it's intelligently written, engrossing and laced with crackling humor.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Hanks brings his trademark blend of intelligence, humor and decency to the role of McAlary, making him a character you want to root for even when he's being pigheaded.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (29 words)",
  "textQuality": "truncated",
  "rejectedAt": "2026-02-03T17:51:12.335Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or quote about Tom Hanks' performance, not a complete review with an evaluative verdict about the show; openai: This is a single sentence focusing on Tom Hanks' performance, lacking a comprehensive evaluation of the show as a whole.",
  "promptVersion": "5.2.0",
  "bwwScore": 8,
  "sources": [
    "web-search",
    "bww-reviews"
  ]
}
