{
  "showId": "lucky-guy-2013",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2013/04/02/theater/reviews/tom-hanks-in-lucky-guy-at-the-broadhurst-theater.html",
  "publishDate": "April 1, 2013",
  "fullText": "https://www.nytimes.com/2013/04/02/theater/reviews/tom-hanks-in-lucky-guy-at-the-broadhurst-theater.htmlShare full articleAdvertisement\n\nIf love were really all you need, Nora Ephron’s “Lucky Guy” would be the best show of the season, hands down. This fast-moving ink- and tear-stained portrait of the tabloid columnist Mike McAlary opened Monday night at the Broadhurst Theater, floating on a fathoms-deep reservoir of affection and good will, the likes of which back-stabbing Broadway seldom sees.\n\nWell, of course. “Lucky Guy” is both an elegy and a valentine to a vanishing world held dear in the collective imagination of New Yorkers, that of the rough-and-tumble of big-city newsrooms and scoop-hungry reporters. The script has been written with a true fan’s glee and avidity by Ephron, one of the most personally popular figures in the media and entertainment industries, who was still working on it when she died at 71 last June.\n\nDirected by the super showman George C. Wolfe, this production stars the two-time Oscar winner Tom Hanks, making an honorable Broadway debut. Mr. Hanks is one of the few enduring movie stars whose name is a byword not for sex appeal or power but for decency and likability. He and his wife, Rita Wilson, were close friends of Ephron, and they appeared at her memorial service to enact a dialogue between Ephron and her husband, the writer Nick Pileggi, as irresistibly enthusiastic conversationalists.\n\nAdd to this the fact that McAlary, a Pulitzer Prize-winning journalist with the chutzpah of which barroom legends are made, was only 41 when he died in 1998, and you have the makings of a first-class wake. Which is what, in the final analysis, “Lucky Guy” is — not so much a fully developed play or even a persuasive character study as a boisterous swapping of fond anecdotes about the end of a life and the end of an era.\n\nNot that “Lucky Guy” is a crepe hanger. On the contrary, staged with the full bells-and-whistles treatment for which Mr. Wolfe is celebrated, the production exudes that same narrative excitability and grinning hyperbole that Mr. Hanks and Ms. Wilson brought to their performance at Ephron’s memorial. I was also reminded at times of the expletive-fueled, can-you-believe-this storytelling momentum of the Martin Scorsese movie “Goodfellas,” based on a book by Mr. Pileggi.\n\nThe problem is that if you know anything about McAlary — or even read the advance pieces on “Lucky Guy” in The New York Times — you may already know most of the stories told here. And despite the flashy camouflage provided by Mr. Wolfe, a crack technical team and a large and lively cast, “Lucky Guy” turns out to be little more than the sum of its anecdotes.\n\nThis is one production I wish I hadn’t researched at all, because whenever we were being set up for the recounting of another Crazy Mike (or Heroic Mike) story, I’d think eagerly, “Now, how are they going to handle this one?” But mostly the tale remained only a tale told, rarely acquiring the full dimensionality of a life lived.\n\nWith a pot-scrubber mustache and a drinker’s paunch, Mr. Hanks is always gamely and industriously present to act as an animated illustration for those tales. But he’s not given much room to be more, making this McAlary seem less like the protagonist of his life than like the passive recipient of reversals of fortune. The play’s title comes to seem almost too apt.\n\nIt is largely left to the other characters — a foul-mouthed Greek chorus of hard-drinking reporters and the occasional cop or lawyer — to give us the annotated version of Mike’s rise and fall and rise in the pages of New York Newsday, The New York Post and The Daily News, where his career reached its peak with his award-winning coverage of the Abner Louima case. They frequently remind us that truth is relative and that nothing described here is as black and white as it is in newsprint.\n\nFor example, we hear that Mike is conscience-stricken when a corrupt policeman he has interviewed kills himself after the article appears. We are also told that he certainly seems to enjoy the attendant publicity and milks it. But there is no relevant scene in which Mr. Hanks is allowed to embody this ambiguity.\n\nThat may be part of an attitude built into the structure of “Lucky Guy,” the notion that portraiture is only a collage of others’ perceptions and that we can never fully know the real person within. In plays like “Democracy” and “Copenhagen,” Michael Frayn has proved himself a master at finding the dramatic dynamic in this very point of view.\n\nBut “Lucky Guy” doesn’t entirely sustain the approach, any more than it does the fourth-wall-breaking camaraderie established between actors and audience in the early scenes. We follow Mike into the private sanctum of his bedroom, where his wife, Alice (a mild-mannered Maura Tierney), gently chastises and consoles him.\n\nThere is little friction or passion here, and Mr. Hanks’s Mike, with his professional persona set aside, registers as just a regular Joe with worries that furrow his brow. The final scenes, portraying Mike’s last days in a hospital, are heartbreaking, rendered with beautiful restraint by Mr. Hanks. But it’s an everyman’s death we’re witnessing, not that of a particular person we have come to know.\n\nThe most detailed glimpses we have of Mike are through the unreliable mirrors provided by other characters. His increasing lust for the lucre that comes with success is reflected in the man who arranges it for him, the lawyer Eddie Hayes (an enjoyably revved-up Christopher McDonald); his ambivalent friendships with his co-workers must be inferred less from anything Mike does or says than from the statements and performances of his mentors, played by excellent actors like Courtney B. Vance and Peter Gerety.\n\nAs designed by David Rockwell (sets), Toni-Leslie James (costumes) and Jules Fisher and Peggy Eisenhauer (lighting), the show captures with verve the cigarette-and-whiskey-scented flavor of its period. This production features the wittiest use ever of a smoke machine. And the projections by Batwin & Robin Productions pungently summon the spirit of a world measured by the placement and type size of headlines.\n\nUnlike some of the movies Ephron wrote and directed, and many of her peerlessly sharp essays, “Lucky Guy” often feels only newsprint deep. But as a love song to a fast-disappearing, two-fisted brand of journalism — a field in which she began her long and varied career — it has the heart and energy of the perpetually engaged, insatiably curious observer that Ephron never ceased to be.",
  "isFullReview": true,
  "dtliExcerpt": "Mr. Hanks brings a magnetic ordinariness to Mike McAlary, the Pulitzer Prize-winning tabloid columnist whose life and career are chronicled in Nora Ephron's posthumously produced play.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "'Lucky Guy' is not so much a fully developed play or even a persuasive character study as a boisterous swapping of fond anecdotes about the end of a life and the end of an era...Not that 'Lucky Guy' is a crepe hanger. On the contrary, staged with the full bells-and-whistles treatment for which Mr. Wolfe is celebrated...Unlike some of the movies Ephron wrote and directed, and many of her peerlessly sharp essays, 'Lucky Guy' often feels only newsprint deep. But as a love song to a fast-disappearing, two-fisted brand of journalism - a field in which she began her long and varied career - it has the heart and energy of the perpetually engaged, insatiably curious observer that Ephron never ceased to be.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-LUCKY-GUY-Opens-on-Broadway-Updating-LIVE-20130401",
  "showScoreExcerpt": "Mr. Hanks brings a magnetic ordinariness to Mike McAlary, the Pulitzer Prize-winning tabloid columnist whose life and career are chronicled in Nora Ephron's posthumously produced play.",
  "contentTier": "complete",
  "contentTierReason": "Short text (26 words)",
  "textQuality": "full",
  "rejectedAt": "2026-02-03T18:18:08.402Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or caption, not a complete review with any evaluative content or recommendation; openai: The text is a brief description of Tom Hanks' performance and the play's subject, not an evaluative review of the production.",
  "promptVersion": "5.2.0",
  "bwwScore": 7,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ],
  "previousUrl": "https://www.nytimes.com/2013/04/02/theater/reviews/lucky-guy-starring-tom-hanks-opens-on-broadway.html",
  "urlDiscoveredAt": "2026-02-06T07:37:53.643Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1088,
  "archivePath": "data/archives/reviews/lucky-guy-2013/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:37:53.650Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250801011406",
  "archiveOrgUrl": "http://web.archive.org/web/20250801011406/https://www.nytimes.com/2013/04/02/theater/reviews/tom-hanks-in-lucky-guy-at-the-broadhurst-theater.html",
  "wordCount": 1088,
  "tierReason": "Full review text"
}