{
  "showId": "othello-2025",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Othello/1288",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Othello/1288",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $114\n Buy Tickets\n\nCititour.com Review\n Two movie stars with significant stage experience. An experienced director who has helmed some of the greatest revivals of this decade. And, above all, a Shakesperean tragedy with the potential power to make one angry, conflicted, and deeply sad. Is there any wonder why some theatergoers were willing to pay over $900 to watch Denzel Washington and Jake Gyllenhaal take on the main roles in Kenny Leon’s take on “Othello”?\n\nWell, sadly, Broadway doesn’t offer “guaranteed or your money back,” so I suspect most people who shelled out those big bucks (or even a couple hundred ducats) will leave this “less-is-moor” production, now at the Ethel Barrymore Theatre, generally disappointed in the final product. \n\nVisually, the show is less than impressive. Set in “the near future” (like next week, maybe?), it features a barely-there set by Derek McLane and a gray-black-camouflage palette of costumes (by the usually colorful Dede Ayite), both of which are hard to stare at for nearly three hours. (And you’ll wonder where your ticket money went!)\n\nPerhaps Leon’s idea was to make audiences focus on Shakespeare’s language and somewhat convoluted plot. (Those folks who don’t know the play going in will possibly be confused). More likely, though, we’re probably supposed to fully concentrate on – and be bowled over – by the show’s stars. And therein lies the production’s wisest choice and major miscalculation.\n\nThe cunning Iago is the juiciest, most interesting role in the play -- and Gyllenhaal offers another excellent stage turn in the part (just as I’ve seen Liev Schrieber and Daniel Craig do in recent years). He fully captures the bilious frustration of the spurned lieutenant who has been denied a military promotion by General Othello (Washington) -- and has a bit of an itch for Othello’s young wife Desdemona (a mostly bland and slightly too-mature Molly Osborne) -- and becomes determined to do everything he can to make everyone else’s life miserable, costs be damned!\n\nAnnouncing his rationales for his dirty deeds in long speeches to the audience – which includes a strong racial dislike of Othello, despite the fact his wife Emilia (a sassy Kimber Elayne Sprawl) is also black -- Gyllenhaal’s Iago is undeniably clever. Still, he is seemingly plotting his next move at the exact same moment he elucidates them. And like many a “villain,” Iago is perhaps not quite as smart – or as quick -- as he thinks he is. \n\nTrue, it’s not hard for him to outmaneuver his foolish friend Roderigo (a fine Anthony Michael Lopez) or even trap his biggest enemy, the supremely good-hearted Cassio (a truly likeable Andrew Burnap, who gives the evening’s finest performance), who has usurped Iago’s place in both Othello and Desdemona’s hearts. We even understand how Iago can easily (ok, way too easily?) convince the supposedly lovestruck Othello that Desdemona and Cassio have slept together, leading to the show’s final tragic acts.\n\nWhile no one is questioning Washington’s prowess as an actor, he seems (fittingly) lost at sea here, rushing through most of his lines as if he’s got an LIRR train to catch, thereby robbing them of their meaning. Moreover, his Othello rarely feels noble or majestic; Washington makes him folksy, with a vaguely Southern accent that feels absurdly out of place.\n\nAdmittedly, even if theater doesn’t demand the kind of realism cinema does, Washington is simply way too old (at age 70) for the role – his marriage to Desdemona seems especially creepy – nor is he as physically commanding as one might hope\n\nWorse yet, in the play’s should-be-devastating final act, Washington never convincingly shows Othello’s indecision in undertaking murder or true remorse once he realizes he’s been conned by Iago. It all feels like something he’s done before – another proverbial day at the proverbial office. No sniffling in the seats? No surprise?\n\nIn the end, this “Othello” could be renamed “No Tears for Old Men.”\n\nVisit the Sitehttps://othellobway.com/Open/Close DatesOpening 3/23/2025Closing 6/8/2025\nTheatre Info\nEthel Barrymore Theatre234 West 47th StreetNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 726,
  "archivePath": "data/archives/reviews/othello-2025/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:28:38.247Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 726,
  "tierReason": "Full review text"
}