{
  "showId": "othello-2025",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Roma Torre",
  "url": "https://nystagereview.com/2025/03/23/othello-gyllenhaal-slays-in-the-great-tragedy/",
  "publishDate": "2025-03-23T23:58:01",
  "fullText": "There’s no question why some of our biggest film stars are drawn to take a stab at Othello, Shakespeare’s tale of jealousy and revenge. The roles are just so juicy. The current production marks the 22nd time it’s been performed on Broadway. The last one featured James Earl Jones and Christopher Plummer; and 8 years ago, off-Broadway, David Oyelowo and Daniel Craig played the lovestruck moor and his evil antagonist Iago. Now with Denzel Washington and Jake Gyllenhaal in the lead roles, it’s breaking box office records charging a king’s ransom for tickets. There’s good and bad news with all of this. The prices will keep a lot of deserving fans from seeing a most praiseworthy production featuring two stars at the top of their game.\n\nDirector Kenny Leon set the play in “the near future” but thankfully it’s free of gimmickry. In fact, I’m told only a half dozen words were substituted for clarity. That’s impressive because aside from the modern costuming, this version retains a universal quality, neither entirely contemporary nor period. Leon’s streamlined staging on a mostly open stage framed by lighted columns feels organic, and that gives this 400+ year old tragedy a welcome resonance and authenticity.\n\nShakespeare was not only a genius playwright and poet, he could have been a psychologist. He understood how sociopaths operate; and with the villainous Iago, played to malevolent perfection by Jake Gyllenhaal, he devised a textbook case of malignant narcissism. Iago, full of resentment at not being promoted to lieutenant by the good general Othello (Denzel Washington), plans to wreak his revenge on everyone in his path. When he learns that Othello is newly married to the fair and virtuous Desdemona, he plants seeds of infidelity between Desdemona and his rival Cassio. Through lies and manipulation, Iago manages to turn the noble Othello into “a green-eyed monster” overcome with jealousy to the point of murder.\n\nThe performances are all in sync, never an easy task in modern productions with shortened rehearsal periods featuring actors trained in different techniques and styles. But here they’re all speaking the speech uniformly. Mastering the Iambic pentameter rhythms is always a challenge, but the cast pulls it off quite consistently; and after a while, our modern ears found the Elizabethan language less and less foreign. It’s impossible to pick up everything they say, and the lines are often spoken too quickly to decipher the full meanings but the intentions always come through loud and clear.\n\nJake Gyllenhaal is a revelation in this play. After starring in three previous Broadway outings, his versatility is undeniable, but here he proves himself a gifted Shakespearian despite having no other professional experience performing in the Bard’s plays. He is a complete natural as the scheming Iago, both menacing and funny. Odious as Iago is, it doesn’t take long before Gyllenhaal’s masterful performance puts Othello – and us –  in the palm of his hands.\n\nThe updated setting puts a sharper focus on the inherent racism in the play. Othello, the Moor, is black, and despite his high rank, he is often treated as an outsider. Early in the play when Iago speaks of Othello, Gyllenhaal mockingly imitates him with an insulting body gesture. It gets a laugh but the racism is unmistakeable.\n\nDenzel Washington is excellent in the role but some of his line readings were not all that clear. Recently, in an interview, he mentioned that his tongue is swollen after he bit it “almost half-off a few months ago” and it’s affecting his speech. It actually provides an added layer of vulnerability to the respected general, especially as we later discover he is epileptic. Othello must be strong enough to command a military unit and yet still fall prey to Iago’s manipulations. It’s a delicate balance that Washington manages most convincingly. As many times as I’ve seen the play, Washington’s take on Othello’s spiraling downfall puts an indelible stamp on the tragic role.\n\nShakespeare was keenly attuned to sexism in many of his works and here Leon was able to put a slight feminist spin on the production. Both the female characters, Desdemona (beautifully portrayed by British actor Molly Osborne) and Iago’s wife, Emilia (the equally impressive Kimber Elayne Sprawl), reveal themselves to be smarter and more assertive than in previous productions.\n\nAnother standout is Andrew Burnap as Cassio. He delivers a compelling take on the noble lieutenant framed by Iago and forced to suffer career ending humiliation in a drunken scene while plaintively crying “Reputation…O, I have lost my reputation.”\n\nThe tale of Othello is as old as time, but it’s the timing and the telling that elevates this ancient classic. Thanks to a bravura company, the telling is first class. As for the timing, in an interview, Leon commented that he’s specifically setting the play in 2028…hmm…a play about a malignant narcissist set in the year 2028. What could be significant about that? Just some food for thought and a new dimension of relevance in a play that’s clearly stood the test of time.\n\nOthello opened March 23, 2025 at the Ethel Barrymore Theatre and runs through June 8. Tickets and information: othellobway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
