{
  "showId": "next-fall-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "http://www.variety.com/review/VE1117942385.html?categoryid=33&cs=1&nid=2580",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Thanks to a U.S. political landscape that keeps hitting new heights of contentiousness whenever Christian values go up against liberal-intellectual individualism, the debate these days often resembles a dogfight. One of the distinctions of Geoffrey Nauffts' 'Next Fall' is that it considers both sides of the faith argument without sneering at either, while examining a committed gay relationship whose harmony is undermined by one partner's beliefs and the other's atheism. The play had a quieter appeal in its hit Off Broadway run last summer; the slicked-up transfer pushes harder, particularly for laughs. But it remains a moving domestic drama.",
  "bwwScore": 8,
  "contentTier": "complete",
  "fullText": "Tearjerker has become a dirty word. Up until a decade or two ago, Hollywood regularly gave royal treatment to grown-up three-hankie stories in which tragedy was colored by gentle character-based comedy (think \"Terms of Endearment\"). But that brand of sentiment is now more often confined to sudsy teen weepers or mawkish holiday-season dross. The TV equivalent gets even stickier.The laughter and sobs emanating from the audience at \"Next Fall\" reinforce the impression of a sure-footed return to somewhat unfashionable territory. Calling it a thoughtful, funny-sad soap opera is not intended as a putdown. In addition to its emotional effectiveness, Nauffts' writing benefits from not forcing its reflections on the conflicts devout Christianity can pose for openly gay believers. Same-sex partner issues surface, particularly with regard to hospital visitation rights, along with the problem of coming out within an ideologically opposed family. But regardless of its sociopolitical relevance, this doesn't come off as an agenda play. It approaches life-and-death questions with disarming naturalness.The device that brings the characters together and kickstarts their confrontations is a familiar one. In an accident heard offstage as the play opens, young actor Luke (Patrick Heusinger) is hit by a taxi, landing him in the ER of a Manhattan hospital, where he slips into a coma.His friend Brandon (Sean Dugan) is first to arrive, followed by Holly (Maddie Corman), Luke's boss at the candle shop where he works part-time. Next come Luke's divorced parents from Florida, testy conservative Butch (Cotter Smith) and verbose Arlene (Connie Ray). Last to show is his fortysomething partner, Adam (Patrick Breen). Awkward introductions and much friction follow.There must have been a discussion during transfer negotiations of whether to cast bigger names. However, director Sheryl Kaller has stuck with the original six-member ensemble, and the play gains considerably from the ease and refreshing modesty of this tight unit. Especially early on, Arlene's colorful eccentricities tend to point up Nauffts' over-eagerness to get a laugh, and some of the character's dialogue has a self-conscious sitcom ring to it. But Ray and the rest of the cast bring an integrity to their roles that keeps the drama grounded in a persuasively real world.With help from Wilson Chin's fluid set changes, Kaller folds a series of flashbacks into the hospital waiting-room scenes. These start with a recap of the dinner party where the guys meet when cater-waiter Luke administers the Heimlich maneuver to Adam.The faith divide gets exposed in an amusing scene in which Adam quietly freaks out after witnessing Luke say grace over post-coital eggs and tomatoes.A serio-playful pattern is established of Adam needling Luke over the inconsistencies between his sexuality and his hardcore Christianity; Luke responds by changing the subject, or bristling enough to justify his behavior according to sin-and-repent rules. Tensions in the relationship are also stoked by Luke's reluctance to come out to his folks, a problem that's amplified when Butch pays a surprise visit.Those central arguments deftly reverberate into the hospital scenes when Adam antagonizes fundamentalist Butch, and later, cagey Brandon, who shares Luke's beliefs but refuses to accept his choice to live in an openly gay relationship. As Luke's condition deteriorates, the issues become more complex, with parents and partner facing off while Brandon and Holly referee.Aside from an overwritten monologue in which Arlene recalls her wild past during a reflective moment in the hospital temple, Nauffts skillfully interweaves tart observation with emotional insight. The playwright also shows a winning tenderness toward his characters, whether they're being open-minded or unyielding, flip or earnest.This delicate balance is especially evident in the dynamic of the central couple, enhanced by the actors' flirty-fractious chemistry. Entirely relaxed in his own skin and seemingly lacking in self-doubt, Heusinger's Luke is affectionate and sweet-natured, so we're often on his side even when the more eloquent Adam shoots down his logic. Breen's Adam is wired and prickly, but charming in his self-effacing wit, his anxiety about aging and his hypochondria. Adam views God as competition, and his skepticism about Luke's beliefs is mirrored in his own resistance to love.Even if he does borrow poignant minor-key notes from Thornton Wilder (Luke played the Stage Manager in a memorable production of \"Our Town\"), Nauffts' play is genuinely affecting. It acknowledges each character's imperfections and differences with grace, good humor and acceptance.\n\nSets, Wilson Chin; costumes, Jess Goldstein; lighting, Jeff Croiter; original music and sound, John Gromada; executive producer, Susan Mindell; production stage manager, Charles Means. Opened March 11, 2010. Reviewed March 6. Running time: 2 HOURS, 25 MIN.\n\nVariety is striving to present the most thorough review database. To report inaccuracies in review credits, please click here. We do not currently list below-the-line credits, although we hope to include them in the future. Please note we may not respond to every suggestion. Your assistance is appreciated.",
  "isFullReview": true,
  "textWordCount": 798,
  "archivePath": "data/archives/reviews/next-fall-2010/variety--david-rooney_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:04:07.207Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 0 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20100323121049",
  "archiveOrgUrl": "http://web.archive.org/web/20100323121049/http://www.variety.com:80/review/VE1117942385.html?categoryid=33&cs=1&nid=2580",
  "wordCount": 798,
  "tierReason": "Full review text"
}