{
  "showId": "a-christmas-carol-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Bob Verini",
  "url": "https://nystagereview.com/2019/11/20/a-christmas-carol-god-blast-ye-merry-gentlemen/",
  "publishDate": "2019-11-20T21:46:28",
  "fullText": "One thing about preparing to review A Christmas Carol, you figure you don’t have to worry much about spoilers. Struggling with talking about The Inheritance or Parasite or The Laundromat or The Prince of Providence without giving away key plot points or coups de théâtre becomes most fatiguing. As a result, the act of confronting a universally familiar story—in this instance, wicked Ebenezer Scrooge’s recognition of the true meaning of Christmas—comes as something of a relief.\n\nWell, ‘old yer ‘orses, guvnor. It turns out that the Old Vic-generated reimagination of this age-old tale, in residence on Broadway for an eight-week holiday stint, includes enough narrative changes and staging surprises that I feel I must walk on eggshells yet again. Two Tony Award winners, writer Jack Thorne (Harry Potter and the Cursed Child) and director Matthew Warchus (God of Carnage), are determined to hold up Scrooge (Campbell Scott) as a mirror to all of us privileged first-worlders, especially the 1 percenters, to reveal the fecklessness of our behavior relative to our expressed values. And if Dickens might be thunderstruck at the Freudian undertones they’ve mined in their mission, I’d bet me last farthing that he’d approve.\n\nThe beauties of which Scrooge is heedless are made manifest as you enter the Lyceum to hundreds of streetlamps, large and small, up into the rafters as if ready to guide Peter Pan and Wendy. (Hugh Vanstone’s lighting is inventive throughout, as is Simon Baker’s adventurous sound design.) Top-hatted musicians perform familiar carols—Christopher Nightingale is the composer/arranger; music direction by Michael Gacetta—and cast members hand out clementines and bags of cookies to anyone who wants them. (A good idea, to get the audience all sugared up.) The ensemble storytelling is that remembered from Nicholas Nickleby, assigning bits of rapid-fire narration across the cast. Scenic designer Rob Howell has four doorframes, arranged in a square, which rise from the floor to define Scrooge’s self-imposed office prison, reinforced by floor-to-ceiling chains about the expanse. These, of course, match the chains that deceased partner Marley (Chris Hoch) will drag in from upstage to kick off Scrooge’s This-Is-Your-Life pity party.\n\nThorne gets to the ghostly visitations relatively quickly, allotting little time to the mortals who come in vain to seek alms. Scott keeps the role in the family—papa George C. starred in a famous TV film version—but he is a baritone to his father’s gravelly bass, with an approach that is accordingly much more urbane and sinister. This is a reasonable Scrooge, one who efficiently stores his strongboxes in wormholes in the floor (the easier to retrieve and stack them to construct set pieces). His sangfroid, and what he perceives to be self-awareness, mean that he eschews the fussy blustering we associate with the Alastair Sims and Albert Finneys of memory. He does have a persistent sniffle, though I was unsure whether it was unconscious, deliberate, or just unavoidable due to a cold. Anyway, this Scrooge’s lean, self-satisfied look signals his illusions won’t be easily stripped away.\n\nThat stripping is in the hands of three of the most corporeal spirits who ever haunted a merchant’s bedchamber: Andrea Martin, doing a lovely beneficent Cockney thing as Christmas Past; LaChanze, doing an amusing Caribbean seer thing as Present; and as Future—whoops, can’t reveal who steps in as the third ghost, but all are assuredly there, and end up dressed in Howell’s ragtag calico which suggests either Dresden dolls or homelessness, you pick. So solid are these “visions” that while there’s a young Scrooge avatar (Dan Piering), Scott himself steps in to reenact his memories of old Fezziwig (Evan Harrington), young love Belle (Sarah Hunt, here made Fezziwig’s daughter), et al.\n\nWhat we get in this telling is that Scrooge was victimized from an early age by his father (Hoch)—yes, you’ll think of Fred Trump, or Joe Kennedy maybe—who demanded that young Ebenezer become a world-beater at all costs and scorned any hint of weakness or artistic temperament. Scrooge’s puppets, particularly the green-and-yellow parrot, are usually cut from adaptations, but here Warchus and Thorne make the bird a touching symbol for that sweet part of life Scrooge yearns for but has ruthlessly shut out. A shark in training, he spurns Fezziwig’s offer to wed his daughter and become his heir because he wants a magnificent fortune worthy of her. The first act ends with Ebenezer’s desperate cry “I am a great man!,” which may make you think you’ve arrived at the first interval of The Lehman Trilogy, and the resemblance isn’t inapt. This production refuses to allow us to sit back passively to a comfortable, remote fairy tale about how selfishness cannot forestall goodness once one’s eyes are opened. It rather insists that we lean into our own lives to recognize that embracing a capitalist, consumerist culture, by its very nature, can make us complicit in evil and misrule.\n\nThe kiddies in the Lyceum seats may find the messaging a tad heavy (though they might as well start hearing it now). And I do wish the adaptation had acknowledged that our own Scrooges, our billionaire investment bankers and Internet moguls, tend to donate tons of cash to all sorts of worthy, even progressive enterprises, even as their policies envelop modern-day Cratchits in want. That brand of greedhead might be fortified against even the scariest of ghosts, so allowing Scrooge to content himself with some genuine philanthropy would add another nice jolt to the story.\n\nThe most effective touch by far is the casting of two young actors with cerebral palsy, Sebastian Ortiz (at the performance I caught) and Jai Ram Srinivasan, in alternation as Tiny Tim. It’s no stunt. Tootling along in his little walker to investigate Scrooge’s bounty the next morning—sorry, can’t reveal anything about that either—Ortiz placidly works within his body’s limits with fortitude and grace, more movingly than any ordinarily-abled moppet ever could in that role. His encounters with Scrooge bring tears to Scott’s eyes and to ours: not tears of pity, but of recognition that there are people all around us who merit our help and at the very least, our respect, and yet look how often we deny both.\n\nThe lad gets the final bow, and deservedly so, with audience and cast awash in good feelings and carols performed on bells. But wait! Lest you think you will sail home with a sense that all is now right with Dickens’ world and our own, the play has one final trick up its sleeve. Stagecraft, and the cribbing of a line from a world-famous war movie (no, it’s not “The horror, the horror”), combine to make the point that 180-degree changes of heart are as rare in real life as they are prevalent in pleasant fiction, and that the transformation of Scrooges into Santas may be in the end, as the Bard put it, no more yielding than a dream.\n\nA Christmas Carol opened November 20, 2019, at the Lyceum Theatre and runs through January 5, 2020. Tickets and information: achristmascarolbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
