{
  "showId": "a-christmas-carol-2019",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Jesse Isaenberg",
  "url": "https://www.nytimes.com/2025/12/05/theater/christmas-carol-review.html",
  "publishDate": "December 6, 2019",
  "fullText": "In some ways, Jack Thorne’s version of “A Christmas Carol” feels like its own Ghost of Christmas Past. It first played in New York on Broadway — having premiered at London’s Old Vic Theater — in late 2019, just before Covid led to an 18-month shutdown of Broadway. That production was praised for restoring the story’s social conscience and including charming bits of audience interaction; it won five Tony Awards, including for best original score.\n\nThe heartfelt themes of this incarnation, directed by Thomas Caruso and Matthew Warchus, who directed in 2019, are sharing and community. Gone from this tale of Scrooge’s journey to joy is a full account of his life’s prior darkness. The result feels more like an uplifting ensemble drama.\n\nThe true star is Hugh Vanstone’s lighting: A ceiling dotted by bobbing mini-lanterns (and one that is forbiddingly large, and swings), and flashes of darkness to aid the jump-scares of Scrooge’s transformative night. Rob Howell’s costumes are Dickens-era austere, and his stark, effective set centers on four paths intersecting at a cross. There, four metal frames rise from the floor and descend to signify both physical doors and the psychological barriers imprisoning Scrooge (Michael Cerveris) in his past regrets and present-day miserliness.\n\nScrooge is assailed from all directions by the Ghosts of Christmas Past (Nancy Opel), Present (Crystal Lucas-Perry), and Future (Ashlyn Maddox). The spirits, in colorful dress, are more imperiously commanding than terrifying, as they try to show Scrooge the errors of his ways.\n\nThe Ghost of Christmas Present is Mrs. Fezziwig, wife of Scrooge’s former employer, while Future is Little Fan, Scrooge’s dead sister and mother of his ebullient nephew Fred (George Abud). Warchus and Lizzi Gee (credited for movement) ensure that the intersecting paths swirl with action and gorgeous carol singing as Scrooge is taken on his supernatural journey.\n\nThe challenge for any “Christmas Carol” is to reimagine its protagonist’s state of mind and his route to change. A typically excellent Cerveris plays Scrooge first as cantankerous, but also funny (you understand why he’s annoyed by the carolers at his door). He looks battered, weatherworn and exhausted within his own shell of meanness, with a ratty mane befitting an aging metal head. And yet, a little to its detriment, this is not simply Scrooge’s show; the other characters — particularly the ghosts — feel just as prominent. But giving us more Scrooge would deepen the impact of his awakening on Christmas morning, full of a determination to change.\n\nOf the other actors, Julia Knitel gives a nuanced edge to Belle, Scrooge’s love when he was a cheerful young man. One of the show’s best scenes sees Scrooge approach an older Belle in the present when, transformed, he wonders if they might have a future together.\n\nThe Cratchits’ Tiny Tim (Micah Fay Lupin and Izzy Elena Rita share the role; an excellent Rita the night I saw it) is far from a physically vulnerable child to feel sorry for, but a key player who, in a touching scene with Cerveris, teaches Scrooge a climactic, quiet lesson in generosity that is more profound than anything gleaned from the ghosts.\n\nSuch moments of stillness are welcome, considering the hasty gallop at which the show approaches the rest of Scrooge’s story. Perhaps the production assumes an audience’s universal familiarity, perhaps it’s mindful of a two-hour run time, but Cerveris is given more story points to hit than psychological depths to plumb.\n\nHowever, darkness is not what this “Christmas Carol” is about, or where it wishes to dwell. This version relishes simpler things, such as its centerpiece sequence of a newly transformed Scrooge giddily greeting and shaking hands with the audience and overseeing a cavalcade of potatoes, sprouts, apples, oranges and a ginormous bronzed turkey, all transported to the stage via fabric chutes and rope. Amid this bounty, the audience is encouraged to donate to River Fund, a provider of emergency food in New York City.\n\nToward the end, the ghosts wonder if Scrooge might soon forget what he has learned. But the choice and responsibility to change — and our own, the play underlines — is down to him, down to us. This haunting-as-therapy complete, and with a “Silent Night” orchestrated by the ringing of hand bells and accompanied by falling snow, the audience undertakes a final exercise in collective action: navigating the Perelman’s endless maze of stairs and corridors to the exit.\n\nA Christmas CarolThrough Jan. 4 at the Perelman Performing Arts Center, Manhattan; pacnyc.org. Running time: 2 hours 15 minutes.",
  "isFullReview": true,
  "dtliExcerpt": "This 'Christmas Carol' is a gorgeous spectacle that celebrates the power of live theater, even if it sometimes sacrifices story for stunning visual effects.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This 'Christmas Carol' is a gorgeous spectacle that celebrates the power of live theater, even if it sometimes sacrifices story for stunning visual effects.",
  "contentTier": "complete",
  "contentTierReason": "Short text (24 words)",
  "previousUrl": "https://www.nytimes.com/2019/12/06/theater/a-christmas-carol-review.html",
  "urlDiscoveredAt": "2026-02-03T07:31:46.208Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 754,
  "archivePath": "data/archives/reviews/a-christmas-carol-2019/nytimes--jesse-isaenberg_2026-02-03.html",
  "textFetchedAt": "2026-02-03T07:31:46.213Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No usable CDX snapshots (all non-200 or non-HTML)"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 754,
  "tierReason": "Full review text",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2025 outside valid range 2016–2021 for show opening 2019"
}