{
  "showId": "stereophonic-2024",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani Samuel",
  "url": "https://www.broadwaynews.com/the-broadway-review-stereophonic-is-a-strum-of-genius/",
  "publishDate": "April 20, 2024",
  "fullText": "Sometimes, a song is so good you want to live in it. You want to nestle into its melodies, unravel the chords holding it up and more than anything, wander in the mind fields of the people who created it. David Adjmi’s “Stereophonic” is the play that sparks this very desire.",
  "isFullReview": false,
  "dtliExcerpt": "Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “Stereophonic.”\n\nRUNDOWN Sometimes, a song is so good you want to live in it. You want to nestle into its melodies, unravel the chords holding it up and more than anything, wander in the mind fields of the people who created it. David Adjmi’s “Stereophonic” is the play that sparks this very desire. It presents an unshakeable, hyperreal slice-of-life drama, employing artists to make art about making art — a salivary meta-trifecta. Adjmi’s script captures a year-long span of time with a Fleetwood Mac-esque music group in the 1970s. Fresh from the success of their debut album, the band gathers in a Sausalito studio to embark on constructing the next one. We’re trapped in the room with them, their two sage engineers and, crucially, their egos. The conversations between bandmates toggle with such finely-tuned naturalism, we almost feel like we’re encroaching on the privacy of real human beings. Adjmi builds complex portraits with painstakingly tiny brush strokes. An entire scene hinges on drummer Simon’s (Chris Stack) frustration about his snare’s hum. Another, unleashes a sea of dramaturgical implications over lead singer Diana’s (Sarah Pidgeon) inability to hit one note. \n\n            This post is for paying subscribers only\n            Subscribe now\n            Already have an account? Sign in\n\n      Review — Stereophonic — David Adjmi — Daniel Aukin — Will Brill — Juliana Canfield — Sarah Pidgeon — Tom Pecinka — Chris Stack — Eli Gelb — Andrew R. Butler — Will Butler — David Zinn — Ryan Rumery — John Golden Theatre — Enver Chakartash — Jiyoun Chang — Justin Craig\n\n                    Introductory Offer\n\n                $1/month for 3 months\n\n                Subscribe\n\n              Already have an account?\n              Log in",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-23T22:02:25.654Z"
}