{
  "showId": "stereophonic-2024",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/lifestyle/arts/stereophonic-review-theater-david-adjmi-broadway-1235877998/",
  "publishDate": "April 19, 2024",
  "fullText": "Arguably the best new American drama since Annie Baker’s The Flick, David Adjmi’s Stereophonic shares both a hyper-naturalistic style and a sprawling three-hour running time with that 2013 masterwork.",
  "isFullReview": false,
  "dtliExcerpt": "Share on Facebook\n\n\tShare on X\n\n\tGoogle Preferred\n\n\tShare to Flipboard\n\n\tShow additional share options\n\n\tShare on LinkedIn\n\n\tShare on Pinterest\n\n\tShare on Reddit\n\n\tShare on Tumblr\n\n\tShare on Whats App\n\n\tSend an Email\n\n\tPrint the Article\n\n\tPost a Comment\n\n\tArguably the best new American drama since Annie Baker's The Flick, David Adjmi's Stereophonic shares both a hyper-naturalistic style and a sprawling three-hour running time with that 2013 masterwork. But the similarities end there. Chronicling a turbulent year in California recording studios during which a fictional 1970s rock band labors over the follow-up to their breakthrough album, this is an immersive plunge into the fraught process of artistic collaboration as pressures mount and interpersonal harmony dissolves into acrimony.\n\n\tFunny, raw and poignant in equal measure, this expertly sculpted play has the feel of both a behind-the-music docudrama and a lost Robert Altman film, with its astute microcosmic focus, its frequent wash of overlapping dialogue and its sly nudges toward satire. In fact, while the music — fabulous original songs written by Will Butler, formerly of Arcade Fire — is pop-rock rather than country, Stereophonic could almost be an expanded vignette lifted right out of Nashville.\n\n\t\t\t\t\tRelated Stories\t\t\n\n\tNext Big Thing\n\n\t\t\t\t\tCoco Jones Is Not Playing It Safe Anymore -- And It Scored Her a Grammy Nomination\t\t\n\n\tMusic\n\n\t\t\t\t\tPhil Collins Says He&#039;s Under \"24-Hour\" Care Amid Health Issues\t\t\n\n\tIt somehow manages to be fluidly cinematic, richly novelistic and bracingly theatrical, simultaneously epic and intimate. Adjmi, whose previous plays include Stunning and 3C, shows an ear for great dialogue that's never been sharper.\n\n\tDirected by Daniel Aukin with a granular attention to nuance, the production comes to Broadway after drawing ecstatic reviews in a sold-out extended run late last year at Playwrights Horizons, the same Off Broadway mainstay that birthed The Flick. Rather than going the expected route and recasting with name talent for box office clout, the producers have made the shrewd decision to stick with the original actors, all but one of whom are making their Broadway debuts. There's not a weak link in the seven-member ensemble, five of whom also sing and play instruments.\n\n\tAdjmi has said that the idea came to him while on a flight listening to the Led Zeppelin cover of \"Babe I'm Gonna Leave You\" and marveling at the tangle of jagged emotions Robert Plant pours into his vocals. From there, the playwright's imagination led him to the studio in which the track was being recorded, which hatched the idea of an entire play set in just such a space.\n\n\tIngeniously designed by David Zinn — with the engineers at a massive mixing console in the downstage control room, bordered by hippie-chic d&eacute;cor, and the band fitfully laying down tracks in the glass-walled, soundproofed live room at the rear — the setting becomes a cauldron of clashing egos. The first three acts take place in a Sausalito studio, while the fourth and final act shifts to Los Angeles, after most of the central relationships have frayed perhaps beyond repair.\n\n\tInevitably, the makeup of the band, whose name we never learn, will invite associations with Fleetwood Mac. The three British charter members, married couple Reg (Will Brill) and Holly (Juliana Canfield) on bass and keyboard/vocals, respectively, and big daddy Simon (Chris Stack) on drums, correspond to John and Christine McVie and Mick Fleetwood. Likewise, the American couple who joined some years later and helped push the group to mainstream success, vocalist Diana (Sarah Pidgeon) and lead guitarist/vocalist Peter (Tom Pecinka), are ringers for Stevie Nicks and Lindsey Buckingham.\n\n\tStereophonic also echoes the trajectory of Fleetwood Mac coming off their chart-topping self-titled 1975 album and tumbling into the messy experience of recording Rumours, as the relationships of both couples were breaking down and Fleetwood's wife, back in England, was divorcing him.\n\n\tBut those similarities are merely the skeleton on which Adjmi hangs his riveting study of making art out of emotional turmoil. Every one of the band members is a fully fleshed-out character, and while some of them may share traits with their Fleetwood Mac counterparts — Peter, the egomaniacal control-freak, tracks closely with revelations about Buckingham that have emerged over the years — nothing feels borrowed. The play is no less a work of fiction than, say, Daisy Jones & The Six.\n\n\tAdjmi deftly bounces tensions among the band off two beleaguered peacekeepers, lead engineer Grover (Eli Gelb), who has fudged his previous experience with The Eagles and will increasingly be at loggerheads with Peter; and his unprepossessing assistant Charlie (Andrew R. Butler), the source of a hilarious running joke in that the band members rarely notice him and when they do, no one can remember his name. The chorus-like commentary between these two when the musicians are out of earshot is gold.\n\n\tThe conversational exchanges at first are amiable as the musicians kill time smoking cigarettes or joints in the control room between mostly abortive attempts to lock in a version of the songs they can all agree on. Things are good, with news of their album from the previous year creeping back into the Billboard charts and then climbing briskly, along with a hit single written by Diana. In theory, learning that the record company has tripled their budget should alleviate some of the pressure. But Adjmi shows remarkable skill at stealthily introducing tensions and festering resentments, which frequently erupt into explosive meltdowns.\n\n\tReg's diet of bourbon and blow becomes a problem, not just in his marriage to Holly but in his discipline with the work. Diana, while showing early signs of emerging as the band's breakout star, is insecure about her lack of musical literacy. \"I can't be a rock star and be this stupid,\" she moans. When Peter, who repeatedly undermines her shaky self-confidence, tells her to lose the tambourine, she has a mini crisis about what to do with her hands (which doubles amusingly as a winking reference to Nicks). The mostly unflappable Simon gets worked up over Grover's issues with his tempo. And Holly is often left tapping her feet with growing impatience while waiting for everyone else to get it together.\n\n\tOne of the masterstrokes of the play, which develops with an almost symphonic flow of movements, is Adjmi's decision to make us wait to hear — and be blown away by — actual music. Diana's first attempt to lay down a vocal comes almost a half-hour in, while the first track on which the entire band plays is even later, walloping the audience with a powerful wall of sound that makes their sudden success entirely plausible. Butler's songs — heard mostly in fragments, though a more complete recording is in the works — never sound like pastiche, but like authentic nuggets of mid-'70s rock from a group of exceptional talents.\n\n\tThe most consistent friction in the room comes from Peter, the self-appointed producer whose perfectionism increasingly turns authoritarian. His blunt criticisms are felt most acutely by Diana, building to a tearful altercation played offstage in private, but overheard at the sound board by Grover and Charlie, unable to resist turning up the mic.\n\n\tThe sexual politics of the era are evident not just in the attitudes of the male band members but also in the often wickedly funny idle banter between Grover and Charlie. But the play's central conflict is the fissure that widens between Peter and Diana, who have been together nine years. A stranger to tact, he constantly talks down to her and grows impatient with her insecurities, which have roots back in their struggling early days when she held down a crappy job so he could focus on music.\n\n\tThe clash between Grover, anxious to establish himself as a producer, and Peter is almost as important a source of rancor, the engineer's calm steadily eroding as recording sessions run on all night with minimal progress.\n\n\tStereophonic could be called a workplace drama, a quarrelsome family play or even an extended hangout, as much a vibe as a story. What makes it so riveting — in a dual-channel way reflected in the title — is that in addition to the rich characterizations and rocky group dynamics, we get incredible specificity in the world Adjmi has conjured.\n\n\tWhile the band tinkers with songs and the engineers mix the tracks, we watch the tape machine rolling, witness the late-night scramble to find a replacement console module, feel Simon's bruised vanity when he's forced to use a click track and tense up over the intricate process of tightening a rattly snare drum. (Stack's snooty prickliness is priceless.)\n\n\tThe attention to even the smallest detail of this environment will make the play especially enticing to musicians with studio experience, but it's never inaccessible to audiences lacking in specialized knowledge.\n\n\tKey to making it all feel like fly-on-the-wall reality is Ryan Rumery's layered sound design, mixing fully audible control-room talk with muffled voices from the live room and irritation, anger or sarcasm resonating loud and clear through the mics whenever Grover is scapegoated for a screwup or delay. Justin Craig's music direction is no less vital, as are the groovy period costumes of Enver Chakartash and the subtly modulated lighting of Jiyoun Chang.\n\n\tPerformances are hard to fault. Brill shows Reg at his most pathetically wasted but also upbeat as the hopeless romantic contemplates life on a houseboat or the rewards of healthy eating once he cleans up. Gelb is unexpectedly moving as a man eager to prove himself, steadily more bruised by Peter's abuse but asserting his tenuous authority with weary tenacity. \n\n\tCanfield (last seen as Kendall Roy's harried assistant Jess on Succession) brings warmth and grounded intelligence to Holly, while also showing her temper when pushed. It's significant that the least damaged relationships by the end of the year-long ordeal are those between Grover and Charlie, and more importantly, Holly and Diana — even if hints of a possible rift do ultimately surface between the women.\n\n\tPecinka nails the cruelty, the petty jealousy and the self-sabotage of Peter, whose artistic instincts may generally be right, but his way of communicating them can be brutal, his disregard for band members' feelings spreading the sting. Pidgeon never overplays Diana's neuroses and as resentments are aired, she charts the character's increasing strength, painfully asserting her independence from Peter, which leaves him alternately furious and crushed.\n\n\tLike a vinyl classic being removed from its gatefold cover inch by inch, Stereophonic slowly reveals its complexity, sharing the highs that come from working collectively to make great art and the spiraling lows of a shattered union. By the time the play ends, its searing emotional heft creeps up and grabs you by the throat. It's a chart topper.\n\n\tVenue: Golden Theatre, New York\nCast: Will Brill, Andrew R. Butler, Juliana Canfield, Eli Gelb, Tom Pecinka, Sarah Pidgeon, Chris Stack\nPlaywright: David Adjmi\nDirector: Daniel Aukin\nSet designer: David Zinn\nCostume designer: Enver Chakartash\nLighting designer: Jiyoun Chang\nSound designer: Ryan Rumery\nMusic director: Justin Craig\nOrchestrations: Will Butler, Justin Craig\nProduction: Playwrights Horizons\nPresented by Sue Wagner, John Johnson, Seaview, Sonia Friedman Productions, Linden Productions, Ashley Melone, Nick Mills\n\n\t\t\t\t\t\tRead More About:\n\n\tArcade Fire\n\n\tBroadway\n\n\tdavid adjmi\n\n\tFleetwood Mac\n\n\tmusic\n\n\tstereophonic\n\n\tTheater\n\n\tTony Awards\n\n\tTony Awards 2024\n\n\twill butler\n\n\t\tTHR Newsletters\n\n\tSign up for THR news straight to your inbox every day\n\n\t\tSubscribe\t\n\n\t\t\tSign Up\n\n\t\tMore from The Hollywood Reporter\n\n\tshopping\n\n\t\t\t\t\t&#8216;Euphoria' Costume Designer Creates Jewelry Inspired by Her Work With David Lynch",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Rock-N-Roll-Drama-STEREOPHONIC-Opens-On-Broadway-20240419",
  "dtliThumb": "Up",
  "urlUpdated": "2026-01-23T05:32:10.592Z",
  "scrapedAt": "2026-01-23T22:05:07.289Z"
}