{
  "showId": "stereophonic-2024",
  "outletId": "new-york-times",
  "outlet": "NEW YORK TIMES",
  "criticName": "Naveen",
  "url": "https://www.nytimes.com/2024/04/19/theater/stereophonic-review.html",
  "publishDate": "April 19, 2024",
  "fullText": "Peering behind the mystique of rock ’n’ roll has undeniable voyeuristic appeal. So there is an immediate thrill to seeing the mahogany-paneled control room and glassed-in sound booth that fill the Golden Theater stage, where “Stereophonic” opened on Friday. But David Adjmi’s astonishing new play, with songs by the former Arcade Fire member Will Butler, delivers more than a dishy glimpse inside the recording studio during rock’s golden age.\n\nA fly-on-the-wall study of how people both need and viciously destroy each other, “Stereophonic” is a fiery family drama, as electrifying as any since “Who’s Afraid of Virginia Woolf?” Its real-time dissection of making music — a collaboration between flawed, gifted artists wrangled into unison — is ingeniously entertaining and an incisive meta commentary on the nature of art. The play is a staggering achievement, and already feels like a must-see American classic.\n\nIt’s 1976 in Sausalito, Calif., and a not-yet-famous band — at least not solely inspired by Fleetwood Mac — is laying down the record that will propel it to stardom and unravel the personal lives of its members (in much the same way that making “Rumours” did for Fleetwood Mac). The setting (a marvel by scenic designer David Zinn) is a pressure-cooker: The coffee machine is broken but there’s a gallon bag of cocaine, and tensions and affections — both creative and personal — are running hot.\n\nDirected with a conductor’s precision by Daniel Aukin, “Stereophonic” is an epic canvas rendered in hyper-intimate detail: whispered confidences and technical adjustments, slouches and stares, lots of lying around and rolling joints. Stillness and silence are as expressive as Adjmi’s meticulously orchestrated dialogue, body language sometimes even more so. It’s possible to read the band’s ascension to fame beyond the confines of the studio, as its previous album creeps up the charts, in the swiveling hips of its lead singer alone (and in the progression of prints and flares in Enver Chakartash’s divine costumes).\n\nWhen the poetic and insecure Diana, played with stunning vulnerability by Sarah Pidgeon, sits down at the piano some 45 minutes into the three-hour show, the actor’s radiant voice delivers the first significant composition the audience hears: “Bright,” a folk-tinged rock ballad with sterling, ethereal vocals. Until then, notes trickle out in brief bursts. Often interrupted or doled out in riffs, the expressions of character and discord generated by Butler’s music are abstract — their fragmentation designed to make you want more. (Savor the early sessions when everyone can stand to be in the same room.)\n\nDiana’s toxic romance with Peter (Tom Pecinka) — guitarist, producer, unrelenting narcissist — is a searing and consistent source of emotional combustion. Peter’s willingness to shiv Diana’s soft spots makes the other feuding couple look downright sweet: Reg, the boozing, philosophical bassist (played by Will Brill, with the endearing agility of a Muppet) and the peace-seeking Holly (Juliana Canfield, making an excellent Broadway debut). The level head in the room usually belongs to Simon (a charming Chris Stack), except when an out-of-whack drum kit sends him into a fit.\n\nWhen the bandmates are in formation behind the recording-booth glass — elevated on a higher plane, their faces enshrined by warm halos (the exquisite lighting is by Jiyoun Chang) — they’re like gods on Mount Olympus glowering down at the tech table. The upstairs-downstairs dynamic between the musicians and their sound engineers, the low-key ambitious Grover (Eli Gelb) and non sequitur-spouting Charlie (Andrew R. Butler), is a font of frequent comedy, including Grover’s crazed, sleep-deprived impression of Peter and Simon, who run him ragged with all-nighters.\n\nBut who has more power in a sound studio than the people operating the mics? Grover and Charlie not only hear it all, but control what everyone else (including the audience) hears as well. (Ryan Rumery’s sound design is a technical wonder.) Grover matures the most over the year that the story takes place, from faking it to becoming indispensable, an arc that Gelb traces with unassuming subtlety. Grover’s visibility in the room is another growth indicator; the band goes from treating him like furniture to trusting him implicitly. (Poor Charlie doesn’t rise to the same honor.)\n\nEven now, it’s possible to imagine misty-eyed fans of this production, which premiered Off Broadway in October at Playwrights Horizons (where the New York Times critic Jesse Green called it “relentlessly compelling”), reflecting on the experience as if it were a once-in-a-lifetime stadium tour. And the Broadway transfer punches up the volume on the climactic moments of synchronicity, when the band nails a stellar take or the layers of a song are combined or fractured to shivering effect.\n\nBut the pleasures of “Stereophonic” are more granular and immediate; its close and sustained observation of artists, held captive by their desires to create, yields the most riveting insights. Like, what is the point of it all, anyway? “Life is for enjoyment,” Reg claims. “Life is pain,” Grover counters. If you ask Holly, needing others is the worst part. Still, there can be no harmony without all of the joys and miseries of other people.\n\nStereophonicThrough July 7 at the Golden Theater, Manhattan; stereophonicplay.com. Running time: 3 hours 10 minutes.\n\nShare full article118Related ContentAdvertisement",
  "isFullReview": true,
  "dtliExcerpt": "A fly-on-the-wall study of how people both need and viciously destroy each other, “Stereophonic” is a fiery family drama, as electrifying as any since “Who’s Afraid of Virginia Woolf?”",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 863,
  "archivePath": "data/archives/reviews/stereophonic-2024/new-york-times--naveen_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:34:21.111Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_read_more_prompt",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251027141346",
  "archiveOrgUrl": "http://web.archive.org/web/20251027141346/https://www.nytimes.com/2024/04/19/theater/stereophonic-review.html"
}