{
  "showId": "stereophonic-2024",
  "outletId": "new-york-magazine-vulture",
  "outlet": "New York Magazine / Vulture",
  "criticName": "Jackson McHenry",
  "url": "https://www.vulture.com/2023/10/theater-review-stereophonic-goes-its-own-way.html",
  "publishDate": "October 29th, 2023",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Chelcie Parry\n              \n            \n              \n        A band on the rise faces the task of recording the follow-up to their breakout album, and two of the relationships between its members seem to be heading toward the rocks — but first and most important, the coffee machine is broken. When you hear a rough description of David Adjmi’s Stereophonic, a three-hour 1970s-rock saga that clearly has Fleetwood Mac on the mind, you might imagine something that tilts toward melodrama — breakups and backstage bickering, tight pants and coke — and, sure, all of that crops up along the way (including one hilarious large prop bag of white powder). The heart of the play, though, lies in the minutiae: the coffee maker, the intricacies of a bass line, how to tune a snare drum. Stereophonic is constructed out of those hypernaturalistic details, with each little frustration along the way to an album building on the next, like a fugue, up to the points when those songs start to come together, the play breaks open, and, against all indications, incandescent art comes out.\n\nStereophonic takes place entirely within a recording studio as the band members spend a year driving each other mad. The space is meticulously made, visually redolent with pot and sweat, even before the cast members start puffing on herbal cigarettes. David Zinn’s set bisects the stage between a control room in the foreground and the soundproof recording space in the back — I can only imagine how sound designer Ryan Rumery made the dialogue and instrument-playing clear when half of the action takes place behind glass. Adjmi’s titles for each of the four acts reference albums by Todd Rundgren, Talking Heads, Pink Floyd, and Elton John, but the overarching circumstances closely resemble the making of Rumours: Stereophonic’s band has a hit album climbing the charts, and its record label has given them a lot of money and probably too much license to record the follow-up. The band’s dominated by an American couple: Peter (Tom Pecinka), an often cruelly exacting guitarist and singer, and Diana (Sarah Pidgeon), who has a gift for songwriting but faltering self-esteem (she plays the tambourine out of a need to do something with her hands as she sings) — and then there’s a supporting British trio, Holly (Juliana Canfield), who sings and plays the piano, Reg (Will Brill), who plays the bass and downs most substances he can find, and Simon (Chris Stack), who drums and tries to hold everyone together, when he isn’t blowing up and shouting them down for telling him he’s off tempo. Their newbie sound engineer Grover (Eli Gelb), meanwhile, sits at the control panel with his assistant, Charlie (Andrew R. Butler), his infatuation with the band’s mystique draining away as he grows irritated at their antics.\n\nIf you’ve recently tried to sate yourself with imitation-crab rock-history dramatizations like Daisy Jones and the Six, you’ll find that Stereophonic is, refreshingly, the real thing. It’s in awe of what bands like Fleetwood Mac accomplished, but clear-eyed about the pitfalls of collaboration, interested as much in the hurt feelings that go into songwriting as effects of dust on a soundboard. Adjmi and director Daniel Aukin bring a documentary-like approach to Stereophonic’s staging, immersing the audience in the tedium of sitting around waiting for brilliance to strike. I have to assume they watched Peter Jackson’s eight-hour reassembled Beatles series Get Back dozens of times. Get Back let you sit with geniuses as they procrastinate and delay and bullshit and then, occasionally, produce era-defining work. Stereophonic pulls a similar trick: The band members riff on everything from the surreal experience of sudden fame to the relative hotness of Donald Sutherland (leading into a monologue where Canfield, heartbreakingly still, ruminates on the sadness of Don’t Look Now). Adjmi is generous to the characters as he shifts the audience’s perspectives, an interlocking set of aggressions that resemble pre–World War I Europe in tiny miniature: Diana and Holly, especially, have a rich and complicated bond, often allies against the men of the group, yet both are aware of how quickly one might abandon the other for a boyfriend or a solo career.\n\nFor this approach to work, the thing the band is working on has to be good — otherwise, why wait for it? — and up its sleeve, Stereophonic has a set of songs by Will Butler of Arcade Fire that sound as if they could have been actual 1970s hits. Though you are likely to leave the play wishing you could buy the imaginary album immediately, Adjmi and Aukin mostly parcel out the music though glimpses at its development, as the band revises vocal lines or argue about how exactly the rhythm between verse and chorus should land. It resembles that parable of the blind men and the elephant, with each of the characters insisting on their particular vision of one giant mysterious thing, except there’s no guarantee they all are feeling their way around the same species. Diana writes long, emotional songs that, according to Peter, have too many verses. Reg wants to show off his virtuosity at the bass, even when it doesn’t fit. They’re all trying to express themselves through their art at once and elbowing against each other in the process, which is the heart of collaboration and the curse of it. More often than not, we’re watching versions of songs that aren’t quite there, but in the rare beautiful moments when everything falls into place and the band arrives at a nearly perfect take, the effect is overwhelming. Then, Aukin gives the songs space, and the music unfolds over the theater like a portal to another, better universe — until one of the band members messes up, or Grover points out that a piece of equipment is on the fritz, or Peter interjects a brutal comment. Nothing’s crueler, in making art, than ego and happenstance.\n\nThis cast can pull off Adjmi’s knotty dialogue scenes, and they’re all remarkable musicians, able to jam in perfect synchronization and (as the plot often demands) total discord. Brill, so nervy and and raw as Astrov in Uncle Vanya this summer, is almost frayed to pieces as Reg, able to contort his body into postures that range from unsettling to pathetically funny. Across from him, Canfield makes Holly that much more careful and precise — you saw that same quality in her assistant on Succession, and also in the behind-the-eyes mysteries of Fefu and Her Friends. Stack draws on an element of Monty Python–ish good humor (Simon is, unsurprisingly, a big fan of their comedy) but is able to downshift into brawler mode at any moment. Pecinka and Pidgeon, together, get the lived-in savagery of a long relationship, allowing Peter and Diana to be as sweet as they are cruel to each other. Only when their dynamic gets most heated does Stereophonic occasionally slip into more generic dramatics — drag-out fights that (aside from a wonderfully crafted scene that’s heard only through microphones) get close to Behind the Music excerpts. Or maybe it’s just that Peter and Diana are so clearly in the shadow of Stevie Nicks and Lindsey Buckingham, making it hard for them to render convincingly separate and believable fictionalized approximations.\n\nAside from the fighting within the band, what binds Stereophonic together is the work and perspective of Grover, the sound engineer. Gelb plays him with just enough slightly toxic aw-shucks male confidence, and he stealthily becomes the dramatic center of gravity. His role is to try to catch each of the band members as they glimmer with ideas and funnel them back into the work—to act as a servant, taskmaster, therapist, and coach. He’s got ambition, having fudged his credits to land this gig, but he’s worn down by the band’s antics until he’s grumbling that “life is pain, and people are disappointing, and that’s why I like to work, and to get to the next thing.” It’s a perspective of someone reluctantly in love with the act of making — not in any rose-tinted way, but as a primal need to keep trying to create. In his playwright’s note, Adjmi says that he started work on Stereophonic after a moment when he thought he’d decided to quit theater, then felt himself being dragged back in. He and Grover are both nudging these people toward something with the hope that, given the right timing and ingredients and environment, they’ll alchemize into something incredible.\n\nStereophonic is at Playwrights Horizons through November 26.\n\nShow \n      \n    \n    Leave a Comment\n  \n\n\n\n      Stereophonic Goes Its Own Way, and Finds Its Groove\n\n\n\n  \n  \n\n\n  \n\n\n\n        Things you buy through our links may earn Vox Media a commission.\n\nThis email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n\nPassword must be at least 8 characters and contain:\n\nYou’re in!\n        As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.\n\nThis email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n\nPassword must be at least 8 characters and contain:\n\nYou’re in!\n        As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.",
  "isFullReview": true,
  "showScoreExcerpt": "âAside from the fighting within the band, what binds âStereophonicâ together is the work and perspective of Grover, the sound engineer. Gelb plays him with just enough slightly toxic aw-shucks male confidence, and he stealthily becomes the dramatic center of gravity.â",
  "showScoreUrl": "https://www.show-score.com/broadway-shows/stereophonic",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1577,
  "archivePath": "data/archives/reviews/stereophonic-2024/new-york-magazine-vulture--jackson-mchenry_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:21:27.980Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250722220313",
  "archiveOrgUrl": "http://web.archive.org/web/20250722220313/https://www.vulture.com/2023/10/theater-review-stereophonic-goes-its-own-way.html"
}