{
  "showId": "stereophonic-2024",
  "outletId": "new-york-daily-news",
  "outlet": "New York Daily News",
  "criticName": "Chris",
  "url": "https://www.nydailynews.com/2024/04/19/broadway-review-stereophonic-best-show-in-years/",
  "publishDate": "April 19, 2024",
  "fullText": "Just before the end of David Adjmi's masterful \"Stereophonic,\" a three-hour dissection of ego, insecurity and the messy, messed-up gorgeousness of the creative process, I decided I'd had enough of these beautiful people in the recording studio with their complaints, their cocaine, their obsessive-compulsive neuroses and their phenomenal talents. A zen-like \"let it be\" had twisted in my skull to \"let me out.\"And then I realized that was precisely what Adjmi wanted everyone at the Golden Theatre to be feeling at the final curtain.\n\nHe had just explained why great bands break up, why famous geniuses who seemingly have all the gifts, money and adulation anyone could possibly want just can't hold it together, and why having a Billboard hit does not stop childhood-driven imposter syndrome from ringing inside your brain — but actually makes it louder.\n\nHeck, I'll go even further: He'd just explained why things end. Period.\n\nWhat a brilliant piece of must-see Broadway. It's Chekhovian, babe.\n\nAdjmi is hardly the first playwright to figure out that the expression of deep truths only flows from obsessive attention to detail. That's true of his \"Stereophonic\" characters, who spend what feels like hours adjusting a rattling drum.\n\nIt's also true of Adjmi's writing, Daniel Aukin's phenomenal direction, David Zinn's mind-blowing set, and the fearless acting from Sarah Pidgeon and Tom Pecinka especially, but really an entire cast also made up of Will Brill, Andrew R. Butler (playing the Firs in this \"Cherry Orchard\"), Juliana Canfield, the deceptively complicated Eli Gelb and the rich Chris Stack.\n\nEverything and everyone feels real. Relentlessly so.\n\n\"Stereophonic,\" first seen at Playwrights Horizons, is about an up-and-coming British rock band on the brink of superstardom making a studio album in California between the summers of 1976 and 1977. You never see their lives outside the recording studio laid out before you on the stage, but you do hear them sing.\n\nThe show was clearly influenced by Peter Jackson's restored \"The Beatles: Get Back,\" a killer marathon documentary about the making of the album \"Let It Be\" in 1970, even as the band was battling for control and thus well outside the edenic Strawberry Fields. But here we're watching a band with both male and female members, thus suggesting the story of Fleetwood Mac, a group known for its internal sexual shenanigans as well as its love of locking itself inside a studio for weeks or months at a time — fighting, crying, composing and birthing a phenomenal album.\n\nSince this band is fictional, they sing way-cool original music by Will Butler, a former member of indie rock band Arcade Fire. The songs feel like they could be on a Fleetwood Mac album like \"Mirage.\" The singing is live and everything you hear is (I think) analog, as run through the console controlled by Gelb's Grover, the engineer who has to hold this crazy crew together — maybe benevolently, maybe for his own benefit, maybe both.\n\nFew playwrights are as unsentimental as Adjmi and no one here gets a pass: Pidgeon, who should break out with this performance, hurts your heart.\n\nIn the end, the show is hardly just about the music, but any time people come together to create, including a Broadway show. Pecinka's Peter, the Paul McCartney of this show, is that guy, the man who feels like he needs to collaborate but really can't because he knows he can do it all better himself. That's his gift and his curse and s/he still is everywhere, to art's great fortune and its perennial distress.\n\nThe rest of us can just watch, thrilled and afeared.\n\nThose are the twin channels of \"Stereophonic.\" Don't wait. Tickets will get hard.",
  "isFullReview": true,
  "dtliExcerpt": "What a brilliant piece of must-see Broadway. It’s Chekhovian, babe.",
  "originalScore": null,
  "assignedScore": 85,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 613,
  "archivePath": "data/archives/reviews/stereophonic-2024/new-york-daily-news--chris_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:33:24.184Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240617045347",
  "archiveOrgUrl": "http://web.archive.org/web/20240617045347/https://www.nydailynews.com/2024/04/19/broadway-review-stereophonic-best-show-in-years/",
  "designation": "Must_See",
  "scoreSource": "extracted-strong-positive",
  "scoreConfidence": "medium",
  "extractedPhrase": "must-see"
}