{
  "showId": "stereophonic-2024",
  "outletId": "new-york-theatre-guide",
  "outlet": "New York Theatre Guide",
  "criticName": "Allison",
  "url": "https://www.newyorktheatreguide.com/reviews/stereophonic-broadway-review",
  "publishDate": "April 19, 2024",
  "fullText": "Read our review of Stereophonic on Broadway, a new play by David Adjmi with songs by Will Butler, which first played a sold-out Off-Broadway run last fall. The band is back together on Broadway. David Adjmi’s Stereophonic had a critically acclaimed, sold-out run off Broadway in fall 2023 at Playwrights Horizons, and now it’s hitting all the right notes at the Golden Theatre. Featuring original music by Will Butler’s Arcade Fire, the play follows a rock band in the mid-1970s recording an album in Sausalito, California over the course of a year. The nameless, fictional band invites comparisons to Fleetwood Mac and the infamous recording of Rumours, also recorded in Sausalito. The wood-paneled recording studio (set by David Zinn) is a closed-off chamber where the band plays and discovers. But you can’t make art in a vacuum. Outside the studio walls, the band’s debut album is rapidly climbing the charts, the female vocalist’s star is rising, and the pressure to produce a surefire hit on the heels of a No. 1 record is mounting. The fly-on-the-wall audience watches the making of what could be a smash — or a misfire — from behind the studio’s control room. The sepia-toned space, filled with plush floor pillows, is where bandmates lounge and snort cocaine between takes. The naturalistic, overlapping dialogue ranges from slow meditations on donuts to fiery, violent spats between bandmates, and it’s completely absorbing. A major tension in the play has to do with compromise — namely, how to trim four minutes off the too-long record. Stereophonic shows the whole creative process of piecing together an album, from the messy first notes to the final playback, so it fits that the 3-hour play could benefit from some cuts itself. But which darlings to kill? Under the direction of Daniel Aukin, the play’s rhythm moves from a languid to up-tempo pace, and all the sluggish bits work. The audience can’t fully enjoy Sarah Pidgeon's spot-on belt without first hearing her character, lead vocalist Diana, struggle to hit the high note over several takes. They can't revel at the bright sound of the snare without listening to it rattle for several long minutes. And the payoff is fantastic. During the song “Masquerade,” audience members bobbed their heads and tapping their feet. The audience feels part of the magic. I, for one, am ecstatic for the forthcoming cast album, especially after watching the songs fumble and then fly into existence. Stereophonic, set inside a California recording studio, follows a fictional rock band in the mid-1970s recording their sophomore album. The band’s first album was a hit, so the pressure is on for the up-and-comers — including Diana (Sarah Pidgeon), Peter (Tom Pecinka), Holly (Juliana Canfield), Reg (Will Brill), Simon (Chris Stack) — and their sound engineers, Grover (Eli Gelb) and Charlie (Andrew R. Butler). The bleary-eyed bandmates, high on cocaine, double down as the recording timeline stretches from months to a year. The round-the-clock recording is a relationship wrecker, especially for the two couples in the band. Things take a turn for the worse when Peter assumes control as the producer, obsessing over tracks and pushing his bandmates to the brink. Stereophonic offers a hard look at the price of making art. Stereophonic is a 3-hour play with four acts. It features songs, but it is not a musical. The play contains drug and alcohol abuse, discussions about sex, homophobic language, and depression. There is a lot of smoking on stage, and for all these reasons, it is recommended for audiences 14 and up. At the time of publication, Stereophonic had a 79% rating on Show-Score, with audience members praising the show’s originality and others grumbling about the length. Read more audience reviews of Stereophonic on Show-Score. Despite its lengthy four acts, the play puts forth catchy songs and star-making performances from the cast. Learn more and get Stereophonic tickets on New York Theatre Guide. Stereophonic is at the Golden Theatre through July 7. Photo credit: The cast of Stereophonic on Broadway. (Photos by Julieta Cervantes) Originally published on Apr 19, 202423:59",
  "isFullReview": true,
  "dtliExcerpt": "The band is back together on Broadway. David Adjmi’s Stereophonic had a critically acclaimed, sold-out run off Broadway in fall 2023 at Playwrights Horizons, and now it’s hitting all the right notes at the Golden Theatre.",
  "originalScore": null,
  "assignedScore": 75,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 679,
  "archivePath": "data/archives/reviews/stereophonic-2024/new-york-theatre-guide--allison_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:34:13.507Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_read_more_prompt"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "designation": "Recommended",
  "scoreSource": "extracted-thumbs-up",
  "scoreConfidence": "low"
}