{
  "showId": "stereophonic-2024",
  "outletId": "NYTG",
  "outlet": "New York Theatre Guide",
  "criticName": null,
  "url": "https://www.newyorktheatreguide.com/reviews/stereophonic-broadway-review",
  "publishDate": "2024-04-19",
  "fullText": "&#x27;Stereophonic&#x27; review — a high-strung, energetic in-studio creation | New York Theatre Guide 16 captures 20 Apr 2024 - 18 Oct 2025 Sep OCT Nov 18 2024 2025 2026 success fail About this capture COLLECTED BY Collection: Common Crawl Web crawl data from Common Crawl. TIMESTAMPS The Wayback Machine - http://web.archive.org/web/20251018082225/https://www.newyorktheatreguide.com/reviews/stereophonic-broadway-review What&#x27;s On All NYC Events ✨ Broadway Off Broadway Broadway musicals Top 10 Broadway musicals Broadway plays Shows for kids Concerts 🎵 Opening soon Closing soon Tickets Broadway tickets Off-Broadway tickets Last-minute Broadway tickets Broadway deals & offers Wicked The Great Gatsby The Book of Mormon The Lion King Moulin Rouge! The Musical MJ The Musical Concerts All Concerts Christmas Spectacular Ariana Grande Sabrina Carpenter John Legend Maroon 5 News Broadway news & features Off-Broadway news & features Interviews Broadway theatre guide: Shows, venues, & more Top things to do in NYC Best Theatre October 2025 Broadway Fall Preview Reviews Broadway reviews Off-Broadway reviews Best-reviewed Broadway shows Best Broadway Musicals Best Broadway Plays Best Theatre October 2025 Stars on Stage All Stars on Stage James Corden Kristin Chenoweth Laurie Metcalf Neil Patrick Harris Bobby Cannavale Home Reviews Broadway &#x27;Stereophonic&#x27; review — a high-strung, energetic in-studio creation &#x27;Stereophonic&#x27; review — a high-strung, energetic in-studio creation Read our review of Stereophonic on Broadway, a new play by David Adjmi with songs by Will Butler, which first played a sold-out Off-Broadway run last fall. Allison Considine April 19, 2024, 04:00 The band is back together on Broadway. David Adjmi’s Stereophonic had a critically acclaimed, sold-out run off Broadway in fall 2023 at Playwrights Horizons, and now it’s hitting all the right notes at the Golden Theatre . Featuring original music by Will Butler’s Arcade Fire, the play follows a rock band in the mid-1970s recording an album in Sausalito, California over the course of a year. The nameless, fictional band invites comparisons to Fleetwood Mac and the infamous recording of Rumours , also recorded in Sausalito. The wood-paneled recording studio (set by David Zinn) is a closed-off chamber where the band plays and discovers. But you can’t make art in a vacuum. Outside the studio walls, the band’s debut album is rapidly climbing the charts, the female vocalist’s star is rising, and the pressure to produce a surefire hit on the heels of a No. 1 record is mounting. The fly-on-the-wall audience watches the making of what could be a smash — or a misfire — from behind the studio’s control room. The sepia-toned space, filled with plush floor pillows, is where bandmates lounge and snort cocaine between takes. The naturalistic, overlapping dialogue ranges from slow meditations on donuts to fiery, violent spats between bandmates, and it’s completely absorbing. A major tension in the play has to do with compromise — namely, how to trim four minutes off the too-long record. Stereophonic shows the whole creative process of piecing together an album, from the messy first notes to the final playback, so it fits that the 3-hour play could benefit from some cuts itself. But which darlings to kill? Under the direction of Daniel Aukin, the play’s rhythm moves from a languid to up-tempo pace, and all the sluggish bits work. The audience can’t fully enjoy Sarah Pidgeon&#x27;s spot-on belt without first hearing her character, lead vocalist Diana, struggle to hit the high note over several takes. They can&#x27;t revel at the bright sound of the snare without listening to it rattle for several long minutes. And the payoff is fantastic. During the song “Masquerade,” audience members bobbed their heads and tapping their feet. The audience feels part of the magic. I, for one, am ecstatic for the forthcoming cast album, especially after watching the songs fumble and then fly into existence. Stereophonic summary Stereophonic , set inside a California recording studio, follows a fictional rock band in the mid-1970s recording their sophomore album. The band’s first album was a hit, so the pressure is on for the up-and-comers — including Diana (Sarah Pidgeon), Peter (Tom Pecinka), Holly (Juliana Canfield), Reg (Will Brill), Simon (Chris Stack) — and their sound engineers, Grover (Eli Gelb) and Charlie (Andrew R. Butler). The bleary-eyed bandmates, high on cocaine, double down as the recording timeline stretches from months to a year. The round-the-clock recording is a relationship wrecker, especially for the two couples in the band. Things take a turn for the worse when Peter assumes control as the producer, obsessing over tracks and pushing his bandmates to the brink. Stereophonic offers a hard look at the price of making art. What to expect at Stereophonic Stereophonic is a 3-hour play with four acts. It features songs, but it is not a musical. The play co",
  "originalScore": null,
  "assignedScore": 82,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "waybackUrl": "http://web.archive.org/web/20251018082225/https://www.newyorktheatreguide.com/reviews/stereophonic-broadway-review",
  "fetchedAt": "2026-01-23T10:15:46.935Z"
}