{
  "showId": "stereophonic-2024",
  "outletId": "observer",
  "outlet": "The Observer",
  "criticName": "David Cote",
  "url": "https://observer.com/2023/10/review-stereophonic-has-the-vinyl-word-on-70s-rock-drama/",
  "publishDate": "October 29th, 2023",
  "fullText": "Stereophonic | 3hrs 5mins. One intermission. | Playwrights Horizons | 416 West 42nd Street | 212-279-4200\n\nSign Up\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tThank you for signing up!\n\nBy clicking submit, you agree to our <a href=\"http://observermedia.com/terms\">terms of service</a> and acknowledge we may use your information to send you emails, product samples, and promotions on this website and other properties. You can opt out anytime.\n\nCriteria for a rock masterpiece are subjective, but you know it when you hear it . . . and when you play it repeatedly across decades with no skipped tracks—none. Every song is a true banger containing special meaning for you alone. (My personal pantheon includes Tommy, Fear of Music, and Lifes Rich Pageant.) Who knows if the LP painstakingly recorded over the course of a year by the unnamed band in Stereophonic makes the list, but not a moment in its three hours should be fast-forwarded, and I’d gladly rewind to see it again.\n\nDavid Adjmi’s high-definition group portrait of musicians and engineers creating and cracking up takes place in a recording studio in Sausalito, California in 1976 (with a last act in Los Angeles). At Playwrights Horizons, the audience faces the control room (couches, mixer), which faces the sound room where the band plays, the two areas separated by soundproofing glass. David Zinn’s documentarian design (you can almost smell the funk of spilled booze, smashed cigarettes, and patchouli oil) establishes two layers of spectatorship, a neat echo of the title reference to dual-channel recording. Stereophonic sound tricks the ears into thinking they’re hearing music in three-dimensional space. By turning the audience into eavesdroppers, keeping us a step removed, the double frame ratchets up both the mystery and reality quotient. This wormhole effect—bona fide, unironic period fidelity—is solidly reinforced by Enver Chakartash’s groovy couture and Tommy Kurzman’s free-flowing wigs and hairstyling. Jiyoun Chang illuminates it all with subtle touches that suggest time of day (even if the space is windowless) and bounces light off the glass partition in a most stimulating way.\n\nAdjmi pushes the binaural metaphor further in his split-screen of a script. Dialogue happens in the control room as his people unwind, argue, do drugs, overlapping with chatter from the sound room—which sometimes we hear, sometimes we don’t, depending on the speaker switch. This means Adjmi is constantly modulating two tracks, reinforcing dramatic tension between characters or diffusing it by comical incongruence. When untested producer Grover (Eli Gelb) and his nerdy assistant Charlie (Andrew R. Butler) get wrapped up in adolescent gossip about the sexy women causing “boners” or bands they’ve worked with, the pissed-off players have to pound on the glass to get their attention.\n\nAllow me to introduce the band, whose Anglo-American makeup and tangled romantic liaisons (not to mention hefty bags of cocaine) invite comparisons to Fleetwood Mac. First the Yanks: On lead guitar and vocals, Peter (Tom Pecinka) is chief songwriter, an emotionally abusive perfectionist in a codependent relationship with Diana (Sarah Pidgeon), the neurotic, angel-voiced vocalist who’d like to play something other than tambourine. Now the Brits: Keyboardist and singer Holly (Juliana Canfield) is warm and kind, but also surprisingly quick-tempered. She’s married to bassist Reg (Will Brill), a squishy romantic and drunk whose messiness is almost redeemed by a boyish vulnerability. Last is Simon (Chris Stack), a louche drummer who is not, contrary to rock protocol, partying to death, but is watching his marriage fall apart as the recording of the album stretches into months and months.\n\nThe reason for this extended process is the record label tripling the budget, a windfall Peter seizes upon as a chance to wallow in his genius. Even so, the shape and gestalt of the album’s never quite revealed. We hear fragments and sometimes whole songs as the band tinker and refine them—tender, yearning or bitter ballads of hope and despair written by Will Butler. A former member of Arcade Fire, his lyrics are sincerely retro to the point of timelessness, plentiful references to light and night and the wind, heartbreak and moving on. We don’t even know what the album&#8217;s named. (Towards the end, Reg suggests a profane title his girlfriend dreamed.) This withholding is not a criticism. The real story, the drama, is not whether or not they complete the record without killing each other or themselves; it’s the slow-burning revelation of the quintet’s inexplicable dance of birth and destruction, how they can harmonize in a beatific refrain while tearing at each other’s throats. Stereophonic doesn’t really have a plot; it has a vibe. Yes, we want Diana to free herself from Peter. We hope Reg stays off the coke and on the natural-food diet. My heart goes out to Simon and his family.\n\nThen there’s Grover and Charlie, Adjmi’s version of put-upon, wily servants. Gelb and Andrew R. Butler have delightfully geeky-cheeky chemistry as industry fanboys, in awe of their boss the band but increasingly unnerved by the musicians’ pettiness and obsessive-compulsive tics (Simon spends a week trying to get his drum kit just right). Gelb is especially sympathetic as a guy who’s out of his depth and forced to take control or else be obliterated by Peter’s ego. Grover is the witness to pop history and our guide: insecure, resentful, only ambition keeping him going. In a late heart-to-heart, Holly and Grover talk films and stuff, and when she presses him on basic happiness, he shrugs. “I mean, I guess I believe we’re here to suffer.” Is art worth the pain? Something tells me Grover and the band will keep joy low on priorities as they pursue fame. The final moment of the play brought a new sense of the title. Diana, perhaps flirting with Grover, invites him to walk her to his car. He says he needs to keep mixing tracks. Suddenly the duality implied by Stereophonic seemed like the choice between work and love. Grover sits back down and fiddles with his knobs. His back contracts in a shudder of regret. Always listening through the glass.\n\nWithout exception the cast is appealing and utterly cohesive, directed by Daniel Aukin with his usual preternatural gift for tonal control. Like his jukebox heroes, Adjmi has worked on this play for a long time (almost a decade), and his devotion and insane attention to detail has yielded a dense and novelistic weave with the uncanny heft of observed life. I’ll be honest: I don’t remember every scene of this long, luxurious fly-on-the-wall beauty. The guys share a joint and talk about houseboats. Peter comes close to punching Grover. Holly rhapsodizes over a donut. Diana is put through emotional hell trying to get a perfect high note. It’s a lot of play, a lot of life, and when Butler’s luscious, bruised ballads come together and Grover captures it, we levitate beyond time and space. Does Stereophonic rock? It does, hard. Instant classic.\n\nWe noticed you're using an ad blocker.\n\t\t\tWe get it: you like to have control of your own internet experience. But advertising revenue helps support our journalism. To read our full stories, please turn off your ad blocker.We'd really appreciate it.\n\nBelow are steps you can take in order to whitelist Observer.com on your browser:\n\nClick the AdBlock button on your browser and select Don't run on pages on this domain.\n\nClick the AdBlock Plus button on your browser and select Enabled on this site.\n\nClick the AdBlock Plus button on your browser and select Disable on Observer.com.",
  "isFullReview": true,
  "showScoreExcerpt": "â âStereophonicâ doesnât really have a plot; it has a vibe...Without exception the cast is appealing and utterly cohesive, directed by Daniel Aukin with his usual preternatural gift for tonal control...Does âStereophonicâ rock? It does, hard. Instant classic.â",
  "showScoreUrl": "https://www.show-score.com/broadway-shows/stereophonic",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1237,
  "archivePath": "data/archives/reviews/stereophonic-2024/observer--david-cote_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:34:58.835Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251109075613",
  "archiveOrgUrl": "http://web.archive.org/web/20251109075613/https://observer.com/2023/10/review-stereophonic-has-the-vinyl-word-on-70s-rock-drama/"
}