{
  "showId": "stereophonic-2024",
  "outletId": "theatermania",
  "outlet": "THEATERMANIA",
  "criticName": "David",
  "url": "https://www.theatermania.com/news/review-the-art-of-making-art-in-istereophonic-i-a-true-broadway-masterpiece_1737559/",
  "publishDate": "April 19, 2024",
  "fullText": "David Adjmi&#8217;s drama about a band recording an album goes even deeper at the Golden.\n\nWho&#8217;d have thought the most musically satisfying production of the season would be a three-hour-and-15-minute play? That&#8217;s David Adjmi&#8217;s miraculous Stereophonic, newly transferred to Broadway&#8217;s Golden Theatre after a fall run at Playwrights Horizons. The two-avenue move hasn&#8217;t dimmed the luster of Adjmi&#8217;s sprawling script, and the sexy performances director Daniel Aukin has brought out of his cast are even stronger. In short, Stereophonic is still as much of a masterpiece as it was six months ago, and it&#8217;s deservedly poised to become the big hit of the year.\n\nSet within the confines of a recording studio in the mid-’70s, Stereophonic follows a band on the precipice of stardom as they attempt to record their latest album. The group is fictional but most closely resembles Fleetwood Mac in makeup (the five members are British and American, three male, two female), sound (Will Butler of Arcade Fire provides original radio-ready tunes that expertly capture an ethereal magic), and tempestuousness. If the angst that comes with trying to achieve perfection doesn&#8217;t break them up, the actual recording process will.\n\nHyper-realistic in its fly-on-the-wall examination of the art of making art, Adjmi is tracking the downfall of the group&#8217;s two romantic couples at the same time. Vocalist and keyboard player Holly (Juliana Canfield) is at the end of her rope when it comes to her bassist husband, Reg (Will Brill), whose proclivities include chugging Jack Daniels and snorting enormous amounts of cocaine. Singer Diana (Sarah Pidgeon) is quickly becoming the breakout star, and her snide boyfriend — the band’s guitarist and album producer, Peter (Tom Pecinka) — seizes upon her insecurity to berate her in the name of love and success. Observing are stoic drummer Simon (Chris Stack), desperate to return to his wife and kids in the UK, and engineers Grover (Eli Gelb) and Charlie (Andrew R. Butler), who are facing their own pressure to not screw things up on the other side of the studio&#8217;s soundproof partition.\n\nOut of nowhere, the unnamed band&#8217;s year-old record becomes a chart-topper. Diana is thrust into the spotlight when her song explodes. Reg and Holly break up and get back together and break up again. Songs and riffs and licks are invented out of thin air. Columbia Records triples their budget. Nothing happens and everything happens, and it&#8217;s riveting from start to finish, one of those shows that unassumingly lures you in and then socks you with a punch of emotion that leaves you on the edge of her seat.\n\nYes, it&#8217;s still long (and a little ironic that one plot thread is about Diana refusing to cut some of her new song for timing), but the Broadway mounting — with the same company and creative team — feels tighter and faster than it did last fall. The transitions are quicker, the silences less demanding. The performances are so exquisitely rendered, so beautifully lived-in, that every moment is full, whether they&#8217;re bickering, snorting coke, or simply knitting. Holly and Grover&#8217;s discussion of Julie Christie and Donald Sutherland&#8217;s explicit sex scene in the occult thriller Don&#8217;t Look Now becomes as erotic as it is on screen thanks to the air of mystery that Canfield brings to the conversation. Transfixing moments of minutiae like that would usually be cut, but everyone involved with the transfer has such trust that there&#8217;s no trying to fix what&#8217;s not broken.\n\nEach actor has their own arc and showy bits. Butler&#8217;s quirky diffusion of the tension in the room is made even wittier when he realizes that nobody remembers his name. Gelb&#8217;s quiet intimidation quickly becomes a short-fused irritation that leads to a first-rate explosion. Stack is more present as the erstwhile voice of reason, and Brill is even zanier as he swings from the doorframe or collapses with exhaustion in the fetal position. Pecinka&#8217;s Peter is such an extraordinarily awful person that you just hate him and his lavender pants (Enver Chakartash&#8217;s perfect costumes are period without being Halloweeny). And Pidgeon, the heart of the group and the play, infuses Diana with palpable and genuine heartbreak as terror overtakes what should be the most thrilling time of her life.\n\nEven with their individual strengths, the seven actors still coalesce into a true ensemble, a testament to Aukin&#8217;s sharp eye for detail. That level of realism extends to Ryan Rumery&#8217;s sensationally convincing sound design, Jiyoun Chang&#8217;s subtly shifting lighting, and, particularly David Zinn&#8217;s set. With its wood-paneled walls, central mixing table, and analog tape decks, it looks like it could function as an actual recording studio. Their work is just remarkable.\n\nThen again, everything about Stereophonic is remarkable from top to bottom. It&#8217;s the kind of play that reminds you how the magic of theater is a singular experience. Art isn&#8217;t easy, but they sure make it look like it is.\n\nStereophonic on Broadway\">\n                        \n                                    \n            \n        \n        \n            \n                \n                    Interview: Meet the Seven Breakout Stars of Stereophonic on Broadway                \n            \n        \n    \n\n                                                                                \n                    \n                            \n\n            \n\n\n        \n\n        \n\n        \n\n\n        \n\n            \n                        \n\n\n\n\n            \n            \n            \n                \n                    Tagged in this Story\n                \n\n                \n                                            \n                            \n                                    Andrew R. Butler\n                            \n                        \n                                                \n                            \n                                    Chris Stack\n                            \n                        \n                                                \n                            \n                                    Daniel Aukin\n                            \n                        \n                                                \n                            \n                                    David Adjmi\n                            \n                        \n                                                \n                            \n                                    Eli Gelb\n                            \n                        \n                                                \n                            \n                                    Juliana Canfield\n                            \n                        \n                                                \n                            \n                                    Sarah Pidgeon\n                            \n                        \n                                                \n                            \n                                    Stereophonic\n                            \n                        \n                                                \n                            \n                                    Tom Pecinka\n                            \n                        \n                                                \n                            \n                                    Will Brill\n                            \n                        \n                                                \n                            \n                                    Will Butler\n                            \n                        \n                                        \n            \n                        \n\n            \n\n\n\n\n\n\n\n\n\n\n\n\n            \n            \n\n\n    \n        Latest Reviews\n        \n        \n            See all\n        \n    \n    \n                            \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: Marjorie Prime Predicted the Rise of the AI Companion                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: The Jinkx and DeLa Holiday Show Offers Season's Greetings for Scream Queens                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: A Christmas Carol, Starring Michael Cerveris, Is Tight as a Drum and Pretty as a Picture                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: Gotta Dance! Hands Broadway Hoofers a Kickline of Classics                 \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: The Faggots and their Friends Between Revolutions, a Queer Mass                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: Paddington the Musical: Marmalade and Musical Heaven                \n            \n        \n    \n\n                    \n\n            \n        \n\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n        \n            \n            \n            \n            \n            \n            Theater News & discounts\n                \n                    Get the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nThe live film capture of the 2023 Broadway revival starring Daniel Radcliffe, Jonathan Groff, and Lindsay Mendez hits theaters December 5.",
  "isFullReview": true,
  "dtliExcerpt": "In short, Stereophonic is still as much of a masterpiece as it was six months ago, and it’s deservedly poised to become the big hit of the year.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 970,
  "archivePath": "data/archives/reviews/stereophonic-2024/theatermania--david_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:38:11.766Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251209165306",
  "archiveOrgUrl": "http://web.archive.org/web/20251209165306/https://www.theatermania.com/news/review-the-art-of-making-art-in-istereophonic-i-a-true-broadway-masterpiece_1737559/"
}