{
  "showId": "stereophonic-2024",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Joey Sims",
  "url": "https://www.theatrely.com/post/an-exceptional-stereophonic-on-broadway-review",
  "publishDate": "April 19, 2024",
  "fullText": "For three glorious hours, Stereophonic drops its audience into a unique agony: the pursuit of artistic perfection. David Adjmi’s astounding new work, itself near-perfect, captures the wondrous highs and excruciating lows of the creative process with a hilarious, painstaking precision. You’ll want to live in this play forever.\n\nSet in a Sausalito, California recording studio in 1976 and partly inspired by Fleetwood Mac’s drug-fueled creation of their magnum-opus Rumors, Stereophonic follows an up-and-coming rock group’s similarly addled attempts to record a new album. Intended to last a few weeks, the sessions drag on for months as personal and artistic tensions bubble to the surface. \n\nDaniel Aukin’s slow-burn production eases us in at first, crafting a lived-in world on David Zinn’s wondrously detailed set. Still, the tensions are evident from moment one. The band members talk over each other; their engineer, Grover (Eli Gelb) is in way over his head; all seems out of sync. Plus, the coffee maker is broken. \n\nIn revisiting Stereophonic, which opened tonight at the Golden Theatre following a sold-out run at Playwrights Horizons last fall, the first act’s journey from disarray to artistic harmony hit me more clearly. Aukin has fine-tuned his production in the move to Broadway. It is basically the same show, but just a bit sharper, a bit tighter.\n\nThrough some combination of magic and sheer force of will, the band stumbles its way, by the end of the act, towards something like creative harmony — culminating in a triumphant recording of “Masquerade,” one of six outstanding numbers composed for the play by Will Butler (of Arcade Fire). It won’t last, but what a beautiful thing. \n\n“Music isn’t supposed to be perfect,” drummer and “band-Dad” Simon (Chris Stack, soft and mournful) insists to insecure lead guitarist Peter (Tom Pecinka). Peter can’t hear it. As the band’s previous album unexpectedly rises in the charts, he will gradually tear them apart in a cruel, egomaniacal pursuit of impossible perfection — with his girlfriend, lead singer Diana (Sarah Pidgeon, extraordinary) typically the chief target of his ire. \n\nNot helping matters is the constant feuding of on-off lovers Reg and Holly (Will Brill and Juliana Canfield, a nightmare couple for the ages). Also, an exhausted Grover is gradually losing it, while getting minimal support from his assistant Charlie (Andrew R. Butler, pricelessly funny) who mostly contributes bizarre, vaguely horrifying anecdotes. \n\nAdjmi captures all the familiar agonies and ecstasies of art-making — endless late nights, bouts of depression, vicious arguments over most minute details. The strangest particulars feel the most truthful here, as when Peter insists he has pieces of glass stuck in his foot (he does not), or when Simon spends six days trying to “fix” the precise rhythm of a snare drum. \n\nTime passes in a fluid, clear manner, helped by careful touches from Aukin. As money from the last album flows in, Enver Chakartash’s costumes keep getting crisper. Reg cleans up his act, bit by bit, and Brill’s drawl recedes as he does. Simon slowly deflates as his marriage collapses. And Grover grows more assertive as he gets better at his job, an especially pleasing arc which Gelb smartly underplays. \n\nFinally, as Diana’s solo success grows, Peter’s insecurity intensifies. While every step of their toxic dynamic feels plausible, the pair are not the play’s most compelling element. There is a central problem which Adjmi sets up for himself. Early in the play, when Diana plays them all a heavenly-sounding track she’s working on, we feel Peter’s silent realization that she will leave him in the dust. It’s an exquisite bit of writing, but also tells us everything we need to know about how the relationship will progress  — and there are no surprises. \n\nNo great matter — there is so much else to engage with. A second viewing particularly provided new insight into Holly, who seems cursed to understand her own needs yet always work against them. And even more so than at Playwrights, Pidgeon is transcendent as Diana. The play’s agonizing second-act opener, in which she struggles to hit a tough note while Peter lambasts her from the booth, will be seared into my memory for a long time to come. \n\nYet Diana still declares, after the album is done, that these endless sessions were “probably the best time of her life.” And we understand. We could hang out with these characters in the Golden forever, fighting painfully towards a perfection we’ll never, never find. \n\nStereophonic is now in performance on Broadway at the Golden Theatre on West 45th Street in New York City.",
  "originalScore": null,
  "assignedScore": null,
  "source": "scraped",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-Rock-N-Roll-Drama-STEREOPHONIC-Opens-On-Broadway-20240419",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-23T21:55:15.747Z"
}