{
  "showId": "god-of-carnage-2009",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2009/03/23/theater/reviews/23carnage.html",
  "publishDate": "March 23, 2009",
  "fullText": "What begins as an exercise in civilized parenting devolves into a primal scream therapy session, as adult masks slip to reveal the snarling children beneath.",
  "isFullReview": false,
  "dtliExcerpt": "What begins as an exercise in civilized parenting devolves into a primal scream therapy session, as adult masks slip to reveal the snarling children beneath.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Examined coldly, this 90-minute play about two couples who meet to discuss a playground fight between two of their children isn’t much more than a sustained Punch and Judy show, dressed to impress with sociological accessories. But there’s a reason that Punch and Judy’s avatars have fascinated audiences for so many centuries in cultural forms low (“The Honeymooners” of 1950s television) and high (Edward Albee’s 1962 drama “Who’s Afraid of Virginia Woolf?”). “God of Carnage,” which is poised somewhere in between, definitely delivers the cathartic release of watching other people’s marriages go boom. A study in the tension between civilized surface and savage instinct, this play (which recently won the Olivier Award in London for best new comedy) is itself a satisfyingly primitive entertainment with an intellectual veneer.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "What begins as an exercise in civilized parenting devolves into a primal scream therapy session, as adult masks slip to reveal the snarling children beneath.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (25 words)",
  "rejectedAt": "2026-02-03T16:17:03.422Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single quote or excerpt without any show identification, recommendation, or substantive review content to score.; openai: The text provided is a plot summary or thematic description without any evaluative content or critique of the production.; kimi: This text is a single sentence describing the plot/narrative arc of a show (likely 'God of Carnage') but contains no evaluative language about the production quality, performances, or whether the critic recommends seeing it. It is purely descriptive rather than critical.",
  "promptVersion": "5.2.0",
  "bwwScore": 9,
  "sources": [
    "web-search",
    "bww-reviews"
  ]
}