{
  "showId": "elf-2012",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Elf/1266",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Elf/1266",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nCititour.com Review\n It’s been nearly a dozen years since Santa’s overgrown helper Buddy the Elf, the title character of the blockbuster 2003 movie that starred Will Ferrell, has graced a Broadway stage. Well, if we ever needed a little Christmas now (to quote Jerry Herman), let’s be truly thankful he’s returned – now in the spectacular personage of Grey Henson – in the utterly winning revival of the musical “Elf,” now ensconced for a few weeks at the Marquis Theatre.\n\nThis production, directed with flair by Philip Wm. McKinley, jazzily choreographed by Liam Steel, and snazzily designed by Tim Goodchild, originated in Great Britain, but it has a decidedly all-American feel and a whole lot of Broadway razzmatazz. \n\nWith a savvy book by Thomas Meehan and Bob Martin – which has been not-so-subtly updated in some clever ways but still retains its share of hoary jokes – “Elf” tells what happens when Buddy (Henson) learns that he’s not really a 30-year-old elf, even though the fact that he towers above his friends in the North Pole has never clued him in. You got it! Buddy is actually a human who has been raised his entire life in “Christmastown” after he crawled away from his now-dead mother and ended up in the sack of the one-and-only Santa Claus (played with a dose of sweet-and-sour sauce by Sean Astin).\n\nArmed with this newfound knowledge, Buddy immediately sets off to New York City to reconnect with his dad Walter Hobbs (an almost too-grumpy Michael Hayden), a Scrooge-like children’s book publishing executive with an even grumpier boss (also played by Astin, not that you’d know!) who threatens to fire him on Christmas Day!\n\nUnsurprisingly, Walter has no time and no use for his new son – an innocent goofball sporting a bright green elf suit – but he also horribly neglects his loving wife Emily (Ashley Brown, both lovely and sassy) and his teenage son Michael (played at my performance by the adorable, strong-voiced Kai Edgar).\n\nSome of what’s best in the show, musically, centers on Walter’s neglected family. Composer Matthew Sklar and lyricist Chad Beguelin serve up a gorgeously bittersweet tune, “I’ll Believe in You,” as Emily and Michael write a letter to Santa, followed much later by the exuberant “There Is a Santa Claus,” which follows the moment when Emily and Michael catch a glimpse of Santa’s (faltering) sleigh over Manhattan.\n\nThe irrepressible Henson, who echoes Ferrell’s physicality, gets plenty of chances to shine, thanks to Sklar and Beguelin, in such tunes as “Happy All the Time,” “World’s Greatest Dad,” “Just Like Him,” and the earworm “Buddy the Elf.” In fact, he’s so consistently adorable you may want to take him home (although you’ll have to settle for the Buddy the Elf doll sold at the merchandise stand)!\n\nAudiences may also feel somewhat similarly about Kayla Davion as Jovie, the disillusioned young woman whom Buddy instantly falls for. The show’s big “joke” is that Jovie can’t – or doesn’t – sing, but Davion does so wonderfully, especially with the torchy “Never Fall In Love (With an Elf). She’s also part of the show’s most crowd-pleasing number, the ultra-lively “Sparklejollytwinklejingley,” in which Buddy tries to inspire his co-workers at Macy’s Santa’s Village.\n\nAs well cast as the main roles are, the entire ensemble – which includes the sparkling Jennifer Sanchez as Walter’s well-meaning assistant Deb, Kalen Allen as the sassy store manager, and Clifton Samuels as Larry, who earns Buddy’s wrath as the guy hired by Macy’s to play Santa – is also first-rate.\n\nNot just a family-friendly entertainment, “Elf” also delivers a universal message about the importance of family and the need to believe in miracles. And let’s face it, that is something many of us are praying for these days!\n By Brian Scott Lipton\n\nVisit the Sitehttps://elfonbroadway.com/Open/Close DatesOpening 11/17/2024Closing Open-ended\nTheatre Info\nMarquis Theatre1535 Broadway New York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 691,
  "archivePath": "data/archives/reviews/elf-2012/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:38:07.066Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "contentTier": "complete",
  "wordCount": 691,
  "tierReason": "Full review text"
}