{
  "showId": "book-of-mormon-2011",
  "outletId": "boston-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.boston.com/ae/theater_arts/articles/2011/03/24/zany_musical_the_book_of_mormon_will_convert_you/",
  "publishDate": null,
  "fullText": "NEW YORK—Many big Broadway musicals like to roll out a lush dream sequence at some point. Few feature Adolf Hitler, lawyer Johnnie Cochran, Genghis Khan and serial killer Jeffrey Dahmer.\n\nBut such is the cockeyed spell cooked up by three guys behind \"South Park\" and \"Avenue Q\" that by the time those historical figures appear -- dancing furiously, naturally -- in \"The Book of Mormon,\" it seems perfectly normal.\n\nBy then, of course, audience members have seen Christ mocked, Mormons ridiculed and Darth Vadar pop up unexpectedly. They've heard jokes about raping babies and songs with unprintable lyrics. A running joke has a man complain about maggots in his scrotum.\n\nSilly? Yes. Smart? Yes, actually. If there's such a thing as an intelligent sophomoric musical that the whole family can enjoy then writers Robert Lopez, Trey Parker and Matt Stone have successfully stalked it and put it in a headlock.\n\n\"The Book of Mormon,\" which opened Thursday at the Eugene O'Neill Theatre, is inventive and slick and subversive. It is funnier and smarter than \"Monty Python's Spamalot,\" managing to offend, provoke laughter, trigger eye-rolling, satirize conventions and warm hearts, all at the same time.\n\nYou might expect Parker and Stone, who forever changed cartoons with their foul-mouthed elementary students, and Lopez, who made it safe for puppets to swear on stage, to utterly disrespect traditional musical conventions -- \"Oh my God, they killed Broadway. You bastards!\" -- but you'd be wrong.\n\nWhat they've done is faithfully maintain the structure and rhythm of a classic musical -- think Rodgers and Hammerstein's \"The King and I\" -- even while filling it with utter zaniness. There's dancing, romance and hopefulness, but also diarrhea and jokes about \"The Lion King.\" And many of the songs will stick in your head with frightening ease, from the ensemble \"Turn If Off\" to the sexy duet \"Baptize Me\" to the gorgeous solo \"I Believe.\"\n\nThe three writers have found a kindred spirit in Casey Nicholaw (\"Monty Python's Spamalot\" and \"The Drowsy Chaperone\"), who this time choreographs and co-directs with Parker. The combination translates into a tight, visually popping show with plenty of dance sequences featuring white guys raising the roof.\n\nIt's basically a fish-out-of-water tale, starring two eager Mormon missionaries (Andrew Rannells plays a straight-arrow Ken doll called Elder Price, and Josh Gad portrays Elder Cunningham, his unkempt, spazzy sidekick) who fly to Uganda to join a group converting Africans. Gad is so gifted a physical comedian that he can trigger laughs just by sitting, and Rannells is his perfect uptight foil.\n\nThe white-shirt, black-tie wearing duo aren't prepared for what they find in northern Uganda: Warlords, famine, AIDS and cynicism. That forces them to question their faith and threatens to break up their partnership until a young woman, a winsome Nikki M. James, chooses to embrace their promise of salvation and persuades the village to listen as well.\n\nThat's great news to Elder Cunningham, who psyches himself for his big presentation of Mormon belief by imagining what Jesus would do in the mock-rock song \"Man Up\" (one of the lyrics confusedly insists, \"He took a bullet for me\"). In his excitement, Cunningham then peppers his sermon with references to \"Star Trek\" and \"The Lord of the Rings.\"\n\nBut his friend Elder Price has spiraled into despair -- even Jesus calls him an expletive -- and he is haunted by a dream of hell (cue up Hitler and Company). The two misfits must pull it together long enough to convert the village, confront an evil warlord and impress their Mormon bosses. They also must try to avoid having the Book of Mormon shoved in their intestinal tracts.\n\nSet designer Scott Pask has worked overtime to take the audience from Salt Lake City to a fetid, ramshackle African village to a pitchfork vision of hell -- not to mention a side trip to Walt Disney World. Costumes by Ann Roth are inventive and take advantage of the gulf between the standard black-and-white Mormon outfits and the colorful clothes of the Africans.\n\nUltimately, believe it or not, this is a pro-religion musical, or at least a story about the uplifting power of stories. Far from being nihilistic, the moral seems to endorse any belief system -- no matter how crazy it sounds -- if it helps do good. Amen to that. Consider us converted.\n\nhttp://www.bookofmormonbroadway.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 726,
  "archivePath": "data/archives/reviews/book-of-mormon-2011/boston-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:42:39.849Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20150930000240",
  "archiveOrgUrl": "http://web.archive.org/web/20150930000240/http://www.boston.com:80/ae/theater_arts/articles/2011/03/24/zany_musical_the_book_of_mormon_will_convert_you/"
}