{
  "showId": "book-of-mormon-2011",
  "outletId": "chicago-tribune",
  "outlet": "Chicago Tribune",
  "criticName": "Chris Jones",
  "url": "http://leisureblogs.chicagotribune.com/the_theater_loop/2011/03/book-of-mormon-broadway-review-south-park.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+chicagotribune%2Fthetheaterloop+%28Chicago+Tribune+-+The+Theater+Loop%29",
  "publishDate": "2011-03-25T13:49:16-04:00",
  "fullText": "Subscribers are entitled to 10 gift sharing articles each month. These can be shared with friends and family who are not subscribers. Subscribe now! or Sign in to your account. You can see a new show in this singularly remarkable theater city pretty much every night between now and Thanksgiving. But if you prefer to be more selective — or prosaic necessities limit your cultural intake — here are 10 of the most anticipated Chicago shows of the fall. On Broadway, they’ve got Daniel Radcliffe (a.k.a. Harry Potter) in “Equus” and Katie Holmes in “All My Sons,” plus “Billy Elliot”and “Shrek.” On an unusually rich and diverse autumn slate, Chicago has its own trio of high-profile new musicals, along with everything from Shakespeare in Sinhalese to the first Midwestern stand of “Little Edie” Beale. Chicago and the Pulitzer Prize-winning Tony Kushner have a long, close relationship — the national tour of “Angels in America” started here, and Steppenwolf has produced many of his works. Incredibly, though, it has taken more than four years for Kushner’s autobiographical Broadway musical (penned with the composer Jeanine Tesori) to make its Chicago premiere. Court Theatre artistic director Charles Newell takes on a show that chronicles social change in 1960s America. E. Faye Butler stars. Sept. 11 to Oct. 19 at Court Theatre. 773-753-4472 or courttheatre.org. Having discovered a large portion of the globe wants to relive its love affair with the movie “Dirty Dancing,” this live musical version of Baby’s avoidance of that dreaded corner has done very well in London, Canada and Australia. It makes its United States premiere right here in Chicago, before a future run on Broadway. Sept 28 through Dec. 7 at the Cadillac Palace Theatre. 312-902-1400 or broadwayinchicago.com. In this widely acclaimed marathon performance piece from the Elevator Repair Service, the text of F. Scott Fitzgerald’s “The Great Gatsby” is performed unabridged. It takes six hours. But it’s far more than a mere recitation. In this piece — named for the author’s real name — a man picks up a paperback. And the ordinary drones of a modern-day office morph into denizens of Fitzgerald’s surreal, glamorous era. Nov. 14-16 at the Museum of Contemporary Art. 312-397-4010 or mcachicago.org. The story of Edith Bouvier Beale and “Little Edie” Beale — eccentric relatives of Jacqueline Kennedy Onassis’ — is the topic of this moving 2006 Broadway musical by Scott Frankel and Michael Korie. Northlight Theatre has the Midwest premiere of a show that deftly captures the outer edges of eccentric celebrity and the way happiness and fulfillment can pass us by in an instant. Hollis Resnik takes on the role originated by the Tony-winning Christine Ebersole. Nov. 12 to Dec. 21 at the North Shore Center for the Arts in Skokie. 847-673-6300 or northlight.org. The last time the great Frank Galati adapted a novel by the famed Japanese author Haruki Murakami, the resultant show played all over the country. This fall, Galati takes on Murakami’s typically fantastical coming-of-age tale, fusing memory and contemporary Tokyo. Francis Guinan, who is staying in town instead of traveling to London with “August: Osage County,” stars, along with the Steppenwolf wunderkind Jon Hill (“Superior Donuts”). Sept 18 to Nov. 16 at Steppenwolf Theatre. 312-335-1650 or steppenwolf.org. Writers’ Theatre hired the young associate artistic director Jimmy McDermott to shake things up in Glencoe. And given the potentially seductive cast of Elizabeth Laidlaw, Niki Lindgren and Helen Sadler, Jean Genet’s scandalous 1948 drama, “The Maids,” should banish any North Shore cobwebs in time for a gruesome Thanksgiving. Nov. 18 through April 5 at Writers’ Theatre, Glencoe. 847-242-6000 or writerstheatre.org. Even Shakespeare is not immune from globalization: Tim Supple’s kinetic, multilingual version of the bucolic Shakespearean comedy has been hailed across the globe as a dazzling multicultural feast. First staged in India in 2006 and then London in 2007, this uncommon “Midsummer” is performed in English, Hindi, Bengali, Tamil, Malayalam, Marathi, Sanskrit and Sinhalese. These are the languages of the cast, who’ll be in Chicago for two weeks in a preview of what an Olympic arts festival could look like. Nov. 25-Dec. 7 at the Chicago Shakespeare Theater. 312-595-5600 or chicagoshakes.com. On the night of Dec. 4, 1956, in Sam Phillips’ Sun Recording Studios in Memphis, a spontaneous jam session took place. Nothing weird in that — except the participants happened to be Elvis Presley, Jerry Lee Lewis, Carl Perkins and Johnny Cash. This high-profile new commercial musical — produced by Gigi Pritzker — re-creates the events of that remarkable night. The show, which is renting space from the Goodman Theatre, is directed by Eric Schaeffer of the Signature Theatre in Arlington, Va. If it works, expect a New York future. Sept. 27 to Oct. 26. 312-443-3800 or goodmantheatre.org. It’s penned by the guys who gave us “Jersey Boys.” It’s directed by the legendary Tommy Tune. And it stars Jeff Daniels, the most famous actor in the entire state of Michigan. Talk about a show with a pedigree. This time-traveling new musical is a jukebox show. But instead of celebrating Abba or the Four Seasons, it’s a celebration of the Great American Standard, the soundtrack of Hilton lounges all across the globe. Sept. 19 to Oct. 26 at the Goodman Theatre. 312-443-3800 or goodmantheatre.org. About Face Theatre has a new artistic director in Bonnie Metzgar and “The Ladies Of …” is her first show. Therein, the highly regarded New York performance artist Taylor Mac uses letters from lonely hearts to try to connect with his father, who died in Vietnam while Mac was still a child. Mac is known for enigmatic costumes and a fluid approach to gender, even though his lost dad was the straightest of military arrows. Sept 26 through Oct. 26 at the Center on Halsted. 773-784-8565 or aboutfacetheatre.com. Subscribers are entitled to 10 gift sharing articles each month. These can be shared with friends and family who are not subscribers. Subscribe now! or Sign in to your account.",
  "isFullReview": false,
  "bwwExcerpt": "But just as it starts to feel as if watching the \"South Park\" guys deconstruct the apparent illogicalities of Mormonism is starting to sound the same, one-sided note, Parker, Stone and Lopez engineer a very savvy twist in the narrative. This re-energizes the show early in the second act, focuses it more acutely on those \"Avenue Q\"-like themes of young people seeking out their purpose and propels it to a conclusion that leaves audience members feeling they've attended something weightier than a series of pointed laughs fired into a soft religious target.",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "bwwThumb": null,
  "bwwUrl": "http://leisureblogs.chicagotribune.com/the_theater_loop/2011/03/book-of-mormon-broadway-review-south-park.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+chicagotribune%2Fthetheaterloop+%28Chicago+Tribune+-+The+Theater+Loop%29",
  "textStatus": "complete",
  "textWordCount": 993,
  "textFetchedAt": "2026-01-25T14:19:44.869Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/book-of-mormon-2011/chicago-tribune--chris-jones_2026-01-25.html",
  "textQuality": "partial",
  "sourceMethod": "bww-roundup"
}
