{
  "showId": "book-of-mormon-2011",
  "outletId": "cititour-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://cititour.com/NYC_Broadway/The-Book-of-Mormon/760",
  "publishDate": null,
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\n\n\n\n\n\nTickets from $59\n\t Buy Tickets\n\nCititour.com Review\n    Traditional in form and style, but subversive in content, the new musical, “The Book of Mormon,” is a no-holds-barred extravaganza rife with irreverence. Its creators, Trey Parker and Matt Stone, of “South Park” fame, and Robert Lopez from Broadway’s other irreverent show, “Avenue Q,” have managed to combine the Church of Latter-day Saints and Africa’s AIDs crisis into a coming-of-age tale brimming with hope. It’s a wild, outrageous ride, that’s sure to offend and please all in an instant.\n\nAfter learning the history of the establishment of the Mormon Church, two innocent young men are sent to Africa to convert the locals. As they face resistance and disinterest from villagers, they are surrounded by poverty, violence, a corrupt general, and the reality of a place where AIDs is an epidemic. But no matter what the challenge they manage to persevere bringing hope to a desolate place.\n\nAlthough we may not have heard of him, Andrew Rannells stars in the breakout role of Elder Price. Rannells has already had Broadway stage time in “Jersey Boys” and “Hairspray.”  This time he sings with a passion which is invigorating and the character, who goes through a crises of conscience, is played with restraint never allowing him to become a caricature. He’s joined on his mission by Elder Cunningham, played by the comic genius of Josh Gad who made such an impression in “The 25th Annual Putnam County Spelling Bee.” Also, a Daily Show correspondent, Gad can get a laugh just smiling in the right direction.\n\nThe rest of the ensemble is outstanding. From Nikki M. James, as the innocent village girl who thinks that ‘texting’ is done on an old typewriter, to Michael Potts, as the village leader to Brian Tyree Henry, in his Broadway debut, as the cruel General.\n\nThe choreography from Casey Nicholaw, who also directed along with Trey Parker, is exuberant and amusing. The score, although snappy and humorous, isn’t exactly filled with memorable showstoppers, although every number lands.\n\nIf you look at the progression of the Broadway musical, it’s hard to tell when the tide turned. “Hair” was a one shot in 1968 and not until “Urinetown” did less traditional shows make a mark. We can safely say, that with the astonishing “The Book of Mormon” Broadway will never be quite the same again!\n    \t    By Lesley Alexander\n\nVisit the Sitehttp://www.bookofmormonbroadway.com/CastJosh Gad, Andrew Rannells, Nikki M. James, Rory O’Malley, Michael PottsOpen/Close DatesOpening 2/24/2011Closing Open-endedBox Office212-239-6200\nTheatre Info\nEugene O'Neill Theatre230 West 49th StreetNew York, NY 10036\t  \tMap\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.\n\nAbout Us | Editorial Guidelines | Contact Us",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 482,
  "archivePath": "data/archives/reviews/book-of-mormon-2011/cititour-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:43:50.679Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "sourceMethod": "scrapingbee"
}