{
  "showId": "book-of-mormon-2011",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Lisa Schwarzbaum",
  "url": "http://www.ew.com/article/2011/03/24/book-mormon",
  "publishDate": "2011-03-25T13:49:16-04:00",
  "fullText": "Two young men get posted to Uganda in The Book of Mormon — missionaries fulfilling their religious duties as members of the Church of Jesus Christ of Latter-day Saints. And what happens to Elder Price (Andrew Rannells) and Elder Cunningham (Josh Gad) in poor, hungry, AIDS-plagued Africa is…well, it’s R-rated, hilarious, humane, and the basis of an exhilarating Broadway musical at once revolutionary and classic, funny and obscene, uncompromising in production standards and unafraid of just about anything else. South Park devotees (count me among them) might expect no less from Matt Stone and Trey Parker, the rude crypto-geniuses who created the crudely animated TV series, and whose 1999 feature-length South Park: Bigger, Longer & Uncut compacted the entire history of movie musicals (particularly of the Disney kind) into one epic satire. But collaborating with Robert Lopez, who helped bring his own inspired warped spin on Sesame Street to the puppet-driven Broadway musical Avenue Q, they have done wonders far beyond the ken of Cartman and Kenny, Big Bird and Cookie Monster. Their big-budget production tells a truly original story (not a revival, not based on an already existing movie!). They address serious, difficult, audience-sensitive issues including poverty, homophobia, the religious beliefs of others, the epidemic of HIV and AIDS in Africa, and Africa’s shocking cultural tradition of female genital mutilation. They make rude, laugh-till-you-ache jokes at the expense of all of the above. And yet: They have also created a spectacular, rather perfect Broadway musical not only grounded in a serious love and understanding of the traditions that make a Broadway musical great but also filled with love for the very flawed, mortal characters who populate this romp. Oh, and because they can’t help themselves, the guys also give The Lion King a quick, swift kick in the pantaloons. No appreciation of the South Park universe is required to fall under such a spell. Parents and grandparents ought to know, however, that this is not the proper birthday-gift ticket for a kid, unless that kid is at ease with songs — funny, funny songs — about the rape of babies, the cutting of women, and the way a young Mormon man can tame pesky homosexual desires by following the advice of the how-to song ”Turn It Off.” Rannells, a heretofore utility musical-theater hoofer (Jersey Boys, Hairspray) with a choirboy smile and Raquel Welch-variety-show good looks, is a breakout star as Elder Price, the pretty, best-at-everything overachiever. This missionary’s dream destination would have been magical Orlando, and although he tries to put a good face on Uganda, he’s nowhere over the rainbow about his assignment. Gad, from the fat-funny-and-frazzled school of early Seth Rogen and Jonah Hill, is fearlessly verklemmt as Elder Cunningham, the schlumpy, underachieving sidekick whose attempts to fit into the faith of his people is forever undermined by his propensity to confuse Mormon scripture with the gospel of Star Wars. (Gad, a go-for-broke performer, is just the right size in a show this big and wild.) Both men sing and dance like crazy dreams — which are not the same as the ”Spooky Mormon Hell Dream” to which all the young missionaries confess they are susceptible in the African night. Every detail of the production — choreographed with typical brilliance by Spamelot‘s Casey Nicholaw and codirected by Nicholaw and Parker — serves a purpose. Every character signifies. Every song is crafted with erudition about what a song is meant to do. The cast is uniformly nimble and charismatic, including Michael Potts as a Ugandan village leader and Nikki M. James as his daughter, a lovely young woman desperate enough to escape her own impending genital mutilation that she listens to the new Mormon visitors with an open mind. Costumes, set, lighting, dancing that will look great at the Tonys when the cast comes to collect what I predict will be an armload of awards: This is what 21st-century Broadway can be. If Broadway has the balls. Lord knows, The Book of Mormon does. A (Tickets: Telecharge.com or 800-432-7250) More on The Book of Mormon from EW:Book of Mormon exclusive! Trey Parker and Matt Stone on favorite musicals",
  "isFullReview": false,
  "bwwExcerpt": "A: Teaming with Avenue Q co-creator Robert Lopez (South Park creators Matt Stone and Trey Parker) to wrote a perfect book, music, and lyrics, they honor the traditions of great song-and-dance musical theater in all the best ways: Every detail of the production - choreographed with typical brilliance by Spamalot's Casey Nicholaw and codirected by Nicholaw and Parker - serves a purpose.",
  "showScoreExcerpt": "\"An exhilarating Broadway musical at once revolutionary and classic, funny and obscene, uncompromising in production standards and unafraid of just about anything else.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Broadway-Review-Roundup-THE-BOOK-OF-MORMON-20110324",
  "textStatus": "complete",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.955Z",
  "textWordCount": 690,
  "textFetchedAt": "2026-01-25T14:23:31.681Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/book-of-mormon-2011/ew--lisa-schwarzbaum_2026-01-25.html"
}