{
  "showId": "book-of-mormon-2011",
  "outletId": "LATIMES",
  "outlet": "Los Angeles Times",
  "criticName": "Charles McNulty",
  "url": "https://www.latimes.com/entertainment/arts/la-et-book-of-mormon-review-20110324-story.html",
  "publishDate": "2011-03-24",
  "fullText": "Sorry! The page you were looking for cannot be found. The page may no longer exist or may have moved to another web address. Try again to locate what you want by choosing a section from the navigation menu at left, viewing our Site Map or using the search box below. Search Query Submit SearchSearch Most Read Stories California Feds arrest fugitive Olympic snowboarder accused of becoming drug lord in Mexico Authorities claim Ryan Wedding’s alleged drug organization imported approximately 60 metric tons of cocaine a year into Los Angeles via semitrucks from Mexico. Jan. 23, 2026 California Top Los Angeles federal prosecutor faces blistering criticism for response to Minneapolis shooting Top Los Angeles federal prosecutor Bill Essayli faced blistering criticism from gun rights groups, including the NRA. 2 hours ago California Protests over Minneapolis shooting conclude in downtown Los Angeles; Bass assails ICE Protesters take to the streets in Los Angeles on Olvera Street 2 hours ago Awards 2026 Oscar nominations: The complete list of nominees The nominations for the 98th Academy Awards were announced Thursday morning, with ‘Sinners’ leading the field with 16 total nominations. Here’s the full list of 2026 Oscar nominees. Jan. 22, 2026 California Man charged in ‘largest jewelry heist in U.S. history’ avoids trial by getting deported A defendant in federal custody for what authorities have called the largest jewelry heist in U.S. history was deported to Ecuador late last month, according to court filings, effectively ending the case against him. Jewelers who lost nearly $100 million in merchandise are indignant. Jan. 22, 2026",
  "originalScore": null,
  "assignedScore": 90,
  "source": "reviews-json-stub",
  "needsFullText": true,
  "textStatus": "partial",
  "isFullReview": true,
  "textWordCount": 260,
  "archivePath": "data/archives/reviews/book-of-mormon-2011/latimes--charles-mcnulty_2026-01-25.html",
  "textFetchedAt": "2026-01-25T04:25:01.738Z",
  "textIssues": [
    "Word count too low: 260 (min: 300)",
    "Show title not found in text"
  ]
}