{
  "showId": "book-of-mormon-2011",
  "outletId": "stagezine-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.stagezine.com/the-book-of-mormon-will-convert-you/",
  "publishDate": null,
  "fullText": "THE BOOK OF MORMON Book, music, and lyrics by Trey Parker, Robert Lopez, & Matt Stone Directed by Casey Nicholaw & Trey Parker Choreographed by Casey Nicholaw Eugene O’Neill Theatre 230 West 49th Street (212-239-6200), www.BookofMormonBroadway.com\n\nHallelujah!  The Book of Mormon is the funniest religious spoof since Monty Python and the Holy Grail and Monty Python’s Life of Brian had both Protestants and Catholics alike outraged that Christianity had been lampooned.  However, what sets The Book of Mormon apart from the Monty Python film classics of Christian raillery is its ability to blend dark humor with peppy, clever songs, crisp dialogue, and spectacular choreography, all of which are essential elements of great American musical theater. It is not often that we see religious irreverence and profanity bred with “family-style” entertainment, and that is what makes this show such a creative watershed in Broadway history.\n\n“South Park” funny men Trey Parker and Matt Stone, with the help of Avenue Q co-author Robert Lopez, have taken an episode of the derisive TV show that parodied Mormon founder Joseph Smith, Jr.—the “American Moses”—and the foundations of his Church of Jesus Christ of Latter-Day Saints, and transformed the church’s teachings into an instant, feel-good American musical-comedy classic that theatergoers of all faiths will appreciate for its well-crafted humor and brilliant score.  Broadway’s The Book of Mormon doesn’t just jab the satirical needle into Mormons, but all religions that have tried to “save souls” and conquer foreign lands as “missionaries.”\n\nEverything here is ingenious in its depiction of America as a homogenized “promised land” and a “New Jerusalem of the New World”—especially Scott Pask’s sets, showing Wal Mart and Wendy’s juxtaposed next to the sacred Mormon Tabernacle, sitting against the backdrop of the snow-capped mountains in Salt Lake City, Utah.\n\nWhen the young Mormons learn from their church leader the name of which far-away land they will be spending two years as a missionary, the show’s two male leads, the handsome, goody-goody Elder Price (Andrew Rannells) and rotund, geeky misfit Elder Cunningham (Josh Gad) are both appointed to Uganda. After a bon voyage send-off by their families at the Salt Lake City International Airport, complete with a Lion King-style serenade, the two youngsters travel to the Dark Continent with much trepidation.\n\nThe villagers in the AIDS-ravaged Ugandan village have, of course, seen their share of Christian missionaries, so they are naturally skeptical about the arrival of squeaky-clean young men in suits touting Mormonism.   The Ugandans have enough to deal with, particularly a tyrant who threatens to circumcise all the village women, and they are not about to fall under the spell of more non-African outsiders trying to offer Christ’s “salvation” as a panacea for their myriad troubles.\n\nThe Ugandans belt out their disapproval to the missionaries in the hysterical showstopper “Hasa Diga Eeobawi,” which in their own language is a purportedly a lyrical slam that is one big “f*** you” to the Mormons’ beloved “Heavenly Father.”  However, just as the missionaries realize that they are not going to meet their quota of Mormon baptisms, the sweet-natured, beautiful young villager Nabulungi (the winsome, effervescent Nikki M. James) takes a shine to Elder Cunningham, much to the disapproval of the girl’s father, Mafala Hatimbi (Michael Potts).  Elder Cunningham twists the facts about Mormonism around to suit the needs of the incredulous Ugandans. The onstage chemistry between Mr. Gad, Ms. James, and Mr. Hannells is truly amazing.  Mr. Gad and Mr. Hannells are incandescent as a mismatched pair of missionary “companions,” while Ms. James has a winning mix of naïveté and spunk that consistently demands our attention whenever she is onstage.\n\nThings do not go as planned as the plot unravels, but along the way audiences are treated to some of the most infectious songs we’ve heard on Broadway in ages, from “Baptize Me,” “Joseph Smith American Moses” and “We Are Africa” (which eviscerates do-gooder Bono, among others) to “Spooky Mormon Hell,” complete with dancing devils and Starbucks coffee cups, Adolph Hitler, Jeffrey Dahmer, and O.J. Simpson attorney Johnnie Cochrane. There’s even a tap-dancing production number, featuring Mormon boys in glittery pink vests, a nod to the Mormons’ notorious condemnation of gays and lesbians.\n\nIs it all blasphemous?  That’s debatable, as much of the narrative fairly follows, albeit in a comic way, the history of Mormons.  Their religion is based on founder Joseph Smith, Jr., believing an angel, Moroni (played with over-the-top zeal by Rory O’Malley, who also doubles in the role of Elder McKinley) appeared to him in the 1800s in Rochester, NY, and told him about a people whom God had led from Jerusalem to America 600 years before Jesus’ birth. The angel purportedly introduced Smith to a third “New Testament” to the Bible: the eponymous Book of Mormon. The show’s seamless songs and witty lyrics celebrate Mormonism while mocking it simultaneously.\n\nDirectors Casey Nicholaw (best known for choreographing the equally sacrilegious Monty Python’s Spamalot) and Trey Parker make all the action, songs, and the actors’ fluid repartee blend together into a harmonious, uproarious evening of theater that, for many, will make one an instant convert to the genius of The Book of Mormon.\n\nPublished March 31, 2011 Reviewed at press performance on March 30, 2011\n\nDisney’s ‘Aladdin’ musical a magical rideMarch 26, 2014In \"Also Playing\"\n\n‘Something Rotten!’ smells hilariousMay 1, 2015In \"Closed Shows\"\n\n‘Dreamgirls’ London revival: All about EffieJune 30, 2017In \"London Theater\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 898,
  "archivePath": "data/archives/reviews/book-of-mormon-2011/stagezine-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:49:20.046Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "sourceMethod": "scrapingbee"
}