{
  "showId": "book-of-mormon-2011",
  "outletId": "unknown",
  "outlet": "unknown",
  "criticName": "Unknown",
  "url": "http://articles.philly.com/2011-03-24/news/29181934_1_mormonism-andrew-rannells-show-ends",
  "publishDate": null,
  "fullText": "The Book of Mormon opened today in 2011. It won 11 Tony Awards, including Best Musical. Its original leads &#8212; Andrew Rannells, Josh Gad, Nikki M. James &#8212; have moved on, thrust closer to stardom. Its co-writer Bobby Lopez has since won an Emmy, Grammy, and Oscar to add to his Tony, and was the co-composer of the must successful animated musical of all time, Frozen.\n\nCosting about $9.1 million to mount, The Book of Mormon earned nearly $250 million on Broadway alone (with an unprecedented top ticket price of $477) within the first three years, and that doesn&#8217;t count the grosses from its productions in Chicago and on national tour. When it opened in London in 2013, it broke box office records for the highest single day of sales in both West End and Broadway history. “It has never had an unsold seat in any building in which it’s played,” producer Scott Rudin has said.\n\nHere is my review, dated March 24, 2011:\n\nIt was inevitable that “The Book of Mormon” would be a “happy musical,” according to one of its creators, Trey Parker, because “Mormons are so happy-go-lucky optimistic people; they kind of have that cheesy factor…Disney/Rodgers and Hammerstein.”\n\nFew Mormons would likely be happy with Parker’s description of them, and fewer still with the musical, now opened at the Eugene O’Neill, that Parker has put together with his “South Park” partner Matt Stone and “Avenue Q” composer Robert Lopez. “The Book of Mormon” is also sure to offend or at least discomfort Disney, the Government of Uganda, Wal-Mart, Starbucks, people who don’t like humor that used to be called unprintable, and the devout of any faith.\n\nYet in an almost surreal way, “The Book of Mormon” is indeed a happy musical, the kind of traditional sweet and sassy Broadway entertainment that offers a generous and strategic mix of gorgeous sets, razzmatazz dance numbers, catchy tunes, a clever story, and well-timed hilarity.\n\nThat “The Book of Mormon” has moments of vulgarity and in-your-face satire should come as no surprise to those who have seen or even heard about the previous output of two-thirds of the team, Parker and Stone — “Team America: World Police,” say, or “South Park: Bigger, Longer & Uncut.” Their new musical is similarly profane.\nWhat may amaze theatergoers, though, is that this musical about two young Mormon missionaries sent to Uganda could in many respects just as easily be called “The Book of Broadway”\nThe opening musical number, a highlight entitled “Hello” in which the clean-cut white-shirt-and-narrow-tied members of the Church of Latter Day Saints ring doorbells to introduce themselves and their holy scripture (The Book of Mormon), seems influenced by the telephone opening of “Bye, Bye Birdie.”\nThe duet between the two missionary roommates, “You and Me (But Mostly Me)”\ncould have been inspired by “I Believe in You” from “How To Succeed in Business Without Really Trying,” in which the character sings to his mirror.\nThe overall plot of the musical seems a cross between “The Odd Couple” and “The Music Man,” with some detours through the aforementioned Rodgers and Hammerstein.\nIn none of these echoes are the creators of “The Book of Mormon” committing the sin of theft; they are worshipping at the altar of The Great White Way.\n\nAnd very white it is in Salt Lake City, Utah, where Andrew Rannells (“Hairspray,” “Jersey Boys”) plays a young fastidious member of the Church of Latter Day Saints whose name is Elder Price (I am not sure we ever learn his first name.) Elder Price wants nothing more than to serve his church as a missionary….in Orlando, Florida, home of Disney World. That is not what is in store for him. He is going to be sent on his two-year mission to Uganda.\nAnd he will be sent there paired with Elder Cunningham (first name Arnold), a fat but enthusiastic slob who uses the word “awesome” a lot, has a tendency to lie, and knows far more about “Star Wars” and “Lord of the Rings” than he does about Joseph Smith or Brigham Young or the sacred texts of their faith. Elder Cunningham is played by Josh Gad (“The Daily Show with Jon Stewart,” The 25th Annual Putnam County Spelling Bee”) in what is likely to be a star-making performance.\n\nOnce arrived in a small village in Northern Uganda, they do not receive an enthusiastic greeting from the villagers – dressed by the sharp-eyed costume designer Ann Roth in outfits half African/half Western that make it clear above all how poor they are. Just in case that’s too subtle an indication, one villager pulls a dead donkey across the stage. The villagers soon offer what the missionaries take to be a welcoming African-inflected song and dance, “Hasa Diga Eebowai” (homage to, and subversive spoof of, the “Hakuna Matata” song in “The Lion King.”) But then they tell the Mormons what “Hasa Diga Eebowai” means — (in the words of Elder Cunningham, using a euphemism) “F.U. Heavenly Father.”\n\nThe villagers have plenty of cause to be bitter: poverty, AIDS, violent strife by an evil warlord who kills under the slightest provocation and plans to circumcise all the women. Some of their afflictions are previously unimaginable.\n\n“I have maggots in my scrotum,” one man tells Elder Price\nAt a loss, Elder Price tells him to see a doctor.\n“I am the doctor.”\n\nFaced with all the daunting problems, the other missionaries offer a suggestion to the two newbies in song: “Turn It Off,” which ends with a old-fashioned soft-shoe number complete with red-sequined satin vests — a song-and-dance to tuning out the world’s problems.\n\nNeither of our heroes can just turn it off. His pristine white shirt splattered with blood from a spontaneous execution, Elder Price sputters in shock “Africa is nothing like The Lion King,” and vows to leave, imagining himself in Orlando, until a dream — “Spooky Mormon Hell Dream” in which he is cavorting with the three most evil men in history (Hitler, Genghis Khan and Johnny Cochran) — scares him into staying.\n\nMeanwhile, Elder Cunningham takes a different tack. He gathers the villagers together and preaches from The Book of Mormon. The problem is, he himself has never read the text, and he stumbles upon a passage about how the Lord God took people who “were white, and exceedingly fair and delightsome” and because they were evil, as a curse, “the Lord God did cause a skin of blackness to come upon them.”\n\nElder Cunningham then decides to use what he knows – nerdy sci-fi adventure stories – to invent on the spot his own brand of Mormon theology, and the natives are hooked. This leads to what is sure to be the most talked-about scene in the musical, “Joseph Smith American Moses,” in which the newly-converted Ugandans offer the Mission President visiting from Salt Lake City their own over-the-top blasphemous, intensely obscene and hysterical interpretation of the origins of the Church of Latter Day Saints (yet another page from the Book of Broadway — a bow to the dance choreographed by Jerome Robbins, “Small House of Uncle Thomas,” from “The King and I.”)\n\nEven while it satirizes, “The Book of Mormon” has some wonderfully sweet moments — a result, I suspect, of the leavening influence of Bobby Lopez, who with his collaborators turned “Avenue Q” into a musical that had just the right balance between outrageous and adorable.\n\nJust such a moment is the duet between Elder Cunningham and the villager Nabalungi (played beautifully by Nikki M. James,”The Adventures of Tom Sawyer,” “All Shook Up”), a soulful melody in which the Mormon is supposed to be baptizing his convert, but, hilariously and brilliantly, the ritual has all the trappings and emotions of a sexual encounter.\n\nOn the other hand, the warlord (played by Brian Tyree Henry), while listed in the Playbill discreetly only as “General,” is very explicitly named on stage, “General Buttfucking Naked.”\n\nIt could surely be scientifically proven that “fuck” will always get a laugh out of a Broadway audience, as long as it is not uttered in anger or as a dramatic climax. Think how much greater the titters over “Buttfucking,” repeated numerous times. This is not “The Book of Mormon” at its finest.\n\nIt also needs to be said that, while it is clear that “The Book of Mormon” is taking aim at all organized religion, still the musical’s creators make an uncomfortable choice in singling out the Church of Jesus Christ of Latter Day Saints, a relatively new religion that is a cheap and easy target. Mormons are the object of contempt by followers of more powerful religious orders whose views Parker and Stone and Lopez would find just as repugnant and ridiculous.\n\nBut “The Book of Mormon” has enough heart (its leads are characters, not caricatures), makes pointed commentary about organized religion in such insightful and entertaining ways (while acknowledging the human need for the spiritual) and has such a clever twist at the end, that — dare I say it — it redeems itself, gloriously.\n\nThe Book of Mormon\nAt the Eugene O’Neill Theater\nBook, music and lyrics by Trey Parker, Robert Lopez and Matt Stone.\nDirected by Casey Nicholaw\nSet design by Scott Pask, costume design by Ann Roth, lighting design by Brian MacDevitt and sound design by Brian Ronan. Orchestrations are by Larry Hochman and Stephen Oremus. Music direction and vocal arrangements are by Stephen Oremus\nCast: Josh Gad as Elder Cunningham, Andrew Rannells as Elder Price, Nikki M. James as Nabalungi, Rory O’Malley as Elder McKinley and Michael Potts as Mafala Hatimbi, with Lewis Cleale, Scott Barnhardt, Justin Bohon, Darlesia Cearcy, Kevin Duda, Asmeret Ghebremichael, Brian Tyree Henry, Clark Johnsen, John Eric Parker, Benjamin Schrader, Michael James Scott, Brian Sears, Jason Michael Snow, Lawrence Stallings, Rema Webb, Maia Nkenge Wilson and Tommar Wilson. The production will also feature Graham Bowen, Ta’Rea Campbell, Jared Gertner, Tyson Jennette and Nick Spangler.\nRunning time: 2 hours and 30 minutes, including one 15 minute intermission\n\nBluesky\nMost Popular PostsBroadway and the Blizzard 2026: Questions and AnswersData ReviewMasquerade Review: An Immersive Phantom even for non-PhansAll Out Comedy About Ambition Broadway ReviewTwo Strangers (Carry A Cake Across New York) Broadway ReviewStereophonic ReviewBug Broadway ReviewImmersive Theater Pioneer En Garde Arts Re-EmergesThe Lost Boys Broadway musical: First LookBroadway Rush and Lottery Policies\t\t\n\t\t\n\t\t\n\t\t\n\t\tRecent Posts\n\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tBroadway at the Oscars, in the Snow, at BroadwayCon.  Sir Ian on the Edge. #Stageworthy News\n\t\t\t\t\t\t\t\t\t\t\tJanuary 26, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tWatch Telly Leung, Ali Ewoldt, Shoba Nayaran et al perform at &#8220;This is What It Sounds Like: An AANHPI Concert of Joy&#8221;\n\t\t\t\t\t\t\t\t\t\t\tJanuary 26, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tData Review\n\t\t\t\t\t\t\t\t\t\t\tJanuary 25, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tBroadway and the Blizzard 2026: Questions and Answers\n\t\t\t\t\t\t\t\t\t\t\tJanuary 24, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tThe Lost Boys Broadway musical: First Look\n\t\t\t\t\t\t\t\t\t\t\tJanuary 24, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tEdward Review. 27 Objects That Tell A Life\n\t\t\t\t\t\t\t\t\t\t\tJanuary 23, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tOscar Nominations 2026\n\t\t\t\t\t\t\t\t\t\t\tJanuary 22, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tAn Ark Review: MR Ian McKellen and &#8220;you&#8221;\n\t\t\t\t\t\t\t\t\t\t\tJanuary 21, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tBroadway Week. Fascist Year. #Stageworthy News\n\t\t\t\t\t\t\t\t\t\t\tJanuary 20, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tMartin Luther King Jr&#8217;s Final Speech: &#8220;I&#8217;m so happy I didn&#8217;t sneeze&#8221;\n\t\t\t\t\t\t\t\t\t\t\tJanuary 19, 2026\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\n\t\tNew York Theater Archives\t\tNew York Theater Archives\n\t\t\n\t\t\t\n\t\t\tSelect Month\n\t\t\t\t January 2026  (28)\n\t December 2025  (34)\n\t November 2025  (32)\n\t October 2025  (32)\n\t September 2025  (32)\n\t August 2025  (37)\n\t July 2025  (35)\n\t June 2025  (32)\n\t May 2025  (39)\n\t April 2025  (35)\n\t March 2025  (29)\n\t February 2025  (24)\n\t January 2025  (34)\n\t December 2024  (36)\n\t November 2024  (32)\n\t October 2024  (32)\n\t September 2024  (31)\n\t August 2024  (23)\n\t July 2024  (33)\n\t June 2024  (34)\n\t May 2024  (39)\n\t April 2024  (38)\n\t March 2024  (36)\n\t February 2024  (32)\n\t January 2024  (33)\n\t December 2023  (36)\n\t November 2023  (38)\n\t October 2023  (27)\n\t September 2023  (26)\n\t August 2023  (24)\n\t July 2023  (13)\n\t June 2023  (34)\n\t May 2023  (37)\n\t April 2023  (31)\n\t March 2023  (25)\n\t February 2023  (30)\n\t January 2023  (33)\n\t December 2022  (32)\n\t November 2022  (33)\n\t October 2022  (30)\n\t September 2022  (27)\n\t August 2022  (28)\n\t July 2022  (21)\n\t June 2022  (23)\n\t May 2022  (37)\n\t April 2022  (31)\n\t March 2022  (25)\n\t February 2022  (25)\n\t January 2022  (24)\n\t December 2021  (29)\n\t November 2021  (31)\n\t October 2021  (27)\n\t September 2021  (28)\n\t August 2021  (27)\n\t July 2021  (28)\n\t June 2021  (32)\n\t May 2021  (37)\n\t April 2021  (36)\n\t March 2021  (40)\n\t February 2021  (34)\n\t January 2021  (43)\n\t December 2020  (39)\n\t November 2020  (41)\n\t October 2020  (40)\n\t September 2020  (33)\n\t August 2020  (35)\n\t July 2020  (38)\n\t June 2020  (39)\n\t May 2020  (51)\n\t April 2020  (48)\n\t March 2020  (38)\n\t February 2020  (29)\n\t January 2020  (36)\n\t December 2019  (38)\n\t November 2019  (35)\n\t October 2019  (29)\n\t September 2019  (35)\n\t August 2019  (32)\n\t July 2019  (32)\n\t June 2019  (37)\n\t May 2019  (38)\n\t April 2019  (35)\n\t March 2019  (34)\n\t February 2019  (28)\n\t January 2019  (35)\n\t December 2018  (41)\n\t November 2018  (34)\n\t October 2018  (33)\n\t September 2018  (28)\n\t August 2018  (26)\n\t July 2018  (36)\n\t June 2018  (27)\n\t May 2018  (34)\n\t April 2018  (33)\n\t March 2018  (29)\n\t February 2018  (25)\n\t January 2018  (34)\n\t December 2017  (40)\n\t November 2017  (26)\n\t October 2017  (22)\n\t September 2017  (31)\n\t August 2017  (24)\n\t July 2017  (33)\n\t June 2017  (29)\n\t May 2017  (33)\n\t April 2017  (33)\n\t March 2017  (31)\n\t February 2017  (28)\n\t January 2017  (30)\n\t December 2016  (35)\n\t November 2016  (31)\n\t October 2016  (24)\n\t September 2016  (30)\n\t August 2016  (37)\n\t July 2016  (27)\n\t June 2016  (31)\n\t May 2016  (33)\n\t April 2016  (27)\n\t March 2016  (31)\n\t February 2016  (28)\n\t January 2016  (35)\n\t December 2015  (35)\n\t November 2015  (30)\n\t October 2015  (28)\n\t September 2015  (29)\n\t August 2015  (27)\n\t July 2015  (26)\n\t June 2015  (26)\n\t May 2015  (39)\n\t April 2015  (35)\n\t March 2015  (25)\n\t February 2015  (23)\n\t January 2015  (32)\n\t December 2014  (33)\n\t November 2014  (26)\n\t October 2014  (32)\n\t September 2014  (30)\n\t August 2014  (32)\n\t July 2014  (27)\n\t June 2014  (20)\n\t May 2014  (22)\n\t April 2014  (27)\n\t March 2014  (36)\n\t February 2014  (22)\n\t January 2014  (30)\n\t December 2013  (29)\n\t November 2013  (33)\n\t October 2013  (28)\n\t September 2013  (26)\n\t August 2013  (39)\n\t July 2013  (34)\n\t June 2013  (27)\n\t May 2013  (38)\n\t April 2013  (45)\n\t March 2013  (29)\n\t February 2013  (39)\n\t January 2013  (27)\n\t December 2012  (29)\n\t November 2012  (31)\n\t October 2012  (26)\n\t September 2012  (9)\n\t August 2012  (19)\n\t July 2012  (27)\n\t June 2012  (20)\n\t May 2012  (9)\n\t April 2012  (1)\n\t March 2012  (1)\n\t December 2011  (1)\n\t November 2011  (1)\n\t April 2011  (3)\n\t March 2011  (1)\n\t December 2010  (1)\n\t November 2010  (1)\n\t September 2010  (1)\n\t May 2010  (2)\n\t April 2010  (1)\n\t March 2010  (1)\n\t January 2010  (2)\n\n\t\t\n\n\t\t\t\nCategoriesCategories\n\tSelect Category\n\tAccommodating illness\n\tACTA\n\tActing\n\tactivism\n\tageism\n\talbum\n\tAlphabet Series\n\tanniversary\n\tAntisemitism\n\tArtificial Intelligence\n\tartists responsibility\n\tartists responsibility\n\tarts and education\n\tarts funding\n\tarts issues\n\tASL\n\tAudience\n\tAudio Theater\n\tAwards\n\tBest\n\tbody issues\n\tbook\n\tBritish\n\tBroadway\n\tBrooklyn\n\tcabaret\n\tCalendar of openings\n\tcelebration\n\tcensorship\n\tcharity\n\tchildren\n\tclimate change\n\tcomedy\n\tcomposer\n\tconcert\n\tcostume design\n\tCrisis News\n\tcultural sensitivity\n\tCurrent monthly calendar of openings\n\tDance\n\tDC Theatre Scene\n\tDemocracy\n\tdesign\n\tdialogue\n\tDigital Theater\n\tDinner theater\n\tDirector\n\tdisability in the theater\n\tDiscounts\n\tDiversity\n\tdrama criticism\n\tEdinburgh\n\temergency assistance\n\tenvironment\n\tEssay\n\tfamily\n\tfashion\n\tfeminist\n\tforeign artists\n\tgay\n\tgender\n\tGiveaway Contest\n\thistory\n\tHowlround\n\thumor\n\tImmersive theater\n\tImmigrants and immigration\n\tincome inequality\n\tinjuries\n\tInterview\n\tlabor\n\tLatest Calendar of Openings\n\tleaving at intermission\n\tLGBTQ\n\tLin-Manuel Miranda\n\tList\n\tlyrics\n\tMoment on stage\n\tmovies\n\tMuseum\n\tmusical\n\tNetathon\n\tNew Jersey\n\tNew York City\n\tNew York Theater\n\tNew York Theater Poll\n\tNew York Theater Weekly Summary\n\tNightlife\n\tObituary\n\tOff-Broadway\n\tOff-Off Broadway\n\topera\n\tOut of town\n\toutdoor theater\n\tperformance art\n\tPerformer\n\tPhotographs\n\tPlaywrights\n\tpoetry\n\tpolitics\n\tPolitics and the Arts\n\tpoll\n\tposter\n\tPreview\n\tPreview Guide\n\tProducing\n\tpuppetry\n\tQuizzes\n\trace\n\tracism\n\trap\n\trecording\n\treligion and theater\n\treopening\n\tResurrected review\n\trevival\n\tscript\n\tset design\n\tsexual harassment\n\tShakespeare\n\tshopping\n\tSite Specific\n\tSondheim\n\tsong\n\tspat\n\tspeech\n\tSponsored content\n\tsubscriptions\n\tTDF Stages\n\tTechnology\n\tThe Stage\n\tTheater about theater\n\ttheater and healing\n\tTheater and Social Media\n\tTheater architecture\n\tTheater Awards\n\tTheater Blog Roundup\n\tTheater community reaching out\n\tTheater etiquette\n\tTheater Festival\n\tTheater Lore\n\tTheater on Film\n\tTheater on TV\n\tTheater Online\n\tTheater Reviews\n\tTheater ritual\n\tTheater Tech\n\tTicket giveaway contest\n\tTickets\n\tTrends\n\tTweeting\n\tTwitter\n\tUncategorized\n\tvideo\n\tviolence on stage\n\tvisual art\n\twomen in the arts\n\tyouth\n\n\nLong-running Broadway Shows\n\t\nAladdin\nBook of Mormon, The\nChicago\nHadestown\nHamilton\nHarry Potter and the Cursed Child\nLion King, The\nMoulin Rouge\nWicked\n\n\t\n\nTheater blogroll\n\t\n2 a.m. theatre (inactive)\nAbout Last Night, Terry Teachout (inactive)\nAdam Szymkowicz Playwright Interviews\nAmerican Theatre Magazine\nAnother Eye Opens\nArts Journal Theater\nBad Boy of Musical Theater\nBitter Gertrude (Inactive)\nBroadway Abridged, Gil Varod (inactive)\nBroadway and Me, Jan Simpson\nBroadway Journal\nCall Me Adam\nDrama Book Shop Podcast\nEverything I Know I Learned from Musicals, Chris Caggiano (inactive)\nFeminist Spectator\nFrom The Rear Mezzanine, Oscar Moore\nGeorge Hunka\nHoward Sherman\nHowlround\nJK&#039;s Theatre Scene\nKen Davenport blog\nLibrary of Congress blog\nLincoln Center Theater blog\nOn Stage\nPataphysicalSci, Linda Buchwald\nStagezine, Scott Harrah\nThe David Desk 2\nThe Wicked Stage. Rob Weiner-Kendt\nTheatre Aficionado at Large, Kevin Daly\nTheatre Clique\nTheatre&#039;s Leiter Side\n\n\t\n\n\t\t\t© Jonathan Mandell and NewYorkTheater.me, Unauthorized use and/or duplication of this material without express and written permission from this site’s author  is strictly prohibited. Excerpts and links to the content may be used\n\nBluesky\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n  Copyright &copy; 2026 New York Theater",
  "isFullReview": true,
  "dtliExcerpt": "CRITIC'S PICK\n\"On my fourth visit on a recent night, the show still had me at “Hello,”...I had anticipated a certain falling off of religious fervor: three years is a long time for a peppy musical to stay peppy. But gosh darn it if I didn’t feel born again all over again, ready to spread the word about the faith that this show preaches and, more importantly practices: the holy faith of musical comedy.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": 84,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 357,
  "archivePath": "data/archives/reviews/book-of-mormon-2011/articles-philly-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T01:40:28.644Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20151018122035",
  "archiveOrgUrl": "http://web.archive.org/web/20151018122035/http://articles.philly.com/2011-03-24/news/29181934_1_mormonism-andrew-rannells-show-ends",
  "llmScore": {
    "score": 84,
    "confidence": "high",
    "range": {
      "low": 77.5,
      "high": 90.5
    },
    "bucket": "Positive",
    "thumb": "Up",
    "components": {
      "book": 83,
      "music": 83,
      "performances": 89,
      "direction": 84
    },
    "keyPhrases": [
      {
        "quote": "it redeems itself, gloriously",
        "sentiment": "positive",
        "strength": 5
      },
      {
        "quote": "a happy musical, the kind of traditional sweet and sassy Broadway entertainment that offers a generous and strategic mix of gorgeous sets, razzmatazz dance numbers, catchy tunes, a clever story, and well-timed hilarity",
        "sentiment": "positive",
        "strength": 4
      },
      {
        "quote": "The Book of Mormon has enough heart (its leads are characters, not caricatures), makes pointed commentary about organized religion in such insightful and entertaining ways",
        "sentiment": "positive",
        "strength": 4
      }
    ],
    "reasoning": "Claude: Despite acknowledging controversial content and some criticisms about targeting Mormons specifically, the reviewer ultimately praises the show's entertainment value, performances, and redemptive qualities, concluding it 'redeems itself, gloriously.' | GPT-4o-mini: The review expresses strong praise for the musical's entertainment value and performances while acknowledging some discomfort with its subject matter, leading to a solid positive recommendation.",
    "flags": {
      "hasExplicitRecommendation": true,
      "focusedOnPerformances": true,
      "comparesToPrevious": false,
      "mixedSignals": false
    }
  },
  "llmMetadata": {
    "model": "ensemble:claude-sonnet-4-20250514+gpt-4o-mini",
    "scoredAt": "2026-01-28T23:34:30.212Z",
    "promptVersion": "3.0.0",
    "inputTokens": 0,
    "outputTokens": 0
  },
  "ensembleData": {
    "claudeScore": 82,
    "openaiScore": 85,
    "scoreDelta": 3,
    "thumbsMatch": null,
    "expectedThumb": null,
    "needsReview": false,
    "needsReviewReasons": []
  },
  "sources": [
    "show-score-playwright"
  ],
  "showScoreExcerpt": "CRITIC'S PICK\n\"On my fourth visit on a recent night, the show still had me at “Hello,”...I had anticipated a certain falling off of religious fervor: three years is a long time for a peppy musical to stay peppy. But gosh darn it if I didn’t feel born again all over again, ready to spread the word about the faith that this show preaches and, more importantly practices: the holy faith of musical comedy.\"\n\nRead more",
  "rescoreReason": "scored on brief excerpt, now has fullText",
  "previousLlmScore": 89,
  "rescoreCompletedAt": "2026-01-28T23:34:30.212Z"
}
