{
  "showId": "book-of-mormon-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "David Rooney",
  "url": "https://variety.com/2011/legit/reviews/the-book-of-mormon-1117944539/",
  "publishDate": "March 24, 2011",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "This raucously funny musical about a pair of mismatched Mormon missionaries is the most joyously acidic Broadway musical in years, a religious satire that's both ruthlessly irreverent and unexpectedly sweet.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This raucously funny musical about a pair of mismatched Mormon missionaries is the most joyously acidic Broadway musical in years, a religious satire that's both ruthlessly irreverent and unexpectedly sweet.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 480,
  "archivePath": "data/archives/reviews/book-of-mormon-2011/variety--david-rooney_2026-02-04.html",
  "textFetchedAt": "2026-02-04T15:01:34.713Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Jonathan Winters deserves better than this supposedly droll mockumentary.\n\nCelebrities immersed in art don’t want to talk about anything else, as amply demonstrated by Steve Martin’s recent, much-reported public debacle in New York. But people who come to see comedians don’t want to hear them talk about art. Such is the dilemma confronting Jim Pasternak in making a film about Jonathan Winters, and his unfortunate solution in “Certifiably Jonathan” is to slap together a supposedly droll mockumentary about Winters’ paintings and drag in every gagmeister from Jim Carrey to Sarah Silverman to lend it currency. Winters deserves better.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n CBS News Pulls Peter Attia '60 Minutes' Segment Due to Epstein Controversy \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n CBS News Contributor Peter Attia Under Fire After Latest Epstein File Disclosures\n\nThe pic, which opens today after three years on the shelf, does provide a forum, however flawed, for an immense talent. Perhaps it should be taken as a cockeyed homage to that ungovernable talent that the film often feels like a documentary about its maker’s inability to control his material. Pasternak, whose appearances in “Certifiably Jonathan” clock in second only to Winters’, either lets his subject run wild (as Winters was ever wont to do) in inexpertly edited spurts or constrains him with an idiotically whimsical plot concerning a show at Gotham’s Museum of Modern Art and the theft of his sense of humor.\n\nThe celebrities roped into the story (the Arquettes for a family seance, Howie Mandel for a shopping-cart ride through Target) can do little more than testify to their respect and amity toward Winters by showing up here. Those standups who have inherited the most from Winters’ stream-of-unconsciousness legacy, like Carrey and Silverman, are given less to do. Even Robin Williams, a direct disciple before and after they embodied the counterintuitive father-and-son duo on “Mork and Mindy,” seems content to mildly improvise shtick around Winters’ art, their comfortable rapport substituting for any more substantially worked-out comedy.\n\nPasternak at times lets his film skate on the knife-edge of Winters’ borderline sanity, particularly when Winters, off his meds, free-falls through his imagination, the film hovering interestingly between fact and fiction. But these moments, like the too-infrequent kinescope clips, feel like fragments of roads not taken.\n\nApparently the film began as a straightforward documentary (or as linear as a docu on the bipolar wild man could be). But though Winters lets drop stray autobiographical tidbits in the course of his runaway monologues, he seems resistant to any form of structured narration, and Pasternak fails to impose his own order on Winters’ genius.\n\nCuriously, Pasternak does better by the artwork Winters has created, variously likened to that of Magritte, Miro and Dali, presenting various key pieces solo and head-on, sometimes even animating the figures within the frame. And the clean lines of Winters’ flat compositions lend themselves surprisingly well to M. Frank Emanuel’s wry, minimalist cartooning style."
}