{
  "showId": "blackbird-2016",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "http://www.ew.com/article/2016/03/04/blackbird-broadway-review",
  "playbillVerdictUrl": "http://www.ew.com/article/2016/03/04/blackbird-broadway-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "In the fluorescent-light-stricken confines of a drab office break room, a man in his mid-50s (Jeff Daniels) is poked and prodded and made to feel awful by a woman half his age, named Una (Michelle Williams), who has arrived unexpectedly at his workplace. We never find out what his job is there, though she sneers that he might be the janitor because of his compulsion to pick up trash. We do figure out early on, however, that his name is Ray, but he now goes by Peter. And faced with Una in the room, ready to sloppily clash and duel over an incident from 15 years in the past, Ray looks as pathetic as a big sad bear with its foot trapped in a cage. But Ray’s gloomy face is only half of the story. Or perhaps a tenth of it. Blackbird , which unfolds onstage in 80 minutes of real time, peels away at the true nature of Ray and Una’s backstory. Scottish playwright David Harrower was inspired to write the play by reading the case of Toby Studebaker, a 32-year-old Marine who engaged in a sexual liaison with a 12-year-old girl in 2003. In other words, rape — though that word is never mentioned in Blackbird. Harrower doesn’t absolve the perpetrator. In fact, the play includes graphic, cringe-inducing descriptions of Ray and Una’s sexual escapades. But his interest in exploring the facets of such an inappropriate coupling is to comment on the ways in which our experiences of love are so intertwined with suffering. And how guilt and innocence, repulsion and desire, can oftentimes come tied in the most miserable of human knots. The play itself, however, for all its explicitness of language, is somewhat unadventurous in scope. The material is self-evidently dark but the presentation is unrelentingly glum and lifeless. (The underrated Ellen Page/Patrick Wilson film Hard Candy, with its single setting and near-identical subject matter, is as psychotically-intriguing as Blackbird — and more daring.) During a lengthy monologue that Una delivers around the halfway point, the hideous fluorescent lights of Scott Pask’s set dim for effect. It’s a creepily effective technique, bathing her in warmth at the exact moment as she’s telling of their sexual rendezvous, but it’s a trick that the material needed more of to genuinely pop. WANT MORE EW? Subscribe now to keep up with the latest in movies, television and music. Director Joe Mantello also helmed the off-Broadway version of Blackbird nearly a decade ago, in which Daniels starred with his future Newsroom colleague Alison Pill, but the play feels too severe and clandestine for such a big house: the Belasco Theater, where the show will play until June 11, has a seating capacity of more than 1,000. But the reason why audiences are drawn to the drama is because of the two plumb roles that offer a pair of performers the ultimate emotional tussle. (In addition to all the places it has been performed around the world, there’s also a movie version coming later this year with Ben Mendelsohn and Rooney Mara.) Williams and Daniels are more than up to the challenge of going down the play’s very dark road. One of Harrower’s nastiest, most effective conceits is that his text keeps requiring the audience to visualize Ray and Una 15 years earlier, when he was 40 and she was 12. And it just so happens that Daniels and Williams have both been working long enough as actors that we can picture what they would have looked like together. That my mind even went there is a testament to the play’s dangerous pull. B",
  "isFullReview": true,
  "textWordCount": 603,
  "archivePath": "data/archives/reviews/blackbird-2016/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:47:29.249Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 603,
  "tierReason": "Full review text"
}