{
  "showId": "blackbird-2016",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2016/03/11/theater/review-blackbird-the-past-returns-taunting.html",
  "publishDate": "March 10, 2016",
  "fullText": "https://www.nytimes.com/2016/03/11/theater/review-blackbird-the-past-returns-taunting.htmlShare full article45Advertisement\n\nThey make an alarming entrance, these two, setting off instant worry and wonder. They walk as if welded together, though whether in support, restraint or combat is unclear. Her eyes are wild and her bare legs wobbly, and he leads their stuttering steps with an angry, obdurate chin.\n\nIf you saw them in real life, you’d consider calling the police. As it is, your first impressions of Ray and Una — so intensely embodied by Jeff Daniels and Michelle Williams in the Broadway production of David Harrower’s “Blackbird” — would seem to guarantee a satisfyingly fraught night at the theater.\n\nWhat follows is definitely fraught, with the sort of acting that triggers seismometers. The satisfaction factor is somewhat lower.\n\n“Blackbird,” which took the Olivier Award in London for best new play in 2007, is an immensely powerful work that only occasionally maximizes its potential in the fitful production that opened on Thursday night at the Belasco Theater. When I saw it nine years ago at the Manhattan Theater Club, it left me shaking.\n\nSo I was steeled to have the breath knocked out of me once more. After all, this latest incarnation of Mr. Harrower’s disturbed and disturbing drama of criminal love shares many elements with that earlier version. It has the same accomplished director (Joe Mantello) and set designer (Scott Pask). Most important, it has the same leading man, Jeff Daniels, who in 2007 delivered what felt like the performance of his career.\n\nMr. Daniels is still first-rate as Ray. And Ms. Williams, in the role previously played by Alison Pill, is certainly committed to the part of Ray’s former lover, whom he seduced 15 years before “Blackbird” begins, when she was 12 and he was in his 40s. But it often registers as the kind of commitment you associate with institutionalization in mental wards.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Ms. Williams and Mr. Daniels achieve something like a perfect balance of awkwardness and intensity, of mutual attraction and revulsion.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Ms. Williams and Mr. Daniels achieve something like a perfect balance of awkwardness and intensity, of mutual attraction and revulsion.",
  "contentTier": "complete",
  "contentTierReason": "Short text (20 words)",
  "rejectedAt": "2026-02-03T14:47:55.639Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or quote, not a complete review that can be properly evaluated for a recommendation.; openai: The text provided is a single sentence without enough context or evaluative content to determine a recommendation or score.",
  "promptVersion": "5.2.0",
  "previousUrl": "https://www.nytimes.com/2016/03/11/theater/review-in-blackbird-michelle-williams-and-jeff-daniels-as-ex-lovers-who-shouldnt-be.html",
  "urlDiscoveredAt": "2026-02-03T16:20:36.982Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 333,
  "archivePath": "data/archives/reviews/blackbird-2016/nytimes--ben-brantley_2026-02-03.html",
  "textFetchedAt": "2026-02-03T16:20:36.985Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250714112616",
  "archiveOrgUrl": "http://web.archive.org/web/20250714112616/https://www.nytimes.com/2016/03/11/theater/review-blackbird-the-past-returns-taunting.html",
  "wordCount": 333,
  "tierReason": "Full review text"
}