{
  "showId": "blackbird-2016",
  "outletId": "timeout",
  "outlet": "Time Out",
  "criticName": "Unknown",
  "url": "http://www.timeout.com/newyork/theater/blackbird",
  "playbillVerdictUrl": "http://www.timeout.com/newyork/theater/blackbird",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Blackbird: Theater review by David CoteShock ought to have a shelf life, the way horror movies lose their power after repeat viewings. But if The Shining still makes you jump, it's digging deeper than your ordinary slasher flick. Likewise, I'm quite familiar with David Harrower's hellishly compelling 2005 play Blackbird. I reviewed it Off Broadway at Manhattan Theatre Club and later logged hours with the script, writing an essay for the Best Plays Theater Yearbook series. Yet years later, there I was at the Belasco, craning forward, then recoiling, as Jeff Daniels and Michelle Williams clawed at each other's psyche and body, playing ex-lovers or, to be precise, a pedophile and his victim: She was 12 and he was 40. Blackbird is a comfortless 80-minute reckoning of arrested time and soiled innocence.The stomach-churning past shared by Ray (Daniels) and Una (Williams) comes out early, so I'm not spoiling much. Nor will it ruin your experience to learn the play ends (hair-raisingly) with more questions posed than answered. Plot and morals are beside the point; the slow drip of memory like acid on the present is what Harrower is after.Joe Mantello reimagines his exactingly sharp 2007 staging on designer Scott Pask's corporate break room, a soul-sucking limbo of frosted windows, puke-gray carpeting and a trash can overflowing with garbage. Low-drone sound effects by Fitz Patton and queasy fluorescents by Brian MacDevitt add to the personality-bleached, clinical vibe. The action unfolds in real time as Una, now 27, confronts Ray at his workplace 15 years after the court case. He served his sentence; she grew up. But the affair is not over.Vocally, Williams is doing something interesting. She speaks in a halting, affected manner, as if Una has been rehearsing these speeches in her head for years, a girl trying to sound like an adult. In terms of look, Una allures—short, wispy skirt and model-thin legs—but also repels; she sexualizes herself so crudely, so grotesquely. As when he played Ray nine years ago, Daniels brilliantly rages, bargains, stonewalls and implodes, as a man who believes he might have found the love of his life—in the body of a prepubescent. Time has been shattered for these walking ghosts, and we are transfixed watching them cut their hands, sifting through the shards.—David CoteBelasco Theatre (Broadway). By David Harrower. Directed by Joe Mantello. With Jeff Daniels, Michelle Williams. Running time: 1hr 20mins. No intermission.",
  "isFullReview": true,
  "textWordCount": 399,
  "archivePath": "data/archives/reviews/blackbird-2016/timeout--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:52:32.214Z",
  "originalScore": "4/5",
  "originalScoreNormalized": 80,
  "scoreSource": "text-pattern",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20160331091306",
  "archiveOrgUrl": "http://web.archive.org/web/20160331091306/http://www.timeout.com:80/newyork/theater/blackbird",
  "contentTier": "complete",
  "wordCount": 399,
  "tierReason": "Full review text"
}