{
  "showId": "the-music-man-2022",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "Angie Han",
  "url": "https://www.hollywoodreporter.com/lifestyle/arts/hugh-jackman-and-sutton-foster-in-the-music-man-theater-review-1235091456/",
  "publishDate": "February 11, 2022",
  "fullText": "For many theatergoers, this review will merely seem superfluous after the above headline. Two of Broadway’s most beloved stars appearing in a great American musical comedy to relieve us of our COVID doldrums. The revival of The Music Man was planned long before the pandemic, but its years-delayed arrival only serves to make it seem more essential for a badly battered Broadway sorely in need of spirit-lifting. The production seems not so much a theatrical enterprise as a public service, if you redefine public service to mean having to pay hundreds of dollars for a seat.\n\nIs it worth it? Apparently so, for the many people who have happily contributed to an advance sale of — if you can believe Vanity Fair — some $50 million.\n\nRelated Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Lifestyle\n \n \n \n \n\n \n \n \n \n Scott Rudin to Produce New Wallace Shawn Play Starring John Early, Maria Dizzia \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Movies\n \n \n \n \n\n \n \n \n \n Hugh Jackman, Kate Hudson Start a Neil Diamond Tribute Band in 'Song Sung Blue' Trailer\n\nIn a way, the most creative element of this revival originally produced by Scott Rudin (who had to withdraw after he essentially got canceled) is the deal that made it happen. Recreating the formula of his mega-successful revival of Hello, Dolly! starring Bette Midler, Rudin cannily cast the supremely bankable Hugh Jackman in a role seemingly tailor-made for him: the endearing con man Harold Hill, who manages to win over an entire Iowa town through sheer force of will and charisma. Add the adorable, multi-talented Sutton Foster as prim librarian Marian to the mix, and...ka-ching!\n\nNot that the production ever seems to coast on its pedigree. Reuniting after Dolly are director Jerry Zaks, choreographer Warren Carlyle and scenic and costume designer Santo Loquasto, who have done their damnedest to recreate vintage Broadway style. The show features a huge ensemble, who break into elaborate production numbers with the regularity of buses leaving Port Authority. And though the sets, featuring a large red wood wall and many painted backdrops, aren’t particularly lavish, they perfectly evoke the spirit of the summer stock theaters in which many people were probably exposed to The Music Man in the first place.\n\nUnlike, say, the daringly iconoclastic revival of Oklahoma! that played Broadway a few years back, this production of Meredith Willson’s classic musical proudly revels in its old-fashionedness. Why mess with something that isn’t broken, it seems to be asking, especially since we’ve got our stars as our ace in the hole. From his first surprise entrance (at least to those who have never seen the musical before) to his showstopping numbers “Ya Got Trouble” and “Seventy-Six Trombones” to his climactic moment, when he stares directly at the audience with a smile that seems to contain more gleaming teeth than there are stars in heaven, Jackman has the audience in the palm of his hand. And when Sutton finally gets to shed her character’s decorousness and let loose her tremendous dancing chops, there’s definitely no more trouble in River City.\n\nBy technical standards, Jackman is neither a great singer nor a particularly accomplished dancer. But he manages to overcome those minor inconveniences through sheer force of will and clearly evident hard work. Unlike Robert Preston, who originated the role in the 1957 Broadway production and triumphantly recreated it in the 1962 film version, he never seems very larcenous. He’s so damn charming and handsome that Marian’s falling for him seems predestined. If his Harold Hill made his sales pitch directly to the audience, half of us would undoubtedly pony up for musical instruments as well.\n\nFoster’s name is listed below the title in the program but in letters just as large as Jackman’s, and she deserves the font. Her voice doesn’t have the crystalline beauty of such predecessors as Barbara Cook and Shirley Jones, and many of the songs aren’t really suited for her. But what does it matter, when she can make an audience love her with merely a winsome smile? She also displays a fierce comic edge that makes her a perfect foil for her co-star. When her Marian finally succumbs to Hill’s charms, it seems less like he seduced her than the other way around.\n\nThe production features a bounty of riches in the cast, with many of the supporting players seeming almost too qualified for their roles. There are no less than four Tony Award winners among them, including Jefferson Mays and Jayne Houdyshell as the suspicious mayor and his wife, Shuler Hensley as Hill’s accomplice and Marie Mullen as Marian’s mother. The pleasure each of them seems to be taking in doing their broad comic shtick proves infectious. Tyke actor Benjamin Pajak is delightful as Marian’s socially withdrawn little brother, as are the large number of other children in the cast, who sing and dance as if they’ve been treading the boards for decades.\n\nSpeaking of dance, there’s so much of it in the show that it might as well be retitled The Dance Man. Many of the songs have been expanded with extended dance sequences that threaten to turn the evening into the theatrical equivalent of cotton candy. Carlyle’s choreography is in most cases more vigorous than memorable, with one notable exception being his wonderfully inventive “Marian the Librarian” number that makes marvelous use of prop books. During the curtain call, Jackman and Sutton perform an energetic tap dance number — for no particular reason, other than that the audience will eat it up.\n\nNot that there’s anything wrong with that. There’s nothing revelatory about this Music Man, and that’s probably just as well. In its determined effort to evoke the musical comedy Broadway of yore and make us feel happy simply to be in a theater again, the show ironically feels urgently timely.\n\nVenue: Winter Garden, New York City\nCast: Hugh Jackman, Sutton Foster, Shuler Hensley, Jefferson Mays, Jayne Houdyshell, Marie Mullen, Remy Auberjonois, Gino Cosculluela, Emma Crow, Benjamin Pajak, Kayla Teruel, Garrett Long, Linda Mugleston, Jessica Sheridan, Rema Webb, Phillip Boykin, Eddie Korbich, Daniel Torres, Nicholas Ward, Lance Roberts, Max Clayton\nBook-music-lyrics: Meredith Willson\nStory: Meredith Willson, Franklin, Lacey\nDirector: Jerry Zaks\nChoreographer: Warren Carlyle\nOrchestrations: Jonathan Tunick\nScenic & costume designer: Santo Loquasto\nLighting designer: Brian MacDevitt\nSound designer: Scott Lehrer\nPresented by Barry Diller, David Geffen, Kate Horton, Fictionhouse",
  "isFullReview": true,
  "dtliExcerpt": "Jackman and Foster are both magnetic performers who know how to work a crowd, and their chemistry is palpable. But the production around them feels oddly tentative, as if it's not quite sure what it wants to be.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Jackman and Foster are both magnetic performers who know how to work a crowd, and their chemistry is palpable. But the production around them feels oddly tentative, as if it's not quite sure what it wants to be.",
  "contentTier": "complete",
  "contentTierReason": "Short text (38 words)",
  "textQuality": "truncated",
  "previousUrl": "https://www.hollywoodreporter.com/lifestyle/arts/the-music-man-broadway-review-hugh-jackman-sutton-foster-1235089056/",
  "urlDiscoveredAt": "2026-02-03T19:13:01.154Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1041,
  "archivePath": "data/archives/reviews/the-music-man-2022/hollywood-reporter--angie-han_2026-02-03.html",
  "textFetchedAt": "2026-02-03T19:13:01.165Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251005021127",
  "archiveOrgUrl": "http://web.archive.org/web/20251005021127/https://www.hollywoodreporter.com/lifestyle/arts/hugh-jackman-and-sutton-foster-in-the-music-man-theater-review-1235091456/",
  "wordCount": 1041,
  "tierReason": "Full review text",
  "isMultiShowReview": true,
  "multiShowReason": "Roundup article: 2 other shows mentioned 3+ times (the audience, well)"
}
