{
  "showId": "the-music-man-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2022/02/11/the-music-man-hugh-jackman-sutton-foster-band-together-okay/",
  "publishDate": "2022-02-11T12:53:45",
  "fullText": "Meredith Willson, asked to define what musical comedy meant to him, once replied—in good humor—that it’s “nothing except good old garden variety entertainment.”\n\nIn The Music Man—for which he wrote music, lyrics, and book—he gifted the world with a musical comedy that is hardly of the “good old garden variety,” the proof being that The Music Man won the 1958 Best Musical Tony over no less than West Side Story and received five other Tonys (compared to two for the competing Bernstein/Sondheim/Robbins musical).\n\nNow, as probably the most anticipated musical of the 2022 season, comes a revival billed as Meredith Willson’s The Music Man. In the current redo, it can’t be said that this return is of the day-to-day garden variety, not as directed by Jerry Zaks and choreographed by Warren Carlyle, reunited from their recent Hello, Dolly! triumph.\n\nOn the other hand, it doesn’t quite rise to blue-ribbon garden-show winner. Putting a finger on exactly why the plucky tale of a flim-flam man awakening joy in a quiet Iowa town doesn’t ring all bells isn’t easy. To some extent, though, it has to do with Hugh Jackman billed in big letters above the title and Sutton Foster billed in equally big letters immediately below the title.\n\nJackman is back in a big, brash Broadway book musical for the first time since he was electrifying ticket buyers as Australian songwriter and cabaret whiz Peter Allen in The Boy From Oz. Here he’s iconic Harold Hill, primed to convince these River City yokels that he can turn their children into a John Philip Sousa-like band when he himself can’t play a note on a trombone, cornet, clarinet or flute. (Amazingly enough, in his early days, the classically trained Willson did play the flute with Sousa’s contingent.)\n\nPerhaps seeking to differentiate himself from previous Harold Hills—and with director Zaks’ agreement—Jackman seems to underplay the self-proclaimed music man’s foxy guile. The decision has the effect of softening Hill’s initial deviousness.\n\nThere’s no denying that Jackman throws himself into the dancing Carlyle has him do with Foster and the large chorus of dancers, featuring the athletic Gino Cosculluela. Jackman’s even learned to tap dance and merrily shows off the newly acquired skill in the breathtaking final number. Yet, it remains that his Harold Hill could use some of the fire he lit in The Boy From Oz and has repeatedly spread as Wolverine.\n\nFoster—back from London where she knocked those theatergoers for a loop with her Reno Sweeney in Anything Goes—also appears to have made a questionable choice for Marian the Librarian, the focus of Harold Hill’s increasing romantic interest.\n\nThough, as written by Willson, Marian Paroo is stand-offish and suspicious of the slick newcomer, she isn’t nasty. But Foster plays her that way. Rather than a woman past her first youth and uncertain of love prospects in the future, this Marian is an offputtingly incipient old maid. That’s until she warms up as if in front of a hearth in Carlyle’s “Shipoopi” number. (Marians in other productions were not included in the routine, but she is here to good purpose and adds to Foster’s strong and sweet singing throughout. And Sutton sure can dance.)\n\nA big Music Man plus this time around is the roster of Broadway vets on view: the always remarkable Jayne Houdyshell as imperious matron Eulalie MacKecknie Shinn, Jefferson Mays as Hill-dubious Mayor Shinn, Shuler Hensley as longtime Hill buddy Marcellus Washburn, Marie Mullen as kindly Mrs. Paroo, Remy Auberjonois as Hill rival Charlie Cowell, and Eddie Korbich as the tenor in the barbershop quartet.\n\nBenjamin Pajak gets a paragraph of praise to himself. He’s Marian’s lisping young brother Winthrop Paroo. It may be that the young man, who plays a few notes on a trumpet, is the most unselfconscious member of the cast. Evidently, it all comes natural to him. If there’s a scene-stealer on this stage, he’s it, reviving the old warning against acting with children or dogs.\n\nOn other fronts, Zaks, in his 26th Broadway assignment, does a perfectly acceptable job. There is one glaring letdown. Much is made during the script of the footbridge where River City lovers clandestine themselves. Though never there previously, Marian agrees to meet Harold for a tryst. This is a big deal, and set designer Santo Loquasto complies.\n\nOkay, there the bridge is, but when Harold and Marion arrive, they don’t step foot on it,  Marian sings the gorgeous “Till There Was You” downstage center, and the bridge remains upstage and waiting. There’s undoubtedly a reason for this predicament, but it’s not reason enough.\n\nSpeaking of Loquasto, he bases the backdrops for his sets on Grant Wood, who, like Willson, is an Iowa boy. Towards the end he replicates Wood’s “Midnight Ride of Paul Revere.” Before that Wood’s “American Gothic” is highlighted. Add to Loquasto’s contributions those of lighting designer Brian MacDevitt and the sound design of Scott Lehrer (and few working in Broadway theaters are better). That amounts to plenty to watch and listen to.\n\nWhat’s heard is, of course, Willson’s sometimes corn-fed, if not corny, script; and also his thoroughly marvelous songs. Keep this is mind: The group of musical writers who do music, lyrics, and book includes Noel Coward and Lin-Manuel Miranda. To name another may need going back to Richard Wagner. That, Mr. Willson, is saying something. Many heartfelt thanks.\n\nThe Music Man opened February 10, 2022, at the Winter Garden Theatre. Tickets and information: musicmanonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-roundup"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "There's no denying that Jackman throws himself into the dancing Carlyle has him do with Foster and the large chorus of dancers, featuring the athletic Gino Cosculluela. Jackman's even learned to tap dance and merrily shows off the newly acquired skill in the breathtaking final number. Yet, it remains that his Harold Hill could use some of the fire he lit in The Boy From Oz and has repeatedly spread as Wolverine.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundups-THE-MUSIC-MAN-Opens-On-Broadway--Updating-Live-20220210"
}
