{
  "showId": "the-music-man-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2022/02/11/the-music-man-the-wells-fargo-wagon-delivers-the-con-artist-we-need/",
  "publishDate": "2022-02-11T12:54:51",
  "fullText": "Sometimes, a con man has a heart of gold.\n\nOnce upon a time—and oh how long ago it was!—then-Gov. Andrew Cuomo went on TV every afternoon to counterprogram the White House and present the case that a New York asshole can just as easily be a force for good.\n\nNow, and more happily, Hugh Jackman is bringing Professor Harold Hill’s showmanship and Think System to Broadway, where he beguilingly fulfills a similar task by showing that a spellbinder can sometimes hoodwink his marks into the best versions of themselves, that charm and smarm can be employed to fleece but not embitter us, and that sometimes mass delusion can make us all better, happier people.\n\nThe proudly old-fashioned new production of The Music Man that opened at the Winter Garden Theatre last night is proof that trouble isn’t the only word to start with a T, capital or otherwise.\n\nTerrific comes to mind. And, curiously enough, timely.\n\nThis revival has been in the works seemingly forever. Scott Rudin’s name is no longer associated with it, but it remains very much a Rudin production: big stars, big production, big marketing. Music Man signage went up on the gargantuan Winter Garden marquee very early in the pandemic—the previous tenant, Beetlejuice, closed in the Halcyon early-March days of 2020—and its advertising has been, Rudinishly, everywhere. Did we realize two years ago just how necessary we’d find a reminder that a flimflam artist can be fun? (I suppose we did, but who remembers two years ago.) Now, post-January 6, post-“legitimate political discourse,” with a post-vaccine never-ending virus and a post-stare decisis Supreme Court, it’s lovely to be reminded of an easier time, a simpler time, a time when the grifts were merely monetary, not existential.\n\nSo let’s look back, it says, and let’s have fun.\n\nThe Music Man is about a traveling salesman and con artist who comes to a small Iowa city in 1912 to work his scam of selling musical instruments but along the way falls for the town, and especially its librarian, and in the end changes everyone for the better, himself very much included.\n\nThe charming Jackman plays the salesman, who goes by Prof. Hill, and the beloved (if somewhat underutilized) Sutton Foster is the librarian, Marion. They are aided by a supporting cast of Broadway greats nearly sufficient to staff a mansion on The Gilded Age. (When you’ve got Jefferson Mays as the consistently befuddled Mayor Shinn and Jayne Houdyshell as his hilariously preening wife, Eulalie Mackechnie Shinn, plus Shuler Hensley as Hill’s good-natured henchman, who even needs a movie-star leading man?) And arguably even better is the ensemble of teen and kid singers and dancers enlisted as the children of River City, especially the winsome Benjamin Pajak as young Winthrop and the fleet-footed Gino Cosculluela as the misunderstood ruffian Tommy Djilas, both in their Broadway debuts.\n\nThe revival is directed by Jerry Zaks and choreographed by Warren Carlyle, and it works very much in the tradition of their last smash-hit partnership, Rudin’s 2020 Hello, Dolly. It is a blockbuster staging of a blockbuster classic, this one with a let’s-put-on-a-show patina that echoes its smalltown 1912 setting. (Santo Loquasto’s homespun, painted-on-board sets would fit nicely into the River City High School Gymnasium.) Zaks is in his element, and he milks the material for all its worth; Carlyle’s high-stepped, big-smiled, occasionally acrobatic dances feel nearly pulled from MGM Technicolor.\n\nThere is even a small, simple, hilarious bit of shoestring staging leading into “Wells Fargo Wagon” that brings the house down.\n\nWatching the show, you’re reminded quickly of what a near-perfect script Meredith Willson created for his 1958 classic. It’s smoothly, efficiently crafted, and it’s both sweetly and cleverly funny. His score ranges from the soaring ballad “Till There Was You” to the brassy show-stopper “Seventy-Six Trombones,” with other, smaller immortal numbers along the way, like “Goodnight, My Someone” and “Gary, Indiana.” The are also so many goofily loveable patter songs that it’s a surprise one show can contain them all: “Iowa Stubborn,” “Marian the Librarian,” “Pick-a-Little, Talk-a-Little,” even the controversial “Shipoopi,” here rewritten for a more contemporary dating sensibility and neither noticeably better nor worse for it.\n\nBut all those wonderful novelty songs aside (and I confess a weakness for novelty songs), the reason The Music Man works so well—any Music Man, but especially this delightfully cast and staged version—is because of that heart of gold. It’s about a changing world—the iconic, trainbound opening number “Rock City” is ultimately a lament for a disappearing smalltown America, for a time when you had to know the territory—and an argument for the power of shared dreams and shared joy. Harold Hill never really teaches the kids to play music, but, by the final scene, everyone is so enthralled to the dream that they’re thrilled by their kids’ feeble attempts.\n\nIt’s a scam with a happy ending—which, granted, is perhaps as likely as a boys band that never learns to play music. But, still, we can dream, too. Especially when that dream delivers, finally, a Sutton tap-dance number in its curtain call.\n\nThe Music Man opened February 10, 2022, at the Winter Garden Theatre. Tickets and information: musicmanonbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-roundup"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "The charming Jackman plays the salesman, who goes by Prof. Hill, and the beloved (if somewhat underutilized) Sutton Foster is the librarian, Marion. They are aided by a supporting cast of Broadway greats nearly sufficient to staff a mansion on The Gilded Age. (When you've got Jefferson Mays as the consistently befuddled Mayor Shinn and Jayne Houdyshell as his hilariously preening wife, Eulalie Mackechnie Shinn, plus Shuler Hensley as Hill's good-natured henchman, who even needs a movie-star lead",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundups-THE-MUSIC-MAN-Opens-On-Broadway--Updating-Live-20220210"
}
