{
  "showId": "the-real-thing-2014",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "http://www.vulture.com/2014/10/theater-review-the-real-thing.html",
  "playbillVerdictUrl": "http://www.vulture.com/2014/10/theater-review-the-real-thing.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Joan Marcus\n \n \n \n The great vernacular revolution of the 1960s turned theatrical dialogue from a prancing pony into a workhorse. With realism ascendant, serious drama, and eventually comedy, demanded a perfect facsimile of actual speech, complete with ums and potholes and multiple midcourse corrections. A little rough poetry might be permissible, but witty banter, as it once was called, became immediately suspect under the new regime: as effete as port wine, as cheap as rickrack. So what was a witty banterer to do? Tom Stoppard’s solution, in his 1982 play The Real Thing, was to create a world in which persiflage is the mother tongue. Characters who do not merely employ but juggle words could justify his bent for epigrams. (“Public postures have the configuration of private derangement.”) And who would those characters be? Theater types, of course: playwrights and the actors to whom they feed lines.\n\nAnd so The Real Thing, now in a thoughtful revival at the Roundabout, gives us Henry, a West End playwright, like Stoppard noted (at least as of 1982) for cleverness as opposed to heart, as if the two were not on speaking terms. Henry is married to Charlotte, an actress; we first meet her as she appears in one of Henry’s plays, a droll comedy about infidelity called House of Cards. Her co-star Max, being the playwright’s stand-in, gets all the best lines, but is, when offstage and unscripted, entirely negligible. Max’s wife, Annie, also an actress, is more gligible, though. Between rehearsals of Miss Julie and, later, ’Tis Pity She’s a Whore, she’s involved in trying to free a wrongfully imprisoned young soldier by starring in his witless autobiographical play. Eventually Annie asks Henry, with whom she’s having an affair, to polish the wretched thing, which turns out to be like carrying diamonds to Newcastle.\n\nThe neat house of mirrors now established, Stoppard wastes no time setting it a-spin. Though there is little in contemporary drama that’s as much fun as his dialogue, it’s his architecture that’s truly witty. (Max’s character in House of Cards is an architect.) Scenes in the “real” world both reflect and presage scenes within the interior dramas, which are presented on the same set and are thus easily confused. Is Annie having an affair with Billy, her co-star in ’Tis Pity, or are we seeing them in their roles as the incestuous lovers in that Jacobean tragedy? In any case, the various infidelities interlink like gears, turning individually but also as a group. By the end, all of the principals are in different relationships than the ones with which they started.\n\nAs a roundelay it’s delightful, and so is much of the production. Maggie Gyllenhaal, making a sensational Broadway debut as Annie, pulls off the especially difficult trick of wrangling all the messy contradictions of her character without losing her glowy sexiness for a minute. (Originally played on Broadway by Glenn Close, the part is often given an icier spin.) Likewise Ewan McGregor, another Broadway debutant, makes a passionate case for Henry the romantic without shortchanging his devastating verbal acuity. Josh Hamilton is hilarious in drawing the distinction between Max onstage (clever) and off (vapid). And Cynthia Nixon — who played the one-scene role of Debbie, Henry and Charlotte’s daughter, in 1984 — now plays Charlotte herself. This delicious casting provides the uncanny opportunity to see how a teenager’s affected cynicism about the hypocrisies of love (nicely embodied here by Madeline Weinstein) may result, 30 years later, in an almost matronly disdain for its mess.\n\nThat the temperature of the characters is generally a few degrees warmer than in previous productions is surely the deliberate work of the director, Sam Gold, who has also made other choices to melt the ice. The house lights remain up as the play begins, blurring further the already blurry boundary between life and performance. He stages the action, on David Zinn’s shallow sliver of a set, as close to the audience as possible — a format he also used in his 2012 production of Look Back in Anger at the Roundabout’s Laura Pels Theatre. And most significantly, he has the cast singing between every scene: lovely acoustic harmonizations of pop hits (“You’ve Lost That Lovin’ Feeling,” “I’m Into Something Good”) that are pointedly referred to in the text but are traditionally heard only in their original recorded versions. You begin to look for the campfire and marshmallows.\n\nThis warmth has an odd effect, though. It’s pleasant but seems to undercut the cool brilliance of the writing. It’s as if Gold had a brief to disprove Henry’s contention that “the real thing” cannot be properly expressed in “well chosen words nicely put together”:\n\nI don’t know how to write love. I try to write it properly, and it just comes out embarrassing. It’s either childish, or it’s rude. And the rude bits are absolutely juvenile. … ‘Will you still love me when my tits are droopy?’ ‘Of course I will, darling, it’s your bum I’m mad for’ … Loving and being loved is unliterary.\n\nIn making that case, Stoppard is countering it too. But The Real Thing may not work best when a production rushes to his aid so assiduously. The less brittle characterizations and less distant tone invite a search for deeper meaning that the script is rightfully loath to cough up. It’s a tickle, not a treatise; each argument, no matter how beautifully made, is counter-argued just as beautifully. It’s like the snake that, swallowing its own tail, disappears completely. Let it disappear! Isn’t that the magic?\n\nThe Real Thing is at the American Airlines Theater through January 4.\n\nShow \n \n \n Comment\n \n\n Theater Review: The Real Thing\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 986,
  "archivePath": "data/archives/reviews/the-real-thing-2014/vulture--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:02:52.101Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 986,
  "tierReason": "Full review text",
  "bwwExcerpt": "Maggie Gyllenhaal, making a sensational Broadway debut as Annie, pulls off the especially difficult trick of wrangling all the messy contradictions of her character without losing her glowy sexiness for a minute...Likewise Ewan McGregor, another Broadway debutant, makes a passionate case for Henry the romantic without shortchanging his devastating verbal acuity...That the temperature of the characters is generally a few degrees warmer than in previous productions is surely the deliberate work of the director, Sam Gold, who has also made other choices to melt the ice...most significantly, he has the cast singing between every scene: lovely acoustic harmonizations of pop hits...This warmth has an odd effect though. It's pleasant but seems to undercut the cool brilliance of the writing.",
  "bwwScore": 8
}
