{
  "showId": "gypsy-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2024/12/19/gypsy-hold-your-hats-and-hallelujah/",
  "publishDate": "2024-12-19T23:59:49",
  "fullText": "To belt or not to belt: That is the question…and the debate currently raging among Redditors, theater message-board members, and armchair critics on the role of Rose in Gypsy.\n\nWhether they’ve even seen six-time Tony winner Audra McDonald, who’s currently giving a knockout performance as the mother of all stage mothers at the Majestic Theatre, is immaterial. They hear the foghorn voice of Ethel Merman—for whom the show was written in 1959—singing the Jule Styne–Stephen Sondheim classics “Some People” and “Everything’s Coming Up Roses”; or Broadway’s most recent Rose, Patti LuPone, and her lungs of steel powering through “Rose’s Turn.” (Or Angela Lansbury or Tyne Daly or Bernadette Peters…) The conventional wisdom is that a big, brassy score demands a big, brassy voice.\n\nOr does it? Since she’s not barreling through the tunes like a freight train, McDonald uses her phenomenal vocal range to tap into an intense reservoir of feeling. Her Rose isn’t the abominable woman we’ve seen in previous productions. Sure, she’s pushy, especially when it comes to her star-to-be daughter, June (Jordan Tyson, The Notebook’s Younger Allie), the singing-dancing-twirling headliner of the family’s home-grown vaudeville act. She’s oblivious, shockingly so, when she volunteers her mousy daughter, Louise (Joy Woods, The Notebook’s Middle Allie), for a striptease at a second-rate burlesque. She’s girlish, giggly, and demure with reluctant agent/would-be fourth husband Herbie (a flawless Danny Burstein). But ultimately, she’s more mama bear than monster. The climactic “Rose’s Turn,” where she’s at her most vulnerable, is full of highs and lows both musical and emotional; never has Merman’s comparison of the song to an aria been more apt.\n\nHelmed by George C. Wolfe (who directed McDonald in Shuffle Along, or the Making of the Musical Sensation of 1921 and All That Followed), a six-time Tony winner himself, this revival is, at its heart, the Golden Age musical we love and cherish: a thrilling overture (oh, that brass section!), performed by a 25-piece orchestra, that just might be the most exhilarating six minutes you’ll ever spend in a theater; a cast of nearly three dozen; actual sets (by Santo Loquasto), expertly worn and tattered like Depression-era vaudeville itself, and no projections thank you very much; a real-live Chowsie, played by adorably scruffy rescue dog Tana June (trained by Bill Berloni). Not every show needs—or would benefit from—a stripped-down 21st-century extreme makeover à la Jamie Lloyd’s Sunset Boulevard.\n\nGypsy completists will spot a few clever touches: first, and foremost, the color-conscious—not color-blind—casting. Rose’s family actually looks like a family. Tyson is light-skinned, and her character’s springy blonde Shirley Temple ringlets make her look even lighter. So one wonders: Did Rose favor June because of her talent, or because of her more marketable appearance? Given a real chance to shine, would Louise have taken a different path, rather than becoming the infamous ecdysiast Gypsy Rose Lee? You’ll also note that when Madame Rose takes Baby June (Marley Lianne Gomes, alternating with Jade Smith) and her vaudeville troupe on the road, it’s with a group of Black newsboys; as they age, she replaces them with white newsboys. That’s no coincidence—it’s Rose giving the act a subtle face-lift.\n\nAnother inspired update: The original Jerome Robbins dances, which appeared in every Broadway revival in some form, have been replaced with dazzling choreography by Camille A. Brown, a Tony nominee for her kinetic street scenes in last season’s Hell’s Kitchen. Her “Garden of Eden” number—the pinnacle of the second-act strip sequence—is a magnificent homage to Josephine Baker’s “Danse Sauvage,” a groundbreaking and star-making performance at the Folies Bergère in the 1920s. Hair and wig designer Mia Neal even gives Woods a perfect Baker-esque sculptural close-cropped ’do with face-framing curls. (Fun fact: Before becoming a star in her adopted hometown of Paris, Baker appeared on Broadway in the chorus of Shuffle Along.)\n\nWoods is wonderful as the shrinking-violet Louise, happily playing second banana—or Caroline the moo cow—to her sister June; casually clowning around with Rose and Herbie (their trio, “Together, Wherever We Go” is a triumph); or eagerly soaking in the hard-won wisdom dispensed by a trio of specialty strippers (Lesli Margherita, Lili Thomas, and Mylinda Hull nailing every bump, grind, and laugh in “You Gotta Get a Gimmick”). But when Louise transforms into Gypsy Rose Lee, Woods is less credible. “I’m beginning to like this!” Gypsy says mid-strip. The lack of enthusiasm is unmistakable. Perhaps it’s a performance that will deepen over time. She just needs a bit more—as the Pal Joey song goes—zip.\n\nGypsy opened Dec. 19, 2024, at the Majestic Theatre. Tickets and information: gypsybway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "Or does it? Since she’s not barreling through the tunes like a freight train, McDonald uses her phenomenal vocal range to tap into an intense reservoir of feeling. Her Rose isn’t the abominable woman we’ve seen in previous productions. Sure, she’s pushy, especially when it comes to her star-to-be daughter, June (Jordan Tyson, The Notebook’s Younger Allie), the singing-dancing-twirling headliner of the family’s home-grown vaudeville act. She’s oblivious, shockingly so, when she volunteers her mousy daughter, Louise (Joy Woods, The Notebook’s Middle Allie), for a striptease at a second-rate burlesque. She’s girlish, giggly, and demure with reluctant agent/would-be fourth husband Herbie (a flawless Danny Burstein). But ultimately, she’s more mama bear than monster. The climactic “Rose’s Turn,” where she’s at her most vulnerable, is full of highs and lows both musical and emotional; never has Merman’s comparison of the song to an aria been more apt.",
  "bwwScore": 9
}
