{
  "showId": "eclipsed-2016",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "https://www.nytimes.com/2016/03/07/theater/review-in-eclipsed-a-captive-lupita-nyongo-is-captivating.html",
  "publishDate": "March 6, 2016",
  "fullText": "The women depicted in Danai Gurira’s soul-searing “Eclipsed,” which opened on Broadway at the Golden Theater on Sunday, have lost just about everything. Their dignity, their freedom, their families, their hope. Perhaps most disturbingly, they have lost their own names, or rather tried to forget them.\n\nCaught up in the brutal violence of Liberian civil war, held captive as “wives,” really sexual slaves, of a rebel commanding officer, they prefer to refer to one another anonymously — as Number One or Number Three — as if their lives before the horror descended upon them never happened. It’s more painful to remember than to forget.\n\nFor all its harrowing power, “Eclipsed,” headlined by the Oscar winner Lupita Nyong’o, one of the most radiant young actors to be seen on Broadway in recent seasons, shines with a compassion that makes us see beyond the suffering to the indomitable humanity of its characters. And although the events it depicts happened more than a decade ago, the play resonates powerfully today, as more than one African country continues to be plagued by atrocious violence, with women often the most brutalized victims. (Let us not forget the hundreds of schoolgirls kidnapped by the radical Islamist group Boko Haram in Nigeria who remain unaccounted for to this day.)\n\nUnder the bright lights of Broadway, where escapist fare or genteel revivals most often thrive, Ms. Gurira’s play, directed with clarity and force by Liesl Tommy, reminds us of something profoundly important, and perhaps too easily forgotten amid our own country’s continuing racial troubles: African lives matter.\n\nThe play takes place in and around the squalid hut where the women are held captive in a rebel compound. It’s a bullet-riddled shanty with virtually no furnishings. Presiding over this grim ménage is the first woman kidnapped by the “C.O.,” as the women refer to their captor. She is thus designated Wife No. 1, and is played with maternal warmth and steely fortitude by Saycon Sengbloh. She was taken when she was a teenager, and has been held for more than 10 years, although she cannot be sure of her exact age.\n\nAs the play opens, she and the heavily pregnant Wife No. 3, played with remnants of rebellious adolescence by Pascale Armand, are desperately attempting to shelter a young woman referred to only as the Girl, played by Ms. Nyong’o. (She must be the first actor ever to win entrance applause after emerging from under a grimy rubber tub, where her character hides to sleep.) Fleeing fighting in her village, she stumbled into the compound. The women know that if she’s discovered, she will be victimized as they are.\n\nBut there’s nowhere much to hide, and when the Girl leaves the hut to go to the bathroom in the woods, she is found out, and immediately brought to the C.O. and raped, initiated into a life of sexual servitude. The scenes in which the (unseen) commanding officer approaches the women’s shelter, and in terror they jump to line up so he can choose among them, are almost as disturbing as the moments when they return, hollow-eyed but matter-of-fact, and wash themselves mechanically.\n\nMs. Gurira’s “Familiar,” an immensely enjoyable comedy-drama about a Zimbabwean-American family, opened Off Broadway just last week. It’s a much lighter play — almost any play onstage right now is — but while the events in “Eclipsed” are painful to contemplate, even this corrosive drama has moments of welcome levity.\n\nWife No. 3’s fretting over her wigs, her recalcitrant hair (patiently tended to by Wife No. 1) and her clothing is a funny and touching indication that, abused as she has been, she still retains a smattering of self-esteem. And to while away the time, the Girl reads passages from a battered biography of Bill Clinton that has found its way into the compound. The women eagerly follow his fortunes as if attending to local gossip, comically referring to Monica Lewinsky as Wife No. 2.\n\nWhen the second wife of the commanding officer returns to the hut, clad in snazzy jeans and slinging a rifle over her shoulder, the central drama in “Eclipsed” emerges. Played with a cool intensity by Zainab Jah, Wife No. 2 has escaped sexual servitude the only way possible, by taking up arms and fighting alongside the rebels.\n\nAlthough Wife No. 3 delights in the pile of clothing brought by the second wife, Wife No. 1 looks with contempt upon this conciliatory offering; despite her years of being brutalized, she has held on to her morality, and disapproves of the self-serving trade-off that Wife No. 2 has made. Wife No. 1 takes some solace in the occasional visits from Rita (the fine Akosua Busia), an emissary from a world away, it almost seems, who is trying to help broker a peace agreement. But peace does not arrive before Wife No. 2 has persuaded the Girl to take up arms alongside her, despite entreaties by Wife No. 1 to resist.\n\nMs. Nyong’o, simply superb, illuminates her character’s conflicted feelings with pinpoint clarity. Fearful though she is when we first meet her, the Girl still retains the glowing innocence of youth; it’s only when she has been inaugurated into a life of sexual slavery that the light in her eyes begins to falter. But the Girl proves dangerously susceptible to the seduction of the comparative freedom enjoyed by Wife No. 2, who tells her that by joining in the killing she can at least have some control over her own life. (Ms. Nyong’o is hardly recognizable as the smiling beauty disconcertingly fondling a Lancôme bottle in an advertisement on the back of the Playbill — talk about cognitive dissonance!)\n\n“Eclipsed” reaches a gut-churning climax in a monologue delivered with shellshocked confusion by Ms. Nyong’o, in which the Girl recounts being forced to participate in unimaginable atrocities. Shame, revulsion and something like disbelief mingle in her hushed recital of the brutality she was forced not just to witness but to share in. We have the sorrowful sense that she has been shaken into a terrible awareness: It is not just the suffering she endured that will haunt her forever, but the suffering she inflicted.",
  "isFullReview": true,
  "dtliExcerpt": "Ms. Nyong'o brings a fierce dignity and emotional transparency to the role of the Girl, a young woman who has been kidnapped and forced into sexual slavery by rebels during Liberia's civil war.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Ms. Nyong'o brings a fierce dignity and emotional transparency to the role of the Girl, a young woman who has been kidnapped and forced into sexual slavery by rebels during Liberia's civil war.",
  "contentTier": "complete",
  "contentTierReason": "Short text (33 words)",
  "rejectedAt": "2026-02-03T15:33:41.393Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt describing a performance, not a complete review with evaluative content or recommendation; openai: This text is a description of Lupita Nyong'o's performance in a role, but it lacks any evaluative content about the overall production or recommendation.",
  "promptVersion": "5.2.0",
  "textQuality": "full",
  "previousUrl": "https://www.nytimes.com/2016/03/07/theater/review-eclipsed-lupita-nyongo-shines-but-the-show-around-her-needs-work.html",
  "urlDiscoveredAt": "2026-02-03T23:47:28.980Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1028,
  "archivePath": "data/archives/reviews/eclipsed-2016/nytimes--charles-isherwood_2026-02-03.html",
  "textFetchedAt": "2026-02-03T23:47:28.987Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250927113939",
  "archiveOrgUrl": "http://web.archive.org/web/20250927113939/https://www.nytimes.com/2016/03/07/theater/review-in-eclipsed-a-captive-lupita-nyongo-is-captivating.html",
  "wordCount": 1028,
  "tierReason": "Full review text"
}