{
  "showId": "eclipsed-2016",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Paul Harris",
  "url": "http://variety.com/2009/legit/reviews/eclipsed-2-1200476367/",
  "publishDate": null,
  "fullText": "Playwright-actor Danai Gurira earns a reputation for hard-hitting drama.\n\nPlaywright-actor Danai Gurira is quickly earning a reputation for hard-hitting drama on relevant themes involving African women. She has followed the 2005 play “In the Continuum” (co-written and performed with Nikkole Salter), about two females living with HIV, with “Eclipsed,” an unflinching treatise on the subjugation of women in war-torn Liberia. It’s a gut-wrenching saga told with poignancy and wit, precisely the kind of niche today’s cutting-edge theater strives to fill.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Timothée Chalamet's 'Marty Supreme' to Get China Theatrical Release\n\nLife doesn’t get more miserable than the rebel army camp depicted here during the country’s civil war in 2003, where a tiny group of women captured by a rebel officer eke out a pathetic existence providing sex on demand and jumping to his every whim. Even their own names have been replaced informally by numbers, reflecting their pecking order as favored “wives.” Worse, they’re reasonably content because they’re not dead.\n\nMirroring the process by which Lynn Nottage developed “Ruined,” this gruesome scenario of life in the crossfire was gleaned firsthand by Gurira during a visit to Liberia funded by the Theater Communications Group’s New Generations program. Born in America and raised in Zimbabwe, Gurira (“The Visitor”) modeled the characters and their personal survival stories after the women she met there.\n\n“Eclipsed” is being produced almost simultaneously by three theaters this fall — D.C.’s Woolly Mammoth, L.A.’s Center Theater Group and Yale Rep. Woolly’s production opens its 30th anniversary season with the intended jolt to the senses thanks to blunt yet sensitive staging by Liesl Tommy and a remarkable cast that portrays each nuanced character with total conviction.\n\nLights come up on a dirty shack in the middle of nowhere, a stark picture of gloom created by set designer Daniel Ettinger. Its tin roof doubles as the battleground in later scenes. Two women are trying to hide a teenage girl in a plastic bathtub from the lascivious eyes of the unseen officer. They are Helena (Uzo Aduba), the harem’s domineering matriarch; Bessie (Liz Femi Wilson), a younger pregnant wife; and the unnamed girl (Ayesha Ngaujah), who, we come to learn, can read. A third wife (Jessica Frances Dukes) appears later toting an AK-47, having risen to the role of rebel warrior.\n\nReal optimism finally arrives in the form of a peace worker (a regal and sensitive Dawn Ursula), part of an organized group of brave and committed women who actually helped end the fighting in Liberia.\n\nGurira’s story of hope and despair throws the spotlight on each character and their individual reactions to their tastes of literacy and freedom. Yet the choices confronting them are not so easily decided, as the reaction by Dukes’ defiant rebel fighter starkly demonstrates. Packing a weapon and shooting to kill, she wages a personal war for respect — even though her job includes capturing young girls for the lecherous generals’ pleasure. “This is war, and you can’t think too much,” she preaches in defense of her degrading actions. Sadly, she doesn’t really know why she’s fighting.\n\nThe heavy load is lightened by a surprising amount of humor, much of it at the expense of former President Clinton and his tryst with Monica Lewinsky. The women are presented with a book on the subject and are quickly absorbed in world events, however dated they are. In addition, Gurira instills within each character a crystallized and at times complex view of her predicament, tinged with strong sentiments of survival and sisterhood.\n\nHer mature play is filled with revealing and absorbing dialogue, not all of it understandable from the heavily accented performers on Woolly’s stage. But unmistakably illuminated is the utter chaos of war in Africa and its effect on women, providing insights no media account ever could.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"An unflinching treatise on the subjugation of women in war-torn Liberia. It’s a gut-wrenching saga told with poignancy and wit, precisely the kind of niche today’s cutting-edge theater strives to fill...Her mature play is filled with revealing and absorbing dialogue. But unmistakably illuminated is the utter chaos of war in Africa and its effect on women, providing insights no media account ever could.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "sources": [
    "show-score-playwright"
  ],
  "textWordCount": 631,
  "archivePath": "data/archives/reviews/eclipsed-2016/variety--paul-harris_2026-02-06.html",
  "textFetchedAt": "2026-02-06T04:59:12.876Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 631,
  "tierReason": "Full review text"
}