{
  "showId": "driving-miss-daisy-2010",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "Frank Scheck",
  "url": "http://www.hollywoodreporter.com/review/driving-miss-daisy-theater-review-32455",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Still, despite any quibbles, it remains a pleasure to watch these two old pros at work, and Gaines, as usual, is an absolute delight, more than keeping up with his older co-stars.",
  "bwwScore": 8,
  "contentTier": "truncated",
  "fullText": "That’s clearly an opportunity not to be missed by canny producers, not when it’s such a beloved property and scene-stealing showcase for older actors — thus the new Broadway production co-starring Vanessa Redgrave and James Earl Jones, with four-time Tony winner Boyd Gaines thrown in for extra insurance. The results are box-office catnip, with the production already racking up hefty weekly grosses.\n\nThe surprising aspect of Alfred Uhry’s work is that it’s such a deceptively simple creation. Running 90 minutes and featuring three characters and a single set, it subtly depicts over many brief scenes spanning about 25 years the slowly evolving friendship between an elderly Southern Jewish white woman and the black man hired to be her chauffeur. Set during the 1950s and ’60s in Atlanta, it can be viewed as a microcosm of the Civil Rights movement that dominated the era.\n\nBut what audiences mostly respond to are the wonderfully rich characters: The proud and flinty Daisy Werthan, the endlessly polite but richly self-assured Hoke Coleburn and Daisy’s exasperated but loving son Boolie.\n\nThe play is a pretty well-indestructible audience-pleasing vehicle, and director David Esbjornson’s production, only slightly more elaborate than the bare-bones 1987 off-Broadway original, does nothing to tamper with it.\n\nThat being said, it should be pointed out the casting is somewhat problematic, especially for those with strong memories of Dana Ivey and Morgan Freeman in the original stage production and Freeman and the Oscar-winning Jessica Tandy in the film.\n\nRedgrave certainly is perfectly suited to portray Daisy’s steely self-determination and willful stubbornness, but the still physically imposing actress far less credibly conveys the fragility and vulnerability that afflict the character as the years pass, and her Southern accent has a way of coming and going.\n\nJones, too, seems a little off. His Hoke is much less initially courtly and deferential than Freeman’s, displaying a self-assured bluster from the beginning. The result is that there is less dramatic impact in pivotal scenes like when Hoke, ordered by Miss Daisy to keep driving even though he has to go to the bathroom, finally rebels and asserts his independence.\n\nStill, despite any quibbles, it remains a pleasure to watch these two old pros at work, and Gaines, as usual, is an absolute delight, more than keeping up with his older co-stars.\n\nAlready selling out for its limited engagement, this “Daisy,” with the proper recasting, could be driving on Broadway for a long time to come.\n\nVenue: Golden Theatre, New York (Through Jan. 29)\n Presented by: Jed Bernstein, Adam Zotovich, Elizabeth Ireland McCann, Roger Berlind, Beth Kloiber, Albert Nicciolino, Jon B. Platt, Stylesfour Prods., Ruth Hendel/Shawn Emamjomeh, Larry Hirschborn/Spring Sirkin, Carl Moellenberg/Wendy Federman, and Daryl Roth/Jane Bergere in association with Michael Filerman\n Cast: James Earl Jones, Vanessa Redgrave, Boyd Gaines\n Playwright: Alfred Uhry\n Director: David Esbjornson\n Scenic designer: John Lee Beatty\n Costume designer: Jane Greenwood\n Lighting designer: Peter Kaczorowski\n Projection designer: Wendall K. Harrington\n Music: Mark Bennett",
  "isFullReview": true,
  "textWordCount": 488,
  "archivePath": "data/archives/reviews/driving-miss-daisy-2010/hollywood-reporter--frank-scheck_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:45:45.114Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "wordCount": 488,
  "tierReason": "Missing proper ending or other signals"
}