{
  "showId": "driving-miss-daisy-2010",
  "outletId": "vulture",
  "outlet": "New York Magazine",
  "criticName": "Scott Brown",
  "url": "http://nymag.com/daily/entertainment/2010/10/theater_review_vanessa_redgrav.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Apart from Gaines, we're treated to two very famous voices, and very little else. John Lee Beatty's scenic design is a sepia box, a few sticks of furniture and a staircase: Video projections of historical moments through the decades fill the substantial void for anyone who might decide, mid-play, he'd rather be home, Netflix-ing the film version. And when the lights are at general-wash, the whole thing looks strangely scuffed and ugly, a cross between a half-vacated college dorm and one of the nicer basements from the Saw series. I felt like I was watching a hastily organized radio play, and half expected a station-break from the Guy's All-Star Shoe Band.",
  "bwwScore": 4,
  "contentTier": "complete",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nChances are, you won’t go to Driving Miss Daisy to see Boyd Gaines (Tony winner though he may be) play Boolie, Daisy’s dutiful, mom-pecked wisenheimer of a son. This production — the very first Broadway incarnation of Alfred Uhry’s small, gentle 1987 Off Broadway hit — exists for one reason only: Its odd-god pairing of Vanessa Redgrave, playing Daisy, a proud Jewish dowager of mid-century Atlanta, with James Earl Jones as her thick-skinned black chauffeur, Hoke, in a story so cottony-familiar, it’s practically American scripture.\n\nThanks to the 1989 Oscar-sweeper starring Jessica Tandy and Morgan Freeman, Daisy and Hoke have calcified into sainted tropes of the Great American Center, the sort of charmingly flawed, utterly ordinary, avowedly unrevolutionary people we’re always ready to laugh at and identify with simultaneously. They’re the almost-innocent victims of history we all imagine ourselves to be (regardless of age, race, and situation), and their very unremarkableness makes them titanic: Surely these are the regular folks, the decent, reasonable, nonideological folks, who — imperfect though they may be — not only suffer for this cantankerous nation’s sins, but represent its best hopes for redemption? Boolie, on the other hand, is mostly story-adhesive and accelerant. (He’s the one who hires Daisy a driver, over her protests, and thus launches 30 years of folksy racial and social dialectic, conducted mostly via rearview mirror.) He’s disposable, even a little contemptible in the script, becoming more conventional, more morally lazy, as Daisy and Hoke grow more distinctive and surprising. And yet, watching director David Esbjornson’s rickety read-through of a revival, I found Gaines’s performance to be the only indispensable one onstage — the lone breathing human up there with marmoreal deities.\n\nApart from Gaines, we’re treated to two very famous voices, and very little else. John Lee Beatty’s scenic design is a sepia box, a few sticks of furniture and a staircase: Video projections of historical moments through the decades fill the substantial void for anyone who might decide, mid-play, he’d rather be home, Netflix-ing the film version. And when the lights are at general-wash, the whole thing looks strangely scuffed and ugly, a cross between a half-vacated college dorm and one of the nicer basements from the Saw series. I felt like I was watching a hastily organized radio play, and half expected a station-break from the Guy’s All-Star Shoe Band.\n\nAnd so, those great Metatronic voices ring out … into darkness: Redgrave’s patrician intonations (even disguised by a dizzily oscillating Southern accent) don’t really fit Daisy’s defensive middle-class guilt. Whenever this Daisy trumpets her humble origins on the wrong side of the tracks, we simply disbelieve her. Redgrave’s Daisy is fearless — too fearless, really, and even a bit insensate. It’s hard to tell where her character’s flintiness ends and the brisk apathy of a slumming stage doyenne begins. If anything, her Daisy comes off a little mean — a quality I came to appreciate the more she committed to it. (When Daisy’s beloved reform temple is bombed by segregationists, she informs Hoke, with Panglossian serenity: “I’m sure they meant to bomb one of the conservative temples or the orthodox one.” The line was cut from the movie, presumably for mainstream sensitivities, but Redgrave delivers it with relish, to monster laughs.) There’s no squish and give in Redgrave’s performance: The sweet tea ferments in her mouth. A tough skin is fine until we need to see the soft underbelly — only her moments of vulnerability just don’t sell.\n\nBut then, Jones isn’t buying, either. To find his Hoke, he deliberately undermines the authority in that sonorous Vader-basso, yassuming and no’ming and mmm-hmmming so fiercely, it develops into a kind of martial art. There are titters when he starts speaking: The sheer impact — tremor of his voice, matched with the exaggerated subservience, seems like a joke — and is. But no one laughs for long: Jones, eyes mostly downcast, glowering under his chauffeur’s cap, uses his voice as sword and shield. His delivery is an aural cartoon of Jim Crow, a sound-sculpture of an oppressive social code that’s been internalized so deeply, mixed with so much fury and frustration, it’s actually become a form of mental illness. Accordingly, Jones’s physical business is emphatic, drilled, somewhere between good-soldiery and a post-physical-therapy relearning of basic motion. He’s approached Hoke not as the strategic thinker and canny survivor Morgan Freeman created, but as a crusted meteorite of a man, barreling through the white South with spikes out and his soul tucked in. His dialogues with Redgrave’s Daisy are bouts, not banter. These are two angry people. When Daisy, nearing the end of her life and her lucidity, says, “You’re my best friend, Hoke,” we really ought to believe her. But here, the line has no sweetness; it’s grimmer, with a last-ditch ring to it, which I’m not entirely sure the actors or their director intended. Together (and yet mostly apart) Redgrave and Jones successfully scrub much of the yellowed complacency out of Uhry’s well-upholstered humanism. They just haven’t replaced it with anything.\n\nLuckily, Gaines’s Boolie — far from seeming the third wheel — turns out to be the grease unctioning these enormous, automatic gears. Even with his relatively modest stage time, he serves as an effective ambassador between great powers, mediating their energies — and, from time to time, making this version of Daisy exceed what it actually is, i.e. two bankable stars on a Broadway pageant wagon. Thanks to him, this perfunctory, Jurassic revival fleetingly seems like more than a theme-park ride. But I don’t think I’d go so far as to call it a journey.\n\nDriving Miss Daisy is a special sixteen-week engagement, opening Sunday, October 24, and running at the Golden Theater through January 29, 2011.\n\nYour product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 998,
  "archivePath": "data/archives/reviews/driving-miss-daisy-2010/vulture--scott-brown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:52:44.818Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 998,
  "tierReason": "Full review text"
}