{
  "showId": "everyday-rapture-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "https://variety.com/2010/legit/reviews/everyday-rapture-1117942662/",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "In the opening scene of the charmingly frenetic philosophical/autobiographical rumination-with-songs, 'Everyday Rapture,' Sherie Rene Scott classifies herself as 'one of Broadway's biggest, brightest semi-stars.' Not anymore, lady. Here is Scott, also transferred from Second Stage. She is not merely carrying this enchanting carnival -- coauthored by herself -- on her more than capable shoulders; she is the show.",
  "bwwScore": 9,
  "contentTier": "complete",
  "previousUrl": "http://www.variety.com/review/VE1117942662.html?categoryid=33&cs=1&nid=2580&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+variety%2Freviews%2Flegit+%28Variety+-+Legit+Reviews%29&utm_content=Netvibes",
  "urlDiscoveredAt": "2026-02-05T02:32:38.193Z",
  "urlDiscoveryMethod": "google-serp",
  "fullText": "Charmingly frenetic philosophical/autobiographical rumination-with-songs.\n\nIn the opening scene of the charmingly frenetic philosophical/autobiographical rumination-with-songs, “Everyday Rapture,” Sherie Rene Scott classifies herself as “one of Broadway’s biggest, brightest semi-stars.” Not anymore, lady. Here is Scott, also transferred from Second Stage. She is not merely carrying this enchanting carnival — coauthored by herself — on her more than capable shoulders; she is the show.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Apple Revenue Pops 16% to Nearly $144 Billion in Year-End 2025 Quarter on iPhone 17 Sales Blitz, Services Biz Hits $30 Billion \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Comcast Q4 Sees Fall in Cable Revenue, Wider Peacock Losses, Despite Boost in Ads, Wireless, Theme Parks\n\nStory, with songs drawn from a variety of sources, follows Scott’s personal journey from a Mennonite upbringing in Topeka, Kan., (population: 117,893) to the mecca of showbiz. Childhood was spent on a spiritual quest, “searching for a way to be one with God while a lot of other people clapped.” As is the Mennonite/Amish custom, the teen-aged Scott went off on Rumspringa, the period of running around before settling down; in her case, the traditional year has stretched now past 27.\n\n“Everyday Rapture” and Scott (from “Aida,” “Dirty Rotten Scoundrels” and “The Little Mermaid”) garnered raves at Second Stage in May, but efforts at a Broadway transfer fell victim to the booking logjam. Then when Roundabout’s final subscription offering, the already-in-rehearsal “Lips Together, Teeth Apart,” was painfully extracted from the schedule, Sherie Rene Scott and “Everyday Rapture” had a home.\n\nScott is a force to be reckoned with. “Everyday Rapture” has stolen in just under the awards deadline and provided an entertaining jolt to the season’s less-than-stellar lineup of new musicals.\n\nCredited as “The Second Stage Theater Production,” the show seems identical to its prior incarnation, though perhaps with some newly mechanized scenic pieces; from a mid-orchestra seat, at least, it plays just as well in the larger house. Better, maybe. Scott and co-author Dick Scanlan have done some minor rewrites, but the show’s assets remain as refreshing as they were last May: Michael Mayer’s smart direction; Michele Lynch’s fitting choreo-graphy; Tom Kitt’s savvy orchestrations; the performances of the backup “Mennonites” Lindsay Mendez and Betsy Wolfe; and the carryings-on of teenager Eamon Foley (who offers a cartoonishly over-the-top version of Scott).\n\nThe “Lips Together” delay forced Roundabout into bringing Broadway audiences a distinctive, hilarious and quirky musical. Count that as a victory for Roundabout, Second Stage, and especially Scott — a Broadway star at last. “Everyday Rapture” is booked through July 11, with room for a small extension. If they can generate strong enough business, the producers should have no problem — this time — finding a house where Scott can transfer for a well-deserved open-ended engagement.",
  "isFullReview": true,
  "textWordCount": 450,
  "archivePath": "data/archives/reviews/everyday-rapture-2010/variety--steven-suskin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:32:38.202Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 450,
  "tierReason": "Full review text"
}