[
  {
    "showId": "ragtime-2025",
    "outlet": "New York Stage Review",
    "originalScore": "5/5",
    "expectedRange": {
      "min": 85,
      "max": 100,
      "midpoint": 92.5
    },
    "text": "As great and admired as Ragtime has been since it debuted 27 years ago, it's become something more. It is a mirror reflecting the world today through the lens of the world that was more than a century ago. Based on E. L. Doctorow's classic 1975 historical novel, and adapted for the stage by bookwriter Terrence McNally along with composer Stephen Flaherty and lyricist Lynn Ahrens, Ragtime is truly timeless. Revived once again by Lear DeBessonet following last year's outstanding City Center concert version, this nearly flawless Lincoln Center Theater production ranks among Broadway's best of all time.\n\nWith the opening number \"Ragtime,\" featuring the entire company as if in a moving American tapestry, we are introduced to each of the main characters. There are so many of them that in lesser hands they'd be reduced to stereotype or simply lost in the shuffle. But here, so masterfully staged by director DeBessonet and choreographer Ellenore Scott, the combined effect of music, story and performance on that mostly bare stage is breathtaking. And it left audiences cheering and weeping right from the start.\n\nDoctorow's story begins in 1902 when ragtime music symbolized a turning point in the country. Weaving the fates of Americans – black and white – with the newly arrived huddled masses, McNally's book focuses the complex tale on three sets of families. We first meet the affluent Father (Colin Donnell), Mother (Caissie Levy) and Mother's Younger Brother (Ben Levi Ross) in suburban "
  },
  {
    "showId": "oedipus-2025",
    "outlet": "Culture Sauce",
    "originalScore": "5/5",
    "expectedRange": {
      "min": 85,
      "max": 100,
      "midpoint": 92.5
    },
    "text": "The most contemporary, trenchant new play on Broadway is Robert Ickes' searing new adaptation of Sophocles' Oedipus, which opened Thursday in a mesmerizing production that stands as one of the memorable nights of theater you are ever likely to experience. The pitch-perfect show opens with a video projected onto the full curtain of Studio 54 where our suited hero (Mark Strong), a politician on election day, addresses news cameras and sign-wielding political supporters promising a new era of honesty and forthrightness in the body politic. Oedipus vows to squelch questions about his status as a foreigner (\"My opponent loves the idea this country isn't my country… My identity doesn't fit\") by releasing his birth certificate — shades of Barack Obama, anyone? — and to launch a full investigation into the death of the beloved previous ruler Laius that has been the subject of conspiracy theories for decades.\n\nWhat we know and Oedipus does not is that his sincere effort to settle any doubts about his lineage or tamp down speculation about Laius' mysterious passing will backfire on him in a very big way. He was the one who killed Laius, though he doesn't know it, and his birth certificate will reveal that he was adopted by the parents he thought were his own but that his birth mother is actually his wife, Jacosta (Lesley Manville), who also happens to be Laius' widow.\n\nIckes, who's gained a reputation for reimagined classics like Hamlet and Aeschylus' Oresteia, has found ingenious ways"
  },
  {
    "showId": "moulin-rouge-2019",
    "outlet": "New York Stage Review",
    "originalScore": "5/5",
    "expectedRange": {
      "min": 85,
      "max": 100,
      "midpoint": 92.5
    },
    "text": "Karen Olivo and Aaron Tveit belt out chart-topping hits in the lavish screen-to-stage salute to \"truth, beauty, freedom, and love.\"\n\nIn the 2001 film Moulin Rouge!—Baz Luhrmann's flaming absinthe-soaked fever dream—Toulouse-Lautrec (John Leguizamo) and his merry band of bohemians are creating a show called Spectacular Spectacular. In the new Broadway adaptation, titled Moulin Rouge! The Musical!, lest there be any confusion, librettist John Logan has changed the show-within-a-show's title to Bohemian Rhapsody. Perhaps it's simply another anachronistic musical reference in a piece packed with them. Maybe it's a nod to the recent Oscar-winning Queen biopic. Or perhaps, for this glamorous theatrical extravaganza, Spectacular Spectacular suddenly seemed insufficient. Comment dit-on spectacular en français?\n\nNo disrespect to headliners Karen Olivo (a Tony winner as Anita in 2009's West Side Story), who plays the tuberculosis-plagued performer/courtesan Satine, and Aaron Tveit (Catch Me If You Can, Next to Normal), as the lovestruck aspiring composer Christian but the real stars of this Moulin Rouge! are the artists who don't appear onstage. Lighting designer Justin Townsend can evoke anything from a pulse-pounding nightclub to the shadowy alleys of Argentina to a hallucinogenic electric-green drunken dream. Six-time Tony winner Catherine Zuber, fresh off the elegantly appointed My Fair Lady, has crafted a stunning array of costumes: cascading cancan underskirts; bondage-style cors"
  },
  {
    "showId": "stereophonic-2024",
    "outlet": "New York Stage Review",
    "originalScore": "5/5",
    "expectedRange": {
      "min": 85,
      "max": 100,
      "midpoint": 92.5
    },
    "text": "Playwright David Adjmi's extensive resume has included an intimate portrait of Syrian Jews in Brooklyn (Stunning), a fanciful contempo take on Marie Antoinette, and 3C, a controversial sexed-up parody of the sitcom Three's Company. Interesting work all around, but none of it prepares us for the hyperrealistic triumph that is Stereophonic, now at the Golden Theatre for a limited run after a similarly limited run at Playwrights Horizons.\n\nThis saga of a torturous year in the life of a rock group and their trusty engineers as they struggle to craft a new album – heavily inspired by Fleetwood Mac's legendary Rumours – is quite simply terrific. And a huge part of its success is due to the obvious eagerness of all concerned, actors and production team alike, to wrap themselves inside a thoroughly researched, brilliantly imagined slice of life.\n\nAny \"People At Work\" play has a lot going for it. Whatever interpersonal conflicts or private ruminations the characters engage in, they always know they have to get back to making the donuts (as in Superior Donuts) or the sandwiches (as in Clyde's), or to pitching real estate (as in Glengarry Glen Ross). The rhythms of the job establish the rhythms of the action. There's no end of inspiration for stage business. Nothing beats anchoring drama to labor.\n\nSince the labor in Stereophonic is making music, Will Butler, late of the Grammy-winning indie-rock Arcade Fire, provides half a dozen songs whose \"creation\" we eavesdrop on, in dribs and dra"
  },
  {
    "showId": "cabaret-2024",
    "outlet": "New York Stage Review",
    "originalScore": "4/5",
    "expectedRange": {
      "min": 72,
      "max": 88,
      "midpoint": 80
    },
    "text": "As the title song goes, \"Come to the cabaret, old chum, come to the cabaret.\" And the creators of the new revival being presented at the August Wilson Theatre — sorry, the \"Kit Kat Club at the August Wilson Theatre\" — really want you to come to the cabaret. To that end, just as in the original London incarnation, they're dramatically reconfigured the venue and transformed it into a multi-level nightclub in which you're invited to be your most decadent self. Or, at least spring for expensive drinks and snacks while waiting for the show proper to begin.\n\nTheatergoers are advised to arrive at least an hour early to experience the \"Prologue,\" featuring nine dancers and musicians performing in three spaces — dubbed the \"Vault Bar,\" \"Green Bar,\" and \"Red Bar\" — located in the theater's dressed-up lobbies. To get there, you don't go through the main entrance, but rather an alley, after which your phone is affixed with a sticker over the camera lens and you're handed a shot of schnapps. It's all so decadent, darling.\n\nIt's designed to get you into the mood for the familiar musical featuring a score by John Kander and Fred Ebb and a book by Joe Masteroff, and it's certainly impressive. It doesn't really have much to do with the actual show, mind you, with the acts and atmosphere less redolent of Weimar-era Germany than a Lower East Side, retro-style burlesque show. And the irony is that it ultimately feels unnecessary, as the production directed by Rebecca Frecknall more than stands u"
  },
  {
    "showId": "stranger-things-2024",
    "outlet": "New York Stage Review",
    "originalScore": "4/5",
    "expectedRange": {
      "min": 72,
      "max": 88,
      "midpoint": 80
    },
    "text": "The origin story for a fan-fave Netflix TV series uses every conceivable means to knock our socks off – and does.\n\nStranger Things: The First Shadow is a trap for snobs. A goodly number may start out with the assumption that the prequel to a Netflix series, one tailored to and featuring teenagers (I can hear the Eustace Tilleys sniff already), and especially one whose stock-in-trade is shock and gore, can't possibly be executed with artistry, must be schlocky, and will offer nothing in the way of thematic or emotional interest. Well, there's a good deal of juvenile hijinks along the way, a lot of running around and shouting, and fast talking about monsters and mysterious curses, I grant all that. The dialogue will take no prizes for eloquence (there's a good reason for everyone's talking fast). But it's an exciting and even moving evening, all the same. While the small-screen classic Outer Limits always claimed to be \"controlling the horizontal,\" for three hours at the Marriott Marquis, all three of our dimensions are in the playmakers' hands.\n\nNot incidentally, audiences are bearing witness to the most phenomenal exhibition of technical wizardry Broadway has ever seen, and that includes the long-running Harry Potter sequel (whose illusion-meisters, Jamie Harrison and Chris Fisher, are behind this new show's legerdemain). Paul Arditti's sound design could not, I think, be bettered, the creaks and groans of battleships and dying creatures pinging off the walls and getting unde"
  },
  {
    "showId": "mamma-mia-2025",
    "outlet": "Culture Sauce",
    "originalScore": "4/5",
    "expectedRange": {
      "min": 72,
      "max": 88,
      "midpoint": 80
    },
    "text": "Nobody could mistake Mamma Mia! for high art. Cardboard-cutout characters vamp through a ridiculous romantic plot, while beloved disco-era ABBA hits are shoehorned in often as clumsily as Cinderella's prince struggling to find the perfect fit for the lost slipper of his royal-ball dancing partner. But audiences still thrill to dancing queens. And Mamma Mia!, returning to Broadway nearly a quarter century after it began a long and glorious run at the Winter Garden Theatre (and later the Broadhurst), has an infectious, high-energy showmanship that's almost irrepressible.\n\nFans of the show, and they appear to be legion at the early performances at the Winter Garden, will find a production that appears to be a carbon copy of director Phyllida Law's original: from Mark Thompson's brightly colored set design and costumes, including a stylized re-creation of a Greek coastal taberna, to Howard Harrison's similarly primary-hued lighting to Anthony Van Laast's athletic and witty choreography — which again includes a routine in which buff wetsuit-wearing chorus boys do high kicks while wearing flippers.\n\nLaw repeats her duties here, and directs her talented cast to take a broad, English music-hall approach to the decidedly silly material. That's especially true of the three middle-aged women at the center of the story: Donna (Christine Sherrill), the former lead of a girl group now running a modest Greek hotel, and her two erstwhile backup singers, the sassy, thrice-married Tanya (Jalyn"
  },
  {
    "showId": "liberation-2025",
    "outlet": "New York Stage Review",
    "originalScore": "4/5",
    "expectedRange": {
      "min": 72,
      "max": 88,
      "midpoint": 80
    },
    "text": "When Bess Wohl's play Liberation premiered off-Broadway last winter it was revelatory. Despite some structural weaknesses that remain, it's a beautiful work featuring an ensemble of actors at the top of their game. It's no wonder the production transferred to Broadway totally intact.\n\nWohl is a wonderfully intuitive writer who listens to her characters. Her play is aptly titled, both literally — set at the start of the women's liberation movement in the 1970's — and dramatically, as her characters are \"liberated\" to determine the direction of the story. The result is a thoroughly honest portrait of a group of women who sought to change the world and came up short.\n\nAs impressive as the cast was in that earlier production, the women — and a guy — are even better now. And each of them seems so fully invested in their roles, we forget they're acting. That is the highest praise I could offer.\n\nRight from the start, when Lizzie (Susannah Flood) walks solo onto the stage, introducing herself, she's got the audience in the palm of her hand. It's partially the writing, as she endears herself with welcoming comments, asking \"Is everyone good? Comfortable?\" And there's a meta component as she gets into their heads, when she says \"How long is this going to take, right? I know that's all anyone really wants to know: the running time.\" It's a clever way to begin, but even better is when Lizzie finally gets to the point, saying \"This is a play about my mother. For my mother.\" Flood pauses "
  },
  {
    "showId": "the-notebook-2024",
    "outlet": "New York Stage Review",
    "originalScore": "3/5",
    "expectedRange": {
      "min": 55,
      "max": 72,
      "midpoint": 63.5
    },
    "text": "After a successful run on page and screen, the popular love story looks to score on Broadway.\n\nIt was only a matter of time before a stage adaptation of The Notebook came to fruition. Based on Nicholas Sparks' best selling novel, the popular 2004 film starring Rachel McAdams and Ryan Gosling is a romantic (if rather schmaltzy) stunner. There is naturally a built-in audience for this musical, clamoring to know if it's as good as the movie and how does it compare? And for those new to the tear-jerker story of Allie and Noah from opposite sides of the tracks, does it still resonate at all? The answer to that last question is most certainly yes, it does resonate. I think you'd have to hail from another planet not to feel something for these appealing characters. By the resounding sniffles heard throughout the audience, it most certainly succeeded on that front. And yet, despite some lovely songs and excellent performances, the musical is missing some keynotes.\n\nUnlike the book and film which starts in the 1940's surrounding World War II, the musical begins in the '60's during the Vietnam era. Another difference: the film has two sets of romantic leads depicting Allie and Noah in their youth and old age while the musical has three sets of leads – \"Younger\", \"Middle\" and \"Older\".\n\nBoth versions span some 60 years as we first meet the young lovers at age 17 and 19. The musical's set in a coastal Mid-Atlantic town. Allie is spending the summer with her wealthy family in their vacatio"
  },
  {
    "showId": "mj-2022",
    "outlet": "Time Out New York",
    "originalScore": "3/5",
    "expectedRange": {
      "min": 55,
      "max": 72,
      "midpoint": 63.5
    },
    "text": "The authorized biomusical MJ wants very much to freeze Michael Jackson in 1992: It's a King of Pop-sical. The show begins on a note of truculent evasion. Jackson, played by the gifted Broadway newcomer Myles Frost, is in rehearsal for his Dangerous tour—a year before the superstar was first publicly accused of sexually abusing a minor—and the number they run is \"Beat It,\" a song about the importance of avoiding conflict. \"Showin' how funky strong is your fight,\" sings Michael, prefiguring the musical's approach to his life. \"It doesn't matter who's wrong or right.\"\n\nWhen the song is done, Michael speaks with an MTV reporter (Whitney Bashor) who has landed a rare interview with him. \"With respect, I wanna keep this about my music,\" he says. \"Is it really possible to separate your life from your music?\" she asks, preempting a question on many minds, and his reply is a slice of \"Tabloid Junkie\": \"Just because you read it in a magazine / Or see it on a TV screen, don't make it factual.\" And that, more or less, is that. Expertly directed and choreographed by Christopher Wheeldon, MJ does about as well as possible within its careful brief. In and of itself, it is a deftly crafted jukebox nostalgia trip. Lynn Nottage's script weaves together three dozen songs, mostly from the Jackson catalog. The music and the dancing are sensational. And isn't that, the show suggests, really the point in the end? Doesn't that beat all?\n\nMJ is manifestly aimed at people who either believe in Jackson"
  },
  {
    "showId": "the-notebook-2024",
    "outlet": "New York Stage Review",
    "originalScore": "3/5",
    "expectedRange": {
      "min": 55,
      "max": 72,
      "midpoint": 63.5
    },
    "text": "Six actors play the two leading characters in this atmospheric musical based on the popular Nicholas Sparks novel.\n\nThe spring parade of Broadway musicals is at the gate, seeking to curry huzzahs and premium ticket sales, with entrants lined up like helium balloons along Central Park West on the night before Thanksgiving. The first of this seven-week sprint to the finish (i.e., the Tony Award nomination deadline on April 25) is a professionally assembled emotion-tugger called The Notebook, derived from the popular 1996 novel by Nicholas Sparks and further popularized by a 2004 film version.\n\nThis is one of those musicals that some viewers will love vociferously while others, inevitably, espouse a decidedly contradictory view. There is enough quality entertainment on hand, especially from the performers, to provide viewers with a thoroughly watchable two-and-a-half hours. In normal Broadway seasons, when full-scale original musicals can be counted on a hand's worth of fingers, these attributes might be enough to place The Notebook in the Tony winner's circle, or at least in contention. But based on the 2023-24 musicals which have opened thus far and those which have already been seen in pre-Broadway mountings, one might predict that The Notebook will fall far above the worst but not in league with the best.\n\nThe notebook in question is a book within a book, if you will. Allie is suffering from dementia. A kindly elderly \"friend,\" who anyone with story sense will immediately re"
  },
  {
    "showId": "mamma-mia-2025",
    "outlet": "New York Stage Review",
    "originalScore": "3/5",
    "expectedRange": {
      "min": 55,
      "max": 72,
      "midpoint": 63.5
    },
    "text": "A strong touring company cast is undone by too-loud versions of Andersson-Ulvaeus Top 40 clicks.\n\nEver since Mamma Mia! opened Oct. 18, 2001, at New York City's Winter Garden Theatre and closed Sept. 12, 2015, after 5,758 performances, elbowing its way into international theater annals, it's likely the property has been playing somewhere every single day.\n\nWhat on earth accounts for that? Easy. The already beloved songs by Swedish quartet ABBA, written by Benny Andersson and Björn Ulvaeus sometimes with Stig Anderson, had been worked—most of them cleverly, a few awkwardly—into a sufficiently cute Catherine Johnson book.\n\nJust what is the winning, winsome musical comedy setup? A 20-year-old woman, raised on a Greek island by a single mother, wants her biological father, one of three candidates, to walk her down the aisle. Without her mom's consent, she has invited the unwitting maybe dads to the event taking place the day after the frantic action begins.\n\nBy now audiences of all ages, shapes, and sizes have been genuinely entertained by this entirely unobjectionable folderol, and who's to say they shouldn't have been? Only fogies and perhaps melody aficionados who've inexplicably resisted ABBA ingenuity over the past four or five decades.\n\nOkay, you millions (billions?) of ABBA–Mamma Mia! devotees, your fave-rave musical gift is back on Broadway in a first local revival at, appropriately, the Winter Garden. It would be a pleasure to say it's every bit as good as it ever was. U"
  },
  {
    "showId": "queen-versailles-2025",
    "outlet": "New York Stage Review",
    "originalScore": "2/5",
    "expectedRange": {
      "min": 35,
      "max": 55,
      "midpoint": 45
    },
    "text": "By the time Natasha Katz' busy lights blacked out on The Queen of Versailles, two different notions had struck this bleary-eyed spectator: 1) Oscar Wilde's quote defining a cynic as someone who knows \"the cost of everything and the value of nothing\" and 2) George Kelly's 1925 Pulitzer-prize-winning, Craig's Wife, in which housewife Harriet Craig places her immaculate home so far above everyone else in her life that she eventually is left completely alone with the damned abode.\n\nWhich is a way of saying that what we have in The Queen of Versailles—the Lindsey Ferrentino-Stephen Schwartz musical adaptation of Lauren Greenfield's 2012 documentary of the same name—is a contemporary spin on a woman who knows the cost of everything but the value of nothing and who eventually meets predecessor's Harriet Craig's abandoned fate.\n\nFurthermore, what we have is a Kristin Chenoweth vehicle that incorporates within it the makings of a stirring musical half its bloated size. Yes, in the final minutes Chenoweth as the real-life Jackie Siegel has an acting-singing challenge worthy of her and worth an audience's shocked attention.\n\nAs of now, what's on view will likely only excite Chenoweth fans completely happy to watch their fave-rave performer belt song after Schwartz song (only a few up to his Wicked standard) in innumerable Christian Cowan costumes that are equal to the dazzlers the show is meant to be, his Tony nom on the way.\n\nSo yes, The Queen of Versailles, with the always expert Mich"
  },
  {
    "showId": "oh-mary-2024",
    "outlet": "New York Stage Review",
    "originalScore": "2/5",
    "expectedRange": {
      "min": 35,
      "max": 55,
      "midpoint": 45
    },
    "text": "A monumentally silly show, Oh, Mary! arrived at the Lyceum Theatre on Thursday for a 12-week Broadway engagement. Created by and starring comedian-actor-writer Cole Escola as its title figure, Oh, Mary! was a surprise hit Off Broadway earlier this year.\n\nBy now, many readers probably are aware that Escola depicts Mary Todd Lincoln as a whiskey-steeped fruitcake who's nutty with dreams of renewing her career as a cabaret songbird.\n\n\"People traveled the world over for my short legs and long medleys,\" Mary declares.\n\nA ribald cartoon more hysterical than historical, Oh, Mary! sheds unexpected light upon the assassination of Abraham Lincoln and represents the latest generation of gender bent comical entertainment known as camp. Elder viewers reared on the comparatively subtle writing and performance style of Charles Busch are likely to find Escola's slapdash artistry crude, but there's no denying he snags laughs.\n\nSkittering about in voluminous black skirts, corkscrew curls bobbing, Mary weaves and staggers around the presidential office in relentless pursuit of liquor and her ambitions to become a star. Mary's long-suffering spouse Abraham, who describes her as \"foul and hateful,\" meanwhile is distracted by suppressed desires of his own and concluding the Civil War with the south.\n\n\"The south of what?\" wonders self-centered Mary.\n\nIn an 80-minute series of blackout comedy scenes, Mary rejects embroidery lessons in favor of swilling paint thinner, demoralizes a genteel chaperone "
  },
  {
    "showId": "chess-2025",
    "outlet": "New York Stage Review",
    "originalScore": "2/5",
    "expectedRange": {
      "min": 35,
      "max": 55,
      "midpoint": 45
    },
    "text": "Two musical theater kings and a queen strive mightily with a famously elusive concept album, but play to a draw.\n\nAs I left Chess, the latest mega-attempt (of many) to translate the 1984 Benny Andersson/Tim Rice/Björn Ulvaeus concept album to the legit stage, I couldn't help thinking how little interested in chess this Chess is. Only two competition sequences, and not even seated, as the grandmasters stand at microphones muttering \"Pawn to E6,\" \"Knight to F3\" like contestants on the old $64,000 Question. There's an occasional allusion to the effect of \"the KGB makes its next move: the King's Gambit,\" or \"the only move to make is a sacrifice.\" Yet the incredible physical and intellectual rigors of chess at championship level are much talked about, but never appear, on the stage of the Imperial.\n\nWhich begs a question. If all you're shooting for is the tired old metaphor that life is a game and the game is life, you might as well call your show Yahtzee! or Old Maid. Actually, Chutes'n'Ladders might suit this version best, what with the cast gamely trudging up and down David Rockwell's American Bandstand set, while the characters' fortunes rise and fall with librettist Danny Strong and director Michael Mayer pulling their strings.\n\nStrong has heady fish to fry. Billing the ceremonies as \"A Cold War Musical,\" he goes through hoops to insinuate post-1945 geopolitics into the thin romantic storyline of two world champs and the second they both covet. The chorus is dressed in identi"
  },
  {
    "showId": "queen-versailles-2025",
    "outlet": "Culture Sauce",
    "originalScore": "1/5",
    "expectedRange": {
      "min": 0,
      "max": 35,
      "midpoint": 17.5
    },
    "text": "Jackie Siegel, the buxom pageant queen turned billionaire's wife who was the subject of Lauren Greenfield's 2012 documentary The Queen of Versailles, was present at the performance of the Broadway musical adaptation when I attended — with her fluffy white lap dog as an accessory and a full entourage calling out her name during the overlong pre-show and intermission periods. She and her late husband, David, a Florida real estate developer who overextended himself in the 2000s on subprime mortgages on his vast network of time-share vacation properties, are also credited in the Playbill as investors. And therein lies the uncomfortable truth at the center of The Queen of Versailles, a tone-deaf celebration of all-American affluenza that can never resolve how we should feel about the vain, misguided woman at its center.\n\nJackie is portrayed by that human spitfire, Kristin Chenoweth, bringing just the right amount of sex appeal to the role of the gold-digging uber-mom who raises eight kids in the lap of luxury and sets her sights on building the largest private home in America, a 90,000-square-foot monstrosity modeled on the Palace in Versailles (and which remains unfinished to this day). The desire for creature comforts is the heart of Jackie's big Act 1 \"I wish\" song, a countryish ballad called \"Caviar Dreams\" that evokes Robin Leach's catchphrase from the syndicated 1980s series Lifestyles of the Rich and Famous. It's easily the best song in the new score by Stephen Schwartz, wh"
  }
]