{
  "showId": "ghost-the-musical-2012",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2012/legit/reviews/ghost-the-musical-1117947324/",
  "publishDate": "April 23, 2012",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "The show's saving grace is its astonishing illusions, created by Paul Kieve, who makes people materialize and vanish with such fluid ease that even jaded theatergoers will gasp in wonder.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The show's saving grace is its astonishing illusions, created by Paul Kieve, who makes people materialize and vanish with such fluid ease that even jaded theatergoers will gasp in wonder.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (30 words)",
  "rejectedAt": "2026-02-03T16:46:23.505Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt focusing only on technical illusions, lacking any overall evaluation or recommendation about the show; openai: The text is a single sentence focusing on the illusions in the show, lacking a comprehensive evaluation or verdict of the production as a whole.",
  "promptVersion": "5.2.0",
  "textWordCount": 658,
  "archivePath": "data/archives/reviews/ghost-the-musical-2012/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:48:21.496Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "scrapingbee",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "Mar 30, 2012 3:27pm PT \n\n \n\n \n \n \n\n \n\n \n Magic City\n \n \n\n \n\n Jeffrey Dean Morgan has undeniable star quality in \"Magic City, \" but the intriguing backdrop of a Miami hotel run by a charismatic boss with shady friends at the start of 1959 is consistently more interesting than the series.\n\n“Magic City” very shrewdly, almost self-consciously evokes another time and place through the lens of “The Godfather” saga, down to Alex Rocco’s inclusion in a supporting role. Yet the intriguing backdrop — a Miami hotel run by a charismatic boss with shady friends at the start of 1959 — is consistently more interesting than the series, which tends to hit a lot of familiar notes. Starz has broadened its profile with “Boss” and now this, and Jeffrey Dean Morgan has undeniable star quality. Nevertheless, while the era sprinkles a bit of fairy dust, the show itself falls well short of magic.\n\nDepending on one’s level of cynicism, Rocco’s small turn as the father of Morgan’s character — given the surroundings, you’re half waiting for him to yell “I’m Moe Greene!” — qualifies as a clever homage or a crass subliminal message, take your pick.\n\nEither way, the series begins on New Year’s Eve, 1958 — hello, “Godfather Part II” — with Morgan’s Ike Evans as a the tough proprietor of a Miami hotel, the Miramar Plaza, preparing for a make-or-break evening with Frank Sinatra performing.\n\nOutwardly, Ike seems to have it made, with a beautiful ex-showgirl (Olga Kurylenko) as a second wife and two grown sons, Stevie (Steven Strait) and Danny (Christian Cooke), working for their old man. But Ike also has labor troubles and a short financial leash, forcing him toward a classic deal with the devil — in the form of Jewish gangster Ben “The Butcher” Diamond (Danny Huston) — to make his problem go away.\n\nCreated by Mitch Glazer, “Magic City” unfolds like a fairly conventional soap, only with a bit more sex and nudity because, well, it’s pay cable. There’s Diamond’s unhappy young wife Lily (Jessica Marais), whose extracurricular activities create an element of tension; and the question of whether Ike can sustain control with Ben — as played by Huston, all menace, glower and brimstone — in his life.\n\nAs constructed, though, the only thing to differentiate the series from anything else is the time period, with the Cuban revolution as a side element to what’s transpiring Stateside. And while the big-finned Cadillacs and old pop songs create an aura of pre-“Mad Men” nostalgia, the show is conventional in most other respects.\n\nDespite Morgan’s appeal, his Ike — if not exactly a choirboy — doesn’t join the ranks of great cable leading men, and none of those orbiting him possess the same level of charisma. Granted, it’s nice to see Starz trying to stretch, but such casting limitations have blunted its efforts, despite some notable guest stars.\n\nThe three previewed episodes of “Magic City” have their moments, and as with “Boss,” Starz has provided a vote of confidence with a pre-premiere renewal — as much about relationships and economics as quality, perhaps, but a welcome message to talent nevertheless.\n\nStill, the bar is set pretty high for this sort of exercise. By that measure, checking into the Miramar Plaza is an offer you can afford to refuse.\n\nAs a California consumer, you have the right to opt-out from the sale or sharing of your personal information at any time across business platform, services, businesses and devices. You can opt-out of the sale and sharing of your personal information by using this toggle switch. As a Virginia, Utah, Colorado and Connecticut consumer, you have the right to opt-out from the sale of your personal data and the processing of your personal data for targeted advertising. You can opt-out of the sale of your personal data and targeted advertising by using this toggle switch. For more information on your rights as a United States consumer see our privacy notice."
}