{
  "showId": "ghost-the-musical-2012",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "http://www.variety.com/review/VE1117947430",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Full of moving scenery, lights, projections, film and magical illusions, but devoid of actual magic, the Broadway production of 'Ghost' is a lumbering megatuner with little to offer beyond a limitless array of dazzling effects. But while it's tempting to suggest the show hasn't a ghost of a chance, that assessment might not be warranted: The still-running London production successfully parried a dire critical reception last July, and audience response to the visuals and that familiar title might well attract enough Rialto customers to make a go of it.",
  "bwwScore": 5,
  "contentTier": "excerpt",
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 479,
  "archivePath": "data/archives/reviews/ghost-the-musical-2012/variety--steven-suskin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:48:40.170Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "showNotMentioned": true,
  "wrongFullText": "Full of moving scenery, lights, projections, film and magical illusions, but devoid of actual magic, the Broadway production of \"Ghost\" is a lumbering megatuner with little to offer beyond a limitless array of dazzling effects.\n\nFull of moving scenery, lights, projections, film and magical illusions, but devoid of actual magic, the Broadway production of “Ghost” is a lumbering megatuner with little to offer beyond a limitless array of dazzling effects. But while it’s tempting to suggest the show hasn’t a ghost of a chance, that assessment might not be warranted: The still-running London production successfully parried a dire critical reception last July, and audience response to the visuals and that familiar title might well attract enough Rialto customers to make a go of it.\n\nLibrettist/co-lyricist Bruce Joel Rubin hews closely to his Oscar-winning 1990 screenplay, about a murdered banker (played here by Richard Fleeshman) who drafts a reluctant clairvoyant (Da’Vine Joy Randolph) to protect his fiancee (Caissie Levy) from his double-dealing best friend (Bryce Pinkham). Rubin gives us two very funny scenes — ghost and clairvoyant with the girl in the first act, and with a banker in the second — which seem more or less lifted from the movie.\n\nOtherwise, the book is flat, as is the score by Dave Stewart (of the Eurythmics) and multiple Grammy winner Glen Ballard. Best song in the show is clearly “Unchained Melody,” the 1955 standard by Hy Zaret and Alex North which was featured in the screen version and is prominently showcased here. The hero also has a tendency to sing “10,000 Bottles of Beer on the Wall,” which has a marginally stronger chorus than much of what the three credited lyricists have collectively wrought. (The score seems to have acquired one replacement since the London opening, a functional song for a stageful of ghosts called “You Gotta Let Go.”)\n\nBrit Matthew Warchus is at the helm, with a first-rate bag of tricks at his disposal, and has guided set/costume designer Rob Howell, video/projection designer Jon Driscoll and illusioneer Paul Kieve through an evening of visual delights.\n\nBut other than respectable performances from the leads, that’s about it for the plus column. Fleeshman is likable as the title character. Levy charms throughout, and gets to sing the production’s one believable number, “With You.” Randolph gives a crowd-pleasing turn, especially in her big 11 o’clock number, “I’m Outta Here,” though the song is as dramatically questionable as it is entertaining.\n\nChoreography by Ashley Wallen is of the kinetic, herky-jerky variety, and multiplying the 16 dancers with projected silhouettes only magnifies the weaknesses of the staging. The set crashed and crunched at the first official press preview, resulting in a 24-minute break in the action. This seems to have been a onetime occurrence, and no injuries were reported. But “Ghost” sure ain’t a show you want to see without the effects fully operational.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-GHOST-THE-MUSICAL-Opens-on-Broadway-Updating-Live-20120423",
  "_showNotMentionedDiscoveryAttempted": true
}
