{
  "showId": "fully-committed-2016",
  "outletId": "act-three-the-reviews",
  "outlet": "Act Three: The Reviews",
  "criticName": "Doug Marino",
  "url": "http://dougmarino.blogspot.com/2016/04/fully-committed.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "“I thought I'd be rolling in the aisle...Unfortunately, as cute and adorably cuddly as Jesse Tyler Ferguson is, he's just not an over-the-top character actor--and that is what 110% of this role requires...On a stage about eight times larger than what the show should be presented on, I found little to enjoy and many-a-glance at my watch to check when 90 minutes would finally be up...Sorry Jesse. I really wanted to fill your reservation book up!”\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 198,
  "archivePath": "data/archives/reviews/fully-committed-2016/act-three-the-reviews--doug-marino_2026-02-06.html",
  "textFetchedAt": "2026-02-06T16:17:28.871Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 198 (min: 300)",
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "I thought I'd be rolling in the aisle. I thought my sides would hurt from laughing too much. How could it not be good? A cute, funny, gay-boy playing the part of a haggered high-end restaurant reservation desk clerk playing his own part and the parts of ever crazy person who calls into the restaurant. This really seemed like a guaranteed recipe for hysteria for the masses. Unfortunately, as cute, and gay, and adorably cuddly as Jesse Tyler Ferguson is, he's just not an over-the-top character actor - and that is what 110% of this role requires. (Think, for example, Mario Cantone!). At Broadway prices ($$) and a stage about 8x larger than what the show should be presented on, I found little to enjoy and many-a-glance at my watch to check when 90 minutes would finally be up. Not to mention, the seats in the dumpiest Broadway theater around, The Lyceum, were busted and uncomfortable. Not a great match for the purported restaurant in the show. And for the record, I've never heard an American use the titular expression to say \"We're full tonite\". Sorry Jesse. I really wanted to fill your reservation book up! Call me."
}