{
  "showId": "wonderland-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "http://www.variety.com/review/VE1117945030",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "There is a distinct lack of wonder in 'Wonderland,' the new Frank Wildhorn musical at the Marquis. Unless one was to wonder how a big, Broadway musical based on Lewis Carroll's wildly inventive and delectably fantastical characters can be so utterly devoid of the aforementioned elements. Or to wonder why -- after a full-scale 2009 presentation in Tampa Bay and Houston -- the producers saw fit to remount this less-than-scintillating, $15 million tuner on Broadway.",
  "bwwScore": 2,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Broadway-Review-Roundup-WONDERLAND-Updating-Live-20110417",
  "fullText": "There is a distinct lack of wonder in \"Wonderland,\" the new Frank Wildhorn musical at the Marquis.\n\nThere is a distinct lack of wonder in “Wonderland,” the new Frank Wildhorn musical at the Marquis. Unless one was to wonder how a big, Broadway musical based on Lewis Carroll’s wildly inventive and delectably fantastical characters can be so utterly devoid of the aforementioned elements. Or to wonder why — after a full-scale 2009 presentation in Tampa Bay and Houston — the producers saw fit to remount this less-than-scintillating, $15 million tuner on Broadway.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Miranda Lambert Sells Entire Song Catalog to Sony Music Publishing Nashville and Domain Capital \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Music Industry Moves: Joy Oladokun Signs With Concord\n\n“Wonderland” stands out for its lack of distinction. In this case, Alice is not a young girl but a thirtysomething school teacher who lives in Queens. When this Alice runs out of steam, the authors send their villainous Mad Hatter back home to kidnap Alice’s daughter Chloe. At which point we have Alice and Chloe in Wonderland, the latter handcuffed to a tractor. So much for inventive plotting.\n\nShow marks the first Broadway appearance for composer Wildhorn, who has been juggling a half-dozen musical theater projects over the last decade, since the dead-on-arrival “Dracula” in 2004. Compared to his earlier “Jekyll and Hyde,” “The Scarlet Pimpernel” and “The Civil War,” “Wonderland” — based on a single hearing — seems to have a more interesting score. But a single hearing is enough.\n\nSimilarly problematic musicals have been lifted by the ministrations of the cast, but there is little here that is compelling. As Alice, Janet Dacal (“In the Heights”) gives an unengaging performance that matches the level of the material. None of the actors in the assorted anthropomorphic roles stand outs either.\n\nThe only exuberance to be found comes from Karen Mason as the Queen of Hearts. Her performance of “Off with their Heads” breathes life into the proceedings, for five minutes in the second act, at least. Carly Rose Sonenclar, as young Chloe, also rises above the general air of malaise.\n\nScenery by Neil Patel and projections by Sven Ortel are busy rather than helpful, with effective lighting by Paul Gallo. Only successful production element is the costume design by Susan Hilferty; the second act Queen of Hearts dress for Mason’s big number is especially stunning, although nothing to cause the queens from “Priscilla” to turn pale.\n\nEarly in the second act, Lewis Carroll himself makes a cameo appearance (coyly listed in the program as “The Victorian Gentleman,” an extension of the White Knight character played by Darren Ritchie). Carroll proceeds to sing an inspirational tune — “Nothing can exist till you dream it first” — but maybe they should have had him write some jokes instead.",
  "isFullReview": true,
  "textWordCount": 463,
  "archivePath": "data/archives/reviews/wonderland-2011/variety--steven-suskin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T06:14:17.406Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 463,
  "tierReason": "Full review text"
}