{
  "showId": "network-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2018/12/06/network-maddening-as-hell/",
  "publishDate": "2018-12-06T21:50:10",
  "fullText": "A little more than halfway through Network—Lee Hall’s theatrical adaptation of the deliciously cynical (and eerily prescient) Paddy Chayefsky–scripted 1976 film—Tony winner Bryan Cranston (All the Way), as disgraced news anchor–turned–primetime prophet Howard Beale, is ready to deliver the character’s iconic mad-as-hell speech. Before he even says a word, we see how broken down Beale is. Cameras zoom in on his furrowed brow, on his lips as he starts to speak but chokes on his own words, on his weary eyes welling with tears. The pain is written all over his face, and projected onto a 12- by 20-foot screen for the entire Belasco Theatre audience to see. That’s when director Ivo van Hove’s multimedia-saturated concept clicks: Naturally you’d put cameras all over a production of Network. So we can see every inch of his anguished face, magnificent and magnified, as he repeats the words “I’m mad as hell and I’m not going to take it anymore.”\n\nThen, a few minutes later, two characters are having sex in a restaurant and, well…nothing about van Hove’s production works as well as the Cranston close-ups.\n\nTo explain: UBS news division head Max (Tony Goldwyn, just off TV’s soapy Scandal) and Diana (Tatiana Maslany), an ambitious, tough–as–acrylic nails programming exec, are about to rekindle their romance. First, they engage in some flirty banter while walking down the street. West 44th Street, to be specific—just outside the Belasco. You’ll notice the sign for Virgil’s BBQ and the marquee for Head Over Heels in the background, and perhaps a mugging bike messenger on the edge of the frame. The two then walk from 2018 back into the mid-’70s-set play into an on-stage eatery, Foodwork (get it?), filled with real audience members paying a premium to enjoy dinner and drinks within spitting distance of Fitz and Walter White. In the film, the sex scene was funny because Faye Dunaway couldn’t stop talking about rival networks and money and subpoenas even though she was on top of William Holden. Here, it’s laughable because Maslany and Goldwyn are unnervingly close to theatergoers who are either averting their eyes or, on the night I attended, fanning themselves and acting like they’re part of the scene.\n\nWhile we’re on the subject of the restaurant—priced $299–$399, which includes the ticket plus a meal designed by White House executive pastry chef Bill Yosses (he made the yummy pies for the recent off-Broadway Sweeney Todd): Why? Because we’ve morphed into a generation for which dinner and the nightly news are inextricably entwined? There’s already so much commotion on stage: multiple cameramen swirling around; the always-buzzing glass-walled control room, behind which we can see makeup mirrors and a teleprompter (van Hove’s usual collaborator, Jan Versweyveld, designed the ultraslick set); a bank of televisions on the back wall, rolling a constant stream of vintage commercials featuring such icons as Mr. Whipple and Scrubbing Bubbles. A couple rows of people eating shrimp rolls and empanadas seems like an unnecessary distraction.\n\nWhen Cranston is on, we’re completely tuned in. His Beale is a force—commanding, ferocious, dignified, even vulnerable. He’s every inch the “latter-day prophet” and “magnificent messianic figure” that the ratings-hungry Diana turns him into. If only we could change the channel on the Max-Diana story. Maslany and Goldwyn simply don’t set off any sparks, and Goldwyn looks too far too fresh-faced to be playing a “craggy middle-aged man” (even though technically he’s the right age for the role).\n\nOnly Broadway vet Nick Wyman, as corporate honcho Arthur Jensen, matches Cranston’s intensity. His unadorned delivery of Chayefsky’s ode-to-the-almighty-dollar speech envisioning a perfect world—“without war or famine, oppression or brutality—one vast and ecumenical holding company, for whom all men will work to serve a common profit, in which all men will hold a share of stock, all necessities provided, all anxieties tranquilized, all boredom amused”—is a thing of absolute beauty.\n\nWyman’s speech is also beautifully, and simply, staged. Starkly lit. No bells or whistles. It’s a brief, welcome respite from a production that purposely plunges the viewers into pandemonium. “Television is a goddam amusement park,” Beale opines during one of his on-air segments/sermons. “Television is a circus, a carnival, a traveling troupe of acrobats, story tellers, dancers, jugglers, side show freaks, lion-tamers and football players.” (Again, how ahead of his time was Chayefsky? Another of the screenwriter’s prophesies: “There is a whole and entire generation right now who never knew anything that didn’t come out of this tube.… This tube can make or break presidents, popes and prime ministers.”) No wonder van Hove, theater’s great disruptor—last represented on Broadway in 2015–16 with a barefoot View From the Bridge and an extra-witchy Crucible—wants to play ringleader. But when you’re watching a grainy ancient Mazola ad instead of a live actor, the background noise is getting way too loud.\n\nNetwork opened Dec. 6, 2018, and runs through June 8, 2019, at the Belasco Theatre. Tickets and information: networkbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "show-score-playwright"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "showScoreExcerpt": "\"Nothing about van Hove’s production works as well as the Cranston close-ups...There’s already so much commotion on stage...A couple rows of people eating shrimp rolls and empanadas seems like an unnecessary distraction. When Cranston is on, we’re completely tuned in. His Beale is a force...Only Broadway vet Nick Wyman matches Cranston’s intensity...But when you’re watching a grainy ancient Mazola ad instead of a live actor, the background noise is getting way too loud.\"\n\nRead more"
}