{
  "showId": "network-2018",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2018/12/06/theater/network-review-bryan-cranston.html",
  "publishDate": "December 7, 2018",
  "fullText": "https://www.nytimes.com/2018/12/06/theater/network-review-bryan-cranston.htmlShare full article27Advertisement\n\nFor your sins, Bryan Cranston is all but flaying the skin off his body, night after night at the Belasco Theater. It is a demanding undertaking, both painful and rigorously skilled. And if you’re a glutton for great, high-risk acting, you owe Mr. Cranston the courtesy — and yourself the thrill — of watching his self-immolation in “Network,” which opened on Thursday.\n\nMr. Cranston is portraying Howard Beale, a grand old newscaster who becomes a martyr to the inhumanity of television, in this churning, immersive stage adaptation — directed to overwhelm by Ivo van Hove — of the passionately remembered 1976 movie. Howard Beale, you may recall, is the role that won Peter Finch an Oscar.\n\nBut as fine as Finch was, his Howard remained a dutiful pawn in the bigger satirical scheme of the writer Paddy Chayefsky’s take on corporate greed and a tube-addicted nation. Mr. Cranston, as befits someone portraying an unbiddable maverick, tears through the formulas of Lee Hall’s Chayefsky-honoring script to create a raging, bleeding portrait of a man who is a creature and a captive of a satanic medium.\n\nIf the bravura dementia of his Howard makes much of the rest of the show seem as two-dimensional as a flat TV screen, it’s a trade-off I’m willing to accept, albeit with a sigh. Though he won a Tony Award playing Lyndon Baines Johnson in “All the Way” — and an Olivier for his Beale at London’s National Theater — Mr. Cranston became a surprising midcareer star on television, in the genial sitcom “Malcolm in the Middle” and the savage meth opera “Breaking Bad.”\n\nIn other words, he knows from multiple cameras and how to seduce, confront and bond with them. What better qualifications to embody a man who has no sense of who he is when he’s not on the screen?\n\nThus Mr. Cranston’s true co-star in “Network” turns out to be neither of the show’s other marquee names, the very capable Tony Goldwyn and Tatiana Maslany. His chief wrestling, dancing and romantic partner here is the assaultive, tireless technology of the physical production.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Mr. Cranston's Howard Beale is a man whose sanity cracks open to reveal not madness but a deeper, more frightening lucidity about the world around him.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "For your sins, Bryan Cranston is all but flaying the skin off his body, night after night at the Belasco Theater. It is a demanding undertaking, both painful and rigorously skilled. And if you're a glutton for great, high-risk acting, you owe Mr. Cranston the courtesy - and yourself the thrill - of watching his self-immolation in \"Network,\" which opened on Thursday.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Did-Critics-Think-Of-Bryan-Cranston-In-NETWORK-On-Broadway-20181206",
  "showScoreExcerpt": "Mr. Cranston's Howard Beale is a man whose sanity cracks open to reveal not madness but a deeper, more frightening lucidity about the world around him.",
  "contentTier": "complete",
  "contentTierReason": "Short text (26 words)",
  "textQuality": "full",
  "playbillVerdictUrl": "http://www.nytimes.com/2017/11/14/theater/network-review-bryan-cranston-national-theater.html",
  "sources": [
    "web-search",
    "show-score-playwright",
    "playbill-verdict",
    "bww-roundup"
  ],
  "previousUrl": "https://www.nytimes.com/2018/12/07/theater/network-review-bryan-cranston.html",
  "urlDiscoveredAt": "2026-02-06T08:04:07.490Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 376,
  "archivePath": "data/archives/reviews/network-2018/nytimes--ben-brantley_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:04:07.493Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 376,
  "tierReason": "Full review text"
}