{
  "showId": "paradise-square-2022",
  "outletId": "amny",
  "outlet": "AM New York (Matt Windman)",
  "criticName": "Matt Windman",
  "url": "https://www.amny.com/entertainment/broadway-review-not-exactly-a-ticket-to-paradise-square/",
  "playbillVerdictUrl": "https://www.amny.com/entertainment/broadway-review-not-exactly-a-ticket-to-paradise-square/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "In an ideal world, the original new Broadway musical 'Paradise Square' would live up to its fascinating historical source material: the 19th century Lower Manhattan slum of Five Points, where free Blacks and immigrants lived together up until the Civil War. Although well-meaning and filled with some striking visuals and pointed political commentary, 'Paradise Square' is sappy, overstuffed, overlong, and tiresome. If not much else, 'Paradise Square' might be an ideal show for educators who want to take their students to a Broadway musical about U.S. history but can't score tickets to 'Hamilton.' As a homework assignment, the students can research the numerous historical events that are dutifully mentioned or write an essay about the contemporary political concerns (violent insurrection, cultural misappropriation, class tensions, need for empathy).that the show overemphasizes in trying to prove its relevance.",
  "bwwScore": 4,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PARADISE-SQUARE-Opens-on-Broadway-Updating-Live-20220403",
  "showScoreExcerpt": "\"Although well-meaning and filled with some striking visuals and pointed political commentary, 'Paradise Square' is sappy, overstuffed, overlong, and tiresome...Its best moments involve large, striking tableaux and full-bodied, expressive modern dance choreography by Bill T. Jones. On the other hand, the book (credited to no less than three writers) is a labored mess, and the score (credited to no less than four writers) is a strange amalgam of bombastic pop, 19th century minstrel songs, gospel, and Irish folk...If not much else, 'Paradise Square' might be an ideal show for educators who want to take their students to a Broadway musical about U.S. history but can’t score tickets to 'Hamilton.'\"\n\nRead more"
}