{
  "showId": "paradise-square-2022",
  "outletId": "broadwaynews",
  "outlet": "Broadway News",
  "criticName": "Diep Tran",
  "url": "https://broadwaynews.com/2022/04/03/review-joaquina-kalukango-elevates-an-ambitious-paradise-square/",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "The musical's score, an impressive mixture of Irish jigs, 19th century work songs and jazz, reinforces the musical's themes of racial harmony and racial division, while driving the show's energy forward. One group number, 'Why Should I Die in Springtime,' in which the Irish characters lament having to fight in the Civil War, is immediately answered by 'I'll Be a Soldier,' in which the Black characters declare they would fight if America would let them. It's a brilliant battle in musical form. Bill T. Jones's expansive choreography similarly takes on these themes. Jones combines Irish step dancing, tap dancing, modern break dancing and Haitian Yanvalou, yet creates distinctive dances for the Irish characters and the Black characters. The result is character-motivated choreography that is astounding in its density and gorgeous in appearance.",
  "bwwScore": 6,
  "contentTier": "excerpt",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PARADISE-SQUARE-Opens-on-Broadway-Updating-Live-20220403",
  "showScoreExcerpt": "\"Yes, 'Paradise Square' is a bloated, melodramatic musical that could cut 20 minutes off its 2-hour-and-40 minute run time. But as Kalukango sang, I felt that I was watching Broadway history in the making — in years to come, those of us who were in the room will gush, smugly, 'I was there when Joaquina Kalukango tore the roof down at the Barrymore Theatre'...You don’t have to think too hard to understand the class and race parallels between 1863 and 2022, and the musical smartly lets the audience fill in those blanks...'Paradise Square' is the kind of new musical that Broadway needs more of: an original story that is ambitious, moving and entertaining, with a diverse cast singing in formidable harmony.\"\n\nRead more"
}