{
  "showId": "paradise-square-2022",
  "outletId": "deadline",
  "outlet": "Deadline",
  "criticName": "Greg Evans",
  "url": "https://deadline.com/2022/04/paradise-square-broadway-review-garth-drabinsky-1234993076/",
  "playbillVerdictUrl": "https://deadline.com/2022/04/paradise-square-broadway-review-garth-drabinsky-1234993076/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Paradise Square comes very close to saving itself from its own impulses - not least from a theatrically disappointing climax of a brief, unterrifying and bloodless riot - by giving star Kalukango the evening's single greatest moment of glory: a powerhouse anthem of anger and defiance called 'Let It Burn,' in which this wonderful singer castigates the rioters and the destroyers and taunts that the human spirit can survive the destruction of ramshackle structures. As a battle tactic, 'Let It Burn' falls a good deal short, but as a vocal exercise for an astonishing singer, the number is a treasure (and might very well hand Kalukango a Tony Award nomination that might otherwise have missed her).",
  "bwwScore": 4,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PARADISE-SQUARE-Opens-on-Broadway-Updating-Live-20220403",
  "showScoreExcerpt": "\"Some bluntly stated distancing from Foster’s music infuses 'Paradise Square' with no small amount of anachronistic debate over cultural appropriation – arguments that would have been so much more enticing if the musical was self-reflective enough to consider its own many artistic liftings...'Paradise Square'...has an unfortunate, even disastrous, tendency to lay blame on its cartoon villains rather than the murky depths of its good-natured common folk...'Paradise Square' comes very close to saving itself from its own impulses...by giving star Kalukango the evening’s single greatest moment of glory: a powerhouse anthem of anger and defiance.\"\n\nRead more"
}