{
  "showId": "paradise-square-2022",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2022/04/03/theater/paradise-square-review.html",
  "publishDate": "April 4, 2022",
  "fullText": "https://www.nytimes.com/2022/04/03/theater/paradise-square-review.htmlShare full article51Advertisement\n\nEverything in “Paradise Square” is true. Nothing in “Paradise Square” is true.\n\nYes, history shows that in 1863, after Abraham Lincoln extended the Civil War draft to include all white men between the ages of 25 and 45 — Black men being excepted because they were not considered citizens — mobs of disgruntled Irish Americans rose up against Black people in New York, burning buildings and killing many in their path.\n\nAnd it’s true that in the impoverished, piano-shaped district of downtown Manhattan called Five Points, some Black and Irish neighbors who had been living together in relative harmony joined forces to resist the mobs.\n\nBut in hammering these large-scale events into individual stories, and in manipulating them so performers have reason to sing at top volume and dance nearly nonstop, the uplifting, star-making, overwrought new musical, which opened on Sunday at the Ethel Barrymore Theater, turns history on its head. Racism becomes an individual character flaw instead of a systemic evil; resistance, the solitary moral genius of a hero.\n\nIn this case, the hero is Nelly O’Brien, or really Joaquina Kalukango, who plays her with enough guts, stamina and vocal bravura to make you believe in a character glued together from the shavings of history. Nelly is the proprietor of a (fictional) Five Points bar and brothel called Paradise Square: “a little Eden” where, as one of the bald lyrics by Nathan Tysen and Masi Asare puts it in the title song, “We love who we want to love/with no apology.”\n\nIndeed, Nelly is married to the Irish American Willie O’Brien (Matt Bogart, suitably strapping). His sister (and Nelly’s best friend), Annie Lewis (Chilina Kennedy, absurdly fierce), is married to a Black minister, the Rev. Samuel Jacob Lewis (Nathaniel Stampley). When Annie’s nephew Owen (A.J. Shively) arrives from Ireland, around the same time that Samuel, a stationmaster on the Underground Railroad, brings Washington Henry (Sidney DuPont) to Paradise Square en route from Tennessee to Canada, the joint begins to seem like a rooming house for incendiary plot points.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Despite a talented cast and admirable ambitions, 'Paradise Square' is a musical that doesn't quite know what it wants to be, juggling too many themes without fully developing any of them.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Despite a talented cast and admirable ambitions, 'Paradise Square' is a musical that doesn't quite know what it wants to be, juggling too many themes without fully developing any of them.",
  "contentTier": "complete",
  "contentTierReason": "Short text (31 words)",
  "textQuality": "full",
  "previousUrl": "https://www.nytimes.com/2022/04/04/theater/paradise-square-review.html",
  "urlDiscoveredAt": "2026-02-04T00:33:40.196Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 366,
  "archivePath": "data/archives/reviews/paradise-square-2022/nytimes--jesse-green_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:33:40.199Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250722214625",
  "archiveOrgUrl": "http://web.archive.org/web/20250722214625/https://www.nytimes.com/2022/04/03/theater/paradise-square-review.html",
  "wordCount": 366,
  "tierReason": "Full review text"
}