{
  "showId": "paradise-square-2022",
  "outletId": "thewrap",
  "outlet": "The Wrap",
  "criticName": "Robert Hofler",
  "url": "https://www.thewrap.com/paradise-square-broadway-review-garth-drabinsky-moises-kaufman/?utm_source=dlvr.it&utm_medium=twitter",
  "playbillVerdictUrl": "https://www.thewrap.com/paradise-square-broadway-review-garth-drabinsky-moises-kaufman/?utm_source=dlvr.it&utm_medium=twitter",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "In 'Paradise Square,' which opened Sunday at the Ethel Barrymore Theater, sex workers and their madam, Nelly (Joaquina Kalukango), come bubble-wrapped with enough important issues to placate the most hardened moralist. The credits reveal that the show is 'inspired in part by the songs of Stephen Foster.' The songwriter gets no thanks from the book writers, who deem his music racist. Actually, the little bit we hear of those simple Foster ditties is a relief from the bloated tunes surrounding them. Whether the characters are happy or sad, pissed off or just in a funk, they're simply thunderous when they sing. Best of the songs is Nelly's fiery 'Let It Burn,' not to be confused with 'Let It Go' from 'Frozen.' How much more effective it would be if not preceded by so much aural bombast.",
  "bwwScore": 5,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PARADISE-SQUARE-Opens-on-Broadway-Updating-Live-20220403",
  "showScoreExcerpt": "\"Those sex workers and their madam, Nelly (Joaquina Kalukango), come bubble-wrapped with enough important issues to placate the most hardened moralist...Moises Kaufman’s direction doesn’t so much meld these dances into the narrative as set them aside as show-stopping numbers. The plus here is that the chorus doesn’t sing much when they’re dancing...'Paradise Square' has so many big issues crammed into it that the book writers (Christina Anderson, Craig Lucas and Larry Kirwan) leave no room for characters.\" \n\nRead more"
}