{
  "showId": "paradise-square-2022",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Helen Shaw",
  "url": "https://www.vulture.com/2022/04/paradise-square-broadway-theater-review.html",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "There is one good thing about the way Paradise Square has been developed into the ground: The ensemble members have had plenty of time to figure out their parts. Allen Moyer's tall, skeletal tenement set gives the two-dozen-strong cast plenty of places to stand, so director Moisés Kaufman often puts them on various levels, staring down at the floor of the bar. If the repetitive elements pall - you will start out amazed by the dancers, then those returns will diminish - you could always cast your eyes up, into the shadows. I had several favorites among the supernumeraries, including a guy who brought his baby to watch the competition and a mandolin player who fell asleep. Appropriately for a show about a neighborhood, the chorus gives us a sense of lives and passions moving just out of the field of focus.",
  "bwwScore": 4,
  "contentTier": "needs-rescrape",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-PARADISE-SQUARE-Opens-on-Broadway-Updating-Live-20220403",
  "showScoreExcerpt": "\"Dance and history and race and loss tempered with hope — what a subject for a musical this would be, if only 'Paradise Square' had managed to theatricalize it. There’s room for it in its two hours and 45 minutes, but the gluey (and clearly glued-together) book by Christina Anderson, Craig Lucas, and Larry Kirwan uses the real setting and events without, somehow, actually telling their story...Now, Kalukango herself is amazing...The plot, though, wouldn’t miss her. Cut the part, and the story wouldn’t change.\"\n\nRead more",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nFrom Paradise Square, at the Ethel Barrymore. Photo: Kevin Berne/Handout At some point in 19th century New York, tap dancing (or something like it) was born. It was a little of this, a little of that: In the rough-and-tumble Five Points district, Black and Irish New Yorkers competed in “cutting” challenges, trading steps and rhythms from sean-nós dance and clogging to the buck-and-wing and juba. In these unsegregated bars and brothels and dance halls — and in squalid conditions — the city developed an art form, not to mention a pocket of interracial quasi-harmony. In 1863, when chaotic anti-draft demonstrations turned into a vicious race riot, white terrorism raged for five days uptown and downtown. But in the Five Points, where some neighbors protected each other, the mobs were pushed back.\n\nDance and history and race and loss tempered with hope — what a subject for a musical this would be, if only Paradise Square had managed to theatricalize it. There’s room for it in its two hours and 45 minutes, but the gluey (and clearly glued-together) book by Christina Anderson, Craig Lucas, and Larry Kirwan uses the real setting and events without, somehow, actually telling their story. Production queasiness is part of the problem, as is the script’s upside-down logic. Corruption-by-a-thousand-fixes accounts for the rest.\n\nNelly Freeman (Joaquina Kalukango) runs the Paradise Square saloon in Five Points, and we meet her on a teary evening as her husband Willie O’Brien (Matt Bogart) is about to depart for the Civil War. Freeborn Nelly and her Irish sister-in-law Annie (Chilina Kennedy) are what was then called “amalgamationists” — women in interracial marriages — which has bound them tightly together.\n\nShow \n 1 Comment / 1 New\n \n Comment\n \n\n The Multiple Original Sins of Paradise Square\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.\n\n1/1\n\nSkip Ad\n \nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n \n \n Most Popular\n \n\n \n \n \n \n Heated Rivalry’s Cinematographer Shot the Show for the Meme-Makers\n \n \n \n \n \n \n Cinematrix No. 682: February 6, 2026\n \n \n \n \n \n \n Musicians Are Fleeing Kid Rock’s ‘Rock the Country’ Festival\n \n \n \n \n \n \n The Pitt Recap: A Real Lifesaver\n \n \n \n \n \n \n Every Single Thing Happening at the 2026 Winter Olympics Opening Ceremony\n \n \n \n \n\n \n \n \n \n Heated Rivalry’s Cinematographer Shot the Show for the Meme-Makers\n \n \n \n \n \n \n The Real Housewives of Beverly Hills Recap: A Dinner to Re-mem-ber\n \n \n \n \n \n \n Cinematrix No. 682: February 6, 2026\n \n \n \n \n \n \n The Pitt Recap: A Real Lifesaver\n \n \n \n \n \n \n The Traitors Recap: The Art of War\n \n \n \n \n\n \n\n \n \n \n\n \n \n\n \n\n \n \n\n \n\n \n \n \n \n \n \n \n\n \n \n Email\n \n \n\n \n \n You\\'ll receive the next newsletter in your inbox.\n \n \n *Sorry, there was a problem signing you up.",
  "isFullReview": true,
  "textWordCount": 442,
  "archivePath": "data/archives/reviews/paradise-square-2022/vulture--helen-shaw_2026-02-07.html",
  "textFetchedAt": "2026-02-07T09:23:20.045Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "wordCount": 442,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T11:18:24.566Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This text appears to be a corrupted web page with navigation elements, ad copy, newsletter signup prompts, and unrelated content mixed in. The actual review content is fragmentary and incomplete.; openai: The text contains navigation menus, ad copy, and other non-article content, making it not scoreable.",
  "promptVersion": "5.2.0"
}
