{
  "showId": "ragtime-2025",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Ragtime/1330",
  "publishDate": "October 16, 2025",
  "fullText": "Ever since its publication in 1975, E.L. Doctorow's seminal novel \"Ragtime,\" as well as its many iterations, have consistently been a reminder of how far we've come as a nation and an indictment of how far we still must travel to achieve equal rights for all races, classes and genders.\n\nIf one felt that message quite strongly when Terrence McNally, Lynn Ahrens and Stephen Flaherty's superb musical adaptation first appeared on Broadway in 1998, it now gnaws even deeper in your bones as you watch Lear deBessonet's dramatically and musically magnificent revival, now being presented by Lincoln Center Theater at the Vivian Beaumont Theater (after a two-week run last year at New York City Center).\n\nA glistening panorama of American life, both hopeful and melancholy, \"Ragtime\" brilliantly intertwines the lives of a WASPY New Rochelle family, a group of African American Harlem residents -- most notably the pianist-turned-revolutionary Coalhouse Walker Jr. --and an immigrant Jewish father and his nameless daughter in turn-of-the-century New York. In doing so, the show deftly highlights that era's fear and hatred of the \"other\" -- something that plagues our society over 100 years later.\n\nStill, you may be too distracted by the wonderful Flaherty-Aherns score, not to mention the truly terrific performances of the show's three leading players, to really think about the show's politics until after you leave the theatre. First and foremost is the amazing Joshua Henry, whose operatic baritone soars during the iconic \"Wheels of a Dream,\" his duet with his lady love Sarah (an excellent Nichelle Lewis), and the stirring aria \"Make Them Hear You.\" The actor also somehow makes Coalhouse's violent actions in the second act, often drastic and arguably immoral, quite understandable.\n\nAs the WASP family's nameless \"Mother,\" Caissie Levy is simply stunning as she portrays a woman caught between two centuries – and two ways of thinking and living (especially when she impulsively takes in the barely-breathing \"Negro\" baby that Sarah has been buried in her garden). Not a classic soprano like most of her stage predecessors in this role, Levy is nevertheless a powerful singer and, more importantly, a brilliant interpreter of lyrics. Indeed, her belt-to-the heavens ending of her powerful Act 2 number \"Back to Before\" is literally soul-shaking.\n\nTony Award winner Brandon Uranowitz brings a remarkable blend of joy and sorrow to Tateh, the Jewish Latvian immigrant who finds an American nightmare before he reaches the American dream. He uses his strong expressive voice to maximum effect on the haunting \"Success\" as well as the more light-hearted \"Gliding\" and \"Buffalo Nickel Photoplay Inc.\"\n\nIf the leads do the heaviest lifting, every cast member pulls his or her weight. For example, take the appealing Ben Levi Ross as Mother's troubled Younger Brother, who eventually joins Coalhouse in his quest for \"justice,\" a stalwart Colin Donnell as her stick-in-the-mud husband, the hilarious Tom Nelis as her crochety father, and Nick Barrington as the couple's wiser-than-his-years son Edgar. Talk about painting a family portrait!\n\nFurther, the brilliance of the show's book can be seen in how smartly and seamlessly it incorporates many real-life figures of the era, including the fiery activist Emma Goldman (a spunky Shaina Taub), self-absorbed vaudeville star Evelyn Nesbit (the off-kilter Anna Grace Barlow), sanctimonious educator Booker T. Washington (an excellent John Clay III), famed illusionist Harry Houdini (a beguiling Rodd Cyrus), and mega-industrialists J.P, Morgan (a blustery John Rapson) and Henry Ford (a fine Jason Forbach).\n\nAlthough many people may recall the opulence of the original Broadway production, this more minimalist version is frankly more effective, allowing one to focus on the plot and the performances. David Korins' set is decidedly but intelligently spare, relying primarily on two large stepladders and a few well-chosen set pieces (including a Model T Ford). Linda Cho's period costumes are quite impressive. Adam Honore's lighting design and 59 Studio's projection designs both help fill the vast Beaumont stage. Finally, Ellenore Scott's spot-on choreography is thoughtful and often makes up for the lack of scenery.\n\nYes, it's sad that 2025 proves to be the right time for \"Ragtime,\" but that doesn't mean you should pass up the chance to witness this truly unforgettable production.",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": null,
  "source": "webfetch-scraped",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-24T00:10:00.000Z"
}
