{
  "showId": "ragtime-2025",
  "outletId": "new-york-theatre-guide",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/ragtime-broadway-review",
  "publishDate": "2025-10-16T23:01:45-04:00",
  "fullText": "Read our review of Ragtime on Broadway, Lincoln Center Theater's revival of the award-winning 1998 musical now starring Caissie Levy, Joshua Henry, and Brandon Uranowitz. Among the joys of seeing Ragtime at Lincoln Center Theater are the striking visual reminders of where evocative theatrical magic can take you in this sprawling early-1900s story that revolves around three distinct yet intersecting groups: well-off white Mother (Caissie Levy) and Father (Colin Donnell), Latvian Jewish immigrant Tateh (Brandon Uranowitz), and Black musician Coalhouse Walker Jr. (Joshua Henry) and his love, Sarah (Nichelle Lewis). As such, we land at an upscale home in New Rochelle, conjured by a tree and a floating gable. The deck of a ship, courtesy of boarding stairs rolled into place. Ellis Island, courtesy of an image of the Statue of Liberty. A beach in Atlantic City, rendered by a huge, pillowy cloud billowing over a woman’s head (okay, this scene actually looks a little strange), and more. In director Lear deBessonet’s stirring new Broadway production, first seen in 2024 at New York City Center, these minimalist yet striking scenic design elements by David Korins help achieve a vital balance. They contrast the sweeping scale of the musical saga writ large, if not extra-large, by Terrence McNally (book), Stephen Flaherty (music), and Lynn Ahrens (lyrics). The bare-bones staging keeps the focus squarely where it counts: on the cast of nearly 40, who are uniformly topflight and in sync when it comes to sparking emotional electricity. The simplicity of the production provides breathing room in a megamusical that often exhilarates, but also drains because of its tendency to always think bigger. Yes, the show soars during several thrilling power ballads and group numbers like the title song, “New Music,” “Wheels of a Dream,” and “Back to Before.” But by the 3-hour mark, the steady procession of emphatic and declamatory numbers becomes a sort of sonic wallpaper that loses impact. As an audience member, I always fall prey to Ragtime’s power-anthem overload; it has happened during all three Broadway runs. It’s a broad story canvas stretched to the max, but the performances are uniformly tight and persuasive. Amid the three main narratives — of the fictional Mother, Coalhouse, and Tateh — are those of icons like Houdini (who descends from the ceiling into the action), Booker T. Washington, and Henry Ford for historical heft. As a privileged wife restless to break out from her rigid prescribed role, Levy’s down-to-earth portrait makes her the show's MVP. Henry and Uranowitz are reliably excellent as two men with markedly different fates. Shaina Taub sets off bright sparks in the supporting role of real-life anarchist Emma Goldman, while Ben Levi Ross makes a big impression as Mother’s idealistic Younger Brother. As the characters’ lives collide, a world wracked by racism, anti-immigrant hate, social inequality, and violence comes into unsettling view. You don’t have to squint to see Ragtime’s enduring relevance. That’s a great thing about the show, though not about the state of current events. Based on the 1975 novel Ragtime by E.L. Doctorow, the musical interlaces three main stories of early-1900s New Yorkers: a white upper-class family’s shifting life, Black pianist Coalhouse Walker Jr.’s fight for justice, and immigrant Tateh’s rise from poverty to success. The stories reflect America’s social and cultural upheavals of the time, but the show’s themes of justice, identity, and hope make it timeless. Ragtime at Lincoln Center Theater marks the show’s third Broadway run, following its 1998 premiere and 2009 revival. The vast stage of the Vivian Beaumont Theater is dark and bare save for two striking images as you take your seat at Ragtime. The show’s title in neon (did we need sign to remind us?) is one of them. The other is an upright piano, which is key to the story. At one point, the instrument is declared out of tune — a fitting symbol for an America torn by racism, inequality, and divisiveness as shown on stage. Set in the early 20th century, it speaks to 2025 with the urgency and topicality of headline news. At Show-Score, the online theatre review aggregator, Ragtime earned an impressive 96% approval rating from audience members in the run-up to opening night. Read more audience reviews of Ragtime on Show-Score. Between its robust score, showcase moments for the cast, and evergreen resonance, Ragtime is easy to heartily recommend. Learn more and get Ragtime tickets on New York Theatre Guide. Ragtime is at the Vivian Beaumont Theater. Photo credit: Ragtime on Broadway. (Photos by Matthew Murphy) Ragtime is playing at Vivian Beaumont Theater - Lincoln Center Theater. The theatre is located at 150 West 65th Street, New York, 10023. The running time of Ragtime is 2hr 45min. Incl. 15min intermission. Book tickets for Ragtime on New York Theatre Guide. The recommended age for Ragtime is Ages 10+. Children under the age of 5 are not permitted.. Ragtime is a sprawling story of New York at the dawn of the twentieth century as three families from different backgrounds collide in search of the American Dream. The songs feature music inspired by the ragtime genre itself along with soaring solos, duets, and big ensemble numbers including \"New Music,\" \"Til We Reach That Day,\" \"Journey On,\" \"Back to Before,\" and \"Wheels of a Dream.\" Ragtime is written by a trio of venerable Broadway legends: a lush score by Stephen Flaherty and Lynn Ahrens and a stirring book by Terrence McNally. Tony Award nominee Lear deBessonet directs, marking her inaugural production as Lincoln Center Theater's new Artistic Director. Ragtime features children in the show, though it does cover themes of death and racism. Children must be four and over to enter Broadway shows. Ragtime is a musical theatre classic, winner of multiple Tony Awards, and epic look at American life. It features a grand score and is sure to thrill audiences with its starry cast. Originally published on Oct 16, 202523:00",
  "isFullReview": false,
  "bwwExcerpt": "The bare-bones staging keeps the focus squarely where it counts: on the cast of nearly 40, who are uniformly topflight and in sync when it comes to sparking emotional electricity. The simplicity of the production provides breathing room in a megamusical that often exhilarates, but also drains because of its tendency to always think bigger.     Matthew Wexler, One-Minute Critic: Ragtime, one of the great musical theater scores of the late 20th century, steps up to bat on Broadway in its third major production. And if some of its design elements feel sparse in Lincoln Center Theater’s 1,050-seat Vivian Beaumont, its glorious cast of 34 and “the music of something beginning” land with a visceral impact that marks a uniquely American art form.      Rob Weinert- Kendt, America Magazine: Still, the mantle of “relevance” is a heavy thing to lay on a Broadway musical. An earlier version of this same staging, also by director Lear deBessonet, ran at the Encores! series last November in the weeks before and after the U.S. presidential election, and depending on when audiences saw it, they felt either the show’s bursts of hope or its cries of despair with a fresh immediacy. Seen now, it plays less like a reflection of the breaking news outside the theater’s doors than like a dead-serious fable, speaking not so much to our precise present moment as to the perennial national questions this moment raises.     Brian",
  "showScoreExcerpt": "\"The simplicity of the production provides breathing room in a megamusical that often exhilarates, but also drains because of its tendency to always think bigger.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-RAGTIME-Returns-to-Broadway-20251016",
  "textStatus": "complete",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.987Z",
  "textWordCount": 985,
  "textFetchedAt": "2026-01-25T14:29:20.073Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/ragtime-2025/new-york-theatre-guide--joe-dziemianowicz_2026-01-25.html"
}