{
  "showId": "ragtime-2025",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "https://newyorktheater.me/2025/10/16/ragtime-broadway-review/",
  "publishDate": "2025-10-16T23:01:45-04:00",
  "fullText": "The revival of “Ragtime” has taken on more of the epic feel to which it aspires, thanks to its move from an Encores series concert to a full Broadway production on the Vivian Beaumont’s grander stage, turning an already superb production into a sumptuous spectacle. The opening number, “Prologue: Ragtime,” shows the entire cast ascending dramatically through a trap door; Harry Houdini plummeting spectacularly from the fly space; the new group of Jewish immigrants walking poignantly in a circle on the turntable (mirroring how the Jewish emigrants wind up at the end of “Fiddler on the Roof”): Ellenore Scott’s choreography has more room to tell its own wordless stories. Director Lear deBessonet, who was artistic director at Encores when she oversaw the musical’s 12-day run at New York City Center a year ago, has chosen a 12-week run of “Ragtime” to be her first show as the new artistic director of Lincoln Center Theater, keeping the cast and most of the design team intact (There is new set by David Korins and new projections by 59 Studio.) If anything, this musical adaptation of E.L. Doctorow’s novel about the cultural and political upheavals in the New York of the early 1900s, feels even more timely in the midst of the cultural and political upheavals in the America of 2025.There are some astonishing echoes of current moments in a script that dates back to the original 1998 production. Mother’s climactic song contains the refrain: “We can never go back to before.” (echoing one of Kamala Harris’ main campaign slogans.) Tateh arrives in a “rag ship,” which Admiral Peary explains is loaded with “immigrants from every cesspool in western and eastern Europe.” (echoing Donald Trump’s denigration of immigrants’ countries of origin.) Mother (Caissie Levy), Tateh (Brandon Uranowitz) and Coalhouse Walker Jr. (Joshua Henry) are the three fictional protagonists in “Ragtime” who are meant to be representative of the era, and, by extension, of America. Each evolves over the course of the story in ways that Doctorow might have argued is quintessentially American. (Spoiler alert for the next three short paragraphs, although I try to keep the evolution vague for the few of you who have never read the best-selling novel, watched the 1981 Oscar-winning movie or caught any of the previous stage productions, including two on Broadway ) Mother starts off living an affluent White Protestant family life in New Rochelle. She “often told herself how fortunate she was to be so protected and provided for by her husband,” she says of herself in the opening number. Father (Colin Donnell) is himself so evidently a stand-in for America that he got rich by selling American flags and Fourth of July fireworks. Mother’s journey is toward greater independence – emotionally, politically, and physically. Tateh, a poor Jewish immigrant from Latvia who “dreamed of a new life for his little girl,” begins a street cart peddler selling pictures made from paper cut-outs. He reinvents himself, marries outside his faith, becomes part of a new American industry that continually reinvents America, defining it for Americans and for the rest of the world. Coalhouse Walker Jr., a ragtime pianist, begins by providing the music that the people of Harlem danced and reveled to, so that they could “forgot their troubles.” He winds up taking up arms to battle all the troubles of Black America after experiencing a humiliating incident of racism. These storylines, which cross-pollinate in engagingly pulpy ways, are ably adapted by librettist Terrence McNally from Doctorow’s 1975 novel. They have always struck me as more a reflection of the trends and movements of the 1960s and the 1970s (feminism, Black power, intermarriage) than an accurate depiction of the early 1900s. That “Ragtime” is trying to say something epic about America is hard to avoid (To make sure you don’t miss this, it even throws in an out-of-nowhere song about baseball.) But in watching the musical once more, it suddenly occurred to me that “Ragtime” is as much an embodiment of American values, for better and for worse, as a depiction or commentary about them. It serves up violence as entertainment. It treats pop culture as culture. It idolizes fame, conflating celebrity with history – there are cameos of Henry Ford, Houdini, J.P. Morgan, Evelyn Nesbit, Admiral Peary, Stanford White; somewhat larger roles for Booker T. Washington (John Clay III) and Emma Goldman (stand-out Shaina Taub.) And – most American of all? — it apparently sees itself as of epic importance: How else to explain its three-hour running time, its 48 actors and 28 musicians, its operatic (implausible) resolutions; its largely stentorian score (Is it just me, or, out of almost three dozen musical numbers, is there surprisingly little ragtime music in a musical entitled “Ragtime”?) None of this took away from my enjoyment of “Ragtime,” and not just because I, too, am American. As at Encores, the three principal cast members carry us through the swirl and the sprawl, with their credible, impassioned performances and their golden voices; it helps that each is given some of composer Stephen Flaherty’s most distinctive songs, reflecting their character’s individual personality and culture. One can question whether “Ragtime” will be considered one of the great American musicals and still feel grateful to have been able to witness Joshua Henry, the Baritenor of Broadway, deliver a shattering “Make them hear you.” RagtimeLincoln Center’s Vivian Beaumont Theater through January 4 Update: Extended to June 14, 2026Running time: 2 hours 45 minutes, including one intermissionTickets: $114 – $341Book by Terrence McNally Music by Stephen FlahertyLyrics by Lynn AhrensDirected by Lear deBessonetOrchestrations by William David BrohnBased on the novel Ragtime by E.L. DoctorowChoreography by Ellenore ScottSet design by David Korins, costume design by Linda Cho, lighting design by Adam Honoré and Donald Holder, sound design by Kai Harada, hair and wig design by Tom Watson, sensitivity specialist Ann JamesCast: Joshua Henry as Coalhouse Walker Jr., Caissie Levy as Mother, Brandon Uranowitz as Tateh, Colin Donnell as Father, Nichelle Lewis as Sarah, Ben Levi Ross as Mother’s Younger Brother, Shaina Taub as Emma Goldman, John Clay III as Booker T. Washington, Rodd Cyrus as Harry Houdini, Anna Grace Barlow as ‘Evelyn Nesbit,’ Nick Barrington as ‘The Little Boy,’ Tabitha Lawing as ‘The Little Girl.’ Ensemble members Nicholas Barrón, Lauren Blackman, Briana Carlson-Goodman, Jordan Chin, Billy Cohen, Rheaume Crenshaw, Charity Angél Dawson, Ellie Fishman, Jason Forbach, Ta’Nika Gibson, David Jennings, Kaleb Johnson, Marina Kondo, Morgan Marcell, Kane Emmanuel Miller, Tom Nelis, Kent Overshown, Kayla Pecchioni, John Rapson, Deandre Sevon, Jacob Keith Watson, and Alan Wiggins. Swings and off-stage understudies: Eean Sherrod Cochran (dance captain), Kerry Conte, Nick Gaswirth, Jackson Parker Gill, Jenny Mollet, Matthew Scott, and Ellie May Sennett. Watch Broadway at the Thanksgiving Day Parade 2025November 27, 2025In \"anniversary\" Broadway Week 2-for-1 Tickets On Sale NowJanuary 13, 2026In \"New York Theater\" Top 10 Lists of Top 10 NYC Theater in 2025: Liberation is number 1December 16, 2025In \"Best\"",
  "bwwExcerpt": "As at Encores, the three principal cast members carry us through the swirl and the sprawl, with their credible, impassioned performances and their golden voices; it helps that each is given some of composer Stephen Flaherty’s most distinctive songs, reflecting their character’s individual personality and culture. One can question whether “Ragtime” will be considered one of the great American musicals and still feel grateful to have been able to witness Joshua Henry, the Baritenor of Broadway, deliver a shattering “Make them hear you.” Average Rating: 82.4% { \"@context\":\"https://schema.org\", \"@type\":\"LiveBlogPosting\", \"@id\":\"/article/Review-Roundup-RAGTIME-Returns-to-Broadway-20251016\", \"about\":{ \"@type\":\"Event\", \"startDate\":\"2025-10-16T11:01:45-05:00\", \"name\":\"Review Roundup: RAGTIME Returns to Broadway\", \"eventAttendanceMode\": \"https://schema.org/OnlineEventAttendanceMode\", \"location\": { \"@type\": \"VirtualLocation\", \"url\": \"/article/Review-Roundup-RAGTIME-Returns-to-Broadway-20251016\" } }, \"coverageStartTime\":\"2025-10-16T11:01:45-05:00\", \"coverageEndTime\":\"2025-10-17T02:01:45-05:00\", \"headline\":\"Review Roundup: RAGTIME Returns to Broadway\", \"description\":\"The curtain rises tonight on Ragtime, opening at the Vivian Beaumont Theater as Artistic Director Lear deBessonet’s first production of her inaugural season at Lincoln Center Theater. Read the reviews!\", \"liveBlogUpdate\":[ { \"@type\":\"BlogPosting\", \"headline\":\"The New York Times - ‘Ragtime’ Review: Checking the Status of Our American Dream\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"*CRITIC'S PICK* As the plot follows the intersecting fortunes of those three characters’ families, each seeking to redeem the country’s promise at a time of tumultuous change, old-fashioned musical-theater pleasures are very much on offer: a multitudinous cast clad in sumptuous costumes; riveting vocals undergirded by a 28-piece orchestra; a sprinkling of spectacle descending from above and rising from below. It works as rousing entertainment, full stop.\" }, { \"@type\":\"BlogPosting\", \"headline\":\"Vulture - America in Major and Minor Keys: Ragtime Returns\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"The fantasy of endless space is what matters, a great chimeric promise, this production understands, that both sustains the nation and goes unfulfilled. Even America has an end. Ragtime, with its thudding sentimentality, is not a truly great musical, but deBessonet has enough finesse to convince you that it might come close.\" }, { \"@type\":\"BlogPosting\", \"headline\":\"The Wall Street Journal - ‘Ragtime’ Review: A Stirring American Panorama on Broadway\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"Standing ovations on Broadway are so common you might imagine the seats have been booby-trapped to eject patrons as the curtain calls begin. But at a recent performance of the brightly shining revival of “Ragtime,” the ovation came early—actually two came early—so transported was the audience by the emotional and musical potency of this panorama of America at the turn of the 20th century.\" }, { \"@type\":\"BlogPosting\", \"headline\":\"Variety - ‘Ragtime’ Review: Broadway Revival Is a Timely, Glorious Panorama of Changing Times in America\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"In productions large or small — or, here, imperfectly in-between, though still glorious — everything is the service of the show that creates with words, music and movement a grand American tapestry — tears and all. \" }, { \"@type\":\"BlogPosting\", \"headline\":\"Entertainment Weekly - Ragtime review: The wheels of a dream turn down an all too familiar path in stirring Broadway revival\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"Here we have a show that examines where we are as a nation, and just as it did half a century ago, finds us wanting. It asks the very questions that have been front of mind over the past few weeks, months, years. It agonizes over the American Dream, debates the merits of political violence, slams the mistreatment of immigrants, prods at gender inequality, and grapples with grief. It does so while preaching hope for a brighter future — then thrusts its audience into that future, their present, a maddening contradiction. Ragtime isn't the kind of show you walk out of unscathed, not if you're really paying attention. Grade: B\" }, { \"@type\":\"BlogPosting\", \"headline\":\"Chicago Tribune - Review: Broadway’s ‘Ragtime’ is no less beautiful in a less promising America\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"Better yet, the new focus plays into the strengths of an empathetic cast that sings the bejesus out of these famous songs. Joshua Henry’s Colehouse feels younger than typical, less initially polite, more impassioned and, of course, his voice is the stuff of standing ovations. Nichelle Lewis’ Sarah is more fragile, which makes her crushed optimism especially moving. As Tateh, Brandon Uranowitz focuses on energetic joy. He expands the role and makes it all the more essential to the piece. Both Lewis and Ben Levi Ross, who plays the brooding Mother’s Younger Brother, bring qualities to those two characters I’ve never seen before. They are doing the best work of the night; Ross, especially, fleshes out what mostly has been a caricature. \" }, { \"@type\":\"BlogPosting\", \"headline\":\"Time Out New York - Ragtime\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"DeBessonet’s elegant direction contributes to the clarity. This is the same production that she premiered in semi-concert form last year at New York City Center (and which we discussed in an interview then), newly outfitted with a spare, effective set by David Korins and attractive abstract projections by 59 Studio. The very fine 2024 design team is otherwise intact: Linda Cho (costumes), Tom Watson (hair), Adam Honoré and Donald Holder (lights) and Kai Harada (sound). The beautifully full orchestra, led by music director James Moore, plays William David Brohn’s original orchestrations; Ragtime is not dance-driven, but choreographer Ellenore Scott keeps things moving when appropriate.\" }, { \"@type\":\"BlogPosting\", \"headline\":\"amNY - Review | In a divided America, ‘Ragtime’ strikes a defiant chord\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"Nichelle Lewis’s Sarah is heartbreaking, and she sings “Your Daddy’s Son” with raw, aching vulnerability. Ben Levi Ross captures Younger Brother’s naivety and the fervent militancy with which he hurls himself into causes. Shaina Taub makes a sharper, funnier Emma Goldman this time around, with her vocals far stronger than last year. Overall, the cast imbues the piece with life and cohesion, embodying the full scope of America’s promise and pain.\" }, { \"@type\":\"BlogPosting\", \"headline\":\"Deadline - ‘Ragtime’ Broadway Review: Lincoln Center Reclaims A Gem\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"But whatever its faults and near-misses, Ragtime has always been, like its ’90s contemporaries Titanic and Parade, an opportunity for rediscovery. DeBessonet takes the challenge and wins, rescuing a near-classic from the excesses of the 1990s to prove, once and for all, that Ragtime, imperfect as it may be, deserves a place among the most significant musical theater achievements of that decade.\" }, { \"@type\":\"BlogPosting\", \"headline\":\"New York Stage Review - Ragtime: A Triumphant Revival For Our Time\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"The imagery gets a big boost from lighting designers Adam Honoré and Donald Holder’s exquisite palette attaching distinctive shades of light to each of the main groups, and framing them in monochromatic bands painted overhead. And costumer Linda Cho did a terrific job expertly evoking the period, the class and the temperament of the characters. But even without the technical enhancements, the production would still soar given the bravura talents – all 41 actors and 28 musicians – gracing the Vivian Beaumont stage. \" }, { \"@type\":\"BlogPosting\", \"headline\":\"New York Stage Review - Ragtime: Breaking Our Hearts, Opening A Door\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"Classism, systemic racism, the immigrant experience—none of that screams “musical!” But Ahrens, Flaherty, and McNally managed to work it all in without preaching or lecturing (all three won Tonys for their efforts). You could argue that the characters are one-dimensional, but that’s on E.L. Doctorow, whose 1974 novel Ragtime is almost a collection of snapshots to memorialize historic moments—for instance, the creation of the assembly line. And for those who say the show moves too slowly (it clocks in at 2 hours 50 minutes), composer and pianist Scott Joplin, aka the King of Ragtime, says this in a preface to Doctorow’s book: “It is never right to play Ragtime fast.” \" }, { \"@type\":\"BlogPosting\", \"headline\":\"The Wrap - ‘Ragtime’ Broadway Review: A Revival Staged as if Directed by Spielberg\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"“Ragtime,” like “Les Miz,” gives anthems a very bad name. DeBessonet emphasizes their excessiveness by having her cast, especially Joshua Henry in the Coalhouse role, hold on to a note well passed its sell-by date. It’s difficult to tell if people are applauding mid-song because they’re impressed by Henry’s lung power or if they just want him to get off the note and finish the song. DeBessonet’s blunt direction only encourages us to applaud before the actors have finished singing.\" }, { \"@type\":\"BlogPosting\", \"headline\":\"New York Theatre Guide - 'Ragtime' Broadway review — an impeccably performed revival of a stirring megamusical\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"The bare-bones staging keeps the focus squarely where it counts: on the cast of nearly 40, who are uniformly topflight and in sync when it comes to sparking emotional electricity. The simplicity of the production provides breathing room in a megamusical that often exhilarates, but also drains because of its tendency to always think bigger.\" }, { \"@type\":\"BlogPosting\", \"headline\":\"One-Minute Critic - ‘Ragtime’ returns to Broadway with undeniable urgency and uncomfortable truths\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"Ragtime, one of the great musical theater scores of the late 20th century, steps up to bat on Broadway in its third major production. And if some of its design elements feel sparse in Lincoln Center Theater’s 1,050-seat Vivian Beaumont, its glorious cast of 34 and “the music of something beginning” land with a visceral impact that marks a uniquely American art form. \" }, { \"@type\":\"BlogPosting\", \"headline\":\"America Magazine - In ‘Ragtime,’ the idea of a just, multiracial America is tragically incomplete\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"Still, the mantle of “relevance” is a heavy thing to lay on a Broadway musical. An earlier version of this same staging, also by director Lear deBessonet, ran at the Encores! series last November in the weeks before and after the U.S. presidential election, and depending on when audiences saw it, they felt either the show’s bursts of hope or its cries of despair with a fresh immediacy. Seen now, it plays less like a reflection of the breaking news outside the theater’s doors than like a dead-serious fable, speaking not so much to our precise present moment as to the perennial national questions this moment raises. \" }, { \"@type\":\"BlogPosting\", \"headline\":\"Cititour - Ragtime\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"Although many people may recall the opulence of the original Broadway production, this more minimalist version is frankly more effective, allowing one to focus on the plot and the performances. David Korins' set is decidedly but intelligently spare, relying primarily on two large stepladders and a few well-chosen set pieces (including a Model T Ford). Linda Cho’s period costumes are quite impressive. Adam Honore’s lighting design and 59 Studio’s projection designs both help fill the vast Beaumont stage. Finally, Ellenore Scott’s spot-on choreography is thoughtful and often makes up for the lack of scenery. Yes, it's sad that 2025 proves to be the right time for “Ragtime,” but that doesn’t mean you should pass up the chance to witness this truly unforgettable production.\" }, { \"@type\":\"BlogPosting\", \"headline\":\"The New York Post - ‘Ragtime’ review: Broadway revival still misses — but has sensational singing\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"It still is. She doesn’t have a mastery of the Beaumont’s huge thrust yet. And so this is an overly presentational staging in which actors other than Ross struggle to connect to one another, which is partly why the experience is mostly unmoving even as songs desperately beg us to cry. \" }, { \"@type\":\"BlogPosting\", \"headline\":\"Culture Sauce - ‘Ragtime’ revisits a great musical and the promise of the American dream (Broadway review)\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"But this is no lumbering pageant. Despite the overstuffed plot, you find yourself getting caught up in the plight of characters whose efforts to get ahead in life are thwarted by prejudice and whose response to the obstacles they face varies from quiet persistence to anger to vengeance. DeBessonet’s thoughtful staging underscores why Ragtime is still worth revisiting. As we approach the country’s 250th anniversary, it’s good to remember that harmony can only happen when we bring disparate voices together, and that doing so is a public act worth cherishing. And preserving. Great music can grease the wheels of the American Dream. \" }, { \"@type\":\"BlogPosting\", \"headline\":\"DC Theater Arts - An epic ‘Ragtime’ for the ages at Broadway’s Lincoln Center Theater\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"Lincoln Center Theater’s revival of Ragtime is Broadway at its very finest, a top-notch production of an American classic with stellar performances, direction, and human themes that touch, entertain, and remain relevant, in their clear connection between then and now. Don’t miss it – and be sure to bring tissues for its most heartrending and shocking scenes. \" }, { \"@type\":\"BlogPosting\", \"headline\":\"Exeunt - Review: Ragtime at the Vivian Beaumont Theater\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"Director Lear deBessonet understands, and respects, that the writing must be central to this production’s success. Too many revivals become opportunities for revisions, permitting the writers to tinker with things that don’t need adjusting. Thankfully, Ahrens, Flaherty, and McNally’s estate have left things as they are and deBessonet’s production presents their stunning achievement in nearly barebones fashion. \" }, { \"@type\":\"BlogPosting\", \"headline\":\"New York Theater - Ragtime Broadway Review\", \"datePublished\":\"2025-10-17T09:37:55-05:00\", \"articleBody\": \"As at Encores, the three principal cast members carry us through the swirl and the sprawl, with their credible, impassioned performances and their golden voices; it helps that each is given some of composer Stephen Flaherty’s most distinctive songs, reflecting their character’s individual personality and culture. One can question whether “Ragtime” will be considered one of the great American musicals and still feel grateful to have been able to witness Joshua Henry, the Baritenor of Broadway, deliver a shattering “Make them hear you.”\" } ] }",
  "originalScore": "B",
  "assignedScore": 77,
  "source": "bww-roundup",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-RAGTIME-Returns-to-Broadway-20251016",
  "sourceMethod": "playwright",
  "scoreSource": "letter-grade",
  "scoreConfidence": "medium",
  "llmScore": {
    "score": 77,
    "confidence": "high",
    "range": {
      "low": 72,
      "high": 82
    },
    "bucket": "Positive",
    "thumb": "Up",
    "components": {
      "book": null,
      "music": null,
      "performances": null,
      "direction": null
    },
    "keyPhrases": [],
    "reasoning": "[two-model-fallback] | Both models agree: Positive | Claude: The critic's B rating and the key quote indicate appreciation for the performances while acknowledging the musical's limitations. The phrase 'still feel grateful' suggests a positive recommendation despite reservations about the show's overall greatness. | Gemini: The review acknowledges potential questions about the show's greatness but expresses gratitude for witnessing a powerful performance, indicating a positive but not overwhelmingly enthusiastic recommendation. The B rating also points to a positive assessment.",
    "flags": {
      "hasExplicitRecommendation": false,
      "focusedOnPerformances": false,
      "comparesToPrevious": false,
      "mixedSignals": false
    }
  },
  "llmMetadata": {
    "model": "ensemble:claude-sonnet-4-20250514+gpt-4o+gemini-2.0-flash",
    "scoredAt": "2026-02-02T00:11:45.980Z",
    "promptVersion": "5.1.0",
    "inputTokens": 0,
    "outputTokens": 0,
    "previousScore": 80,
    "previousVersion": "3.0.0"
  },
  "ensembleData": {
    "claudeScore": 75,
    "openaiScore": null,
    "geminiScore": 78,
    "claudeBucket": "Positive",
    "geminiBucket": "Positive",
    "scoreDelta": 3,
    "thumbsMatch": null,
    "expectedThumb": null,
    "needsReview": false,
    "needsReviewReasons": [],
    "ensembleSource": "two-model-fallback",
    "modelAgreement": "Both models agree: Positive"
  },
  "designation": "Critics_Pick",
  "bwwThumb": "Up",
  "sources": [
    "bww-roundup"
  ],
  "dtliThumb": "Up",
  "dtliExcerpt": "As at Encores, the three principal cast members carry us through the swirl and the sprawl, with their credible, impassioned performances and their golden voices; it helps that each is given some of composer Stephen Flaherty’s most distinctive songs, reflecting their character’s individual personality and culture. One can question whether “Ragtime” will be considered one of the great American musicals and still feel grateful to have been able to witness Joshua Henry, the Baritenor of Broadway, deliver a shattering “Make them hear you.”",
  "showScoreExcerpt": null,
  "originalScoreNormalized": 85,
  "scoreExtractedFrom": "excerpt",
  "rescoreReason": "fullText added after excerpt-based scoring",
  "previousLlmScore": 80,
  "archivePath": "data/archives/reviews/ragtime-2025/nyt-theater--jonathan-mandell_2026-02-02.html",
  "textFetchedAt": "2026-02-02T07:00:30.971Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "truncationSignals": [
    "shorter_than_excerpt"
  ],
  "rescoreCompletedAt": "2026-01-29T14:31:51.999Z",
  "contentTier": "truncated",
  "wordCount": 2319,
  "isFullReview": true,
  "textWordCount": 1154,
  "textQuality": "truncated",
  "textStatus": "truncated"
}