{
  "showId": "ragtime-2025",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "https://variety.com/2025/legit/reviews/ragtime-review-broadway-lincoln-center-theater-1236554453/",
  "publishDate": "October 16, 2025",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Home\n\n\tLegit\n\n\tReviews\n\n\tOct 16, 2025 8:00pm PT\t\n\n\t\t&#8216;Ragtime' Review: Broadway Revival Is a Timely, Glorious Panorama of Changing Times in America\n\n\t\t\t\t\t\t\t\tBy \n\n\tFrank Rizzo\n\n\t\t\tPlus Icon\n\n\t\t\t\t\tFrank Rizzo\t\t\n\n\t\t\t\t\tLatest\n\n\t&#8216;Ragtime' Review: Broadway Revival Is a Timely, Glorious Panorama of Changing Times in America\n\n\t3 months ago\t\n\n\t&#8216;Waiting for Godot' Review: Keanu Reeves and Alex Winter Bring a Cooler, Cosmic Take to This Broadway Waiting Game \n\n\t4 months ago\t\n\n\t&#8216;Call Me Izzy' Review: Jean Smart Dazzles in a Broadway Play That Treads All-Too-Familiar Territory\n\n\t7 months ago\t\n\n\tSee All\n\n\tWhether \"Ragtime\" is presented in productions mammoth (as in its 1998 premiere) or modest (the 2009 revival), the musical, adapted from E.L. Doctorow's kaleidoscopic 1975 novel, reverberates with the directness, passion and allegorical heft of an American folk epic.\n\n\tLear deBessonet opens her tenure as artistic director of Lincoln Center Theater with an expanded and exceptional version of the concert-plus production she staged at New York City Center during the weeks surrounding the presidential election last fall. It's a savvy choice given the positive reception it received, the show's panoramic scope and the ever-vital themes of the work.\n\n\t\t\t\t\tRelated Stories\t\t\n\n\t\t\t\t\tHow to Watch the 2026 Oscar Nominations Live",
  "showScoreExcerpt": "\"In productions large or small â or, here, imperfectly in-between, though still glorious â everything is the service of the show that creates with words, music and movement a grand American tapestry â tears and all.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-RAGTIME-Returns-to-Broadway-20251016",
  "urlUpdated": "2026-01-23T05:27:32.724Z",
  "scrapedAt": "2026-01-23T22:05:53.343Z",
  "dtliThumb": "Up"
}
