{
  "showId": "grey-house-2023",
  "outletId": "newyorktheatreguide-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.newyorktheatreguide.com/reviews/grey-house-broadway-review-laurie-metcalf",
  "publishDate": null,
  "fullText": "Read our review of Levi Holloway's Grey House on Broadway, starring Laurie Metcalf and directed by Joe Mantello, now in performances at the Lyceum Theatre. One thing’s for sure about the first show of the 2023-24 Broadway season: Grey House has curb appeal. Actress Laurie Metcalf and director Joe Mantello each lend Tony Award-winning luster to the listing at the Lyceum Theatre. Moreover, haunted-house tales are rare commodities on stage, so that also counts as a clear credit. From there, things turn murkier with Chicago-based playwright Levi Holloway’s story set in a remote cabin that moans, groans, and features the freakiest refrigerator since a demon moved into one in Ghostbusters. The unspoken come-on of Grey House is: Be afraid, be very afraid. Yes, please! Although the 110-minute production oozes mystery and a ghostly vibe, it doesn’t deliver intense shivers. It’s too vague to stir psychological chills or, for that matter, good old-fashioned goosebumps. It’s as much a head-scratcher as it is a hair-raiser. Your ultimate satisfaction level will be in proportion to your need for a mystery to be spelled out – and, frankly, it doesn’t have to be to work. Do we ever really know why the beaked beasts attacked in The Birds? Just saying. In 1977, Max (Tatiana Maslany) and her husband Henry (Paul Sparks) seek refuge at a house in the woods after a car wreck leaves him with a broken ankle. It slowly emerges that no one really winds up at this address by accident. It’s by destiny. Suffice it to say the house is a magnet for men with pasts, women with maternal instincts, and lost girls. “I’ve seen this movie,” Henry tells Max as he hobbles around the house where clutter rules and the phone cord is severed. “We don’t make it.” Is his quip black humor? Foreshadowing? Time tells all as Henry falls deeper under the spell of the strange girls in residence. They’re an odd-lot pack. They look almost feral but sing and harmonize like mournful angels. They busy themselves adding long red strands to a weird-looking afghan or tapestry. What are they up to? Meat macrame? You won’t find this craft project on Etsy. Icy Marlow (Sophia Anne Caruso) is the apparent queen bee, while Bernie (Millicent Simmonds), who’s Deaf, makes Henry’s nose bleed with a Carrie-like gesture. Squirrel (Colby Kipnes) creeps in and out of the sinister-looking basement, while A1656 (Alyssa Emily Marvin) — yes, that’s a name — recalls seeing her brother shot dead. There’s also a periodically blindfolded boy (Eamon Patrick O’Connell) and a nightmarish Ancient (Cyndi Coyne) adding to the weirdness. Raleigh (Metcalf, in blustery Roseanne mode) watches over them all, describing her brood as “willful creatures” who are “always hungry.” And exactly how are they satiated? That’s one burning question. Another is whether Max and Henry will ever get out of this place situated in a Twilight Zone — er, the mountains. That becomes more urgent as Marlow and company ply Henry with moonshine, also known as “the nectar of dead men,” from the fridge. It's stored in mason jars curiously labeled with names and dates — for instance, Douglas, 1971. Henry greedily guzzles the stuff and reveals disturbing truths about himself. The plot thickens. Mantello has assembled a fine ensemble. His atmospheric production packs jump scares that do their job, plus a gross-out bit of DIY surgery. Scott Pask’s set screams creepy, Natasha Katz’s lighting casts dark shadows, and Tom Gibbons’s sound design doubles as a residential respiratory system that makes the house come alive. One wishes the series of scenes built to a deeper, more full-scale sense of dread. In terms of fright nights, Grey House is entertaining, albeit middle of the road. Grey House is at the Lyceum Theatre. Get tickets to Grey House at New York Theatre Guide. Photo credit: Colby Kipnes, Laurie Metcalf, Sophia Anne Caruso, Millicent Simmonds, Alyssa Emily Marvin, Tatiana Maslany, and Eamon Patrick O’Connell in Grey House on Broadway. (Photo by MurphyMade) Originally published on Jun 1, 202320:00",
  "isFullReview": true,
  "dtliExcerpt": "“One wishes the series of scenes built to a deeper, more full-scale sense of dread. In terms of fright nights, ’Grey House’ is entertaining, albeit middle of the road.”\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 670,
  "archivePath": "data/archives/reviews/grey-house-2023/newyorktheatreguide-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:39:14.321Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright"
}