{
  "showId": "grey-house-2023",
  "outletId": "slashfilm-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.slashfilm.com/1307195/the-grey-house-review/",
  "publishDate": null,
  "fullText": "You don't have to solve a riddle to enjoy a horror piece, nor does the work have to explain itself. Those allures are among the reasons why theatergoers expressed thrill when \"The Grey House,\" a rare horror production, was announced for Broadway. You might have caught the teen witchiness in the form-defying \"Our Dear Dead Druglord\" previously running off-Broadway, but the Great White Way has largely avoided experimenting with genre plays of committed atmospheric macabre, though the techniques have surfaced in various shades in \"The Piano Lesson\" (a ghost story) recent revival or \"1984\" (jump scares and graphic torture). Hearing of a new-ish play like \"The Grey House\" settling on a large-scale stage comes with promises tucked in the shadows like moth cocoons. After its 2019 Chicago premiere at the 70-seater A Red Orchid Theatre, \"The Grey House\" has found an expanded household in Broadway's 900-seated Lyceum Theatre with a new creative team led by director Joe Mantello (\"Wicked\"). The playwright Levi Holloway draws a horror scheme as vintage as time, starting with the playbill marking the setting as \"A cabin in the woods.\" The year is 1977. Occupying the cabin is a cryptic family unit: an ensemble of creepy children and their aging guardian Raleigh (Laurie Metcalf). A couple, Max (Claire Karpen, the understudy for Tatiana Maslany, who was out with an illness) and Henry (Paul Sparks), find themselves stranded in the snowstorm after a car crash. With Henry dragging a severely injured leg, the travelers trudge into the cabin for shelter. There, the pair form an uneasy dynamic with Raleigh and the kiddos, who assail them with existential questions and bizarre games. As a thriller, \"The Grey House\" favors study over suspense, a connect-the-dots tableau of interactions. Even as the husband jests a winky line like \"I've seen this movie ... we don't make it,\" the play hangs a fog of guesswork toward its destination. Clues might wander in the bedtime parable, the dissection of poor critters, Rudy Mance's costume design that insinuates meanings, moonshine jars that magically pop up in the fridge, and a pose possibly inspired by a frame from \"Hereditary.\" Underneath the flickering lights of designer Natasha Katz (who worked in the recent \"Sweeney Todd\" revival), sound designer Tom Gibbons deploys creaks, groans, and diegetic record music that act as the lifeblood of the unmoving cabin (occupied with knick-knacks by set designer Scott Pask). \"The Grey House\" is most hypnotizing in its silent choreographic interactions (choreographer Ellenore Scott's movement work) between Henry and the cabin's entities, including an unexplained phantom that the program calls \"The Ancient\" (Cyndi Coyne, with expressions and physicality carved for a horror close-up). Is the Ancient a hallucination, a memory, or one of the cabin's \"girls\"? Those theories are best reserved for message boards. By comparison, the talky games between Max and the kids deflate the tension. There's something more conversational and powerful in the silence and understatements between Henry and the cabin family. It would be unjustifiable to single out any of the Creepy Children. Despite the script's supply of run-of-the-mill lines, these \"willful creatures\" (the mom's word) form a talented blob with unspoken motives and bizarre names. Colby Kipnes may have scored a breakout role as Squirrel, the youngest mischief-maker first seen disappearing into the basement with a hammer. The originator of Lydia Deetz from \"Beetlejuice The Musical,\" Sophia Anne Caruso plays the misanthropic Marlow whose menace belies her misery. A pair of sinister besties, Bernie (\"A Quiet Place\" star Millicent Simmonds) and A 1656 (Alyssa Emily Marvin), converse in untranslated ASL in the background (Andrew Morrill directs the artistic sign language). Oh, I should mention the sole male child, The Boy (Eamon Patrick O'Connell, an affecting stage presence), who carries a symbolic purpose for Henry. The script does not elucidate the hazy connection between the children and their \"mother\" Raleigh, a cantankerous comic with lines of deadpan camp (often, the audience broke into laughter at Metcalf's lines). She's their mother \"sometimes,\" Marlow shares, whatever that means. When Max asks if there's a father involved, Raleigh responds, \"It's a mystery!\" as if winking at the audience. She cares for her willful creatures but does not intervene in their antics. One of the show's downsides is the unfathomable arc Metcalf draws to her conclusion. So resigned is her character that her final decision doesn't track. So does the slow burn pay off for an intermission-free 100 minutes? Unfortunately, \"The Grey House\" misses two mechanics vital to its revelations: 1) an overarching propulsion that lets it progress as a thriller and 2) a more realized human psychodrama. Without giving away too much, the dramatic reckonings don't land as character-based reveals as intended. The climax fusses over symbolic spectacle in a manner that obstructs, not compliment, the themes of human costs, injustice (specifically against female bodies), and contrition. \"The Grey House\" script leaves a blueprint open to different creative visions. Even if you're dissatisfied or frustrated with this particular Broadway vision of \"The Grey House,\" the show is a curious meal. This production may not be the watershed Broadway horror. Might attendees, from theatergoers to horror moviegoers, still find treats in this umpteenth cabin-in-the-woods tale (even if they deem it chuckle-worthy camp like some of my audience members)? For a live experience, it might not impress but it sustains itself through its atmosphere and cast. As of now, it's difficult to forecast how \"The Grey House\" may influence the untapped horror potential on Broadway-sized stages. Somewhere, there are unproduced possibilities waiting in the cobwebbed drawers. \"The Grey House\" is running at the Lyceum Theatre in NYC.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 934,
  "archivePath": "data/archives/reviews/grey-house-2023/slashfilm-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:42:57.934Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}