{
  "showId": "grey-house-2023",
  "outletId": "theatermania",
  "outlet": "THEATERMANIA",
  "criticName": "Zachary",
  "url": "https://www.theatermania.com/news/review-grey-house-is-broadways-camp-horror-guilty-pleasure_1704086/",
  "publishDate": "June 1, 2023",
  "fullText": "Laurie Metcalf stars in the Broadway debut of Levi Holloway&#8217;s spooky new play.\n\nA couple crashes their car while foolishly trying to drive up a mountain in a blizzard. They seek refuge in a secluded old house occupied by a coven of young women and their apparent mother. &#8220;I&#8217;ve seen this movie,&#8221; says Henry, the man, who is also suffering from a broken ankle. &#8220;We don&#8217;t make it.&#8221;\n\nThe audience laughs — the first time of many in Levi Holloway&#8217;s immensely entertaining Grey House, now playing at Broadway&#8217;s Lyceum Theatre. Are we laughing at the character&#8217;s call-out of a scary movie cliché, or because we suspect he&#8217;s right? I&#8217;ve written recently about the porous border between horror and camp, and Grey House confidently resides in this marchland — but how?\n\nIs it the swirling presence of four young female actors, fully committed to their slumber party-turned-cult vibe, and boldly led by Sophia Anne Caruso, the reigning queen of the unnervingly precocious? Is it the ethereal silence of Eamon Patrick O&#8217;Connell, the one boy in this aggressively female abode, whose purpose remains hazy long after the curtain falls? Or is it the irresistible charm of Laurie Metcalf, who plays Raleigh (the ostensible mother) with a quirky yet relatable humanity that makes us feel as though Aunt Jackie has been dropped into a haunted house and has decided to make it a haunted home?  All of the above.\n\nFor most of the play&#8217;s 90 minutes, Holloway manages to maintain an air of mystery even though his characters are unblinkingly honest about what is happening. In the opening scene we watch as the girls snuggle a ragged quilt that looks like a prop from a Hannibal Lecter movie. This is before Henry (Paul Sparks) and Max (Tatiana Maslany) stagger in from the storm and discover Squirrel (Colby Kipnes), who menacingly refers to Henry&#8217;s &#8220;broken wing.&#8221; They then meet Bernie (Millicent Simmonds), who is deaf, and Marlow (Caruso) who wields a knife but reassures them, &#8220;This knife would take forever to kill somebody, it&#8217;s so small.&#8221; They toss Henry&#8217;s shoes onto a large pile of other mens&#8217; shoes before Raleigh resets his ankle with a force that would make Annie Wilkes proud. They then offer Henry the only painkiller they have, a refrigerated liquid that A1656 (Alyssa Emily Marvin) nonchalantly refers to as &#8220;the nectar of dead men.&#8221;\n\nSurely these are just homeschooled girls with sick senses of humor, lovingly raised into their eccentric little culture by a foul-mouthed mother who long ago opted out of society in order to live her truth in the mountains. At least, that&#8217;s what Henry and Max hope because the alternative to staying with this strange bunch is freezing to death.\n\nDirector Joe Mantello has given the script a first-class staging, masterfully balancing shades of light and dark while deftly delivering the bumps, thrills, and chills that are an essential part of what makes Grey House so satisfying. Scott Pask&#8217;s overstuffed set, which wouldn&#8217;t look out of place in a Tim Burton film, makes an arresting first impression. It keeps unveiling new secrets under Natasha Katz&#8217;s shadowy, shifty lighting design. We never know when we might be plunged into darkness. Tom Gibbons raises the hairs on the backs of our necks with his unsettling sound design, which he pursues with cinematic fervor. The costumes (by Rudy Mance) help tell the story, as 20th century mountain attire (the play is set in 1977) gives way to far older garb. Or Matias has created gorgeously strange a cappella arrangements (because of course the girls sing a few creepy group numbers). And the special effects makeup (by Christina Grant) is truly impressive, garnering gasps in the audience.\n\nThe precision stagecraft only enhances the performances, which are top-notch. Maslany perfectly embodies a Fleetwood Mac-era Fräulein Maria, attempting to win the girls&#8217; favor through sisterly affection. &#8220;That&#8217;s an interesting name,&#8221; she tells A1656 with kindergarten teacher sweetness. But we get the sense this is all a ploy to make their time in the cabin go as smoothly as possible, and when things get bumpy, Maslany&#8217;s distress is our distress.\n\nSparks is gruff yet vulnerable as the injured Henry, traveling through the play in a sepia-toned ayahuasca haze. He seems to carry within him long suppressed secrets — some of which might not even be his own.\n\nMetcalf pulls off the most remarkable tonal synthesis, inhabiting the magical world of the house as if it were just another mundane McMansion. Her Raleigh is exhausted yet stalwart, fully clued-in to the mysteries of the house and resigned to the fact that she&#8217;s powerless to change anything. Of all the characters, she feels like the one we&#8217;re most likely to meet in real life, never suspecting she&#8217;s the matriarch of a house full of ghouls.\n\nUnfortunately, Holloway explains a little too much by the end, abandoning the exquisite burlesque of horror for a fashionable fairytale of female retribution. Some in the audience might find this cathartic, but for me it was a disappointment, causing the carefully woven spell of Grey House to unravel like an afghan made of human flesh.\n\nStill, there&#8217;s no show on Broadway quite like Grey House, a play that manages (at least until the end) to exhale hilarity and horror in the same icy breath. Scream queens, take note.\n\nReview: A Christmas Carol, Starring Michael Cerveris, Is Tight as a Drum and Pretty as a Picture                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: Gotta Dance! Hands Broadway Hoofers a Kickline of Classics                 \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: The Faggots and their Friends Between Revolutions, a Queer Mass                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: Paddington the Musical: Marmalade and Musical Heaven                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: The Phantom of the Opera Is as Thrilling as Ever on the Road                \n            \n        \n    \n\n                                    \n\n\n    \n        \n            \n                \n                                            \n                            \n                            \n                            \n                            \n                        \n                                    \n            \n        \n        \n            \n                \n                    Review: The Surgeon and Her Daughters, an Epic Fizzle                \n            \n        \n    \n\n                    \n\n            \n        \n\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n            \n            \n\n    \n            \n                \n            \n\n            \n    \n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n        \n            \n            \n            \n            \n            \n            Theater News & discounts\n                \n                    Get the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nThe live film capture of the 2023 Broadway revival starring Daniel Radcliffe, Jonathan Groff, and Lindsay Mendez hits theaters December 5.",
  "isFullReview": true,
  "dtliExcerpt": "Director Joe Mantello has given the script a first-class staging, masterfully balancing shades of light and dark while deftly delivering the bumps, thrills, and chills that are an essential part of what makes Grey House so satisfying.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": "https://didtheylikeit.com/shows/grey-house/",
  "needsScoring": true,
  "textWordCount": 999,
  "archivePath": "data/archives/reviews/grey-house-2023/theatermania--zachary_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:47:33.833Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251207125736",
  "archiveOrgUrl": "http://web.archive.org/web/20251207125736/https://www.theatermania.com/news/review-grey-house-is-broadways-camp-horror-guilty-pleasure_1704086/"
}