{
  "showId": "left-on-tenth-2024",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Left-on-Tenth/1259",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Left-on-Tenth/1259",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "What bothers me more is not understanding why Ephron would dilute what could be a truly inspiring tale of senior citizens stepping out of their respective comfort zones to take a chance at happiness? As it stands, “Left on Tenth” feels like watching a rom-com with two extremely good-looking middle-aged people.",
  "bwwScore": 5,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-LEFT-ON-TENTH-Starring-Julianna-Margulies-and-Peter-Gallagher-Opens-On-Broadway-20241023",
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $74\n Buy Tickets\n\nCititour.com Review\n There’s a major aphorism that is often told to us: “A little knowledge is a dangerous thing.” And sadly, that warning has proven true for those of us who watch a lot of docudramas and biopics, since any viewer with a little (or a lot) of knowledge of the subject at hand often gets frustrated or angry as the truth becomes looser and faster (as it usually does).\n\nTherefore, should you know nothing about the celebrated writer Delia Ephron, especially her 2022 memoir “Left on Tenth,” the basis for the play of the same name now at the James Earl Jones Theatre under Susan Stroman’s hard-working direction, you will probably find this recollection of new-found love (and possible death) to be a pleasing, even moving experience. I’ll speak for the rest of us shortly.\n\nWithout question, the play’s marquee stars, Julianna Margulies as Delia and Peter Gallagher as Peter, a one-time college paramour and successful Jungian psychiatrist who becomes her third husband, are among the most attractive and appealing actors on the planet. It’s truly adorable to watch how their online correspondence (why not call this show “You’ve Got Email”) blossoms into a cross-country phone romance and then a full-blown love affair once the pair settle into a period of bicoastal bliss. \n\nMoreover, the pair’s undeniable chemistry carries them through some of the play’s roughest and most dramatic moments (which is where Margulies really excels), especially the scenes where Delia fights a life-threatening bout of leukemia.\n\nThere are also two wondrous actors on hand, Peter Francis James and Kate McCluggage, who switch costumes, accents and characterizations with alarming accuracy and alacrity to portray every other person who shows up in Delia and Peter’s story. And let’s not forget the two cute canines who momentarily steal the show with their brief appearances.\n\nSo, what was my earlier point? “Left on Tenth” takes place around 2015-2018, when Delia Ephron was in her early 70s. It may not say so in the Playbill, but the script not only speaks that truth out loud, but adds time-sensitive references, such as Delia and Peter seeing the Broadway play “Take Her She’s Mine,” alongside Delia’s famous parents (and that show’s authors) in their college days. While admittedly a footnote in theatrical history, the play appeared on Broadway from 1961-1962. \n\nThis detail is not, I stress, nitpicking. Margulies would not have been born for a few more years after that show was on Broadway (and she looks like it would be at least another decade before she entered the world), while Gallagher, still as sexy as the day he debuted on Broadway in “Grease,” would have been a toddler, not a college senior.\n\nWhat bothers me more is not understanding why Ephron would dilute what could be a truly inspiring tale of senior citizens stepping out of their respective comfort zones to take a chance at happiness? As it stands, “Left on Tenth” feels like watching a rom-com with two extremely good-looking middle-aged people.\n\nAdditionally, Ephron -- who co-wrote the long running “Love, Life and What I Wore” (also a good title for this show) with her late sister, the extraordinary Nora Ephron -- probably could have used a new writing partner this time around. There’s too much telling (and not showing) on the stage, especially in the first 15 minutes, and the work, even at 100 intermissionless minutes, feels a bit rambling. \n\nLuckily, there’s Beowulf Borrit’s gorgeous re-creation of a Greenwich Village apartment to stare at (sometimes), complimented by the pretty projections by Jeanette Oi-Suck Yew. And yes, watching Gallagher lip-synch to Natalie Cole’s “This Will Be (An Everlasting Love)” is almost worth the price of admission.\n\nIn the end, though “Left on Tenth” left me wanting different stars in a somewhat different play. You may feel differently.\n By Brian Scott Lipton\n\nVisit the Sitehttps://leftontenthbroadway.com/Open/Close DatesOpening 10/23/2024Closing Open-ended\nTheatre Info\nJames Earl Jones Theatre138 West 48th StreetNew York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 712,
  "archivePath": "data/archives/reviews/left-on-tenth-2024/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:10:08.692Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 712,
  "tierReason": "Full review text"
}