{
  "showId": "left-on-tenth-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Melissa Rose Bernardo",
  "url": "https://nystagereview.com/2024/10/23/left-on-tenth-delia-ephrons-memoir-gets-lost-in-translation/",
  "publishDate": "2024-10-23T20:28:04",
  "fullText": "Some shows post audience advisories about gunshots, strobe lights, or sensitive content. Delia Ephron’s Left on Tenth might consider one on Verizon. Nothing triggers a theatergoer quite like hearing “please hold, your call will be answered in the order in which it was received” over and over.\n\nShe channeled her frustration with the communications company into a New York Times piece, which led to the discovery of the second great love of her life, Peter. The start of their story became the heart of her 2022 memoir, Left On Tenth, now adapted into a middling Broadway play starring Julianna Margulies and Peter Gallagher (presumably Meg Ryan and Tom Hanks weren’t available).\n\nWhen Delia and Peter first e-meet, typing electronic missives, sitting at their desks—she in Manhattan, he in Northern California—it’s impossible not to think of You’ve Got Mail, the 1998 romcom classic cowritten by Delia and her late sister Nora Ephron. “I began to believe that I had fallen into my own romantic comedy,” Delia confides in the audience.\n\nOf course, we’ll need Delia’s backstory: the death of Jerome, her husband of 33 years; a description of their block in Greenwich Village; a cameo by her dog, Honey Pansy Cornflower (played by Nessa Rose); a visit with neighbor Mitch (Peter Francis James, who plays about 10 assorted male roles); a heart-to-heart with her close friend, Wales-dwelling Englishwoman Julia (Kate MacCluggage, who toggles between some 10 female roles in a series of excellent wigs by Michael Buonincontro); an appointment with an ill-mannered eye doctor (James); a call from Rosie from Verizon (MacCluggage)…and more. That’s a lot of exposition to wade through. No sweat in a 300-page book, but it’s a tough way to kick off a 100-minute play.\n\nIt also demands some heavy lifting from Margulies, and a direct-address chattiness that doesn’t seem to come naturally. She’s best known for TV dramas such as ER and The Good Wife; her finest stage work to date was Ten Unknowns, Jon Robin Baitz’s compelling 2001 meditation on art versus commerce. She looks slightly self-conscious tap-dancing and waxing poetic about Zabar’s tuna salad alone onstage. (Though it is exceptional tuna salad.) With Gallagher—a stage and screen veteran who can do it all, from O’Neill (Long Day’s Journey Into Night) to Loesser (Guys and Dolls), from sitcoms (Grace and Frankie) to soaps (The O.C.) to, yes, romcoms (While You Were Sleeping)—she’s more relaxed; he couldn’t be better cast as the earnest, self-possessed Peter, Delia’s (soon-to-be) second husband.\n\nWhat neither of the leads nor director Susan Stroman—a musical maven who did a bang-up job with the 2022 non-musical POTUS: Or, Behind Every Great Dumbass Are Seven Women Trying to Keep Him Alive—can navigate is Left On Tenth’s massive tonal shift from love story to hospital drama when Delia is diagnosed with (slight spoiler alert) leukemia, the cancer that eventually took Nora’s life in 2012. And further attempts to pull the play back into warm, comfy romcom territory—a series of people cooing and fussing and asking how long they’ve been married, for example—come off as just plain cheesy.\n\nEphron’s experience is powerful and affecting, but some stories simply don’t translate from the page to the stage.\n\nLeft on Tenth opened Oct. 23, 2024, at the James Earl Jones Theatre. Tickets and information: leftontenthbroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "She channeled her frustration with the communications company into a New York Times piece, which led to the discovery of the second great love of her life, Peter. The start of their story became the heart of her 2022 memoir, Left On Tenth, now adapted into a middling Broadway play starring Julianna Margulies and Peter Gallagher (presumably Meg Ryan and Tom Hanks weren’t available).",
  "bwwScore": 5
}
