{
  "showId": "left-on-tenth-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2024/10/23/left-on-tenth-romantic-comedy-takes-a-wrong-turn/",
  "publishDate": "2024-10-23T20:27:32",
  "fullText": "They say that a writer should write what they know. But in Delia Ephron’s case the advice may be a bit too on-the-nose. Left on Tenth, her new Broadway play based on her best-selling memoir, relates such life-changing events as the death of her first husband, her improbable late-in-life romance, and her battle with a rare form of cancer that almost killed her. By the end of the evening, you’ll have come to very much like Delia Ephron. The play, not so much.\n\nIt’s not for lack of trying on the writer’s part. Delia, charmingly if at times too girlishly played by Julianna Margulies, narrates much of the proceedings, telling her story with endearing pathos and humor. It’s hard not to sympathize with her throughout her travails, which amusingly begin with being stuck in “Verizon hell” as she helplessly attempts to get the phone company to restore her internet service after they mistakenly cut it off while disconnecting the landline of her recently deceased husband of 33 years. As she painfully listens to Verizon’s hold music and repeatedly gets cut off, we wince in pain. After all, who can’t relate?\n\nOf course, most of us don’t have the talent or opportunity to turn the situation into an amusing essay in The New York Times, which Ephron — whose credits include co-writing such movies as You’ve Got Mail and This is My Life with her late sister Nora — famously did. Said essay leads to the reappearance of Peter (Peter Gallagher), a man she briefly dated as a teenager and whom she doesn’t remember at all. But he remembers her, calling her from his home in the Bay Area to compliment her on the Times piece and catch up in general.\n\nThe two begin an at-first epistolary relationship, trading increasingly affectionate e-mails which the actors recite from separate desks as if rehearsing for a production of Love Letters. Then they begin speaking by phone, which doesn’t exactly raise the theatrical stakes. Finally, he comes to see her in New York, their sexual chemistry so off-the-charts that the theater should provide matinee audiences something to fan themselves with (this is the sort of show that should eschew evening performances entirely, since much of its target audience doesn’t like to drive at night).\n\nIf Peter wasn’t real, Ephron, no stranger to romantic comedies, would have had to invent him. As wonderfully played by Gallagher (who’s aging so well that expensive bottles of wine feel jealous), he’s practically a perfect man. Fit enough to hike in and out of the Grand Canyon not once but twice, he’s a Jungian psychotherapist who uses words like “interdimensionality” and is an expert on sexual harassment who’s defended abused women in court. He dresses beautifully and has a great sense of humor. His only apparent flaw is that he wears a backpack, which as someone points out, is true of every man in Northern California.\n\nHe’s also endlessly supportive of Delia when she falls ill, spending every minute with her in the hospital while she undergoes a risky and debilitating experimental treatment. Random strangers repeatedly stop them as they’re walking together to tell them what a lovely couple they make. (Even if such encounters did occur in real life, Ephron would have done well to leave them out.)\n\nIt all feels, sad to say, like a Lifetime movie, down to the lovable gay neighbor who reveals he’s been HIV-positive for many years and the female oncologist who treats Delia with the sort of loving compassion not much in evidence at actual NYC hospitals. Those and many other supporting figures are played by Peter Francis James and Kate MacCluggage with impressive versatility, making you wish their characters had more depth.\n\nDirector Susan Stroman works tirelessly to infuse the static proceedings, which too often feel like an audiobook, with theatricality. But she tries too hard, embellishing scene transitions with musical and dancing interludes that feel jarringly out-of-place. Left on Tenth tries so hard to be appealing it features not one but two live dogs onstage. It’s a wonder they’re not sent out into the audience to lick our faces.\n\nLeft on Tenth opened October 23, 2024 at the James Earl Jones Theatre. Tickets and information: leftontenth.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "nyc-theatre"
  ],
  "originalScore": "3/5 stars",
  "nycTheatreExcerpt": "\"Ephron's experience is powerful and affecting, but some stories simply don't translate from the page to the stage.\"",
  "textQuality": "partial"
}
