{
  "showId": "left-on-tenth-2024",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Helen Shaw",
  "url": "https://www.vulture.com/article/theater-review-delia-ephron-left-on-tenth-margulies-gallagher.html",
  "publishDate": "October 24, 2024",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPeter Gallagher and Julianna Margulies in Left on Tenth.\n Photo: Joan Marcus\n \n \n \n The act of chatting online, though it occupies so much time and — for the hopelessly hyperverbal, at least — so much of our romantic lives, remains extremely difficult to render as dramatic action. Nobody wants to spend time watching people type, so one trick directors and playwrights try is to contrast the people we pose as online with the people we are in person. The gold standard for electronic epistolary romance is probably still You’ve Got Mail, written by sisters Nora and Delia Ephron, in which Tom Hanks and Meg Ryan fall for each other in cyberspace (as you might have called it in 1998) while remaining at furious cross-purposes IRL on the Upper West Side. So in Left on Tenth, a play based on Delia Ephron’s memoir, when Julianna Margulies’s version of the author starts flirting via email with Peter Gallagher’s therapist character, you may feel a comforting return to the world and framing of Ephronian romantic comedy. But while the situation may seem as familiar as slipping on an old shirt from Barneys or picking up your Zabar’s order, it’s in the extended email between Margulies and Gallagher that Left on Tenth’s essential flaw becomes apparent: There is almost no friction or tension. He’s who he appears to be; she’s who she appears to be. You are in for an evening that is altogether too pleasant for its own good.\n\nThe plot of Left on Tenth is not without tribulations, though Ephron, adapting her own memoir, keeps the tone resolutely on the sunnier side. That she has chosen to stage this as a comedic picaresque is itself a kind of accomplishment considering that the series of events she lived through reads, on its face, as grand tragedy: Her sister Nora died in 2012 of a rare blood cancer, and her husband, the screenwriter Jerry Kass, died in 2015. Later on, Delia was diagnosed with cancer herself, of a type similar to Nora’s, and faced a grueling series of experimental treatments. There is also bad news about her dog. (Though the two pooches that skitter around onstage over the course of the performance are real highlights.) But over the course of these events, Delia turns her focus, instead, to her budding romance. An essay she wrote for the New York Times about trying to cancel her husband’s Verizon phone line inspired an email from a genial, handsome Jungian psychotherapist named Peter who first wooed her long-distance from the Bay Area. During their courtship, the watercolor projections at the back of Beowulf Boritt’s set, which is dominated by a wedding-cake-like rendering of Delia’s apartment, display a split between Northern California redwoods and a city skyline straight off a New Yorker cover.\n\nPlayed by Peter Gallagher in the gregarious, wise, eyebrow-forward mode of Sandy Cohen in The O.C., Peter comes across as a gift from the heavens. A widower himself, he and Margulies’s Delia bond over shared loss and then quickly fumble into courtship when he flies to see her in New York City. All the obvious sources of turbulence — first-date jitters, fear of betraying lost loves — are present, but Delia and director Susan Stroman steer around them. Delia, in Margulies’s narration, does fret about the big stuff, but the play presses all that aside to focus on the small. The biggest hitches to that first dinner date may be that Peter shows up carrying a backpack and that he drinks beer, which does not appeal to Delia. With so much potential conflict elided, Margulies and Gallagher together generate a polite amity but never heat — even when, later on, they’re frolicking under the covers of a capacious yet tasteful onstage bed.\n\nLeft on Tenth’s enfolding coziness leaves little room for Margulies and Gallagher’s work. Margulies, who excels when she’s in the cool-steel mode of The Good Wife’s Alicia Florrick or ER’s Nurse Hathaway, is less comfortable with effervescence. You can feel her as she’s self-pressurizing to carbonate the performance. It’s hard to imagine her being as flighty and anxious as Delia claims to be, though it is charming when she commits wholeheartedly to the bits of soft-shoe her character performs in tribute to the dance lessons she took with her late husband. (Stroman would never miss the chance to incorporate dance into a production; The Big Gay Jamboree, as it turns out, is not the only production this fall to heavily reference Seven Brides for Seven Brothers.) Gallagher, meanwhile, is reaching for a handhold on the concept of “too good to be true.” When the play shifts into its final third, which is occupied with Delia’s medical nightmare, Margulies’s natural intensity is right for the brutal situation, while Gallagher must play a man whose emotional intelligence allows him somehow to will her back into good health. Finally, we’ve got a little tension — but still no human conflict. The characters endure tribulation as the specific texture of their personalities remains at a distance.\n\nThe two leads are flanked by Peter Francis James and Kate MacCluggage, who play a series of mostly comedic supporting roles in a variety of costumes (and, in MacCluggage’s case, a whirlwind of wigs). Both James and MacCluggage work hard, but neither has much range to traverse. James is, at one point, a gay neighbor who has lived with AIDS for years. MacCluggage is, for a while, a chatty British friend who distracts Delia with the joys of living grandly on a Welsh estate. Everyone Delia meets tends toward the kind and supportive with a pearl of wisdom or two to offer, and no one is ever cutting or cruel — except representatives from telephone companies. There’s seeing the world with rose-tinted glasses, and then there’s just refusing to paint with shades other than pink.\n\nLeft on Tenth is at the James Earl Jones Theatre.\n\nShow \n \n \n Leave a Comment\n \n\n Left on Tenth Goes Right Down the Middle\n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "dtliExcerpt": "The play's power comes from its refusal to make Ephron's life into a neat parable about love conquering all, instead presenting the messy, uncertain reality of finding connection later in life.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The play's power comes from its refusal to make Ephron's life into a neat parable about love conquering all, instead presenting the messy, uncertain reality of finding connection later in life.",
  "contentTier": "complete",
  "contentTierReason": "Short text (31 words)",
  "textQuality": "full",
  "rejectedAt": "2026-02-03T18:05:47.193Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or quote, not a complete review with sufficient evaluative content to determine a recommendation; openai: The text is a single sentence that provides an observation about the play's thematic approach, but lacks evaluative content or a clear recommendation.",
  "promptVersion": "5.2.0",
  "previousUrl": "https://www.vulture.com/article/left-on-tenth-broadway-review.html",
  "urlDiscoveredAt": "2026-02-04T00:32:37.211Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1019,
  "archivePath": "data/archives/reviews/left-on-tenth-2024/vulture--helen-shaw_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:32:37.227Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250406011638",
  "archiveOrgUrl": "http://web.archive.org/web/20250406011638/https://www.vulture.com/article/theater-review-delia-ephron-left-on-tenth-margulies-gallagher.html",
  "wordCount": 1019,
  "tierReason": "Full review text"
}