{
  "showId": "the-lightning-thief-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2019/10/16/the-lightning-thief-half-gods-and-monsters-at-summer-camp/",
  "publishDate": "2019-10-16T21:51:37",
  "fullText": "So now we know: The Greek gods were not helicopter parents.\n\nThat’s the takeaway, at least, from The Lightning Thief: The Percy Jackson Musical, adapted from the popular young readers’ book by Rick Riordan, the first installment in a series that’s emerged as a sort of Harry Potter lite. The show follows the adventures of a group of “half-bloods”—not the offspring of witches and wizards and non-magical “Muggles,” as in J.K. Rowling’s novels, but the spawn of gods or goddesses and mere mortals. And rather than meeting at a school for superior beings, these teens cross path at a summer camp for misfits, where our titular hero is sent after being tossed out of three schools; the last expulsion occurs after Percy attacks a teacher, when she turns into a creature called a Minotaur. (Think Dementor, Potterheads.)\n\n“Mommy is too busy/Daddy is too busy,” the half-bloods sing in “Prologue/The Day I Got Expelled,” the first in a steady stream of catchy, if sometimes too cute, rock-flavored songs by composer/lyricist Rob Rokicki. Where other kids their age won’t be seen with their folks at the mall, these youngsters crave a sense of attachment, or even acknowledgment. Percy doesn’t even know who his old man is at first; though his mom offers a strong hint when she takes him on a stroll along the beach, he must first beg for a sign.\n\nPercy, who also suffers from ADHD and dyslexia, gets more than he bargains for, in the form of a “quest”—the highest honor a half-blood can receive—that will take him to the underworld and put him smack in the middle of a war involving the mightiest of gods. He’s joined, conveniently, by the smartest gal at camp, Annabeth, daughter of Athena and a history professor, and Percy’s goofy best buddy and “satyr,” or protector, a half-goat (um, get it?) named Grover.\n\nPotter fans are at this point welcome to draw their own comparisons, though the real problem with some of the characters in Lightning Thief is less their similarity to icons of contemporary fiction than their tendency to fall back on more general stereotypes. As written by librettist Joe Tracz (of Be More Chill fame, tellingly) and played by Chris McCarrell, Percy could be any number of disaffected, angst-ridden adolescents we’ve encountered lately. To Tracz’s and McCarrell’s and director Stephen Brackett (another Chill alum)’s credit—and Riordan’s—this protagonist is at least a bit more of a bad boy than Harry P.; when Annabeth cautions him that the gods will think they’re impertinent, he replies, with relish, “We are impertinent.”\n\nAnnabeth feels pretty generic as well, though Kristin Stokes makes the feisty, brainy heroine likable and invests her with a potent, if occasionally shrill, pop belt. Other cast members juggle two or more roles, in some cases inserting similar traits—the comic overzealousness shared by Grover and permanently irritated camp manager Mr. D (as in Dionysus), both played by Jorrel Javier, or the square-jawed, basso-voiced drollness of camp activities director Chiron and the god who turns out to be Percy’s dad, deftly played by Ryan Knowles.\n\nIn guiding them all, Brackett and choreographer Patrick McCollum aim for a youthful, even manic energy. The latter’s routines at times seem inspired by Bill T. Jones’s work on the original Spring Awakening, with the performers jumping about as if simply too restless to settle in their own skin. It’s in these moments that Lightning Thief, which I first caught during its off-Broadway run in 2017, fills the larger space here most effectively.\n\nDavid Lander’s flashy lighting and scenic designer Lee Savage’s immersive use of confetti and toilet paper add less to the picture, though their commercial instincts are solid enough. Like Riordan, the team behind Percy Jackson knows and frequently charms its audience—even if its call to fight the darker creatures that lurk within and outside us has been delivered many times with more imagination.\n\nThe Lightning Thief opened October 16, 2019, at the Longacre Theatre and runs through January 5, 2020. Tickets and information: lightningthiefmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
