{
  "showId": "the-lightning-thief-2019",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Frank Rizzo",
  "url": "https://variety.com/2019/legit/reviews/the-lightning-thief-review-musical-1203370223/",
  "playbillVerdictUrl": "https://variety.com/2019/legit/reviews/the-lightning-thief-review-musical-1203370223/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "McCarrell's believable boyishness, sweet vulnerability, gangly posturing and off-handed humor is appealing, and he manages to keep you engaged even if you've long lost interest in the details of the plot. His singing is sure, and in \"Good Kid,\" the best number in the musical, he shows in a heartbreaking way the pain of trying to fit in before he discovers that \"normal is a myth.\"",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LIGHTNING-THIEF-Opens-on-Broadway--The-Critics-Weigh-In-20191016",
  "fullText": "\"It's a lot to take in right now,\" says Percy Jackson, the teen hero of \"The Lightning Thief,\" the kid-centric fantasy musical (based on the popular Y.A. novel) that's now on Broadway after touring the country and playing an Off Broadway run.\n\nYou could say that's a bit of an understatement from contemporary teen Percy (Chris McCarrell), who discovers he's the spawn of a Greek god — literally. But he's not exactly sure which god. And, oh, by the way, Zeus's lightning bolt has been stolen and the gods are pissed because they think Percy took it and a battalion of monsters, minotaurs and furies are hot on his heels. But first he has to deal with some mean kids at summer camp.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n UFC 325 Livestream: How to Watch Alexander Volkanovski vs. Diego Lopes 2 Featherweight Title Fight Live Online \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n How to Watch 2026 Winter X Games: Aspen Live Online Without Cable for Free\n\nThe packed narrative may be child's play for fans of Rick Riordan's 2005 book — and there were plenty of enthusiasts in the audience on a recent night at the Longacre Theater, where the musical is having a limited run — but others will find the show and the bare-bones production simply myth-begotten.\n\nThe story is propelled by the clever premise that \"the gods are real and they have kids and they have issues.\" The eternal struggle between hapless youths and their all-powerful parents is given Olympian dimension here, as sung in a lyric in the campfire ditty: \"All things couldn't be worse/when your folks run the universe.\"\n\nThe show joins the fast-growing genre of youth-angst musicals (\"Dear Evan Hanson,\" \"Be More Chill\") that tap into that early Spielbergian vein of kids tormented by absent parents, learning disabilities or general geekiness. Percy suffers from all of the above, but copes thanks to a low-key, self-deprecating, super-nonchalant \"whatever\" spirit that can have its charms, even as it becomes a millennial cliche.\n\nMcCarrell's believable boyishness, sweet vulnerability, gangly posturing and off-handed humor is appealing, and he manages to keep you engaged even if you’ve long lost interest in the details of the plot. His singing is sure, and in \"Good Kid,\" the best number in the musical, he shows in a heartbreaking way the pain of trying to fit in before he discovers that “normal is a myth.\"\n\nThe rest of the mostly rock-pop songs are tuneful — especially \"Strong,\" \"The Last Day of Summer\" and \"Drive\" — but there are a few misses, too, especially with the character of Mr. D. (Jorrel Javier) — as in \"Dionysus\" — who is unfunny and overplayed, and has a god-awful song. (Javier is better as Percy's BFF, Grover, a satyr.)\n\nKristin Stokes is solid as Annabeth, another \"half-breed\" teen at the summer camp for demigods. Annabeth completes the young posse on its Poseidon adventure— though this trio bears no small resemblance to the Harry Potter threesome of fledgling heroes.\n\nAlso impressive in the cast is Ryan Knowles, as Percy's centaur mentor, Chiron. Knowles' sonorous voice, sly comic assuredness and cool trot brighten the production and bring a welcome adult into the room. Jalynn Steele also has her moments as Percy's mother, though the multiple roles the seven-member cast is asked to perform prove not so much wondrous as exhausting. The bare-bones look of the show and its not-so-special effects were no doubt the result of touring necessity. (The leaf blower and toilet paper bit is fun — once.) For a Broadway production, however, there’s a thin line between resourcefully inventive and cheap.\n\nStephen Brackett — who, with \"Be More Cool\" and \"A Strange Loop,\" has earned this year's title for kinetic staging — is here assisted by Patrick McCollum's choreography, and both collaborators keep things moving to a fault. Joe Tracz, who also scripted the overstuffed \"Be More Chill,\" inserts plentiful bits to distract from the crammed narrative. But platitudes like \"The things that make you different make you strong\" only reinforce the impression that Y.A. musicals need something extraordinary to make it to the adults' table.",
  "isFullReview": true,
  "textWordCount": 679,
  "archivePath": "data/archives/reviews/the-lightning-thief-2019/variety--frank-rizzo_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:38:46.768Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 679,
  "tierReason": "Full review text"
}