{
  "showId": "the-lifespan-of-a-fact-2018",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2018/10/18/theater/lifespan-of-a-fact-review-daniel-radcliffe-bobby-cannavale.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2018/10/18/theater/lifespan-of-a-fact-review-daniel-radcliffe-bobby-cannavale.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "If that's dry, the dryness is in some ways a fascinating choice. There used to be a genre of Broadway comedy meant to be topical but not emotional. Plays like 'Take Her, She's Mine,' 'Fair Game' and 'Norman, Is That You?' treated current social issues - the generation gap, divorce, gay liberation and such - as touchstones for an evening's light entertainment, and were welcome as such. So is this one.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-What-Did-Critics-Think-of-Daniel-Radcliffe-Cherry-Jones-and-Bobby-Cannavale-In-THE-LIFESPAN-OF-A-FACT-20181018",
  "fullText": "https://www.nytimes.com/2018/10/18/theater/lifespan-of-a-fact-review-daniel-radcliffe-bobby-cannavale.htmlShare full article48Advertisement\n\nWhen the journalist John D’Agatta wrote a play called “The Lifetime of a Fact” in 2003, he couldn’t have known that it would one day become a terrifically engaging Broadway drama starring a boy wizard.\n\nPlease note that there are six to eight mistakes in that sentence, depending on what you consider a mistake.\n\nFor one thing, “D’Agata” has only one “T.” The show that opened on Thursday at Studio 54, starring Daniel Radcliffe along with Bobby Cannavale and Cherry Jones, is not a drama but a topical comedy, and it’s called “The Lifespan of a Fact” — not the “Lifetime.”\n\nAlso, the play wasn’t written in 2003, or by Mr. D’Agata; rather, it was written, more recently, by a threesome whose official credit I would prefer to omit because, well, I just find it clumsy: Jeremy Kareken & David Murrell and Gordon Farrell.\n\nIf you think that’s lordly of me, wait until you get a whiff of the play’s ripe caricature of Mr. D’Agata, especially as inhabited by the swaggering Mr. Cannavale. “I’m not interested in accuracy,” he crows. “I’m interested in truth.” Which is why he doesn’t consider himself a journalist (that’s mistake No. 6) but rather a lyric essayist, for whom atmosphere takes precedence over facts and rhythm over reliability.\n\nSo does that mean he can just make stuff up, or fudge details, as I have been doing?\n\n“The Lifespan of a Fact” is based on a book of the same name that Mr. D’Agata wrote with Jim Fingal in 2012. That book, in turn, was based on an argument that began when Mr. Fingal, as a young intern, was assigned to fact-check an article — sorry, essay — that Mr. D’Agata had written about a teenager’s suicide at a Las Vegas resort in 2002.\n\nAs portrayed deliciously here by Mr. Radcliffe, who has now put the boy wizard persona well behind him, the character of Fingal is D’Agata’s spiritual and physical opposite: scruffy, small, awkward and perseverant. He is a mosquito to Mr. Cannavale’s lion. Assigned by the editor of a glossy New York magazine to fact-check the 15-page essay, he produces a 130-page spreadsheet outlining his queries.\n\nSome address tangible if arguable details: Were the resort’s paving bricks red, or, less interestingly, brown? Some are epistemological: How could D’Agata have known what he couldn’t have witnessed? And some suggest that the author has trespassed deep into the territory of flat-out fiction.\n\nNever more than now, with accusations of fake news flying, have these questions bedeviled writers — whether journalists or essayists or critics. Mistakes and lies and opinions are interchangeable with facts in the Twitterverse, creating a nimbus of doubt (and opportunities for “artistic” embellishment) around everything.\n\nThis apparently affects playwrights, too. The New York glossy that’s set to publish D’Agata’s essay in “The Lifespan of a Fact” is not where the real Mr. Fingal interned. He worked for a magazine called The Believer — then based in San Francisco — to which the essay was submitted after Harper’s Magazine rejected it because of factual inaccuracies. That’s assuming you believe accounts by The New York Times and The Daily Beast.\n\nAnd The Believer’s checking process, which in reality stretched to seven years, gets compressed in the play to a five-day ordeal with a looming deadline at the printer. Which wouldn’t matter except that, to anyone in publishing, the idea of plugging so many gaping factual holes in so little time seems ludicrous.\n\nWe can at least be grateful for one of the authors’ liberties: the invention of Emily Penrose, the fair but tough-minded editor of the magazine. Without her, “The Lifespan of a Fact” would just be two sides of an unchanging argument, repeated with variations ad infinitum.\n\nActually, that’s what it is anyway, but Penrose, serving as the fulcrum of the argument, gives it nuance and real-world meaning. She sees publishing in the context of a deteriorating ecosystem of knowledge, with enormous political and societal implications.\n\nThe role also gives Ms. Jones the rare chance to shine in lighter material than her customary Broadway assignments. Having her way with snappy, curse-speckled dialogue, she suggests a blend of Walter Burns and Hildy Johnson, the sparring editor and reporter from “The Front Page.”\n\nThat she is also, like those archetypally male characters, a totally professional creature makes this the rare play in which the female apex of the triangle is not a romantic figure. I give “The Lifespan of a Fact” big Bechdel points for this but also some engagement demerits. Foreclosing on every attempt Fingal makes to suss out details of her personal life, she forecloses on us as well.\n\nIf that’s dry, the dryness is in some ways a fascinating choice. There used to be a genre of Broadway comedy meant to be topical but not emotional. Plays like “Take Her, She’s Mine,” “Fair Game” and “Norman, Is That You?” treated current social issues — the generation gap, divorce, gay liberation and such — as touchstones for an evening’s light entertainment, and were welcome as such. So is this one.\n\nBut “The Lifespan of a Fact” clearly wants to be more than that, even if its raw material isn’t strong enough for drama. (For one thing, the original essay, eventually titled “What Happens There” and excerpted in the dialogue, is so purple it hardly seems worth the fuss.) The authors compensate by inflating D’Agata’s supposed artistry to Didion-like proportions and Fingal’s tenacity to mania.\n\nThough compression and exaggeration are key writing tools — I’m using them now — they are perhaps more suspicious in a play about the dangers of compression and exaggeration than in the kind of boulevard comedies that “The Lifespan of a Fact” otherwise resembles.\n\nHere they serve to disguise the “fact” that the variously conjoined authors never solved the problem of how to keep the conflict moving toward some climax — any more than D’Agata and Fingal ever agree on a definition of truth. After 95 minutes of plausible arguments on each side, the play ends with a shrug. They’re both right! And both wrong.\n\nSo was I mistaken — or just selectively truthful — in calling “The Lifespan of a Fact” “terrifically engaging” just 20 paragraphs ago? It might have been more accurate, if less marquee-ready, to have written “terrifically engaging but not as smart as it thinks.”\n\nThat this doesn’t much matter as the play pingpongs along is the result of a terrific comic staging by Leigh Silverman. With its cast, its dead-on timing, its perfect set by Mimi Lien and sound design by Palmer Hefferan, it would probably nail its laughs even without the dialogue. It’s what you call a good time.",
  "isFullReview": true,
  "textWordCount": 1118,
  "archivePath": "data/archives/reviews/the-lifespan-of-a-fact-2018/nytimes--jesse-green_2026-02-05.html",
  "textFetchedAt": "2026-02-05T05:05:30.765Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250801011407",
  "archiveOrgUrl": "http://web.archive.org/web/20250801011407/https://www.nytimes.com/2018/10/18/theater/lifespan-of-a-fact-review-daniel-radcliffe-bobby-cannavale.html",
  "contentTier": "complete",
  "wordCount": 1118,
  "tierReason": "Full review text"
}