{
  "showId": "trouble-in-mind-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2021/11/18/trouble-in-mind-a-delayed-debut-still-fresh-and-troubling/",
  "publishDate": "2021-11-18T20:52:45",
  "fullText": "If a Broadway season in which Black playwrights are substantially represented has been a long time coming, the presence of one work is especially overdue. Trouble in Mind, by Alice Childress, the lavishly talented writer of plays and novels—among the latter the young adult classic A Hero Ain’t Nothin’ but a Sandwich—first premiered off-Broadway in 1955, and was optioned for a Broadway transfer at that time, four years before Lorraine Hansberry became the first Black female dramatist to be produced on the Great White Way. But Childress’s producers wanted certain concessions; Trouble’s account of a white director trying to stage a play about race relations written by a white man, with white and Black actors, apparently cut a little too close to the bone.\n\nSixty-six years later, it may be hard to appreciate how daring Childress was in her time. But Roundabout Theatre Company and director Charles Randolph-Wright have ensured that Trouble’s eloquence and bite remain intact, with an excellent ensemble cast that features both estimable veterans and rising talent. LaChanze leads the company as Wiletta Mayer, an actress of a certain age; she won’t give a number when asked early in the play, by a considerably older fellow who works as a doorman in the theater where she’s rehearsing her latest project. Henry, endearingly played by Simon Jones, recognizes Wiletta from seeing her perform more than twenty years ago, and being enchanted by her beauty and her singing, so it’s immediately established that the character has enjoyed some success and is reasonably well-preserved.\n\nOne could say much more for LaChanze, who will turn sixty in December but could pass for two decades younger, still exuding the kind of intrinsic glamor you can’t buy in any department store. Of course, Wiletta has had her struggles; as it is soon suggested, she has had to swallow her pride on more than a few occasions—a dilemma that Childress, who was also an actress herself, understood well, and drew on for the play—and there is weariness beneath her sparkling surface. “White folks can’t stand unhappy Negroes,” she warns John Nevins, the eager young actor cast her son, played by a charming Brandon Micheal Hall. “So laugh, laugh when it ain’t funny it all.”\n\nSuffice it to say that Wiletta will betray her own advice, and deeply regret having given it, as rehearsals get underway for the play within the play, Chaos in Belleville, which follows a young Black man named Job—subtle, huh?—facing a lynch mob in his Southern town. The son of sharecroppers, Job wants the right to vote, and ends up paying the ultimate price. Al Manners, the lump of vanity who is Chaos‘s director, fancies the play progressive, but as the actors begin reading lines, it’s soon revealed as a laughable melodrama. Wiletta keeps her game face on for a while, dutifully wringing her hands and singing spirituals as the other actors, Black and white, field Chaos‘s stilted dialogue and engage in similarly silly antics. It’s all pretty funny, until it isn’t—until the condescension and artifice are suddenly too much for Wiletta to bear, and Randolph-Wright adroitly guides his own company through Childress’s delicate balance of satire and sobering commentary.\n\nLaChanze is luminous and fierce in the central role, showing us the dignity and warmth that have sustained Wiletta where others might have simply become embittered. Another musical theater stalwart, Chuck Cooper, has a poignant turn as Sheldon Forrester, the veteran actor cast as Job’s father, whose obsequiousness contrasts with Wiletta’s rising pique, while Michael Zegen captures Manners’s unconscious arrogance to almost chilling effect. Don Stephenson and Danielle Campbell deliver deft comic performances as the white cast members, Bill O’Wray and Judy Sears—respectively, a latently racist character actor and a well-meaning but clueless ingénue—and Jessica Frances Dukes adds more punch as Millie Davis, a Black actress who is older than Judy but younger than Wiletta, and hasn’t quite arrived at the latter’s level of frustration, yet.\n\nThe stark, spacious set—designed by Arnulfo Maldonado, making his Broadway debut after doing fine work in other houses—evokes both Wiletta’s warmer memories and the ghosts of those who have labored before her, under similar or worse circumstances. While Trouble in Mind clearly and potently reflects its era, its enduring freshness speaks to how much progress has yet to be made.\n\nTrouble in Mind opened November 18, 2021, at the American Airlines Theatre and runs through January 9, 2022. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
