{
  "showId": "trouble-in-mind-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2021/11/18/trouble-in-mind-better-as-theatrical-history-lesson-than-drama/",
  "publishDate": "2021-11-18T20:51:04",
  "fullText": "If you follow the New York theater scene, you’re by now well aware of the importance of the Roundabout Theatre Company’s new production of Alice Childress’ 1955 play Trouble in Mind. This satirical drama about an interracial acting company rehearsing a drama about lynching was first seen Off-Broadway in 1955 to great acclaim. The work was scheduled for a Broadway production but was cancelled when the playwright refused to make changes, including a happy ending, that would make it more palatable for white audiences. Although it has been widely seen across the country in regional theaters, it is only now making its Broadway debut 66 years later.\n\nIn the process, Childress lost the opportunity to become the first Black female playwright to have her work presented on Broadway, with the honor instead going to Lorraine Hansberry, whose A Raisin in the Sun debuted four years later in 1959.\n\nThe play’s backstory is indeed so compelling that the Roundabout recounts it in a brief pre-show curtain announcement which naturally elicits cheers. And then the play begins, and it doesn’t take long for cold, hard reality to sink in: Trouble in Mind proves an uneven, problematic work whose history is more powerful than what we see onstage.\n\nSet backstage at a Broadway theater, the play revolves around the rehearsals for a drama entitled “Chaos in Belleville,” written by a white playwright and concerning a lynching in a Southern town. The first to arrive is the play’s star Wiletta Mayer (LaChanze), heading up a company composed of eager newcomer John (Brandon Michael Hall); the highly competitive Millie (Jessica Frances Dukes); the older veteran Sheldon (Chuck Cooper); and two white performers, ingenue Judy (Danielle Campbell) and nervous character actor Bill (Don Stephenson). Tellingly, the play’s director, Al Manners (Michael Zegen, The Remarkable Mrs. Maisel), stage manager Eddie (Alex Mickiewicz) and even the elderly gofer Henry (stage veteran Simon Jones, nearly unrecognizable under a giant white beard), are white.\n\nMuch of the first act is composed of relatively trivial banter, mostly genial but occasionally hostile, among the company members and director Manners, a young Hollywood hotshot who has very definite, Method Actor-style ideas about how the material should be played. At one point, he even conducts a word association test on a baffled Wiletta, prompting her with such racially charged terms as “Montgomery,” “colored” and “lynching.” She responds by launching into a spiritual song, which thankfully provides one of several opportunities for LaChanze to show off her glorious pipes. (Cooper also gets to unleash his powerful singing voice, but unfortunately all too briefly).\n\nThe conflict between Wiletta and the tyrannical, manipulative Manners forms the heart of the play, eventually leading to an explosive confrontation toward the end in which she rebels against the manner in which she and the other Black performers have to contort themselves to conform to white stereotypes.\n\nChildress’ themes are compellingly prescient and tragically still relevant, but the ham-fisted way in which they’re presented here proves frustratingly didactic. The evening starts out in lighthearted, comical fashion, although the laughs are meager at best, with virtually nothing happening plotwise in the first half. Along the way, we’re presented with laborious scenes from the play-within-a-play, which only further slows things down. The more serious moments, such as Sheldon’s monologue about witnessing a horrible lynching incident from his youth (strongly delivered by Cooper), and Wiletta finally asserting herself, feel more forced than organic.\n\nDirector Charles Randolph-Wright doesn’t successfully balance the play’s comic and dramatic elements, with the result that the evening sometimes feels like a backstage comedy and other times like a polemic on race relations. The performances, too, vary in effectiveness, with the most memorable work coming from the luminous LaChanze, the veteran Cooper, and Dukes, who makes the most of the sardonic Millie.\n\nFrom a historical perspective, Trouble in Mind is an important, groundbreaking work. It’s just a shame that it feels so dated now upon its long belated Broadway premiere.\n\nTrouble in Mind opened November 18, 2021, at the American Airlines Theatre and runs through January 9, 2022. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars"
}
