{
  "showId": "trouble-in-mind-2021",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Ayanna Prescod",
  "url": "https://variety.com/2021/legit/reviews/trouble-in-mind-review-broadway-lachanze-1235114677/",
  "playbillVerdictUrl": "https://variety.com/2021/legit/reviews/trouble-in-mind-review-broadway-lachanze-1235114677/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "Alice Childress' timely play \"Trouble in Mind\" is finally getting its Broadway debut — after a 65-year wait. The late playwright's first full-length work, about discrimination and imbalanced power dynamics in the theater industry, was produced Off Broadway in 1955 with the plan of moving it to Broadway in 1957. However, Childress refused to bow to the demands of producers who urged her to \"tone down\" the play's powerful conclusion.\n\nIt's a good thing she didn't. Without the last 20 minutes of this show, \"Trouble in Mind\" would be a draggy play about Black people working in a theater industry that offers them only roles as caricatures, Uncle Toms and yes-ma'amers. It's in the final moments when the audience is served substance and in-your-face reality.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Michael J. Fox Says Retiring in 2020 Was 'Non-Emotional' and Finally Acting Again Is 'Not the Beginning of Any Campaign to Reestablish My Career'\n\nIt seems unbelievable this play from the 1950s fits so neatly into the 2021 Broadway puzzle. In the aftermath of the country's racial reckoning and amid the ongoing call for Black lives to matter, a predominantly white-run American theater industry has finally held a mirror up to itself. What the Great White Way is only fully recognizing now, Childress long ago detailed in a play that, despite its trenchant observations, takes too long to get to the point.\n\nWhat helps smooth this show's slow race to the crux is the stellar acting from a cast led by Tony winner LaChanze, under the marvelous direction of Charles Randolph-Wright. Set in a New York City Broadway theater in the 1950s, \"Trouble in Mind\" is a race play within a race play following rehearsals of \"Chaos in Belleville,\" a new show about a lynching that takes place in a predominately white southern town.\n\nAt the center of \"Trouble in Mind\" is Wiletta Mayer (LaChanze), a veteran, African American actress who dreams of starring in a role of substance, but has spent her entire career playing stereotypical Black characters. A performer best known for her work in musicals, LaChanze is this production's heartbeat. In her first lead role in a Broadway play, she delicately embodies a middle-aged woman who deeply loves an art form that ignores her. In an instant she transforms from the childlike act Willetta puts on for her white director to the strong façade she projects for her Black castmates.\n\nSupporting her is a stacked roster filled with Broadway elite and newcomers who are equally as brilliant. Quick-witted Millie Davis (a hysterical Jessica Frances Dukes) serves as the show's comedic relief and offers jokes with a side of veracity. Al Manners (a convincing Michael Zegen) stands in as the play's condescending white director with a performance that offers little to like, but lots to believe, while Sheldon Forrester, played by a compelling Chuck Cooper, summons moments of wisdom.\n\nArnulfo Maldonado's detailed set design gives the show a practical backdrop that could be any Broadway production in rehearsal, and Emilio Sosa's dazzling costume design dresses the cast in colors that amplify their skin tones and conjures the era by prioritizing elegance and formality.\n\nIn \"Trouble in Mind,\" Childress fearlessly unmasked the theater's deeply rooted racism. Something that the playwright struggled with in the ’50s still chimes loudly in present day. The work begs to be seen; it's just a shame audiences have to wait until the final moments of Act II to hear the exasperated voice of an actor fed up with a system that has minimized her enormous talent because of her Blackness.",
  "isFullReview": true,
  "textWordCount": 593,
  "archivePath": "data/archives/reviews/trouble-in-mind-2021/variety--ayanna-prescod_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:44:50.132Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 593,
  "tierReason": "Full review text",
  "bwwExcerpt": "At the center of 'Trouble in Mind' is Wiletta Mayer (LaChanze), a veteran, African American actress who dreams of starring in a role of substance, but has spent her entire career playing stereotypical Black characters. A performer best known for her work in musicals, LaChanze is this production's heartbeat. In her first lead role in a Broadway play, she delicately embodies a middle-aged woman who deeply loves an art form that ignores her. In an instant she transforms from the childlike act Willetta puts on for her white director to the strong façade she projects for her Black castmates.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-TROUBLE-IN-MIND-Opens-On-Broadway-Starring-Tony-Winner-LaChanze-20211118"
}
