{
  "showId": "and-juliet-2022",
  "outletId": "deadline",
  "outlet": "Deadline",
  "criticName": "Greg Evans",
  "url": "https://deadline.com/2022/11/and-juliet-broadway-review-max-martin-1235173880/",
  "publishDate": "November 17, 2022",
  "fullText": "It’s not that & Juliet is unenjoyable – it isn’t. Somewhere beneath the bombast and repetition and overwrought-from-minute-one approach is a sweet(ish) and smart(ish) tale that gives voice to the marginalized and, not incidentally, provides fans of the music of Britney Spears, Backstreet Boys, Katy Perry, Kesha, Demi Lovato, Ariana Grande, Bon Jovi, Celine Dion, Pink and Justin Timberlake a chance to hear their favorite songs in a musical that makes no secret of its identity: A jukebox takes early pride of place on the set.",
  "isFullReview": false,
  "dtliExcerpt": "Lorna Courtney and '& Juliet' cast Matthew Murphy What if Juliet had lived? What if she had not given her 14-year-old life for a wild boy she barely knew? What if she had not let brash youthful narcissism deformed by the patriarchy and male violence overtake her better judgment and lived a full, happy, maybe even quiet life well into whatever passed for adulthood in 14th Century Verona. Directed by Luke Sheppard and choreographed by Jennifer Weber, & Juliet, the new jukebox musical of songs written by super-producer Max Martin (&#8220;and friends,&#8221; as the credits read), with a book by Schitt&#8217;s Creek writer David West Read, posits an answer to all those questions, though &#8220;quiet&#8221; never quite enters the equation. No, had Juliet lived, this musical, opening tonight on Broadway at the Stephen Sondheim Theatre, suggests she and her pals would spend a great deal of their time belting ballads of empowerment and lecturing all within earshot about pride, identity and other important takeaways of the 21st Century. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-dsk-tab-mid-article1-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid\",\"mid-articleX\",\"mid-article\",\"300x251\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[2,2],[300,250],[620,350],[300,251],[501,282],[3,3],[2,4],[4,2],[620,366]]) .exemptFromSleep() .setClsOptimization(\"minsize\") ; }); Related Stories Casting &#039;Just In Time&#039;: Jeremy Jordan To Succeed Jonathan Groff As Broadway&#039;s Bobby Darin",
  "showScoreExcerpt": "\"Itâs not that '& Juliet' is unenjoyable â it isnât. Somewhere beneath the bombast and repetition and overwrought-from-minute-one approach is a sweet(ish) and smart(ish) tale that gives voice to the marginalized.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T04:57:18.264Z",
  "dtliThumb": "Meh",
  "bwwExcerpt": "It's not that & Juliet is unenjoyable - it isn't. Somewhere beneath the bombast and repetition and overwrought-from-minute-one approach is a sweet(ish) and smart(ish) tale that gives voice to the marginalized and, not incidentally, provides fans of the music of Britney Spears, Backstreet Boys, Katy ..."
}
