{
  "showId": "and-juliet-2022",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/theater/theater-reviews/and-juliet-broadway-review-max-martin-musical/",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n& Juliet review: Hit me Shakespeare one more time\nA classic tale gets a twist — and a full pop treatment — in Broadway's newest jukebox musical.\n\nThe Venn diagram of Shakespeare and Britney Spears turns out to be much closer to a perfect circle than any Broadway fantasist might have guessed in & Juliet, a busy, exuberant jukebox musical opening this week at the Stephen Sondheim Theatre. To be fair, Britney doesn't have to carry the load alone; book writer David West Read has the benefit of Swedish pop godhead Max Martin's full catalog at his disposal — nearly 30 millennium-straddling hits from the Backstreet Boys, Katy Perry, Kelly Clarkson, Ariana Grande and more.\n\nThe premise is simple: What if Juliet (Lorna Courtney) woke up from her sleeping draught, saw Romeo dead, and decided… to live? Or at least that's the pitch Sir William (Kinky Boots' Stark Sands) gets from his long-suffering wife, Anne (Betsy Wolfe). She's watched him write enough tragedies, and she has her own ideas for happier endings, if he'll allow her to offer up a few suggestions to the tune of Backstreet's \"I Want It That Way.\"\n\nJuliet might be a widow, but she is, after all, only 14. Why not leave this messy Capulets-and-Montagues business behind and run off to Paris with her best friend, May (Justin David Sullivan), and beloved nurse, Angelique (Melanie La Barrie)? They can have adventures, go clubbing, maybe find somebody to make out with by the end of the night. But not before she grieves just a little bit for her lost love (cue \"Baby One More Time.\")\n\nIf the cast and costumes and bright neon signage that greets showgoers at the door haven't yet made it abundantly clear, this is pure Gen Z Shakespeare, as blithely modern and self-aware as Riverdale. Read, probably best known as a writer and executive producer of Schitt's Creek, plays with the Bard's language like a kitten with a ping-pong ball, letting it skim and ricochet across the stage. His story beats, though, are cleverly, sometimes ingeniously calibrated to sync with the songs, as when May questions their gender identity to Spears' \"I'm Not a Girl, Not Yet a Woman\" or when one character's unwelcome return compels a raucous chorus of Clarkson's \"Since U Been Gone.\"\n\nThe choreography, by Jennifer Weber (KPOP), is energetic if not particularly inspired, landing somewhere between High School Musical and So You Think You Can Dance, and the hectic let's-put-on-a-show energy has an undeniable cruise-ship tilt to it. But Courtney, a Queens native whose Broadway credits include Dear Evan Hansen and West Side Story, is a tiny dynamo, her singing voice scraping the rafters on showstopper anthems like \"Stronger\" and \"Roar.\" Romeo, played on this preview night by understudy Brandon Antonio, becomes a deliciously dim himbo, and Wolfe, as a Renaissance housewife desperate to breathe the air out there, brings a great, spiky irreverence to her disgruntled Anne. Read's script makes room in this explosion of youth for her more muted dreams and tribulations, along with a budding queer romance for May and a midlife second chance at love for Angelique and her long-ago suitor Lance (Paolo Szot).\n\nThe set design, by Soutra Gilmour (Macbeth, Evita), comes in every shade of strobe light and confetti, and West End director Luke Shepard (In the Heights) keeps it all moving at a headlong clip, even as the production wends toward two and a half hours. (No one will emerge from & Juliet with the knowledge to pass a pop quiz on soliloquies, though Sand's preening William gets a few great, punny winks at his own iconography.)\n\nAs much as the show feels directed toward a strenuously young demographic — some of them possibly not even born yet when Backstreet were harmonizing their fire, or their one desire — the script makes several knowing nods, much like a Pixar movie, to the ancient grown-ups in the room. There's something a little relentless about & Juliet's dogged eagerness to entertain, but nakedly joyful too: a star-crossed night of violent delights, flipped for the TikTok era. Grade: B+",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 686,
  "archivePath": "data/archives/reviews/and-juliet-2022/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:26:02.149Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "sourceMethod": "scrapingbee"
}