{
  "showId": "and-juliet-2022",
  "outletId": "ny-theatre-guide",
  "outlet": "New York Theatre Guide",
  "criticName": "Joe Dziemianowicz",
  "url": "https://www.newyorktheatreguide.com/reviews/and-juliet-broadway-review",
  "publishDate": "November 17, 2022",
  "fullText": "Anne Hathaway – the wife of William Shakespeare, not the Oscar-winning actress – has a message for her famous husband. In a nutshell: Your star-crossed-lovers tragedy stinks.\n\nThat's the start of & Juliet, a slim but cheeky and eager-to-entertain jukebox musical bursting with chart-toppers made famous by Britney Spears, Katy Perry, Bon Jovi, Celine Dion, Backstreet Boys, and other pop stars.\n\n\"What if Juliet didn't kill herself?\" muses Anne (Betsy Wolfe, goofy, gutsy, and serving gale-force vocals), who convinces Will (Stark Sands) to collaborate on a rebooted story. So long, Verona and stifling parents keen on locking her up in a nunnery. Freedom awaits! Juliet (the terrific Lorna Courtney), now 22 in the revised tale, considers life on her own terms.\n\nShe makes a beeline for Paris with her nurse (Melanie La Barrie, reprising her role from the show's London premiere), a new non-binary BFF May (Justin David Sullivan), and another pal, April – who is actually Anne. She and Shakespeare write themselves into the revision; he's a carriage driver. Along the way, some 30 hits from the Max Martin catalog, including \"...Baby One More Time,\" \"Roar,\" and \"Since U Been Gone,\" knit the narrative together.\n\nThis setup happens with surprising speed and economy. The early zippy energy is a big plus. Vibrant visuals are another. Director Luke Sheppard's staging makes great use of projections, flying set pieces, and a levitating circular platform to showcase dramatic moments and athletic dance moves by choreographer Jennifer Weber.\n\nThere's plenty of drama in France after Juliet and company meet Francois DuBois (Philippe Arroyo), who's looking for love, and his stern father Lance (Tony winner Paulo Szot, game but frequently upstaged by his codpiece), who shares a secret history with Juliet's nurse.\n\nThanks to Will's desire to stir the plot, dim Romeo (Daniel Maldonado, in for Ben Jackson Walker at a recent performance) pops up. The newly undead guy descends in a superdope (to borrow his term) and glitzy entrance.\n\nThe action unfolds in Shakespeare's era, but its heart and head are all about today. Costume designer Paloma Young pairs corsets, ruffs, and doublets with chunky boots and high-tops. There's also a shoehorn lurking in the wings. As in any jukebox musical, some tunes are wedged in, but others fit surprisingly well.\n\n\"I Want It That Way\" becomes a useful all-purpose expression of desire, while \"Oops! … I Did It Again\" neatly covers romantic missteps. \"Stronger\" lets Juliet's defiance toll. Romeo and Juliet's conflicted feelings churn into a raucous \"Problem/Can't Feel My Face.\"\n\nSchitt's Creek writer David West Read penned the story, and it's a mixed bag. & Juliet's feminist attitude and celebration of gender fluidity make it topical. Mispronunciations of Francois's surname makes way for (groan) DeBoy band jokes. And even with the youthful exuberance, the momentum sags whenever Anne and Will spar about the narrative — and they do it a lot.\n\nThe script looks to history (or Wikipedia?) to connect the dots between Anne, who Shakespeare disregarded, and suicidal Juliet. Creative license abounds, of course, but the script breezes over the fact that if Romeo is alive, then Juliet is still married. That puts a kink in major plot developments. In the end, the show has no fewer than three separate conclusions.\n\nTo see or not to see any or all of that as just nitpicking? Theatregoers out for a silly good time likely won't care as they hum along with & Juliet.",
  "isFullReview": true,
  "showScoreExcerpt": "\"The action unfolds in Shakespeareâs era, but its heart and head are all about today...As in any jukebox musical, some tunes are wedged in, but others fit surprisingly well...Theatregoers out for a silly good time likely wonât care as they hum along with '& Juliet'.\"",
  "originalScore": null,
  "assignedScore": 82,
  "source": "playwright-scraped",
  "dtliThumb": "Up",
  "scrapedAt": "2026-01-23T05:35:00.000Z"
}
