{
  "showId": "and-juliet-2022",
  "outletId": "NYTHTR",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "https://newyorktheater.me/2022/11/17/juliet-broadway-review-britney-shakespears/",
  "publishDate": "2022-11-17",
  "fullText": "Posted in Broadway , musical , New York Theater , Theater Reviews &#038; Juliet Broadway Review. Britney Shakespears? Author: New York Theater Published Date: November 17, 2022 Leave a Comment on &#038; Juliet Broadway Review. Britney Shakespears? The Bard takes a back seat to the Backstreet Boys and Britney Spears in “& Juliet,” a jukebox musical that is being billed as a sequel to Shakespeare’s “Romeo and Juliet,” imagining Juliet’s life if she hadn’t killed herself when Romeo did. The plot winds up more busy and berserk than that description, and, in any case, the show is primarily a vehicle for the hits of Max Martin. Over the last twenty-five years, Martin, a Swedish songwriter and music producer born Karl Martin Sandburg, has written or co-written more number one singles on the pop charts than anybody ever except Paul McCartney and John Lennon. “& Juliet” features a whopping thirty-one of Martin’s songs – made popular by more than a dozen pop stars, boy bands, and rock groups (See playlist below) – and sung by a cast with glorious pop voices and fine comic chops. The show has a silly and funny book by David West Read (“Schitt’s Creek”), who is often clever in the way he works in the songs, although that cleverness is less obvious if you don’t already know the songs and their original context. . “& Juliet” begins with someone announcing the first-ever performance of “Romeo and Juliet,” whereupon William Shakespeare (Stark Sands) makes a dramatic entrance, rising up from below the stage and singing “Larger Than Life,” a 1999 hit by the Backstreet Boys (one of the six hits in the show by that group, a quantity matched only by Britney Spears.) To Shakespeare’s surprise, he is joined by his wife Anne Hathaway (Betsy Wolfe.) She is visiting from Stratford-upon-Avon, feeling neglected, and annoyed that he has killed off Juliet in the play. “It seems like she’s got her whole life ahead of her, she’s only had one boyfriend. Maybe she doesn’t kill herself just because he killed himself?” She insists he change the script so that she lives; he resists. They break into “I Want It That Way,” another 1999 hit by the Backstreet Boys. Martin reportedly had not yet mastered the English language when he wrote “I Want It That Way,” and even his co-writer on the song Andreas Carlsson has said that the lyrics make no sense. In “& Juliet,” they finally do; husband and wife are disagreeing over whether to bring Juliet back to life. Anne wins out: Juliet doesn’t die. The next scene begins the supposedly revised “Romeo and Juliet,” with Juliet (Lorna Courtney) singing to a sarcophagus the Britney Spears hit “Baby One More Time” – which includes the lyric “I must confess that my loneliness is killing me now.” But then Juliet attends Romeo’s funeral, and discovers Rosaline there already, who tells her she too dated Romeo, and then Portia, who also dated him, and soon a dozen other of Romeo’s former lovers. They all start singing the Backstreet Boys hit “Show Me the Meaning of Being Lonely.” Juliet feels liberated to pursue new passion, traveling to Paris to escape her parents, Lord and Lady Capelet, who want to put her in a nunnery. During the plot, which we are meant to understand we are witnessing as it unfolds spontaneously in real time, William and Anne pop up on occasion to bicker about what happens next, and try to outmaneuver one another to push the story one way or another. Anne also inserts herself into the play as April, one of the many newly invented characters. Read knows his Shakespeare well enough to sprinkle allusions in the show, and to take some well-aimed comic shots. At a party at a Paris castle, Juliet meets Francois Du Bois (Philippe Arroyo), they have a couple of duets and then spend the night together – chastely. She explains she’s not “looking to rush into anything right now. I just got out of a pretty serious relationship…” How long were you together, Francois asks. “Four days. Almost. But it ended pretty badly.” But Shakespeare is just one of the inspirations for “& Juliet,” which has elements that reminded me of any number of recent shows: “Something Rotten” of course (both create a self-regarding character named William Shakespeare for some inspired silliness that would be libel to label Shakespearean,) but also “Head Over Heels” (both render an old classic unrecognizable and serve up a pop playlist; both also feature gay/queer/gender-fluid characters; LGBT love becomes central to the plot in “& Juliet”) and “Six” (both have a feminist spin, both mash together a little Tudor with a little punk, although Paloma Young’s costumes are more playful and less blunt-force mashup than Gabriella Slade’s in “Six”); plus every show determined to be Broadway Entertainment (they employ what I refer to as the Broadway Effect: bright lights flashed in our eyes; loud thumping music blasted in our ears; barrels of confetti dumped on our heads.) Director Luke Sheppard isn’t shy in acknowledging what is most likely to dr...",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 70,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T04:54:09.726Z",
  "bwwExcerpt": "The Bard takes a back seat to the Backstreet Boys and Britney Spears in \"& Juliet,\" a jukebox musical that is being billed as a sequel to Shakespeare's \"Romeo and Juliet,\" imagining Juliet's life if she hadn't killed herself when Romeo did. The plot winds up more busy and berserk than that descripti..."
}
