{
  "showId": "and-juliet-2022",
  "outletId": "OBSERVER",
  "outlet": "Observer",
  "criticName": "Rex Reed",
  "url": "https://observer.com/2022/11/review-the-excruciating-juliet-fails-on-every-level/",
  "publishDate": "2022-11-18",
  "fullText": "& Juliet | 150 min with an intermission | STEPHEN SONDHEIM THEATRE 124 W 43RD ST, NYC By clicking submit, you agree to our <a href=\"http://observermedia.com/terms\">terms of service</a> and acknowledge we may use your information to send you emails, product samples, and promotions on this website and other properties. You can opt out anytime. Although the moronic new Broadway show & Juliet at the theater newly named for Stephen Sondheim (who must be turning over in his grave) calls itself a “musical,” the “music” is lousy enough to demand a new definition of the word, while everything else onstage adds up to nothing more than two-and-a-half hours of trash. I gave up trying to figure out what motivated Luke Sheppard (director), Max Martin (book and lyrics) and David West Read (book) to pursue the lame idea of fabricating a threadbare narrative that asks the question “What if Romeo died but Juliet didn’t kill herself but lived on to bore everybody else to death?” It’s a stupid idea imported from London, proving we live in a time when garbage litters the theatrical landscape everywhere. The premise: Anne Hathaway, a.k.a. the wife of William Shakespeare, can’t settle for the fact that her husband wrote one of the world’s tragic masterpieces, and nags him mercilessly to change it, adding new characters, new plot twists that barely contain enough energy to keep the audience from snoring, lots of sex and a happy ending laced with screaming rock and pop. The Capulets want to lock up Juliet in a convent, but she’s an early precursor of the #MeToo movement and something of a drum beater for bad taste, so she defies parental authority and heads off on her own to discover sex and cacophonic songs like “Show Me Love,” “Show Me the Meaning of Being Lonely” and “I’m Not a Girl, Not Yet a Woman” that should only be heard with your fingers in your ears. For reasons that make no sense, the action moves to Paris, which has indoor toilets, its own DJ, and is more boring than anyone ever dreamed of in the year 1595. So boring, in fact, that Juliet can scarcely find the verve to hang from a chandelier. She almost marries a boy named Francois, but everything shifts gears again when Francois (Philippe Arroyo) kisses a boy named May and falls for his cherry-flavored Chapstick while they sing “I kissed a boy and I liked it.” From here, the trash turns to confusion. Romeo comes back from the dead, which causes a rift between the Shakespeares, and expects Juliet to pick everything where they left off, wooing her the night before her wedding to Francois (now called Frankie). Frankie is torn between being a man to Juliet and being a woman to May. They all rhyme “Please don’t give up” with “You messed me up.” And every time you think it is mercifully going to end, it drags on some more, under the club-footed direction of Luke Sheppard. Everything fails on every level. The garish, vulgar sets by Soutra Gilmour look like exploding neon banana splits. Paloma Young’s 16th century costumes are eyesores consisting of miniskirts, knee socks and oversize tennis shoes. Jennifer Weber’s alleged “choreography” repeats the same jerky movements over and over again in every number, featuring nothing more than jumping around like spastic penguins. The songs are execrable, but as bad as they are they sound even worse screeched in the style of melisma better suited to gospel than pop-rock. The exception is Betsy Wolfe as Anne Hathaway, who proved she can sing in previous, much better shows with the proper material. The same goes for Paulo Szot, saddled with a corny French accent and songs without melodies. He won a Tony award for his Broadway debut as Emile de Becque in Lincoln Center’s highly praised South Pacific. What a crime to see his talent so wasted in a score that can only be dismissed as dismal. By the end of two-and-a-half hours of this torture, exacerbated by the tumultuous applause of a young audience acting as if they were cheering the World Series from the infield seats at Yankee Stadium, I felt like I was on the verge of a nervous breakdown. & Juliet is quite the most excruciating experience I’ve had on Broadway in decades.",
  "showScoreExcerpt": "\" '& Juliet' is quite the most excruciating experience Iâve had on Broadway in decades.\"",
  "originalScore": null,
  "assignedScore": 25,
  "source": "reviews-json-stub",
  "needsFullText": true,
  "textStatus": "complete",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.957Z",
  "textWordCount": 720,
  "textFetchedAt": "2026-01-25T14:23:08.618Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/and-juliet-2022/OBSERVER--rex-reed_2026-01-25.html",
  "textQuality": "full",
  "sourceMethod": "stub"
}
