{
  "showId": "and-juliet-2022",
  "outletId": "TMAN",
  "outlet": "TheaterMania",
  "criticName": null,
  "url": "https://www.theatermania.com/broadway/news/review-and-juliet-musical-broadway_94560.html",
  "publishDate": "2022-11-17",
  "fullText": "Juliet gets to survive in this pop musical, transplanted on Broadway from London's West End.\n\nAs an audience member at Broadway&#39;s newest jukebox musical\n\nJudging by the performance I witnessed, which had the added challenge of playing to some of the most jaded theater insiders, most are opting for the latter — and yes, against my most crotchety instincts, I include myself in that category. Now, before all you Broadway doomsayers start stocking up on bottled water, this is not a sign of the apocalypse. It simply demonstrates the same scientific principle that impels your snobbiest Radiohead friend to choose &quot;Oops!&#8230;I Did It Again&quot; at karaoke.\n\nThat&#39;s not the right Shakespeare play. But let&#39;s be honest,\n\nLeading this rom-com fantasy is Lorna Courtney in a star-making performance. Her Juliet (aged up from the 13 years Shakespeare gave her for comfort&#39;s sake) is smart but impetuous, charismatic but never bubbly, innocent but far from naïve. It also doesn&#39;t hurt that Courtney&#39;s vocals rival those of most of her songs&#39; original artists. She&#39;s joined by Justin David Sullivan, who plays her best friend May — a nonbinary character with whom Juliet unknowingly enters a love triangle with the young Parisian François &quot;Frankie&quot; Du Bois. Philippe Arroyo plays this charmingly skittish prince who is being pressured by his alpha male father Lance to marry. And nothing quite says alpha male like Paulo Szot&#39;s booming baritone (indeed, we have fully departed from Shakespeare at this point).\n\nSullivan adds some pathos to the mix with their sweet performance of &quot;I&#39;m Not a Girl, Not Yet a Woman&quot; — one of the only breaks we get from the onslaught of high-octane power ballads and dance numbers (Jennifer Weber lends exciting hip-hop choreography). Don&#39;t get me wrong,\n\nIf you&#39;re looking for delicate artistry, you&#39;ll want to get off at the first exit ramp. But just like a satisfying pop song (take your pick of any of the 30 that are stuffed into this two-and-a-half-hour musical),\n\nJuliet is of course the centerpiece of this feminist reclamation, but the true protagonist of the musical is Shakespeare&#39;s discontented wife, Anne Hathaway, the author of this pop fever dream. Betsy Wolfe comes alive as the architect of\n\nIt&#39;s not hard to guess who will emerge victorious. But in the world of Shakespeare, a surprise ending was never in the cards.\n\nGet the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nBroadway performances start on March 27 at the Majestic Theatre.\n\nGet the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nBy providing information about entertainment and cultural events on this site, TheaterMania.com shall not be deemed to endorse, recommend, approve and/or guarantee such events, or any facts, views, advice and/or information contained therein.\n\n©1999-2026 TheaterMania.com, Inc. All Rights Reserved.",
  "originalScore": null,
  "assignedScore": 80,
  "source": "scraped",
  "needsFullText": true,
  "scrapedAt": "2026-01-23T21:59:33.802Z"
}