{
  "showId": "american-psycho-2016",
  "outletId": "news-tribune",
  "outlet": "News Tribune",
  "criticName": "Unknown",
  "url": "http://www.thenewstribune.com/entertainment/celebrities/article73246652.html",
  "playbillVerdictUrl": "http://www.thenewstribune.com/entertainment/celebrities/article73246652.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "They sell clear, plastic raincoats at the \"American Psycho\" concession stand on Broadway. If you think, \"Hey, that's a cute item for a rainy spring in New York,\" you may be in the wrong theater. If those raincoats send a shiver of dread down your spine, you've come to the right place.\n\nThe gloriously gory, sleek, over-the-top musical that opened Thursday at the Gerald Schoenfeld Theatre is a darkly wonderful adaptation of the once-controversial novel by Bret Easton Ellis.\n\nAnyone with an aversion to blood should stay away. Those who are sick of shows without a cutting edge — sorry — need to visit, if only to enjoy the skewering — again, sorry — of the 1980s.\n\nIt centers on an investment banker and not-so-secret serial killer obsessed with high-end clothes and beauty products who slashes his way through yuppie 1989 Manhattan, a city he both loathes and yet is obsessed with conquering. \"I'm not like you,\" he sneers at us and we're OK with that.\n\nChristian Bale starred in the 2000 film version and this time a thoroughly wonderful Benjamin Walker tries on the plastic raincoat (isn't that the same one used by \"Dexter\"?)\n\nWalker, who is a Patrick Bateman both superficial and a critic of superficiality, is built like an Adonis — hard not to notice since he spends most of the show in his underwear — and has a detached, menacing air. He manages to make his Bateman charming, evil and funny. (And a hint for stragglers after intermission: Get to your seat before he starts messing with you.)\n\nThere must be many ways to portray serial murder onstage but the creators haven't held back. Credit story writer Roberto Aguirre-Sacasa, songwriter Duncan Sheik and director Rupert Goold for going whole hog.\n\nGraphic sex acts, torturing, stabbing, slashing, axe-wielding, snorting coke off toilets, unsexy orgies and bones cracking are just part of the horrors. There's even a number in which Bateman dances with knives, a meat cleaver, a gun and finally a chain saw, killing as he boogies. It takes five workmen to mop up the blood at intermission.\n\nAguirre-Sacasa's story stays true to the novel but he has fun both looking back at 1989 — Bateman boasts of having a then top-of-the-line Walkman and a 30-inch TV — with forward-looking jokes that goof on Tom Cruise and Donald Trump. Things take a more surreal turn in the stronger Act 2 as we are left to ponder if these murders are just a figment of Bateman's imagination.\n\nSheik's electronic- and choral-based score is marvelously varied, from the touching duet \"Nice Thought\" to the dance-pop of \"You Are What You Wear,\" a clever tune about high fashion that rhymes Giorgio Armani with Norma Kamali. \"Selling Out,\" the musical's standout track, is infectious.\n\nSheik has also been true to the book by including songs of the era, including \"Everybody Wants to Rule the World\" by Tears for Fears and Phil Collins' \"In the Air Tonight\" — but changing their orchestration so they sound fresh. Listening to Huey Lewis' \"Hip to Be Square\" after this may never be light fun again.\n\nOthers who shine in this dark place are Es Devlin, whose scenic design keeps offering new perspectives on depravity amid chilly, turntable elegance, and Lynne Page, whose athletic choreography includes dancers leaping on tables and twitching convincingly when they're slashed.\n\nIn addition to Walker, the cast includes a deliciously airheaded Heléne Yorke as Bateman's girlfriend and a sweet, beautifully voiced Jennifer Damiano as Bateman's secretary. Alice Ripley plays several parts and is great in all but we'd love to see more.\n\nThe timing of \"American Psycho\" must surely be helped by the fact that this tale of yuppies obsessively eating charred mahi mahi and summering in the Hamptons comes during a new wave of disgust at Wall Street excess. It's raining their blood on Broadway. Come, but bring an umbrella.\n\nOnline: http://americanpsychothemusical.com",
  "isFullReview": true,
  "textWordCount": 652,
  "archivePath": "data/archives/reviews/american-psycho-2016/news-tribune--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T19:35:47.858Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "404 - Page not found"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20160425162244",
  "archiveOrgUrl": "http://web.archive.org/web/20160425162244/http://www.thenewstribune.com:80/entertainment/celebrities/article73246652.html",
  "contentTier": "complete",
  "wordCount": 652,
  "tierReason": "Full review text"
}