{
  "showId": "american-psycho-2016",
  "outletId": "theatermania",
  "outlet": "TheaterMania",
  "criticName": "Adam Feldman",
  "url": "https://www.theatermania.com/new-york-city-theater/reviews/american-psycho_75308.html",
  "publishDate": "April 21, 2016",
  "fullText": "Moliere’s ”Tartuffe” is transported to 21st-century America, complete with rhyming couplets about the current political scene.\n\nPlaywright Robert Brustein has found a perfect template in Molière's Tartuffe to lay bare the hypocrisy of America's movers and shakers for his latest play, Exposed. Presented by the Boston Center for American Performance and Boston's Playwrights' Theatre, Exposed takes Molière's characters from the 17th-century, dark-hued comedy and uses them as models. Mirroring their rhymed couplets in parts of the dialogue, Brustein rips subject and verse from the manners and mores of contemporary society. The production has been given a limited world premiere run at Boston Center for the Arts by the Boston University New Play Initiative.\n\nThe plot for Brustein's satire finds Seymour Sackeroff (Jeremiah Kissel), \"the third richest man in America,\" has moved from New York to a sumptuous ranching spread in Texas. Here he has established a fiefdom complete with his swinging mother, Hortense (Annette Miller), his fourth wife, the ex-chorus girl, Candy (Abby Goldfarb), daughter, Caroline (Annabelle Cousins), and his gay son, Ronald (Scott Barrow), named after Seymour's hero, Ronald Reagan.\n\nSeymour, a right-wing, gun-toting, climate-change denier, has installed the popular televangelist, Reverend Richard \"Dick\" Cockburn (Michael Hammond), as a guest in his house, to support his run for a seat in Congress. Dick, living up to his nickname, hides his lust for food, sleeping in, and women under a sanctimonious aura of prayer and Tea Party-like opinions that mimic the most outrageous of the political statements reported nightly on the newscasts.\n\nSeymour, who is in trouble with the Feds for ill-gotten gains from his casinos in Qatar, hatches a plan to marry Caroline to Dick, to her dismay. Bankrolled by his money, Seymour intends to propel Dick all the way to the White House, and install his daughter as First Lady. Although Dick might have fooled Seymour and his mother into believing his utterings of piety, the rest of the household has not been deceived. Caroline, Candy, and the maid, Maureen (Tess Wenger), determine to unmask Dick in an attempt to cure Seymour of his misplaced adoration of the man. For Molière, it was the gracious King who solved the problem; for Brustein it is an unexpected guest, a character milked to hilarious effect by Remo Airaldi.\n\nThe ensemble of excellent actors is led by Kissel, making the compliant millionaire into a credulous, dim bulb. Hammond provides the perfect foil, skillfully underplaying Dick until he is trapped in a masterfully staged seduction scene led by Candy. Airaldi is given a vaudeville-type song and dance, following a monologue that could double as a stand-up comic routine. Director Stephen Bogart brings the shtick to a rolling boil by the end of the 90-minute, intermissionless evening. Mary Sader's setting of the elegant ranch house, complete with heads of animals bagged by Seymour on the walls, provides an overstuffed, nouveau riche sight gag on its own.\n\nBrustein has cleverly transformed Molière's play by filling it with gags, pratfalls, Borscht Belt humor, and countless pokes at the rhetoric of the current candidates on the campaign trail. However, the constant repetition of the objects of Brustein's ire wear thin, leaving the impression of a stretched-out sketch from Saturday Night Live, rather than a fleshed out drama. Unlike Molière, who gave Tartuffe a darkly dangerous undertone and a bitter ending, Brustein lets his characters off lightly, as if they posed no real threat to a democratic society, despite the self-serving extremes of their intentions.\n\nReview: Jason Alexander Leaves a Little Gristle in New Production of Sweeney Todd \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Review: Manon!, Opera’s Have-It-All Girl \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Review: In The Porch on Windy Hill, Bluegrass Heals a Broken Family \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Review: Power Slips Away, One Lear at a Time, in King Lear at La MaMa \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Review: Blackout Songs, When Your Life Is One Long Night Out \n \n \n \n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Review: Stories of Childhood Told Through Dance in BLACK GIRL: Linguistic Play \n \n \n \n\n \n\n \n \n\n \n \n\n \n \n \n\n \n \n \n \n\n \n \n \n \n\n \n \n \n \n\n \n \n \n \n\n \n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n Theater News & discounts\n \n Get the best deals and latest updates on theater and shows by signing up for TheaterMania's newsletter today!\n\nBroadway performances start on March 27 at the Majestic Theatre.",
  "isFullReview": true,
  "dtliExcerpt": "Duncan Sheik's score is sophisticated and varied, moving fluidly between styles while maintaining a consistent sonic identity.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Duncan Sheik's score is sophisticated and varied, moving fluidly between styles while maintaining a consistent sonic identity.",
  "contentTier": "complete",
  "contentTierReason": "Short text (17 words)",
  "rejectedAt": "2026-02-03T13:26:15.658Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is a single sentence fragment describing the score, not a complete review with any verdict or recommendation about seeing the show.; openai: The text is a single sentence evaluating the score, not a full review of the show.",
  "promptVersion": "5.2.0",
  "textQuality": "truncated",
  "textWordCount": 678,
  "archivePath": "data/archives/reviews/american-psycho-2016/theatermania--adam-feldman_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:37:28.007Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "truncationSignals": [],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "wordCount": 678,
  "tierReason": "Full review text"
}