{
  "showId": "jekyll-and-hyde-2013",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "http://www.ew.com/ew/article/0,,20364394_20692464,00.html",
  "playbillVerdictUrl": "http://www.ew.com/ew/article/0,,20364394_20692464,00.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "''In each of us there are two natures,'' whispers a disembodied voice in the prologue to Frank Wildhorn's Jekyll & Hyde. Good and evil  the ''primitive duality of man,'' he continues (there quoting directly from Robert Louis Stevenson's 1886 novella The Strange Case of Dr. Jekyll & Mr. Hyde). ''It is the curse of mankind that these polar twins should be constantly struggling.''\n\nThe same could be said of the 1997 musical itself, now receiving an overamplified, dry ice-drenched Broadway revival following a national tour: It's good and  well, not evil, but head-scratchingly, laughably, even painfully bad. And one that you'll be constantly struggling to sit through.\n\nAs the titular schizophrenic scientist, American Idol alum Constantine Maroulis  a 2009 Tony nominee for his turn in the '80s jukebox show Rock of Ages  supplies hair-band-worthy locks and lungs of steel. His ''This Is the Moment'' (the 11 o'clock number that comes 45 minutes in) is indeed momentous  a triumph of vocal pyrotechnics over clichéd phrases, misaccented lyrics, and throat-testing key changes. He also supplies an accent that travels the whole of the United Kingdom.\n\nPlaying Jekyll's clueless well-bred fiancée, Emma, Teal Wicks adopts an odd Lady Mary intonation and an unnecessarily competitive singing style that emerges during the show's treacly but immensely popular duet ''In His Eyes.'' Unfortunately for Wicks, R&B; songstress Deborah Cox wins the belting match without breaking a sweat. In fact, Cox  as Lucy, the hooker with the heart of gold and bustier of steel  is quite terrific throughout. She even manages to make that ubiquitous cabaret tune/power ballad ''A New Life'' audible over the stadium-level orchestrations.\n\nOh yes, the tunes: Wildhorn has written some darn good ones. And they'll get lodged in your head so firmly that you'll need ''It's a Small World'' to clear them out. But, oh, the lyrics! Example: ''You've not heard/A single word I've said/My fear is he's in over his head!'' And in the song ''Murder'': ''Another murder! Just like that other murder!'' (Wildhorn and Steven Cuden share, ahem, credit for those particular gems with Leslie Bricusse.) Perhaps that's why the music is amplified to eardrum-splitting levels!\n\nBut there are so many puzzlements in this production, which is both over- and under-directed by Jeff Calhoun (whose credits include last season's Disney hit Newsies and Wildhorn flop Bonnie & Clyde). There are Maroulis' mutton chops, which threaten to take over his entire face; the choreography in Cox's bordello-set ''Bring On the Men''  an S&M-inspired;, quasi-Cabaret, rope-swirling maypole-esque mess; and the ''Confrontation'' between Jekyll and Hyde, the song that's both a solo and a duet. I won't give away the trick, but Maroulis isn't doing the hair-tossing thing that Robert Cuccioli (and Sebastian Bach and Jack Wagner and David Hasselhoff) did in the original production. Calhoun came up with a good idea  which then went terribly, terribly wrong. It is, I think, the curse of Jekyll & Hyde. C–\n\n(Tickets: Ticketmaster.com or 800-745-3000)",
  "isFullReview": true,
  "textWordCount": 498,
  "archivePath": "data/archives/reviews/jekyll-and-hyde-2013/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:28:25.757Z",
  "originalScore": "D",
  "originalScoreNormalized": 35,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20131001223152",
  "archiveOrgUrl": "http://web.archive.org/web/20131001223152/http://www.ew.com/ew/article/0,,20364394_20692464,00.html",
  "contentTier": "complete",
  "wordCount": 498,
  "tierReason": "Full review text"
}