{
  "showId": "jekyll-and-hyde-2013",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Unknown",
  "url": "http://www.nypost.com/p/entertainment/theater/run_hyde_from_ridiculous_revival_3GOJR6grnVV5az6dKylvHN?utm_medium=rss&utm_content=Theater",
  "playbillVerdictUrl": "http://www.nypost.com/p/entertainment/theater/run_hyde_from_ridiculous_revival_3GOJR6grnVV5az6dKylvHN?utm_medium=rss&utm_content=Theater",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Former “American Idol” star Constantine Maroulis and Deborah Cox get intimate in the monstrously misguided “Jekyll & Hyde.” \n Chris Bennion \n \n \n \n \n \n The climax of “Jekyll & Hyde — The Musical” is the infamous “Confrontation” scene, the peak of the evening-long battle between good Dr. Henry Jekyll and evil Edward Hyde.\n\nThe trick, of course, is that this is a duet for one: Jekyll and Hyde are the same man, played by a single actor who goes back and forth between two personas.\n\n“You can’t control me!” Hyde screeches, “I live deep inside you!/Each day you’ll feel me devour your soul!”\n\n“Damn you, Hyde!” Jekyll sings back. “Set me free!”\n\n(It’s an exclamation-mark kind of show.)\n\nThis is juicy stuff, the moment we’ve been waiting for. But the drab revival of Frank Wildhorn’s show that opened last night mucks it up.\n\nConstantine Maroulis is center stage in his meek Jekyll guise. But unlike his predecessors — original star Robert Cuccioli, David Hasselhoff and Skid Row frontman Sebastian Bach — Maroulis trades lines with a giant video projection of himself as Hyde.\n\nSo much for the show’s one and only point, that good and evil live within one man.\n\nMaybe Jeff Calhoun, the usually capable director/choreographer (“Newsies,” “Bonnie & Clyde”), lacked confidence in his star. But it’s unfair to single out poor Maroulis when the overall production is a cheap mess of bare-bones set and clueless staging that defeats the show’s bombastic allure. Indeed, despite the critical drubbing it received, the 1997 Broadway production managed more than 1,500 performances.\n\nMaroulis is a likable performer, and he’s built an honorable Broadway career since placing sixth on “Idol” in 2005 — he even earned a Tony nomination for his sweet-tempered performance in “Rock of Ages.” But he’s out of his depth here.\n\nJekyll is a mild-mannered physician who invents a potion that can turn one’s bad thoughts into a separate personality. To play him, Maroulis wears glasses, nervously rakes his hand over his ponytailed mane and speaks sheepishly.\n\nAfter Jekyll experiments on himself and becomes Hyde, Maroulis lets his hair down, puts on a top hat and turns into Slash. He can belt with the best of them and does fine by the show’s anthem, Jekyll’s “This Is the Moment,” but he flails as a psychotic serial killer.\n\nA man with a split personality needs equally distinct love interests, and they happen to be the show’s best singers.\n\nTeal Wicks brings a solid blend of power and finesse to her numbers as Jekyll’s virtuous fiancée, Emma. But she pales next to R&B starlet Deborah Cox (“Aida”), who barrels through the role of Lucy, the stereotypical hooker with a heart of gold.\n\nStill, the evening is a dispiriting slog.\n\n“Where is that fine line where sanity melts?” Jekyll sings. Some theatergoers, bored out of their minds, may well answer: at the Marquis.",
  "isFullReview": true,
  "textWordCount": 476,
  "archivePath": "data/archives/reviews/jekyll-and-hyde-2013/nypost--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:29:42.670Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 476,
  "tierReason": "Full review text"
}