{
  "showId": "jekyll-and-hyde-2013",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://theater.nytimes.com/2013/04/19/theater/reviews/frank-wildhorns-jekyll-hyde-at-the-marquis-theater.html?pagewanted=all&_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Mr. Maroulis meets the throat-thrashing challenges of Mr. Wildhorn's score with aplomb, his high-reaching pop tenor evincing little strain when rising to the piercing climaxes. I was also impressed by Mr. Maroulis's quietly intense performance as the obsessive Dr. Jekyll...Statuesque and beautiful, Ms. Cox brings a suffering dignity to this cliché in corsets. More important for those who have come to hear a pop diva do what pop divas do best, her dark, lustrous voice does nice justice to her character's signature song...Unfortunately there's no way to digitally airbrush away the hokum that pervades the whole show, like the ample stage smoke puffing away throughout the proceedings, giving a most commendable featured performance as the fabled pea-soupy London fog.",
  "bwwScore": 6,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-JEKYLL-HYDE-Opens-on-Broadway-Updating-LIVE-20130418",
  "fullText": "https://www.nytimes.com/2013/04/19/theater/reviews/frank-wildhorns-jekyll-hyde-at-the-marquis-theater.htmlShare full articleAdvertisement\n\nFrank Wildhorn musicals: the crab grass of Broadway. Although they have been liberally sprayed with herbicidal reviews ever since the first, “Jekyll & Hyde,” opened in 1997, they have continued to sprout every few years: “The Civil War” and “Dracula,” “Wonderland” and “Bonnie & Clyde.” Oh, and let’s not forget “The Scarlet Pimpernel,” a production that opened on Broadway not once but twice (long story).\n\nA half-dozen original musicals in a little more than 15 years may not sound like a staggering achievement — or a virulent outbreak, depending on your taste — but Mr. Wildhorn’s Broadway output is unmatched by any other composer in the same period. This, even though not one of his shows turned a profit during its Broadway engagement. (To be fair, few shows do.)\n\nPerhaps it’s time to acknowledge that, just as weeds will crop up wherever lawns are laid, Wildhorn musicals are an inevitable part of the wildlife of Broadway, where even more noxious flora appear with some regularity. So let us give a warm welcome back — or maybe just a shrug, a sigh and a tip of the bowler hat — to the return of “Jekyll & Hyde,” the Victorian-gothic pop-opera that started it all.\n\nThe revival that opened on Thursday night at the Marquis Theater, directed and choreographed by Jeff Calhoun, will no doubt stir passionate excitement among the show’s many fans. Although the original “Jekyll & Hyde” didn’t make money, the production played more than 1,500 performances and spawned flocks of obsessive acolytes, known as “Jekkies.”\n\nThese rabid fans will surely be soon convening at watering holes around the theater district to debate the urgent questions the new production raises. Does Constantine Maroulis, the former “American Idol” contestant who won a Tony nomination for his role as the headbanging hero of “Rock of Ages,” have the vocal chops to meet the murderous tessitura of the title role(s)? Does Deborah Cox, best known as a disco diva whose biography notes that she has had 11 No. 1 songs on Billboard’s Hot Dance Club Play chart, possess the acting talent to portray the hooker with lungs of steel to match her heart of gold? (Linda Eder, Mr. Wildhorn’s wife at the time, played the role in the first version.)\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 404,
  "archivePath": "data/archives/reviews/jekyll-and-hyde-2013/nytimes--charles-isherwood_2026-02-07.html",
  "textFetchedAt": "2026-02-07T13:30:20.274Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No usable CDX snapshots (all non-200 or non-HTML)"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "wordCount": 404,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-07T11:07:35.841Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The text cuts off mid-review with a technical error message about retrieving content, making it impossible to determine the critic's verdict or recommendation.; openai: This text is an incomplete article with a technical error message, not a review.; gemini: The review text is incomplete and contains an error message. It's impossible to determine the critic's opinion of the show.",
  "promptVersion": "5.2.0"
}