{
  "showId": "a-night-with-janis-joplin-2013",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "http://www.ew.com/ew/article/0,,20364394_20744316,00.html",
  "playbillVerdictUrl": "http://www.ew.com/ew/article/0,,20364394_20744316,00.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "In A Night With Janis Joplin, the sublime Mary Bridget Davies belts out ''Piece of My Heart'' with all the psychedelic-blues majesty of the rock legend, perfectly imitates the singer’s wide-sashay walk, and stoner-talks exactly like her, man. Of course, she's had plenty of practice: The 35-year-old actress and singer got her break in the late 1990s when Joplin's former backing band, Big Brother and the Holding Company, invited Davies on stage to sing ''Me and Bobby McGee'' in her hometown of Cleveland. They took her on tour, and later, she was cast in the starring role of Love, Janis, another musical about the singer. After decades of rasping her way through Joplin classics, it's hard to believe Davies can still endure night after night of shriek-till-it-hurts performances that would shred a lesser singer's vocal chords. But she's a genuine powerhouse, tearing through a grand finale a capella cover of ''Mercedes Benz'' that smokes and smolders and totally reclaims the tune from its ridiculous, irony-subverting placement in that 2011 Super Bowl ad.\n\nIt's a shame, then, that this musical doesn't give Davies much to work with other than her phenomenal voice. Written and directed by Randy Johnson, Night focuses on Joplin's musical icons  Bessie Smith (Taprena Michelle Augustine), Nina Simone (de'Adre Aziza), Etta James (Nikki Kimbrough), and Aretha Franklin (Allison Blackwell)  without revealing much about their influence beyond the fact that she played that record until she wore it out, man. There's no trace of Joplin's juicy life  no gossip about what happened backstage at Woodstock or the Monterey Pop Festival, nothing about the night she allegedly broke a beer bottle over Jim Morrison's head, or her romance with Leonard Cohen, who later memorialized their relationship in the ballad ''Chelsea Hotel.'' Instead, Johnson strings together broad clichés from her childhood memories, with Joplin's character insisting that women feel the blues more acutely than men, and that fans love blues singers more after they're dead. During one night of previews, an audience member audibly gasped ''Aww!'' after the latter line, apparently unaware that Joplin died of a heroin overdose in 1970.\n\nWorst of all, it’s hard to blame that woman in the crowd for not knowing Joplin's story. Aside from a few nudge-nudge references to Joplin's affinity for smoking joints, the musical ends without acknowledging her struggle with drugs. Instead, we're treated to a feel-good, all-cast revival of ''I'm Gonna Rock My Way to Heaven,'' complete with cameos by the blues queens Joplin loved, that's been curiously scrubbed of any reference to how she reached those pearly gates in the first place. The raw ache in Davies' phenomenal voice suggests that Joplin didn't go out happily, with Aretha Franklin's hand-claps and St. Peter's tambourines shaking behind her. But with such a shocking lack of context about Joplin's life, A Night With Janis Joplin feels like Davies is fronting an amazing tribute band, not a musical. C",
  "isFullReview": true,
  "textWordCount": 488,
  "archivePath": "data/archives/reviews/a-night-with-janis-joplin-2013/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:54:11.624Z",
  "originalScore": "D",
  "originalScoreNormalized": 35,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140122182118",
  "archiveOrgUrl": "http://web.archive.org/web/20140122182118/http://www.ew.com/ew/article/0,,20364394_20744316,00.html",
  "contentTier": "truncated",
  "wordCount": 488,
  "tierReason": "Missing proper ending or other signals",
  "bwwExcerpt": "It's a shame, then, that this musical doesn't give Davies much to work with other than her phenomenal voice. Written and directed by Randy Johnson, Night focuses on Joplin's musical icons - Bessie Smith (Taprena Michelle Augustine), Nina Simone (de'Adre Aziza), Etta James (Nikki Kimbrough), and Aretha Franklin (Allison Blackwell) - without revealing much about their influence beyond the fact that sheplayed that record until she wore it out, man. There's no trace of Joplin's juicy life - no gossip about what happened backstage at Woodstock or the Monterey Pop Festival, nothing about the night she allegedly broke a beer bottle over Jim Morrison's head, or her romance with Leonard Cohen, who later memorialized their relationship in the ballad 'Chelsea Hotel.' Instead, Johnson strings together broad clichés from her childhood memories, with Joplin's character insisting that women feel the blues more acutely than men, and that fans love blues singers more after they're dead. During one night of previews, an audience member audibly gasped 'Aww!' after the latter line, apparently unaware that Joplin died of a heroin overdose in 1970.",
  "bwwScore": 6,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-A-NIGHT-WITH-JANIS-JOPLIN-Opens-on-Broadway-Updating-LIVE-20131010"
}
