{
  "showId": "a-night-with-janis-joplin-2013",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "https://www.nytimes.com/2013/10/11/theater/reviews/a-night-with-janis-joplin-opens-on-broadway.html",
  "publishDate": "October 10, 2013",
  "fullText": "The party onstage at the Lyceum Theater, where “A Night With Janis Joplin” opened on Thursday night, turns out to be more crowded than you might expect. This latest in Broadway’s endless stream of boomer-bait musical tributes isn’t just a matter of a big-voiced singer, her backup band and a bottle of Southern Comfort.\n\nMary Bridget Davies, whose positively uncanny vocal impersonation of Joplin keeps the house rocking for much of the show’s running time, is joined by a quartet of talented performers playing famous singers who influenced her style, from Bessie Smith to Odetta to Nina Simone to Etta James. Oh, and let’s not forget the queen of soul, Aretha Franklin, who blazes onstage sporting more feathers than the titular star — no small achievement, given Joplin’s fondness for them.\n\nPerhaps odder still, there are, in a sense, not one but two Janis Joplins present in this celebration of a woman who lived hard and died young. One is the soulful singer who poured her heart, guts and loins into her vocal cords every time she stepped onstage, howling forth her own distinctive blend of rock ’n’ roll and the blues. The other Janis is a friendly and unexpectedly even-tempered young woman from Port Arthur, Tex., who offers us an amiable tour of her upbringing, along with thoughtful reflections about her musical idols.\n\nMs. Davies portrays both sides of Janis, I should add. And while she bears a notable physical resemblance to Joplin, and her speaking voice has the same whisper of a twang and down-home earthiness, I’m a little suspicious of that second character. If the real Joplin had the kind of sensible perspective on her life and career that she exhibits in this show — happily reminiscing about her youthful love of painting, or giving a learned docent tour of blues history — she would probably not have died of an overdose of heroin and alcohol at 27.\n\nInstead — who knows? — she might even today be teaching music at a university, or croaking out jokes on late-night chat shows, or doting on grandchildren.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Mary Bridget Davies delivers a performance of searing intensity and vocal power that makes you believe, at least while she's onstage, that the ghost of Janis has indeed materialized in the Lyceum Theater.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mary Bridget Davies delivers a performance of searing intensity and vocal power that makes you believe, at least while she's onstage, that the ghost of Janis has indeed materialized in the Lyceum Theater.",
  "contentTier": "complete",
  "contentTierReason": "Short text (33 words)",
  "textWordCount": 372,
  "archivePath": "data/archives/reviews/a-night-with-janis-joplin-2013/nytimes--charles-isherwood_2026-02-03.html",
  "textFetchedAt": "2026-02-03T10:40:44.451Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 372,
  "tierReason": "Full review text"
}