{
  "showId": "a-night-with-janis-joplin-2013",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Scott Brown",
  "url": "http://www.amny.com/urbanite-1.812039/theater-review-a-night-with-janis-joplin-2-stars-1.6236527",
  "publishDate": null,
  "fullText": "Photo credit: Photo by Joan Marcus\n\nNo one can accuse “A Night With Janis Joplin” of not delivering what it is promised in the title.\n\nNot unlike the recent Beatles tribute show “Let It Be,” this marks yet another faux concert in which a performer pretends to be a legendary rock star. Those who attend will travel back to 1967 and spend the night with Joplin plus her band and backup singers. It’s straightforward, without any parody or even a storyline.\n\nBut whereas “Let It Be” featured no acting of any sort, the very talented and dedicated Mary Bridget Davies really digs into the role of Joplin, authentically replicating the Queen of Rock’s distinctively raw and raspy voice in every song while bringing an unrelenting intensity.\n\nThe show, which runs 2 1/2 hours with intermission, is significantly lengthened by also featuring the female African-American blues singers that influenced Joplin, including Bessie Smith (Taprena Michelle Augustine), Nina Simone (De’Adre Aziza) and Aretha Franklin (Allison Blackwell), who frequently interrupt and take over the concert.\n\nAlthough Joplin speaks directly to her audience and salutes her idols, there is no storyline or source of conflict. It would probably work better as a fast and furious 90-minute, intermission-less concert without the interludes. Then again, Davies probably needs and deserves a break every now and then.\n\nRandy Johnson’s production attempts to replicate the concert experience as theatrically as possible, with psychedelic colored lighting and the sound pumped up to a deafening volume. The audience is also forced to cheer in order to receive an encore.\n\nIt’s easy to tell the Joplin fans, who stand up and cheer after she performs songs such as “Piece of My Heart” and “Me and Bobby McGee,” from everyone else. They’ll be pleased. But what about those unfamiliar with Joplin, as well as those who never liked her in the first place?\n\nadvertisement | advertise on am New York\n\nHave a comment or news tip? We want to hear it! Find us on Twitter and Facebook.\n\nadvertisement | advertise on am New York\n\n240 W 35th St.,\n9th Floor NY, NY 10001\n646.293.9499 | Fax: 212.239.2828\nContact Us thoughts@am-ny.com",
  "isFullReview": true,
  "bwwExcerpt": "Don't expect much in the way of personal revelation or public misbehavior. Apart from sucking on a bottle of Southern Comfort, this Janis is quite composed and sedate between songs. She tells charming stories about housecleaning, her family, her favorite 45s. Johnson's script has been carefully poli...",
  "bwwRoundupUrl": null,
  "bwwThumb": null,
  "showScoreExcerpt": null,
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "playbill-verdict"
  ],
  "playbillVerdictUrl": "http://www.amny.com/urbanite-1.812039/theater-review-a-night-with-janis-joplin-2-stars-1.6236527",
  "duplicateOf": "vulture--unknown.json",
  "textWordCount": 358,
  "archivePath": "data/archives/reviews/a-night-with-janis-joplin-2013/vulture--scott-brown_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:04:05.425Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20131014204357",
  "archiveOrgUrl": "http://web.archive.org/web/20131014204357/http://www.amny.com:80/urbanite-1.812039/theater-review-a-night-with-janis-joplin-2-stars-1.6236527",
  "duplicateTextOf": "vulture--unknown.json",
  "wordCount": 358,
  "tierReason": "Full review text"
}