{
  "showId": "a-wonderful-world-the-louis-armstrong-musical-2024",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/A-Wonderful-World-The-Louis-Armstrong-Story/1262",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "Others may see trees of green and red roses too as the show ends. What I see is that “A Wonderful World” is a story that might have been best served by one single vision.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-A-WONDERFUL-WORLD-Opens-On-Broadway-20241111",
  "contentTier": "complete",
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $144\n Buy Tickets\n\nCititour.com Review\n The 1928 standard “When You’re Smiling” tells us “When you’re smiling, the whole world smiles with you.” And in the new bio-musical “A Wonderful World: The Louis Armstrong Story,” now at Studio 54, it’s undeniably true that when the show’s star -- an unrecognizable James Monroe Iglehart doing an utterly remarkable vocal and physical imitation of the titular jazz icon – is singing that tune, the whole audience is probably doing the same. \n\nMeanwhile, when Iglehart is merely smiling – Armstrong’s almost-constant facial impression -- at least some of the audience knows just how much Armstrong is covering up his pain, having been treated like many African Americans as a second-class citizen despite his fame. Unfortunately, that message doesn’t always clearly come through in Aurin Squire’s hopelessly muddled book, which, among many other faults, puts too much of a shiny gloss on Armstrong’s life. (You’ll find more of the facts – and the truth – in Armstrong’s Wikipedia entry!)\n\nThe book’s many flaws aside (more later), you can have a very good time at the show, especially when its first-rate cast, gorgeously costumed by the great Toni-Leslie James, cavorts on Adam Koch and Steven Royal’s vast and ornate set, often indulging in Rickey Tripp’s spirited choreography and raising their voices to the rafters.\n\nWithout question, Iglehart is first among equals, and it’s a treat to hear him sing many of Armstrong’s signature tunes, such as “(I’ll Be Glad When You’re Dead), You Rascal You,”, Oh, When the Saints Go Marching In,” “Black and Blue,” “Hello, Dolly” and “What a Wonderful World.” Moreover, Iglehart shines when he really gets to show off his strong acting chops, most notably in a scene where he unwisely curses out then-President Dwight Eisenhower in front of a local reporter.\n\nMeanwhile, Darlesia Creacy, Kim Exum, Dionne Figgins and Jennie Harney Fleming all excel as Armstrong’s very different wives. Figgins (as the knife-wielding prostitute Daisy Parker) and Fleming (as the level-headed pianist and businesswoman Lil Hardin) bring down the house (and first-act curtain) with a stunning medley of “Some of These Days” and “After You’ve Gone.” The cutesy Exum (as Alpha Smith) exudes girlish sex appeal on “Big Butter and Egg Man.” Last but not least, Creacy, the finest of the bunch – playing his final (and lasting) spouse Lucille Wilson – is equal parts sass and sparkle yet breaks your heart on “That’s My Home.”\n\nEqually strong supporting turns come from Gavin Gregory as Armstrong’s braggadocious “mentor,” bandleader King Joe Oliver (who hands in two gorgeous renditions of “Do You Know What It Means to Miss New Orleans”), Dewitt Fleming Jr as both riverboat bandleader Fate Marable and tap-dancer extraordinaire Lincoln Perry (aka Stepin Fetchit), and Jimmy Smagula as Armstrong’s hot-tempered manager Joe Glaser. Brandon Armstrong (Louis’ great-great nephew), Jason Forbach and Tally Sessions also shine in multiple roles.\n\nStill, one can only imagine how great the show could be if it hard shored up – or even jettisoned -- its weakest link. Squire’s script foolishly and ineptly attempts to present an episodic view of nearly 60 years in Armstrong’s life -- told essentially as a flashback from the preparation for Armstrong’s 1971 concert at the Waldorf-Astoria.\n\nAs a result, the show often leaves us confused as to the time and place of where scenes are happening. Moreover, it omits shocking bits of important information about Armstrong’s life, such as the fact that he and Daisy adopted a son that Armstrong cared for until he died. Indeed, for all of its considerable entertainment value, “A Wonderful World” makes it hard for us to fully invest in Armstrong and the many people in his life. \n\nPerhaps, this show is what happens when you need at least two hands to count the number of co-conceivers, directors, co-directors, writers, choreographers and other creatives (including Christopher Renshaw, the brilliant Branford Marsalis and the ultra-talented Darryl Waters) who are heavily involved in the project. \n\nOthers may see trees of green and red roses too as the show ends. What I see is that “A Wonderful World” is a story that might have been best served by one single vision.\n By Brian Scott Lipton\n\nVisit the Sitehttps://louisarmstrongmusical.com/Open/Close DatesOpening 11/11/2024Closing Open-ended\nTheatre Info\nStudio 54254 West 54th StreetNew York, NY 10019 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 766,
  "archivePath": "data/archives/reviews/a-wonderful-world-the-louis-armstrong-musical-2024/cititour--scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:02:41.628Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "wordCount": 766,
  "tierReason": "Full review text"
}