{
  "showId": "a-wonderful-world-the-louis-armstrong-musical-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": null,
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "bwwExcerpt": "Of course, Armstrong’s “Hello, Dolly!” is reprised, as a singalong, no less. It likely still holds the position as the last song from a Broadway music to reach number one on the Top 100. The title song, more properly known as “What a Wonderful World,” is kept for last as an Armstrong-in-heaven final...",
  "bwwRoundupUrl": null,
  "bwwThumb": null,
  "showScoreExcerpt": null,
  "contentTier": "needs-rescrape",
  "contentTierReason": "Only aggregator excerpts available",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "nyc-theatre"
  ],
  "nycTheatreExcerpt": "As bio-musicals go, A Wonderful World doesn't break any new ground, and the book by Aurin Squire is pretty much by-the-numbers, hitting most of the highs and lows spanning 70 years in Armstrong's storied career. But as conceived by Andrew Delaplaine along with Christopher Renshaw (who also directed), there's so much charm, artistry and buoyant entertainment here that we are riveted for the entirety of the show's two and a half hour running time.",
  "rejectedAt": "2026-02-06T18:12:05.060Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be a fragment discussing song details and chart positions rather than evaluative review content about the show's quality or recommendation; openai: The text provided is a description of songs included in the show, not an evaluative review of the production.; gemini: This excerpt describes song choices and context, but offers no evaluative statements about the production itself.; kimi: The text consists solely of plot/content description (listing songs and their placement in the show) without any evaluative language, critical assessment, or recommendation regarding the production's quality.",
  "promptVersion": "5.2.0"
}
