{
  "showId": "oh-hello-on-broadway-2016",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2016/10/11/theater/oh-hello-review-broadway.html",
  "publishDate": "October 10, 2016",
  "fullText": "The dirty old men have occupied Broadway. They are an army of only two, yet they seem destined to conquer and slay anyone who ventures into the Lyceum Theater, where they have set up their festering — and, admit it, stupendously entertaining — camp.\n\nGive it up, ladies and gentlemen, for Gil Faizon and George St. Geegland, whose “Oh, Hello on Broadway” opened on Monday night. This wheezing, cranky, incontinent pair of roommates from the Upper West Side are bringing shabbiness back to sanitized, glamorized Times Square. What’s more, they’re losers (sorry, boys) in a city where success is the holy grail. And, oh, the pleasure of their company.\n\nI suppose I must point out that Mr. Faizon and Mr. St. Geegland are fictions, the alter egos of the comedians Nick Kroll and John Mulaney, who are both in their 30s. But while these actors’ geriatric get-ups are as blatantly fake as the old-age makeup in a grade school production of “Arsenic and Old Lace,” Gil and George (if I may be so familiar) possess an insistent, overbearing reality that turns their creators into shadows.\n\nThey are, in other words, of a species whose natural habitat is the theater, where make-believe is a bargain between performers and audiences. Mr. Kroll and Mr. Mulaney may be best known for their work in sketch television (“Kroll Show,” “Saturday Night Live”). And their septuagenarian characters made their debuts in small-screen vignettes in which they pranked celebrity guests by serving them obscenely overstuffed tuna sandwiches (a stunt that figures here, too).\n\nBut Gil and George breathe the oily, obsessive air generated by hot lights, greasepaint and outlandish, in-the-moment illusions. Theater, it turns out, is the raison d’être for “Oh, Hello,” which is nimbly directed by Alex Timbers and was staged last year to sold-out crowds at the Cherry Lane Theater in Greenwich Village.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "dtliExcerpt": "Mr. Mulaney and Mr. Kroll have created characters so specifically obnoxious that they become paradoxically endearing, like beloved elderly relatives whose every irritating habit you know by heart.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "They also manage to paint an exquisitely painful portrait of a dysfunctional twilight bromance, in which the (sort of) patrician George dominates the (marginally) shlubbier Gil. The details that define their characters, too, are precise and impeccably off-center, a perfect match for their stained, saggy corduroys and fungoid gray hair.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-OH-HELLO-Opens-on-Broadway--Updating-Live-20161010",
  "showScoreExcerpt": "Mr. Mulaney and Mr. Kroll have created characters so specifically obnoxious that they become paradoxically endearing, like beloved elderly relatives whose every irritating habit you know by heart.",
  "contentTier": "complete",
  "contentTierReason": "Short text (28 words)",
  "textQuality": "partial",
  "rejectedAt": "2026-02-03T18:51:58.791Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or quote, not a complete review that can be properly scored; openai: The text is about a performance by Mr. Mulaney and Mr. Kroll, not a Broadway show.",
  "promptVersion": "5.2.0",
  "playbillVerdictUrl": "http://www.nytimes.com/2016/10/11/theater/oh-hello-review-broadway.html",
  "sources": [
    "web-search",
    "playbill-verdict",
    "bww-roundup"
  ],
  "previousUrl": "https://www.nytimes.com/2016/10/11/theater/oh-hello-on-broadway-review.html",
  "urlDiscoveredAt": "2026-02-07T15:30:24.499Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 333,
  "archivePath": "data/archives/reviews/oh-hello-on-broadway-2016/nytimes--ben-brantley_2026-02-07.html",
  "textFetchedAt": "2026-02-07T15:30:24.503Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "wordCount": 333,
  "tierReason": "Full review text"
}