{
  "showId": "aladdin-2014",
  "outletId": "CHTRIB",
  "outlet": "Chicago Tribune",
  "criticName": "Chris Jones",
  "url": "https://www.chicagotribune.com/entertainment/theater/ct-aladdin-broadway-review-column.html",
  "publishDate": "2014-03-20",
  "fullText": "Things To Do Theater A magical Genie in Broadway&#8217;s &#8216;Aladdin,&#8217; but precious little at stake Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X Click to print (Opens in new window) Print Click to email a link to a friend (Opens in new window) Email By Chris Jones | cjones5@chicagotribune.com | Chicago Tribune PUBLISHED: March 20, 2014 at 4:55 PM CDT | UPDATED: June 17, 2018 at 9:03 PM CDT Getting your Trinity Audio player ready... NEW YORK &#8211; Early in &#8220;Aladdin,&#8221; Disney&#8217;s new Broadway-musical version of the beloved 1992 animated feature, the chipper street rat has a run-in with the authorities and finds a sword at his throat. &#8220;Should we kill him?&#8221; a royal guard half-heartedly asks the guy in charge. Aladdin is not exactly fearing for his life. He knows how it turns out and he ain&#8217;t worried. In fact, nobody in this emblematic little scene takes even remotely seriously the possibility that Aladdin, still in his pre-lamp days and without protection in Baghdad, could be filleted in Act 1. Everyone is too busy rushing to the next clever thing. You might argue that nobody cares about such veracity in a show based on a cartoon and now expanded into a family musical full of color and exuberance — if still wanting for an overarching theatrical reason for being. But if the director Casey Nicholaw, the book writer Chad Beguelin and their cast all were just to pay a little more attention to the importance of committing to the truth of the plot, however familiar, it surely would greatly improve this show. And it would make it easier for us to engage with characters whose romance lacks emotional stakes, not least because it exists in a world without need. That&#8217;s not true of every moment of this new show — the Genie, famously voiced by Robin Williams in the movie, is now played by James Monroe Iglehart, who is by far this show&#8217;s greatest asset. The fabulous Iglehart, who brought the house down Wednesday afternoon with his &#8220;Friend Like Me&#8221; musical number, thrillingly staged in the vein of &#8220;Be Our Guest,&#8221; somehow manages to both reinvent Williams&#8217; manic brilliance and make that imprisoned wizard his own. Iglehart is aided by very funny, free-associating lyrics from Beguelin that reference everything from civil rights to Oprah Winfrey and turn the Genie into a kind of freedom fighter. Plus Iglehart has heart. He makes you see his world from the inside of the lamp. If everything were so honest and comedically intense, Disney would totally wow its core demographic, and beyond, with this show, which comes with the baked-in advantages for the family audience of much-loved characters, a bona fide Disney princess in Jasmine (played by the glamorous but overly chilly Courtney Reed) and, of course, the sticky Alan Menken score, including such songs as &#8220;A Whole New World&#8221; and the aforementioned &#8220;Friend Like Me.&#8221; Menken has added to the score (with Beguelin, who is credited with both book and the non-Tim Rice lyrics) and, among other additions, has come up with a second Genie song, &#8220;Somebody&#8217;s Got Your Back,&#8221; which Iglehart nails again. function dfm_stn_player_script_id_SgcWfae5( getS2NApiForPlayer ) { if( typeof window.MNGAuthentication !== 'undefined' ){ const s2nApi = getS2NApiForPlayer( document.querySelector('.k-SgcWfae5') ); s2nApi.float = ! window.MNGAuthentication.isUserSubscriber(); } } Whenever the Genie is stuck in the lamp, though, the show takes a dive. The young heroes (Adam Jacobs is Aladdin) remain more pro forma, and although the creepy Don Darryl Rivera has his moments as Iago (the show has humanized all animals and does not use puppets), the main plot about Aladdin fighting off Jafar (played by Jonathan Freeman, who actually voiced the role in the movie) just never ignites with any real danger or excitement. It&#8217;s mostly just flat. When you add only a tentative connection between Aladdin and Jasmine (who could use a note or two of real vulnerability), much of the show just skedaddles along, hitting the plot points without enough oomph. The ensemble numbers (an ensemble populated almost entirely by actors of color) are livelier — and the fresh-feeling choreography has a gently chaotic sensibility that deftly captures the marketplace. The problems are almost all in the non-Genie book scenes, which, in all fairness, are tough to make work. The story behind &#8220;Aladdin&#8221; is no &#8220;Beauty and the Beast.&#8221; To try and solve that issue, Beguelin&#8217;s book has a new, somewhat self-aware veneer (&#8220;is it evil-laugh time?&#8221; the villains ask), a bifurcated approach that ends up being problem in that it makes &#8220;Aladdin&#8221; land somewhere between, say, the straight-up storytelling of &#8220;Beast&#8221; and the satire that draws more f...",
  "originalScore": null,
  "assignedScore": 65,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "urlUpdated": "2026-01-23T05:12:14.992Z",
  "fetchedAt": "2026-01-23T05:23:00.882Z"
}