{
  "showId": "aladdin-2014",
  "outletId": "financial-times",
  "outlet": "Financial Times (UK)",
  "criticName": "Brendan Lemon",
  "url": "http://www.ft.com/cms/s/2/e2b2ef3c-b01c-11e3-b0d0-00144feab7de.html",
  "publishDate": "March 21, 2014",
  "fullText": "Simply sign up to the Life & Arts myFT Digest -- delivered directly to your inbox. At last: a Disney tune that has wiped Frozen ‘s “Let It Go” from my brain. This magic feat required a D-day array of forces: composer Alan Menken, lyricists Howard Ashman and Tim Rice, book writer Chad Beguelin, and director/choreographer Casey Nicholaw, not to mention most of the cast of this group’s entertaining, though not especially memorable new Broadway creation: Aladdin, based on the hit 1992 animated film. If the production, with its sequin-heavy costumes and big-chested chorus members (of both sexes), seems stuck in the 1990s, at least the songs weren’t plucked from a book of pop standards. The tune in question is “Friend Like Me”, and it arrives at the end of act one. By then, Aladdin has decided to ditch his loveable-rogue ways to win the heart of Jasmine, the princess whose stern father will only let her marry another royal. Aladdin has accepted the help of Jafar, the sultan’s evil vizier, and sidekick Iago. Little do they know that, when they leave Aladdin for dead in the Cave of Wonders, the young hero will free a genie from the magic lamp, and the genie will grant the wish of all fervent theatregoers: he will stop the show. The crowd-pleasing “Friend Like Me” is the kind of boppy ditty that Menken and Ashman perfected in Beauty and the Beast, whose crowd scenes provide a template for the bazaar here. Bob Crowley, Gregg Barnes, and Natasha Katz are responsible for the orientalist-fantasy visuals, which include an ooh-inducing magic carpet. Neither does the “Friend Like Me”’s excitement stem from choreography: Nicholaw, who staged The Book of Mormon, is adept at keeping bodies in motion but the movement itself is Broadway-generic. No, “Friend Like Me” achieves delirium owing to the performance of James Monroe Iglehart as the genie. Unlike Adam Jacobs, the suave and effortless portrayer of Aladdin, or Courtney Reed, the sweet Jasmine, Iglehart is James Brown tinged with RuPaul. The flop sweat glistens. Iglehart’s camp line readings are more lawdy-mama than those of Robin Williams, who voiced the genie in the film, but his heart beats back to an earlier era: classic musical comedy. After a string of recent less-than-smashing Broadway adaptations, Disney wanted something it could market not only to the parents-with-children crowd but also to date-night couples looking for a few laughs. Wish granted.",
  "isFullReview": false,
  "showScoreExcerpt": "\"Disney wanted something it could market not only to the parents-with-children crowd but also to date-night couples looking for a few laughs. Wish granted.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score",
  "sourceUrl": "https://www.show-score.com/broadway-shows/aladdin",
  "textStatus": "complete",
  "textWordCount": 404,
  "textFetchedAt": "2026-01-25T13:40:09.916Z",
  "textFetchMethod": "playwright",
  "archivePath": "data/archives/reviews/aladdin-2014/financial-times--brendan-lemon_2026-01-25.html",
  "textQuality": "full",
  "sourceMethod": "showscore"
}
