{
  "showId": "aladdin-2014",
  "outletId": "ny-stage-review",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "http://nystagereview.com/2018/09/19/aladdin-four-years-on-a-fairy-tale-for-a-whole-new-world/",
  "publishDate": "September 19, 2018",
  "fullText": "★★★★☆ Long-Run Lookback: One of Disney's most enduring screen-to-stage confections remains among its most adult-friendly—and seems freshly relevant. When Disney’s musical adaptation of its hit animated film Aladdin opened at the New Amsterdam Theatre back in March 2014, #MeToo was not yet a household hashtag, and “the wall” was a term most commonly used, at least by theatergoers, to indicate an imaginary rampart holding up our suspension of disbelief. Times have changed, as Reno Sweeney might have observed (though she couldn’t have foreseen the half of it), and while Broadway’s Aladdin is the same buoyant diversion it’s always been, certain elements may hold more resonance, particularly for the older audience members who make up a not insubstantial portion of the show’s fans. Indeed, Aladdin remains, with the possible exception of the visually breathtaking The Lion King, the most adult-friendly of Disney’s screen-to-stage confections, thanks in large part to the sharp but unabashedly goofy wit and whimsy of director/choreographer Casey Nicholaw and librettist Chad Beguelin, who also contributed lyrics to Alan Menken’s newer songs. The original tunes Menken crafted with Tim Rice and the late Howard Ashman—the rhapsodic “A Whole New World,” the heart-tugging “Proud of Your Boy,” the jazzy “Friend Like Me” (extended via Nicholaw into an elaborate, uproarious production number)—are still the most appealing, even if they don’t rival Menken and Ashman’s work on Beauty and The Beast and The Little Mermaid. But Aladdin’s score isn’t its strongest asset any more than The Book of Mormon’s (which Nicholaw also helmed, as co-director and choreographer) is its selling point. What makes Aladdin a more successful stage adaptation than either Beast or Mermaid is the clever but laid-back humor—rife with jokes and word play that defy demographic barriers, and with the accessible inside-theater references that are a Nicholaw hallmark—coursing through its gentle, unselfconscious critique of class and gender inequality. Racial and cultural tolerance are key here too; it’s not inconsequential that Nicholaw gave West Side Story an early nod in a latter-day musical that opens with the number “Arabian Nights.” But if the past two or three frenzied years have taught us anything, it’s that racism and classism work hand in hand, and we ignore the impact of the latter on our supposed meritocracy at our peril. Aladdin’s skin may be no darker than that of the palace guards who pursue him, but our young hero’s poverty surely informs his rapport with the enslaved Genie—played here, as he was in the original cast, by an African-American actor—and the tension that develops when Aladdin seems to reconsider his promise to set Genie free. If such dynamics will likely be lost on Aladdin’s youngest audience members, the heroine’s struggle for autonomy should escape no one’s notice. It’s become standard in recent decades for Disney princesses to pine for more than a handsome, well-positioned male rescuer—even if, with a few exceptions, their happy endings conveniently include the promise of marrying young and well. Princess Jasmine is a particularly likable and credible character, a loving daughter who simply doesn’t understand why her dad thinks she needs a guy to take care of her, and tells him so. And the ickiness of Jasmine’s suitors, from an arrogant prince demanding a completely acquiescent bride to the scheming Jafar—who essentially stalks her, if only to secure her father’s title—seems even more glaring, and creepier, in light of recent headlines. Jafar is still played, with delectable comic menace, by Jonathan Freeman, who originated the role on stage and screen, though other actors have, predictably, stepped into the younger principal roles. Musical theater veteran Telly Leung makes a surprisingly, fetchingly boyish Aladdin, with a tenor as bright and brassy as a polished lamp. Arielle Jacobs, the sister of the production’s original Aladdin, Adam Jacobs, is appropriately direct and wholesomely alluring as Jasmine; Leung’s youthful eagerness underscores her heroine’s maturity, and the flecks of irony in her lines. As Genie, Major Attaway wisely traces the footsteps left by James Monroe Iglehart, who duly earned a Tony Award for his breathless, fearless, entirely original take on a part introduced on screen by no less iconic a force than the late Robin Williams (or Williams’ voice, at least). Granted, Attaway seemed slightly more winded than Iglehart had, to my recollection, after leading the eight-minute aerobic routine “Friend Like Me.” But overreaching is part of the point, here and in the several other glittering, gleefully extravagant company showcases Nicholaw and his design team bring to a story that assures us material riches matter less than honesty, courage and, of course, love. That message is not contradictory, as heart, and humor, are what sustain Aladdin, all that scrumptious eye candy provided by renowned scenic designer Bob Crowley and costumer Gregg Barnes notwithstanding. More than four years after opening night, the musical is still a balm and a tonic—with perhaps a bit more punch nowadays. Aladdin opened March 20, 2014, at the New Amsterdam Theatre. Reviewed: September, 2018. Tickets and information: aladdinthemusical.com Elysa Gardner covered theater and music at USA Today until 2016, and has since written for The New York Times, The Village Voice, Town & Country, Entertainment Weekly, Entertainment Tonight, Out, American Theatre, Broadway Direct, and the BBC. Twitter: @ElysaGardner. Email: elysa@nystagereview.com.",
  "isFullReview": false,
  "showScoreExcerpt": "\"What makes 'Aladdin' a successful stage adaptation...is the clever but laid-back humor—rife with jokes and word play that defy demographic barriers...coursing through its gentle, unselfconscious crit.\"",
  "originalScore": null,
  "assignedScore": 88,
  "source": "show-score",
  "sourceUrl": "https://www.show-score.com/broadway-shows/aladdin",
  "textStatus": "complete",
  "textWordCount": 868,
  "textFetchedAt": "2026-01-25T13:42:06.367Z",
  "textFetchMethod": "playwright",
  "archivePath": "data/archives/reviews/aladdin-2014/ny-stage-review--elysa-gardner_2026-01-25.html",
  "textQuality": "full",
  "sourceMethod": "showscore",
  "scoreSource": "sentiment-strong-positive",
  "scoreConfidence": "medium"
}