{
  "showId": "aladdin-2014",
  "outletId": "nypost-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://nypost.com/2014/03/20/aladdin-musical-doesnt-quite-seem-like-a-disney-hit/",
  "publishDate": null,
  "fullText": "Breaking News\n\t\t\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\tTrump says Venezuelan leader Nicolas Maduro, wife ‘captured&#039; after large-scale strikes\t\t\t\t\n\t\t\t\t\t\n\t\n\n\n\t\t\t\n\t\n\t\t\n\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\n\t\n\t\t\n\t\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\tAs the Genie, James Monroe Iglehart injects liveliness and humor into a\nmerely tolerable stage adaptation of Disney’s animated hit “Aladdin.”\t\t\t\t\t\t\n\t\t\t\t\t\t\tCylla von Tiedemann\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\tDisney’s new “Aladdin” doesn’t quite catch lightning in a bottle — but it lets a pretty nifty genie out of a lamp.\n\nThat would be James Monroe Iglehart, in the role memorably voiced by Robin Williams in the 1992 animated hit. Every time this Genie’s on stage, it’s as if “Aladdin” were mainlining Red Bull. Iglehart works so hard during his big number, you fear for his health — that is, when you’re not laughing your head off.\n\nAnd then there’s the rest of the show.\n\nThe story we know: Aladdin (Adam Jacobs), a lowborn but noble-hearted “street rat,” falls for Jasmine (Courtney Reed), the sultan’s brainy daughter. To win her hand, Aladdin must not only be a prince but outfox the sultan’s scheming vizier, Jafar (Jonathan Freeman, reprising his role from the animated movie).\n\nThat’s where Genie and those three wishes come in handy.\n\nFaithful to the film’s spirit, book writer Chad Beguelin (“Elf”) and choreographer/director Casey Nicholaw (“The Book of Mormon”) have checked all the boxes: nefarious nemesis, comic-relief pals, showbiz references. One song alone — a much expanded, show-stopping version of “Friend Like Me” — features nods to “Dancing With the Stars,” “West Side Story,” “Let’s Make a Deal” and several other Disney musicals.\n\nThen again, everything here is amped up. You want sidekicks? Aladdin and Jasmine have not one but three each, maybe to compensate for their lack of personality.\n\nThe only acolyte who stands out is Jafar’s wisecracking henchman, Iago — not a parrot, but a pint-size person (Don Darryl Rivera). The pair have a great physical rapport — Rivera short and round, Freeman tall and hulking — and their evil cackles are a delight.\n\nThere’s also a moonlit magic-carpet joy ride, as Aladdin and Jasmine float above the stage against a star-studded sky — a worthy setting for the biggest hit of Alan Menken, Howard Ashman and Tim Rice’s solid score, now augmented with new songs by Menken and Beguelin.\n\nYet there are incomprehensible hiccups. Chorus boys in harem pants are going to look like extras in an MC Hammer video no matter what, but scenic designer Bob Crowley’s cruise-ship Arabia shouldn’t look so cheap. Beguelin also lays on the Borscht Belt shtick with a trowel.\n\n“Every time I pick a pocket, I feel awful,” complains Aladdin’s buddy Omar (Jonathan Schwartz), to which his food-loving pal Babkak (Brian Gonzales) replies, “Falafel? Did somebody say falafel?”\n\nThe whole vibe is like a throwback to those old Bob Hope/Bing Crosby movies: “The Road to Agrabah.”\n\nBut the journey may be a short one — leaving the beautiful New Amsterdam Theatre free just in time for the “Frozen” musical to move in.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 482,
  "archivePath": "data/archives/reviews/aladdin-2014/nypost-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:34:45.516Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20260103115711",
  "archiveOrgUrl": "http://web.archive.org/web/20260103115711/https://nypost.com/2014/03/20/aladdin-musical-doesnt-quite-seem-like-a-disney-hit/"
}