{
  "showId": "aladdin-2014",
  "outletId": "perez-hilton",
  "outlet": "Perez Hilton",
  "criticName": "Perez Hilton",
  "url": "http://perezhilton.com/2014-04-12-aldaddin-broadway-review#.VNMXoObBDz4",
  "publishDate": "April 12, 2014",
  "fullText": "Chelsea Handler In Her Bra & Panties May Be Shocking, But Here Are Some Other ... EXCLUSIVE! Win A FREE Makeover By RuPaul's Drag Race Winner Bianca Del ... Robin Williams' Wife Says He Was In The Early Stages Of Parkinson's Disease ... Bad Boys 3 Is A Go! Martin Lawrence Confirms The News To Conan O'Brien! ... Iggy Azalea Pays Homage To Movies In Her Videos -- But She Isn't The First! 12 ... Taylor Swift Will Be Performing At The 2014 MTV Video Music ... That Waitress Kendall Jenner Supposedly Threw Money At?? Now ... The SHADE Is Strong In This One! Jennette McCurdy Disses Ariana Grande ... North West Is Following In Kim Kardashian's Fashion Footsteps! Her Modeling ... Khloe Kardashian Attempts To Shoot A Kim Kardashian Look-A-Like With A ... Michael Jackson Posthumously Premieres Music Video For A Place ... Look For Le$$! Get Jennifer Lopez's Sexy Lace Mini & Make 'Em Green With Envy! Missed Ariana Grande's Break Free Music Video? Have No Fear, The Best ... 17 Of South Park’s Most Offensive Celebrity 'Cameos' For The Show’s ... Stars Who Are Or Were In Relationships With Significant Others Almost ... Nicki Minaj's A**, Rihanna's Boobs! Check Out All Of Music's Naughtiest Cover ... From Tiny Bikinis To Side Boob! Kendall & Kylie Jenner's Most ... Iggy Azalea & Rita Ora Release Their Kill Bill-Inspired Music Video For ... The Most Inspiring Movie Quotes From Robin Williams' Best Characters! EXCLUSIVE! Miranda Lambert & Blake Shelton's Baby News? Get The ... Miranda Lambert Pregnant! New Reports Say She & Blake Shelton Are Already ... Celine Dion Cancels Her Entire Asia Tour Due To Her Husband's Cancer -- And ... The SHADE!!! Celebrities Who Have Perfected The 'F*Ck Off' Face! Robin William's Daughter Zelda Quits Social Media After Being Harassed ... Jimmy Fallon Breaks Down During His Tonight Show Tribute To Robin Williams ... Justin Bieber's Miami DUI Case Is Almost Over -- And He Has Reason To ... Ciara Calls Off Her Engagement To Her Fiancé Future! You Won't Believe ... Ariana Grande Strips, Plays With Aliens, & Fights Robots In The C-C-Crazy Break ... Robin Williams' Death & Influence Touched Many! Read All His Co-Stars' ... Justin Bieber's Butt Exposed! 21 Times His Pants Ran Away From ... Robin Williams' Children Remember The Late Actor And The 'Joy' He Brought ... Couple Falls To Death In Front Of Kids - All For A Selfie perez_setVideoPlayer(\"e4aff94dc87ac\", ph_player_size[ph_ad_page_type][\"player_width\"], ph_player_size[ph_ad_page_type][\"player_height\"], \"vega4-liverail-flp\", \"false\", \"post\", \"perezhilton\", \"965857546\", false); We have seen more musicals than we can count and never before have we seen a standing ovation DURING a show… until Aladdin! Disney's new Broadway musical is lucky enough to have such a literal showstopping number in Friend Like Me. Aladdin has everything you want in a big Broadway musical - great songs, fabulous voices, stellar acting, amazing production value, huge sets, lavish costumes, dazzling dance numbers and MORE! The show's secret weapon, though, is it's book and direction. The book, by Chad Beguelin, is so LOL! Literally LAUGH OUT LOUD funny - from start to finish! And the direction - as well as choreography - by Casey Nicholaw is so inventive! You just marvel at all the creativity on stage and you could tell he and his collaborators had so much fun making this show and trying to impress the audience! Disney learned from their recent misstep on Broadway that was The Little Mermaid and have delivered a mega satisfying hit with Aladdin! It's great for the kids AND the adults! And the gays too! The show is super gay! Super camp! Super fabulous! The performances are all wonderful! Jonathan Freeman, who voices Jafar in the film, plays the same part in this live production! How cool is THAT???? And extra kudos to James Monroe Iglehart - as the Genie - for fleshing out a wholly new interpretation and not just recreating what Robin Williams did in the film! We also loved seeing such a colorful and multi-cultural cast on stage! Note: your comment may take a few minutes to appear. Note: your comment may take a few minutes to appear. On DCL they have the best plays and they do a part from Aladin. You should take your family on a Disney cruise:) Please stop reviewing Broadway. Your reviews are usually pretty bad. Stay with what your best at. Re posting celebrity gossip. Thank you for writing such an enthusiastic review of <i>Aladdin</i>!! It makes me want to go and see it again! ^___^ Went with my daughter to see this Wednesday(her first Broadway show) It was a great show and we had standing ovations as well. The Genie was amazing A Tony nomination for James Monroe Iglehart ,is deserved. I am sure Alladin is wonderful but Priscilla Queen of the Dsert got a Standing Ovation during the show…guess you weren't lucky enough to be there Can't wait just now buying tickets…thanks for the review. Do you think seats are better in the orchestra or Mexzanine?? The more that surfaces about Robin Williams' struggles leading up to his untimely death, the more heartbroken we get. According to a statement made by Robin' wife, Susan Schneider, the late actor was in the early stages of Parkinson’s Disease prior to his death. Chelsea Handler In Her Bra & Panties May Be Shocking, But Here Are Some Other Celebs With Surprisingly Bangin’ Bodies! Seriously, we're still not over Chelsea Handler's super HAWT beach bod. It's incredible! Jus... EXCLUSIVE! Win A FREE Makeover By RuPaul's Drag Race Winner Bianca Del Rio! Get All The Deets HERE! Who doesn’t love a little drama?? After seeing Bianca Del Rio battle it out for the season ... Jimmy Fallon Breaks Down During His Tonight Show Tribute To Robin Williams - Watch The Video H... Bad Boys 3 Is A Go! Martin Lawrence Confirms The News To Conan O'Brien! Watch HERE! Have YOU been wanting Hollywood to make Bad Boys III? Then Martin Lawrence is about to make y... This Shiba Inu Trying To Save A Fish Out Of Water Will Thaw Your Icy Cold Heart Faith in humanity the animal kingdom restored! A video of a Shiba Inu trying to put water on... American Horror Story: Freak Show Adds A New Cast Member! AHS fans, meet Jyoti Amge! American Horror Story just cast Jyoti in the upcoming Freak Show ... Celebrity Makeovers Like You've Never Seen! Behold... The 8 Funniest #MakeupTransformations!! A little contouring and highlighting can go a long way! Actually, so far in fact, that you ca... EXCLUSIVE! Linda Perry Fans! Win A Chance To Hang Out With The LEGEND In L.A.! Incredible Make Or Break Sweepstakes Here! Oh, do we have a treat for all of you today! Last week, we revealed that we would be announci... The SHADE Is Strong In This One! Jennette McCurdy Disses Ariana Grande HARD In Her Web Series! LOLOL! You've gotta admit, this is kinda sorta really funny! Jennette McCurdy's show with Ar... Kendall Jenner Swears She Would NEVER Disrespect A Waiter Or Anyone By Throwing Money In Their Face! Do You Believe Her? Kendall Jenner wants you to know that she is not about that disrespecting life! In the latest... 20 Hollywood Hunks Who LOVE To Keep Their Bulges Snug In Tight Pants! THE TONIGHT SHOW - Taylor Swift Confirms 2014 MTV VMA Performance THE TONIGHT SHOW WITH JIMMY FALLON - Taylor Swift Says Ew! Home | About | Copyright statement | Conditions of Use | Privacy Notice | Sitemap Advertising | perez_mailto('7465636840706572657a68696c746f6e2e636f6d', 'Report technical problems');Report technical problems | Perez Posse signup FAQ | RSS",
  "isFullReview": false,
  "showScoreExcerpt": "\"Everything about Aladdin is a win win WIN!\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score",
  "sourceUrl": "https://www.show-score.com/broadway-shows/aladdin",
  "textStatus": "complete",
  "textWordCount": 1269,
  "textFetchedAt": "2026-01-25T13:42:49.528Z",
  "textFetchMethod": "archive.org",
  "archivePath": "data/archives/reviews/aladdin-2014/perez-hilton--perez-hilton_2026-01-25.html",
  "textQuality": "full",
  "sourceMethod": "showscore"
}
