{
  "showId": "aladdin-2014",
  "outletId": "THR",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/disneys-aladdin-theater-review-690038/",
  "publishDate": "2014-03-20",
  "fullText": "Cylla von Tiedemann Share on Facebook Share on X Google Preferred Share to Flipboard Show additional share options Share on LinkedIn Share on Pinterest Share on Reddit Share on Tumblr Share on Whats App Send an Email Print the Article Post a Comment NEW YORK &#8212; Its exotic Middle Eastern setting and multiethnic cast aside, Aladdin offers less &#8220;A Whole New World&#8221; &#8212; to quote its signature song &#8212; than a traditional Disney fairy-tale realm; it&#8217;s perhaps the most old-school of the company&#8217;s screen-to-stage adaptations since Beauty and the Beast . But that shouldn&#8217;t deter audiences from making this splashy Arabian Nights wish-fulfillment fantasy into a family-friendly hit. Directed and choreographed by musical comedy specialist Casey Nicholaw with loads of retro showmanship, an unapologetic embrace of casbah kitsch and a heavy accent on shtick, this is sweet, silly fun. It&#8217;s not the most sophisticated entertainment, but the target demographic won&#8217;t mind at all. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-article-mid-article-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[300,250],[2,2],[300,251],[620,350],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); Related Stories Business Broadway Box Office: &#039;Harry Potter&#039; Brings In $2.65 Million As Industry Heads Into Slow Winter Months Lifestyle Channing Tatum&#039;s &#039;Magic Mike Live&#039; Comes to New York The 1992 release followed The Little Mermaid and Beauty and the Beast in Disney&#8217;s renaissance of the animated feature musical, heralding the valiant final resurgence of hand-drawn toon artistry before computer animation took hold. The film was notable for its shift beyond the princess focus to a more boy-centric story, and for being among the first cases of major celebrity voice casting becoming central to the production&#8217;s marketing, via Robin Williams &#8216; role as the motormouth Genie. It was also the final collaboration between composer Alan Menken and lyricist Howard Ashman before the latter&#8217;s death due to AIDS complications in 1991. The team completed eleven songs for Aladdin , only a handful of which made it into the movie; several of the others have found an afterlife here. Tim Rice stepped in to complete work on the film&#8217;s score with Menken, while Chad Beguelin ( The Wedding Singer , Elf ), the book writer on this stage adaptation, contributes additional lyrics. Irrespective of who wrote what, the songs are tuneful, if not quite top-drawer. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-dsk-tab-mid-article2-uid1' ) .setTargeting( 'pos', [\"mid\",\"mid-article2\",\"mid-articleX\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article2\") .addSize([[300,250],[300,251],[620,350],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); Nicholaw won a 2011 Tony Award as co-director with Trey Parker of The Book of Mormon . But the most indicative precursor of his work here was his staging of &#8220;Show Off,&#8221; the hilariously insincere disavowal of a Broadway star&#8217;s natural spotlight-seeking tendencies, performed with brio by Sutton Foster in The Drowsy Chaperone . That same more-is-more, irrepressibly over-the-top shamelessness defines the twin showstoppers that bookend intermission in Aladdin . The first is &#8220;Friend Like Me,&#8221; in which the Genie ( James Monroe Iglehart ), freshly uncorked from his lamp, previews the infinite gifts available to his astonished new master, Aladdin ( Adam Jacobs ). Starting with Iglehart doing a Cab Calloway -esque scat, Nicholaw builds the song into a mammoth production number, with a chorus of whirling valets and showgirls, a &#8220;Dancing with the Scimitars&#8221; ballroom break, a step or two of hoedown, a game-show interlude, a mini-medley of Disney tunes from other musicals, an exuberant tap routine and a finale with canes and a kickline. While Williams&#8217; vocal performance in the movie was quite large, Iglehart&#8217;s high-energy turn is perhaps even larger, whether he&#8217;s dropping in winking pop-cultural anachronisms (he quotes Sweet Brown at one point) or firing off hoary one-liners like a Catskills comic. He&#8217;s a delight. The follow-up song, again led by the indefatigable Iglehart, is &#8220;Prince Ali,&#8221; a royal procession that makes Elizabeth Taylor &#8216;s Cleopatra entrance look like a casual stroll. Replete with Vegas-style fan dancers, peacocks and the now-regulation streamer explosion, this takes place after the Genie has transformed Aladdin from street scruff into a regal suitor worthy of Princess Jasmine ( Courtney Reed ), the feisty Sultan&#8217;s daughter feeling cramped inside the palace walls. blogherads.adq.push(function () { blogherads .defineSlot( 'med...",
  "originalScore": null,
  "assignedScore": 78,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "urlUpdated": "2026-01-23T05:12:15.016Z",
  "fetchedAt": "2026-01-23T05:23:06.420Z"
}