{
  "showId": "aladdin-2014",
  "outletId": "VULTURE",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "http://www.vulture.com/2014/03/theater-review-aladdin.html",
  "publishDate": "2014-03-20",
  "fullText": "Save this article to read it later. Find this story in your account’s ‘Saved for Later’ section. With very few exceptions, almost none of them on Broadway, musicals are no longer initiated by artists but by producers and rights-holders. Even original material, if it manages to pass through the flaming hoops of fundraising and profit analysis, winds up onstage a corporate concoction. But this doesn’t mean the results can’t be good, or that the creatives assigned to build these moneymakers aren’t artists themselves, applying enormous skill to the task. With The Lion King in 1997, the theatrical division of Disney introduced a notion of staged family entertainment that is both presold and well crafted, campy and mainstream, eye-popping and virtuous — a notion it has been refining, sometimes with hits, sometimes with flops, ever since. For Aladdin, Disney’s team builds on the take-no-chances, take-no-prisoners lessons of its six Broadway predecessors to all but guarantee a quality hit: if not a Lion King, at least not a Tarzan. They wrote the book on this sort of thing, and now, Walt be praised, they’re going to heave it at you. This is not as unpleasant an experience as it sounds; if you’re up for a meaningless fling, it might as well be with a pro. And Aladdin, for all its desert emptiness, plays by the rules. Rule No. 1: Show the audience right at the top what kind of experience it’s going to get — and then keep giving it. Sure enough, the trademark Disney tone is established as soon as the gorgeous show curtain disappears, when Genie, a Cab Calloway type in spangly turquoise harem pants, arrives to host what amounts to a variety act at the Sands. (“Come for the hummus, stay for the floorshow!”) Within seconds, the song “Arabian Nights,” one of several catchy holdovers from the 1992 movie, is setting the scene in the city of Agrabah (where “even the poor look fabulous”), introducing the main characters (urchin and princess), offering a plot synopsis (urchin loves princess), and demonstrating the relentless Disney trick of kicking down the fourth wall with anachronistic jokes that bypass the kiddies on their way to adults. (I stopped counting the inside-Broadway references after Gypsy and West Side Story.) Except for the actual, you know, content, this is an opening number worthy of Jerome Robbins: “Tradition” with bejeweled Arabs instead of begrimed Jews. A strict adherence to best practices is maintained throughout; it’s really quite astonishing to see how the book writer Chad Beguelin, while closely tracking the movie, hammers the material to fit Disney specs. Only seven pages in, we get a dead mother. Soon enough our hero is singing an “I Want” song called “Proud of Your Boy,” in which he promises to honor her by not being poor anymore. A new establishing number for the princess, Jasmine, follows instantly, and then one for Aladdin’s three sidekicks, who have fortunately replaced the movie’s monkey and are named (I think) Doofus, Twink, and George Costanza. (Costanza gets the preponderance of the requisite bad puns.) Before you know it, and yet maybe not quite soon enough, comes the knock-’em-dead first-act production number, “(You Ain’t Never Had a) Friend Like Me,” in which James Monroe Iglehart as Genie buys, at the cost of a possible hernia, his Tony nomination. The director and choreographer, Casey Nicholaw, buys his, too; as he demonstrated in Spamalot and The Drowsy Chaperone, he can stuff a dance with so many tricks and jokes that it becomes, in its sheer too-muchness, a weirdly pure abstraction of fun. So why is Aladdin a bit of a chore? Its jaw-dropping moments are nicely spaced and the intervening longueurs not too long. Beguelin has wisely selected what to borrow and what forgo in switching from animation to stage: dropping, for instance, Genie’s impossible-to-replicate shape-shifting (which was synchronized to Robin Williams’s insane vocals) but keeping the magic carpet ride. And even if it’s a bit stiff on the curves, like a ’57 Chevy, it is magical — the superfine cables are almost completely invisible against a brilliant starry backdrop. Furthermore, Alan Menken’s music is consistently delightful, especially in its Bing Crosby vein. The lyrics, by three different lyricists, are naturally more variable. Howard Ashman’s originals are energetic little wit-bombs (“Prince Ali / Wonderful he!”); Tim Rice’s, written for the movie after Ashman died, are jury-rigged and unidiomatic. (The phrase “a new fantastic point of view,” from the hit song “A Whole New World,” makes my head hurt.) Beguelin has provided the latest material with lyrics that are always neat, and clever where necessary. But even the best of what the writers offer doesn’t seem to stick very long; if it weren’t for Nicholaw’s merciless flogging, you feel the story would simply evaporate in the desert heat. (The blinding lighting and cartoon-bright costumes are by Natasha Katz and Gregg Barnes, respectively.) Is it the unrelentingly sarcastic tone? The constant overingratiation? Despite, say, Dumbo, we don’t expect anything too pointedly dark in a Disney entertainment, but here every sharp edge is sanded to nothing. When the villainous vizier Jafar tells Jasmine (falsely) that Aladdin is dead, her grief lasts exactly two lines. With its beautiful fabrics and full-moon view, Aladdin’s supposed hovel on a roof (“I’ve got rats for roommates”) looks like it might rent for $1,000 a night at the Riyadh Four Seasons. (The gloriously cheesy scenic design is by Bob Crowley.) And the urchin himself, described as a diamond in the rough “under the filth and fleas,” is as clean and Pepsodent-bright as, well, a Broadway jeune homme. Small things, but they add up to a big problem: If the whole enterprise is arranged to prevent us from taking anything seriously, why should we respond when we’re suddenly asked to care? (Spamalot didn’t ask us to.) This also makes the romantic roles mostly unactable, at least by the stiff cuties Disney favors. By the time Aladdin rededicates himself to an honest life, in a reprise of “Proud of Your Boy” at the end of Act One, I found myself asking: (1) Why are they reprising a song that was a snore the first time? (2) What did his mother die of, boredom? and (3) who is Aladdin’s dentist? Far be it from me to tell Disney what to do; its stage productions have grossed more than $2.1 billion in New York to date, $1 billion from The Lion King alone. But ever since that show’s unique success, the policy of divvying up the tone of its storytelling between adults and kids, New Yorkers and tourists, cognoscenti and rubes, has produced diminishing returns, pleasing fewer from each demographic. Or, at least, fewer from mine. Admitting that they do as good a job as anyone could, given the givens — which is to say the source material — one is forced to ask what they might do given other givens. So here’s a new fantastic point of view: What if Disney applied its unparalleled know-how to stories that are not reducible to needlepoint truths at the first act curtain? Aladdin will surely be another of its successes; I hope it is. But what if it put its corporate muscle and smarts behind an artist instead of a franchise? What if they gave us a new West Side Story or Gypsy, instead of just quoting them for anachronistic laughs? Aladdin is at the New Amsterdam Theatre. *This article appears in the March 24, 2014 issue of New York Magazine.",
  "showScoreExcerpt": "\"So why is Aladdin a bit of a chore? Even the best of what the writers offer doesn’t seem to stick very long; if it weren’t for Nicholaw’s merciless flogging, you feel the story would simply evaporate in the desert heat.\"",
  "originalScore": null,
  "assignedScore": 62,
  "source": "reviews-json-stub",
  "needsFullText": true,
  "bwwExcerpt": "For Aladdin, Disney's team builds on the take-no-chances, take-no-prisoners lessons of its six Broadway predecessors to all but guarantee a quality hit: if not a Lion King, at least not a Tarzan. They wrote the book on this sort of thing, and now, Walt be praised, they're going to heave it at you. T...",
  "textStatus": "complete",
  "isFullReview": false,
  "textWordCount": 1251,
  "archivePath": "data/archives/reviews/aladdin-2014/VULTURE--jesse-green_2026-01-25.html",
  "textFetchedAt": "2026-01-25T14:23:00.004Z",
  "textIssues": [
    "Word count too low: 15 (min: 300)",
    "Show title not found in text"
  ],
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.942Z",
  "textFetchMethod": "playwright-stealth"
}