{
  "showId": "aladdin-2014",
  "outletId": "zeal-nyc",
  "outlet": "Zeal NYC",
  "criticName": "Chris Caggiano",
  "url": "http://www.chriscaggiano.com/2014/04/review-disneys-aladdin-musical-on-broadway-.html",
  "publishDate": "April 5, 2014",
  "fullText": "The Walt Disney Company continues to comb its catalog for stage-musical candidates. You can hardly blame them: The Lion King has become a license to print money, Newsies is still going strong after two years, and New York audiences continue to demonstrate that they will indeed pay top dollar (or at least discounted dollar) to take their kids to the theater. Of course, Disney has fumbled in the past. The Little Mermaid was a bloated disappointment, and the less said about Tarzan, the better, really. But hopes were high, and word from out-of-town tryouts was decent, for Aladdin, the latest Disney property hoping to capture the minds of the young and the wallets of their parents. From where I sat, Aladdin was diverting, to be sure, but ultimately uninspired. Say what you will about the book and the songs to The Lion King, the production itself is dazzling, thanks to Julie Taymor's jaw-dropping visuals. (Hmm, whatever happened to Taymor?) Aladdin feels like a passable summer-stock production with a Broadway budget. The look is lush and colorful, but the production itself is sluggish and pedestrian. At least Disney has learned from The Little Mermaid not to overwhelm the show with lumbering and expensive set pieces. With Mermaid, the glitz overwhelmed what is in fact a strong score, at least with respect to the original movie songs. The big disappointment with Aladdin is director/choreographer Casey Nicholaw, who until now was looking like the Next Big Thing. Nicholaw did a masterful job with The Drowsy Chaperone, imbuing the production with an infectious sense of fun and a ton of imaginative staging. And The Book of Mormon surely owes no small debt to Nicholaw for its non-stop hilarity and inventiveness. Nicholaw even made Anyone Can Whistle whiz along joyously during its recent stint at Encores, no small feat with the that show's preachy, fragmented book. Nicholaw's work on Aladdin feels utterly ordinary, with production numbers lumbering along with no apparent point or sense of build. \"One Jump Ahead\" felt particularly plodding and artificial. (You could tell the bad guys were deliberately holding back in order to not catch Aladdin.) Nicholaw manages to whip up the occasional show-stopper, as he does with \"Friend Like Me.\" Even so, that number felt poorly paced, not giving the otherwise masterful James Monroe Iglehart as the Genie a chance to stop and catch his breath. (C'mon, Casey, even Victor/Victoria knew when to bring on the chorus and give Julie a rest.) As is usually the case with these stage adaptations, Aladdin features an array of new songs and a revamped book. The new script is by Chad Beguelin, one of the authors of the fun and underrated The Wedding Singer, but Beguelin's attempts to punch up the proceedings with hoary humor more often than not fall flat. Particularly tiresome is a series of labored puns about Middle Eastern food, including hummus, baba ganoush, and falafel. (As in \"Oh, I falafel about it...\") For some reason, someone thought it necessary to add a bunch of irrelevant nonsense about Aladdin's three buddies, the newly minted Omar, Babkak and Kassim. These sidekick wannabes usually only take up stage time, serving to populate pointless production numbers that only seem to move the story from one venue to the next. The original songs with music by Alan Menken and lyrics by Howard Ashman and Tim Rice are supplemented here by new songs by Menken nd Beguelin, but none of these new songs makes a lasting impression. It was nice to hear the song \"Proud of Your Boy,\" which was written for the 1992 movie but cut during the development process. Aladdin sings the song to his now-deceased parents, but the song fails to provide the intended emotional resonance, at least as presented here. One thing I will say for Aladdin: the magic carpet is sensational. I'll be damned if I can figure out how they did it. I couldn't see any wires and there didn't seem to be a cherry picker in evidence. Genuinely magical. If only that sense of magic had pervaded the rest of the production, Aladdin might have been one for the ages. Instead, it's pleasant but forgettable.",
  "isFullReview": false,
  "showScoreExcerpt": "\"From where I sat, Aladdin was diverting, to be sure, but ultimately uninspired...it feels like a passable summer-stock production with a Broadway budget. The look is lush and colorful, but the production lacks magic.\"",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score",
  "sourceUrl": "https://www.show-score.com/broadway-shows/aladdin",
  "textStatus": "complete",
  "textWordCount": 697,
  "textFetchedAt": "2026-01-25T13:46:10.589Z",
  "textFetchMethod": "archive.org",
  "archivePath": "data/archives/reviews/aladdin-2014/zeal-nyc--chris-caggiano_2026-01-25.html"
}