{
  "showId": "summer-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2018/04/23/donna-summer-lachanze-broadway/",
  "publishDate": "2018-04-23T21:16:50",
  "fullText": "Nearly six years after her death, Donna Summer remains one of the most underappreciated singers of her time, in part because of the unfairly maligned genre she was associated with. Every note Summer sang was a refutation of disco’s supposed soullessness, and the recordings she made in the mid-to-late ‘70s with dance-pop maestro Giorgio Moroder and co-producer/writer Pete Bellotte offer more pure, vibrant musicality than most of the corporate rock or, certainly, punk cranked out during that period.\n\nSummer’s big, gleaming voice, a marvel both technically and in its unfiltered passion, proved equally at home with musical theater, rock, standards and inspirational music, and Broadway’s new Summer: The Donna Summer Musical aims to show us just how much turf the woman tagged the Queen of Disco covered—and not just as an artist. Jukebox musicals tend to take one of two forms, either a collection of songs strung together by a usually thin fictional plot or, essentially, hagiography; Summer falls into the latter camp, with traces of the former in its sometimes awkward positioning of tunes.\n\nHappily, the subject of this show is ripe for celebration, and by the time it blazes through Summer’s life and career (in roughly 100 minutes, with no intermission), you’ll forgive librettists Colman Domingo, Robert Cary and director Des McAnuff for their lamer lines and more awkward transitions, and be sucked into the sheer joy generated by a woman who still doesn’t get enough credit for repeatedly defying expectations, boundaries, and stereotypes.\n\nSummer is played here by three winning performers: Broadway newcomer Storm Lever is cast as “Duckling Donna,” the precociously gifted, yearning girl and church soloist born LaDonna Adrian Gaines, with rising performer Ariana DeBose and beloved vet LaChanze respectively cast as “Disco Donna” and final incarnation “Diva Donna.” (Lever doubles as Mimi, the eldest of Summer’s three daughters, and LaChanze also plays Summer’s mother, Mary Gaines.)\n\nLaChanze’s warm, no-nonsense Diva serves as mistress of ceremonies, leading us through Summer’s trials and triumphs; the former include molestation, domestic violence, and being cheated by her label, Casablanca Records, not to mention the pervasive sexism and racism directed at both the singer and the music she came to represent. Family and faith are sources of strength and healing, though it’s acknowledged that Summer’s staunch religious beliefs informed a famously insensitive remark that offended her many gay fans.\n\nBy the end of the show, Summer has sought forgiveness for her trespasses, and offered it to others, such as Casablanca founder Neil Bogart, played by a dutifully slithery Aaron Krohn, who doubles as Summer’s German ex. (A young Summer’s time in Munich, where she performed in a production of Hair, produces a few wince-worthy jokes, one involving a pun on “wurst.”)\n\nKen Robinson and Jared Zirilli are relative pillars of integrity and decency as, respectively, Summer’s righteous father, Andrew Gaines, and the musician who becomes her husband, Bruce Sudano. Bruce not only embraces Mimi, the product of an earlier relationship, but allows our heroine to become doting mom to two additional kids, and stands by her through her fatal bout with cancer.\n\nIf there’s some hokum here, McAnuff, whose credits include The Who’s Tommy and Jersey Boys, smartly avoids getting mired in the darker aspects of Summer’s story; that approach wouldn’t suit the form, or an artist whose music promoted both carnal and spiritual transcendence. Robert Brill’s scenic design and Paul Tazewell’s costumes revel in bold colors and glitter as the Donnas perform favorites such as “MacArthur’s Park” and “Love to Love You Baby,” though other classics are set in less glamorous contexts, from the inside of a car (“On The Radio”) to a funeral (“Dim All The Lights”).\n\nThere remains a fundamental problem of this type of musical: However impeccably these songs are delivered, they can’t reproduce the magic of the original recordings and live performances. Still, at the preview I attended, a number of audience members eagerly accepted Diva Donna’s invitation to rise up and dance along. During the final number, I’ll confess, I joined them; it was my—spoiler alert—last chance, and I wasn’t going to miss it.\n\nSummer opened April 23, 2018, at the Lunt-Fontanne Theatre. Tickets and information: thedonnasummermusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
