{
  "showId": "the-little-mermaid-2008",
  "outletId": "deadline",
  "outlet": "Deadline",
  "criticName": "Pete Hammond",
  "url": "https://deadline.com/2023/05/the-little-mermaid-review-rob-marshalls-live-action-take-disney-animated-classic-1235368418/",
  "playbillVerdictUrl": "https://deadline.com/2023/05/the-little-mermaid-review-rob-marshalls-live-action-take-disney-animated-classic-1235368418/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Awards Columnist/Chief Film Critic\n\nDisney’s attempts to reinvent their animated classics as live action versions has proven to be largely a smart boxoffice play, but one with a mixed creative result. Certainly some were huge hits like Bill Condon’s Beauty And The Beast and Guy Ritchie’s less enchanting Aladdin. Others effectively created photo-real animals in The Lion King and The Jungle Book. Older Disney staples have gotten the treatment by focusing on the villains in Cruella and Maleficent and their sequels, even an unfortunate Disney + attempt on the untouchable (if you ask me) Lady And The Tramp. But even approaching an animated masterpiece, 1989’s The Little Mermaid and essentially trying to make a splashy (sorry) big screen live action musical that works above and under the water seems dicey on paper. So what do you do? Bring in Rob Marshall, and as it turns out that is all the new live action The Little Mermaid needed. \n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n\n Festivals\n \n\n \n \n\n \n \n \n \n 'I Want Your Sex' Review: Olivia Wilde And Cooper Hoffman Dominate The Screen In Gregg Araki's Fun, X-Rated Comedy - Sundance Film Festival \n \n \n\n \n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n\n News\n \n\n \n \n\n \n \n \n \n Javier Bardem Responds To Backlash Against Film Workers For Palestine Pledge\n\nThe filmmaker, who had his own previous experience treading on a Disney classic with 2018’s Mary Poppins Returns and making it work delightfully on its own, and also with movie musical adaptations like Into The Woods and the Oscar-winning Chicago, together with a sea epic Pirates Of The Caribbean: On Stranger Tides is clearly the guy with the right filmography to even try this, and the good news is, even with an expensive and gigantic production nearly KO’d by pandemic shutdowns, Marshall has made a movie with all the magic required to pull it off and, if not replace the original in our hearts, at least has made a movie that can stand next to that one to also become a memorable part of our cinematic world.\n\n \n Watch on Deadline\n\nWith a David Magee script that sticks to the story, the catchy Alan Menken and Howard Ashman songs like “Part Of Your World”, “Kiss The Girl”, and Oscar winner “Under The Sea” now joined effortlessly by three new tunes from Menken and Lin-Manuel Miranda, and a perfectly chosen cast, this Mermaid has all the right stuff. Disney will probably print money with this one, but it will be justified.\n\nThe whole souffle sinks of course if you don’t have the right Ariel, and as the title star, Halle Bailey simply soars, a gorgeously conceived Disney princess who longs to become human just to check it out. Bailey’s vocals alone are the price of admission including making her signature “Part Of Your World” thrilling to behold. You all know the plot of this one by now. Ariel, youngest daughter of King Triton (Javier Bardem) who rules beneath the sea, is naturally curious, a sometimes dangerous trait that takes her out of her ocean habitat and above ground to stage a daring rescue of the dashing Prince Eric (Jonah Hauer-King) as his ship is caught up in a fiery disaster. This is the Disney playbook 101, a Prince who becomes obsessed with a mysterious beautiful savior, and that would-be princess finding her way above her station in life to become human, if just for a moment before being thwarted by the evil Sea Witch Ursula ( a wild Melissa McCarthy) with whom she makes a deal with the devil. Ursula will provide the potion to give her legs and to reunite with her Prince, but she has only three days in order to get him to kiss her or will belong to Ursula’s dark world forever, one the witchy tentacled bad news bear of a creature will ultimately rule, if she has her way. Once on land she does find her way to the castle, with the help of course of her BFFs, crab Sebastian (voiced by Daveed Diggs), fish Flounder ( Jacob Tremblay) and neurotic and manic seabird Scuttle (Awkwafina). Unbeknownst to Eric, he is intrigued, but has to tread carefully considering the advice of mother, the Queen (Noma Dumezweni) and father figure Sir Grimsby (Art Malik). Ariel must also deal with the disgust of her father as she sets out on this venture, and of course Ursula who will stop at nothing to achieve her own naked ambition, even it that means going human herself and following Ariel to the castle.\n\nMarshall has staged one spectacular scene after another here, starting with that shipwreck for which Visual Effects Supervisor TIm Burke and his team deserve massive credit. There are also those iconic musical numbers including Ursula’s dazzling “Poor Unfortunate Souls” in a CGI production number to remember, as well as bringing “Under The Sea” to life in a way that actually stands up to the wonderful visuals still recalled from the animated film. Adding new songs to the mix can be risky as they have a lot to live up to, but leave it to Menken and new collaborator Miranda to make them work, especially a hot rap number for Scuttle and Sebastian called “The Scuttlebutt”. Both Haver-King with his solo shot, “Unchartered Waters” and Bailey with a lovely introduction to a new life, “For The First TIme” deliver in style.\n\nBailey has a ‘star is born’ role here and makes Ariel her own, even with the memories of Jodi Benson still alive from her vocal performance in 1989 and a Broadway version of the tale. Hauer-King brings just the right amount of swagger to the befuddled Prince, and Bardem’s underwater king is perfect with one incredibly poignant father/daughter moment that will bring tears by the time the credits roll. The vocal work of Diggs and the irrepressible Awkwafina could not be better.\n\nMarshall has gathered his Oscar-winning team from Chicago to really bring the goods in what had to be a herculean effort to make this fish tale swim. Props to Dion Beebe’s cinematography and production designer John Myhre’s work, both requiring new skillsets to shoot on land and underwater. Editor Wyatt Smith, and costume designer Colleen Atwood also contribute mightily to making The Little Mermaid a big success in this new incarnation.\n\nProducers are Marshall, Marc Platt, Miranda, and John DeLuca. Disney opens it on Friday.\n\nDistributor: Walt Disney Studios\n\nCast: Halle Bailey, Melissa McCarthy, Javier Bardem, Daveed Diggs, Awkwafina, Jacob Tremblay, Jonah Haver-King, Noma Dumezweni, Art Malik\n\nRunning Time: 2 hours and 15 minutes\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nGreat cgi the first 20 minute was fantastic!\n\nEven though I’m not a huge fan of the animated movie, I thought this was wonderful. Beautifully performed (although Melissa McCarthy was only okay as Ursula), gorgeous visuals.\n\nI can’t wait to see Ryan Gosling as the new Black Panther.\n\nYou are aware that The Little Mermaid is a fictional character – right?\n\nBUT will it be a winner at the box office, doubt it.\n\nIt will probably fall somewhere in between Alladian and Beauty and the Beast.\n\nDeadline is a part of Penske Media Corporation. © 2026 Deadline Hollywood, LLC.",
  "isFullReview": true,
  "textWordCount": 1181,
  "archivePath": "data/archives/reviews/the-little-mermaid-2008/deadline--pete-hammond_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:34:35.676Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_junk"
  ],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1181,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2023 outside valid range 2005–2010 for show opening 2008"
}