{
  "showId": "the-little-mermaid-2008",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Ellen E Jones",
  "url": "https://www.theguardian.com/film/2023/may/22/the-little-mermaid-review-ariel-disney-halle-bailey",
  "playbillVerdictUrl": "https://www.theguardian.com/film/2023/may/22/the-little-mermaid-review-ariel-disney-halle-bailey",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Shimmering … Halle Bailey in The Little Mermaid. Photograph: DisneyView image in fullscreenShimmering … Halle Bailey in The Little Mermaid. Photograph: Disney This article is more than 2 years oldReviewThe Little Mermaid review – Halle Bailey goes full mermaidcore in Disney’s CGI remakeThis article is more than 2 years oldBailey is the best thing about this film but, despite a team crammed with talent, this live action reworking can’t match the magic of the 1989 classic\n\nHalle Bailey – with her huge eyes, soaring singing voice and palpable purity of spirit – is about as naturally Disneyfied as real human beings get. So it’s ironic that her casting as the titular Ariel was ever thought controversial. Bailey is both the finished film’s only unmitigated triumph and the best argument for this whole live action remake enterprise in one shimmering mermaidcore package. If these films are to have any purpose beyond being nostalgia-powered cash-ins, it must be to allow all children – not just the white ones – to see themselves as Magic Kingdom denizens.\n\nBut almost everything else about this flops about like a dying fish on deck. Most significantly this applies to the trio of comic-relief characters: Sebastian the crab, Flounder the fish and Scuttle the seabird. This is no fault of the talented voice cast: Daveed Diggs, Jacob Tremblay and Awkwafina, respectively. It’s just that things that are cute or funny when done by an anthropomorphised cartoon cuddlies are no longer cute or funny when done by computer-generated sea-life approximates with no recognisable facial expressions. Whole sequences of character interaction fondly remembered from its 1989 predecessor – Scuttle’s instructions on how to use a human “dinglehopper”, Flounder fleeing a shark attack – are rendered lifeless by CGI. And you’d be lucky to make much of it out through the murk of the underwater cinematography anyway.\n\nIt hurts because The Little Mermaid, the original, is a true classic. Its song-and-dance numbers are among the best in the Disney canon, melding diverse influences from Harry Belafonte calypso to Esther Williams’ 1940s aquamusicals, with the wiggle of legendary drag queen Divine. These have been revived, with original composer Alan Menken drafted in alongside Lin-Manuel Miranda to produce new toe-tappers like The Scuttlebutt. Once again though, performances are fatally undermined by performers: the northern gannet is justly renowned for its diving abilities, but this seabird species simply cannot musically emote. Maybe it’s the beak.\n\nThe Little Mermaid doesn’t lack for talent or audience goodwill – director Rob Marshall did wonders with Mary Poppins Returns – but the siren call of supposedly surefire box office has sunk it nonetheless. There is dry land in sight though, and it’s the same outcrop on which the House of Mouse was built: the realisation that some stories – the most magical ones, in fact – are best told with animation.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 492,
  "archivePath": "data/archives/reviews/the-little-mermaid-2008/guardian--ellen-e-jones_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:35:41.640Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "truncated",
  "wordCount": 492,
  "tierReason": "Missing proper ending or other signals",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2023 outside valid range 2005–2010 for show opening 2008"
}