{
  "showId": "the-little-mermaid-2008",
  "outletId": "hollywood-reporter",
  "outlet": "Hollywood Reporter",
  "criticName": "Lovia Gyarkye",
  "url": "https://www.hollywoodreporter.com/movies/movie-reviews/the-little-mermaid-review-halle-bailey-melissa-mccarthy-1235484161/",
  "playbillVerdictUrl": "https://www.hollywoodreporter.com/movies/movie-reviews/the-little-mermaid-review-halle-bailey-melissa-mccarthy-1235484161/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "We've been here before, haven't we? A Disney live-action remake igniting a round of existential debate? This time it's Rob Marshall‘s interpretation of The Little Mermaid, based on John Musker and Ron Clement's 1989 version and starring Halle Bailey as the titular sea creature. It features new music by Lin-Manuel Miranda and wrings as much as possible from the corporation's CGI budget.\n\nThe questions raised by this faithful adaptation are familiar, but answering them only matters to an extent. Nostalgia pays in cash, correctives in publicity. For the global conglomerate's bottom line, remaking classics is worth it. That these already tempered fairytales are retrofitted for contemporary audiences is merely a bonus.\n\n \n \n \n\n \n \n \n\n \n \n\n \n\n \n \n \n Related Stories \n \n\n \n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n TV\n \n \n \n \n\n \n \n \n \n Apple TV's 'Cape Fear' Starring Amy Adams, Patrick Wilson and Javier Bardem to Debut in June \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Movies\n \n \n \n \n\n \n \n \n \n David Yarnell, Veteran Producer on 'Can You Ever Forgive Me?' and Early TV and Radio Shows, Dies at 96 \n \n \n\n \n \n \n \n\n \n \n\n \n\n \n \n \n\n \n \n \n The Little Mermaid \n \n\n \n \n The Bottom Line\n \n \n A ho-hum adaptation buoyed by a lovely lead turn.\n \n \n \n \n \n Release date: Friday, May 26Cast: Halle Bailey, Jonah Hauer-King, Melissa McCarthy, Javier Bardem, Daveed DiggsDirector: Rob Marshall Screenwriter: David Magee \n \n Rated PG,\n 2 hours and 15 minutes\n\nMarshall's Ariel (Bailey) is Black — a choice that sent scores of people clutching their pearls and reverting to racist protestations. Their complaints of a nonexistent white erasure are littered across the internet under the hashtag #NotMyAriel. (It seems to not have occurred to the objectors that a fictional character does not belong to anyone.) The detractors had no standing, but their outrage fueled the anxious anticipation and expectations around the film.\n\nThankfully, Bailey doesn't disappoint as Ariel. Her performance adds edge to what is ultimately a serviceable film. Whether she's belting out a newly arranged \"Part of Your World\" or silently observing her less than charming prince (Jonah Hauer King) navigate his own social constrictions, her charisma radiates off the screen. The Beyoncé prodigy and the other half of the Grammy-winning duo Chloe x Halle gracefully presents her own Ariel: The character is still sweet and sharp-tongued, but there's a touch more bite to her defiance. Her voice, the narrative's raison d'&ecirc;tre, sounds ethereal, too. Reconciling the strength of Bailey's portrayal with the rest of the film, however, takes some work.\n\nMarshall's The Little Mermaid resembles a lot of recent Disney offerings: It's sentimental, at times uneven and padded to weather controversy. There's a nagging sense of risk-aversion — narratively, at least — and that wariness makes the fun it does have feel sanctioned. Like other live-action remakes, The Little Mermaid is a neatly packaged story ribboned with representational awareness. There's enough in it to fill an evening, but it doesn't inspire much more than a passing sense of déj&agrave; vu.\n\nThe film opens in a photorealist interpretation of the sea somewhere off the coast of a fictitious Caribbean island. Flounder (voiced by Jacob Tremblay) resembles a real fish, his skin slimy and slightly puckered. The scales on Ariel's tail shimmer as she meanders through a shipwrecked area looking for treasures instead of meeting with her father (Javier Bardem) and her sisters. The coral reefs look like they could be in a National Geographic spread. It's jarring, at first, to see Ariel's world come to a different kind of life, but you eventually settle into the hyperrealist rhythms of her home.\n\nFor the most part, Marshall's version echoes Musker and Clements' take on Hans Christian Andersen’s tragic story. (I hope for a version one day of The Little Mermaid that takes on the author’s distressing original tale and renders the sea’s menacing reality.) When Ariel and Flounder narrowly escape a ravenous shark, it's easy to remember the same scene and marvel at the sharpness of this three-dimensional predator. The changes to the mermaid world come in the form of Triton's daughters, each of whom are of a different race and, we are told early in the film, are representatives of the seven seas. There's not much, unfortunately, done with or explained about this cosmopolitan cadre of mermaids.\n\nMarshall and his team put considerable effort into capturing Ariel's life underwater, and there’s magic to these parts of the film. Bailey sounds angelic when singing \"Part of Your World,\" with a different sense of longing than Jodi Benson, who voiced the 1989 Ariel. Daveed Diggs, voicing Sebastian, brings a reliable flow of humor to the irascible crustacean charged with protecting Ariel. His rendition of \"Under the Sea\" is accompanied by a delightful montage of aquatic life that possesses the same vitality as Disney's Strange World.\n\nWhen Ariel makes her away above ground, it's hard to build a case for why she needed to leave. The 1989 version of The Little Mermaid didn't have the sturdiest narrative, but it offered some droll moments. Remember Chef Louis trying to cook Sebastian? That subplot helped take some of the pressure off Ariel and Eric's story. The lovers get a lot more time in the new film, which I'm not convinced is a good thing. Prince Eric's island pales in comparison to Ariel's world — and the charm differential between the two performers makes it challenging to be as enthralled with the rest of the film.\n\nIf the beginning of The Little Mermaid — which includes Ariel's dealings with Ursula (Melissa McCarthy, having a campy good time) — pays homage to the original Disney version, the middle and parts of the end are, at best, pastiche. There's a tension here between building a new worldview and trying to adhere to the original screenplay. Coherence suffers in this tug-of-war. This Little Mermaid takes place on an unnamed, fictional 19th-century Caribbean island where, &agrave; la the trend of regency television shows today, the Queen is Black (Noma Dumezweni) and time is loose. Her son, a white adoptee, wants to explore the world and bring new technologies back to their isolated community. We experience the island through Ariel and Eric’s dates — a whir of laughing children, marketplace stalls, historical obfuscation and denizens whose purpose is to add texture to the movie’s vague, generic vibe.\n\nAs Ariel moves through the castle, chased by Scuttle (voiced by Awkwafina) and Sebastian, who are trying to help her land a kiss, the viewer may long to be back under the sea. The live animation techniques are weakest on land, as when Ariel and Eric spend the evening on the lagoon. The inert quality of these scenes makes Ursula's subsequent appearance to wreak havoc feel more welcome than it probably should. At last, I thought, a reminder of the more vibrant world our little mermaid left behind.",
  "isFullReview": true,
  "textWordCount": 1097,
  "archivePath": "data/archives/reviews/the-little-mermaid-2008/hollywood-reporter--lovia-gyarkye_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:43:09.886Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1097,
  "tierReason": "Full review text"
}