{
  "showId": "the-little-mermaid-2008",
  "outletId": "indiewire",
  "outlet": "IndieWire (Kate Erbland)",
  "criticName": "Kate Erbland",
  "url": "https://www.indiewire.com/criticism/movies/the-little-mermaid-review-2023-live-action-1234864226/",
  "playbillVerdictUrl": "https://www.indiewire.com/criticism/movies/the-little-mermaid-review-2023-live-action-1234864226/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Film Review‘The Little Mermaid’ Review: Disney’s Latest Live-Action Remake Desperately Wants to Be Part of Your WorldRob Marshall's update on the classic mermaid myth will make Halle Bailey a movie star, but the rest of it treads water.By Kate ErblandPlus iconKate ErblandEditorial Director\n\nkaterblandMore stories by Kate Is Nancy Meyers Making Another Christmas Movie Next?Read more\n \n \n \n\n The 17 Best Films of the 2026 Sundance Film FestivalRead more\n \n \n \n\n ‘Michael’ Trailer: What Are We Not Going to See in the King of Pop’s Splashy New Biopic?Read more\n \n \n \n\n May 22, 2023 9:00 am\"The Little Mermaid\"DISNEYShare \nShare on Facebook \n\nPost google\r\nGoogle Preferred Share on LinkedIn \nShow more sharing options Share to Flipboard \nSubmit to Reddit \nPin it \nPost to Tumblr \nEmail \nPrint This Page \nShare on WhatsApp It will feel familiar, almost instantly. As Rob Marshall‘s live-action remake (reimagining? eh, not so much) of Ron Clements and John Musker’s 1989 animated Disney classic “The Little Mermaid” opens, fans of the original gem will likely find themselves accurately predicting each shot, each beat, each song, each line, each feeling. Despite opening with a epigraph that harkens back to the (incredibly bleak) Hans Christian Andersen fairy tale which has inspired countless “Little Mermaid” yarns, Marshall’s film is mostly indebted to Clements and Musker’s vision, using it as a template to offer up yet another Disney-backed spin on one of the studio’s standards. \n\n \n \n \n\n \n \n \n\n \n \nRelated Stories The Best Movies of Sundance 2026, According to IndieWire’s Critics Survey Inside Michał Marczak’s Cinematic Return 11 Years After ‘All These Sleepless Nights’ with Sundance’s ‘Closure’\n\nBut it’s star Halle Bailey, appearing in her first leading role, who makes the best case for why this classic Disney tale needed to be made into a live-action affair. Just look at her face, so expressive and so open, so deeply and wonderfully human and alive. There are some things even the most lovingly rendered pieces of hand-drawn animation just can’t match, and Bailey’s emotive skill is one of them. (And her stunning singing? Further icing on the \"this young woman is a movie star\" cake.)\n\nBut what of the rest of it? As with Clements and Musker’s film, Marshall’s version (with a screenplay by David Magee, who previously penned Marshall’s “Mary Poppins Returns,” yet another dip back into the Disney classic well) is set in a vaguely colonial time period in a vaguely tropical locale. Ariel is the youngest daughter of the iron-willed King Triton (Javier Bardem), and despite her father’s repeated demands she not even head to the surface of their vast ocean home, she’s obsessed with all things human (forks and spyglasses, pocket watches and books, gadgets and gizmos aplenty, whosits and whatsits galore).\n\nAnd when she sets eyes on the handsome (land) Prince Eric (Jonah Hauer-King), all of her human-centric dreams become centered on this one particular human. She saves him from a squall, sings him a sweet siren song, they fall in love, you know this fairy tale, and exactly where it’s going next.\n\nWhen the nefarious sea witch Ursula (played here by Melissa McCarthy, having moderate fun until she kicks into her own gear late in the film) offers the innocent Ariel a seemingly good deal — temporarily give up her voice and gain some legs — with major strings attached, she can’t escape the pull of the world above her. She takes the bait, unaware of Ursula’s ulterior motives (this time around, Ursula is also the sister of King Triton, a detail that adds little to her character), and heads to the surface, where Eric is still searching for the sweet-voiced gal who saved him and can’t possibly understand that the charming mute who just landed on his shores is so clearly his savior and soulmate (men!).\n\nYes, it’s often as dark and murky as early previews have let on (listen, we get it, it’s under the sea, but can’t we take some creative liberties for a story that’s also about mythical sea creatures?). Yes, most of the musical sequences are cribbed directly from the 1989 animated feature, and are less effective, moving, and emotional when translated to live-action moviemaking. (Both “Under the Sea” and “Kiss the Girl” are bangers, fun and beautiful, but their live-action rendering will likely only make audiences want to run home and cue up the animated versions post-haste.) Yes, Flounder’s newly flattened fish visage is truly terrifying. (One winner in the glowed-up animal pal sweepstakes: Daveed Diggs’ Sebastian the crab, who remains the supreme sidekick in both versions.)\n\nLess fruitful are some of the other changes made to the story, enough to bloat the original film’s snappy 83-minute running time to over two hours (prayers up for the kiddos in the audience). Marshall’s bent toward realism also applies to Magee’s script, which magnifies (and sometimes even illuminates) parts of the original story that have added resonance these days, like the seemingly uncrossable divide between the humans and merpeople, who both think the other group is evil, savage, and out to ruin their way of life. There’s even a bit about the health of the ocean and concerns about pollution that should appeal to older viewers who could never quite kick the long reach of “FernGully” on their own childhood psyches.\n\nEric’s backstory gets inflated (something about him appearing out of nowhere and being adopted by the loving royal couple is a subplot that seems meaningful and ultimately goes nowhere fast), while King Triton’s latent rage and his extreme hatred of humans is chalked up to the fact that they killed his wife (another subplot that sounds of great import that’s ultimately tossed aside).\n\nMost of Marshall and Magee’s additions and alterations are easy enough to understand (of course Eric should get his own song; yes, it makes sense that Scuttle, originally a seagull, is a diving bird), though others seem to be less in service to the story and more designed to appease other forces at play (like another new song, a rap for Scuttle and Sebastian entitled “The Scuttlebutt,” which could only have been written by Lin-Manuel Miranda, and that’s not exactly a compliment).\n\nSo, does it look real? Sometimes, sure, but that’s a strange worry for a story that is — again, again — about mythical sea creatures. Disney’s obsession with turning some of its most beloved properties into live-action offerings simply for, what, the realism? the technology? the money? stumbles into both flashes of brilliance and moments of sheer nonsense (the latter was more of an issue with the studio’s recent “Lion King” remake than in this Marshall joint). That trend will likely continue to be true for the foreseeable future, but until the House of Mouse cracks the real problem at hand, these films will never become classics on their own merit.\n\nThat problem: Does it feel real? Not yet, and not even movie star turns and rapping birds and the very best of intentions can bridge that divide. For now, “The Little Mermaid” exists outside of the very world it so wants to be a part of, one already so lovingly rendered in its predecessor, “real” or not.\n\nWalt Disney Pictures will release “The Little Mermaid” in theaters on Friday, May 26.",
  "isFullReview": true,
  "textWordCount": 1195,
  "archivePath": "data/archives/reviews/the-little-mermaid-2008/indiewire--kate-erbland_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:36:28.612Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 1195,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-04T06:44:56.774Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a film review of Disney's 'The Little Mermaid' movie, not a Broadway theater review; openai: The text is a review of the film 'The Little Mermaid', not a Broadway show.; kimi: This is a film review of Disney's 2023 live-action 'The Little Mermaid' movie starring Halle Bailey, not a review of a Broadway theatrical production.",
  "promptVersion": "5.2.0"
}
