{
  "showId": "the-little-mermaid-2008",
  "outletId": "inews",
  "outlet": "iNews",
  "criticName": "Christina Newland",
  "url": "https://inews.co.uk/culture/film/the-little-mermaid-review-a-shockingly-ropey-remake-2351787",
  "playbillVerdictUrl": "https://inews.co.uk/culture/film/the-little-mermaid-review-a-shockingly-ropey-remake-2351787",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Halle Bailey is doing her damndest, in spite of underwater CGI effects that frankly make her look like a waxwork Share this story from The i Paper - and spark a conversation. Gift up to 10 articles a month to a friend, so they can read for free Share this story from The i Paper - and spark a conversation. Gift up to 10 articles a month to a friend, so they can read for free Watching The Little Mermaid remake is like seeing your beloved childhood memories sliced open and gutted at a fish market. The 1989 Disney animated classic was an unlikely refashioning of a Hans Christian Andersen tale, and became one of the most fun and zippy children’s films of its era. And its music, by Howard Ashman and Alan Mencken, is some of the catchiest: I would love to know why I can’t remember a conversation I had yesterday, but can still, with perfect clarity, recite all the lyrics to “Part of Your World”. Next to that, this new version is a damp squib (squid?). Sure, some things about The Little Mermaid haven’t aged well – particularly its gender politics, in which sacrificing oneself, and one’s voice, for the love of a man is an admirable goal. Predictably, this retread attempts to redress some of that imbalance, giving nu-Ariel (Halle Bailey) a bit more vivacity and spark. And villainess Ursula the sea witch, a tawdry OTT type well-loved for her dark glam, is played with camp humour by Melissa McCarthy. But it’s a patchy film, trying to break away from more old-fashioned trappings while somehow remaining too faithful to the 1989 version. Along with the shockingly ropey CGI – what exactly was the mega-budget put towards? – it’s simply not very exciting to watch. That said, the sweet and guileless lead Halle Bailey is doing her damndest, in spite of underwater CGI effects that frankly make her look like a waxwork. The attempt at a sort of photorealism means that the comic relief of Sebastian the crab is more uncomfortable than cheerful (he really does look like something liable to end up on your plate), and the same goes for many of Ariel’s sea creature pals: live action just doesn’t feel like the right call for a film that, in its original iteration, was so delightfully fantastical.",
  "isFullReview": true,
  "textWordCount": 391,
  "archivePath": "data/archives/reviews/the-little-mermaid-2008/inews--christina-newland_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:36:35.842Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 391,
  "tierReason": "Full review text"
}