{
  "showId": "the-little-mermaid-2008",
  "outletId": "vulture",
  "outlet": "Vulture (Angelica Jade Bastién)",
  "criticName": "Unknown",
  "url": "https://www.gamesradar.com/the-little-mermaid-2023-review/",
  "playbillVerdictUrl": "https://www.gamesradar.com/the-little-mermaid-2023-review/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "A sparkling, enchanting new spin that out-swims the original, with a pitch-perfect performance from Halle Bailey. Why you can trust GamesRadar+ Our experts review games, movies and tech over countless hours, so you can choose the best for you. Find out more about our reviews policy. Disney's live-action remakes range from inspired reinterpretations (Cruella) to almost shot-for-shot adaptations of beloved classics (The Lion King). Directed by Rob Marshall (Chicago, Mary Poppins Returns), The Little Mermaid sits squarely in the middle. At times it lovingly recreates moments from the '89 animation; at others there are new twists in the mermaid tale. The result is a lively, vibrant, joyous reimagining that's strong enough to surpass the original. Halle Bailey shines as Ariel, the curious, headstrong young mermaid who's lovesick for the surface world. Her soaring rendition of 'Part of Your World' is the goosebump-raising pearl in the film's oyster. Melissa McCarthy is another standout as baddie Ursula: giving a campy, deliciously evil performance, she owns every sly look and extravagant swish of her bioluminescent tentacles. Visually the film is treat too, diving into a bright, colourful underwater realm that's explored to toe-tapping effect in showstopper 'Under the Sea.' True, the VFX can be patchy, particularly in the action-heavy third act; on the other hand, marine sidekicks Flounder (Jacob Tremblay), Sebastian (Daveed Diggs), and Scuttle (Awkwafina) are rendered so realistically they lose some of their 2D counterparts' charm; luckily, wonderfully expressive voice acting keeps the critters loveable. Where the original ran to a slight 83 minutes, this one's a bumper 135 mins, with new songs to boot. Some of these are fabulous (Scuttle gets a catchy tune; Ariel a bubbly number about finding her land legs) while Prince Eric (Jonah Hauer-King) is saddled with a weaker, overly dramatic solo. But there's an endearing makeover for 'Kiss the Girl.' Ariel and Eric's romance – lightning-quick and undeniably shallow in the '89 movie - is given more room to breathe here. The prince gets a new backstory that makes him an ocean-loving fish-out-of-water-slash-adventurer: the perfect mirror to Ariel. There's also more emphasis on Ariel's longing for life beyond the water, which deepens her sweetly blossoming bond with Eric. Not every change works or is strictly necessary – Ursula is now sister to King Triton (Javier Bardem) but their bad blood is never properly explained. But in a clamshell, this is a fun, fresh adventure, one of Disney's best live-action remakes by a nautical mile. The Little Mermaid is in UK and US cinemas on May 26. For everything else the studio has in store, check out our guide to all the upcoming Disney movies. Bringing all the latest movie news, features, and reviews to your inbox I'm the Deputy Entertainment Editor here at GamesRadar+, covering all things film and TV for the site's Total Film and SFX sections. I previously worked on the Disney magazines team at Immediate Media, and also wrote on the CBeebies, MEGA!, and Star Wars Galaxy titles after graduating with a BA in English.",
  "isFullReview": true,
  "textWordCount": 503,
  "archivePath": "data/archives/reviews/the-little-mermaid-2008/vulture--unknown_2026-02-07.html",
  "textFetchedAt": "2026-02-07T10:44:23.794Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 503,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-07T11:33:00.071Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a review of Disney's live-action The Little Mermaid film, not a Broadway theater production; openai: The review is about Disney's live-action remake of 'The Little Mermaid', not a Broadway show.; kimi: This is a review of the 2023 Disney live-action film 'The Little Mermaid,' not a Broadway theater production. The text mentions UK and US cinemas, director Rob Marshall, and film-specific elements like VFX and runtime. This is not a Broadway theater review.",
  "promptVersion": "5.2.0"
}
