{
  "showId": "junk-2017",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "http://www.vulture.com/2017/11/theater-high-finance-and-low-crimes-in-ayad-akhtars-junk.html",
  "playbillVerdictUrl": "http://www.vulture.com/2017/11/theater-high-finance-and-low-crimes-in-ayad-akhtars-junk.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "Junk's driving tempo, cinematic smash-cuts, and clarity of underlying action undoubtedly hold our attention. Akhtar has said that he wants audiences 'to have an emotional experience of this process of capital' - to get caught up in the thrust of each scene ('somebody's instructing somebody, somebody's stealing from somebody, somebody's betraying somebody else's confidence') even if phrases like 'undisclosed equity stakes' sound a bit like Chinese. Director Doug Hughes understands that one of the things Akhtar is doing in Junk is riffing on the Shakespearean history play. He keeps the action rolling relentlessly forward on an effectively streamlined, compartmentalized set by John Lee Beatty that - not unlike an Elizabethan theater - allows for quick, imaginative shifts in time and space.",
  "bwwScore": 8,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Critics-Weigh-In-on-Ayad-Akhtars-JUNK-Opening-Tonight-on-Broadway-20171102",
  "showScoreExcerpt": "\"'Junk’s' driving tempo, cinematic smash-cuts, and clarity of underlying action undoubtedly hold our attention...It’s a credit to Akhtar, Hughes, and Pasquale’s uncompromising Merkin that 'Junk' doesn’t play as a blanket condemnation of Wall Street and a nostalgic eulogy for Main Street...According to the rules it sets out for itself, 'Junk' wins. But as with Merkin’s victory, the taste is more bitter than sweet. The play’s effect on the heart is a pretty desolate one.\"\n\nRead more",
  "fullText": null,
  "isFullReview": false,
  "textWordCount": 118,
  "archivePath": "data/archives/reviews/junk-2017/vulture--sara-holdren_2026-02-07.html",
  "textFetchedAt": "2026-02-07T14:31:09.380Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text",
    "has_footer_text",
    "shorter_than_excerpt"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 118 (min: 300)",
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "This email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy to receive email correspondence from us. There was an error. Please try again later. There was an error please try again later. Does not meet password requirements Password must be at least 12 characters. This email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy to receive email correspondence from us. You can log in with the Vox Media account you created on We’ve sent an email with instructions for setting a new password. Sign in with your new password below.",
  "contentTier": "excerpt"
}