{
  "showId": "million-dollar-quartet-2010",
  "outletId": "nytheatre",
  "outlet": "nytheatre.com",
  "criticName": "Martin Denton",
  "url": null,
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Unfortunately, almost the last thing that Million Dollar Quartet feels like is an impromptu jam session. What it is, instead, is a musical drama—albeit one lacking in suspense, since we know before it starts how it will come out—about Sam Phillips, presented here as the founding pioneer of rock & roll, and how the 'boys' whom he nurtured to fame one by one abandon him. Interspersed throughout this drama are the songs of the jam session, often played in snippets so that the story can play out literally between verses. (For example, 'Great Balls of Fire,' the climax of the session in this musical, is interrupted twice by Phillips's soliloquizing.) Because the narrative is constructed so snugly around and within the songs, and because the performances are glitzily polished (as one would indeed expect at a Broadway musical charging $125+ for tickets), spontaneity is pretty much vanquished from the proceedings. And of course spontaneity would seem to be the precise feeling that the creators of this show ought to be going for if they want to re-create the unplanned brilliance of that famous evening.",
  "bwwScore": 3,
  "contentTier": "complete",
  "fullText": "nyc theatre info, listings, and reviews\n\nTue at 7:00pmWed at 2:00pmThu at 8:00pmFri at 8:00pmSat at 2:00pmSat at 8:00pmSun at 3:00pmSun at 7:00pm\n\n1 hour, 35 minutesNo IntermissionTICKETS$45.00 - $125.00212-307-4100Order tickets online\n\n&middot; Blog Post&middot; Show Website\n\nCastEddie Clendening, Lance Guest, Levi Kreis, Rob Lyons, Elizabeth Stanley, Hunter Foster\n\nBook ByColin Escott and Floyd Mutrux\n\nOn December 4, 1956, an auspicious twist of fate brought Johnny Cash, Jerry Lee Lewis, Carl Perkins, and Elvis Presley together. The place was Sun Records' storefront studio in Memphis. The man who made it happen was Sam Phillips, the \"Father of Rock 'n' Roll,\" who discovered them all. The four legends-to-be united for the only time in their careers for an impromptu recording that has come to be known as one of the greatest rock jam sessions of all time. Million Dollar Quartet features a treasure trove of the greatest rock 'n' roll, gospel, R&B; and country hits from these music legends, including such iconic songs as \"Blue Suede Shoes,\" \"Fever,\" \"Sixteen Tons,\" \"Who Do You Love?,\" \"Great Balls of Fire,\" \"Riders in the Sky,\" \"I Walk the Line,\" \"Folsom Prison Blues,\" and \"Whole Lotta Shakin' Goin' On.\" Million Dollar Quartet captures the infectious spirit, freewheeling excitement, and thrilling sounds of a singular moment when four of the music industry's most extraordinary talents, all in their creative prime, came together for one of the most memorable nights in music history.\n\nPictured: Hunter Foster, Levi Kreis, Robert Britton Lyons, Eddie Clendening, and Lance Guest in a scene from Million Dollar Quartet (photo © Joan Marcus)\n\nMartin Denton &middot; April 16, 2010\n\nMillion Dollar Quartet supposedly re-creates the \"historic night\" (December 4, 1956) when Elvis Presley, Carl Perkins, Johnny Cash, and Jerry Lee Lewis had a jam session at the recording studio of Sun Records, under the watchful eye of producer/Sun founder Sam Phillips. (According to an article on Sun Records' website, Phillips shrewdly captured the results on tape for posterity: here's one version described on Amazon.)\n\nUnfortunately, almost the last thing that Million Dollar Quartet feels like is an impromptu jam session. What it is, instead, is a musical drama—albeit one lacking in suspense, since we know before it starts how it will come out—about Sam Phillips, presented here as the founding pioneer of rock & roll, and how the \"boys\" whom he nurtured to fame one by one abandon him. Interspersed throughout this drama are the songs of the jam session, often played in snippets so that the story can play out literally between verses. (For example, \"Great Balls of Fire,\" the climax of the session in this musical, is interrupted twice by Phillips's soliloquizing.) Because the narrative is constructed so snugly around and within the songs, and because the performances are glitzily polished (as one would indeed expect at a Broadway musical charging $125+ for tickets), spontaneity is pretty much vanquished from the proceedings. And of course spontaneity would seem to be the precise feeling that the creators of this show ought to be going for if they want to re-create the unplanned brilliance of that famous evening.\n\nFans in the audience responded vigorously to the songs. Titles include \"Blue Suede Shoes,\" \"Matchbox,\" \"I Walk the Line,\" \"Sixteen Tons,\" and \"Long Tall Sally.\" Elvis's girlfriend (here called Dyanne) illogically sings two songs, \"Fever\" and \"I Hear You Knocking.\" After the musical is over, an epilogue showcases each member of the quartet singing a particularly famous song associated with them, as if in performance on a stage in the great beyond (though Lewis is still with us, of course). For me, the high point was the low-key harmonizing on the spiritual \"Down by the Riverside.\"\n\nThe four young men who portray these musical icons all appear to be talented musicians themselves; in particular, Levi Kreis (who plays Lewis, and is also credited with additional arrangements) plays the piano energetically and excitingly, and Robert Britton Lyons (Perkins) definitely wields a mean guitar. Bass player Corey Kaiser and drummer Larry Lelli are also onstage throughout (Kaiser plays Perkins's brother Jay) and they are both terrific, invaluable to the proceedings. Eddie Clendening gets Elvis's look and moves pretty accurately, and Lance Guest comes closest to vocal impersonation among the quartet with a fairly dead-on Cash. I would be interested in seeing all of these young men perform original music or have a chance to exercise their acting chops in proper dramatic roles. But I just don't get the appeal of watching them pretend to be iconic figures whose work I can hear and see at the press of a button. (Yet, when Guest walked up to the microphone in the final music number and intoned \"I'm Johnny Cash,\" parts of the crowd went wild, even though it is clear that Guest is in fact NOT Johnny Cash. I guess illusion works for some people.)\n\nElizabeth Stanley, who plays Dyanne and is the only woman on stage, seems out of place, though not for that reason; her contemporary singing style is just utterly at odds with the '50s rockabilly sound everywhere else in Million Dollar Quartet.\n\nHunter Foster, on the other hand, gives probably the finest performance I've yet seen of his as Phillips; he keeps us interested in this character and made me want to find out more about him. Though Phillips is the protagonist of this musical, he never has a chance to sing. Colin Escott and Floyd Mutrux might have worked harder to create an integrated book musical that would allow the songs to reflect the emotions and inner lives of the characters in their story. But they seem content to just slap some dialogue around and between choruses of 50-year-old songs, and for better or worse many in the audience seemed content to consume the formula.\n\nPrinter-friendly version of this page\n\nThis page updated Friday, November 19, 2010 12:39 PM",
  "isFullReview": true,
  "textWordCount": 976,
  "archivePath": "data/archives/reviews/million-dollar-quartet-2010/nytheatre--martin-denton_2026-02-06.html",
  "textFetchedAt": "2026-02-06T07:58:32.696Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Insufficient text: 0 chars"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 0 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20101119173903",
  "archiveOrgUrl": "http://web.archive.org/web/20101119173903/http://www.nytheatre.com:80/nytheatre/showpage.php?t=mill9337",
  "wordCount": 976,
  "tierReason": "Full review text"
}