{
  "showId": "million-dollar-quartet-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Steven Suskin",
  "url": "https://variety.com/2010/legit/reviews/million-dollar-quartet-1117942558/",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews"
  ],
  "bwwExcerpt": "Broadway's parade of musicals for people who grew up on rock rather than show tunes continues with 'Million Dollar Quartet,' which eschews the music of Richard Rodgers and Stephen Sondheim for the sounds of Elvis Presley and Johnny Cash. By placing the latter gentlemen among the dramatis personae and lacing the proceedings with a fair deal of historical dramatis, authors Colin Escott and Floyd Mutrux and director Eric Schaeffer have come up with a crowdpleaser that mixes jukebox and story into a satisfying whole, while the knockout performances keep the joint jumpin' with great balls of fire.",
  "bwwScore": 8,
  "contentTier": "complete",
  "previousUrl": "http://www.variety.com/review/VE1117942558.html?categoryid=33&cs=1",
  "urlDiscoveredAt": "2026-02-05T04:40:41.324Z",
  "urlDiscoveryMethod": "google-serp",
  "fullText": "A crowdpleaser that mixes jukebox and story into a satisfying whole.\n\nBroadway’s parade of musicals for people who grew up on rock rather than show tunes continues with “Million Dollar Quartet,” which eschews the music of Richard Rodgers and Stephen Sondheim for the sounds of Elvis Presley and Johnny Cash. By placing the latter gentlemen among the dramatis personae and lacing the proceedings with a fair deal of historical dramatis, authors Colin Escott and Floyd Mutrux and director Eric Schaeffer have come up with a crowdpleaser that mixes jukebox and story into a satisfying whole, while the knockout performances keep the joint jumpin’ with great balls of fire.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Meta Rakes in Record Revenue and Profits for Q4, Details Massive AI Investments for 2026 \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Comcast Q4 Sees Fall in Cable Revenue, Wider Peacock Losses, Despite Boost in Ads, Wireless, Theme Parks\n\nOnce upon a time there was a Memphis pied piper named Sam Phillips, who lured farmhands and truckdrivers into his hole-in-the-wall Sun Records studio and discovered Presley, Cash, Roy Orbison and others. On Dec. 4, 1956, four of his boys — Elvis, Johnny, Carl Perkins and newcomer Jerry Lee Lewis — congregated for an impromptu jam session, with recording equipment running. This was somewhat hopefully dubbed the Million Dollar Quartet, although only Presley was thus far fully on the national radar (thanks in part to his appearance on “The Ed Sullivan Show” three months earlier).\n\nOver the years the session grew legendary, with parts of that historic studio tape eventually released, in 1981. “Million Dollar Quartet” presents a fictionalized version. Perkins (Robert Britton Lyons), who composed and recorded “Blue Suede Shoes,” is in the studio trying to come up with a new hit for producer Phillips (Hunter Foster); Lewis (Levi Kreis), a young piano player, is there to earn a few bucks. Presley (Eddie Clendening), who by this point has moved on to RCA, stops by for a visit with his date Dyanne (Elizabeth Stanley) in tow.\n\nPhillips, having already lost Presley, uses the presence of Elvis to try to entice Cash (Lance Guest) to sign a contract extension.\n\nThe jukebox songs fit naturally enough, although it appears that only two songs from the actual session are used; they have been replaced by more familiar titles\n\npopularized by the characters. No matter, as the format gives the authors the chance to fit in 22 numbers. Clendening, Guest and Lyons do well enough, but it is Kreis who dominates the evening as Jerry Lee Lewis, not only as an actor but as a pianist intruding on everyone else’s guitar solos. Kreis electrifies the stage, even when the others are doing the performing. At the press preview attended, you could make out band-aids on all 10 fingers, some tinged with tell-tale red midway through the keyboard pounding.\n\nServing as the anchor of the story is Foster, a fine musical actor in a non-singing role. Foster goes a long way toward making the evening satisfying as theater. Stanley (of “Cry Baby”) helps, too, while the two on-stage sidemen, bassist Corey Kaiser and drummer Larry Lelli, not only play up a storm but look like they belong with that celebrated quartet.\n\n“Million Dollar Quartet” hails from Chicago, where it is a long-running favorite in its second year at the Apollo. Schaeffer, who shared director billing with librettist Mutrix in Chi, is now given sole credit; he does a canny job, keeping the action at crackerjack pace. Schaeffer imported the quartet from Chicago but assembled a new set of designers for Broadway. Derek McLane provides a convincing studio set, Jane Greenwood provides perfectly conceived costumes that breath authenticity and character, and Howell Binkley dazzles with his lighting in the final concert section. Sound was noticeably muddy, though, with many lyrics all but inaudible.\n\nA jukebox musical with a non-original score, yes, but one with high entertainment value. With the name recognition of the characters, the built-in popularity of the songs and a presumably low weekly nut, look for “Million Dollar Quartet” to maybe mint millions just off Times Square.",
  "isFullReview": true,
  "textWordCount": 676,
  "archivePath": "data/archives/reviews/million-dollar-quartet-2010/variety--steven-suskin_2026-02-05.html",
  "textFetchedAt": "2026-02-05T04:40:41.330Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "wordCount": 676,
  "tierReason": "Full review text"
}