{
  "showId": "ragtime",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Roma Torre",
  "url": "https://nystagereview.com/2025/10/16/ragtime-a-triumphant-revival-for-our-time/",
  "publishDate": "2025-10-16T23:00:06",
  "fullText": "As great and admired as Ragtime has been since it debuted 27 years ago, it’s become something more. It is a mirror reflecting the world today through the lens of the world that was more than a century ago. Based on E. L. Doctorow’s classic 1975 historical novel, and adapted for the stage by bookwriter Terrence McNally along with composer Stephen Flaherty and lyricist Lynn Ahrens, Ragtime is truly timeless. Revived once again by Lear DeBessonet following last year’s outstanding City Center concert version, this nearly flawless Lincoln Center Theater production ranks among Broadway’s best of all time.\n\nWith the opening number “Ragtime,” featuring the entire company as if in a moving American tapestry, we are introduced to each of the main characters. There are so many of them that in lesser hands they’d be reduced to stereotype or simply lost in the shuffle. But here, so masterfully staged by director DeBessonet and choreographer Ellenore Scott, the combined effect of music, story and performance on that mostly bare stage is breathtaking. And it left audiences cheering and weeping right from the start.\n\nDoctorow’s story begins in 1902 when ragtime music symbolized a turning point in the country. Weaving the fates of Americans – black and white – with the newly arrived huddled masses, McNally’s book focuses the complex tale on three sets of families. We first meet the affluent Father (Colin Donnell), Mother (Caissie Levy) and Mother’s Younger Brother (Ben Levi Ross) in suburban New Rochelle. Then there are the folks from Harlem, the ragtime musician Coalhouse Walker, Jr. and the woman he loves, Sarah (Nichelle Lewis). The immigrants are represented by the Jewish Tateh (Brandon Uranowitz), newly arrived from Europe with his young daughter, The Little Girl (Tabitha Lawing).\n\nOther key roles include real life figures – union organizer Emma Goldman (Shaina Taub), the great African American leader Booker T. Washington (John Clay III), headlining show girl Evelyn Nesbit (Anna Grace Barlow), the famed magician Harry Houdini (Rodd Cyrus), and the tycoons J.P. Morgan (John Rapson) and Henry Ford (Jason Forbach) – among others.\n\nThey each have key roles to play in this captivating saga; and in so many ways, their lives parallel the experiences of Americans and immigrants in the present day, still subjected to soul crushing racism and abuse as justice is routinely granted or denied depending on skin color. It’s so hard to hear the “N” word lobbed at Coalhouse but the hateful sentiment, if not the word, continues to echo across the land. And even as the American Dream proves elusive for so many, a lucky few manage to find success amid overwhelming odds. That’s the takeaway from the story which is both hopeful and emotionally devastating in equal measure. If the second act doesn’t quite match the virtuosity of the first half, we’re already so invested in these characters, it’s negligible.\n\nThis is also a show in which the entire score deserves the highest praise. In fact, there isn’t just one 11:00 number as is the standard, referring to a major revelation or turning point in so many great musicals, there are several bonafide showstoppers sending audiences to their feet. Yes, the show is long at close to three hours but it leaves you wanting more.\n\nIn addition to the sublime opening number, Nichelle Lewis, plaintively delivering the heart rending “Your Daddy’s Son,” is astonishing. Already a major talent following her Broadway debut as Dorothy in last season’s The Wiz, she is a star on the rise. And then there’s the revelatory “New Music,” a marvel of a showtune expressing the characters’ deepest desires and regrets as they sense the sound of a world changing around them. As Coalhouse plays the tender ragtime tune, it begins with the stern Father, suddenly unsure of his place in the new order and it ends so touchingly as Coalhouse and Sarah find their place in each other’s arms.\n\nThat’s followed by “Wheels of a Dream,” Coalhouse and Sarah’s sumptuous duet as the lovestruck couple plans for their future. Later Henry barely holds it together singing “Coalhouse’s Soliloquy” as his world is torn apart. With his colossal pipes and commanding presence, Joshua Henry seems born to the role as he pours his heart and soul into the doomed character. It is a magnificent performance and one that must not be missed.\n\nCaissie Levy gets a deserved standing ovation in her second act song of reckoning “Back To Before.” She performs with a warmth and strength that puts an indelible stamp on the role. The show’s resounding finale “Make Them Hear You” injects a note of optimism amid the tragedies that continually unfold. Brandon Uranowitz, once again, is a revelation. He’s amassed a body of work that consistently dominates the spotlight. And he’s in top form here as the striving Jewish immigrant desperate to make a decent life for his daughter. It’s another extraordinary performance and a high mark in this fine actor’s career.\n\nThere is collaborative brilliance in the technical designs as well. Inspired simplicity marks scenic designer David Korins’ contribution making excellent use of a turntable and fragments of set pieces seamlessly transforming the stage from one location to another. I especially loved the way he signified a brewing storm with a giant white sheet suggesting billowing clouds.\n\nThe imagery gets a big boost from lighting designers Adam Honoré and Donald Holder’s exquisite palette attaching distinctive shades of light to each of the main groups, and framing them in monochromatic bands painted overhead. And costumer Linda Cho did a terrific job expertly evoking the period, the class and the temperament of the characters. But even without the technical enhancements, the production would still soar given the bravura talents – all 41 actors and 28 musicians – gracing the Vivian Beaumont stage.\n\nIn its day, ragtime bridged cultural gaps signalling a new way for people to listen to music and each other, but sadly its unifying rhythms didn’t last. Music has a unique way of bringing people of all stripes together. And that’s why shows like this have the power to enlighten, inspire and remind us what we look like at our best and worst. Ragtime the musical not only sings beautifully, it speaks with a relevance and resonance that connects us all.  And that’s what makes a masterpiece.\n\nRagtime opened October 16, 2025, at the Vivian Beaumont Theater and runs through June 14, 2026. Tickets and information: lct.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars"
}
