{
  "showId": "les-liaisons-dangereuses-2016",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "Stephen Dalton",
  "url": "http://www.hollywoodreporter.com/review/les-liaisons-dangereuses-theater-review-850100",
  "publishDate": null,
  "fullText": "An 18th century French classic that still has plenty to say to modern audiences about sex and power, Les Liaisons Dangereuses is proof that there will always be a healthy audience for salacious menage-a-cinq plotlines. Director Josie Rourke’s respectful revival of Christopher Hampton‘s celebrated stage adaptation is a handsome and mirthful affair, albeit low on sex or surprises. Already sold out for its initial two-month run, possibly due to the marquee appeal of its male star Dominic West, this tragicomic tale of bed-hopping sociopaths clearly has the potential for an extended West End transfer, and possibly further afield too. It will also screen in cinemas in January as part of the NT Live program.\n\nPublished in 1782, Les Liaisons Dangereuses began its long literary afterlife as a scandalous epistolary novel by Pierre Choderlos de Laclos, a career soldier who narrowly escaped the guillotine during the French Revolution, later becoming a minor general under Napoleon. Hampton’s crisp, sardonic, innuendo-heavy stage adaptation was first mounted 30 years ago by the RSC and director Howard Davies, with Alan Rickman and Lindsay Duncan as co-stars, winning awards both in London and New York. A 2008 Broadway revival with Laura Linney and Ben Daniels drew a more muted reception.\n\nThe plot revolves around the Marquise de Merteuil (Janet McTeer) and the Vicomte de Valmont (West), gleefully amoral ex-lovers who treat sex as a sadistic spectator sport, relishing the social and emotional ruin they inflict on the romantic dupes that they seduce and abandon. But their duplicity backfires when the vengeful Marquise manipulates Valmont into sleeping with both teenage convent girl Cecile de Volanges (Morfydd Clark) and the religiously devout Madame de Tourvel (Elaine Cassidy), awakening long-dormant feelings of real love and bitter jealousy in these jaded old predators. The hunter gets captured by the game, with lethal consequences.\n\nRead more ‘Funny Girl’: Theater Review\n\nStrikingly modern in its cold-eyed depiction of sexuality and gender politics, Les Liaisons Dangereuses has inspired numerous stage and screen adaptations, often updated to more contemporary settings: Cruel Intentions (1999) was set in modern-day Manhattan, while a recent Chinese remake took place in 1930s Shanghai. But Hampton’s more faithful reading has proved the most enduring, notably spawning the 1988 Stephen Frears film Dangerous Liaisons, which co-starred John Malkovich and Glenn Close.\n\nStrutting around the stage in an unflattering wig, knee-length britches and Falstaffian waistcoat, West’s Valmont is a more comic figure than Malkovich’s calculating, vulpine sensualist. His performance gets most of the big laughs at the Donmar, but undersells Valmont’s key character trait as a “conspicuously charming” serial seducer. Instead, he mostly comes over as whiny and entitled, while his sudden rush of sincere romantic feelings for Madame de Tourvel lacks conviction. West also stumbled over his lines several times on press night, causing minor but perceptible disturbances in the Force.\n\nLike her character in the play, McTeer outshines and outmaneuvers West without appearing to really try. Her suave, husky-voiced cougar-queen is all nonchalant surface poise masking deep emotional wounds, every line precisely balanced between double meanings, every bittersweet compliment sugar-coated with irony. But she is no one-dimensional femme fatale figure. She rationalizes her devious nature as essential armor against a chronically misogynistic culture in which sexual gossip can destroy a women’s reputation while enhancing a man’s. Choderlos de Laclos was an early advocate of gender equality, but Hampton also highlights the Marquise’s proto-feminist agenda: “I was born to dominate your sex and avenge my own,” she tells Valmont.\n\nRead more ‘Evening at the Talk House’: Theater Review\n\nIn visual terms, Rourke and her team mostly opt for low-key naturalism. Tom Scutt’s single all-purpose set is a grand room in a slightly dilapidated French manor house, partly illuminated by the flickering flames of real candles suspended overhead on five giant chandeliers: an elegant period touch. The costumes pay similar heed to historical authenticity, with the female characters modeling some impressively architectural gowns. Scene changes are choreographed to short bursts of pastiche classical music, with castmembers adding their vocals. A few more of these stylized, imaginative twists would have been welcome in this handsome but conventional production.\n\nThe supporting cast are mostly satellites to McTeer and West, sometimes thanklessly so. Cassidy, who replaced Downtown Abbey star Michelle Dockery at short notice after the untimely death of Dockery’s fiance, injects brittle intensity into her few scenes as Madame de Tourvel. But Clark has little to work with in her colorless airhead role as Cecile. The relatively inexperienced Jennifer Saayeng stands out in her minor turn as the courtesan Emilie, while Brits of a certain age will share a warm nostalgic thrill at seeing sprightly 78-year-old stage and screen legend Una Stubbs playing Valmont’s aunt, Madame de Rosemonde.\n\nFor a play so steeped in sex, Rourke’s revival is oddly chaste. There is just a brief flash of female nudity and a single bedroom coupling that looks uncomfortably close to rape — which may be the intention, of course, but such a contentious dramatic choice would merit more serious consideration than one fleeting scene. In any case, overall, these liaisons feel a little low on danger for a story so deeply rooted in dark, destructive passions. Thankfully, Hampton’s rapier-witted dialogue saves the day, adding verbal Viagra to the action onstage, even when the cast cannot quite rise to the occasion.\n\nVenue: Donmar Warehouse, London\n Starring: Dominic West, Janet McTeer, Elaine Cassidy, Morfydd Clark, Adjoa Andoh, Edward Holcroft, Jennifer Saayeng, Una Stubbs\n Playwright: Christopher Hampton\n Director: Josie Rourke\n Set & costume designer: Tom Scutt\n Lighting designer: Mark Henderson\n Sound designer: Carolyn Downing\n Music: Michael Bruce\n Fight director: Richard Ryan\n Movement director: Arthur Pita\n Presented by Donmar Warehouse",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Rourke's respectful revival is a handsome and mirthful affair, albeit low on sex or surprises...For a play so steeped in sex, Rourke's revival is oddly chaste...Overall, these liaisons feel a little low on danger for a story so deeply rooted in dark, destructive passions. Thankfully, Hampton's rapier-witted dialogue saves the day, adding verbal Viagra to the action onstage, even when the cast cannot quite rise to the occasion.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 941,
  "archivePath": "data/archives/reviews/les-liaisons-dangereuses-2016/hollywood-reporter--stephen-dalton_2026-02-06.html",
  "textFetchedAt": "2026-02-06T16:35:46.820Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "wordCount": 941,
  "tierReason": "Full review text"
}