{
  "showId": "the-minutes-2022",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Naveen Kumar",
  "url": "https://variety.com/2022/legit/reviews/the-minutes-review-broadway-play-tracy-letts-1235234223/",
  "playbillVerdictUrl": "https://variety.com/2022/legit/reviews/the-minutes-review-broadway-play-tracy-letts-1235234223/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Some stories creep up in disguise, hiding a ghastly scowl. \"The Minutes\" is an astonishing feat from playwright and star Tracy Letts, not least for its brilliant finesse in orchestrating audience expectations and surprise. To go in knowing little or nothing about the play may be the purest way to experience its dramatic cunning. (Reader, be warned.)\n\nEven so, \"The Minutes\" doesn't trade in shocking secrets or revelations. It exposes the systems of delusion that blind people to truths buried in plain sight. It's devilishly funny until it's not. It is thrilling and essential theater that interrogates the present by laying bare how history is written. And it's among the best new plays on Broadway in years.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘28 Years Later: The Bone Temple’ Launches Atop U.K., Ireland Box Office \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Sydney Sweeney to Star in Edith Wharton Adaptation 'Custom of the Country' as 'Original Dangerous Woman'\n\n\"A hundred years from now, will anyone care?\" It seems like a fair question for the city council in Big Cherry, the \"wet sock of a town\" where a dozen elected members bat around hyperlocal minutia like stolen bicycles and a redesign of the town park. There's a Christopher Guest quality to the everyday absurdities that pile up as the officials (if we must call them that) migrate into the room, bantering over the snack cart. The meeting gets off to a sputtering start, and the mundanity both amuses and numbs.\n\nMr. Peel (Noah Reid of \"Schitt's Creek\") is the freshman of the group and something of a babe in the woods. Though he missed the previous week's meeting to bury his mother, he's sunny and eager and naive. (Fairy tales and rituals alike love an innocent orphan.) At the opposite end, the eldest statesman (Austin Pendleton) has been serving for 39 years, and could he please have a parking spot to show for it? Seven men (all but one of them white) and three women (also white) assemble for the quorum.\n\nThe story's deeper and sinister undercurrents creep along from the start, camouflaged in the tedium of process. If each meeting includes a recap of the last, where are the minutes from the one Mr. Peel missed? It seems unlikely that the clerk who records them (Jessie Mueller), who is curt and fastidious, could be slacking. The mayor (Letts) would just as soon move on, and so would everyone else. But why is there an empty seat?\n\nThere's a deliberateness to the foreboding in this Steppenwolf production from director Anna D. Shapiro, wryly signaling that \"The Minutes\" has a broader agenda. The municipal meeting hall seems grander than it ought to be, with a soaring arched ceiling that betrays signs of water damage (in a set design by David Zinn). Booming thunder and zappy brown-outs punctuate the stormy night (conveyed in the lighting design by Brian MacDevitt and in the sound and original music by André Pluess). Count out the days, and you'll realize the time is ripe for terror.\n\nThe ensemble of Steppenwolf and Broadway veterans, including Blair Brown, Sally Murphy and Ian Barford, play expertly off each other even as they mostly remain in their chairs. The stasis in Shapiro's staging has a clear logic (how often does the seat of power shift?), and serves as stark contrast to isolated bursts of physical action. The actors are nimble with Letts' mordant, deceptively situational humor, and in embodying their characters' chilling complacency.\n\n\"The Minutes\" is both a political comedy and a wicked, methodically plotted horror show, not unlike American democracy and its original sins. The play's razor-sharp edge is all the more cutting for being polished with easy wit, like tickling a captive before releasing the guillotine.\n\nIt probes the big, intractable questions posed by social order, like what people owe each other, how accountability gets shirked, whose stories are told and whose are erased. And it shows us the people who have long answered those questions behind closed doors, in a self-preserving system with blood on its hands. Look down, and you'll see it on your own, too.",
  "isFullReview": true,
  "textWordCount": 678,
  "archivePath": "data/archives/reviews/the-minutes-2022/variety--naveen-kumar_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:55:49.071Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "brightdata",
  "contentTier": "complete",
  "wordCount": 678,
  "tierReason": "Full review text"
}