{
  "showId": "the-bands-visit-2017",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/08/05/the-bands-visit-music-of-the-jasmine-scented-night/",
  "publishDate": "2018-08-05T17:51:18",
  "fullText": "Broadway’s best musical of 2017 retains its mantle midway through 2018. The Band’s Visit, which picked up 10 Tony Awards in last season’s shindig, remains a superlative and altogether splendid entertainment. This honey-and-spice-on-the-breeze musical is one of a kind: An intimately small show which seems to be about nothing much until the music and the emotion suddenly swells hearts onstage and—most magically—in the audience as well.\n\nHigh among the myriad treasures of The Band’s Visit is the score, deceptively gentle but filled with yearning, by David Yazbek; and the unexpectedly vibrant performance of Katrina Lenk. Both elements—20 months after the pre-Broadway premiere at the Atlantic—continue to enchant and grow richer, even after repeated viewings.\n\nYazbek is the composer/lyricist of The Full Monty, Dirty Rotten Scoundrels, and Women on the Verge; three musicals with notable scores weighed down by weaknesses in book and production. With The Band’s Visit, Yazbek has found collaborators—librettist Itamar Moses and director David Cromer—who are creatively on the same page and the same level. Thus, a highly unusual musical that works exquisitely well despite, or because of, its eccentricities.\n\nAs for Lenk, it was clear back at the non-Tony eligible Atlantic that this was a Tony-caliber performance. It happens almost instantly: Dina, a café proprietor in the middle of the desert, is immersed in a drab and unfulfilling life. But from the moment she sings of her long-absent husband—and simultaneously decapitates a watermelon—it is clear that this is not some desert rose but a desert tigress. The inflamed passion of Lenk’s performance remains vibrant; this is easily one of the finest performances on Broadway just now. When she launches into Yazbek’s evocative paean to the romantic films of Oum Kalthoum and Omar Sharif, the whole houseful at the Barrymore might well find themselves floating on a jasmine wind with honey in their ears. (Fact check: a quick Internet search reveals that Kalthoum—sometimes referred to as the most famous Egyptian woman since Cleopatra—did not appear with Sharif in the 1961 River of Love, and seems to have made her final film in 1947, when Sharif was 17.)\n\nThe occasion for this revisit is the replacement of the leading man; thus, you can expect a slew of new reviews tonight and tomorrow and I’ll be hornswaggled if they’re not as wildly enthusiastic as the reviews from the Broadway opening last November and the earlier set from the Atlantic. Stepping into the “Sergeant Pepper suit” of Tony Shalhoub is Sasson Gabay. Shalhoub has long been a unique actor; he won his own Tony for The Band’s Visit and might well take an Emmy in September for The Marvelous Mrs. Maisel, which he had been filming simultaneously with his appearance in the musical.\n\nSasson is something else again, a major Israeli star who—not coincidentally—created the role of the Egyptian bandleader Tewfiq in the musical’s source material, Elan Klirin’s 2007 film of the same title. It is safe to say that Sasson gives an equally expert performance. What is perhaps unexpected is that his presence adds a new flavor to the piece. In this musical about “hearts searching in the darkness,” among other things, the Tewfiq of Shalhoub seemed like an unlikely-but-possible match for Dina. Hence, a frisson of sex.\n\nThe new Tewfiq is not so much older than Shalhoub, by the calendar; but onstage, he reads as old enough to be Dina’s father’s older brother. Thus, as Tefiq sings of fishing and Dina dreams of reeling him in, it is crystal clear that the match is impossible; she is looking for love in the wrong place. Which is why, to use Yazbek’s words, she is trapped by “these walls I build.” It is also immediately clear—even earlier on—that the lover she yearns for (“Is this my shiek? Is this my love song?”) is standing onstage a few feet behind Tewfiq. While Dina has wound up with trumpeter Haled (featured Tony winner Ari’el Stachel) for hundreds of performances now, we see that he is not merely a substitute for Tewfiq—as it seemed before—but the right man.\n\nThe rest of the cast, led by the excellent Stachel, remains the same and remains equally compelling. Some of the performances, indeed, have grown with time. Much of the comedic coloring comes from the tongue-tied waiter Papi (Etai Benson) and the unemployed and unmotivated Itzik (John Cariani). Benson and Cariani, both, are giving warm and heartwarming performances which are now even more touching.\n\nGeorge Abud, as the band’s violinist, has seemed to make a larger contribution with each visit. This is practically a non-speaking role, but Abud—clutching his violin case for life, with an unlit cigarette precariously dangling always from his lower lip—uses face and fiddle for expression, at times seeming almost Chaplinesque. Andrew Polk (who explains how “love starts on the downbeat”) and Kristen Sieh (as the unfulfilled wife of Itzik) both enchant, and on repeated viewings it becomes clear how much Rachel Prather adds to the mix as Papi’s wallflower on roller skates.\n\nIt goes without saying that none of this—including Yazbek’s magical music—would stand so well without bookwriter Moses and director Cromer. They’ve each now got a Tony on their shelf, which is praise enough. But the short report on the evening is: The Band’s Visit remains the best new musical on Broadway since Dear Evan Hansen.\n\n“Nothing’s as surprising as the taste of something strange,” Dina sings, “nothing is as beautiful as something that you don’t expect.” The Band’s Visit is surprising, strange, and unexpectedly most beautiful.\n\nThe Band’s Visit opened November 9, 2017, at the Ethel Barrymore Theatre. Tickets and information: thebandsvisitmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
