{
  "showId": "the-bands-visit-2017",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2018/08/05/the-bands-visit-sasson-gabay-joins-the-still-excellent-tony-winner/",
  "publishDate": "2018-08-05T17:50:58",
  "fullText": "Because more and more Broadway, off-Broadway, and off-off-Broadway productions seemingly materialize every year, reviewers don’t often get opportunities to return to any show after it’s opened. This can be a shame when so many offerings continue to gain depth even if they’ve premiered to five-star-level response.\n\nWhat does get us back into theaters, often after a production has run for some time, is the obligation to review an important replacement. That’s the case with The Band’s Visit. At the Tony-winning, Drama Desk-winning, New York Drama Critics Circle-winning musical, Sasson Gabay has replaced 2018 Tony winner Tony Shalhoub as the conductor of a Egyptian police orchestra mistakenly arriving in the sleepy Israeli town of Bet Hatikva when the troupe is due to present a concert at the opening of an Arab center in larger Petah Tikva.\n\nSasson—who starred in the film of the same name from which bookwriter Itamar Moses and songwriter David Yazbek have adapted the tuner—is, not surprisingly, effective in the Tewfik role. Less a romantic figure (one way the part can be interpreted), he sympathetically plays an older man whose stained family life daily nags at him, even as he steadfastly commands his seven musicians. For all intents, Gabay (billed as Gabai in the film credits) is repeating his award-winning performance.\n\nThough his characterization differs from Shalhoub’s (why wouldn’t it?), it doesn’t alter to the least degree the perfect chamber musical that the Band’s Visit was when it bowed at the Atlantic Theater and then moved uptown to the Barrymore Theatre. It’s perfect in every department, as it almost completely reiterates the movie’s dialog verbatim. Yazbek has added his songs of course. In doing so, he’s produced a score at least a third of a continent distant from anything he’s done in, say, The Full Monty or Dirty Rotten Scoundrels.\n\nHe’s listened to Egyptian and Israeli music and deftly filtered what he’s absorbed through his Broadway sensibility and now has his melodies played by on-stage musicians and musicians housed behind a second-story scrim on Scott Pask’s evocative, shifting set. The instruments include an oud guitar and a darbouka (a bongo by another name) for authenticity.\n\nIf there’s a song currently o Broadway more beautiful than “Jasmine Wind,” I don’t know about it, and the ballad is still being delivered by 2018 Tony-winning Katrina Lenk, sinuous and subtle as frustrated restaurateur Dina. The lyric begins “Umm Kulthum and Omar Sharif/ Come floating on the jasmine wind.” (For those who don’t know, Umm Kulthum is a famous Egyptian singer. I didn’t know who she is, but I do now. So does YouTube.)\n\nYazbek has also written a clarinet solo introduced as the beginning of a concerto, supposedly by band member Simon (Alok Tewari, acting and playing with notable emotion). The theme is repeated several times, and Yazbek has embedded into it a musical phrase from “Jasmine Wind.” The crafty turn is just one example of the imagination flowing through the musical’s own enveloping jasmine wind.\n\nAs the band spends an afternoon, evening, and night in the wrong place, they intermingle individually and together with the locals, affecting them and being affected by them. As the symbiosis accumulates, The Band’s Visit becomes increasingly moving.\n\nThough I can point at absolutely nothing that disturbs me about director David Cromer’s presentation, it does occur to me that in establishing the Bet Hatikva mental and physical torpor, the action moves at a deliberate pace that could have some spectators initially drumming their fingers. Understandable, but hardly a drawback in my view.\n\nCuriously, last season’s award-copping Come From Away is a cousin to The Band’s Visit. It also features a foreign contingent unexpectedly landing (this time literally) in the midst of an isolated community during a 9/11-related incident. It’s intriguing that the theme of blending differing, even unfriendly groups shows up in two acclaimed musicals at a time when—thanks to a governing federal administration—divisiveness is clogging the zeitgeist.\n\nThere’s another eye-catching coincidence marking Broadway at the moment: Three enterprises have the word “band” in their title—The Band’s Visit, Boys in the Band, and Gettin’ the Band Back Together. Somehow this begs the declaration: The boys in the band are getting’ the band back together for the band’s visit.\n\nMoreover, The Band’s Visit, also like Come From Away, has no marquee names associated with it. OK, the titles are now marquee names, but in these dynamic-pricing days both entries give the lie to the belief that big names are necessary to obtain Great White Way success. Anyone who doubts it is advised to join these sell-out audiences—if tickets are available.\n\nThe Band’s Visit opened November 9, 2017, at the Ethel Barrymore Theatre. Tickets and information: thebandsvisitmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars",
  "textQuality": "partial"
}
