{
  "showId": "the-great-society-2019",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2019/10/01/the-great-society-a-not-so-great-play-about-lbj/",
  "publishDate": "2019-10-01T21:51:09",
  "fullText": "A sequel to his Tony Award-winning best play All the Way, Robert Schenkkan’s The Great Society dramatizes Lyndon B. Johnson’s turbulent presidency during the years 1965-1968.\n\nLike its Broadway predecessor of 2014, which detailed Johnson’s first year in office and subsequent election as President in his own right, The Great Society is again directed by Bill Rauch, employs a relatively large ensemble of 19 actors to portray more than 50 statesmen and personalities of the era, and covers a vast amount of American history within a nearly three hour-long production.\n\nProbably much too much history, as it turns out. Opening on Tuesday at the Vivian Beaumont Theater, The Great Society eventually congeals into a ponderous drama in spite of the efforts of some excellent actors who do their damnedest to inject life and excitement into a series of woeful events.\n\nJust as the escalating Vietnam conflict and the burn-baby-burn inner city riots are shown to gradually overwhelm Johnson’s ambitions to eradicate poverty, provide federal health benefits, and ensure equal rights for black Americans, so does this hard march through some extremely troubled times ultimately prove to be a downer of a drama.\n\nThis is an enormous and complicated historical canvas and the playwright strives to craft a living diorama from it. Much to his credit, Schenkkan’s workmanlike construction usually neatly dovetails the succession of episodes while providing a sufficient amount of exposition to launch each of them as independent vignettes. Of necessity the story’s lesser figures are merely sketched in, leaving the actors to flesh out the blanks, but one wishes that the playwright had painted his portrait of Johnson with deeper personal insights and colors.\n\nExcept for several sharp instances that illustrate Johnson’s masterly ways of persuasion—notably a humorous end-run around the American Medical Association to launch Medicare and a cunning confrontation with Alabama governor George Wallace regarding the safety of people marching for voting rights—too much of the play seems to witness Johnson simply receiving and trying to cope with nearly ceaseless bad news.\n\nIt is unfortunate that Brian Cox, who depicts Johnson, neither resembles nor much sounds like the tall, craggy-featured, and strategically folksy President. A solid actor, Cox is not a sufficiently dynamic presence to drive the drama forcefully along. His performance pales against the memory of a far more charismatic Bryan Cranston, who played Johnson in All the Way.\n\nCox is not the only one whose portrayal lacks power. Gordon Clapp makes for quite a dull J. Edgar Hoover. Richard Thomas is undermined by his underwritten role as Hubert Humphrey, the Vice President who became the Democratic Party’s nominee in the 1968 presidential election.\n\nOther artists among the hard-working ensemble fare better. Looking little like Martin Luther King, a youthful Grantham Coleman aptly suggests the man’s soulful magnetism. Sharply depicting Wallace and Richard Nixon, David Garrison further provides a touching cameo as a Quaker who sets himself on fire to protest Vietnam. Marc Kudisch energetically stomps about as Chicago Mayor Richard J. Daley and other tough guys. Enabled by Tom Watson’s hair and wig designs, Frank Wood neatly plays four people including a cynical Senator Everett Dirksen.\n\nA side note here: Do these names still ring bells with many viewers? It’s good that a cardboard insert in the Playbill provides brief who’s who descriptions of the drama’s multitudes. Brian Dykstra, Ty Jones, and Matthew Rauch are others who capably assume numerous identities.\n\nAn efficient, rather homely, setting designed by David Korins accommodates various projections that delineate the story’s far-flung locations, although Rauch stages much of the action downstage and center at the Beaumont. If The Great Society is intended to be an animated history lesson, one wishes the illustrations that accompany it packed greater visual punch.\n\nMore a parade of unfortunate circumstances than an effectively curated biography, The Great Society is an earnest consideration of how even a smart and aspirational leader can be undone by his times.\n\nThe Great Society opened October 1, 2019, at the Vivian Beaumont Theater and runs through November 30. Tickets and information: greatsocietybroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict",
    "bww-reviews"
  ],
  "originalScore": "3/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "playbillVerdictUrl": "https://nystagereview.com/2019/10/01/the-great-society-a-leader-in-shades-of-gray-in-another-troubled-time/",
  "bwwExcerpt": "Like its Broadway predecessor of 2014, which detailed Johnson's first year in office and subsequent election as President in his own right, The Great Society is again directed by Bill Rauch, employs a relatively large ensemble of 19 actors to portray more than 50 statesmen and personalities of the era, and covers a vast amount of American history within a nearly three hour-long production. Probably much too much history, as it turns out. Opening on Tuesday at the Vivian Beaumont Theater, The Great Society eventually congeals into a ponderous drama in spite of the efforts of some excellent actors who do their damnedest to inject life and excitement into a series of woeful events.",
  "bwwScore": 6
}
