{
  "showId": "the-great-society-2019",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2019/legit/reviews/great-society-review-brian-cox-1203355172/",
  "publishDate": "October 1, 2019",
  "fullText": "Cox plays President Lyndon B. Johnson in Robert Schenkkan’s political drama about the passing of the Civil Rights Act of 1964.\n\nRaise your hand if you know who Wilbur Mills was. Extra points if you can name the state he represented in Congress or the stripper in the sex scandal that would force his reluctant retirement. But even if you happen to be conversant with all this stuff, chances are you will lose sight of the Arkansas congressman among the parade of politicians who crowd the stage in \"The Great Society,\" Robert Schenkkan's sweeping political drama about LBJ's nerve-wracking efforts to get the 1964 Civil Rights Act passed.\n\nBrian Cox, the much-lauded stage and film actor currently starring as Logan Roy on HBO's \"Succession,\" seems an odd casting choice as Lyndon Baines Johnson, who served as the 36th president of the United States after the assassination of John F. Kennedy. Although Cox nails Johnson the political animal who charmed and bullied Washington's pols – which is the side of the character on constant display here — the actor shows not a hint of LBJ the larger-than-life Texan who gave interviews while on the toilet seat. (Bryan Cranston won a Tony for his performance in Schekken's first play about LBJ, \"All the Way.\")\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n\n VIP+\n \n\n \n \n\n \n \n \n \n What Warner Bros. Can Learn From Netflix About Video Game Strategy \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n ‘Revenge of the Sith’ Supervillain Ian McDiarmid on His ‘Star Wars’ Heel Turn, ‘Rise of Skywalker’ Backlash and Steven Spielberg’s Reaction to The Emperor: ‘Oh My God You're Evil’\n\nLargely at issue in \"Great Society\" is the Civil Rights Act of 1964, initiated by Kennedy just before he was assassinated, and the hell that Johnson put himself through to get it sanctioned in both substance and spirit by African-American leaders and then passed through a fractious Congress. The playwright might have set up a major character to represent the considerable opposition to the bill — some forceful antagonist like, for instance, Georgia Senator Richard Russell, who firmly opposed the very concept of civil rights, and was famously slapped down by LBJ with the words: \"If you get in the way, I'm going to run you down.\"\n\nInstead, Schenkkan brings onstage an army of people on all sides of the fray — so many characters, in fact, that you can't tell them apart without a guide. And while a skimpy program insert does offer a bit of help in identifying the individual players, most of them are on and off in a flash. In fact, there are few extended scenes to give any of the characters a chance to make a strong impression or, more important, to keep the play grounded.\n\nPredictably enough, the ones who stand out are the ones we're most familiar with. People like LBJ's loyal vice president, Hubert Humphrey (Richard Thomas, up to the job but overcome by bloodless lines), the Rev. Martin Luther King, Jr. (in a saintly version by Grantham Coleman) and Robert F. Kennedy (an annoying twit, in Bryce Pinkham's unkind performance). At times, a forceful performance can give life to someone like Illinois Senator Everett Dirksen, who is treated to a colorful turn from Frank Wood. But for the most part, the performers are flown on and off the stage so quickly by director Bill Rauch that I, for one, could barely distinguish Lady Bird Johnson (Barbara Garrick) from Pat Nixon (Angela Pierce).\n\nWith a big, sprawling show like this, we naturally expect some help from the designers to make sure we don't lose the thread or miss a character. Stokely Carmichael (Marchant Davis), for one, stands out by virtue of his snazzy costume (by Linda Cho). But for the most part, Rauch's team seems overwhelmed by the big Beaumont stage, wasting space on sunken floor levels and muddy video aids. Even the TV sets that surround the proscenium are too small to give clarity where clarity is most needed.\n\nCox himself doesn't really claim the character of LBJ until the second act, when the president stands alone, exposed in all his frailties. After the galvanizing March on Washington, after the explosive events in Watts, after the furious uprising against the Vietnam war and after the shocking street violence in Chicago fueled by Mayor Daly, the president emerges from the ashes like some deposed Shakespearean king surveying his lost kingdom. (\"I don't understand why they hate me\" is the most searing line in the play.) Now, that's a character that Cox can really play, as he does here, with such depth and sensitivity that he makes the personal story of this flawed man into a real tragedy.",
  "isFullReview": true,
  "dtliExcerpt": "Robert Schenkkan's sequel to 'All the Way' finds President Johnson caught between the war in Vietnam and the war on poverty at home, with Bryan Cranston again delivering a powerhouse performance as LBJ.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Robert Schenkkan's sequel to 'All the Way' finds President Johnson caught between the war in Vietnam and the war on poverty at home, with Bryan Cranston again delivering a powerhouse performance as LBJ.",
  "contentTier": "complete",
  "contentTierReason": "Short text (33 words)",
  "textQuality": "full",
  "rejectedAt": "2026-02-03T20:09:18.894Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is a brief plot summary/description with no critical evaluation or recommendation about the show's quality; openai: The text is a brief plot summary with a mention of Bryan Cranston's performance, but lacks evaluative content or a verdict about the production.",
  "promptVersion": "5.2.0",
  "previousUrl": "https://variety.com/2019/legit/reviews/the-great-society-review-broadway-1203381413/",
  "urlDiscoveredAt": "2026-02-04T01:53:16.051Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 770,
  "archivePath": "data/archives/reviews/the-great-society-2019/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T01:53:16.060Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426203814",
  "archiveOrgUrl": "http://web.archive.org/web/20250426203814/https://variety.com/2019/legit/reviews/great-society-review-brian-cox-1203355172/",
  "wordCount": 770,
  "tierReason": "Full review text"
}