{
  "showId": "the-great-society-2019",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/2019/10/theater-review-brian-cox-in-the-great-society-on-broadway.html",
  "playbillVerdictUrl": "https://www.vulture.com/2019/10/theater-review-brian-cox-in-the-great-society-on-broadway.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "If it weren't so doggedly self-serious, Robert Schenkkan's The Great Society would be almost entertainingly bad. I didn't see its predecessor, All the Way, which won the Tony for Best Play in 2014 after the production, commissioned by the Oregon Shakespeare Festival and directed by Bill Rauch, came to Broadway with Bryan Cranston as Lyndon Johnson - but after almost three hours of its leaden, long-winded, blithely self-congratulatory sequel, I think I'm good.",
  "bwwScore": 2,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-GREAT-SOCIETY-Opens-On-Broadway-See-What-The-Critics-Think-20191001",
  "showScoreExcerpt": "\"The Great-Man Theory of 'The Great Society'\"\n\nRead more",
  "fullText": "Marchant Davis, Brian Cox, and Bryce Pinkham in The Great Society.\n Photo: Evan Zimmerman\n \n \n \n If it weren’t so doggedly self-serious, Robert Schenkkan’s The Great Society would be almost entertainingly bad. I didn’t see its predecessor, All the Way, which won the Tony for Best Play in 2014 after the production, commissioned by the Oregon Shakespeare Festival and directed by Bill Rauch, came to Broadway with Bryan Cranston as Lyndon Johnson — but after almost three hours of its leaden, long-winded, blithely self-congratulatory sequel, I think I’m good. Again commissioned by OSF (this time in partnership with Seattle Rep) and again directed by Rauch—whose work on the show feels earnest but mechanical—The Great Society is a lumbering, spiritless mess. It’s the Joe Biden of plays: well-intentioned and clueless, taking up space on enormous stages, out of touch with the culture, embarrassing itself to the point where its big-boned, smiling obliviousness starts to look like hubris. At intermission, the friend who was seeing the show with me whispered, “I wish this play was like Fairview, and the second half was just, like, people commenting on the first.” I’m with her. There’s something so musty about the show — about its tired Wikipedia structure and about its assumption that what we really need is another star vehicle about a powerful, aging white man — that part of me kept waiting for Tom Servo and Crow T. Robot to pop up in the front row. This can’t actually be for real, was my recurring thought. But it is, and it’s on Broadway.\n\nTaking over for Cranston, Brian Cox here plays LBJ in the latter years of his presidency. All the Way began after John Kennedy’s assassination and built to Johnson’s pushing the Civil Rights Act of 1964 through Congress. The Great Society picks up in 1965 with an ever-mounting list of pressures for the president and the nation — from the violent racism meeting Martin Luther King Jr.’s (Grantham Coleman) voting-rights marches in the south to the partisan resistance to LBJ’s fleet of social programs, from which the play takes its name, and then to the U.S.’s increasingly sticky, and increasingly deadly, war in Vietnam. There’s no question that Cox is a powerhouse of an actor, but Schenkkan’s play gives him shackles rather than wings. Cox has to talk almost constantly for two hours and 45 minutes, rattling off dialogue that demonstrates just how much pride the script takes in the breadth of its historical research, and just how little ability it has to fashion actual human beings on stage. It’s a marathon with no real reward — in other words, a slog. Cox ends up shouting about 75 percent of his role, and he’s not the only actor to slip into that trap. What else can they do with such a barrage of pushy, one-dimensional text?\n\nWhen the play isn’t cramming actors’ mouths full of statistics and policy (which Rauch has the cast race through, probably hoping that speed alone will carry us along), it’s wallowing in folksy cliché. If we’re to believe Shenkkan, no other man has loved him some barnyard symbology like LBJ, whose working-class Texas upbringing is here laid on with a trowel. “One year when he was feelin’ flush, my daddy took us all to the rodeo,” Cox tells us as the play begins. What follows is a twangy, verbose account of watching a bull rider go from triumph to trampled, a helpful metaphor for Johnson’s presidency. And there are plenty more where that came from. “You wanna plow a straight furrow, you put blinders on your mule”; “You know how a rattlesnake eats a rat?” The Great Society almost deserves credit for its total lack of shame: Is there another play out there where, in the same minute and a half of dialogue, you get “like it needs a hole in the head,” “You … want to send our boys over there to fight with one hand tied behind their backs?,” “till the cows come home,” and “This isn’t my first visit to the rodeo?” The spirit of George Orwell — for whom cliché wasn’t simply a bore but a real cultural danger — is looming in the Vivian Beaumont, and is not amused.\n\nWhile Johnson wheedles and strongarms and lurches toward his political demise, the historical figures that surround him often feel downright robotic. Rauch’s actors — even the ones doing their best to hold on, like Coleman, or Bryce Pinkham, who plays Robert F. Kennedy like a Fitzgerald character without a sense of humor — are stranded. They’re not playing humans; they’re doing impressions. If they’re wooden, it’s not their fault. I’ve seldom heard so many subtly (or not so subtly) flubbed lines in a production of this scale, but it’s no wonder: Shenkkan’s script gives the performers nothing to bite into. The meat of good drama — real feeling, personal and interpersonal complexity, human connection — is in short supply.\n\nTake Richard Thomas as LBJ’s vice-president, Hubert Humphrey. As portrayed in The Great Society, Humphrey has a single job: He handles what I think of as Harry Potter Exposition. This is the thing where Dumbledore, or Hermione, or someone whose brain is working faster than Harry’s, explains something semi-complicated. Then Harry, aghast, will say, “Do you mean to say that…” and reiterate the thing we need to know. “Our first land base in Vietnam?” (italics not mine) says Humphrey, aghast, when Secretary of Defense, Robert McNamara (Matthew Rauch) suggests deploying more troops to a newly-constructed base at Pleiku. “Eighty miles along the Jefferson Davis Highway, through the worst Klan country in the South?” Humphrey yelps, aghast, when MLK proposes his march from Selma to Montgomery. “Move from a strictly defensive posture of air strikes to a policy of offensive action?” he cries, when McNamara proposes a draft increase and a more aggressive military stance. “The usual squalid voter-suppression tactics,” he explains, to no one but us, as MLK lists the various ugly methods used to keep black people from registering to vote.\n\nThis stuff is practically self-parody. But The Great Society so manifestly thinks that it’s doing great work, that it’s a Big, Important, Needful Drama. Truly, it’s hardly even a play. It’s a dramatized textbook, written from the same perspective as most of our textbooks — the perspective that tells the story of history through the struggles of a white male leader, one that asks us to behold his complexity and exercise our sympathies on his behalf. It’s not that the man’s not complex, nor that he doesn’t deserve sympathy — but this isn’t a deep enough reading to justify itself. And at this point, watching yet another group of black actors have to put on 1960s costumes and embody civil-rights marchers — while yet another group of white actors wearing flak jackets menaces them with billy clubs and racist epithets — feels not only stale but increasingly off-putting. This is the picture we’ve been looking at, the play we’ve been watching, for decades, and what do we have to show for it?\n\nThe Great Society is at the Vivian Beaumont Theater through November 30.",
  "isFullReview": true,
  "textWordCount": 1191,
  "archivePath": "data/archives/reviews/the-great-society-2019/vulture--sara-holdren_2026-02-06.html",
  "textFetchedAt": "2026-02-06T18:18:32.996Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20191018070607",
  "archiveOrgUrl": "http://web.archive.org/web/20191018070607/https://www.vulture.com/2019/10/theater-review-brian-cox-in-the-great-society-on-broadway.html",
  "contentTier": "complete",
  "wordCount": 1191,
  "tierReason": "Full review text"
}