{
  "showId": "tammy-faye-2024",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Arifa Akbar",
  "url": "https://www.theguardian.com/stage/2022/oct/27/tammy-faye-a-new-musical-review-elton-john-almeida-theatre-bakker-televangelists",
  "playbillVerdictUrl": "https://www.theguardian.com/stage/2022/oct/27/tammy-faye-a-new-musical-review-elton-john-almeida-theatre-bakker-televangelists",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "From lovable klutz to tortured soul … Andrew Rannells and Katie Brayben as Jim and Tammy Faye Bakker. Photograph: Marc BrennerView image in fullscreenFrom lovable klutz to tortured soul … Andrew Rannells and Katie Brayben as Jim and Tammy Faye Bakker. Photograph: Marc Brenner This article is more than 3 years oldReviewTammy Faye: A New Musical review – Elton John’s hymn to biblical kitschThis article is more than 3 years oldAlmeida, London Songs belt out deliriously in this romp through rise and fall of the Bakker televangelists and latterday gay icons – so thick and fast the James Graham script and Jake Shears lyrics are sometimes overwhelmed by glitz\n\nTammy Faye was the TV evangelist who captured Christian America with her telegenic manner and her megawattage of charm. This musical, based on her remarkable rise and biblical fall from grace, comes with its own megawatt allure, not least because of its celebrity credentials. How many musicals can boast a score by Elton John, lyrics by Jake Shears and book by playwriting whiz James Graham?\n\nBut it pulls out all the stops to stage a show as glittery as these starry names. Infectious in its music, exuberant in its performances and gloriously kitsch in its aesthetic, it is stylishly pulled together by director Rupert Goold.\n\nIn its story, it is as much about Tammy Faye’s first husband and TV co-star, Jim Bakker (Andrew Rannells) as Tammy Faye (Katie Brayben). We see her become a gay icon after inviting a pastor with Aids on to her show and we hear – rather late in the day – why she feels an outsider to traditional congregations. But this is too broad-brush and brief (a 2021 film, starring Jessica Chastain, is far more probing by comparison) while Bakker’s sexuality and sexual misdemeanours are better explored. But Tammy Faye does have the best solo numbers and Brayben has a turbocharged voice that belts them out to awesome effect. Rannells is as strong, morphing from lovable klutz to flawed, tortured soul.\n\nView image in fullscreenNo strings … the televangelists started out with a puppet show. Photograph: Marc BrennerBunny Christie’s set, meanwhile, is simple but spectacular – a TV studio with a back wall of miniature sets that double up as windows through which characters deliver comic sketches. In a nod to the Bakkers’ start in children’s puppetry, they bear some resemblance to the Muppet Show: one recurring conversation between Pope John Paul II (Nicholas Rowe), archbishop Robert Runcie (Steve John Shepherd) and the Latter Day Saints’ president in Salt Lake City (Fred Haig) appears like a comic twist on Statler and Waldorf.\n\nKatrina Lindsay’s gorgeous costumes change with the times, from Hairspray-inspired wigs of the 60s to the boxy suits and bat-wings of the 80s. Lynne Page’s choreography is riotous, while visual humour comes in fabulously camp asides.\n\nThe songs progress the story rather than illustrating it, but John’s music begins to overwhelm Graham’s script, which is so good we half wish this were Tammy Faye “the play” over “the musical”. It is not that the music is weak – although its sound is so distinctive there is a sense the actors are impersonating Elton John. But there are so many songs that Graham’s dazzling dialogue is sometimes edged aside. Shears’s beautiful lyrics (“I feel like a torn dress you can’t mend,” sings Tammy Faye, after Bakker admits to infidelity) seem swamped by the music too.\n\nWe do not get much of a story in the first half but there is so much showmanship that it does not matter. This is, without doubt, a musical with charisma, just like Tammy Faye herself. In its biggest moments – and there are several – it reaches a delirious kind of excellence.\n\nTypically, Graham’s script does not just capture Tammy Faye’s story but a bigger time, place and politics. The advent of TV celebrity culture is vividly brought to life, as in Best of Enemies, but here we see the blurred lines between worship, congregation and entertainment. “We’ll save their souls through TV screens,” says Jim, and combines Christianity with cookery along with soft-focus sofa chats with Larry Flynt and Ronald Reagan, which make for zingy scenes, especially when Reagan tries to rebrand Jesus as a proto-Republican.\n\nWhat ultimately destroys the Bakkers’ liberal Christianity is a puritanical backlash determined to clamp down on gay rights, abortion rights, feminist rights. That – chillingly – resonates, and we are left feeling that today’s America could do with taking a leaf out of Tammy Faye’s church of love.",
  "isFullReview": true,
  "textWordCount": 756,
  "archivePath": "data/archives/reviews/tammy-faye-2024/guardian--arifa-akbar_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:25:17.227Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 756,
  "tierReason": "Full review text"
}