{
  "showId": "tammy-faye-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2024/11/14/tammy-faye-praise-the-lord-and-pump-up-the-video/",
  "publishDate": "2024-11-14T22:56:45",
  "fullText": "Broadway has a new, big, loud, high-tech British musical with lots of fury, driven by close-up video sequences which at times fill the stage and bulldoze the proceedings. Wait a minute! That’s Jamie Lloyd’s Sunset Blvd, in residence at the St. James.\n\nNow comes Tammy Faye, a new, big, loud, high-tech British musical with lots of fury and pumped-up video lavishly applied in a vain effort to create excitement. This in lieu of engaging the audience in the old-fashioned manner: you know, with songs, imagination, and life-sized actors who manage to keep you laughing and crying and feeling while they project the material to the back row of the balcony, even if you can’t quite see all those tonsils.\n\nDirector Rupert Goold and writers Elton John, Jake Shears, and James Graham have collaborated on a capsule biography of Tammy Faye Bakker Messner (1942-2007). One of those rags-to-riches sagas about an innocent naif who attaches herself to an underdog who, with her prodding, becomes king of the hill until that inevitable day when the money stops rolling in. Wait a minute! That’s Evita.\n\nWhile not actual heads-of-state, the real-life Jim and Tammy Faye did indeed attain top-dog status in the world of U.S. television evangelists, circa 1978. Until, that is, their kingdom—the PTL Network (as in Praise-the-Lord) and Heritage World, their Carolina Disneyland for devout devotees—collapsed in a morass of bankruptcy and scandal. And sex scandal.\n\nBakker went to jail, Tammy Faye went for a colonoscopy. Yes; the musical opens with Tammy Faye (Katie Brayben) dressed in heavenly white and apparently ascending to heaven. “Oh God, is that you?” she asks devoutly. The response: “This is your proctologist.” That gets a laugh, needless to say, setting an initial tone that turns out to be problematic.\n\nCertainly, the strange saga of the televangelists can be told as satire, or exposé, or morality tale. You could present Tammy Faye as villain, heroine, or villain-transformed-to-heroine; Jim (Christian Borle) might be limned as mastermind, dupe, or lost soul in over his head. The trouble, at the newly resplendent Palace Theatre, is that the creators switch from one extreme to the other, usually looking (or sneering) down their collective noses at the Bakkers though occasionally glorifying the pair with over-the-top production numbers and all those video closeups.\n\nBut who do they want us to root for? Tammy Faye, who is drawn as a not-too-intelligent, trailer park Lady Macbeth wallowing in corruption and dollars swindled from the TV audience out there — until a brief scene when she is nice to an AIDs patient? Jim, who clearly seems to be manipulated by others until the moment when he tries to take control and the castles collapse? Certainly not the reformers, led by the villainously sneering Jerry Falwell (Michael Cerveris), who scheme to take the Bakkers down and divvy up the faithful PTL audience/donor base.\n\nThere is something to be said, musical comedy-wise, in leaving the answer ambiguous so that viewers can puzzle it out for themselves. The overriding flaw in Tammy Faye is that the creators seem content to jump from satire to morality tale, from Tammy-the-charlatan with her friendly proctologist to Tammy the AIDS crusader, with no clear aim other than to maximize audience response moment by moment.\n\nEarly on we sense bookwriter Graham attempting to spin a web of scandal in the dynamic manner of his fascinating 2017 play Ink (also directed, superbly, by Goold). But then they go back into a song or three and the claustrophobic crunch never returns. Was Tammy Faye intended to be a musical equivalent to Graham’s Rupert Murdoch exposé? Was it conceived as a drama, until they realized there was more gold to be earned from a hit Elton John musical? Graham’s credits includes numerous excellent plays (This House, Dear England), but Tammy Faye is closer to his work on the similarly underbaked musical Finding Neverland.\n\nJohn’s music is OK, though without the effectiveness of Billy Elliot or The Lion King. The lyrics by Shears, lead singer of the group Scissor Sisters, are suitable enough, but the score is rarely compelling. One production number, a daffy phantasmagoria called “Heritage USA,” momentarily rouses the audience and the show, all production elements sparking while Borle sets the stage afire. Otherwise, though, we get a lot of emotive singing from the leading lady and her cohorts, along with various show-biz-evangelical songs of praise and condemnation. Last week’s City Center production of Lynn Ahrens and Stephen Flaherty’s Ragtime only accentuates how well-conceived songs can actually power a musical, instead of simply filling the gaps as we wander from plot point to plot point.\n\nGoold and choreographer Lynne Page keep things moving at rapid pace, which makes for interesting watching while hiding the hollow dramaturgy. Bunny Christie (of Curious Incident, Ink, and the recent Company) provides an arresting setting, dominated by 42 immense video cubes that fill the upstage wall while resembling the set for that old television gameshow “Hollywood Squares.” Let me add that while I appreciate a scenic coup de théâtre as much as anyone, the one in Tammy Faye is neat but in 2024 not especially novel. The video design by Finn Ross (Curious Incident) works well, if not as well as the higher-tech video in Sunset, but one begins to wonder whether all these blow-ups enhance the experience of live theatre or merely detract from the songs and the acting. Katrina Lindsay (Harry Potter and the Cursed Child) has a field day with her 1970s-era costumes, while lighting designer Neil Austin (Ink) keenly pinpoints the action despite competition from all that video.\n\nBrayben is impressive in her U.S. debut, singing up a storm and delivering laugh lines galore but ultimately generating little sympathy. Borle, an accomplished musicomedy ace, seems stumped by the unconvincingly written Bakker; the character is so overshadowed by Tammy Faye that Borle kind of tamps down his presence except in that “Heritage” number. (This role was originated by Andrew Rannells in the initial production at the Almeida Theatre, the 325-seat off-West End house that has—under the artistic direction of Gould—turned out numerous fine productions. If they did not revise the role of Bakker for Borle, maybe they should have.) The similarly accomplished Cerveris is saddled with a dislikable role as a dislikable character.\n\nOtherwise, the dramatis personae features the likes of Billy Graham, Pat Robertson, Jimmy Swaggart, Larry Flynt, Ronald Reagan, Pope John Paul II, and Ted Turner. All of these not negligible personalities parade in and out interchangeably, played by various ensemble members with plenty of wigs and makeup but with little character development. Most effective, due either to the writers or the actor, is Charl Brown as AIDS patient Steve Pieters. His first brief appearance is the most effective moment in Tammy Faye, perhaps because it is done as a straight book scene (no gags, no song).\n\nPieters’ second appearance, near the finale, is only one speech long but empathetically ironic. This takes us back to that musical-comedy proctologist. A last laugh, a sequined hospital gown, a final chorus and death, praise the lord. Followed by one of those obligatory standing ovations.\n\nTammy Faye opened November 14, 2024 at the Palace Theatre. Tickets and information: tammyfayebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "bww-reviews",
    "bww-roundup"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0,
  "bwwExcerpt": "There is something to be said, musical comedy-wise, in leaving the answer ambiguous so that viewers can puzzle it out for themselves. The overriding flaw in Tammy Faye is that the creators seem content to jump from satire to morality tale, from Tammy-the-charlatan with her friendly proctologist to Tammy the AIDS crusader, with no clear aim other than to maximize audience response moment by moment.",
  "bwwScore": 2,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-TAMMY-FAYE-Opens-On-Broadway-20241114"
}
