{
  "showId": "tammy-faye-2024",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Michael Sommers",
  "url": "https://nystagereview.com/2024/11/14/tammy-faye-brit-tuner-sings-the-red-white-and-boo-hoo-blues/",
  "publishDate": "2024-11-14T22:55:54",
  "fullText": "Let’s be relatively brief because it’s mean to keep beating a dead duck like Tammy Faye, poor thing. A surprisingly flat-liner musical involving tunes from Elton John scarcely composing in top form and a sorrowful cartoony story about American TV evangelist Tammy Faye Bakker, the production that opened Thursday at the Palace Theatre does not promise to become a longtime Broadway attraction.\n\nGenerally satiric in tone, the show dishes out some mostly unattractive characters wearing unattractive 1970s-80s clothes doing unattractive deeds (to say nothing of bad choreography) mostly in the name of their fundamentalist God. The musical opens as kind-hearted, mascara-challenged Tammy Faye, later in years, learns she has stage 4 colon cancer and then recalls her lifetime in flashback. The show concludes as a white-robed Tammy Faye ascends toward her reward backed by a choir, beatifically lit and singing “See You in Heaven.”\n\nBetween those points, well, is anyone keen to see a sad, rather tasteless tabloid musical about good Christian people mostly being bad? Anyway, James Graham’s libretto sketches out the tearful heroine’s marriage to cheerful God-is-love preacher Jim Bakker, their rise to cable TV superstardom as televangelists and how their dream gets wrecked by money, scandal and envious rival clergymen.\n\nCoupled with some single-entendre lyrics by Jake Shears for numbers such as “He’s Inside Me,” the score’s 15 or so principal songs have been composed by Elton John mostly in country & western slash gospel-ish musical formats likely meant to reflect the rural Southern roots of the fundamental church movement. It’s ironic that John, who composed dozens of chart-busting pop classics of the 1970s-80s, appears uninspired by a story set during those same times, since his anthems and power ballads here make scant impression in spite of their supercharged orchestrations. They do little to elevate the unhappy scenario.\n\nIt is obvious how the writers and Rupert Goold, the director who misguides the production, utilize this rise-and-fall saga to make fun of crass red, white and blue American culture of half a century ago; in particular the tackiness of early cable TV. So the designers, who shall go nameless, deliver an ugly background wall of quasi-TV screens and plenty of hideous polyester and denim period attire. The line between satire and camp is a terribly thin one and it is frequently trespassed here, egregiously so by choreographer Lynne Page, whose frenetic TV variety show-style front-and-center dances are witless.\n\nMaking her Broadway debut in the challenging title role is Katie Brayben, winner of an Olivier Award for this sincere, strenuous performance in London. Looking very little like apple-cheeked Tammy Faye, Brayben portrays the much-wronged heroine with a sunny, plucky disposition and a vibrant if steely voice. As Jim Bakker, a bright-eyed Christian Borle provides an amiable presence until his figure as written soon dwindles into a weak, needy loser. The story’s villain is pompous televangelist Jerry Falwell, depicted as stealing the PTL Network from the Bakkers by dubious means, and characterized by the ever-sonorous Michael Cerveris as a perpetually grumpy fellow glowering under a muskrat toupee. (Not incidentally, the wigs in this show look awful.) Among the able supporting players, Mark Evans makes the brightest impression as a wildly charismatic Billy Graham. The valiant members of the ensemble dance through their seemingly exhausting numbers with brave smiles and unflagging energy.\n\nEnding on a somewhat happier note, let’s mention how it’s nice to be back again amid the glorious white and gold environs of the venerable Palace Theatre, now relocated several levels above the street. The revamped venue features a new entrance around the corner from Times Square, a flashy escalator ride up to a surprisingly nondescript lobby/bar area, and some none too spacious bathroom facilities, shame on the developers.\n\nTammy Faye opened November 14, 2024 at the Palace Theatre. Tickets and information: tammyfayebroadway.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "nyc-theatre"
  ],
  "originalScore": "2/5 stars",
  "nycTheatreExcerpt": "\"A surprisingly flat-liner musical involving tunes from Elton John scarcely composing in top form and a sorrowful cartoony story about American TV evangelist Tammy Faye Bakker, the production that opened Thursday at the Palace Theatre does not promise to become a longtime Broadway attraction.\""
}
