{
  "showId": "tammy-faye-2024",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/article/theater-review-broadway-musical-tammy-faye.html",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "The blithe big-tent-ism (which also seems to be Elton’s go-to interview stance) feels pat. Clearly the production’s not all that interested in people with serious Christian-conservative leanings, unless they have a whole lot of patience for endless puns about Jesus being “inside her/him/me/you” and “the sound of the Lord, coming right in your ear.” And if you are, to quote Tammy Faye’s version of Jimmy Swaggart, a “liberal-loving Marxist,” you’re probably too heartsick to find all this much fun.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-TAMMY-FAYE-Opens-On-Broadway-20241114",
  "showScoreExcerpt": "\"the splashy new musical about the life of televangelist Tammy Faye Bakker\"\n\nRead more",
  "contentTier": "invalid",
  "contentTierReason": "Only aggregator excerpts available",
  "rejectedAt": "2026-02-04T14:34:50.760Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This is just a brief descriptive phrase about the show's subject matter with no critical evaluation or opinion, followed by a 'Read more' prompt indicating this is promotional/teaser text rather than actual review content.; openai: The provided text is a partial sentence that introduces the subject of the review but does not contain any evaluative content or opinion about the show.; gemini: This is just a brief mention of the show, not a review with any evaluative content.; kimi: The provided text is a 9-word descriptive fragment ('the splashy new musical about the life of televangelist Tammy Faye Bakker') containing no evaluation, opinion, or recommendation. It functions as a plot summary/catalog description rather than critical assessment.",
  "promptVersion": "5.2.0",
  "bwwScore": 3,
  "sources": [
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ]
}
