{
  "showId": "on-the-twentieth-century-2015",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "http://www.ew.com/article/2015/03/15/on-the-twentieth-century-ew-review",
  "playbillVerdictUrl": "http://www.ew.com/article/2015/03/15/on-the-twentieth-century-ew-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "\"On the Twentieth Century\" Kristin Chenoweth and Peter Gallagher\n (Joan Marcus)\n\nGenre: musical, Revival; Starring: Kristin Chenoweth, Peter Gallagher, Andy Karl; Director: Scott Ellis; Author: Betty Comden, Adolph Green, Cy Coleman; Opening Date: 03/15/2015\n\nPosted March 15 2015 — 10:51 PM EDT\n\nIn a recent interview, Kristin Chenoweth revealed that a voice teacher told her 15 years ago she’d eventually play the frumpy accompanist-turned-glamorous A-lister Lily Garland in the madcap musical On the Twentieth Century. After witnessing Chenoweth’s supreme triumph in Roundabout Theatre Company’s ultimate chase-the-blues-away confection currently playing at the American Airlines Theatre, all one can say is God bless that voice teacher.\n\nThe 1978 Betty Comden/Adolph Green/Cy Coleman tuner that—however briefly—gave the great Madeline Kahn her most notable starring vehicle on Broadway while also catapulting a young Kevin Kline to stardom, needs real star power to motor its engine. (One can only imagine how many versions of this show have crashed and burned due to actorly underkill.)\n\nBut this one isn’t merely content to rest on its diminutive star’s mighty shoulders. The high-energy tale of a luxury train making a cross-country trip with a bevy of eccentric showbiz types, including former collaborators/lovers Lily Garland and Oscar Jaffee (Peter Gallagher), is a veritable dais for the abilities of Broadway’s choicest clowns; it’s hard to remember a recent production in which the cast was so uniquely suited to each and every role.\n\nAndy Karl-still maintaining his Rocky-hard bod-slays as Lily’s vainglorious, in-tow galoot of a beau, Mark-Linn Baker and the ever-soulful Michael McGrath are delightful as Oscar’s naively loyal theater-biz right hands, and Mary Louise Wilson, as the religious zealot Miss Primrose, the choo-choo’s resident cuckoo, gives a performance as spry and crafty as can possibly be attained by an octogenarian, and all but steals the tracks from right out under the train.\n\nBut the real surprise here just might be Gallagher. Oscar is a more difficult role than it looks; you need someone who can quick change from daft dolt to smoldering romantic lead in a heartbeat, while still being fully able to compete with Chenoweth’s firebrand triple-threat (yes, she even hoofs here, and wonderfully). Never fear, the still-dashing Gallagher’s got the goods.\n\nDirector Scott Ellis’ attractive, expertly designed revival still doesn’t quite solve the problem that’s always been inherent in Century, which is that Oscar and Lily’s consummate love affair never achieves the same ardor after their marvelous Act I duet “Our Private World” has washed over you; the second act, however entertaining, merely gives us more of the same push-and-pull. But Gallagher and Chenoweth have forged such a palpable rapport here, it would be a fool’s errand to even spend too much time thinking about that.\n\nIn fact, On the Twentieth Century is so generous a vehicle (pun completely intended), it even lets the porters have a bona fide showstopper—the tap-tastic Act II opener “Life is Like a Train. (The charming quartet is composed of Phillip Attmore, Rick Faugno, Drew King and Richard Riaz Yoder.) It’s one of many affectionate moments you’ll be reflecting on later,",
  "isFullReview": true,
  "textWordCount": 509,
  "archivePath": "data/archives/reviews/on-the-twentieth-century-2015/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:08:32.209Z",
  "originalScore": "A-",
  "originalScoreNormalized": 90,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "connect ECONNREFUSED 207.241.237.3:80"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20150317042406",
  "archiveOrgUrl": "http://web.archive.org/web/20150317042406/http://www.ew.com:80/article/2015/03/15/on-the-twentieth-century-ew-review",
  "contentTier": "complete",
  "wordCount": 509,
  "tierReason": "Full review text"
}