{
  "showId": "on-the-twentieth-century-2015",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "http://newyorktheater.me/2015/03/15/on-the-twentieth-century-review-kristin-chenoweth-peter-gallagher-on-glorious-hilarious-train-trip/",
  "publishDate": null,
  "fullText": "Train travel is hot again, at least at the (ironically named) American Airlines Theater, where “On The Twentieth Century” turns out to be one of the funniest and most entertaining shows on Broadway – something not everybody would have predicted for this revival of a 37-year-old musical comedy adaptation of an 83-year-old play about two people who take a train from Chicago to New York. But this is no ordinary Amtrak, and the people on board are far from pedestrian commuters. They are an electrifying mix of the glamorous and the hilarious, their antics piling up at perilous speed. We are on the Twentieth Century Limited, the ultimate in gleaming Art Deco luxury train travel, thanks to some spectacular work by set designer David Rockwell, who goes full steam ahead with the train motif right from the get-go: Even during the overture, in front of a metallic-looking curtain stamped with a train design, puffs of smoke noisily gasp into the air as if from a locomotive. On board is the dazzling, ill-tempered movie star Lily Garland, portrayed by the dazzling Kristin Chenoweth, who here shows off not just her golden pipes but some superb comic chops. Lily is being pursued by the magnetic, sleazy Broadway impresario Oscar Jaffe — portrayed by the magnetic Broadway performer Peter Gallagher. Their characters are both self-dramatizing narcissists, and they play them grand, broad and bickering. When he twirls his mustache, it’s not a villainous gesture; it’s a vain one: He’s looking in the mirror of his train compartment, prettying himself for the planned seduction. Oscar is the man who discovered Lily, when she was a dowdy piano accompanist named Mildred Plotka (with a New York accent reminiscent of early Barbra Streisand), and he turned her into a star. They became lovers; now they’re haters. She wants nothing to do with him. But he needs her for his next show, after a string of flops has put him hundreds of thousands of dollars into debt. He has 16 hours (the duration of the train trip) to win her back, come up with a show for her to star in, and get it funded. This thin and improbable premise worked for the anarchic comic talents of Ben Hecht and Charlie MacArthur, who wrote the 1932 Broadway play Twentieth Century and then adapted it into the quintessential 1934 screwball comedy starring John Barrymore and Carole Lombard. And it works as well for the musical adaptation by Betty Comden and Adolph Green, who partnered with composer Cy Coleman. Coleman may have created scores with more memorable melodies (in “Sweet Charity,” and “The Life”), but “On The Twentieth Century” (largely mock operetta and train rhythms, which won the 1978 Tony for best original score) is full of songs that function as deft comic numbers. Director Scott Ellis and choreographer Warren Carlyle make the most of both the slapstick mayhem and the razzmatazz, sometimes simultaneously. In “Veronique,” for example, we’re offered a flashback of Lily in one of her Oscar Jaffe-created starring vehicles, in front of a backdrop of the Arc de Triomphe, which manages to be both satiric and delightful in its excess. The smartest move the director makes is in choosing the cast, which includes numerous stand-outs among its two dozen members. Andy Karl, recently the star of Rocky, shines here as Lily’s new boyfriend Bruce Granit , a self-involved movie actor who likes to paste 8 by 10 glossies of himself around her train compartment, and (using his Rocky workouts to good measure), exercises using Lily as his dumbbell. Mary Louise Wilson is delectable as Letitia Peabody Primrose, a crackpot religious fanatic who’s been surreptitiously pasting “Repent” stickers everywhere on board, especially fellow passengers’ backsides. If Miss Primrose seems at first just an exercise in comic digression, she winds up figuring prominently in the off-the-wall plot in ways I won’t reveal here. She is also the vehicle by which the show goes positively Salvador Dali in its treatment of trains during the song “She’s a Nut” (See some of the photographs below.) The four redcap porters – members of the ensemble Rick Faugno, Richard Riaz Yoder, Phillip Attmore and Drew King – steal the show several times with their carefully coordinated song-and-dance routines, such as the novelty number “Life Is Like a Train,” whose lyrics demonstrate that life is not like a train, but whose train-like dance moves show otherwise. But kudos must go especially to Peter Gallagher and Kristin Chenoweth, and not just because they provide the central spark that ignites the comic chaos. The opening of “On the Twentieth Century” was delayed a few days because a sinus infection forced Gallagher to miss performances. Due to an injury, Chenoweth has been cracking her jokes while nursing a cracked rib. Together, they prove themselves old-fashioned troupers in this old-fashioned entertainment – turning “old-fashioned” into a compliment. Roundabout’s American Airlines Theater Book and lyrics by: Betty Comden and Adolph Green, music by Cy Coleman Based on plays by Ben Hecht, Charles MacArthur and Bruce Millholland Set Design by David Rockwell; Costume Design by William Ivey Long; Lighting Design by Donald Holder; Sound Design by Jon Weston; Hair and Wig Design by Paul Huntley; Makeup Design by Anne Ford Coates; Cast: Kristin Chenoweth (Lily Garland), Peter Gallagher (Oscar Jaffee), Andy Karl (Bruce Granit), Mark Linn-Baker (Oliver Webb),Michael McGrath (Owen O’Malley), Mary Louise Wilson (Letitia Primrose), Phillip Attmore,Justin Bowen, Preston Truman Boyd, Paula Leggett Chase, Ben Crawford, Rick Faugno, Jenifer Foote, Bahiyah Hibah, Drew King, Analisa Leaming, Kevin Ligon, Erica Mansfield, James Moye, Linda Mugleston, Mamie Parris, Andy Taylor, Jim Walton, Richard Riaz Yoder Running time: 2 hours and 30 minutes, including one 15-minute intermission Tickets: $67 to $147 On The Twentieth Century is scheduled to run through July 5, 2015. I’ll be surprised if it isn’t extended. Update: Extended through July 19 On The Twentieth Century Revival with Kristin Chenoweth – first photoOctober 24, 2014In \"Broadway\" Beware the Ides of March? No, Celebrate! The Week in New York TheaterMarch 15, 2015In \"New York Theater Weekly Summary\" 2015 Outer Critics Circle Nominations: Something Rotten, On The 20th Century Lead.April 20, 2015In \"Awards\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "“'On The Twentieth Century' turns out to be one of the funniest and most entertaining shows on Broadway...an electrifying mix of the glamorous and the hilarious...Director Scott Ellis and choreographer Warren Carlyle make the most of both the slapstick mayhem and the razzmatazz, sometimes simultaneously.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 1023,
  "archivePath": "data/archives/reviews/on-the-twentieth-century-2015/nyt-theater--jonathan-mandell_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:56:36.909Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 1023,
  "tierReason": "Full review text"
}