{
  "showId": "moulin-rouge",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2019/07/25/moulin-rouge-the-musical-all-you-need-is-love-and-showmanship/",
  "publishDate": "2019-07-25T21:40:37",
  "fullText": "Moulin Rouge! The Musical! opened tonight (!), and they might as well give the Tony Award for best scenic design of a musical to Derek McLane right now.\n\nThere are very strong cases to be made, too, for Tonys for Catherine Zuber’s costume design, Justin Townsend’s lighting design, Peter Hylenski’s sound design, Alex Timbers’ direction, Sonya Tayeh’s choreography (in what seems to be her first Broadway effort), and, especially, Karen Olivo’s spectacular performance — and to be spectacular within a spectacle is really saying something — as Satine, the glamorous, tubercular courtesan at the center of Moulin Rouge’s melodramatic Montmartre love triangle.\n\nBut the real question becomes: Can there be a Tony Award for music rights clearances?\n\nBecause Moulin Rouge! The Musical! is somehow — and quite successfully — even more than the thoroughly over-the-top 2001 Baz Luhrmann film. There isn’t, and can’t be, all the filmic tricks Luhrman used, but it’s a busy, vibrant theatrical interpretation on stage at the Al Hirschfeld, and its beating heart is its score, even more overstuffed with pop hits than was the movie’s. It includes 70-odd hits, some of them full songs, some with reprises, some just a passage or even a line. The classics from the movie are there—Elton John, of course, and Lady Marmalade, and the greatest thing you’ll ever learn—plus a load of more recent hits (that will no doubt help thrill and draw in the kids) and other classics, even the Rolling Stones.\n\nAnd all those interwoven music cues are what makes this Moulin Rouge! work. Congratulations on your invented award, music supervisor, arranger, and orchestrator Justin Levine! (If you try sometimes, after all, you get what you need.)\n\nThat’s not to diminish any other parts of the staging or performance. Timbers, always an endlessly visually inventive director, hasn’t always had material that lived up to his specialties. (Rocky comes to mind.) But Luhrmann’s fantasia gives Timbers license to do his best work—while creating something that is a definitively theatrical experience, not just a pale imitation of the film.\n\nWorking with McLane, he builds an overstuffed, gaudy 18th arrondissement of a set that leaves theatergoers happily Instagramming up until the curtain rises, all rich reds with a giant elephant and a Moulin Rouge windmill hanging over the house. Zuber’s costumes are rich and appropriately gaudy. Tayeh’s dances manage to be both explosively athletic and elegantly balletic, and naturally sexy and sultry.\n\nThe performances are strong, too, but this is a musical built around the extravaganza, not about the people within it. From the first moments, the stalwart Danny Burstein displays a deliciously campy side, turning the club proprietor Harold Zidler into someone who resembles a major-chord Cabaret emcee. (Save another Tony.) Olivo, last seen on Broadway a decade ago as West Side Story’s Maria—she’s a star-crossed star, it seems—is simply sensational, giving Satine the magnetism she needs and killing in her big numbers. In a show where spectacle is king, the other performers stand out less, except for the charasmastic Sahr Ngaujah as a full-sized but still somehow stunted Toulouse-Lautrec.\n\nThe rivals for Satine’s love are the poor American writer Christian (Aaron Tveit, pretty as ever and also sort of sweet) and the imperious Duke of Monroth (Tam Mutu, suitably imperious), who demands Satine’s devotion as the price for his financial support of their music hall, and of the revolutionary play they’re trying to put on.\n\nMonroth, naturally, grows dismayed with this play within the play, one clearly designed to mock him. “I like the dancing,” he tells Toulouse-Lautrec. “We should have more of that.”\n\nAnd that, alas, is a good summation of Moulin Rouge!, too. Its big numbers are delicious and delightful, but when it slows down to a book scene it really slows down. The script is by John Logan, who won the Tony for Red but also brought us the book for The Last Ship, and it’s a more than creditable theatricalization of the Luhrmann’s film. But the success of the film relied entirely on its razzle-dazzle, and while Timbers has done an excellent job of creating stage razzle-dazzle, the plot machinations continue to hold little interest. Which makes the second act—oh, look, blood in a handkerchief!—a bit sloggier than the first.\n\nBut when that plot is sung—belted to the rafters, sexily danced by a gorgeous ensemble, layering pop hit on top of pop hit on top of pop hit—it’s every thing the audience wants. Gitchie, gitchie, ya-ya, da-da, indeed.\n\nMoulin Rouge! The Musical! opened July 25, 2019, at the Al Hirschfeld Theatre. Tickets and information: moulinrougemusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
