{
  "showId": "the-great-gatsby-2024",
  "outletId": "ew-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://ew.com/the-great-gatsby-review-musical-broadway-8637932",
  "publishDate": null,
  "fullText": "​ \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Great Gatsby review: A glitzy take on F. Scott Fitzgerald's novel that values spectacle over substance\nEva Noblezada and Jeremy Jordan delight as Daisy Buchanan and Jay Gatsby, star-crossed lovers who spark up a secret romance years after they first met.\n\nIf this Broadway season has taught us anything, it’s that the book-to-film-to-musical adaptation pipeline is not only alive, but it’s thriving. In the last two months alone, Water For Elephants, The Notebook, and The Outsiders have all been transformed into productions that have reignited interest in their original texts — or, at least, inspired theatergoers to rent their film versions when they get home. Now, The Great Gatsby is the latest to throw its boater hat into the ring in a lavish new production that, sadly, values spectacle over substance.\n\nBased on F. Scott Fitzgerald’s 1925 novel, The Great Gatsby, which opened at the Broadway Theatre on Thursday, follows bondsman Nick Carraway (Noah J. Ricketts) as he moves to West Egg and becomes neighbors-turned-unexpected-pals with self-made millionaire and resident party god Jay Gatsby (Jeremy Jordan). Plunged headfirst into an ongoing war between new and old money, Nick finds himself joining a plan to help Gatsby reunite with his old flame Daisy Buchanan (Eva Noblezada). The only problem? Daisy is married to the abusive “brute” Tom Buchanan (the stellar John Zdrojeski), setting the pair’s romance on a crash course for disaster.\n\nMatthew Murphy and Evan Zimmerman\n\nDespite having a heavily-dissected novel to rely upon, The Great Gatsby’s book, written by Kait Kerrigan, doesn’t seem to know what it wants to be. Its tone swings wildly back and forth between a dramatic, straight-laced romance between Gatsby and Daisy one moment, and then a wacky comedy peppered with overly raunchy punchlines about testicles, orgies, and characters having loud, bed-squeaking sex behind a wall the next. It eventually finds its footing in the second act as it explores some of the book’s larger themes, but the significant delay causes the musical’s biggest gut-punches to fall flat because most of its characters — aside from Daisy — still remain underdeveloped sketches of themselves.\n\nIts music, written by Jason Howland with lyrics by Nathan Tysen, is similarly a mixed bag. While some songs come off a bit heavy-handed with their references to the text like Daisy and Gatsby’s duet “My Green Light,” there are a handful of solid tracks that offer a fresh and fun spin on the material, like mobster Wolfsheim’s (Eric Anderson) wickedly good “Shady” and Daisy’s poignant rumination on her loveless marriage, “For Better or Worse.” It also certainly helps that Gatsby has some of the best voices on Broadway performing these tracks every evening too — its soaring ballads “For Her” and “Beautiful Little Fool” might not be the strongest songs lyrically, but explode with emotion thanks to Jordan and Noblezada’s incredible vocal performances.\n\nMatthew Murphy and Evan Zimmerman\n\nGatsby’s Tony-nominated leads, Jordan and Noblezada, revel in the whimsical naivety and rampant toxicity that Gatsby and Daisy possess, portraying the couple as obsessed lovers caught within one another’s vortex. Pauly’s Jordan is a feminist firecracker that feels like a breath of fresh air amongst her haughty peers and, despite having his role being heavily stripped back, Rickett still manages to make Nick a witty, steadfast friend that is too pure for this world. When they’re all together onstage, Gatsby explodes with life and energy that can’t be replicated. Seriously, you know a cast is crushing it when their complicated performances make Tom seem like the most understandable guy in the room.\n\nFurther adding to the magic is designer Linda Cho’s dazzling period costumes that, in tandem with Paul Tate DePoo III’s beautiful scenic and projection design, make Gatsby a true visual feast — complete with crackling fireworks, bedazzled flapper 'fits, and cars that frequently go for a spin across its stage. Everything comes together in sparkling detail during Gatsby’s decadent parties, where the musical’s powerful ensemble leaps, sways, and tap dances their way through Dominique Kelley’s energetic choreography. Like Kerrigan, director Marc Bruni struggles with pacing during the first act, but gets into the groove by its second as reality steps in to ruin the group's revelry.\n\nMatthew Murphy and Evan Zimmerman\n\nThose attending Great Gatsby expecting nothing more than a glitzy, glamorous romp through the Roaring Twenties will find themselves satisfied, but others hoping to find a deeper take on the novel's exploration of the American dream, old money versus new money, and love will find themselves feeling adrift. The Great Gatsby is a great big Broadway extravaganza that may dazzle viewers at first but, much like the green light, perfection remains close, yet just out of reach. C+",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 781,
  "archivePath": "data/archives/reviews/the-great-gatsby-2024/ew-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:39:02.747Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "sourceMethod": "scrapingbee"
}