{
  "showId": "the-great-gatsby-2024",
  "outletId": "GUARDIAN",
  "outlet": "The Guardian",
  "criticName": "Gloria Oladipo",
  "url": "https://www.theguardian.com/stage/2024/apr/25/the-great-gatsby-review-broadway-musical",
  "publishDate": "2024-04-25",
  "fullText": "Sorry – we haven’t been able to serve the page you asked for. You may have followed an outdated link, or have mistyped a URL. If you believe this to be an error please report it. The Guardian homepage",
  "isFullReview": false,
  "bwwExcerpt": "e production feels too spic and span by the time it ends: Missing is a mess left behind by the Roaring Twenties excess. I felt the warmth in The Great Gatsby, but it was begging to bring on the heat. Gloria Oladipo, The Guardian: The production splashes in excess, but of the Las Vegas residency kind. Golden-lacquered set pieces and a dizzying projection screen recreate the Gatsby mansion (and a bevy of other locations). The “nouveau riche” mansion isn’t as opulent or lush as one might imagine, feeling closer in spirit to a mega-church. Brian Scott Lipton, Cititour: These errors in judgment are also indicative of who “Gatsby” will work for – and who they won’t. Simply put, if you treasure the novel, don’t come to the theatre. If you’ve never read it (or don’t remember it), you’ll probably be fine. Ultimately, the essence of the story– especially its messages on class differences and moral failings -- are mostly absent from Kait Kerrigan’s book, which mistakes Fitzgerald’s story for a st",
  "originalScore": null,
  "assignedScore": 40,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-GREAT-GATSBY-Opens-On-Broadway-20240425",
  "textStatus": "partial",
  "textWordCount": 39,
  "archivePath": "data/archives/reviews/the-great-gatsby-2024/guardian--gloria-oladipo_2026-01-25.html",
  "textFetchedAt": "2026-01-25T05:19:55.111Z",
  "textIssues": [
    "Word count too low: 39 (min: 300)",
    "Show title not found in text"
  ],
  "textQuality": "excerpt",
  "sourceMethod": "bww-roundup"
}
