{
  "showId": "the-great-gatsby-2024",
  "outletId": "NYDN",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/entertainment/broadway/ny-daily-news-immersive-gatsby-20230626-6qge2vbpvbdxnn5wevaos2plku-story.html",
  "publishDate": "2024-04-25",
  "fullText": "Subscribers are entitled to 10 gift sharing articles each month. These can be shared with friends and family who are not subscribers. Subscribe now! or Sign in to your account. If the measure of any show — and there are worse — is the enthusiasm of the audience, then the “The Great Gastby, The Immersive Show,” the rakish new attraction at the Park Central Hotel is off to a great start. And this palpable excitement did not actually need the show to begin. Outside on Seventh Ave., the line was filled with customers dressed to the nines in Jazz Age flapper gear, sparkly doodads, shimmering accoutrements, even shiny white tails. Longtime critics learn not to trust press-night crowds, but let’s assume the retro fashion show bespoke of the enthusiasm of this American moment for a Gatsbyesque pasquinade. Or maybe it was just the possibility of a cocktail. The bar figures prominently in this show, just as it did at Jay Gatsby’s glam shebang in West Egg. The word “immersive” is an audience pull these days, even if it sometimes functions as code for the absence of human beings and the presence of digitized reproduction of works of art. But in this case, it mostly means that the show, created and directed by Alexander Wright and performed entirely by sentient beings, happens all around the audience sitting and standing in the Park Central’s historic little ballroom, the centerpiece of a real-life hotel that opened within two years of the publication of F. Scott Fitzgerald’s 1925 novel and saw its share of mob rubouts. (There are occasional small-group outings to side rooms, as attendees are pulled away by, say, Nick Carraway or Myrtle Wilson, wishing to impart some information, sotto voce, as it were.) But the main playing space is in a restored spot designed to evoke the Mermaid Room, an art deco 1940s nighterie where many once shook a leg. It features the kind of grand staircase where one can make a memorably extravagant entrance, potentially followed, several martinis later, by an equally ignoble exit. That fancy set of stairs, coupled with a classic 1920-style bar suitable for dancing upon and a mezzanine balcony that stretches all around the room, allows for all kinds of interesting staging and watching possibilities. Nothing here is as intense or startling or risky as at “Sleep No More,” the mysteriously sensual immersive show that pretty much started this craze. But “The Great Gatsby,” which has run in London for some seven years, socially distanced and then not, seeks out a different crowd, many of whom clearly were eyeing each other for the kind of immersion that can lead to a different kind of side room. That crowd, it’s fair to say, generally appears more interesting in the fun milieu than the dark ending, long a curse of commercial entertainment like this. Still, the very solid company certainly commits to the complexity of the whole thing, especially Rob Brinkmann, who plays Nick Carraway with a notably emotional underpinning, and who impressively quietened the room when he unleashed Fitzgerald’s poetic prose on people near the top of the show. The other principal performers are good, too: Jillian Anne Abaya, as Daisy, Shahzeb Hussain as Tom Buchanan and even the venerable Charlie Marcus, putting his musical chops to good use, as do other cast members, as when teaching the audience a simplified version of the Charleston in the middle of Act 1. You get to play a game of Truth or Dare and there are some vocal and musical performances in front of a retro microphone. One might wish for more dramatic focus and a greater sense of events careening to an inevitable doom, a la “Cabaret,’ and, to more my mind, the show could use yet further immersion, as we might as well put the whole hog on Jay’s Long Island barbecue, so to speak. But this is an inventive and intriguingly populist new staging of an iconic novel that already has informed all manner of adaptations. Here, it is genuinely hard to tell the actors from the customers, only the elegant design of Vanessa Leuck’s costumes offers a meaningful distinction. And I was most impressed by the work of a tough stage management person whose job clearly was to spot any and all phones and tell startled people that they did not belong in this environment, even during intermission, and to put them away immediately or take it and themselves way, way outside to the normal world. Cowed souls obeyed. Clearly they were enjoying the party, but they did not want to end up like Myrtle. Subscribers are entitled to 10 gift sharing articles each month. These can be shared with friends and family who are not subscribers. Subscribe now! or Sign in to your account. Three homeless people found dead on NYC streets as deep freeze grips city Natasha Lyonne reveals she has relapsed after nearly 20 years of sobriety Guy Fieri debuts bold ‘new look’ to celebrate his 58th birthday Off-duty NYPD employee arrested for grabbing man’s crotch without consent Missing Long Island teen may have traveled to NYC to meet online friend LGBTQ TikTok star found beaten to death in Thai forest; suspect arrested RICHARD JOHNSON: Mark Epstein has ‘medical evidence his brother was killed’ FDNY union throws support behind family of retired lieutenant shot to death by NYPD cops at Brooklyn hospital Man, 35, stabbed during argument outside Queens sports bar White House shares altered pic of Minnesota protester Nekima Levy Armstrong Cops checked Bronx home where twin boys were found starving, saw no evidence of abuse 5 arrested in shooting of Indiana judge and wife Jameela Jamil labels Blake Lively a ‘suicide bomber’ in private texts to publicist Precinct poacher walks into the 23, strolls out wearing NYPD uniform and carrying cuffs",
  "isFullReview": false,
  "bwwExcerpt": "out with the frenzy of a nighttime soap by Aaron Spelling, without any of the campy self-awareness. There is no ghastly reckoning with the follies of hedonism, just a rapid succession of abrupt ends. Chris Jones, The New York Daily News: That said, this new musical, as penned by Kait Kerrigan with music composed by Jason Howland and lyrics by Nathan Dylan, makes you feel very little, except when Howland’s lush melodies are reaching their climax. Even then, the feelings that flow are more admiration for Howland’s craft than the kind of emotion that flows back into an embrace of story. Emlyn Travis, Entertainment Weekly: Those attending Great Gatsby expecting nothing more than a glitzy, glamorous romp through the Roaring Twenties will find themselves satisfied, but others hoping to find a deeper take on the novel's exploration of the American dream, old money versus new money, and love will find themselves feeling adrift. The Great Gatsby is a great big Broadway extravaganza that may daz",
  "showScoreExcerpt": "“This is an inventive and intriguingly populist new staging of an iconic novel that already has informed all manner of adaptations. Here, it is genuinely hard to tell the actors from the customers, only the elegant design of Vanessa Leuck’s costumes offers a meaningful distinction.”",
  "originalScore": null,
  "assignedScore": 48,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-GREAT-GATSBY-Opens-On-Broadway-20240425",
  "textStatus": "complete",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.925Z",
  "textWordCount": 971,
  "textFetchedAt": "2026-01-25T14:30:31.917Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/the-great-gatsby-2024/NYDN--chris-jones_2026-01-25.html"
}