{
  "showId": "the-great-gatsby-2024",
  "outletId": "NYTHTR",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "https://newyorktheater.me/2024/04/26/the-great-gatsby-broadway-review/",
  "publishDate": "2024-04-26",
  "fullText": "Posted in Broadway , Theater Reviews The Great Gatsby Broadway Review Author: New York Theater Published Date: April 26, 2024 Leave a Comment on The Great Gatsby Broadway Review A musical about the Jazz Age with almost no jazz? A man of mystery who tells us everything in his first song? A critique of wealth in a show whose main pleasure is how expensive it looks? These are lessons that high school students assigned to read F. Scott Fitzgerald’s novel could learn by attending “The Great Gatsby” at the Broadway Theater – lessons in irony. The “Gatsby” on stage is not a reliable adaptation of the book. Too much has been changed, and something essential is missing. A story that one can read as a tragedy exploring class division, corruption, the hollow aftermath of collective trauma &#8212; the dark side of the American dream &#8211;is here mostly reduced to a love story between two beautiful people with unfortunate timing. I’m not sure, frankly, how much this glamorizing would have bothered me if the show had been better. After all, there have been many adaptations of the book (including a previous one on Broadway ) and, now that its copyright has expired, there are likely to be many more (Including another planned for Broadway, ) But, with one exception, this last Broadway musical to open this season is also just not very satisfying to me as a musical, despite (or in part because of) the many ways it strains, loudly, to proclaim itself a quintessential Broadway musical. The one exception is its exceptional visual splendor, in particular Paul Tate de Poo III’s set and projection design, but also Linda Cho’s sparkling flapper costumes. Two gleaming vintage cars (a yellow Rolls-Royce and a blue Pierce Arrow coupe) not only move onto the stage but come accompanied by rapidly changing scenery; The parties explode with fireworks. Not all of it is a deliberate sensory overload &#8212; there’s a contemplative vista of the Long Island Sound with its rippling waves and distant dock’s lone green light – but, yes, the visuals bombard us. So, though, does the music, composed by Jason Howland, who did a similar hit-you-over-the-head score for “Paradise Square.” Most of the songs are meant as showcases for the stars, especially Jeremy Jordan as the mysterious millionaire Jay Gatsby and Eva Noblezada as Daisy Buchanan, his former lover and still full-time obsession, but each of the principal cast members get their own solos or duets: Noah J. Ricketts as the narrator and conscience Nick Carraway, Samantha Pauly as the insouciant Jordan Baker, Sara Chase as the working class mistress Myrtle Wilson, John Zdrojeski, a standout as Daisy’s blunt upper-class husband Tom Buchanan, Paul Whitty as Myrtle’s put-upon gas station owner George Wilson, Eric Anderson as Wolfsheim, Gatsby’s bootlegging partner. Each of these are talented performers with terrific voices, but most of what they sang sounded overblown to me in much the same way. I perked up only during Anderson’s jazzy “Shady” number and the ensemble numbers for the partygoers and flappers accompanied by Roaring Twenties choreography by Dominique Kelley. The Great Gatsby Broadway Theater Running time: 2 hours 30 minutes, including an intermission. Tickets: $50 &#8211; $348 (Digital lottery $45, general rush $40, student rush $25, Details .) Book by Kait Kerrigan; Music by Jason Howland; Lyrics by Nathan Tysen; Based on the novel by F. Scott Fitzgerald; Music arranged by Jason Howland; Music orchestrated by Jason Howland and Kim Scharnberg; Additional arrangements by Daniel Edmonds; Drum arrangements by Chris Jago; Musical Director: Daniel Edmonds Directed by Marc Bruni; Choreographed by Dominique Kelley; Cast: Jeremy Jordan as Jay Gatsby, Eva Noblezada as Daisy Buchanan. Noah J. Ricketts as Nick Carraway, Samantha Pauly as Jordan Baker, Sara Chase as Myrtle Wilson, John Zdrojeski as Tom Buchanan, Paul Whitty as George Wilson, and Eric Anderson as Wolfsheim. Raymond Edward Baynard, Austin Colby, Curtis Holland, Traci Elaine Lee, Dariana Mullen, Ryah Nixon, Pascal Pastrana, Kayla Pecchioni, Mariah Resheg Reives, Dan Rosales, Dave Schoonover, Derek Jordan Taylor, Tanairi Sade Vazquez, Katie Webber, Kurt Csolak, Carissa Gaughran, Samantha Pollino, Alex Prakken, Jake Trammel, and Jasmine Pearl Villaroel. window.getAdSnippetCallback = function () { if ( false === ( window.isWatlV1 ?? false ) ) { // Use Aditude scripts. window.tudeMappings = window.tudeMappings || []; window.tudeMappings.push( { divId: 'atatags-dynamic-belowpost-6973029637380', format: 'belowpost', } ); } } if ( document.readyState === 'loading' ) { document.addEventListener( 'DOMContentLoaded', window.getAdSnippetCallback ); } else { window.getAdSnippetCallback(); } Share this: Share on X (Opens in new window) X Share on Facebook (Opens in new window) Facebook Share on LinkedIn (Opens in new window) LinkedIn Share on Reddit (Opens in new window) Reddit Email a link to a friend (Opens in new window) Email Print (Opens i...",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 55,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:09:42.587Z"
}
