{
  "showId": "the-great-gatsby-2024",
  "outletId": "talkinbroadway-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.talkinbroadway.com/page/world/TheGreatGatsby.html",
  "publishDate": null,
  "fullText": "Theatre Review by Kimberly Ramírez - April 25, 2024\n\nThe Great Gatsby. Book by Kait Kerrigan. Music by Jason Howland. Lyrics by Nathan Tysen. Directed by Marc Bruni. Choreography by Dominique Kelley. Scenic and Projection design by Paul Tate dePoo III. Costume design by Linda Cho. Lighting design by Cory Pattak. Sound design by Brian Ronan. Hair and wig design by Charles G. LaPointe & Rachael Geier. Orchestrations by Jason Howland and Kim Scharnberg. Music direction by Daniel Edmonds. Music produced by Billy Jay Stein for Strike Audio.\nCast: Jeremy Jordan, Eva Noblezada, Noah J. Ricketts, Samantha Pauly, Sara Chase, John Zdrojeski, Paul Whitty, Eric Anderson. Raymond Edward Baynard, Austin Colby, Curtis Holland,Traci Elaine Lee, Dariana Mullen, Ryah Nixon, Pascal Pastrana, Kayla Pecchioni, Mariah Reives, Dan Rosales, Dave Schoonover, Derek Jordan Taylor, Tanairi Sade Vazquez, and Katie Webber, Kurt Csolak, Carissa Gaughran, Samantha Pollino, Alex Prakken, Jake Trammel, and Jasmine Pearl Villaroel.\nTheater: The Broadway Theatre, 1681 Broadway (at 53rd St.)\nTickets: Telecharge.com\n\nFans flocking to this festivity likely studied the source material in high school. The action takes place in 1922, when mysterious self-made millionaire Jay Gatsby establishes his mansion in Long Island's \"new money\" West Egg neighborhood. He throws extravagant parties in hopes of luring his former lover, Daisy Buchanan, who resides with her husband Tom in the \"old money\" East Egg area across the bay. A web of deceit and desire entangles them along with working class couple George and Myrtle Wilson and golfing socialite Jordan Baker. When the relentless pursuit of pleasure and an elusive, idealized past collides with the harsh realities of the present, there are devastating consequences. Daisy's cousin, Nick Carraway, narrates the novel, offering astute reflections on these desperate, decadent characters and the materialistic, classist society in which they dwell.\n\nOn stage, under Marc Bruni's direction, the intricate narrative is stripped down to the plotted events. Kait Kerrigan's book repurposes Nick Carraway (Noah J. Ricketts) from the passive, observant narrator. Here, he's fully integrated into the action with only two direct addresses delivered at the beginning and end–a brief yet faithful Fitzgeraldean frame. Much of the script's dialogue is composed of direct quotes from characters conversing in the original book, with a few modern additions and sensationalized revisions. While the absence of Nick's constant commentary certainly suits the dramatic medium, something feels hopelessly lost in adaptation. As dialogue and song replace the novel's rich descriptive prose, we are left with an unmediated ensemble of impulsive, self-indulgent, rather unsympathetic characters. The result often feels a bit like a soap opera.\n\nCory Pattak's lighting and Paul Tate dePoo III's scenic design seamlessly span dozens of dazzling locales, including Gatsby's ostentatious castle-inspired Art Deco mansion, the golf green beyond the Buchanan's Georgian revival estate, the stifling Plaza Hotel suite, the secret Sugar Hill apartment, and the industrial Queens \"valley of ashes.\" The socioeconomic divide is effectively expressed without words when Tom's blue Pierce-Arrow coupe and Gatsby's yellow Rolls-Royce drive through the smoggy industrial dump, underscored by a minor key change and melancholic discord to convey the bleakness and desolation of the valley of ashes. The novel's most significant symbols are vividly incorporated through captivating designs that travel miles to meet Fitzgerald's evocative descriptions.\n\nLinda Cho's costumes deliver a shimmering array of dress-to-impress details from the era, with some practical twists. The outfits move brilliantly with Dominique Kelley's lively tap and jazz choreography, and pack in plenty of incidental surprises. There's an amusing department store quick change for Myrtle, a trenchcoated chorus of bootlegging gangsters, and Cho works modern magic with spontaneous new looks for a perpetual palazzo pants-wearing Jordan. Threads for a 1917 throwback party feature meticulous World War I officer uniforms and delightful debutante dresses to establish super specific period-within-period precision.\n\nThe musical adaptation boasts an extremely diverse and talented cast while glossing over the intricate layers of intrigue, complexity, and ambiguity surrounding historical circumstances, motives, relationships, sexualities, and racial dynamics. While John Zdrojeski's Tom is suitably brutish, this adaptation eliminates the novel's potent references to white supremacy that are critical to his character, time and place. Gatsby's longing for Daisy comes off as overly literal and obsessive. Intentions are played so narrowly that intimate interactions are reduced to simple conventional couplings that leave no room for subtextual tensions among the principals. While there are earnest efforts to amplify the gender-progressive, jaunty Jordan Baker, the character still falls flat (the capable Dariana Mullen subbed for Samantha Pauly the night I attended). Though Meyer Wolfsheim remains a one-dimensional villain (perfectly played by Eric Anderson), Kerrigan's plot maximizes use of him to organize conflicts coherently through his underground network of bootlegged liquor. No mention of Gatsby's live-in \"boarder\" or Gatsby's father mean missed opportunities to enhance depth and development.\n\nThe haunting finale seems inspired by Fitzgerald's stark social comparison of the debaucherous twenties to a \"conventional and grotesque\" neighborhood night scene painted by El Greco. If we resist being full swept away by the escapist nature of this hedonistic spectacle, we spectators may be struck by a startling glimpse of ourselves, as when looking in a funhouse mirror. It's a mesmerizing yet disconcerting, distorted dance as the party roars on (\"and on and on and on\")...",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 869,
  "archivePath": "data/archives/reviews/the-great-gatsby-2024/talkinbroadway-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T05:15:16.578Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (500): Request failed with status code 500"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "truncated",
  "truncationSignals": [
    "ends_with_ellipsis"
  ],
  "textStatus": "truncated",
  "sourceMethod": "brightdata"
}