{
  "showId": "the-great-gatsby-2024",
  "outletId": "theaterlife-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://theaterlife.com/the-great-gatsby-1-2-2/",
  "publishDate": null,
  "fullText": "April 29, 2024: F. Scott Fitzgerald never really liked The Great Gatsby as the title of his 1925 novel, preferring instead Trimalchio in West Egg, which, wisely, he changed only at the insistence of editor Maxwell Perkins. But even the more accessible title of The Great Gatsby was of little help in making it a hugely popular or even universally admired book, at least during Fitzgerald’s life, which ended in 1940. April 29, 2024: F. Scott Fitzgerald never really liked The Great Gatsby as the title of his 1925 novel, preferring instead Trimalchio in West Egg, which, wisely, he changed only at the insistence of editor Maxwell Perkins. But even the more accessible title of The Great Gatsby was of little help in making it a hugely popular or even universally admired book, at least during Fitzgerald’s life, which ended in 1940. It was only during World War II, when the government purchased a huge consignment as reading material for the troops that it caught on and, subsequently, not only sold millions of copies and was translated into numerous languages, but gained so much critical respect it became part of countless high school curricula, even being considered by many “the great American novel.” Still, in 1926, only a year after its publication, George Cukor directed Owen Davis’s adaptation on Broadway, where it ran a then respectable 113 performances. A silent film version soon followed, but both the theatre and cinema had to wait for the postwar era to witness multiple new stage, film, and broadcast adaptations, including an immersive one staged last year in a Manhattan hotel. The latest attempt is a visually arresting but dramatically and musically unexciting new musical, with book by Kait Kerrigan, music by Jason Howland, and lyrics by Nathan Tysen, now playing at the Broadway Theatre after premiering last year at New Jersey’s Papermill Playhouse. Although not the first musical version (there was one in Budapest in 2011, not to mention a ballet adaptation in Ohio in 2009), it’s the first to reach Broadway. With the book in the public domain since 2021, even more adaptations are likely to be born; in fact, another musical, Gatsby: An American Myth, is scheduled to open soon at the American Repertory Theater. Transforming major novels into successful musicals isn’t unusual, of course, as any number of examples can prove (Show Boat, Oliver!, Les Miz, etc., among the most successful examples), but whether The Great Gatsby succeeds at it is another matter. On the surface, it might seem ripe for musicalization with its strongly romantic plot, wading through a dark undercurrent, involving ostentatious displays of untold wealth, lavish parties, adultery, liberated flappers, illegal booze, gangsters, and jazzy music; Gatsby, of course, takes place during the Roaring Twenties, the so-called Jazz Age, a term Fitzgerald himself helped popularize with his book, Tales of the Jazz Age. But, at intermission, director Marc Bruni’s production had me wondering, why is this even being done? What—aside from immersion in expensive, overwhelming Art Deco sets and projections (by Paul Tate dePoo), elaborate lighting (by Cory Pattak), and glamorous, deliberately overstated period costumes (by Linda Cho)—are we here for? Party revelers dressed in Erté-like designs—elaborate hairdressers included—from the Ziegfeld Follies? Acting that plays to the rafters but generates little company electricity? A leading man with a faux upper-class accent that robs him of believability? Songs that seem to be waiting for their cues, like Gatsby’s “For Her,” rather than emerging naturally from conversations? Music that, no matter how excellently sung (and there are some great voices here), shows itself off rather than illuminating the script? Numbers—like the gangland routine, “Shady”—that do more to fill time (the show runs two and a half hours) than move the plot forward? Other things are equally questionable, like eyepopping scenery that makes Gatsby’s mansion look like he’s living in New York’s long-gone Roxy Theatre movie palace; a supposedly humble cottage rented for $80 a month that most people would pay hundreds more to live in; an emphasis on romance over social themes (such as class consciousness, wealth disparity, and the hollowness of the American dream); a paucity of quality comedy; and vocabulary that can sound more like 2024 than a century earlier. And if this is the Jazz Age, where’s all that jazz? Except, perhaps, during a couple of lively dance sequences, where a whiff of 1920s pastiche might be detected, Jason Howland’s score is mostly generic Broadway, dominated by lush power ballads, none capturing anything like the atmosphere or unique sound of what people were listening to 100 years ago. Dominique Kelly’s choreography give us flashy dance sequences inspired by Gatsby’s parties, with Charleston moves mixed in with energetic but not notably period-style choreography. Here and there the dances resemble 1940s jitterbugging, while there’s also some impressive acrobatic tapdancing by a trio of sequined performers who bring to mind the Step Brothers of the 1930s. As you may recall, The Great Gatsby introduces an innocent young bond salesman from Minnesota named Nick Carraway (Noah J. Ricketts), who serves as narrator. Nick comes to New York and rents an inexpensive cottage in the fictional town of West Egg, Long Island, across the water from the East Egg home of the wealthy, philandering, abusive Tom Buchanan (John Zdrojeski) and his beautiful, maritally unhappy wife, Daisy (Eva Noblezada). Visiting the Buchanans, Nick reunites with his distant cousin, Daisy, and meets attractive golfer Jordan Baker (Samantha Pauly), with whom he establishes a romantic, but doomed, relationship. Tom and Daisy live across an inlet of Long Island Sound that separates them from the fabulous mansion of the dashing Jay Gatsby (Jeremy Jordan), who can see from his home the green light across the water marking the Buchanan’s residence, whose chatelaine he yearns for. Gatsby (né Gatz) is a multimillionaire whose wealth, spent on expensive clothes, extravagant parties, and luxury cars—poses a mystery. Kerrigan’s book makes several minor changes to Fitzgerald’s tale but, for the most part, sticks to the familiar plot, designed to expose America’s preoccupation in the twenties—following victory in World War I and the imposition of Prohibition—with bootleg alcohol, the clash between the noveau riche and old money, fancy automobiles (two classics get plenty of exposure), jazz, and sleekly modern fashions. In the book Gatsby, like Nick, is also from the Midwest, but the show gets a cheap laugh when he identifies California as the Midwest. His money, we’ll learn, comes from bootlegging, a business connecting him to powerful Jewish mobster Meyer Wolfsheim (Eric Anderson), a minor character in the book—based on gangster Arnold Rothstein—who gets significant stage time in the musical. Gatsby was romantically involved with Daisy when he was poor and low class, before she was convinced to drop him and marry the wealthier, upper-class Tom. Gatsby therefore recruits Nick—like him, a veteran of the war—to arrange a meeting with her over tea at Nick’s cottage. Gatsby goes overboard to impress Daisy by decorating the house with flowers, inspiring an over-the-top sequence in the show satirizing Gatsby’s flaunting of his resources but serving only to make him look foolish. Tom’s mistress, portrayed not as overweight and dowdy, as in the book, but as a coarse but sexy bottle blonde, is Myrtle Wilson (Sara Chase, giving one of the best performances). At one point, Tom loses his temper and breaks her nose. Myrtle’s the wife of a hulking grease monkey named George (Paul Whitty), who owns a gas station and repair shop in a rundown area of ash heaps located on the way to the city. Towering over the shop is a decrepit billboard for an oculist, with huge eyes symbolically overseeing all below. In a Manhattan hotel room, Tom and Gatsby have a falling out over the latter’s affair with the ambivalent Daisy, torn between her feelings for each man. On their way back to Long Island, the abandoned Myrtle, wandering on the road, is accidentally run over by Gatsby’s yellow Rolls Royce. Daisy was driving, but Gatsby volunteers to take responsibility. However, Myrtle’s husband, receiving misinformation from the jealous Tom, is convinced that Gatsby was the driver, shoots him dead and takes his own life. Gatsby’s dismally unattended funeral follows. And thus, with two bangs followed by a whimper, ends The Great Gatsby, Broadway’s latest attempt to transfer a famous novel to the musical stage. We will hold our breath until Gatsby: An American Myth arrives in New York, if that happens, to see if it does any better. The Great Gatsby **1/2Broadway Theatre1681 Broadway, NYCOpen runPhotography: Matthew Murphy and Evan Zimmerman",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1424,
  "archivePath": "data/archives/reviews/the-great-gatsby-2024/theaterlife-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:48:36.788Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}