{
  "showId": "the-great-gatsby-2024",
  "outletId": "TMAN",
  "outlet": "TheaterMania",
  "criticName": "David Gordon",
  "url": "https://www.theatermania.com/news/review-a-no-expense-spared-great-gatsby-on-broadway-with-jeremy-jordan-belting-to-the-rafters_1738140/",
  "publishDate": "2024-04-25",
  "fullText": "Financially, the current ethos of almost every industry is \"do more with less.\" Of course, it's impossible to achieve greater results with fewer resources, both in business and in the creation of quality entertainment. So, it's awfully refreshing to see all the proverbial dollar signs gliding on and off the stage in the new musical adaptation of\n\nMuch work has been done by creators Kait Kerrigan (book), Jason Howland (music), Nathan Tysen (lyrics), and Marc Bruni (direction) since the Paper Mill staging last fall, which our critic said, \"\n\nThe protagonist is Nick Carraway, the young idealist who gets swept up in nouveau riche hedonism only to give it all up when he recognizes the callous indifference of the wealthy. Smartly, the writers have restored Nick (Noah J. Ricketts, in a handsome turn) as the central figure, and we once again see the proceedings through his eyes, as he arranges a romantic reunion between Jay and Daisy that has calamitous results for pretty much everyone in their orbit.\n\nKerrigan's script keeps the plates spinning admirably enough, weaving together the doomed affair that Jay has with Daisy, Nick has with disaffected flapper Jordan Baker (the wry Samantha Pauly), Tom Buchanan (John Zdrojeski, a hulking alpha male) has with Myrtle Wilson (Sara Chase, channeling Dorothy Loudon as Miss Hannigan), and the cuckolding of Myrtle's mechanic husband, George (a tenacious Paul Whitty) with surprising stamina. It's hardly the most urbane take on the material, but Kerrigan knows what her baseline task is: refashion Fitzgerald's novel as a melodramatic romance and condense it enough to leave room for songs. She's not going to win awards, but it's done well enough to suit people who can recite the book word for word, and not confuse newcomers.\n\nJordan's acting take on Gatsby is in line with how this production interprets him: no longer an enigmatic man of mystery, Jay Gatsby is a goofball with a weird mid-Atlantic accent who's just in love with Daisy. A scene where he awaits a rendezvous with her is almost out of a farce. I'm not sure if Fitzgerald would condone or even recognize it, but it works in the context of what this show is trying to do.\n\nSurprisingly, Noblezada is a smaller-than-life Daisy, her flame reduced to a flicker as her usual dynamism is dwarfed by everyone else's presence. That, of course, is a deficiency in Bruni's direction — he should have been able to draw a more magnetic and commanding performance out of a leading lady who has given them in other shows, including one at this very theater. That the exceptionally talented Noblezada fades so far into the background is perhaps the biggest disappointment of the whole show.\n\nIn keeping with the excesses of the era, Paul Tate dePoo III has designed a massive and fabulous set of sliding panels, full-sized billboards that drop in from the flies, country house facades, and gilded living rooms. Augmented by his startlingly lifelike projections, there are parts of\n\nGet the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nBroadway performances start on March 27 at the Majestic Theatre.\n\nGet the best deals and latest updates on theater and shows by signing up for TheaterMania&#039;s newsletter today!\n\nBy providing information about entertainment and cultural events on this site, TheaterMania.com shall not be deemed to endorse, recommend, approve and/or guarantee such events, or any facts, views, advice and/or information contained therein.\n\n©1999-2026 TheaterMania.com, Inc. All Rights Reserved.",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": 68,
  "source": "scraped",
  "needsFullText": true,
  "scrapedAt": "2026-01-23T22:00:11.445Z"
}
