{
  "showId": "the-great-gatsby-2024",
  "outletId": "VARIETY",
  "outlet": "Variety",
  "criticName": "Christian Lewis",
  "url": "https://variety.com/2024/legit/reviews/the-great-gatsby-review-broadway-musical-jeremy-jordan-1235981841/",
  "publishDate": "2024-04-25",
  "fullText": "Home Legit Reviews Apr 25, 2024 7:00pm PT &#8216;The Great Gatsby&#8217; Review: Broadway Musical Has Glamour but Little Grit By Christian Lewis Plus Icon Christian Lewis Latest &#8216;Chess&#8217; Review: Lea Michele Reigns as Queen of This Uneven Broadway Revival 2 months ago &#8216;Just in Time&#8217; Review: Jonathan Groff Plays Bobby Darin in a Lackluster Bio-Jukebox on Broadway 9 months ago &#8216;Pirates! The Penzance Musical&#8217; Review: David Hyde Pierce and Jinkx Monsoon Lead a Rollicking, Riotous Reimagination of Gilbert and Sullivan on Broadway 9 months ago See All Matthew Murphy and Evan Zimmerman F. Scott Fitzgerald's 1925 novel &#8220; The Great Gatsby ,&#8221; which captured the roaring twenties with shocking clarity, is a staple of high school curricula and has been immortalized in two famous film adaptations ( in 1974 by Richard Clayton and in 2013 by Baz Lurhman ). It's most remembered for the titular character's lavish parties, though as any good reader of the novel will tell you, the party's are all razzle dazzle — what really matters is what's underneath. The pain, the social climbing, the lack of ethics, and the post-war, orgiastic egoism are what the work is really about. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-variety-article-mid-article-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[300,250],[2,2],[300,251],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); Related Stories &#039;Euphoria&#039; Season 3 Trailer: Zendaya, Sydney Sweeney and Jacob Elordi Return as Rue Battles Drug Dealers, Cassie Becomes a Cam Girl and More",
  "originalScore": null,
  "assignedScore": 72,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:10:22.263Z"
}