{
  "showId": "an-american-in-paris-2015",
  "outletId": "hollywood-reporter",
  "outlet": "The Hollywood Reporter",
  "criticName": "David Rooney",
  "url": "https://www.hollywoodreporter.com/news/general-news/american-paris-theater-review-787479/",
  "publishDate": "April 12, 2015",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "This ravishing new musical manages to honor the beloved 1951 MGM movie while carving out its own distinctive identity, weaving Gershwin songs into a rhapsodic love letter to the City of Light.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This ravishing new musical manages to honor the beloved 1951 MGM movie while carving out its own distinctive identity, weaving Gershwin songs into a rhapsodic love letter to the City of Light.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (32 words)",
  "textWordCount": 420,
  "archivePath": "data/archives/reviews/an-american-in-paris-2015/hollywood-reporter--david-rooney_2026-02-03.html",
  "textFetchedAt": "2026-02-03T08:55:48.230Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wordCount": 420,
  "tierReason": "showNotMentioned — wrong content scraped",
  "playbillVerdictUrl": "http://www.hollywoodreporter.com/review/an-american-paris-theater-review-788025",
  "sources": [
    "web-search",
    "playbill-verdict"
  ],
  "wrongFullText": "The Australian Broadcasting Corp (ABC) says its become the first western media group to operate a Chinese registered web portal after it launched AustraliaPlus.cn on Wednesday in Shanghai, offering a mixture of Australian content aimed at a mainland Chinese audience as well as Chinese living in Australia.\n\nThe portal carries Chinese language stories about Australia covering business, education and travel as well as a selection of ABC English language programs including documentary, drama and children’s fare.\n\nThe service is run in partnership with the Shanghai Media Group, and follows the signing of a free trade agreement between the two nations last year. It also follows the closure of the long running Australia Network pan Asian satellite TV service, on September 2014, after the current conservative government scrapped the service's funding.\n\nABC International chief executive officer Lynley Marshall said AustraliaPlus.cn \"gives the nation an important new gateway through which to connect to millions of Chinese. We now have the ability to engage directly with our Chinese audiences from within China supported by our valued Chinese partners.\"\n\nPresident of the Shanghai Media Group, Madame Wang Jianjun, also welcomed the launch.\n\n“The ABC and the Shanghai Media Group have been long term international partners and we have over the past run TV weeks for each other for many years, and we are making progress on other aspects in our partnership,\" Madame Wang said. \" We warmly congratulate them on this new achievement they have made.\"\n\nWith an eye on the soft diplomacy benefits of the new service, Australian Prime Minister Tony Abbott added: \"the potential for Australia’s relationship with China to grow and prosper has never been greater and the launch tonight is a testament to the high degree of respect for Australia and for the ABC within China.\"\n\nContent on the site includes a focus on Australian lifestyle, travel, studying and doing business in Australia, career opportunities, financial, business and sports news. Australian culture is showcased through programs and stories on ABC International's partners such as the Melbourne Symphony Orchestra and the Queensland Ballet. The site also will also carry the world premiere of the Bobbie the Bear live action kids series – featuring a lavender bear from Bridestowe Estate, Tasmania that's caused a sensation across China.\n\nABC International signed an extended international media agreement with the Shanghai Media Group (SMG), in June last year and currently has 16 syndication and co-production partnerships with Chinese TV, radio and online organizations including CCTV, Beijing TV, China Daily Online, Tencent QQ, Sina and Youku."
}
