{
  "showId": "an-american-in-paris-2015",
  "outletId": "newsday",
  "outlet": "Newsday",
  "criticName": "Unknown",
  "url": "http://www.newsday.com/entertainment/theater/an-american-in-paris-review-thrilling-musical-1.10239712",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/an-american-in-paris-review-thrilling-musical-1.10239712",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Robert Fairchild and Leanne Cope star in \"An American in Paris.\" Credit Matthew Murphy Credit: Matthew Murphy\n\nFrom the first moments of \"An American Paris,\" two things are clear about this new Gershwin musical. First, it is far more than just another Broadway remake of a Hollywood movie. And the ballet world's choreographer Christopher Wheeldon, in his theater-directing debut, has made something special.\n\nJust how extraordinary is unspooled all evening with exuberant, sweeping innovation, dark historical understanding and a big, smart heart. This is the most thrilling dance-driven musical since Twyla Tharp's wordless \"Movin' Out\" in 2002. But \"American in Paris,\" loosely inspired by the beloved 1951 movie, is also a genuine book musical starring ballet dancers -- Robert Fairchild from New York City Ballet and Leanne Cope from The Royal Ballet -- who can also act and sing.\n\nFairchild, as the American GI who stays in Paris to paint after World War II, has the all-American quality that Gene Kelly had as Jerry Mulligan in the movie. But Fairchild is also leading-man handsome, with a dance technique that devours vast expanses of stage space while never losing the unassuming sweetness of the character. If he wants to keep doing theater, he will be unstoppable.\n\nCope, as the budding French ballerina created by Leslie Caron, has a waif's appeal with a grown-up intelligence and a flexible torso that seems to be held together with warm taffy. In this story, deftly written by Craig Lucas, she is adored by three friends -- the ironic Jewish composer (the endearing Brandon Uranowitz), the business-heir who wants to sing (the appealing Max von Essen) and Jerry. None of them knows about each other, so the buddies get to sing \"S' Wonderful\" together about the same girl.\n\nDespite the old-fashioned comedy and breathless romance, the show is not just simple fun. In the menacing all-danced introduction, we see a Paris deeply scarred by the Nazi occupation. People reach out in yearning and are violently pummeled with contradictory emotions about the past.\n\nWheeldon somehow integrates these shadows with the happier exploits of the many interesting characters, putting so many ideas, so many conflicting emotions in a single dance phrase without ever looking fussy. One can see the jazz-humanist influence of Jerome Robbins, the neoclassic audacity of George Balanchine and, not just in Wheeldon's choreography for the final 10-minute ballet, a daring all his own.\n\nHe is partnered, in every changing mood, by the amazing Impressionist-inspired sets of Bob Crowley, panels that move as restlessly as any dancer.\n\nRob Fisher's arrangement of Gershwin's great \"I Got Rhythm\" songs and the more melancholy orchestra music is a canny reflection of the composer's own multiple personalities. That seems perfect.\n\nWHERE Palace Theatre, 1564 Broadway\n\nINFO $47-$147; 877-250-2929 nwsdy.li/paris\n\nBOTTOM LINE thrilling, dance-driven innovation",
  "isFullReview": true,
  "textWordCount": 464,
  "archivePath": "data/archives/reviews/an-american-in-paris-2015/newsday--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:13:53.581Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20210614162600",
  "archiveOrgUrl": "http://web.archive.org/web/20210614162600/https://www.newsday.com/entertainment/theater/an-american-in-paris-review-thrilling-musical-1.10239712",
  "contentTier": "truncated",
  "wordCount": 464,
  "tierReason": "Missing proper ending or other signals"
}