{
  "showId": "lend-me-a-tenor-2010",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2010/legit/reviews/lend-me-a-tenor-1117942267/",
  "publishDate": "April 5, 2010",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "This revival of Ken Ludwig's backstage farce about mistaken identity in the opera world is a well-oiled machine that delivers laughs with clockwork precision.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This revival of Ken Ludwig's backstage farce about mistaken identity in the opera world is a well-oiled machine that delivers laughs with clockwork precision.",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 481,
  "archivePath": "data/archives/reviews/lend-me-a-tenor-2010/variety--marilyn-stasio_2026-02-04.html",
  "textFetchedAt": "2026-02-04T00:31:50.275Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "incomplete",
  "sourceMethod": "brightdata",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "This strident pic hasn't got enough new to say to invade theatrical venues.\n\nRichard A. Clarke, the counterterrorism advisor who publicly apologized for the government’s failure at the 9/11 commission hearings, is given hagiographic treatment in scattershot docu “S.O.S. State of Security: Richard A. Clarke’s Quest for Truth.” As the pic’s overstuffed title suggests, helmer Michele Ohayon’s crams too much in: a career profile of Clarke, analysis of how vulnerable America still is to terrorist attack, and denunciation of wars in Afghanistan and Iraq. Left-leaning auds won’t fail but to agree, but this strident pic hasn’t got enough new to say to invade theatrical venues. Public broadcasters and politically minded fests should offer rescue.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Channing Tatum's 'Josephine,' 'Nuisance Bear' Win Sundance Grand Jury Prizes \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Sundance: Sony Pictures Classics Buys Crowd-Pleasing Drama 'Ha-Chan, Shake Your Booty!' (EXCLUSIVE)\n\nPer her statement, helmer Ohayon (“Steal a Pencil for Me”) was approached by Clarke himself to make a documentary inspired by his 2008 nonfiction tome “Your Government Failed You: Breaking the Cycle of National Disasters.” Presumably, the resulting docu is faithful to the book, since it certainly feels like a promotional effort.\n\nClarke makes cogent points throughout about how the U.S. government let its citizens down and cost lives by failing to heed warnings about threats from Al Qaeda, while archive footage reprises his principled stand before the 9/11 commission. Assorted former colleagues semi-affectionately acknowledge his gruff personality, but by and large, interviewees from the CIA and Dept. of Homeland Security support his stated views on the failure of intelligence that led to the Iraq War and the wastefulness of how money is spent on security.\n\nAll that’s fair enough, but there are too many other strands at play. Various interviewees explain in alarming fashion how the ports of Los Angeles and Boston, for example, still present targets highly vulnerable to attack, as do ordinary shopping malls in Middle America. A liberal Muslim cleric tries to explain how Islam is essentially peace-loving, while his children share their own experiences of bullying in school in the wake of 9/11. A hacker whom Clarke recruited as an advisor when he was czar of cyber-security explains how easily even the most firewalled database in the world could be broken into by a determined guy with a computer.\n\nSequences showing Clarke guiding grad students at Harvard through mock situation-room scenarios seem less germane, and look highly staged for the camera. Frequent shots of Clarke studiously tapping his keyboard or looking thoughtful add tacky, TV-profile flavor.\n\nThat the pic flows at all from one idea to the next is a minor miracle of editing, credited to Edgar Burcksen. That said, the splicing in “S.O.S.” would be more deserving of praise if it didn’t blot its copybook with so many heavyhanded, thumping cutaways to illustrate points with painful literalness. The score by Joseph Julian Gonzalez is bombastic and overbearing."
}