{
  "showId": "a-life-2019",
  "outletId": "newyorker",
  "outlet": "The New Yorker (Vinson Cunningham)",
  "criticName": "Vinson Cunningham",
  "url": "https://www.newyorker.com/magazine/2019/08/19/endgames-in-sea-wall-a-life-and-coriolanus",
  "playbillVerdictUrl": "https://www.newyorker.com/magazine/2019/08/19/endgames-in-sea-wall-a-life-and-coriolanus",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Save this storySave this storySave this storySome plays, proceeding carefully but not all that deftly, exist only to dump a helping of devastation onto the audience’s lap. These tearful noodges remind me of the errant Rube Goldberg machine that cracked me up as a kid when it appeared on the “Tom and Jerry” cartoon on Saturday mornings. Tom the cat, moonlighting as an engineer and promising a “better mouse trap,” rigs up some hyper-complicated doozy, held together by the thinnest string, just outside Jerry’s hole, hoping finally to see the mouse go kersplat. One tug of the cheese sets an alarm clock ringing, then a saw gnawing inanely at a log, churning on and on, a cascade of linked but frivolous effects, until a huge and heretofore unseen safe drops from the sky and lands not on Jerry but on Tom. So much work for the wrong big finish.\n\nThe monologues that make up “Sea Wall/A Life” (at the Hudson, directed by Carrie Cracknell) are two such dubiously useful contraptions. Both halves of the show, not so much acted as presented by Tom Sturridge and Jake Gyllenhaal, take pains—formal, metaphorical, and, God knows, literal—to dredge up feelings of grief and profundity in the audience, and end up missing by inches that feel like miles.\n\nIn “Sea Wall,” by Simon Stephens, a youngish photographer named Alex (Sturridge) talks adoringly about his family—a wife too good to be deserved, a beautiful little girl, and a father-in-law, Arthur, an Army veteran and a former math teacher. Alex and Arthur grow uncommonly close and have gently antagonistic conversations about the existence of God. Arthur believes; he thinks that the centrality in mathematics of the number pi, that infinitely digited marvel, is proof enough. Alex scoffs at that but still loves the guy.\n\nStephens—with an eye, I’m sure, to rhythm, but also pulling the strings of portent—braids these sweetly remembered talks with Alex’s meditations on the nature and power of water: how not to panic while swimming too far from shore; the fierce, unfathomable drop between one underwater depth and another; the time he went scuba diving. We see the heavy ending coming from a nautical mile away.\n\nIf a play, however short, is to be expressed as a monologue, it had better be, on some level, about how the body up there onstage is racked or soothed, moved to dance or to retreat, by the galvanizing organization of syntax, or by syntax’s dissolution under the pressures of thought. You need the character’s presence and the words, grammar—or its pointed absence—and some soul. As Alex, Sturridge does a good job of husking himself as the story goes sour. He gets smaller and smaller before our eyes, and his movements go janky. But, despite the shambling naturalism of his twitches and his line deliveries, nobody really talks the way he does, with painful hesitations acting, surprise, as perfectly placed transitions.\n\n“A Life,” by Nick Payne, with Gyllenhaal as a man grieving for his father as he expects his first child, is similarly, if slightly more inventively, built. Payne flits between the two cataclysms, first with slow precision, and then, as the cruxes approach, back and forth cinematically, the borders showing some slippage. That scene is nicely done—it has some of the motion of good tennis—but it doesn’t lead to much of a revelation. The guy is sad, and so are we. Gyllenhaal is as sensitive as ever, but to little discernible end. Both of these pieces probably want to be prose.\n\nYou might just shrug if the anvil of these plays’ shared desire weren’t so obvious: Cry. Feel. It’s true that a lot of drama these days has a cold-fish quality. Many newer playwrights aren’t much concerned with plucking the strings of the heart; when they try to, the incision is made in the head, not the chest, and the operation goes on perilously from there. But, to the extent that this is a problem, lachrymose exercises like these are more cause than cure.\n\nGrief belongs to all of us. It surfaces much more easily than the other feelings that theatre helps us to clarify and, if we will it, to expunge. And so its treatment onstage requires special care. You have lost and so have I. O.K., fine. Tell me something about it that I’ve never heard: how it looks and sounds, or how to carry it a bit further. (Earlier this year, “Grief Is the Thing with Feathers,” Enda Walsh’s adaptation of Max Porter’s début novel of grief after the loss of a mother, was all over the place, but at least, I thought, it had the courage to explode into total chaos.)\n\nOne indication of the problems of “Sea Wall/A Life” is the set. Off to the side, there’s a piano (the Chekhovian kind: all night you sit there hoping against hope; a very famous song gets mentioned and you draw a breath; then, toward the end, Gyllenhaal inches in its direction and you mutter, “No-no-no-please-no”), and behind it a high brick wall with a ledge like a little roof. Plants push out from a few cracks. It’s . . . maybe an alleyway? A rough piano bar? An intense comedy club’s back wall? Whatever it is—I’ve got nothing against abstraction—it’s emblematic of the show’s unfulfilled hope of making its monologues rise to the level of watchable drama. Sometimes Gyllenhaal and Sturridge interact with the audience; there’s some funny play with the lights. But, seriously, what is this? It feels weird to take the trouble to go to the theatre just to watch Jake Gyllenhaal do a glorified audition. I mean, he’s got the part! Now what?\n\nI found myself thinking about a pair of recently deceased Republicans, John McCain and George H. W. Bush, as I watched the Public’s new rendition of Shakespeare’s “Coriolanus,” directed by Daniel Sullivan at Central Park’s Delacorte. Caius Martius, the titular hero, played with cerebral, kinetic aplomb by the excellent Jonathan Cake, has McCain’s aversion to conventional manners and Bush’s hapless common touch. Like both of them, he’s attracted to politics for reasons he’d be hard pressed to express. His mother, Volumnia (a harsh, cutting, wonderful Kate Burton), certainly wants him to assume the Roman consulship.\n\nCaius relishes battle; it’s riveting to see him rushing onward, coated with somebody else’s blood, ready to meet the Volscians, the invading enemies of his people, in battle, reinforcements be damned. After he leads the victory in the Volscian city of Corioli, he’s renamed in remembrance of the event and put up for the top job. His highborn friends—including the funny Menenius Agrippa, played by Teagle F. Bougere, who makes Elizabethan English sound easy-peasy, the smoothest conversation—try to coax him out of war mode and into the hearts of the people.\n\nThanks to Sullivan’s colorful imagination, all the action takes place in a post-apocalyptic future. The visual language here—rusted metal, bright, thrown-together clothes, the bowing trees in the Park—owes something to the classic music video for Tupac Shakur’s “California Love.” There’s a food shortage in Rome, and the people, led by two rabble-rousing tribunes (Jonathan Hadary and Enid Graham), are particularly peeved with the anti-populist Coriolanus, who, making the hatred reciprocal, wishes to “pluck out the multitudinous tongue.” He wants power but, unabashed aristocrat that he is, can’t force himself to do the song and dance that democracy needs.\n\nIn a nice touch by the costume designer, Kaye Voyce, the commoners wear red-white-and-green flag pins that imply a connection between ancient Rome and modern-day Italy—where popular opinion has recently placed an immigrant-bashing proto-Fascist government in power. In late July, some hundred and fifty migrants, probably hoping to skirt Italy’s inhuman immigration restrictions, drowned in a shipwreck off the coast of Libya. When Coriolanus is driven into exile and, bent on revenge, teams up with his former sworn foe, Tullus Aufidius—played convincingly by Louis Cancelmi—a downbeat message bubbles up into view: Come war or peace, feast or hunger, slow decline or eco-disaster, there will always be politicians, and they will mostly be wolves. ♦",
  "isFullReview": true,
  "textWordCount": 1342,
  "archivePath": "data/archives/reviews/a-life-2019/newyorker--vinson-cunningham_2026-02-03.html",
  "textFetchedAt": "2026-02-03T22:18:56.309Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251102125027",
  "archiveOrgUrl": "http://web.archive.org/web/20251102125027/https://www.newyorker.com/magazine/2019/08/19/endgames-in-sea-wall-a-life-and-coriolanus",
  "contentTier": "complete",
  "wordCount": 1342,
  "tierReason": "Full review text",
  "isMultiShowReview": true,
  "multiShowReason": "Roundup article: 2 other shows mentioned 3+ times (sea wall, the audience)"
}
