{
  "showId": "a-life-2019",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2019/02/theater-review-the-tasteful-goodness-of-sea-wall-and-a-life.html",
  "publishDate": "October 9, 2019",
  "fullText": "Jake Gyllenhaal in Sea Wall/A Life.\n Photo: Joan Marcus\n \n \n \n I’ve written before about the critic’s tricky mandate to take shows on their own terms. It’s tricky because, like so many catchy phrases, it cuts two ways. To take a show on its own terms implies a rigor and a generosity of spirit, a genuine attempt to get inside the machine, to locate what specifically makes this one — as opposed to that one over there — tick, and to start the analysis from there. But by working earnestly and strenuously from the inside, it’s also possible to shrink one’s lens, to ignore the context in which a play sits and the job it’s doing in the wider theatrical environment. Or, to put it anecdotally, I was once chatting with a playwright friend and asked him if he’d caught some National Theatre Live broadcast — something featuring Ian McKellen or Benedict Cumberbatch or someone like that — and he sighed and said no. “I’m just” — and he paused for a moment — “I’m just so tired of Good Actors Acting Well.”\n\nI laughed, but I’ve also never forgotten his words. The point is, part of what any play does is what it does on its own — but, especially in New York City, plays don’t exist in a vacuum, and when you stand staring out across the landscape, it can be distressing to note a certain overarching domesticity of flora and fauna. Sea Wall and A Life — the two monologue plays by Simon Stephens and Nick Payne respectively, now appearing back-to-back as halves of a single show at the Public — are, on their own, elegant, vulnerable pieces of writing. Directed with assured simplicity and without soppiness by Carrie Cracknell, they’re solid examples of their form, mingling the mundane and the cosmological inside the snow globe of intimate personal narrative. They’re also not a particularly intrepid piece of programming. With Tom Sturridge and Jake Gyllenhaal performing the pieces, the gleam of celebrity is enabling the Public to fill its largest theater with a show that, while it might well move us, doesn’t challenge us theatrically. Sea Wall/A Life is going to spur a lot of calls to bring tissues to the theater, and while I feel a little heartless about this, I left dry-eyed. Not because Sturridge and Gyllenhaal aren’t doing tender, deeply felt work — they are — but because while inside the snow globe there are moments of insight and beauty, outside the snow globe, things feel cathartic and safe.\n\nStephens and Payne have both written men in their early 30s grappling with transition and loss — with, as Shakespeare put it, “things dying and things newborn.” Sturridge, performing a piece that Stephens originally wrote for the actor Andrew Scott, is a photographer named Alex, while Gyllenhaal, who often collaborates with Payne, plays a young father called Abe. Under Cracknell’s understated, meticulous direction on an almost bare stage (Laura Jellinek has given it a few key touches: a piano, a ladder to an upper level, a couple of large photo-studio lights, a dressing-room table) each actor works through a story of personal heartbreak and existential quandary. Alex’s comes first: It will rip us apart and Abe’s — less shatteringly tragic though similarly concerned with grieving — will start the healing process.\n\n“I want to acknowledge something,” Sturridge’s Alex tells us abruptly, in the midst of gentle reminiscences about his ex-soldier father-in-law Arthur, his wife Helen, and his daughter Lucy. “It’s embarrassing because I know it’s something that you will have noticed. There’s a hole running through the center of my stomach. You must have all felt a bit awkward because you can probably see it.” He’s not wrong. There’s something strained and shadowed about Alex’s buoyancy, in the little jokes and unfinished phrases that pepper his speech. Long before we discover the awful specifics of his loss, we know he’s been utterly dismantled by grief — that, as he later puts it, he’s “holding [himself] together. The skin and the shell of me.” Alex’s life has tipped over the sea wall, that sudden, unexpected shelf down beneath the waves, where the ocean floor suddenly falls away into bottomless darkness. Alex first discovered it while scuba diving with Arthur: “I had no idea that the bed of the sea was built like that,” he marvels. “I thought it was a gradual slope … Swimming there, with the sun, even bright as it is above us … Even then the darkness of the fall that the wall in the sea reveals is as terrifying as anything I’ve seen.”\n\nStephens’s metaphor is apparent, but Sturridge has a light enough touch — a kind of drifting, scattered lilt — that the image remains graceful and layered. The sea wall is the potential, at any moment, for the brightness and stability of our lives to fall away under our feet, but it’s also, for all its dread, a vaster, more sublime kind of unknown. Alex returns again and again to debates that he’s had with Arthur about God — “Where is he? Is he in the sky? … Is he on the edge of our galaxy? … Is he 15 billion light years away?” In his grief, he clings not to traditional faith, but to a kind of belief in what he calls “the gaps in our knowledge” — the Chekhovian sense that one day, many generations from now, perhaps our descendants will fill in those gaps, and that in the meantime, we keep going. We tread water, sunlight playing on the surface above and endless depths of shadow below.\n\nSea Wall was born of a commission in which Stephens was challenged to write a short play that took place entirely in natural light, and as Sturridge speaks, Peter Kaczorowski keeps the space radiant. It’s a kind of reverse pathetic fallacy: The environment stubbornly refuses to pay heed to the darkness in which Alex finds himself. He wanders tentatively from spot to spot, like a prisoner released into sunlight, squinting against the glare and overwhelmed by the lack of physical boundaries. In contrast, Cracknell keeps Gyllenhaal almost entirely confined to a single spotlight in the dark. As Abe intertwines the stories of his father’s death and his daughter’s birth, his isolation creates a kind of distillation, a merging of these two massive transformations in his life: becoming a father and ceasing to be a son.\n\nAs in his play Constellations — also a response to his own father’s death — Payne plays with linear time, layering timelines on top of one another so that we long remain uncertain as to whether Abe in fact lost his father and met his daughter on the very same night. He didn’t, but Payne is getting at the ways formative events overlap and commingle in our minds, the way beginnings and endings imply one another. Gyllenhaal is at once sharp and fluid, easy in his own skin and agile in his voice. His shoulders just a little hunched, his brow just a little furrowed and about a quarter of a smile hiding in the corner of his mouth — like he’s peering hard into something to try to figure out how it works — he steps lightly between humor and pain, all the weird, ridiculous details of preparing for birth and all the hard, institutional realities of dying. “I don’t understand,” he bursts out in one of the play’s swift zings of insight, “why we prepare so fucking wonderfully and elaborately for birth and yet so appallingly and haphazardly for death.”\n\nAbe’s struggle in A Life is to figure out how to begin to love the living as much as he loves the dead. “I’m no good at this,” he confesses as he tries to cope with his screaming newborn. “It’s too hard. I miss him too much. I don’t know how to give her what she wants.” Like Mike Birbiglia up on Broadway, both Payne and Stephens are feeling their way through fatherhood, through the feelings of estrangement, uncertainty, and uselessness that bubble up when it’s not your body that the kid came out of, when this tiny not-yet-person is put in your arms and suddenly redefines you. Under Cracknell’s steady hand, Sturridge and Gyllenhaal are working like accomplished miniaturists: Painting finely and honestly, if in a mode that’s more likely to jerk tears than it is to push envelopes.\n\nSea Wall/A Life is at the Public Theater.",
  "isFullReview": true,
  "dtliExcerpt": "Though the play has its moments of genuine emotion, particularly in its exploration of family dynamics and the weight of expectations, it ultimately feels more like a well-intentioned therapy session than a fully realized theatrical experience.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Though the play has its moments of genuine emotion, particularly in its exploration of family dynamics and the weight of expectations, it ultimately feels more like a well-intentioned therapy session than a fully realized theatrical experience.",
  "contentTier": "complete",
  "contentTierReason": "Short text (36 words)",
  "previousUrl": "https://www.vulture.com/2019/10/theater-review-a-life-on-broadway.html",
  "urlDiscoveredAt": "2026-02-03T07:49:03.637Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 1413,
  "archivePath": "data/archives/reviews/a-life-2019/vulture--jesse-green_2026-02-03.html",
  "textFetchedAt": "2026-02-03T07:49:03.644Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20191015233751",
  "archiveOrgUrl": "http://web.archive.org/web/20191015233751/https://www.vulture.com/2019/02/theater-review-the-tasteful-goodness-of-sea-wall-and-a-life.html",
  "wordCount": 1413,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-03T11:15:09.759Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about 'Sea Wall/A Life' at the Public Theater, which is an off-Broadway production, not the current Broadway run.; kimi: The review explicitly covers the production at The Public Theater, an Off-Broadway venue ('now appearing back-to-back as halves of a single show at the Public'), not a Broadway theater.",
  "promptVersion": "5.2.0"
}