{
  "showId": "escape-to-margaritaville-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2018/03/15/escape-to-margaritaville-jimmy-buffett-songs-make-a-highly-salted-musical/",
  "publishDate": "2018-03-15T21:00:15",
  "fullText": "If you’re a committed New York Knicks fan, you go to the game in a Knicks shirt. If you’re a life-long New York Rangers fan, you go to the game in Rangers shirt. If you’re a dyed-in-the-wool New York Yankees fan, you go to the game in a New York Yankees shirt, perhaps still with the name Jeter on the back. And if you’re a Jimmy Buffett Parrot Head, you go to a Buffett concert in a Hawaiian shirt—with or without a fake beak hiding your nose.\n\nAs of now that shirt is also what you wear to Escape to Margaritaville, the musical just perched on Broadway after an ironing-out-the-wrinkles tour. Proud in your shirt (no one donned a beak at the performance this reviewer attended), you’re guaranteed to get everything you hoped for from the production, a slam-bang success sure to keep the adored singer-songwriter in Margaritas for some time to come.\n\nDirector Christopher Ashley—who’s proved he knows how to make a tuner work like gangbusters with Tony-Award winners Come From Away and Memphis as well as Xanadu and the underrated Leap of Faith—proves his prowess with Escape to Margaritaville, which’ll definitely be a Tony nominee in this season of too few new musicals.\n\nAlong with the easy-going, let’s-all-get-drunk Buffett songs, the major contributors to this happy success are bookwriters Greg Garcia and Mike O’Malley, who sharpened their skills on television series like “Yes, Dear” and “My Name is Earl.” Their creditable contribution is closely examining Buffett’s lyrics and finding clever ways to work them into a loosely-based-on-Buffett’s-life plot wherein singer-slacker Tully (sexy, charming Paul Alexander Nolan) and reluctant vacationing scientist Rachel (sexy, strong Alison Luff) meet and instantly look made for each other.\n\nWhat keeps them apart longer than many rom-coms would have had the nerve to maintain are Tully’s desire to waste blissfully away at the Margaritaville hotel, a life style at odds with Rachel’s compulsive work ethic. She’s committed to collecting soil from a temporarily quiet Caribbean volcano for creating a new beneficial food. He just wants to sing the tunes he writes for his own amusement and for transient good-time seekers.\n\nAs Tully and Rachel back-and-forth, they’re helped by good pal Brick (the earthy Eric Petersen) and Tammy’s bff Tammy (the strong Lisa Howard). Others on hand for romantic encouragement are hotel-bar owner Marley (stern Rema Webb) and hotel-bar hanger-on J.D. (amusingly world-weary Don Sparks.)\n\nNotice that Rachel’s interest in volcano dirt and dust conjures Buffett’s “Volcano.” How Garcia and O’Malley mine the ditty for significant volcano developments (and effects by set designer Walt Spangler, lighting designer Howell Binkley, and sound designer Brian Ronan) is delightful.\n\nAnd that’s not where the lyric plumbing ends. How they play on the catchy likes of “My Head Hurts, My Feet Stink and I Don’t Love Jesus,” “Grapefruit –Juicy,” “He Went to Paris,” “We Are the People Our Parents Warned Us About” is the best example of a jukebox musical maximizing a songwriter canon since ABBA’s Mamma Mia. Moreover, it looks to have the same long-run potential.\n\nFor “Cheeseburger In Paradise” director Ashley enhances it as one of two sequences calling on Flying by Foy for their wire-belt attachments. Numbers of other numbers are extended as choreographer Kelly Devine’s keeps the troupe shaking their moneymakers. The imaginative creators have even figured out a way to include a tap dance in a story where sand is a more expected element.\n\nSince Buffet likely wasn’t thinking about dance breaks when writing his Southern comfort songs (some new ones here), he’s lent the soothing oeuvre to Michael Utley for orchestrations, Gary Adler for dance music arrangements, Mac McAnally for music consulting, Michael Keller and Michael Aarons for music consulting, and very much to Christopher Jahnke for music supervision, vocal and incidental music arrangements and additional orchestrations. Each of them has been commendably true to the relaxed Buffett spirit.\n\nSpeaking of breakouts, it’s certainly true of Jack LaLanne-buff Nolan, who made a strong impression in the short-lived Steve Martin-Edie Brickell Bright Star and now establishes himself as, okay, a bona fide bright star. Ruff, who has a natural sparkle, is going places, too, although she’ll be staying right here for lucky audiences during the next while.\n\nAlso keep this in mind: Laidback and kickbacked as Escape to Margaritaville is, it’s vigorously up-to-date on the Time’s Up agenda. A late storyline twist works forcefully as a bow to women today who want to make it on their own before tying any knot.\n\nEscape to Margaritaville opened March 15 at the Marriott Marquis for an open-ended run. Tickets and information: escapetomargaritaville.com.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars"
}
