{
  "showId": "escape-to-margaritaville-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2018/03/15/escape-to-margaritaville-this-concoction-barely-hangs-on/",
  "publishDate": "2018-03-15T21:00:34",
  "fullText": "One of the truly stirring moments in the musical theater canon comes at the end of Act 1 of Sunday in the Park With George, as Sondheim’s score swells and the painting Parisians we’ve met over the previous 80 minutes arrange themselves into “A Sunday on La Grande Jatte.” The music and the moment align; George has put it together.\n\nThe effect is similar in kind, if not in transcendence, when we reach the first act closer of Jimmy Buffett’s Escape to Margaritaville, which opens tonight at the Marquis Theatre. Ah yes, you realize as the on-stage band, inevitably and finally, breaks into “Margaritaville.” That’s why the old man drinks stale, decades-old beer, so he can toss aside his pop-tops. And that’s why the burly bartender made clear he was so black-out drunk he didn’t recall getting his brand-new tattoo. It’s why the old man salts all his food, always looking for his missing shaker. And it’s why the heartbroken leading man is seeking solace by nibbling on spongecake. They’re all just wasting away in Margaritaville.\n\nAnd you realize something else: Art isn’t easy.\n\nEscape to Margaritaville is perfectly pleasant but not especially good, a watered-down, mostly flavorless, machine-made frozen concoction that does enough to remind you of a better version of itself that you’re left satisfied by default, for lack of another option. You hang on, barely. As directed by Christopher Ashley, who won the best director Tony last year for the equally saccharine—but somehow more genuinely saccharine—Come From Away, it is trying so hard to show you a good time, while also trying so hard to stay true to its tell-it-like-it-is roots, that its tone approaches that of kindergarten class full of goofy uncles: Everything is happy and eager and oh so excited, and also there are Viagra jokes.\n\nGreg Garcia and Mike O’Malley, experienced TV writers, have crafted a script that uses a straightforward love story as a skeleton for two dozen or so Buffett classics. There’s a live beach band on stage, and, as their Buffett stand-in, the hunky Paul Alexander Nolan, playing a sandy-haired beach-bum singer named Tully Mars, guitar slung over his shoulder. There is also his love interest, Rachel, played by a lovable Allison Luff. She arrives on his island a workaholic control freak, and thus the plot is immediately clear.\n\nNolan is winsome and handsome, and he has the musical chops to pull off the rock-star role. Luff is perky and self-assured, and almost manages to sell her character, a hard-charging businesswoman-environmentalist desperately seeking venture financing for her plan to combine potatoes with volcanic ash and thus create limitless, no-emissions power. (I kept waiting for this to be another elaborate set up for a lesser-known Buffett song, “Let’s French Fry and Ketch Up,” or some such. It’s not.)\n\nBut that first act is so obvious, and so labored, that it turns awfully tedious. Its plot is a foregone conclusion, and despite both the high-energy choreography (Kelly Devine, gave Come From Away its Irish-step-dancing Canadians, has created some remarkably kinetic slackers) and crowd-pleasing numbers, it lumbers on. Even the friendly Parrotheads in front of me seemed unmoved.\n\nThe second act is better, because, having already preached the gospel of laidbackedness, Margaritaville finally allows itself to have some fun. After their island is devastated by an inconvenient volcano in the final moment of Act One—deus ex magma, you might say—Tully and his pals take off by rickety aircraft for Cincinnati, Rachel’s home. He has to prove his love to Rachel, and plus his best friend, that bartender, Brick (a funny if thin-voiced Eric Peterson), is in love with her best friend, Tammy (Lisa Howard, excellent as always).\n\nAnd so we get a goofy flight in old J.D.’s old airplane, an inspired fantasy tapdance from Brick, simply because he always wanted to tap dance, and a charmingly goofy “Cheeseburger in Paradise,” when Tammy final gives up on the diet her oaf of a fiancé has forced upon her.\n\nIn this second act, finally, is when the Parrotheads around me started singing along.\n\nA lengthy and delightful recent New York Times profile of Buffett, in anticipation of this show, mentioned that that’s what happens at his concerts: “It was in a unified hum, reminding Mr. Buffett of the recitation of prayers in church during his altar boy days,” wrote reporter Taffy Brodesser-Akner, describing the communal reverence.\n\nThat reverence arrives here, too, a bit. It gives the fans something to go home with. There’s just not a lot of it. For all Margaritaville‘s carefully engineering to appeal to Buffett fans’ pleasure centers, there’s relatively little pleasure to be had.\n\nIndeed, that same Times profile detailed Buffett’s dedication to delivering to his fans a consistently on-brand, consistently good time. He talked of his desire to turn the Marquis into a big beachfront party, to take advantage of the surrounding Marriott hotel to make it sprawling tailgate.\n\nBut the reality at this mediocre simulacrum of escape is that a few scattered Adirondack chairs give the hotel’s mezzanine of only the barest hint of simulacrum of beachfront tailgate. Otherwise, it’s the usual Marriott lobby, with posters on easels opposite the theater entrance pointing the way to the adjacent Montessori Model United Nations Conference Luggage Check. One hopes the baggage, at least, is having a stimulating and creative learning experience.\n\nEscape to Margaritaville opened March 15 at the Marquis Theatre. Tickets and information: escapetomargaritaville.com.",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "2/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
