{
  "showId": "escape-to-margaritaville-2018",
  "outletId": "san-diego-gay-and-lesbian-news",
  "outlet": "San Diego Gay & Lesbian News (Jean Lowerison)",
  "criticName": "Jean Lowerison",
  "url": "http://sdgln.com/entertainment/2017/06/02/theater-review-escape-margaritaville",
  "playbillVerdictUrl": "http://sdgln.com/entertainment/2017/06/02/theater-review-escape-margaritaville",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": null,
  "isFullReview": true,
  "textWordCount": 400,
  "archivePath": "data/archives/reviews/escape-to-margaritaville-2018/san-diego-gay-and-lesbian-news-jean-lowerison--jean-lowerison_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:56:28.008Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "ends_with_ellipsis"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Show title not found in text"
  ],
  "showNotMentioned": true,
  "wrongFullText": "In the competitive world of online gambling, a cash back online casino offers players a unique advantage. By providing players with a percentage of their losses back, cash back online casinos create an enticing environment for both new and seasoned… When it comes to Casino Online Best Bonuses, players are always on the lookout for the most rewarding offers. The online gambling landscape is incredibly competitive, making it essential for casinos to provide enticing bonuses to attract and retain players.… In today’s digital age, the option to play casino game online has transformed the gambling experience for millions. With just a few clicks, players can access a vast array of games from the comfort of their homes. The ability to… Online Casino Mit Echtgeld: Die Zukunft des Spiels In der Welt des Glücksspiels hat sich das Online Casino mit Echtgeld zu einer der beliebtesten Optionen für Spieler entwickelt. Die Möglichkeit, bequem von zu Hause aus zu spielen, zieht immer mehr… Fanduel PA Online Casino has emerged as a leading platform for online gaming enthusiasts in Pennsylvania. With its user-friendly interface and a wide array of gaming options, Fanduel PA Online Casino appeals to both seasoned players and newcomers alike. Whether… Barstool Online Casino is rapidly emerging as a frontrunner in the world of digital gambling. With its user-friendly interface and a wide array of games, Barstool Online Casino caters to both novice and seasoned players alike. The platform offers an… Legales Online Casino Deutschland has become a hot topic among gaming enthusiasts in recent years. With the recent changes in regulations, players are now more interested in finding out what makes a casino legal in Germany. Legales Online Casino Deutschland… Spinyoo Online Casino has rapidly become a prominent player in the world of online gaming. With its extensive selection of games, user-friendly interface, and enticing bonuses, Spinyoo Online Casino offers an experience that appeals to both novice and seasoned players.… When it comes to finding the best online casino low deposit, players are increasingly seeking platforms that allow them to enjoy their favorite games without breaking the bank. The concept of a best online casino low deposit is appealing to… In the world of online gaming, Casino Online Cu Bani Reali has emerged as a popular choice for players seeking excitement and the chance to win real money. The allure of Casino Online Cu Bani Reali lies in its convenience,…",
  "contentTier": "needs-rescrape",
  "_showNotMentionedDiscoveryAttempted": true
}
