{
  "showId": "escape-to-margaritaville-2018",
  "outletId": "usc-guardian",
  "outlet": "USC Guardian (Chloe Esser)",
  "criticName": "Chloe Esser",
  "url": "http://ucsdguardian.org/2017/06/04/play-review-escape-to-margaritaville/",
  "playbillVerdictUrl": "http://ucsdguardian.org/2017/06/04/play-review-escape-to-margaritaville/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Flip or flop: Ranking (almost) every Chobani Flip flavor Admissions report finds academic preparedness deficiencies in incoming UCSD students Triton U-Pass referendum passes A Barista’s Guide: Best cafes in San Diego With beaches, tropical scenery and the titular beverage, “Escape to Margaritaville” aches of summer. It’s a blissful escape from the mundanity of a fast-paced world as vacation grows closer each day. This musical, set to premiere on Broadway in 2018, has begun its run at the La Jolla Playhouse. Composed by acclaimed musician Jimmy Buffett, the play features a variety of new songs written specifically for the show, as well as homages to Buffett’s old hits, such as “Margaritaville” and “Cheeseburger in Paradise.” The plot of the show itself is very much representative of the relaxing, beachy feel of Buffett’s work, telling the story of a lively, though admittedly sketchy, island resort. Acoustic-guitar-wielding ladies’ man Tully (Paul Alexander Nolan) makes his living playing for the patrons of the resort and resides happily in a perpetual cycle of vacation with new guests, new girls and few obligations in a life afloat in the interim reality of island time. However, when work-a-holic Rachel (Alison Luff) visits the island for a friend’s bachelorette party, worlds clash in a wacky and witty celebration of both escapism and committing to the things that matter. The show is defined by its snappy humor, keeping the audience laughing throughout the production. There is a feeling of camaraderie and connection between the audience and those on stage. The fourth wall is broken from time to time (such as when one character calls on the audience to sing some of the dirtier lyrics to Buffett’s “Why Don’t We Get Drunk”), but it is mostly leaned on more than anything else, alluded to with the occasional one-liner that creates a collective good feeling of being in on the joke without laying it on too thick. While the dialogue does occasionally feel a little stilted when trying to incorporate some of Buffett’s past hits, the feeling of awareness, that some of the bigger reaches are all part of the joke, makes this forgivable. The sets are fairly simplistic but at times gorgeous — the lush vegetation on top of the volcano particularly striking. This degree of minimalism seems to complement the way blocking occasionally plays with the audience’s sense of perspective, such as a scuba diving scene which takes place mid-air and layers on top of the action of characters on land. “Escape to Margaritaville” is a fun ride with a variety of hilarious characters, catchy songs and compelling storylines. It begs the question: Does vacation ever truly have to end? Is it possible to live a fulfilling life away from the stresses of the rest of the world, in that blissful state of in-between, or is a return to the rat race always an inevitability? This is only vaguely answered; ultimately, the ending seems to rush through its final pieces of development in a montage-like number that feels more like it should be an act of its own. “Escape to Margaritaville” chooses to focus on the overall feel-good vibe of the story in the end rather than delving into some of the bigger questions raised. But hey, that’s what vacation is for. Grade: A- Director: Christopher Ashley Writers: Greg Garcia, Mike O’Malley Starring: Paul Alexander Nolan, Alison Luff, Lisa Howard Runs: May 9 – July 9 Location: La Jolla Playhouse Photo Courtesy of Matthew Murphy",
  "isFullReview": true,
  "textWordCount": 576,
  "archivePath": "data/archives/reviews/escape-to-margaritaville-2018/usc-guardian-chloe-esser--chloe-esser_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:56:35.255Z",
  "originalScore": "A",
  "originalScoreNormalized": 93,
  "scoreSource": "letter-grade",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "contentTier": "complete",
  "wordCount": 576,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-04T05:52:45.567Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This review is of the La Jolla Playhouse production before the Broadway run, not the current Broadway production that premiered in 2018.; openai: The review is about the production of 'Escape to Margaritaville' at the La Jolla Playhouse, not the current Broadway run.; gemini: This review is for the pre-Broadway run at La Jolla Playhouse, not the Broadway production.; kimi: The review explicitly covers the pre-Broadway tryout at La Jolla Playhouse ('has begun its run at the La Jolla Playhouse'), not the current Broadway production.",
  "promptVersion": "5.2.0"
}