{
  "showId": "700-sundays-2013",
  "outletId": "amny",
  "outlet": "amNewYork",
  "criticName": "Matt Windman",
  "url": "http://www.amny.com/urbanite-1.812039/theater-review-700-sundays-4-stars-1.6431425",
  "publishDate": null,
  "fullText": "Photo credit: Billy Crystal in \"700 Sundays\"\n\nDozens of autobiographical one-person shows have come and gone since Billy Crystal stormed Broadway in 2004 with \"700 Sundays,\" his Tony-winning tribute to his father, who died of a heart attack when Crystal was just 15 years old, and growing up in Eisenhower-era Long Island with an unshakable desire to become an entertainer.\n\nSeeing as few of these shows, if any, have surpassed Crystal's heartwarming and hilarious tour de force, it's a pleasure to have it return for a run before the \"Les Miz\" revival takes over the Imperial Theatre.\n\nThe show's title refers to the fact that Crystal really only got to spend time with his father -- a proud jazz connoisseur who worked multiple jobs -- on Sundays. Hence, he spent roughly 700 Sundays with his father during his life.\n\nWith the façade of a plain suburban house in the background, Crystal manages to hold the audience in the palm of his hand for 21/2 hours, even during the somber portions of Act Two.\n\nCrystal's masterful storytelling is neatly integrated with observational and lowbrow humor and selections from photo albums and home movies. With childlike enthusiasm and tremendous physical energy, he offers impressions of all his family members and his younger self.\n\nIt can be assumed that director Des McAnuff (\"Jersey Boys\") played a significant role in shaping the material and its presentation, as this easily could have turned out too messy, schmaltzy or self-indulgent.\n\nSince it's unclear if Crystal will do the show again, it really ought to be preserved on film. How about it, HBO or PBS?\n\nIf you go: \"700 Sundays\" plays at the Imperial Theatre through Jan. 2. 249 W. 45th St., 212-239-6200, telecharge.com.\n\nadvertisement | advertise on am New York\n\nHave a comment or news tip? We want to hear it! Find us on Twitter and Facebook.\n\nadvertisement | advertise on am New York\n\n240 W 35th St.,\n9th Floor NY, NY 10001\n646.293.9499 | Fax: 212.239.2828\nContact Us thoughts@am-ny.com",
  "isFullReview": true,
  "bwwExcerpt": "Dozens of autobiographical one-person shows have come and gone since Billy Crystal stormed Broadway in 2004 with \"700 Sundays,\" his Tony-winning tribute to his father, who died of a heart attack when Crystal was just 15 years old, and growing up in Eisenhower-era Long Island with an unshakable desir...",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-700-SUNDAYS-Opens-on-Broadway-Updating-LIVE-2013",
  "bwwThumb": null,
  "showScoreExcerpt": null,
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "rejectedAt": "2026-02-06T01:41:25.223Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: This appears to be a truncated opening paragraph that provides only biographical context about Billy Crystal and his previous show, with no evaluative content about the current production being reviewed.; openai: The text provided is a historical context about Billy Crystal's show '700 Sundays' and does not contain any evaluative content about the current Broadway production.; gemini: The provided text is incomplete and doesn't offer any evaluative statements about the show. It's mostly background information.",
  "promptVersion": "5.2.0",
  "duplicateOf": "amny--unknown.json",
  "textWordCount": 334,
  "archivePath": "data/archives/reviews/700-sundays-2013/amny--matt-windman_2026-02-06.html",
  "textFetchedAt": "2026-02-06T14:49:43.022Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20131114035844",
  "archiveOrgUrl": "http://web.archive.org/web/20131114035844/http://www.amny.com/urbanite-1.812039/theater-review-700-sundays-4-stars-1.6431425",
  "wordCount": 334,
  "tierReason": "Full review text"
}