{
  "showId": "700-sundays-2013",
  "outletId": "ew",
  "outlet": "Entertainment Weekly",
  "criticName": "Unknown",
  "url": "http://www.ew.com/ew/article/0,,20364394_20755365,00.html",
  "playbillVerdictUrl": "http://www.ew.com/ew/article/0,,20364394_20755365,00.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Billy Crystal loves to command a stage. In a laugh-out-loud  if quite long  revival of his 2004 one-man, autobiographical show 700 Sundays, you can practically hear his heart soaring as he recounts wacky and sentimental stories about his childhood. (The title refers to the number of Sundays Crystal had with his father, a jazz-loving record store owner, before he died of a heart attack.)\n\nSure, some of it feels like Old Jew Telling Jokes, but Crystal knows his audience and he kills with lines like ''Bris is the prefix for brisket'' and ''Yiddish is a combination of German and phlegm.'' Some of the script (comic Alan Zweibel provides ''additional material'') has been updated in the decade since Crystal last worked a Broadway stage, and now offers references to Obamacare, Rand Paul, and Osama bin Laden. (Crystal imagines that if the terrorist showed up in the Catskills in the 1950s, the Jewish mothers would ask if he was single.)\n\nMany of the stories are riveting (I could hear a whole show about Billie Holiday, a pal of Billy’s father, taking a young Billy to see his first movie, Shane). Others drag on for too long (Crystal looooves a fart joke). Still, it's hard to begrudge the guy, who, at the show I attended, was so eager to stay in the spotlight after two-and-a-half hours that he continued telling stories after a long standing ovation and even did some impressive-for-a-grandfather moves. ''I'm the only 65 year old doing cartwheels on Broadway!'' he said, beaming. That's true, and no one loves that fact more than he does. A-",
  "isFullReview": true,
  "textWordCount": 267,
  "archivePath": "data/archives/reviews/700-sundays-2013/ew--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:25:50.724Z",
  "originalScore": "D",
  "originalScoreNormalized": 35,
  "scoreSource": "letter-grade",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "incomplete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140122100310",
  "archiveOrgUrl": "http://web.archive.org/web/20140122100310/http://www.ew.com/ew/article/0,,20364394_20755365,00.html",
  "textIssues": [
    "Word count too low: 276 (min: 300)"
  ],
  "contentTier": "truncated",
  "wordCount": 267,
  "tierReason": "Short text (267 words)"
}