{
  "showId": "700-sundays-2013",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Charles Isherwood",
  "url": "https://www.nytimes.com/2013/11/14/theater/reviews/billy-crystal-brings-700-sundays-back-to-broadway.html",
  "publishDate": "November 13, 2013",
  "fullText": "Songs can get stuck in your head, but what about jokes?\n\nMany would argue that comedy depends so much on surprise that repetition can hurt it. But then how would you explain the crowds at the Imperial Theater that are roaring with laughter at Billy Crystal’s old-school charm in “700 Sundays”?\n\nSure, they might have missed the hit monologue the last time it was on Broadway, in 2004. Maybe they never bought the book version or saw the national tour in 2009. It’s also possible that they didn’t hear Mr. Crystal do some of the same impressions or tell identical stories on his 1985 comedy album “Mahvelous.”\n\nBut my suspicion is that familiarity here is not a bug, but a feature. The core pleasures of this warmly affectionate portrait of a New York childhood involve nostalgia and sentiment, the sex and violence of today’s Broadway.\n\n“Yiddish is a combination of German and phlegm” is not the freshest joke, but who cares? It’s funny when delivered with the polish of a borscht belt veteran, and if you didn’t like that line, don’t worry: Another’s coming fast.\n\nWith Mr. Crystal, jokes move quickly; everything else is slow. The show rambles for two-and-a-half easy-to-trim hours.\n\nMr. Crystal, who is 65 but looks about a decade younger, has never been a comedian who reflects his era. On “Saturday Night Live” he was wonderful playing older men or show business figures from yesteryear. His greatest movie, “When Harry Met Sally” (Meg Ryan has never had a better comedic foil, not even Tom Hanks), revealed how time can make our younger selves look silly. And Mr. Crystal’s stature as a master M.C., most famously for the Academy Awards, is built on amiable charm and a little song and dance that seems like it’s from a show-business yesteryear.\n\n“700 Sundays” is itself a love letter to the past. The set approximates his childhood home in Long Beach, N.Y., and features home movies projected onstage. While he does make two topical jokes (one about Obamacare, another about Senator Rand Paul), he is surely the only comedian in New York still using Mamie Eisenhower as a punch line. Instead of focusing on backstage stories, Mr. Crystal uses his facility at performing broad yet specific characters to evoke domestic scenes, including an animated family fight done in mime.\n\nAt the show’s heart, which is worn on its sleeve among other places, is an adoring portrait of his father, who died when Billy was 15. (The title is a reference to the number of Sundays he spent with him.) Jack Crystal helped run a record store in Times Square and produced concerts by jazz greats like Billie Holiday. His father here comes off as funny, loving, supportive. Mr. Crystal tells a story of his standing up to a mobster and later describes him as generous with the musicians he worked with.\n\nAll the reverent stories don’t add up to a flesh-and-blood character. Jack Crystal remains remote, larger than life, which may be where Mr. Crystal wants to keep him. It’s the kind of show that you wish your son made about you.\n\nMr. Crystal has been a star for so long and in so many arenas that he feels like family. When he did an old bit about his glands bossing him around as a sex-obsessed teenager, I chuckled not just because his timing was precise but also because I recall listening to the same jokes on a cassette over and over as a kid.\n\nBack then this sweet story seemed a tiny bit dirty and I had yet to encounter countless jokes built on the tyranny of the male libido. The jokes may not seem as funny today, but reliving those early laughs is its own potent pleasure.\n\nBecause of an editing error, a theater review on Thursday about “700 Sundays,” Billy Crystal’s one-man show about his childhood and his father, Jack, referred incorrectly to Jack Crystal’s work as a producer. He produced concerts, not records.\n\nWhen we learn of a mistake, we acknowledge it with a correction. If you spot an error, please let us know at corrections@nytimes.com.Learn more",
  "isFullReview": true,
  "dtliExcerpt": "Mr. Crystal's engaging evening of reminiscence about his childhood in Long Beach, his family's influence on his career in comedy and his relationship with his father, who died when Billy was 15.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "Mr. Crystal's engaging evening of reminiscence about his childhood in Long Beach, his family's influence on his career in comedy and his relationship with his father, who died when Billy was 15.",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "previousUrl": "https://www.nytimes.com/2013/11/14/theater/reviews/billy-crystal-in-700-sundays-at-imperial-theater.html",
  "urlDiscoveredAt": "2026-02-06T01:32:38.356Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 690,
  "archivePath": "data/archives/reviews/700-sundays-2013/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T03:50:14.983Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "archiveOrgTimestamp": "20251018193148",
  "archiveOrgUrl": "http://web.archive.org/web/20251018193148/https://www.nytimes.com/2013/11/14/theater/reviews/billy-crystal-brings-700-sundays-back-to-broadway.html",
  "duplicateTextOf": "nytimes--ben-brantley.json",
  "wordCount": 690,
  "tierReason": "Full review text",
  "duplicateOf": "nytimes--ben-brantley.json"
}
