{
  "showId": "the-present-2017",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "https://www.vulture.com/2017/01/theater-review-the-present.html",
  "publishDate": "January 9, 2017",
  "fullText": "The Present is a comedy of manners that turns into a tragedy of bad manners, and then into something else entirely: a mirror held up to our own social pretenses.",
  "isFullReview": false,
  "dtliExcerpt": "The Present is a comedy of manners that turns into a tragedy of bad manners, and then into something else entirely: a mirror held up to our own social pretenses.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "... if the politics of this Platonov revamp are apt enough, the drama still founders on the play's inability to link them convincingly to the nearly farcical social comedy of individuals at loose ends. Partly this is because the production, directed somewhat bumpily by John Crowley, keeps the politics at bay for too long while it focuses on the radiating damage an empty man can cause at great removes, like a storm surge. We do not really understand the stakes until it's too late, which may be accurate for the characters but undermines the audience. Chekhov's famous dramaturgical dictum - 'one must never place a loaded rifle on the stage if it isn't going to go off' - is meticulously observed here; the General's old pistol is all but spotlit throughout. But however much damage it finally causes, it isn't enough to turn The Present, which operates best as a comedy, into the tragedy it seems to wish it were. It would take Chekhov another 20 years to figure out how to make the two things into one.",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "The Present is a comedy of manners that turns into a tragedy of bad manners, and then into something else entirely: a mirror held up to our own social pretenses.",
  "contentTier": "truncated",
  "contentTierReason": "Short text (30 words)",
  "textQuality": "truncated",
  "bwwScore": 5,
  "sources": [
    "web-search",
    "bww-reviews"
  ]
}
