{
  "showId": "the-roommate-2024",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani Samuel",
  "url": "https://www.broadwaynews.com/the-broadway-review-jen-silvermans-the-roommate-is-bolstered-by-its-stars/",
  "publishDate": "September 13, 2024",
  "fullText": "Review — The Roommate The Broadway Review: Jen Silverman’s ‘The Roommate’ is bolstered by its stars Megawatt performers Patti LuPone and Mia Farrow sprinkle stardust on playwright Jen Silverman’s hollow comedy about 60-something roommates. , and Brittani Samuel September 13, 2024 . 1:36 AM 11 min read Share on Twitter Share on Facebook Share on LinkedIn Share via Email (L-R) Patti LuPone and Mia Farrow in “The Roommate” on Broadway, 2024 (Credit: Matthew Murphy) Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “The Roommate.” RUNDOWN(L-R) Patti LuPone and Mia Farrow in “The Roommate” on Broadway, 2024 (Credit: Matthew Murphy)Hollywood-star power and the brazen use of pre-show bows for its performers aside, “The Roommate” is less a bold, blockbuster-worthy event and more a slow-burn play. Playwright Jen Silverman’s slightly dark comedy, written nearly a decade ago, employs a familiar structure: two actors, one act, zero frills. The show drops us into the lives of a pair of 60-something women — the timid Sharon (Mia Farrow) and the mysterious Robyn (Patti LuPone) — who become roommates in Sharon’s modest Iowan home. This post is for paying subscribers only Subscribe now Already have an account? Sign in Review — The Roommate — News — Jen Silverman — Jack O’Brien — Mia Farrow — Patti LuPone — Bob Crowley — Mikaal Sulaiman — Natasha Katz — David Yazbek Introductory Offer $1/month for 3 months Subscribe Already have an account? Log in Latest Closer Look What does it take to actually revise a musical? Closer Look How the original company of ‘Ragtime’ was cast Insights Loyalty Report: January 22, 2026 Closer Look How ‘Riverdance’ revolutionized the world of dance Podcast 30 years ago, Tracy Letts wrote a play tailor-made for today with ‘Bug’ Personnel Neil Mazzella steps down as CEO of Hudson entities Books The original music director of ‘Rent’ reveals scenes from the very first auditions Closer Look Christian Cowan uses detail and taste to make ‘The Queen of Versailles’ shine",
  "isFullReview": true,
  "dtliExcerpt": "So my disappointment in the play is not due to some casualty of heart or humanity — the show’s got well-enough doses of both — but rather its missing sense of deeper purpose.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Meh",
  "textStatus": "complete",
  "textWordCount": 346,
  "archivePath": "data/archives/reviews/the-roommate-2024/broadway-news--brittani-samuel_2026-01-25.html",
  "textFetchedAt": "2026-01-25T05:28:50.187Z",
  "textQuality": "full",
  "sourceMethod": "dtli"
}