{
  "showId": "the-roommate-2024",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani",
  "url": "https://www.broadwaynews.com/the-broadway-review-jen-silvermans-the-roommate-is-bolstered-by-its-stars/",
  "publishDate": "September 13, 2024",
  "fullText": "Megawatt performers Patti LuPone and Mia Farrow sprinkle stardust on playwright Jen Silverman’s hollow comedy about 60-something roommates. Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “The Roommate.” Hollywood-star power and the brazen use of pre-show bows for its performers aside, “The Roommate” is less a bold, blockbuster-worthy event and more a slow-burn play. Playwright Jen Silverman’s slightly dark comedy, written nearly a decade ago, employs a familiar structure: two actors, one act, zero frills. The show drops us into the lives of a pair of 60-something women — the timid Sharon (Mia Farrow) and the mysterious Robyn (Patti LuPone) — who become roommates in Sharon’s modest Iowan home. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": false,
  "dtliExcerpt": "So my disappointment in the play is not due to some casualty of heart or humanity — the show’s got well-enough doses of both — but rather its missing sense of deeper purpose.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "MEH",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 140,
  "archivePath": "data/archives/reviews/the-roommate-2024/broadway-news--brittani_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:22:39.791Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "textIssues": [
    "Word count too low: 140 (min: 300)"
  ]
}