{
  "showId": "the-roommate-2024",
  "outletId": "newyorktheater-me",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://newyorktheater.me/2024/09/12/the-roommate-broadway-review-mia-farrow-and-patti-lupone-as-an-odd-couple/",
  "publishDate": null,
  "fullText": "“The Roommate” is like a female “The Odd Couple” that’s more odd and less funny, and worth a Broadway production for two reasons: Mia Farrow and Patti LuPone. The show tacitly acknowledges that it’s a star vehicle for the two of them from the start, when they enter the stage and stand beneath a projection of their names. They then quickly leave the stage, and return right away to begin the play. That unusual little prologue might be intended to get the inevitable entrance applause for the stars out of the way, as if signaling: We do also have a story to tell. Farrow portrays Sharon, a 65-year-old recently-divorced Midwesterner who has taken out an ad for a roommate to share her large airy house in Iowa City, Iowa. She could use the extra money, but it’s soon clear that she really wants someone to help fill the emptiness left by her ex-husband and by a son who lives across the country and hardly talks to her. (His voice is heard on the answer machine once, the only other actor in the show — uncredited, but reportedly Mia’s son Ronan Farrow.) LuPone portrays Robyn, the woman who has answered the ad. It’s clear from the get-go that Sharon and Robyn are very different just by the way they dress – Sharon casually in blue jeans and plaid, Robyn bedecked in sharp black leather. We soon learn that Robyn is a vegan and a lesbian who has been living in the Bronx, and drove two days straight to get to Iowa, carrying loads of boxes, including of her own cookware, of ceramics she used to make, and of exotic vegetables she’s picked up on the way. Sharon is entranced by the weirdness of one of the vegetables.“Wow. Well. I see I am going to learn a lot from having you as a roommate.” Jen Silverman, a playwright making their Broadway debut, both studied and taught at the University of Iowa. But for several years Silverman has been familiar to Off-Broadway audiences, most notably for the 2018 play whose title is “Collective Rage” plus 45 more words. That playful, bawdy, genderqueer/feminist/lesbian comedy is more typical of Silverman’s out-there work than the more mainstream “The Roommate,” which debuted at the Humana Festival in Louisville in 2016. But if “The Roommate” makes evident use of “The Odd Couple” mainstream template, it updates and twists it, in let’s say a Silvermaniacal way. In Neil Simon’s 1965 play, Felix is thrown out by his wife and taken in by his divorced friend Oscar. Part of the humor comes from how idiosyncratic they are, and how extreme their differences – Felix is ridiculously fastidious, Oscar is extraordinarily slovenly. But another part of the humor comes from the now-outdated comic conceit of two men acting like a married couple. “The Odd Couple” ends with Oscar throwing Felix out, but realizing his friend has changed him for the better The contrast between the two characters in “The Roommate” is initially just as pronounced: Sharon seems a hyperbolically naïve country bumpkin, and Robyn a sophisticated city slicker with an outlaw aura. I shouldn’t fully reveal the precise ways in which the odd couple template takes a turn. I’ll only say that Robyn has a mysterious past, which she refuses to divulge to the curious Sharon, until about halfway into the 100-minute play Sharon makes an accidental discovery on her own, the first of several. A mild spoiler now, although not really, since it’s arguably inevitable: By the end Robyn has changed Sharon. Indeed, the ways in which a stranger can wake up even the most closed-off person at any age can be considered the serious take-away from this comic exercise. This makes the story from Sharon’s point of view, and it’s thus less important that the details of Robyn’s life remain often vague and not quite credible. It shouldn’t be a terrible surprise that Mia Farrow and Patti LuPone, the ultimate pros with a combined total of 117 years experience as professional performers, keep our attention at all times. It may well be that our appreciation comes as much from memories of their great roles from the past, as from these characters, who are neither greatly nuanced, nor roll-on-the-floor hilarious, although they have their moments. It seems fitting that Bob Crowley’s set of an airy Iowa house feels unfinished, like an outline of a house, or one under construction. This makes sense in more ways than one. “The Roommate” does feel unfinished, its ending reworkable. “The Odd Couple” threw out its ending when it was turned into a television series – in it, Oscar and Felix stay as roommates. What made all iterations of that show popular was not the plot but the premise. One can say the same thing about “The Roommate.” (Would it also work as a series?) The RoommateBooth Theater through December 15Running time: 100 minutes with no intermissionTickets: $58 – $321. Digital lottery: $35. Digital rush: $30. In person rush: $39Written by Jen Silverman. Directed by Jack O’BrienSet and costume design by Bob Crowley, lighting design by Natasha Katz, sound design by Mikaal Sulaiman Cast: Mia Farrow as Sharon, Patti LuPone as RobynPhotos by Matthew Murphy or Julieta Cervantes Broadway at the Emmys. The Roommate (and surprise replacement). Stageworthy News of the Week.September 16, 2024In \"New York Theater Weekly Summary\" Love Letters Broadway Review: Mia Farrow and Brian Dennehy Over 50 YearsSeptember 25, 2014In \"Broadway\" P is for Patti LuPone. Her Broadway career in photos and videosApril 25, 2020In \"Alphabet Series\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 925,
  "archivePath": "data/archives/reviews/the-roommate-2024/newyorktheater-me--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:26:43.953Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}