{
  "showId": "the-roommate-2024",
  "outletId": "vulture",
  "outlet": "VULTURE",
  "criticName": "Sara",
  "url": "https://www.vulture.com/article/theater-review-roommate-lupone-farrow-silverman.html",
  "publishDate": "September 12, 2024",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPatti LuPone and Mia Farrow in The Roommate, at the Booth.\n                Photo: Matthew Murphy\n              \n            \n              \n        Let’s talk about Georgy Tovstonogov. A brilliant Russian director during Khrushchev’s Thaw and the subsequent refreeze, with an artistic lineage directly traceable back to Stanislavski, Tovstonogov proposed that any play could be broken down into five events. The middle three happen inside the narrative, or written text, of the play itself — key moments of establishment, reversal, or culmination. But the first and fifth event belong to the director and happen in the theater. Event No. 1 is the handshake of the whole experience, the “tuning fork”: How does a production establish itself? What initial image does it unfold for an audience and how does that image, that dynamic moment, serve as a tonal microcosm of all that is to come? That first event, said Tovstonogov, reflects the play “like a drop of water reflects the whole ocean.”\n\nUnder Jack O’Brien’s direction, Jen Silverman’s 2015 odd-couple comedy The Roommate is making its, and its playwright’s, Broadway debut. Onstage is the frame of an Iowa farmhouse, its back wall translucent so we can see the big sky and flat stretch of field beyond. (Bob Crowley’s set design verges on parody: This ever-present projected backdrop incorporates a weirdly pristine, archetypal barn plunked down in the middle distance like a stowaway from a stock-image service — because, well, Iowa.) Before the play begins, its title appears in pink block letters splashed across the back wall. When the play begins, its stars walk in side by side, and the big pink text on the wall changes to show us their names in capital letters almost as tall as they are: MIA FARROW & PATTI LUPONE. They half-smile politely. They receive applause. They leave. Lights up, music down, they come back, and the play gets going.\n\nShould this matter? One could easily argue that O’Brien is simply dealing with the inevitable: People are going to clap for Mia and Patti, so let’s just get it over with. But it does matter. Because “let’s just get it over with” is no kind of first event. Nor is “clap for the celebrities.” If this drop of water reflects the whole ocean, what it’s showing us is that we’re being set up for a superficial encounter: Appreciate the presence of these two famous actors, laugh when they say something funny, and watch them get whisked away in their Uber Blacks afterward. (Seriously, I’ve never seen actors flee a theater so fast; my show companion and I had been standing outside the Booth for what felt like 30 seconds getting ourselves in order before the applause went up and the SUVs pulled past, one with a Patti-focused vanity license plate … so I guess not an Uber after all.)\n\nThis kind of surface-level engagement is all The Roommate can really withstand. Farrow and LuPone are fun to watch — especially Farrow, whose church-mouse character gradually blossoms with the demurely unhinged glee of a midwestern Mephistopheles — and Silverman has written a good number of funny things for them to say. Their chemistry is spicy and real, and there’s nothing wrong with having a straight-up good time. The trouble is that there’s something weird and sour going on in Silverman’s play that precludes uncomplicated enjoyment of its comedy but never quite touches anything really profound. Beneath its veneer, The Roommate is in an on-again, off-again relationship with its own conscience. It doesn’t know quite what it wants to do or say, or, crucially, exactly how bad it wants to break.\n\nThis could partly be a matter of context. 2015 isn’t just nine years ago — it’s a different time continuum. The reign of Walter White was still pretty close in the rearview mirror, Mad Men even closer, and Orange Is the New Black was still going strong. Anti-heroes abounded and often felt exciting in a way that they don’t quite these days. In this sense, Silverman’s characters can’t be blamed for growing from different soil. They are Sharon (Farrow) and Robyn (LuPone), and they’ve recently moved in together. Or, rather, Robyn has moved in with Sharon. Carting a bunch of half-heartedly packed boxes that scream “prop!,” Robyn has ditched her life in the Bronx and arrived in this endless field (that Sharon lives in Iowa City doesn’t seem to have affected the “middle of nowhere” set design). Robyn wears dark sunglasses, leather jackets, and a Chrissie Hynde shag. Sharon wears comfy shoes and flannels and puts her feathery, strawberry-blonde princess hair in Laura Ingalls Wilder braids. As she shuffles around the kitchen, sweetly and awkwardly trying to make space for her new housemate, the first third of Silverman’s play is taken up with New York–vs.–Midwest jokes. “I’m a vegan,” says Robyn. She’s also a potter and a slam poet who grows her own weed. And she’s — also, of course — gay. “Oh!” squeaks Sharon. “… Some of my son’s friends are homosexual people. Probably most of them … I think most New Yorkers are.”\n\nSome of this stuff is pretty funny, some of it less so; all of it’s fairly easily reachable fruit. When it lands, it’s largely due to Farrow, who fills the wide-eyed, bird-voiced Sharon with churning currents of curiosity and long-repressed weirdness. Her timing is great, as is her high-key blending of blushing naïveté and unnerving tenacity. “I’m very nosy and I’m very persistent,” she tells Robyn, her chirp of a voice completely devoid of guilt, after pressing for some info that the new roommate clearly wants to keep to herself. The question of guilt, however, will soon become central to The Roommate. Robyn isn’t just in Iowa for, as Sharon says brightly, the “corn and space.” She’s trying to leave behind a life of low-level crime — mostly credit-card scams, some drug selling, “a little bit of auto theft” — and as soon as the eager, newly awakened Sharon finds out, she wants in.\n\nHere’s where things start to escalate and where Silverman’s grip gets shaky. Because while it’s sometimes amusing to watch the hard-boiled LuPone become more and more destabilized as her smiling midwestern housemate morphs into a kind of unholy Kimmy Schmidt–as–Heisenberg, it’s also willfully underexamined and, as a shared character arc, even a bit icky. Casually defrauding old people and, as Sharon eventually does, suggesting using 12-year-olds as drug mules and buying an AR-15 at Walmart just to “be prepared” — it’s the kind of dark, glib take on girlboss energy that can power a very funny TikTok, but not a play with aspirations to emotional complexity. If Silverman had pushed even further, simply flung The Roommate devilishly off the moral deep end, things would feel different, but there’s enough hesitation in the play to alert us to the presence of an ethical compass; it’s just not one where the needles ever point outward from the self. We’re meant to be invested in Sharon’s liberation, not to think too hard about the context or the cost. Even the doubts Robyn expresses are solipsistic. They’re mostly screeches of surprise (“Do you even know how to use a gun??”) and worries for personal safety (“We are keeping a low profile”). They have nothing to do with the existence of other real people and an actual world of cause and effect beyond this little house on the prairie.\n\nOne doesn’t go to Birds of Prey wanting Harley Quinn to be a better person, so why carp about a dark comedy’s moral equivocation? Because Silverman themself seems tied in knots, twisted between a desire to go all out (“There’s a great liberty in being bad,” purrs Robyn; you can buy the T-shirt in the lobby) and a desire to make sure that we’re aware that they’re aware of what they’re about, and that that self-awareness absolves them. But there’s always been something a little dispiriting about the contemporary Women Behaving Badly genre. The “fuck you” defiance — “It’s my turn to be a selfish asshole now, boys!” — lands with the empty clatter of revenge or even boring old resentment. It’s shortsighted and inward-turning, less a howl of freedom than a self-owning “neener-neener-neener.” It may be given a glossy sheen and a smattering of good punch lines in The Roommate, but it sends us out into the night with the dull sensation of wondering what exactly we were clapping for.\n\nThe Roommate is at the Booth Theatre.\n\nShow \n      \n    \n    Leave a Comment\n  \n\n\n\n      The Roommate Barely Unpacks Its Own Boxes\n\n\n\n  \n  \n\n\n  \n\n\n\n        Things you buy through our links may earn Vox Media a commission.\n\nThis email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n\nPassword must be at least 8 characters and contain:\n\nYou’re in!\n        As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.\n\nThis email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n\nPassword must be at least 8 characters and contain:\n\nYou’re in!\n        As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.",
  "isFullReview": true,
  "dtliExcerpt": "It may be given a glossy sheen and a smattering of good punch lines in&nbsp;The Roommate, but it sends us out into the night with the dull sensation of wondering what exactly we were clapping for.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "DOWN",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 1566,
  "archivePath": "data/archives/reviews/the-roommate-2024/vulture--sara_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:22:33.800Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "has_paywall_text",
    "has_footer_text"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250114012912",
  "archiveOrgUrl": "http://web.archive.org/web/20250114012912/https://www.vulture.com/article/theater-review-roommate-lupone-farrow-silverman.html"
}