{
  "showId": "flying-over-sunset-2021",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Flying-Over-Sunset/1025",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Flying-Over-Sunset/1025",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $87\n Buy Tickets\n\nCititour.com Review\n In the landmark 1960s musical “Hair,” we’re told that “LBJ took the IRT down to 4th Street USA” where he saw “the youth of America on LSD.” Now, in the new Broadway musical “Flying Over Sunset,” at Lincoln Center Theatre at the Vivian Beaumont, we discover that a full decade earlier, LSD was used (legally) by America’s much older elite – not just to have a “groovy” trip but to face their true selves and perhaps banish bad memories. And while “Flying Over Sunset” shares the same sense of originality as “Hair,” the show is, sadly, somewhat more successful as a history lesson than as a fully entertaining musical.\n\nIn an admittedly clever conceit, book writer and director James Lapine fictionally connects three of the era’s most notable personalities, each of whom publicly acknowledged trying the drug: the novelist and philosopher Aldous Huxley (a very good Harry Haden-Patton) -- who was a strong public advocate for the use of pharmaceuticals -- movie legend Cary Grant (an affected Tony Yazbeck) and writer-turned-politico Clare Boothe Luce (the sublime Carmen Cusack). \n\nHowever, almost of all the 75-minute first act is devoted to their separate encounters with LSD – in a Rexall drug store, a psychiatrist’s office and Luce’s Connecticut home, respectively. The sequences are all fine, but we shouldn’t have to wait an hour for this trio to be finally brought together -- which eventually happens by chance at the famed Hollywood eatery, The Brown Derby. (All of the locales are brought to stunning life by set designer Beowulf Borrit, working off an initially blank planetarium-like semicircle, alongside the invaluable help of SD Productions’ stunning projections.)\n\nThe second act (which runs another 75 minutes) takes place during one day at Luce’s new residence in Malibu, where mutual friend Gerald Heard (a truly excellent Robert Sella) guides the threesome through a joint experimentation session. Unfortunately, we only learn a little more about what’s on the main characters’ minds than we did before.\n\nIn short, Huxley is still feeling guilty about how he handled the death of his beloved wife Maria (a lovely Laura Shoop); Grant can’t reconcile his public persona with his troubled childhood as Archibald Leach, which included dressing up as a girl to play British musical halls for money, as well as the discovery that his mother hadn’t died when he was 10 but had been unfairly committed to a mental institution by his cruel father (Nehal Joshi); and Luce, now without purpose and trapped in an unhappy marriage, longs to be reunited with her dead daughter Ann (Kanisha Marie Feliciano) and dead mother Austin (a zesty Michelle Ragusa), both of whom perished in terrible car accidents. \n\nIt’s not that these aren’t real issues, but Lapine’s script feels a bit Wikipedia-like, which is one reason why the tedium starts to set in long before the final curtain. Moreover, the book’s shallowness would be less troublesome if Tom Kitt and Michael Korie’s score was allowed to be the show’s centerpiece, especially since Kitt can write incredibly beautiful melodies and Korie’s lyrics are often poignant and trenchant. Sadly, the score simply contains too many snippets and medleys to be as effective as it should be.\n\nIndeed, only two numbers really stand out – at least for the right reason: the vaudevillian “Funny Money,” which relies heavily on Yazbeck’s amazing dancing skills (and Michelle Dorrance’s excellent choreography), and the gorgeous “Flying Over Sunset” (soaringly sung by the golden-voiced Cusack). Meanwhile, having Yazbeck croon about his genitalia in “Rocket Ship” almost sinks the show singlehandedly.\n\nFull confession, I’ve never been on an “acid trip.” And nothing about “Flying Over Sunset” has changed my mind about taking one.\n By Brian Scott Lipton\n\nVisit the Sitehttps://www.lct.org/shows/flying-over-sunset/Open/Close DatesOpening 12/13/2021Closing 1/16/2022\nTheatre Info\nVivian Beaumont Theater150 West 65th StreetNew York, NY 10023 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 690,
  "archivePath": "data/archives/reviews/flying-over-sunset-2021/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T17:42:44.552Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 690,
  "tierReason": "Full review text"
}