{
  "showId": "flying-over-sunset-2021",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/entertainment/broadway/ny-broadway-flying-over-sunset-review-20211214-2iqaaoas65h3bkfith2znsgt4m-story.html",
  "playbillVerdictUrl": "https://www.nydailynews.com/entertainment/broadway/ny-broadway-flying-over-sunset-review-20211214-2iqaaoas65h3bkfith2znsgt4m-story.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "From time to time on Broadway, a show will open where characters seem to be having a really great time: Drinking excellent whisky in a bar, perhaps, or making fantastic love or chowing down on chicken and biscuits.\n\nOr in the case of the new musical at Lincoln Center Theater, swimming on Malibu Beach while tripping on LSD.\n\nAs an audience member, though, you’re pushed into a voyeuristic experience. You’re not having whatever fun the characters are having and, after a while, you feel pushed to the periphery and disengaged.\n\nThat, in a nutshell, is the chronic problem that afflicts “Flying Over Sunset,” the intellectually rich, admirably ambitious and elegantly produced new musical at Lincoln Center, with both book and direction by James Lapine, an oft-sumptuous score by Tom Kitt and rich lyrics by Michael Korie.\n\nCertainly, this musical (which was long delayed by the pandemic) did not take any kind of easy way out. Penned with real-life characters but with a narrative imagined from whole cloth, the premise is that Cary Grant (the handsome Hollywood star), Aldous Huxley (the utopia-seeking British writer and public intellectual of “Brave New World” fame) and Clare Boothe Luce (the writer and diplomat) all gather at Luce’s Malibu home to take LSD together, with the new-age guru Gerald Heard acting as a kind of spiritual guide.\n\nTony Yazbeck plays Grant, Carmen Cusack is Luce and Harry Hadden-Paton is Huxley, with Robert Sella playing the fourth wheel.\n\nAct One of this elegantly designed show (by Beowulf Boritt) is made up of the imagined meeting between these characters and charting their individual experience, with a particular focus on Grant’s first LSD trip in the office of a psychiatrist.\n\nAct Two, set in and out of the Pacific Ocean, mostly is the joint Malibu trip of the suave quartet, a melding of their various trepidations, desires, insecurities, unrealized past traumas and expansive mutual creativity.\n\nIn its stronger first act, it seems like “Flying Over Sunset” really wants to explore the binary conflict that revolves around the notion that our brains contain far more than we think we remember and that, under the influence of a psychedelic like lysergic acid diethylamide, deeper insight might be possible. On the plus, good-trip side, this offers greater personal enlightenment and self-knowledge. On the minus, bad-trip side, it risks the danger of being overwhelmed by sensory experience from the past that we’d all be better advised to keep hidden.\n\nBut that rich, musical-friendly idea — akin to a debate about romantic poetry and whether ‘tis better to have loved and lost than never to have loved at all — ends up being swallowed by repetitive and thus boring celebrity biography. Moreover, the show has a real problem with doing the same thing over and over again, or at least that is how it feels.\n\nMuch of Act Two revolves around Grant, born working-class Archibald Alec Leach, trying to heal his inner child following a hardscrabble youth in which his mother preferred to dress him in girls’ clothing without regard for his preferences. That kid is personified by Atticus Ware, who is a superb dancer and performer, as, is Yazbeck.\n\nBut that quest was played out in Act One and while I imagine the creators of this musical intended Act Two to intensify the theme, it actually gets stuck in a repetitive groove. Nothing during the big trip really feels at stake, since we know they all come back alive. Thus the show really struggles to maintain narrative tension.\n\nDoes this show make you feel like you are on LSD? Not really. The show is too talky and grounded in realism to be truly trippy.\n\nThere certainly are some cool scenic elements, a fusion of retro elegance with psychedelic influence, and the show has one knockout tap number in Act One. Kitt’s score evokes lush Hollywood strings with deconstructive digressions; as a soundscape suggesting both the Golden Age of Hollywood and Timothy Leary, it is a very cool song suite and beautiful, too.\n\nBoth the score and the excellent, slightly akimbo choreography by Michelle Dorrance suggests the sound of tapping can be a version of the heightened senses of your typical acid trip. That’s all cool, but it cannot solve that central issue of the lack of dramatic tension nor the overly languid nature of this production.\n\nYazbeck’s Grant is the most effective performance, not least because both he and his actor feel the most curious. Hadden-Paton and Cusack get rather trapped inside impenetrable characters of their making, notwithstanding the quality of these actors. And the show has no idea whether its fourth character is part of its main story or adjunct. That’s bizarre, too.\n\nSurely, it’s great to see rich intellectual discussion and experiment swirl around Lincoln Center Theater’s huge stage.\n\nLSD vets, and there are plenty on the Upper West Side, likely will be the most intrigued.",
  "isFullReview": true,
  "textWordCount": 816,
  "archivePath": "data/archives/reviews/flying-over-sunset-2021/nydailynews--chris-jones_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:52:28.248Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20220124153439",
  "archiveOrgUrl": "http://web.archive.org/web/20220124153439/https://www.nydailynews.com/entertainment/broadway/ny-broadway-flying-over-sunset-review-20211214-2iqaaoas65h3bkfith2znsgt4m-story.html",
  "contentTier": "complete",
  "wordCount": 816,
  "tierReason": "Full review text"
}