{
  "showId": "flying-over-sunset-2021",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Elysa Gardner",
  "url": "https://nystagereview.com/2021/12/13/flying-over-sunset-a-long-strange-beautiful-trip/",
  "publishDate": "2021-12-13T21:51:57",
  "fullText": "Though it’s pretty early in the season, it’s safe to say you won’t catch a more thrilling five minutes on Broadway than “Funny Money,” a number in the second scene of the new musical Flying Over Sunset. The performers are the dazzling triple threat Tony Yazbeck, playing Cary Grant in middle age, and a child wonder named Atticus Ware, playing a ten-year-old Archibald Leach, Grant’s birth name. It’s the 1950s, and after taking LSD for the first time, the movie legend and one-time vaudevillian is getting psychically re-acquainted with his much younger self through song and tap dance. The tune is impressively catchy, and the routine, as choreographed by Michelle Dorrance and executed by Yazbeck and Ware, is so exhilarating that you may feel chemically enhanced just watching it.\n\nI’d love to report that Sunset sustains that high for its roughly two and a half hours, but this long, strange trip—featuring a book by James Lapine, who also directs, music by Tom Kitt and lyrics by Michael Korie—is ultimately an uneven one. The accomplished creators have an ambitious and truly original premise: Grant, author and philosopher Aldous Huxley and multi-tasking social and political player Clare Boothe Luce, who all experimented with psychedelic drugs (Huxley most famously), meet up in a Los Angeles restaurant and hatch a plan to drop acid at Luce’s swellegant Malibu home.\n\nIn a prologue, “The Music Plays On”—another thoroughly arresting number that put Dorrance’s ingenuity and finesse front and center—the cast members essentially double as musicians, walking in time before the music even starts; Huxley, in what will later emerge as a drug-induced flashback, reconnects with his late wife, Maria, and they segue into a waltz. The pattern will continue, with rhythmic footsteps often amplified by Dan Moses Schreier’s sound design, which conspires with Beowulf Boritt’s spare but stunning sets, Bradley King’s lighting and projections by 59 Productions to create gorgeously hallucinogenic effects. A Botticelli painting suddenly looms on a staircase that appears in a drugstore; neon spheres materialize out of nowhere, one zooming forward in three dimensions; Grant, Huxley and Gerald Heard, the British-born historian who befriended and influenced Huxley, wade further and further into the ocean, until two of them are nearly overwhelmed by an aggressive tide. (The last example isn’t meant to be a hallucination, though altered judgment plays a role in the adventure.)\n\nThe show is at its most solid before intermission, as we’re introduced to the leading characters, all three at points in their lives and careers when trying something new, however risky, seems attractive. Grant has just retired, temporarily, from acting, and is hoping that an LSD-toting shrink (the drug was legal at the time) can quickly resolve the sense of unease he would rather not dig into. Huxley, played by the Eton-educated Harry Hadden-Paton—last seen on Broadway as another well-born British intellectual, Henry Higgins, in Bartlett Sher’s revival of My Fair Lady—is encountering puritanical feedback for his work, and is about to lose his beloved Maria to cancer. Luce, who is given a period-perfect reading by Carmen Cusack, is stuck in a loveless marriage, and ambivalent about her latest appointment, to ambassador to Brazil. All three first get stoned roughly as they did in life.\n\nIt’s when we get to their fictional escapade at Luce’s beach house that Sunset threatens to go off the rails a bit. An hour is an awfully long time to devote to an acid trip, at least if you’re not the one taking it, and yet Act Two offers no fewer than ten songs delivered by characters under the influence. One that finds Grant dancing in his mind with Sophia Loren is followed in short order by another in which he declares himself “a giant penis rocket ship.” Everyone brings up his or her mother, each story darker than the last; Luce’s visions are haunted by both her mom and her own daughter, both of whom were killed in car accidents. Lapine, not unsurprisingly, traverses all this with as sharp a wit as could be summoned, and manages some poignant moments too, but…well, you can only go so far in a penis rocket ship.\n\nStill, the production is aesthetically transcendent—a sensory feast for the sober that never settles for gratuitous flash, and is as pleasing to listen to as it is to behold. Kitt provides some of his most melodically and harmonically satisfying work to date, and the material is beautifully sung; Yazbeck and Cusack are standouts in this respect, as are Laura Shoop, a graceful, silver-voiced Maria, and Kanisha Marie Feliciano and Michele Ragusa, respectively cast as Luce’s mother and daughter. As Heard, who accompanies the central trio on its psychedelic journey, Robert Sella is tender and sweetly droll, as much a voyeur among larger-than-life figures as he is a guide.\n\nSeveral supporting cast members double in smaller roles; Feliciano and Ragusa appear as the Old Testament heroine Judith and her handmaiden when the Botticelli painting suddenly springs to life in one of Huxley’s visions, while Nehal Joshi plays both Grant’s therapist and the film star’s father, who terrorizes Grant during his otherwise giddy first trip. If Flying Over Sunset doesn’t truly take us into the minds or souls of its distinguished subjects, it will likely make you more curious about them—and make you wish that getting high could be more of a spectator sport.\n\nFlying over Sunset opened December 13, 2021, at the Vivian Beaumont Theater and runs through January 16, 2022. Tickets and information: lct.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api",
    "playbill-verdict"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "playbillVerdictUrl": "http://nystagereview.com/2021/12/13/flying-over-sunset-a-long-strange-beautiful-trip/"
}
