{
  "showId": "flying-over-sunset-2021",
  "outletId": "nyt-theater",
  "outlet": "New York Theater",
  "criticName": "Jonathan Mandell",
  "url": "https://newyorktheater.me/2021/12/13/flying-over-sunset-review-cary-grant-clare-boothe-luce-and-aldous-huxley-take-lsd-not-a-hippie-in-sight/",
  "playbillVerdictUrl": "https://newyorktheater.me/2021/12/13/flying-over-sunset-review-cary-grant-clare-boothe-luce-and-aldous-huxley-take-lsd-not-a-hippie-in-sight/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "There are certainly some highlights in 'Flying Over Sunset,' chief among them Tony Yazbeck's phenomenal dancing as Cary Grant, accompanied step by step by 14-year-old newcomer Atticus Ware as his younger self. The choreographer, Michelle Dorrance, was a star performer in Stomp, and we hear the influence. The rest of the cast is also first-rate. However, after sitting through the nearly three hours of this unique fusion of high-minded spiritual contemplation, gossipy biographical tidbits, subtle comedy and fabricated hallucinations all presented in song and dance, I was never completely persuaded that these three famous figures belong in the same musical; indeed, it seemed unlikely that they would have had anything to do with one another.",
  "bwwScore": 7,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-FLYING-OVER-SUNSET-Opens-On-Broadway--See-What-the-Critics-Are-Saying-20211213",
  "showScoreExcerpt": "There are certainly some highlights in “Flying Over Sunset,” chief among them Tony Yazbeck’s phenomenal dancing as Cary Grant...However, after sitting through the nearly three hours of this unique fusion of high-minded spiritual contemplation, gossipy biographical tidbits, subtle comedy and fabricated hallucinations all presented in song and dance, I was never completely persuaded that these three famous figures belong in the same musical\n\nRead more"
}