{
  "showId": "flying-over-sunset-2021",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2021/12/13/theater/flying-over-sunset-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2021/12/13/theater/flying-over-sunset-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "web-search",
    "show-score-playwright",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "To a perpetual square, nothing is as mystifying as another person's high. Or so I learned in college, during the heyday of chemically induced inner journeys - and again at the Vivian Beaumont Theater the other night. Though sometimes mesmerizing, 'Flying Over Sunset,' the new musical about LSD that opened there on Monday, is mostly bewildering, and further proof that transcendence can't be shared.",
  "bwwScore": 5,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-FLYING-OVER-SUNSET-Opens-On-Broadway--See-What-the-Critics-Are-Saying-20211213",
  "fullText": "https://www.nytimes.com/2021/12/13/theater/flying-over-sunset-review.htmlShare full article37Advertisement\n\nTo a perpetual square, nothing is as mystifying as another person’s high. Or so I learned in college, during the heyday of chemically induced inner journeys — and again at the Vivian Beaumont Theater the other night. Though sometimes mesmerizing, “Flying Over Sunset,” the new musical about LSD that opened there on Monday, is mostly bewildering, and further proof that transcendence can’t be shared.\n\nIt admits as much in its structure, which throws into one scenario (by James Lapine) three famous seekers who never actually got high together. We meet them separately, starting with the philosopher and novelist Aldous Huxley (Harry Hadden-Paton), tripping at a Hollywood drugstore in the late 1950s. Next comes the greatest of all male movie stars, Cary Grant (Tony Yazbeck), demanding the drug — then legal — from his second wife’s psychiatrist. Finally we drop in on the playwright and diplomat Clare Boothe Luce (Carmen Cusack), hallucinating “a sapphire dragonfly” soon after being nominated as ambassador to Brazil.\n\nMuch of this is true — if not the details of the visions then the settings and situations. But to advance the story beyond that, Lapine has to indulge in speculative nonfiction, a musical theater hallucinogen he has used to great effect before, in his play “Twelve Dreams,” inspired by Jungian imagery, and in his book for the musical “Sunday in the Park With George,” about the painter Georges Seurat. Perhaps recalling Seurat’s pointillistic technique, he writes in a preface to “Flying Over Sunset” that his script “connects the dots” of known history.\n\nIt certainly connects the major players, bringing them together counterfactually, at the end of Act I, to discuss their common interest over champagne at the Brown Derby restaurant in Hollywood. In Act II, with the philosopher Gerald Heard (Robert Sella) as their “guide,” they indulge that interest together at Luce’s Malibu estate.\n\nTheir trips take up perhaps two-thirds of the show — and 100 percent of the songs, by Tom Kitt and Michael Korie. As a concept, that makes sense, not just because music is arguably the most transcendent of art forms (and is often lovely here) but also because the characters, as Lapine presents them, apparently need to be high to be fully alive.\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 397,
  "archivePath": "data/archives/reviews/flying-over-sunset-2021/nytimes--jesse-green_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:40:17.470Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250721011619",
  "archiveOrgUrl": "http://web.archive.org/web/20250721011619/https://www.nytimes.com/2021/12/13/theater/flying-over-sunset-review.html",
  "contentTier": "needs-rescrape",
  "wordCount": 397,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-05T14:58:19.328Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text cuts off mid-sentence and ends with a technical error message about retrieving article content and enabling JavaScript, making it impossible to determine the critic's final verdict.; openai: The text is incomplete and includes navigation elements and instructions, indicating it is not a full review.",
  "promptVersion": "5.2.0",
  "showScoreExcerpt": "\"Though sometimes mesmerizing, “Flying Over Sunset,” the new musical about LSD that opened there on Monday, is mostly bewildering, and further proof that transcendence can’t be shared.\"\n\nRead more",
  "publishDate": "December 14, 2021"
}