{
  "showId": "flying-over-sunset-2021",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2021/12/13/theater/flying-over-sunset-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2021/12/13/theater/flying-over-sunset-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "show-score-playwright",
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ],
  "bwwExcerpt": "To a perpetual square, nothing is as mystifying as another person's high. Or so I learned in college, during the heyday of chemically induced inner journeys - and again at the Vivian Beaumont Theater the other night. Though sometimes mesmerizing, 'Flying Over Sunset,' the new musical about LSD that opened there on Monday, is mostly bewildering, and further proof that transcendence can't be shared.",
  "bwwScore": 5,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-FLYING-OVER-SUNSET-Opens-On-Broadway--See-What-the-Critics-Are-Saying-20211213",
  "fullText": "https://www.nytimes.com/2021/12/13/theater/flying-over-sunset-review.htmlShare full article37Advertisement\n\nTo a perpetual square, nothing is as mystifying as another person’s high. Or so I learned in college, during the heyday of chemically induced inner journeys — and again at the Vivian Beaumont Theater the other night. Though sometimes mesmerizing, “Flying Over Sunset,” the new musical about LSD that opened there on Monday, is mostly bewildering, and further proof that transcendence can’t be shared.\n\nIt admits as much in its structure, which throws into one scenario (by James Lapine) three famous seekers who never actually got high together. We meet them separately, starting with the philosopher and novelist Aldous Huxley (Harry Hadden-Paton), tripping at a Hollywood drugstore in the late 1950s. Next comes the greatest of all male movie stars, Cary Grant (Tony Yazbeck), demanding the drug — then legal — from his second wife’s psychiatrist. Finally we drop in on the playwright and diplomat Clare Boothe Luce (Carmen Cusack), hallucinating “a sapphire dragonfly” soon after being nominated as ambassador to Brazil.\n\nMuch of this is true — if not the details of the visions then the settings and situations. But to advance the story beyond that, Lapine has to indulge in speculative nonfiction, a musical theater hallucinogen he has used to great effect before, in his play “Twelve Dreams,” inspired by Jungian imagery, and in his book for the musical “Sunday in the Park With George,” about the painter Georges Seurat. Perhaps recalling Seurat’s pointillistic technique, he writes in a preface to “Flying Over Sunset” that his script “connects the dots” of known history.\n\nIt certainly connects the major players, bringing them together counterfactually, at the end of Act I, to discuss their common interest over champagne at the Brown Derby restaurant in Hollywood. In Act II, with the philosopher Gerald Heard (Robert Sella) as their “guide,” they indulge that interest together at Luce’s Malibu estate.\n\nTheir trips take up perhaps two-thirds of the show — and 100 percent of the songs, by Tom Kitt and Michael Korie. As a concept, that makes sense, not just because music is arguably the most transcendent of art forms (and is often lovely here) but also because the characters, as Lapine presents them, apparently need to be high to be fully alive.\n\nBottoms up: From left, Sella, Hadden-Paton, Cusack and Yazbeck prepare to embark on simultaneous LSD trips.Credit...Sara Krulwich/The New York TimesIt’s hard to argue with him from personal experience; as he recently told The Times, he used LSD frequently while in graduate school. But the actual lives of Huxley, Grant and Luce do not support the idea that they were lacking in the rich complexity of humanity when sober.\n\nTo correct for that problem, Lapine, who also directed the show, steers “Flying Over Sunset” in some very strange and ultimately tiresome directions. First, he assigns each character a buried emotional problem that needs resolving. Huxley is grieving the death of his wife. Grant, having never fully reconciled his imperturbable public persona with the terrorized child he once was, has problems with women. And Luce somehow feels guilt over the deaths of her mother and daughter, in car accidents she had nothing to do with.\n\nThere’s an overly programmatic quality to that setup, especially as delivered in the exceedingly flat dialogue Lapine seems to favor. (“I think what’s interesting,” Heard says, “is that you each seem to be at a turning point in your lives.”) Perhaps the flatness is meant to set up the floridness of the trips, which compensate for the lack of real-world dramatic development by growing more and more outré as the show, at two hours and 40 minutes, wears on.\n\nThe first of those trips is at least efficient in characterizing Huxley, whom Hadden-Paton winningly portrays as a goofy know-it-all nerd. Spotting a Botticelli monograph at the drugstore, he imagines characters from the painting “The Return of Judith to Bethulia” coming to life somewhat randomly around him, to the strains of some beautiful bel canto pastiche by Kitt and Korie. Here and elsewhere, you may be reminded of “Sunday in the Park” for its tableaux vivants and shimmering orchestral effects, if not for its thematic discipline.\n\nAnd Grant’s maiden trip, involving an otherwise flat-footed encounter with his younger self (Atticus Ware) and violent father (Nehal Joshi), allows for a showstopping dance routine to a music hall ditty called “Funny Money.” The choreography for Yazbeck and Ware, by the tap phenom Michelle Dorrance, almost obliterates any qualms about the song’s psychobabbly premise.\n\nBut for an audience not invested in Lapine’s personal imagery, the second act, with its nonstop LSD sequences, goes quickly downhill. A number called “I Like to Lead,” in which Sophia Loren, Grant’s co-star in the 1958 movie “Houseboat,” slaps him around in an allegory of female domination, is incoherent. Another, in which Grant imagines himself as a “giant penis rocket ship” on a “secret mission” to spare the earth from disaster, is merely mortifying. Luce’s visit to heaven to see her mother and daughter, in a song called “An Interesting Place,” is as banal as that title.\n\nEmily Pynenburg as Sophia Loren and Yazbeck as Cary Grant in a number recalling a scene from the 1958 movie “Houseboat.”Credit...Sara Krulwich/The New York TimesAt least there are compensations in the typically gorgeous technical wizardry of the Lincoln Center Theater production. The lighting (by Bradley King) and the projections (by 59 Productions) on Beowulf Boritt’s swirling-circles set — along with the immersively psychedelic sound by Dan Moses Schreier — bring us closer to the sensation of melting consciousness than the script ever manages. At times even the costumes (by Toni-Leslie James) seem to be tripping. And Dorrance’s choreography for the show’s opening, arranging the cast’s varying footfalls in rhythmic counterpoint, is sublime.\n\nThese are not enough to outweigh Lapine’s failure to dramatize what he evidently sees as the life-enhancing possibilities of mind-altering drugs. If those possibilities exist, surely they are not to be found in a direct linkup of symptoms and cures, as proposed by “Flying Over Sunset.” During his Botticelli immersion, Huxley claims that his right eye, severely damaged from a childhood illness, has started “working” again. Grant and Luce, having faced unfinished emotional business, emerge from their trips refreshed and ready to move on.\n\nBut LSD, on its own, is not psychoanalysis by other means. And if the drug offers access to a shared consciousness that can help humans connect, neither the show nor the subsequent lives of its real-life characters demonstrate it. Luce, a brittle charmer in Cusack’s smart rendering, drifted ever rightward politically; Grant married three more times.\n\nAs for Huxley, despite his supposedly improved eyesight, his overall health deteriorated quickly. On his deathbed in 1963, he asked to be injected with 100 micrograms of LSD. He was still a believer — but in what? Some mysteries, this musical among them, are too interior to be understood.\n\nFlying Over SunsetThrough Feb. 6 at the Lincoln Center Theater, Manhattan; flyingoversunset.com. Running time: 2 hours 40 minutes.\n\nJesse Green is the chief theater critic. Before joining The Times in 2017, he was the theater critic for New York magazine and a contributing editor. He is the author of a novel, “O Beautiful,” and a memoir, “The Velveteen Father.”",
  "isFullReview": true,
  "textWordCount": 1204,
  "archivePath": "data/archives/reviews/flying-over-sunset-2021/nytimes--jesse-green_2026-02-06.html",
  "textFetchedAt": "2026-02-06T15:38:07.577Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "scrapingbee",
  "archiveOrgTimestamp": "20250721011619",
  "archiveOrgUrl": "http://web.archive.org/web/20250721011619/https://www.nytimes.com/2021/12/13/theater/flying-over-sunset-review.html",
  "contentTier": "complete",
  "wordCount": 1204,
  "tierReason": "Full review text",
  "rejectedAt": "2026-02-06T07:33:14.519Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "garbage_text",
  "rejectionReasoning": "claude: The review text is truncated and ends with a technical error message about retrieving article content and enabling JavaScript, making it impossible to determine the critic's final verdict.; openai: The text is a mix of navigation instructions and incomplete content, making it impossible to evaluate as a review.; gemini: The review is cut off before a clear verdict is given. The text ends mid-sentence, making it impossible to determine the critic's overall recommendation.",
  "promptVersion": "5.2.0",
  "showScoreExcerpt": "\"Though sometimes mesmerizing, “Flying Over Sunset,” the new musical about LSD that opened there on Monday, is mostly bewildering, and further proof that transcendence can’t be shared.\"\n\nRead more",
  "publishDate": "December 14, 2021"
}