{
  "showId": "sunday-in-the-park-with-george-2008",
  "outletId": "amny",
  "outlet": "amNY",
  "criticName": "Matt Windman",
  "url": "http://www.amny.com/entertainment/sunday-in-the-park-with-george-review-jake-gyllenhaal-annaleigh-ashford-star-in-superb-revival-1.13169351",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "show-score-playwright",
    "playbill-verdict"
  ],
  "bwwExcerpt": "This revival (directed by Sarna Lapine, niece of James Lapine) originated as a concert staging at City Center. With the exception of an elaborate light sculpture sequence, it is a simple presentation that lacks the visual thrills of the original production or the 2008 Broadway revival. However, storytelling is focused and the score (played by a full orchestra) sounds as glorious as ever. Compared with other actors who have played the role, Gyllenhaal's Georges is sensitive, wounded and even symp",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-Jake-Gyllenhaal-and-Annaleigh-Ashford-Open-in-SUNDAY-IN-THE-PARK-WITH-GEORGE-20170223",
  "contentTier": "excerpt",
  "showScoreExcerpt": "\"A superb revival...'Sunday' is a complex, rich and extremely rewarding work of art...It is a simple presentation that lacks the visual thrills of the original production. However, storytelling is focused and the score (played by a full orchestra) sounds as glorious as ever...Gyllenhaal’s Georges is sensitive, wounded and even sympathetic...As Dot, Ashford gives a bold performance in which she employs her comic abilities to superb effect but is also sexy, vulnerable and heartbreaking.\"\n\nRead more",
  "playbillVerdictUrl": "http://www.amny.com/entertainment/sunday-in-the-park-with-george-review-jake-gyllenhaal-soars-in-lead-role-1.12509352",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: mentions director \"sarna lapine\" from sunday-in-the-park-with-george-2017 (newer production). Review likely belongs in sunday-in-the-park-with-george-2017."
}