{
  "showId": "the-notebook-2024",
  "outletId": "broadway-news",
  "outlet": "BROADWAY NEWS",
  "criticName": "Brittani",
  "url": "https://www.broadwaynews.com/the-broadway-review-the-notebook-a-swoonful-new-musical-that-conjures-its-former-selves/",
  "publishDate": "March 15, 2024",
  "fullText": "The theatrical adaptation of Nicholas Sparks’ landmark novel keeps audiences laughing through the love and weeping through the grief. Good morning, and welcome to Broadway News’ Broadway Review by Brittani Samuel — our overview of reactions, recommendations and information tied to last night’s Broadway opening of “The Notebook.” There is a type of romantic love that almost paralyzes its victims — it’s blinding, disarming and all-encompassing. Stories like “The Notebook” hinge on this kind of love. Main characters Noah and Allie are so addicted to their attraction, they’re willing to sacrifice parental support, career progression — even an engagement — to get another hit. But similar to Nicholas Sparks’ best-selling novel and the subsequent film iteration, this crisp musical adaptation of “The Notebook” proves that the central couple’s high is, ultimately, worth it, as Noah and Allie embark on a decades-long adventure of adoration. The two’s pining for one another — wisely separated here into three “phases” of life — would be exhausting if it was not so sensationally acted by this company of artists, artfully crafted by book writer Bekah Brunstetter (previously a writer on NBC’s series “This Is Us” and thus a master of the time-hopping tear-jerker) and tenderly co-directed by Michael Greif and Schele Williams. Under Greif and Williams’ watchful eyes, each era feels distinct: Noah and Allie are hornier when younger, impassioned when middle age, delicate when old. But the careful cues the directors and the design team make to acknowledge the couple’s bond throughout is deliciously gooey. Another choice (that there is at once something and nothing to be made of) lies in the casting for all these honeyed lovers. Black actors Jordan Tyson (so bright) and Joy Woods (so luminous) play the Younger and Middle versions of Allie, respectively. White actors John Cardoza (so spiky) and Ryan Vasquez (so adoring) play the Younger and Middle versions of Noah. But in their eldest stage, the phenotypes swap — Maryann Plunkett (a miracle as Older Allie) is white and Dorian Harewood (a masterful Older Noah) is Black. The impossibility of this will never quite make sense to me as a creative choice, but oddly enough, I would not call it a distraction. In fact, the entire production seems only loosely concerned with reminding us of a particular reality. Brunstetter’s book pushes the novel’s original setting (the 1940s) forward a couple of decades to the 1960s. The geographic place is more nebulous. Just as casting forgoes probability, creative design forgoes specificity. Both elements are more concerned with wringing every possible emotion out of your cerebral cortex. Each moment of the show bubbles over with affecting light shifts, heartbreaking performances of Ingrid Michaelson’s understated yet evocative score and Plunkett’s tour-de-force performance that will pry tears from even the driest of ducts. A show this steeped in grief and heartbreak has never felt so damn good. Already have an account? Sign in Already have an account? Log in",
  "isFullReview": true,
  "dtliExcerpt": "A show this steeped in grief and heartbreak has never felt so damn good.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "UP",
  "dtliUrl": null,
  "needsScoring": true,
  "textWordCount": 489,
  "archivePath": "data/archives/reviews/the-notebook-2024/broadway-news--brittani_2026-01-27.html",
  "textFetchedAt": "2026-01-27T20:24:29.863Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_paywall_text",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}