{
  "showId": "the-notebook-2024",
  "outletId": "nypost",
  "outlet": "New York Post",
  "criticName": "Johnny Oleksinki",
  "url": "https://nypost.com/2024/03/14/entertainment/the-notebook-review-broadway-musical-doesnt-match-films-sweep/",
  "publishDate": "March 14, 2024",
  "fullText": "While the cast of “The Notebook” sings and dances up onstage at the Gerald Schoenfeld Theatre, there is an even more dramatic performance going on in the seats.\n\nTwo hours and 20 minutes, with one intermission. At the Gerald Schoenfeld Theatre, 236 W 45th Street.\n\nIngrid Michaelson’s musical, which opened Thursday night on Broadway, is, of course, based on Nicholas Sparks’ weepy 1996 romance novel that was made into a popular movie starring a young Ryan Gosling and Rachel McAdams.\n\nLike Pavlov’s pups, millennials habitually sob during that 2004 film, and the production has seized upon its teary reputation by selling branded tissue boxes. During the final 10 minutes, the noses are deafening.\n\nI suspect, however, that it is audience members’ fond memories of the movie and book, more so than the merely pleasant proceedings in the theater, that are prying open their tear ducts.\n\nBecause as elegantly staged as “The Notebook” is by co-directors Michael Greif and Schele Williams, and despite boasting an appealing cast, the show amounts to a series of un-involving pencil sketches rather than a layered portrait of a decades-long love.\n\nNot a single change book writer Bekah Brunstetter has made improves the simple story’s effectiveness. In most cases, the alterations dull its punch and turn it into a wispy memory play. A memory for them becomes an afterthought for us.\n\nThe setting has been shifted from the South to the milder mid-Atlantic. The characters have jumped ahead from the 1940s and World War II to the tumultuous 1960s and the moral ambiguity of Vietnam. And the most damaging decision of them all: Three actors play Allie and three actors play Noah, instead of two.\n\nSpliced once more, the audience never really gets to know them.\n\nConnection, to state the obvious, is not only a result of the lines characters speak or the songs they sing — we powerfully latch onto the performers who play a part. Not so here.\n\nUnlike the sustained presence of Gosling and McAdams and their elderly counterparts in the movie, these six come and go too quickly to capture viewers&#8217; hearts.\n\nActually, in the musical, the leads are really Older Noah (Dorian Harewood) and Older Allie (Maryann Plunkett). For better or worse, they are more prominent in this staging than their younger selves, who they often silently observe.\n\nEvery day, the man visits the woman, who suffers from dementia, in her nursing home to read aloud the same story — the tale of two teens who fall madly for one another but are kept apart by meddling parents.\n\nMost of the time, Older Allie doesn’t recognize her husband as he recounts their history. And that aspect of the show, as dementia sadly affects many, is the most gripping. Harewood and especially Plunkett are tender and vulnerable without going overboard on sentiment.\n\nIn the earliest days of their summer courtship, Noah and Allie are played with bright voices by John Cardoza and Jordan Tyson. They flirt and splash in the pool of water at the foot of David Zinn and Brett J. Banakis’ set, which is far more beautiful than any artificial Broadway river has the right to be.\n\nAllie’s domineering mother (Andréa Burns) resents Noah’s working class upbringing, and prematurely splits the duo up.\n\nTen years pass, and the roles are handed off to Ryan Vasquez and Joy Woods. Choreographer Katie Spelman dreamily moves the characters through time.\n\nEven though Allie is engaged to rich and powerful Lon (Chase Del Rey), she enthusiastically reunites with Noah, who went off to fight in Vietnam, when she spots him in the newspaper.\n\nWhile the actors tap in and out, Michaelson’s score is static — a scented candle fusion of “Dear Evan Hansen” and “Pachelbel’s Cannon.” Sweet and stringy, like brisket. Woods belts an enlivening 11 o’clock number called “My Days” that wakes us up and knocks us out with vocal pyrotechnics, if not entrancing melody.\n\nBecause the only persons we’ve embraced over two acts are Harewood and Plunkett, the famous final moment hits home. It’s still, as Post critic Lou Lumenick said in his review of the film, “a four-hankie climax that only a stone-hearted cynic could resist.”\n\nIt’s a high note to end on, in a book with few others.",
  "isFullReview": true,
  "bwwExcerpt": "While the cast of “The Notebook” sings and dances up onstage at the Gerald Schoenfeld Theatre, there is an even more dramatic performance going on in the seats. The sniffle chorus. Ingrid Michaelson’s musical, which opened Thursday night on Broadway is, of course, based on Nicholas Sparks’ weepy 1996 romance novel that was made into a popular movie starring a young Ryan Gosling and Rachel McAdams. Like Pavlov’s pups, millennials habitually sob during that 2004 film, and the production has seized",
  "bwwRoundupUrl": null,
  "bwwThumb": "Down",
  "originalScore": null,
  "assignedScore": null,
  "source": "bww-roundup",
  "dtliThumb": "Meh",
  "needsScoring": true,
  "dtliExcerpt": "Because as elegantly staged as “The Notebook” is by co-directors Michael Greif and Schele Williams, and despite boasting an appealing cast, the show amounts to a series of un-involving pencil sketches rather than a layered portrait of a decades-long love.",
  "sources": [
    "bww-roundup",
    "dtli"
  ],
  "textWordCount": 708,
  "archivePath": "data/archives/reviews/the-notebook-2024/nypost--johnny-oleksinki_2026-01-29.html",
  "textFetchedAt": "2026-01-29T01:46:20.480Z",
  "designation": "Recommended",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20240924205520",
  "archiveOrgUrl": "http://web.archive.org/web/20240924205520/https://nypost.com/2024/03/14/entertainment/the-notebook-review-broadway-musical-doesnt-match-films-sweep/"
}