{
  "showId": "the-notebook-2024",
  "outletId": "twi-ny-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://twi-ny.com/2024/03/14/the-notebook-the-musical/",
  "publishDate": null,
  "fullText": "Teens Allie (Jordan Tyson) and Noah (John Cardoza) fall in love in The Notebook (photo by Julieta Cervantes) THE NOTEBOOK Gerald Schoenfeld Theatre 236 West 45th St. between Broadway & Eighth Aves. Tuesday – Sunday through July 7, $74-$298 notebookmusical.com “I don’t think there was any way I could have imagined that it would become as successful as it did. It’s like catching lightning in a bottle,” former pharmaceutical salesman Nicholas Sparks told Show Daily about his blockbuster debut novel, 1996’s The Notebook, which was lifted out of a literary agency slush pile. The tearjerker spent more than a year on the bestseller list, though it never reached number one. It caught lightning in a bottle again in 2004, when it was adapted into a hugely successful film, directed by Nick Cassavetes and starring Ryan Gosling, James Garner, Rachel McAdams, Gena Rowlands (Nick’s mom), Joan Allen, James Marsden, and Sam Shepard. The novel and film had plenty of naysayers, decrying it as sentimental claptrap; the movie is certified Rotten on Rotten Tomatoes, but it won eight Teen Choice Awards as well as Best Kiss at the MTV Movie Awards. It knows its audience. (For the record, I have not read the book nor seen the film.) The third time is unlikely to be the charm for the haters out there, as The Notebook is now a Broadway musical, running at the Gerald Schoenfeld Theatre through July 7. If this iteration is a hit, it won’t be because of quality, which it is sadly lacking. The show features underwhelming music and lyrics by American singer-songwriter Ingrid Michaelson and a tepid book by Bekah Brunstetter, who has written such plays as The Cake and Oohrah! and was a writer, story editor, and Emmy-nominated producer on This Is Us. Incorporating elements from both the novel and the film, the narrative moves between 1967, 1977, and 2021 in an unnamed mid-Atlantic town. John Cardoza, Dorian Harewood, and Ryan Vasquez portray the same character at three different times in The Notebook (photo by Julieta Cervantes) It opens with an older man watching two teenagers meet and fall instantly in love. “Time to get up, time to get up now / And let the bones crack into place / I look in the mirror, I see an old man / But in my eyes, a young man’s face,” the old man sings. “Time, time time time / It never was mine, / mine mine mine / But you know what is? / Love, hope, breath, and dreams / As cliché as that seems.” Cliché becomes a kind of leitmotif throughout the show’s 140 minutes (with intermission). In 2021, Noah (Dorian Harewood) is in an extended caregiving facility reading from a handwritten notebook to Allie (Maryann Plunkett), whose dementia is worsening. As he reads, scenes from the notebook are acted out onstage by the teenage Allie (Jordan Tyson) and Noah (John Cardoza) in 1967 and the twentysomething Allie (Joy Woods) and Noah (Ryan Vasquez) ten years later. The plot is the classic hardworking tough guy meets rich girl, rich girl’s parents (Andréa Burns and Dorcas Leung) break them apart, boy joins the army with his best friend (Carson Stewart), girl finds a respectable lawyer (Chase Del Rey) to marry, boy and girl imagine what might have happened had they stayed together. The older Noah believes that by telling the story to Allie over and over again, it might help her regain at least some of her memories, while the nurse (Burns) insists Noah follows the rules and his physical therapist (Stewart) tries to get him to get treatment for his ailing knee, but Noah has more important things on his mind. The narrative goes back and forth in time, occasionally with some Allies and Noahs watching the others. Diverse, race-blind casting is one of the best things to happen to Broadway in recent years, but The Notebook takes it to new, confusing levels. The three Noahs and the three Allies are different sizes, different heights, and different colors. Tyson and Cardoza lack the necessary chemistry to kick things off; Woods and Vasquez have more passion, but the story keeps their characters apart for too long. By the time you figure out what is happening with the older Noah and Allie, it’s too late, although there are a few touching moments between them near the end, and the handling of the painting is the most successful part of the show. Maryann Plunkett, Joy Woods, and Jordan Tyson portray the same character at three different times in The Notebook (photo by Julieta Cervantes) Codirectors Michael Greif (Dear Evan Hansen, Next to Normal) and Schele Williams (Aida, The Wiz) are unable to rein in the overall befuddlement on David Zinn and Brett J. Banakis’s rustic set, which switches from a nursing home to a historic house that needs significant work; there’s also a pool of water in the front of the stage where Allie and Noah swim and play. When boredom sets in, you can check out Ben Stanton’s lighting design, which features dozens of narrow, cylindrical, fluorescent lights hanging from the ceiling with bulbs at the bottom that make them look like big pens (that one might, say, use to write in a notebook?). The lighting also casts a cool shimmer when it focuses on the pool. The score, with arrangements by Michaelson and music supervisor Carmel Dean and orchestrations by Dean and John Clancy, can’t keep pace with the narrative, slowing it down dramatically. When teenage Allie asks teenage Noah if he has a pen and he says, “Why would I have a pen?,” I pointed up at the lights. When Middle Noah sings, “Leave the Light On,” I suddenly felt as if I were in a Motel 6 . And when the young Allie and Noah sing about his chest hair — twice — but Cardoza doesn’t have any, I wondered if it was meant to be a tongue-in-cheek joke. (If it was, it didn’t draw laughs.) It’s a treat to see Tony winner Plunkett (Agnes of God, Me and My Gal) and Emmy nominee and NAACP Image Award winner Harewood (Streamers, Jesus Christ Superstar), and Woods (Six, Little Shop of Horrors) nearly steals the show with her solo turn in “My Days”; when she sings, “Where am I going,” I could only think that she has a big future ahead of her. The musical probably has a big future ahead of itself too, naysayers be damned. [Mark Rifkin is a Brooklyn-born, Manhattan-based writer and editor; you can follow him on Substack here.]",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1096,
  "archivePath": "data/archives/reviews/the-notebook-2024/twi-ny-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:42:02.359Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}