{
  "showId": "a-soldiers-play-2020",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Jesse Green",
  "url": "https://www.nytimes.com/2020/01/21/theater/a-soldiers-play-review.html",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup",
    "show-score-playwright"
  ],
  "bwwExcerpt": "Onstage, though, the loud ticktock of the investigation too often drowns out the emotion - an effect perhaps enhanced by the flattening of the genre brought on by endless \"Law & Order\" spinoffs and reruns. In any case, whether \"A Soldier's Play\" is a great stage drama regardless of its flaws is something its bumpy but worthy Broadway debut, directed by Kenny Leon for the Roundabout Theater Company, cannot answer. Despite some powerful acting, it is too distracted to make the case.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-A-SOLDIERS-PLAY-Opens-On-Broadway-See-What-the-Critics-Are-Saying-20200121",
  "contentTier": "invalid",
  "showScoreExcerpt": "\"In ‘A Soldier’s Play,’ an Endless War Against Black Men: The Broadway premiere of Charles Fuller’s 1981 drama finds premonitions of today in the story of a 1944 murder.\"\n\nRead more",
  "rejectedAt": "2026-02-05T16:24:12.664Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be just a headline and teaser text ('Read more') rather than actual review content with critical evaluation; openai: The text provided is a headline and a prompt to read more, with no evaluative content or review of the production.; gemini: This is a headline and a brief description, not a full review with an evaluation of the show.; kimi: The text provided is only a headline and subheading describing the plot and themes ('finds premonitions of today in the story of a 1944 murder') with no evaluation of production quality, performances, or recommendation to see the show. It functions as a plot summary rather than a critical review.",
  "promptVersion": "5.2.0"
}