{
  "showId": "a-soldiers-play-2020",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2020/legit/reviews/a-soldiers-play-review-broadway-blair-underwood-1203475543/",
  "publishDate": null,
  "fullText": "Director Kenny Leon stages a crackerjack revival of this 1981 play that won the Pulitzer Prize for Drama.\n\nNow, that's what I call a play! Charles Fuller's Pulitzer Prize-winning drama “A Soldier’s Play,” now being revived on Broadway by Roundabout Theatre Company, packs plenty of dramatic tension into smoldering issues of racial justice and injustice, military honor and dishonor, and the solemn struggle to balance their harrowing demands on characters who are only human. A superb all-male ensemble, under the powerhouse direction of Kenny Leon, attacks this knock-your-socks-off drama with intense emotional passion and intellectual courage. Breathe slowly and keep your heartbeat steady if you hope to make it through this one without breaking up into little pieces.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'Muppet Show' Revival Trailer: Kermit, Miss Piggy Return for 50th Anniversary Special With Maya Rudolph and Sabrina Carpenter \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n 'American Idol' to Stream Live on Disney+ For the First Time, Launches Companion Podcast (EXCLUSIVE)\n\nThe play opens on a U.S. Army base in Louisiana during World War II, circa 1944. In the disturbing first scene, Tech Sergeant Vernon C. Waters (David Alan Grier — and you better genuflect when you say that name!) is drunk out of his mind and stumbling all over the place when he makes it back to the barracks in the middle of the night.\n\n“They still hate you! They still hate you!” he babbles — just as someone, sight unseen, pulls out a service pistol and shoots him down in cold blood.\n\nThe character of the dead sergeant haunts the rest of the play, at times demanding justice, at other times denying the conditions that resulted in his murder. Veteran of such Broadway shows as \"The First,\" \"Dreamgirls,\" and \"Porgy and Bess,\" Grier commands the stage, pacing back and forth during tense moments, at other moments hanging back and observing in ominous silence. It isn't his physical beefiness that accounts for his strong presence; it's the sense of power that he brings to the stage.\n\nThe glaringly obvious question, of course, is: Whodunit? But once the first and most obvious suspects of the Ku Klux Klan and the local rednecks are discounted, the play ceases to be a conventional murder mystery and more of a moral dilemma. Who, among this all-black company of soldiers, would not only eliminate one of their own, but also expose all the rest of them to the not exactly brotherly watch of the white military establishment?\n\nThe job falls to Captain Richard Davenport (Blair Underwood, built solid like a rock and just as dependable), who makes it a point of honor to follow the clues and pursue the suspects, come hell or worse. That kind of honor may be the stuff of heroic war yarns, but any attempt to exercise it in a segregated military unit based in white Louisiana in the 1940s is like putting your head on the block and stretching out your neck.\n\nFuller, who said \"A Soldier's Play\" was partly inspired his own experiences on a U.S. Army base, doesn't flinch from the deeper implications of racism in military services. A basic fact of life on any Army base, it plays out just as vividly — and cruelly — in segregated units like Company B, 221st Chemical Smoke Generating Company at Fort Neal, where the play is set.\n\nThe beauty of this production is the way the well-oiled ensemble works in sync to balance the racist structure of the unseen outside world with the more subtle social and political breakdown of life on this all-black Army base. One world not only reflects the other; each one accounts for the existence of the other. Plays about sports teams dramatically soar on the same dynamic, but nothing beats the Army for sheer drama, and Fuller works it to the max.\n\nAlthough the ensemble is the raison d'etre, individual cast members still shine. J. Alphonse Nicholson stands out as the young private from Mississippi who loves his guitar and lives for the blues. (\"There ain't no any other kind of music.\") Nnamdi Asomugha is a sweetheart as the kid from Alabama who misses home as much as it misses him.\n\nBut in the world outside the Army – otherwise known as \"the real world\" — nothing can entirely replicate the false dynamics of barracks life. Just ask Waters, who pathetically meets his death crying, \"I killed myself for you ... And nothing's changed.\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Director Kenny Leon stages a crackerjack revival of this 1981 play that won the Pulitzer Prize for Drama.\"\n\nRead more",
  "contentTier": "complete",
  "contentTierReason": "Only aggregator excerpts available",
  "textWordCount": 733,
  "archivePath": "data/archives/reviews/a-soldiers-play-2020/variety--marilyn-stasio_2026-02-06.html",
  "textFetchedAt": "2026-02-06T02:39:28.280Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "duplicateTextOf": "variety--aramide-tinubu.json",
  "wordCount": 733,
  "tierReason": "Full review text",
  "sources": [
    "show-score-playwright"
  ]
}