{
  "showId": "some-like-it-hot-2022",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Frank Scheck",
  "url": "https://nystagereview.com/2022/12/11/some-like-it-hot-old-fashioned-musical-comedy-to-a-fault/",
  "publishDate": "2022-12-11T21:52:38",
  "fullText": "“Musical comedy, the most glorious words in the English language,” famously declared Broadway producer Julian Marsh in 42nd Street. It’s a saying that the creators of the new Broadway musical Some Like It Hot have clearly taken to heart. From its opening moments to its last, the show practically wears itself out attempting to pull out all the stops with the sort of theatrical pizzazz designed to wow both musical theater fanatics and tourists alike. If at times the strenuous efforts feel too exhausting, bless their hearts for trying so hard.\n\nBased on Billy Wilder’s classic 1959 screen comedy starring the immortal trio of Jack Lemmon, Tony Curtis, and Marilyn Monroe, this musical (like the previous adaptation, 1972’s Sugar) delivers a madcap romp concerning two Depression-era male musicians (Christian Borle, J. Harrison Ghee) who pretend to be women after witnessing a gangland murder. Donning drag, they join an all-female band, with farcical and romantic complications ensuing as one of them falls in love with the band’s sultry lead singer, Sugar (Adrianna Hicks).\n\nEverything about the production feels deliberately old-fashioned, from its pastiche-like score to its elaborate production numbers to its broad, farcical humor. It almost seems designed in a lab, albeit one populated by scientists who grew up listening to vintage Broadway cast albums. That the show works to the extent that it does is a testament to the formidable talents of its creators, including composer/co-lyricist Marc Shaiman and lyricist Scott Wittman (Hairspray, Catch Me if You Can), book writers Matthew Lopez (The Inheritance) and Amber Ruffin (Peacock’s The Amber Ruffin Show), and, perhaps most importantly, director/choreographer Casey Nicholaw, who brings to this fast-paced production the same effervescence and flair he delivered in such shows as the not dissimilar The Drowsy Chaperone.\n\nAnd yet, it’s hard to escape the feeling that there’s simply not much there there. The show moves like clockwork, delivering extravagant choreography, some terrific performances, and plenty of laughs in its hyper-efficient two-and-a-half hours. But you somehow feel like you’ve seen it all before. Not only in Wilder’s 63-year-old film, which somehow feels far edgier despite this version’s updated attitudes toward sexuality and ethnicity, but also in the countless Broadway musical comedies that have preceded this new adaptation.\n\nEveryone involved tries hard, very hard, to entertain you, as if hoping to provide some old school Broadway musical comedy relief after the tough years we’ve endured recently. So it’s hard to begrudge their efforts, even if the actual material feels thin. The performers are often very funny, but more often because of the way they punch up the jokes rather than the jokes themselves. Borle has by now proven himself a master at this sort of thing with his work in such shows as Peter and the Starcatcher, Something Rotten! and Spamalot. He works the same magic here, proving hilarious as the wisecracking Joe who transforms into the less than comely Josephine. Equally terrific is NaTasha Yvette Williams, as the perpetually disgruntled bandleader Sweet Sue, and Kevin Del Aguila, who virtually steals the show as the daffy millionaire Osgood who falls in love with Daphne (Ghee), not knowing that she is actually a he. At one point he engages in a frenetic dance to music he hears only in his head, and he’s so damn funny doing it that you start hearing the music yourself. He also manages to turn a harmless line about how “hard” it is to own yachts into one of the show’s funniest moments just by the way he places the emphasis on the word.\n\nThe statuesque Ghee has such a commanding, physically imposing stage presence that Daphne becomes a force of nature even though the character isn’t really given that much to do. The performer, who at one point played Lola on Broadway in Kinky Boots, stops the show with the standout number “You Coulda Knocked Me Over With a Feather,” in which Jerry/Daphne discovers that they are very fulfilled by their new non-binary identity.\n\nWhich leads to one of the more significant aspects of the show, namely its updating of the story with current attitudes that are occasionally presented in heavy-handed fashion: “What do I call you? Jerry? Daphne?” a confused Joe asks his partner. “Either is fine as long as you do it with love and respect,” Daphne replies, cueing inevitable audience applause. We also learn that Osgood was born in Mexico and that his real name is Pedro Francisco Alvarez, a bit of backstory that would have confused Joe E. Lewis, who played the character so memorably in the film.\n\nThe only lead performer who comes up short is Hicks (a recent graduate of Six), who more than delivers the goods vocally in such soaring numbers as “A Darker Shade of Blue” and “Ride Out the Storm” but never exerts the level of sultriness or vulnerability that the role of Sugar demands. It’s no wonder that Borle’s Joe, for all his randiness, seems half-hearted in his attempts to seduce her.\n\nShaiman’s music is tuneful enough, with the title number being downright catchy. But the songs never quite take hold, and the lyrics are disappointingly generic rather than displaying the wit the farcical storyline deserves. And while Nicholaw keeps things moving briskly and energetically, whipping the large ensemble into one dynamic production number after another, eventually they begin to feel formulaic. There’s so much tap dancing that you start to wonder if he’s being paid by the tap, and a frenzied chase scene, complete with doors being brought onstage just for the purpose of being slammed, is expertly orchestrated but so reminiscent of Jerome Robbins’ “Bathing Beauty Ballet” from High Button Shoes that his estate should be seeking royalties.\n\nFor the most part, Some Like It Hot succeeds in its aim of simply entertaining its audiences with those two most glorious words in the English language. And for many, that will be more than enough. But it’s hard not to wish that the show could have reached a higher temperature.\n\nSome Like It Hot opened December 11, 2022, at the Shubert Theatre. Tickets and information: somelikeithotmusical.com",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial"
}
