{
  "showId": "some-like-it-hot-2022",
  "outletId": "observer",
  "outlet": "Observer",
  "criticName": "Rex Reed",
  "url": "https://observer.com/2022/12/review-some-like-it-hot-is-the-joyous-broadway-musical-people-have-been-praying-for/",
  "publishDate": null,
  "fullText": null,
  "isFullReview": false,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Few things in show business are as genuinely, indestructibly, and reliably close to perfect as Some Like it Hot—every time it comes out of the starting gate it leaves audiences cheering. Billy Wilder’s historic 1959 film has been anointed one of the ten greatest comedy classics of all time in every poll taken by both real people and movie critics alike. Sugar, Gower Champion’s 1972 Broadway musical adaptation, produced by David Merrick with an amiable score by Jule Styne and Bob Merrill, starring luscious Elaine Joyce, funny Tony Roberts, and the sensational Robert Morse, ran for more than a year. Now here it is again, dusted off slightly to reflect contemporary values and trends, but still following the same basic plot outline—ready to pack in new sold-out audiences as long as they remember how to laugh and applaud and scream like mad. At a time when so much trash crowds New York marquees passing itself off as entertainment, the new Some Like it Hot at the Shubert Theatre is a star-spangled, toe-tapping, show-stopping lollapalooza!",
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "\"Whatever reservations I have are far outweighed by the constant, good-natured energy, unflagging humor, and the show-stopping tap dancing that keeps everything moving at racetrack speed.\"\n\nRead more",
  "contentTier": "excerpt",
  "contentTierReason": "Only aggregator excerpts available",
  "playbillVerdictUrl": "https://observer.com/2022/12/review-some-like-it-hot-is-the-joyous-broadway-musical-people-have-been-praying-for/",
  "sources": [
    "show-score-playwright",
    "playbill-verdict",
    "bww-reviews"
  ],
  "bwwScore": 9
}
