{
  "showId": "real-women-have-curves-2025",
  "outletId": "digital-journal",
  "outlet": "Digital Journal",
  "criticName": "Markos Papadatos",
  "url": "https://www.digitaljournal.com/entertainment/review-real-women-have-curves-is-a-new-musical-on-broadway/article",
  "playbillVerdictUrl": "https://www.digitaljournal.com/entertainment/review-real-women-have-curves-is-a-new-musical-on-broadway/article",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "“Real Women Have Curves” is a new Broadway musical that is being performed at the James Earl Jones Theatre in New York City. “Real Women Have Curves” is a new Broadway musical that is being performed at the James Earl Jones Theatre in New York City. It is based on the play by Josefina Lopez that inspired the iconic hit HBO film “Real Women Have Curves,” with music by Grammy-winning composer Joy Huerta and direction from Tony Award winner Sergio Trujillo. In “Real Women Have Curves,” Ana García (Tatianna Córdoba) dreams of flying away. When her family’s East Los Angeles garment business receives a make-or-break order for 200 dresses, Ana finds herself juggling her own ambitions, her mother Carmen’s (Justina Machado) expectations, and a community of women all trying to make it work against the odds. Tatianna Córdoba is a triumph as Ana Garcia, while Justina Machado is Tony-worthy and sensational as her mother Carmen Garcia. Everybody in the cast is noteworthy and diverse, and able to offer something different and distinct to the story. The musical score by Joy Huerta and Benjamin Velez is quite impressive as well, and it elevates the show to a higher level. Overall, “Real Women Have Curves” is a mighty and weighty celebration of culture and life. It is witty, enthralling, joyous, poignant, and thoroughly entertaining. There is something in it for everybody. The energy on stage is infectious, the acting performances all around are remarkable, and Sergio Trujillo is able to bring Josefina López’s play to life in a raw, authentic, and organic manner. “Real Women Have Curves” garners 4.5 out of 5 stars. Well done. To learn more about “Real Women Have Curves,” check out the official website.",
  "isFullReview": true,
  "textWordCount": 286,
  "archivePath": "data/archives/reviews/real-women-have-curves-2025/digital-journal--markos-papadatos_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:13:01.710Z",
  "originalScore": "5/5",
  "originalScoreNormalized": 100,
  "scoreSource": "numeric-stars",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "playwright"
}