{
  "showId": "real-women-have-curves-2025",
  "outletId": "newyorktheater-me",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://newyorktheater.me/2025/04/27/real-women-have-curves-broadway-review/",
  "publishDate": null,
  "fullText": "This musical about mostly undocumented immigrants in a L.A. dress factory has heart, something in short supply these days, especially when it comes to immigrants. It also features bellies. In the catchy title song, the factory ladies disrobe down to their undergarments. These are zaftig women – full-figured, fleshy, curvaceous. None of them you should call “fat” – they’re too comfortable in their bodies to be labeled that. “Real Women Have Curves,” which has opened tonight at James Earl Jones Theater, marks choreographer Sergio Trujillo’s Broadway directorial debut. If it has a predictable plot, it’s all these women together, and the proud characters they portray in the show, that make it work. “Make It Work” is the title of the first of twenty tuneful and rhythmic musical numbers in the show, and the guiding principle of its characters. They see the broken fan, or the shortage of thread, or their fear of la migra, as just obstacles to work around: “If you prick your finger…make sure the fabric’s red/When something breaks/Make it work instead.” “Real Women Have Curves” began life as a play, first produced in 1990, written by Josefina López, who had been an undocumented Mexican immigrant in L.A. until granted amnesty at age 18 under the provisions of the 1986 Immigration Reform and Control Act. She briefly worked in her sister’s East Los Angeles sewing factory, along with their mother. Her experience serves as the obvious model for the lead character of Ana. The play was set in 1987 in the L.A. neighborhood of Boyle Heights — which remains the time and place in the musical. The play was made into a movie in 2002, which marked the feature film debut in the role of Ana of then-teenage America Ferrera, the daughter of Honduran immigrants. The most memorable scene in the movie, as in the musical, was the disrobing of the women who were sweltering in the factory; indeed, one might guess it’s the scene that inspired the adaptation. Ferrera went on to win an Emmy for her starring role as Betty Suarez in the TV series “Ugly Betty” and then an Oscar nomination for her role in the movie Barbie (by which time she had long since lost the ability to be called zaftig.) Tatianna Córdoba is a worthy successor in the role, making an impressive Broadway debut as a high school senior who is the younger sister of Estela (Florencia Cuenca, another Broadway newcomer) who owns the factory. Ana wants to become a journalist. Their mother Carmen (veteran Justina Machado) wants both her daughters to find husbands. She also wants Ana to help out in the factory. Estela has just received a rush order for two hundred dresses in three weeks (The job became available because “Immigration” has raided the factory that had been making the dresses.) Ana doesn’t know how to sew a button, but she is the only American citizen in the factory, and in the family. “Everything in our house is in her name. And now she can do more for the business. She can call the bank, deal with the landlord, the city.” Ana reluctantly signs on, but keeps her internship at a local newspaper as well, where she meets another teenage intern, Henry (Mason Reeves), providing a love interest I don’t recall from the movie, and a great excuse for some lively duets. As the musical unfolds, we get to know the other characters. A subplot involves Aline Mayagoitia as Itzel, a 19-year-old indigenous Guatemalan, who winds up getting caught by Immigration. Ana tries to help, but worries that her involvement might endanger the other women in the factory. Itzel sings “If I Were A Bird.” Here is a video of Mayagoitia singing with the songwriter Joy Huerta. (In the show it’s with Ana) The musical numbers are not the only highlights. The dresses by Wilberth Gonzalez and Paloma Young stand out — when they’re floating in the air, but even more so when these hardworking women wear them, showing what real glamour looks like. Real Women Have CurvesJames Earl Jones TheaterRunning time: Two hours and 15 minutes, including an intermissionTickets: $48 – $299. Digital lottery and rush: $59. General rush: $49Music and lyrics by Joy Huerta and Benjamin Velez, book by Lisa Loomer with Nell Benjamin, based on the play by Josefina López and HBO’s Real Women Have Curves screenplay by Josefina López and George LaVoo; Directed and choreographed by Sergio TrujilloMusic supervision by Nadia DiGiallonardo. music direction by Roberto Sinha, orchestrations by Nadia DiGiallonardo, Joy Huerta, Rich Mercurio, and Benjamin VelezScenic design by Arnulfo Maldonado, costume design by Wilberth Gonzalez and Paloma Young, lighting design by Katz, sound design by John Shivers, video design by Hana S. Kim, hair, wig, and make-up design by Krystal Balleza & Will VicariCast: Tatianna Córdoba as Ana, Justina Machado as Carmen, Florencia Cuenca as Estela, Shelby Acosta as Prima Flaca, Carla Jimenez as Pancha, Aline Mayagoitia as Itzel, Mauricio Mendoza as Raúl, Mason Reeves as Henry, Jennifer Sánchezas Rosalí, Sandra Valls as Prima Fulvia, Ariana Burks, Quincy Hampton, Zeus Mendoza, Claudia Mulet, Christopher M. Ramirez, Monica Tulia Ramirez, Shadia Fairuz, Elisa Galindez, and Omar Madden. Broadway Finale! Tony Anticipation. Stageworthy News of the WeekApril 28, 2025In \"New York Theater Weekly Summary\" 2025 Dorian Theater Award NominationsMay 14, 2025In \"Awards\" Poll: Broadway Showstopper of 2025?May 14, 2025In \"Awards\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 894,
  "archivePath": "data/archives/reviews/real-women-have-curves-2025/newyorktheater-me--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:23:41.505Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}