{
  "showId": "real-women-have-curves-2025",
  "outletId": "pagesonstages-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.com/2025/04/27/real-women-have-curves/",
  "publishDate": null,
  "fullText": "Real Women Have Curves – 25 April 2025 Real Women Have Curves was speaking my language from the moment I entered the theatre and saw the gorgeous mural that set the tone for story that, like a mural, is tough to create but capable of enduring for a long time as part of the fabric of a city. Showcasing the one US citizen, Ana Garcia (Tatianna Córdoba) living amongst a family of undocumented immigrants, Real Women Have Curves challenges traditional concepts of what it means to be strong, shocks modern audiences with how people live every day with very real thoughts about deportation, and still makes time for beautiful dresses, great dance numbers, reclamation of identities, and big dreams. Primarily focused on this daughter of immigrants’ struggle between her desire to fly away to Columbia University to be a journalist and her familial obligations to stay in LA to keep everybody safe, Ana struggles with having a foot in each world and her deeply rooted need to remain on both paths for as long as she can. This musical, though not quite a slice of life, holds space for multiple characters to share their stories, which reinforces the diversity of the immigrant population and deeply humanizes and celebrates that people come here for lots of reasons, but ultimately stay because they want to be here. As lines subtlety and artfully inserted into the show remind us, they pay taxes, work multiple jobs, own businesses, and raise children who go to great schools and become part of improving society for the better. As indicated in the title, it shares messages of feminism and body positivity, including a queer coded character, Prima Fulvia (Sandra Valls). It was beautiful that Prima Fulvia was accepted without explanation. She was costumed (Wilberth Gonzalez, Paloma Young) in masculine clothing, and, in the scene where everyone disrobed, was wearing a tank top and boxers while others were in bras, slips, shorts, panties, etc. Even the variety in underwear spoke to the celebration of individuality and the importance of not making assumptions that people who look alike are alike. This story was not all sunshine and rainbows. I’d be remiss not to mention Itzel (Aline Mayagoitia), the beautiful woman with the voice of a songbird who is taken by La Migra, forcibly detained, and deported. Her dreams of flying at an altitude high enough where land has no borders become thematic throughout the story as she inspires Ana and others to transcend the rules and go wherever they want to be. It’s actually the beginning of a movement within the dress factory women– Itzel inspires Ana who reignites the passion in Estella (Florencia Cuenca) who supports Carmen (Justina Machado) who emboldens Pancha (Carmen Jimenez) and so on and so forth… These women support each other and, as a collective, showcase as many different ways to live as there are people on stage. From aesthetic moments with the ghosts of the dead and left behind to a disco ball shaped like a dress to choreography spanning sensual, bold, and wacky, director Sergio Trujillo tells this story with love, nuance, and a little bit of everything. It is a perfect microcosm of a world that some in America are unaware of despite it being many people’s lifeblood. This story is incredibly entertaining, full of clever bilingual word play (I see, ay si), characters with a lot to love despite their flaws, music (Joy Huerta, Benjamin Velez) that makes the audience move in their seats, a book (Lisa Loomer, Nell Benjamin) that not only advances the plot but also enhances the story with its perfect integration into the structure of the show, and breathtaking collaboration between the scenic (Arnulfo Maldonado), lighting (Natasha Katz), and video (Hana S. Kim) designers. Sound design (John Shivers) was a little rough. At times, the band was mixed far above the vocals, and I struggled with clarity of the words. There were also times when I could tell that the singers were singing a chord, but the melody was dramatically louder such that I couldn’t hear the full richness of the score. In addition to the wildly beautiful moments, pain, shame, and anger were also intensely part of this story. The book and lyrics did an incredible job of helping an American audience understand why a mother might be ashamed of sending a daughter to a prestigious university and the difficult choice to leave a friend behind in a detention center for fear of landing others in detention centers (USA tends to be, “no man left behind”). Yet these are not necessarily cultural differences– this is the culture of immigrants in America, a culture that is so deeply stitched into the fabric of American culture that it is inseparably intertwined. There is more than one way to be American, just as there is more than one way to be beautiful. Real Women Have Curves does a great job of keeping it real– a little bit funny, a little bit cheeky, a little bit sarcastic, a little bit bold, brash, risky, exciting, infuriating, hopeful, dramatic, absurd, fun, ambitious, and brave. This show, like its characters, is teaming with life. It reinforces that, even in dark moments, life is worth fighting for. Hard work and a little nerve can get you anywhere you want to go– but it’s easier when surrounded by support. The number one quality that makes this cast and ensemble stand out is that real women have each other’s backs. In the words of the opening number, real women, “make it work.” I attended this performance on a press pass from Rubenstein.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 937,
  "archivePath": "data/archives/reviews/real-women-have-curves-2025/pagesonstages-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:23:56.911Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}