{
  "showId": "real-women-have-curves-2025",
  "outletId": "theatrereviews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theatrereviews.com/broadway-review-real-women-have-curves-the-musical-at-the-james-earl-jones-theatre-currently-on/",
  "publishDate": null,
  "fullText": "The somewhat recognizable journey from play, to film, and finally to musical delivers the new “Real Women have Curves” to the James Earl Jones Theatre on Broadway. It has morphed into a small musical with a big heart. The book by Lisa Loomer and Nell Benjamin is based on the play by Josefina Lopez and the screenplay by Ms. Lopez and George LaVoo. The storyline and plot are familiar and somewhat predictable, making it difficult to provide any surprising twists or turns. Music and Lyrics by Joy Huerta and Benjamin Velez are simple and smart, but too often lack the Mexicana influence and rhythm. Not all the musical numbers advance the plot, and some in particular are inserted for pure entertainment value. The major fault of Director and Choreographer Sergio Trujillo is the attempt to make this perfectly fine, small, and intimate musical bigger than it needs to be. Unnecessary major scene changes and production numbers, along with extraneous and distracting background fillers, only diminish the focus of the production, which of course are the women. The musical works best when kept in the dress factory where it belongs, along with being supported by family conflicts that arise at home. The other question is whether it is the right time to present a musical comedy, containing a plotline about illegal immigration, that is sometimes overshadowed by personal family issues, given the present political climate. Although the two themes meld quite nicely, it is difficult for one not to distract from the other. The problems revealed in relationships between mother and daughter, two sisters, husband and wife, and family and boyfriend of the younger sister, at times slow down the momentum by introducing so many subplots. The storyline about a family of Mexican immigrants, takes place in the Boyle Heights section of Los Angeles in 1987, and revolves around the older sister Estela (a determined Florencia Cuenca), who is trying to run a successful dress factory. Younger sister Ana (a progressive Tatianna Cordoba) has dreams of becoming a journalist and has been accepted to Columbia University on a full scholarship. Their mother Carmen (a domineering Justina Machado), believes Ana should stay home and help her family by working in the dress factory. Carmen disagrees with her husband Raul (an honest and faithful Mauricio Mendoza) about this issue, since he wants his daughter to follow her dreams, whatever they may be, like he did when he decided to immigrate to America for a better life for himself and his family. Add in Ana’s first boyfriend Henry (a sweet Mason Reeves), who is not Mexican; a shady and evil dress distributor Mrs. Wright (a villainous Monica Tulia Ramirez); an immigration raid at the pillow factory next door; Itzel, one of the dressmakers (a resolute Aline Mayagoitia) getting deported; a make or break crisis at the dress factory, and there is certainly enough going on to keep the audience’s attention. One of the latest offerings to open on the Great White Way is no stranger to New York theatre audiences since it has had several productions Off Broadway since the mid-2000s, after it was developed by Upright Citizens Brigade Theatre as a forty-five-minute, one act. In this present, over produced,… The charming new musical, “Maybe Happy Ending,” now playing at the Belasco Theatre, with music composed by Will Aronson and the book and lyrics penned by Mr. Aronson and Hue Park, will certainly make an audience leave the theatre smiling and thinking. Unlike many of the big, bombastic musicals arriving… Unless your bucket list includes testing the limits of your eardrums before they tear beyond repair, after exposure to unbearable decibels, it would be prudent to avoid the new jukebox musical “Rolling Thunder” which is currently playing at New World Stages – Stage 3. With book by Bruce Hallett and…",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 636,
  "archivePath": "data/archives/reviews/real-women-have-curves-2025/theatrereviews-com--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:24:02.969Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}