{
  "showId": "real-women-have-curves-2025",
  "outletId": "THSCENE",
  "outlet": "TheaterScene.net",
  "criticName": "Unknown",
  "url": "https://www.theaterscene.net/musicals/broadway/real-women-have-curves/victor-gluck/",
  "publishDate": null,
  "fullText": "Posted on May 9, 2025 by Victor Gluck, Editor-in-Chief in Broadway, Musicals Jennifer Sánchez, Aline Mayagoitia, Sandra Valls, Florencia Cuenca, Shelby Acosta and Carla Jimenez in a scene from the new musical “Real Women Have Curves” at the James Earl Jones Theatre (Photo credit: Julieta Cervantes) Although the new Broadway musical Real Women Have Curves about the aspirations of Mexican immigrant women in Los Angeles’ Boyle Heights neighborhood could not be more timely, it is based on the 1990 play by Josefina López and the 2002 film version co-written by López and George LaVoo. The musical with a score by Grammy Award-winner Joy Huerta and the Jonathan Larson, Fred Ebb and Kleban Award-winner Benjamin Velez and a book by playwrights Lisa Loomer (The Waiting Room and Living Out) and Nell Benjamin (Broadway’s Mean Girls and Legally Blonde, Regional shows: Because of Winn Dixie; Sarah, Plain and Tall), is the feel-good show of the season, making us root for the characters to succeed. The musical opens up the original story line (as did the film) to go beyond the confines of the factory where all the women characters work. It follows Ana, a recent Los Angeles high school graduate and a citizen whose family are all undocumented aliens, as she tries to arrange to get her family to accept her full scholarship to Columbia University to study journalism. Unfortunately, her mother Carmen can only see a traditional path for her working in her sister Estela’s dress factory which has been given an order for 200 dresses to be ready in three weeks but can’t afford to hire more help. Florencia Cuenca, Tatianna Córdoba and Justina Machado in a scene from the new musical “Real Women Have Curves” at the James Earl Jones Theatre (Photo credit: Julieta Cervantes) Ana already has a summer internship at a local paper, The Eastside Beat, but it is unpaid and her mother would rather she donate her time to the factory. As the women who work there are all undocumented immigrants they cringe in fear whenever the U.S. immigration department makes a raid in the neighborhood, turning off the lights not to appear to be around. However, it is the time of the Reagan Administration and a new amnesty has been enacted which would help all of the women if they apply except Ana’s sister Estela who has a traffic violation from when she was a teenager. How Estela struggles to meet her deadline, how Ana balances her work at the factory and her internship, as well as her new relationship with African American Henry, (on his way to Wesleyan University in the fall) assigned to her as photographer, and how her parents Carmen and Raúl deal with their daughters’ different needs is the story of the show which is semi-autobiographical from López’s own life. The title refers to the plus size women that populate the factory, mostly very comfortable with their figures, though Carmen never stops criticizing Ana about her weight. Mason Reeves and Tatianna Córdoba in a scene from the new musical “Real Women Have Curves” at the James Earl Jones Theatre (Photo credit: Julieta Cervantes) Not only is the show authentically written with Spanish sprinkled throughout, (much of it perfectly obvious as to its meaning,) but Sergio Trujillo’s superb production which he has both directed and choreographed, has been cast with an almost entirely Hispanic cast who are utterly engaging. Best is Justina Machado, a Broadway veteran of In the Heights and A Free Man of Color, as the indomitable Carmen who can only imagine one path – though she herself left everything behind in Mexico to come to the United States. Following a close second are Broadway debuting Tatianna Córboda as the feisty Ana who has learned how to run rings around her elders and also debuting Florencia Cuenca as her weary sister Estela who has the weight of everyone’s aspirations on her shoulders. So well written is the book that the other factory women are immediately individual people: Jennifer Sánchez as Rosalí who wants to be slim at any cost; Carla Jimenez as the curvaceous Pancha who enjoys coming to work to get away from her two rambunctious twin sons; Sandra Valls as Prima Fulvia who is comfortable dressing as a man and can fix anything. Aline Mayagoitia is heartbreaking as sewer Itzel, the new Guatemalan refugee who has to deal with the immigration department in a way the others don’t. Mauricio Mendoza and Justina Machado in a scene from the new musical “Real Women Have Curves” at the James Earl Jones Theatre (Photo credit: Julieta Cervantes) Also moving is Mauricio Mendoza as the compassionate and soft-spoken Raul, Carmen’s husband and father to Estela and Ana, who is much more open to change than his wife. As Henry, Ana’s love interest, Mason Reeves is quite charming as the inexperienced but quick study high school graduate who also wants to go into journalism. The talented ensemble play an assortment of Angelinos as well as doubling as the mariachi band heard at the end of the show. Huerta and Velez’s Mexican and Broadway tinged score does not have a weak link in it. Early in the show, each of the main characters has an “I Want” song cleverly defining her character: Estela’s “Make It Work,” Carmen’s “De Nada,” Ana’s “Flying Away,” and Itzel’s “If I Were a Bird.” Of course, the best number in the show is the title song sung by all six women in the factory after they have taken off their tops to reveal their curves because of the lack of air conditioning. Two songs are excellent lead-ins to dance numbers: Henry and Ana’s “Already Know You” and Raúl and Carmen’s “Life Is Like a Dance.” Aside from Trujillo’s smooth direction, his energetic and varied dances include the tango and swing dancing to arrangements by Nadia DiGiallonardo, Jaime Lozano, Rich Mercurio and composers Huerta and Velez. Florencia Cuenca and the company of the new musical “Real Women Have Curves” at the James Earl Jones Theatre (Photo credit: Julieta Cervantes) Wilberth Gonzalez and Paloma Young’s costumes are a riot of color as are Arnulfo Maldonado’s settings. All of this is bathed in pink, blue and purple lights by designer Natasha Katz. The sets are enhanced by Hana S. Kim’s atmospheric video design showing scenes of L.A.’s Boyle Heights. Considering the number of actresses in the musical, Krystal Balleza and Will Vicari’s hair, wig and makeup design is much in evidence offering the different characters their own unique look. Not only is Real Women Have Curves a joyous entertainment, it is also a moving tribute to the Mexican immigrant experience. Real Women Have Curves (through June 29, 2025) James Earl Jones Theatre, 138 W. 48th Street, in Manhattan For tickets, call Telecharge at 212-229–6200 or visit http://www.realwomenhavecurvesbroadway.com Running time: two hours and 20 minutes including one intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1145,
  "archivePath": "data/archives/reviews/real-women-have-curves-2025/thscene--unknown_2026-01-26.html",
  "textFetchedAt": "2026-01-26T23:24:09.694Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}