{
  "showId": "two-strangers-bway-2025",
  "outletId": "CSCE",
  "outlet": "Culture Sauce",
  "criticName": "Thom Geier",
  "url": "https://culturesauce.com/2025/11/20/two-strangers-carry-a-cake-across-new-york-broadway-review/",
  "publishDate": "2025-11-20",
  "fullText": "Theater &#8216;Two Strangers Carry a Cake Across New York&#8217; is a sweet musical confection (Broadway review) Sam Tutty and Christiani Pitts in &#039;Two Strangers Carry a Cake Across New York (Photo: Matthew Murphy) Date: November 20, 2025 Author: Thom Geier 3 Comments Every now and then, an enchanting new musical classic comes along out of nowhere. Two Strangers Carry a Cake Across New York , which opened Thursday at Broadway&#8217;s Longacre Theatre, is a modern musical romance that has the feel of an old-fashioned movie but also the look and sound of a story that could only take place in 2025. Let&#8217;s start with the pitch-perfect two-person cast: Sam Tutty, a British Olivier winner for Dear Evan Hansen , glistens as a movie-obsessed, not-terribly-bright British lad named Dougal who&#8217;s flown into New York City to attend the wedding of his father, who abandoned his mom and him before his birth and seldom contacted him throughout his boyhood. Christiani Pitts, a Broadway veteran from King Kong and A Bronx Tale , warms to Dougal&#8217;s charms as his accidental tour guide, Robin. She&#8217;s the sister of the father&#8217;s new bride who&#8217;s been tasked with a series of wedding chores, including picking Dougal up from the airport and delivering the four-tiered wedding cake from a Brooklyn bakery to her sister&#8217;s fancy Manhattan apartment. (She&#8217;s rightly horrified when he jokingly calls her &#8220;Aunty Robin.&#8221;) The two have a meet-cute at JFK that leads into one of the most delightful, upbeat, and infectious opening numbers in recent memory, a celebration of New York City from the point of view of a wide-eyed outsider who hasn&#8217;t fully grasped all the details about the &#8220;cinema city&#8221; of his dreams &#8212; a place that he mistakenly thinks is the capital city of the U.S. as well as &#8220;Tinsel Town&#8221; and the &#8220;City of Sin.&#8221; Tutty delivers it with guileless gusto, shifting from the enthusiastic patter of the stanzas to the belting grandeur of the refrain. Expect this to become a standard for theater kids everywhere &#8212; along with much of the rest of Jim Barne and Kit Buchan&#8217;s score. The duo, who also wrote the book, have packed their show with pop-tinged bops that are as catchy as Velcro while also illuminating details about the unlikely couple at the center of their original story. Sam Tutty and Christiani Pitts in &#8216;Two Strangers Carry a Cake Across New York (Photo: Matthew Murphy) Robin doesn&#8217;t know what to do with Dougal, his innocence and naked desire for companionship especially, but she soon develops a sisterly (and then perhaps slightly more-than-sisterly) bond with this boy who seems just as stuck in a mid-20s professional rut as she is. While Dougal seems content with his dead-end job at a movie theater, Robin yearns for something more than the café waitress job she&#8217;s been working for years while trying to figure out what she actually wants to do with her life. It&#8217;s a feeling she articulates in a bittersweet ballad called &#8220;Be Happy&#8221; that fleshes out the anxiety of achievement commonplace to twentysomethings everywhere. Robin and Dougal also share a sense of rejection by their families &#8212; in Robin&#8217;s case, for reasons that are only gradually revealed over the course of the show. (Her self-imposed distance from a beloved grandmother is never satisfactorily explained.) Both are in pretty fragile places when it comes to this wedding, hoping to reconnect with family members from whom they&#8217;ve become estranged. Over the course of their adventures around the city &#8212; including a frenetic spending spree through department stores, late-night clubs, and a suite at the Plaza Hotel on a borrowed credit card in the effervescent Act 1 closer, &#8220;American Express&#8221; &#8212; they both open their eyes to certain hard truths about themselves, each other, and their place in the grown-up world. Christiani Pitts and Sam Tutty in &#8216;Two Strangers Carry a Cake Across New York (Photo: Matthew Murphy) Director-choreographer Tim Jackson has given the show an almost fairy-tale quality in its striking physical production. His two stars circle each other on a simple but versatile turntable set (designed by Soutra Gilmour and cleverly lit by Jack Knowles) that features two stacks of oversize luggage that open up to reveal closets and diners and beds. The set evokes not only the skyline of the city but also the liminal nature of a story where both characters are in a perpetual state of transition, clutching packages and suitcases on their way to someplace else. Gilmour also supplied the bright-hued costumes, including an &#8217;80s-style color-blocked jacket that Dougal wears because it once belonged to his dad. Tutty, with his Brillo-like head of ginger hair and facial stubble, is a like a cartoon golden retriever come to life &#8212; and his bright, clear tenor underscores his character&...",
  "originalScore": null,
  "assignedScore": 95,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T05:12:08.191Z"
}