{
  "showId": "two-strangers-bway-2025",
  "outletId": "NYDN",
  "outlet": "New York Daily News",
  "criticName": "Chris Jones",
  "url": "https://www.nydailynews.com/2025/11/20/broadway-review-two-strangers-carry-a-cake-across-ny-is-cute-but-too-long/",
  "publishDate": "2025-11-20",
  "fullText": "Subscribers are entitled to 10 gift sharing articles each month. These can be shared with friends and family who are not subscribers. Subscribe now! or Sign in to your account. Those goofy, nerdy Brits love New York City. So much so that they would happily carry a wedding confection all the way across Manhattan. Just as long as they could stop to drink in all the juice of the Big Apple. Such is the premise of the sweet, slight, Gen Z-friendly tuner from London, “Two Strangers Carry a Cake Across New York.” As penned by Jim Barne and Kit Buchan and directed by Tim Jackson, this is a twee, two-character rom-com that could easily be a Hallmark holiday musical, a similarity that the writers clearly anticipated, since their 20-something characters often say things like “if this were a movie, we would . . ,” usually before doing what they say characters in a movie would do. So at least they got ahead of their own familiar story. Dougal is a naive but limitlessly optimistic (and maybe virginal) Brit, played by Sam Tutty, who has journeyed to New York for his expat dad’s wedding, Marmite in his suitcase. His whole life has been “Where’s dad?” but he could not be more excited: “I’ll stroll up the Broadway, I’ll order a beer. I’ll scream at the State of Liberty. Hey Lady, I’m Walking Here.” You get the idea. There are a lot more of those kinds of lyrics. He is met at JFK by the pressed-into-wedding-duty Robin (Christiani Pitts) a more cynical (shocker!) New Yorker, who is the barista sister of the woman Dougal’s estranged Dad is marrying, so technically Dougal’s new aunt. Robin, a Tinder-using server who can barely make rent (shocker!), has her stuck-in-place issues and needs to open up her chilly Gotham heart to sweet Dougal, the puppyish young gent who sings “It’s another day in Dreamsville” and actually means it. Meanwhile, Dougal has the opposite journey ahead of him. Whatever happens with this wedding and his fractured relationship with his father-in-absentia, the show wants him to learn that he doesn’t have to spend his days dreaming of watching “Lethal Weapon 2” with the dad, or recounting his personal history to a man who never gave him what he needed. Tutty was an acclaimed lead in “Dear Evan Hansen” in London and the similarities between the two characters are inevitably in play here. (Evan Hansen ten years out of high school?) That’s not a bad thing, given that the show is exploring the chance for happiness of a neuroatypical character and given that Tutty is quite excellent. He comes off as guileless and genuine; certainly, no other show so far this season provokes quite so many awwws from young, female voices in the audience. Pitts is a fine singer and an accomplished actress but she falls into the trap of playing so much against her opposite from across the Atlantic sea that, when the time comes, she can’t easily summon the vulnerability required to make you believe these two have a real bond of intimacy, let alone sexual attraction. These kinds of shows always need both characters to learn from the other and it’s too much of a one-way street here. Stories with odd couples on the edge of Eros, so to speak, can be very effective (see the movie “Lost in Translation” or the musical “The Band’s Visit“) but if writers choose to have their couple get naked and hit the sheets, in this case at the Plaza Hotel, since we’re all about New York aspiration here, they struggle to know where to go. So while this show held me for Act One with its considerable charm, by Act Two, it was hitting turbulence. 90 minutes and out would have been a better plan. On the plus side, “Two Strangers” does have quite a witty book and a few sticky tunes. Dougal will be a dreamboat, I suspect, for some teen theatergoers, and there is an amusing set from Soutra Gilmour that imagines New York entirely through carry-on luggage, spinning on a turntable that resembles baggage claim. It’s cool. It also seems to me that critics who complain about Broadway costs and ticket prices can’t dismiss out of hand a less ambitious, two-person musical that makes an admirable attempt to deliver a Broadway show with lower costs at more affordable prices, which is far more common in London, where the show originated. Also, armchair philosophers of older generations will be intrigued here by how these writers have jettisoned the traditional job of Broadway musicals, which is to heal a fractured family, in favor of boosting the idea, popular on social media, that you owe your parents little or nothing if they were not there for you. Disengaging is OK, as some therapists advise. Those shrinks sure will approve of this show, a celebration thereof. But in the theater, especially in the musical, vulnerability, even if differently applied, still is essential for these kinds of stories to work. Subscribers are entitled to 10 gift sharing articles each month. These can be shared with friends and family who are not subscribers. Subscribe now! or Sign in to your account. Three homeless people found dead on NYC streets as deep freeze grips city Natasha Lyonne reveals she has relapsed after nearly 20 years of sobriety Guy Fieri debuts bold ‘new look’ to celebrate his 58th birthday Off-duty NYPD employee arrested for grabbing man’s crotch without consent Missing Long Island teen may have traveled to NYC to meet online friend LGBTQ TikTok star found beaten to death in Thai forest; suspect arrested RICHARD JOHNSON: Mark Epstein has ‘medical evidence his brother was killed’ FDNY union throws support behind family of retired lieutenant shot to death by NYPD cops at Brooklyn hospital Man, 35, stabbed during argument outside Queens sports bar White House shares altered pic of Minnesota protester Nekima Levy Armstrong Cops checked Bronx home where twin boys were found starving, saw no evidence of abuse 5 arrested in shooting of Indiana judge and wife Jameela Jamil labels Blake Lively a ‘suicide bomber’ in private texts to publicist Precinct poacher walks into the 23, strolls out wearing NYPD uniform and carrying cuffs",
  "isFullReview": false,
  "bwwExcerpt": "New York Post: The musical comes dangerously close to cloying sentimentality at times, but Dougal’s dry sense of humor and Tutty’s first-class delivery prevents the story from ever getting too soupy. Chris Jones, The New York Daily News: Stories with odd couples on the edge of Eros, so to speak, can be very effective (see the movie “Lost in Translation” or the musical “The Band’s Visit“) but if writers choose to have their couple get naked and hit the sheets, in this case at the Plaza Hotel, since we’re all about New York aspiration here, they struggle to know where to go. So while this show held me for Act One with its considerable charm, by Act Two, it was hitting turbulence. 90 minutes and out would have been a better plan. Robert Hofler, The Wrap: Jim Barne and Kit Buchan wrote the songs and the book for this rom-com two-hander, and they begin “Two Strangers” with real promise. The young man Dougal (Tutty) is newly arrived at JFK from London and eager to meet his American father fo",
  "showScoreExcerpt": "\"This is a twee, two-character rom-com that could easily be a Hallmark holiday musical... So while this show held me for Act One with its considerable charm, by Act Two, it was hitting turbulence.\"",
  "originalScore": null,
  "assignedScore": 58,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-TWO-STRANGERS-CARRY-A-CAKE-ACROSS-NEW-YORK-Opens-On-Broadway-20250109",
  "textStatus": "complete",
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.914Z",
  "textWordCount": 1040,
  "textFetchedAt": "2026-01-25T14:31:16.903Z",
  "textFetchMethod": "playwright-stealth",
  "archivePath": "data/archives/reviews/two-strangers-bway-2025/NYDN--chris-jones_2026-01-25.html",
  "textQuality": "partial",
  "sourceMethod": "bww-roundup"
}