{
  "showId": "two-strangers-bway-2025",
  "outletId": "NYTG",
  "outlet": "New York Theatre Guide",
  "criticName": "Caroline Cao",
  "url": "https://www.newyorktheatreguide.com/reviews/two-strangers-carry-a-cake-across-new-york-broadway-review",
  "publishDate": "2025-11-20",
  "fullText": "Read our review of Two Strangers (Carry a Cake Across New York) on Broadway, a new musical comedy now at the Longacre Theatre after three acclaimed U.K. runs. When Dougal (Sam Tutty) and Robin (Christiani Pitts) collide at the airport, of course they’re off to a rocky start as the titular pair in the musical comedy Two Strangers (Carry a Cake Across New York). For a cynic, this meet-cute is formulaic. For an optimist, this is a rom-com recipe where familiarity is a feature, not a flaw. Directed and choreographed by Tim Jackson at the Longacre Theatre, Two Strangers is like a warm hot chocolate as respite from the snow. Clutching an invitation to the wedding of his long-lost father, 20something Englishman Dougal arrives belting the opening number, “New York,” and dragging a suitcase full of dreams. His infectious ode does not impress Robin, the 26-year-old jaded barista who's soon to be his aunt-in-law. When the unseen bride, Robin’s sister, tasks her with picking up a $2,000 four-layer wedding cake, Dougal offers to help — and thus their trek across New York begins, and a spark of connection becomes inevitable. Two Strangers could have sunk into treacly territory, but it stays afloat on a banter-filled book and twinkling contemporary score by Jim Barne and Kit Buchan. While the lyrics aren't groundbreaking, the sonorous ballads play to the stratosphere even when patter songs register as clunky. In less competent hands, this modest musical (one that could play well in smaller theatres) would drag at two hours, but luckily, Two Strangers intersperses its reveals with stirring emotion and rich humor. Tutty (who wears his role like muscle memory, having originated it in London) and Pitts flex their chemistry as scene partners: Dougal is an animated, British chatterbox who views the Big Apple through a lens of pop culture, while she’s the exhausted New York native who rolls her eyes at his touristy prattling. Their adventure involves Tinder matchmaking, nods to rom-com tropes, some verbal and physical stumbles, and a spending spree with a borrowed American Express. The writers get plenty of mileage from quips about the taboo that the pair are soon to be in-laws. Both characters are also cast-asides: We grasp that about Dougal early on, while Robin’s story is seeded over the course of their New York adventure. In Pitts’s expressions, we suspect buried reasons why she is reluctant to attend her sister’s wedding and yet performs multiple stressful favors for her. She knows she’s being used beyond her limit. Whirling on a turntable, Soutra Gilmour’s abstract set — two climbable piles of silver luggage — is both functional and a metaphor for the pair's personal baggage, but it ends up being more confining than liberating. (Gilmour has achieved more with less, like with her majestic tunnel-to-the-abyss in the current Waiting For Godot Broadway revival.) Even so, the visual is stunning as Dougal and Robin climb and cling to their respective towers, pining to bridge the distance between them. Their burgeoning bond is constantly on the brink of will-they-or-won’t-they. The show's conclusion doesn’t tidy up the characters' problems, but it leaves hope for their future. A transfer from London's West End, Two Strangers (Carry a Cake Across New York) starts when Robin, a New York barista, picks up her English nephew-in-law-to-be, Dougal, at the airport. He’s excited to see the groom, his estranged father, while Robin appears to nurse bitterness over her older sister, the bride. When Dougal tags along on Robin’s quest to pick up and deliver the wedding cake, their journey unfolds with mishaps, connection, and secrets. Two Strangers (Carry a Cake Across New York) had quite the reactive audience on my night, with roars of laughter that may be the forecast for many performances. Also in the forecast is a stage brimming with snowfall in an Act 2 scene of an emotional release. Jackson’s choreography is buoyant across the spinning turntable. Jack Knowles’s lighting design loads Gilmour’s luggage set with LED lighting to convey the whimsy of New York. The suitcases’ secret compartments assist in setting the scene, opening up to reveal closets, a hotel fridge, or a crimson restaurant backdrop. Gilmour also designed the vibrant costumes, a standout being the bright pink pieces in Robin’s wardrobe. The review aggregator Show-Score currently has a 90% audience approval score based on 115 reviews from theatregoers, who largely praised the musical's feel-good nature. Read more audience reviews of Two Strangers (Carry a Cake Across New York) on Show-Score. Christiani Pitts and Sam Tutty propel Two Strangers (Carry a Cake Across New York)'s contemporary score to the snow-filled skies. This musical is a love letter to the spontaneous connection people can find in New York City. Learn more and get Two Strangers (Carry a Cake Across New York) tickets on New York Theatre Guide. Two Strangers (Carry a Cake Across New York) is at the Longacre Theatre. Photo credit: Sam Tutty and Christiani Pitts in Two Strangers (Carry a Cake Across New York) on Broadway. (Photos by ) Two Strangers (Carry a Cake Across New York) is playing at Longacre Theatre. The theatre is located at 220 West 48th Street (between Broadway and 8th Avenue), New York, 10036. The running time of Two Strangers (Carry a Cake Across New York) is 2hr 15min. Incl. intermission. Book tickets for Two Strangers (Carry a Cake Across New York) on New York Theatre Guide. The recommended age for Two Strangers (Carry a Cake Across New York) is Ages 12+. Children under 4 are not permitted in the theatre.. Two Strangers (Carry a Cake Across New York) is a sweet, original musical about finding love in the Big Apple. The songs include soaring solos and lovely duets for this acclaimed two-hander musical, which reflects a contemporary sounding score. The musical is directed and choreographed by Tim Jackson, who provided the choreography for the Tony-winning Merrily We Roll Along. Jim Barne and Kit Buchan wrote this new musical. Yes: it earned glowing reviews in Boston and London, including many five-star writeups. Children must be four and older to enter Broadway houses. Originally published on Nov 20, 202522:00",
  "isFullReview": false,
  "bwwExcerpt": "aling looks, pure voice, comic instincts, and obvious acting skills, and somehow resemblance to a living Teletubby make him the huge plus for a vital Two Strangers (Carry a Cake Across New York) run. Caroline Cao, New York Theatre Guide: Tutty (who wears his role like muscle memory, having originated it in London) and Pitts flex their chemistry as scene partners: Dougal is an animated, British chatterbox who views the Big Apple through a lens of pop culture, while she’s the exhausted New York native who rolls her eyes at his touristy prattling. Their adventure involves Tinder matchmaking, nods to rom-com tropes, some verbal and physical stumbles, and a spending spree with a borrowed American Express. The writers get plenty of mileage from quips about the taboo that the pair are soon to be in-laws. Juan A. Ramirez, Theatrely: My heart is a generally open one, and I did not walk away from Two Strangers fuming about the state of modern musical theater. It has an agreeableness that will of",
  "showScoreExcerpt": "\"For an optimist, this is a rom-com recipe where familiarity is a feature, not a flaw...is like a warm hot chocolate as respite from the snow.\"",
  "originalScore": null,
  "assignedScore": 82,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-TWO-STRANGERS-CARRY-A-CAKE-ACROSS-NEW-YORK-Opens-On-Broadway-20250109",
  "textStatus": "complete",
  "textWordCount": 1022,
  "archivePath": "data/archives/reviews/two-strangers-bway-2025/NYTG--caroline-cao_2026-01-25.html",
  "textFetchedAt": "2026-01-25T14:31:23.212Z",
  "textIssues": [
    "Word count too low: 43 (min: 300)",
    "Show title not found in text"
  ],
  "urlSource": "show-score",
  "urlUpdatedAt": "2026-01-25T14:20:46.912Z",
  "textFetchMethod": "playwright-stealth"
}