{
  "showId": "two-strangers-bway-2025",
  "outletId": "one-minute-critic",
  "outlet": "One-Minute Critic",
  "criticName": "Matthew Wexler",
  "url": "https://1minutecritic.com/two-strangers-carry-cake-broadway-review/",
  "publishDate": null,
  "fullText": "Reviews\t\t\t\t    \n\n\t            &#8216;Two Strangers (Carry a Cake Across New York)' delivers more crumbs than confection\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\tMatthew Wexler\n\n\t\t\t\t\t\tNov 20, 2025\n\t\t\t\t\t\n\t\t\t\t\t0\n\n              Sam Tutty and Christiani Pitts in \"Two Strangers (Carry a Cake Across New York).\" Photo by Matthew Murphy.            \n\n\t\t\t\t\t\tShare this:\nBy Matthew Wexler\n\nAdd equal parts Hallmark holiday movie, a forgettable pop score, and a towering pile of gloomy gray luggage that would put a QVC flash sale to shame, and you’ve got the recipe for Two Strangers (Carry a Cake Across New York), the new Broadway musical that opened tonight at the Longacre Theatre. \n\nCreators Jim Barne and Kit Buchan share the credits for book, music, and lyrics, which is like making a bread recipe that fails to rise, and you’re not sure whether to blame old yeast or an uncalibrated oven. \n\nA socially awkward young Englishman, Dougal (Sam Tutty), leaves the comforts of living with his mom to attend his estranged father’s wedding in New York City. Robin (Christiani Pitts), a New York native and sister of the much younger bride, reluctantly agrees to pick him up at the airport. Like the swap-out from your favorite cooking show, Voila!, a musical theater rom-com emerges. \n\nIn fairness, the book offers plenty of laughs, thanks in large part to endearing performances by Tutty and Pitts. Chemistry sparks from Tutty’s charming innocence and quirky comedic timing, countered by Pitts’ deadpan response. Director Tim Jackson, who has them moving at breakneck pace on the ever-revolving set, couldn’t ask for a better pair. \n\nThe production released a studio recording video of the opening song, “New York,” which offered high hope, but the score quickly becomes repetitive in its lyrical structure, then saddles Pitts with several underwhelming ballads.\n\nSpoiler alert: The cake eventually arrives at its destination, albeit worse for wear (a precursor of what’s to come). And despite scenic designer Soutra Gilmour’s revolving suitcase stockpile, filled with a few fun reveals to pin drop the pair’s weekend adventure, the fleeting moments aren’t enough to get a rise out of the half-baked plot.\n\nSome may find Two Strangers (Carry a Cake Across New York) a pleasant enough holiday confection, but as Robin says to Dougal to squelch his movie fantasy of NYC, “You know how much it costs to go for dinner in midtown Manhattan? To see a Broadway show? New York is just money, that’s all it is.”\n\nConsider, instead, seeking out one of the best cake slices in New York City and calling it a night. \n\n                Your inbox left at intermission.\n\n                It wants better content.\n\n\tNotice: JavaScript is required for this content.\n\n                By subscribing you agree to Substack's Terms of Use, Privacy Policy, and Information Collection Notice.\n\nFast facts: &#8216;Two Strangers (Carry a Cake Across New York)'\n\nSam Tutty and Christiani Pitts serve up charm in Two Strangers, but this Broadway recipe needs more time in the oven.\n\nLongacre Theatre, 220 West 48th Street, New York City\n\nTwo hours, including one intermission\n\nGet Tickets\n\nFind the best hotels in New York City near the Longacre Theatre\n\nShare this:\t\t\t\t\t\t\n\n\t\t\t\t\t\tChristiani PittsSam TuttyTwo Strangers (Carry a Cake Across New York)",
  "isFullReview": true,
  "originalScore": null,
  "assignedScore": null,
  "source": "scraped",
  "bwwThumb": "Down",
  "bwwUrl": "https://1minutecritic.com/two-strangers-carry-cake-broadway-review/",
  "scrapedAt": "2026-01-23T22:06:36.566Z"
}
