{
  "showId": "two-strangers-bway-2025",
  "outletId": "theatrely",
  "outlet": "THEATRELY",
  "criticName": "Juan A. Ramirez",
  "url": "https://www.theatrely.com/post/two-strangers-carry-a-cake-across-new-york-the-great-british-millennial-off-review",
  "publishDate": "November 20, 2025",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "I felt a disorienting generational whiplash throughout the treacly rom-com Two Strangers (Carry a Cake Across New York). The latest British musical to make it through that country's off-off ranks and onto our shores, it follows two 20-somethings during a whirlwind wedding weekend in present-day New York. And yet it fundamentally misunderstands Gen Z, is shot through with elder Millennial sensibility, and had a mostly older crowd wiping tears of laughter from their eyes. They seemed to thoroughly enjoy it, so congrats to all involved, but let me submit my dissenting opinion anyway.\n\nThe story follows Dougal, a British twentysomething, and Robin, a 26-year-old New Yorker, as they navigate a wedding weekend in Manhattan, picking up a cake and encountering various tourist attractions. Sam Tutty brings charm despite playing maybe the most grating character in musical theater history, while Christiani Pitts keeps her deadpan takedowns impressively fresh. However, the characterization of Robin embodies the unfortunate subgenre of Black woman as wet blanket of wokeness, constantly correcting Dougal's cultural missteps.\n\nThe score receives criticism for platitudes about romance and outdated humor, including a number that reheats BuzzFeed-era jokes about whether classic Christmas songs are problematic. Despite praise for the production design and performances, the show lacks substance for a nearly two-and-a-half-hour runtime. Its agreeableness will charm audiences but ultimately it's not for me, and the twee little title accurately signals its sentimental, lightweight approach.",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "dtliThumb": "Meh",
  "scrapedAt": "2026-01-23T23:35:00.000Z"
}
