{
  "showId": "two-strangers-bway-2025",
  "outletId": "unknown",
  "outlet": "unknown",
  "criticName": "Unknown",
  "url": "https://www.interestedbystander.com/2026/01/theater-catching-up-on-theater-filled.html?m=0",
  "publishDate": null,
  "fullText": "November 20, 2025: Two-hander musicals occupy the tiniest niche among the categories of Broadway musicals. A few more, like Marry Me a Little, to name just one, have played Off Broadway, but the Great White Way seems only to have seen I Do! I Do! (1966), The Story of My Life (2009), and The Last Five Years. The latter premiered Off Broadway in 2001 before finally receiving a revival on Broadway just this year. Now, bringing a lightning shaft of unalloyed rom-com charm to Broadway’s Longacre Theatre is a smashing little British import called Two Strangers (Carry a Cake Across New York), with book, music, and lyrics by Jim Barne and Kit Buchan, and direction by Tim Jackson. This four-layer confection—to extend the metaphor—is filled with mellow music, pungent performances, sweet staging, and velvety visuals. Originated at the Kiln Theatre in London before moving to the West End’s Criterion, it jumped the pond to play at the American Repertory Company in Cambridge, MA. It’s now on Broadway with one of its original young stars, Sam Tutty, giving a stunningly deft performance mingling hilarious comic chops with unexpected poignancy. It showcases not only his exceptional talents but those of American actress-singer Christiani Pitts (King Kong), whose career will hopefully skyrocket after this. November 20, 2025: Two-hander musicals occupy the tiniest niche among the categories of Broadway musicals. A few more, like Marry Me a Little, to name just one, have played Off Broadway, but the Great White Way seems only to have seen I Do! I Do! (1966), The Story of My Life (2009), and The Last Five Years. The latter premiered Off Broadway in 2001 before finally receiving a revival on Broadway just this year. Now, bringing a lightning shaft of unalloyed rom-com charm to Broadway’s Longacre Theatre is a smashing little British import called Two Strangers (Carry a Cake Across New York), with book, music, and lyrics by Jim Barne and Kit Buchan, and direction by Tim Jackson. This four-layer confection—to extend the metaphor—is filled with mellow music, pungent performances, sweet staging, and velvety visuals. Originated at the Kiln Theatre in London before moving to the West End’s Criterion, it jumped the pond to play at the American Repertory Company in Cambridge, MA. It’s now on Broadway with one of its original young stars, Sam Tutty, giving a stunningly deft performance mingling hilarious comic chops with unexpected poignancy. It showcases not only his exceptional talents but those of American actress-singer Christiani Pitts (King Kong), whose career will hopefully skyrocket after this. According to the premise, Dougal (Tutty), 25, a goofy, wide-eyed, seemingly naïve, yet oddly perceptive and deceptively witty Brit, arrives at a New York airport and is Loony Tunes excited about being in the Big Apple for the first time. Waiting for him is Robin, 26, a lovely African American woman, sister of the woman Dougal’s much older father is about to marry. Dad abandoned his family before Dougal was born to make a fortune in America. Dougal and Robin: Opposites? Yes. Attraction? Give it time! Dougal believes he’s been invited to the wedding by his dad, a fantasy version of whom lives in his deluded brain, father and son never having met; Robin knows better. The irrepressible bundle of joy that is the ginger-haired Dougal latches on to the notion that Robin is his “aunty,” which will be good for a big laugh. Back home, Dougal lives with his mum and works at a local cinema, cleaning the place, selling candy, and being engrossed by the films he sees, an arrangement with which he’s perfectly content. Robin, from Brooklyn but living in Manhattan, is a no-nonsense, somewhat edgy, barista at a coffee shop, the Bump and Grind. She does all she can—albeit sometimes grudgingly—for her demanding older sister, especially regarding the forthcoming nuptials. Under sibling pressure, she agrees to go to Brooklyn to pick up the wedding cake. Despite her reluctance, Dougal attaches himself to her so he can squeeze as much sightseeing in during his 48 hours here. His overwhelming, movie-inspired fascination with the city she takes for granted gradually infects her; as Dougal’s child-like openness and honesty grows on her, Robin can’t help but succumb. Thus begins the newly met couple’s dash around town (by subway, which thrills him), including a contretemps with the cake. They visit notable places, of course, and, with access to the father’s credit card, even spend an over-the-top night at the Plaza. Forced into such proximity, the pair can’t help but to learn more about each other—he even helping her find someone on Tinder—and to share emotional histories, with emphasis on Robin’s family issues (such as an estranged grandmother) and Dougal’s almost pathological obsession with a warped dream of his father. Gradually, the show, built on the classic boy meets girl, boy loses girl, boy gets girl, boy leaves girl structure, builds to a touching emotional climax when the couple—with Dougal having to return home (“I’m only 4,000 miles away”)—sing “If I Believed” as snow falls all about them. Snow? In recent New York? Two Strangers is filled with familiar rom-com tropes, yet it earns our love and respect because of the perfect way it forces you to believe in a romantic relationship between two people who you never in a thousand years would have believed would connect so quickly within a whirlwind 36-hour framework. It’s as artificial as AI yet as emotionally delicious as a slice of that cake they shlep around. Only one scene, where Dougal breaks down in tears, breaks the spell. One of its strengths is how good the dialogue is when no one is singing; long, engrossing stretches go by as Robin and Dougal swap repartee, with the songs emerging from the dialogue almost naturally, telling the story and seeming an extension of the chatter rather than something separate. Robin has the closest thing to a traditional showstopper, “This Year,” late in the show, but that’s about the sole example of a number going in that direction. The melodies are thoroughly listenable and relatable, being worth hearing again, their lyrics always clearly related to the characters and storytelling. Each song is as convincingly acted as sung. Both characters grow over the course of the show’s two hours and 15 minutes into people who clearly have gained from their journey across New York. As the icing on the cake, not only have they fallen in love with each other but we’ve fallen in love with them as well. Tim Jackson’s inventive staging is enhanced enormously by Soutra Gilmour’s truly clever set, placed on a turntable within a turntable, with its two mountains of silver-gray luggage suggesting at times the city’s skyline and, perhaps, a wedding cake. Having the luggage fitted with ribbons of light that can change color is a brilliant idea, and lighting designer Jack Knowles makes magic with it. Gilmour’s costumes are likewise fine, although they sometimes seem a bit too lightweight for the cold weather we hear so much about. If Dougal and Robin can carry a cake across New York, you should be able to carry yourself across New York to see them do it. Two Strangers (Carry a Cake Across New York) *****Longacre Theatre, 220 W. 48th Street, NYC.Running time: two hours and 15 mins. including intermission. twostrangersmusical.comNovember 20, 2025 – Open Run Photography: Matthew Murphy and Evan Zimmerman",
  "isFullReview": false,
  "dtliExcerpt": "\"It is an act of prestidigitation: Entertainment and real emotional engagement are pulled out of thin air.\"\n\nRead more",
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "sources": [
    "show-score-playwright"
  ]
}