{
  "showId": "two-strangers-bway-2025",
  "outletId": "WRAP",
  "outlet": "The Wrap",
  "criticName": "Robert Hofler",
  "url": "https://www.thewrap.com/two-strangers-carry-a-cake-across-new-york-broadway-review/",
  "publishDate": "2025-11-20",
  "fullText": null,
  "isFullReview": false,
  "bwwExcerpt": "n here, they struggle to know where to go. So while this show held me for Act One with its considerable charm, by Act Two, it was hitting turbulence. 90 minutes and out would have been a better plan. Robert Hofler, The Wrap: Jim Barne and Kit Buchan wrote the songs and the book for this rom-com two-hander, and they begin “Two Strangers” with real promise. The young man Dougal (Tutty) is newly arrived at JFK from London and eager to meet his American father for the very first time. Dad’s getting married and the bride’s sister, Robin (Pitts), picks him up at the airport. As meet-cutes go, this one turns very problematic in Act 2, if not before. Jonathan Mandell, New York Theater: But then I thought: It’s symbolic of the unsettled lives of these two young characters. And it shows a bit of resourcefulness: Sometimes the piles of luggage seem to suggest a Manhattan avenue lined with skyscrapers, sometimes a hill in Central Park in a snowy Central Park. And I suppose one might consider the w",
  "originalScore": null,
  "assignedScore": 35,
  "source": "bww-roundup",
  "needsFullText": false,
  "sourceUrl": "https://www.broadwayworld.com/article/Review-Roundup-TWO-STRANGERS-CARRY-A-CAKE-ACROSS-NEW-YORK-Opens-On-Broadway-20250109",
  "textStatus": "missing",
  "textQuality": "missing",
  "sourceMethod": "bww-roundup",
  "scoreSource": "sentiment-strong-negative",
  "scoreConfidence": "medium",
  "dtliExcerpt": "“Two Strangers” is one of those rom-coms where the two lovers are wrong for each other. He’s too boyish, she’s too brittle. It’s a new soul/old soul dynamic. That frisson works initially because, in a story too complicated to tell here, he sets her up with another guy on a dating app. Maybe Dougal and Robin will just become very good friends. Unfortunately, no.",
  "dtliThumb": "Down"
}