{
  "showId": "chess-2025",
  "outletId": "1-minute-critic-matthew-wexler",
  "outlet": "1 Minute Critic (Matthew Wexler)",
  "criticName": "Matthew Wexler",
  "url": "https://1minutecritic.com/chess-broadway-review-aaron-tveit-lea-michele/",
  "playbillVerdictUrl": "https://1minutecritic.com/chess-broadway-review-aaron-tveit-lea-michele/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "There’s some magic happening on Broadway, and I’m not talking about Rob Lake’s prematurely closed illusion act. Chess returns after its brief stint 37 years ago, this time with a new book by Danny Strong, who transforms the Cold War musical into a high-stakes and ocassionally high camp power struggle between lovers and countries. What began as a concept album by lyricist Tim Rice and composers Benny Andersson and Björn Ulvaeus (of ABBA fame) eventually made its way to Broadway in 1988, but The Phantom of the Opera stole the spotlight that year, forcing the musical into a checkmate after 68 performances. The driving score, packed with power ballads and pop hits (“One Night in Bangkok” reached number 3 on the US Billboard Top 100), has kept the show alive through multiple regional theater, international, and concert productions over the years. In this match, Strong rethinks the game strategy by centering The Arbiter (a rakish Bryce Pinkham) as the narrator with a mischievous twinkle in his eye and anachronistic references to present-day politics. Pinkham, along with a deliciously dry performance by Sean Allan Krill as CIA agent Walter de Courcey, balances the above-the-title star power, including Aaron Tveit as clinically depressed and bipolar US chess champion Freddie Trumper, his coach/lover Florence Vassy (Lea Michele), and their Soviet opponent Anatoly Sergievsky (Nicholas Christopher). Christopher, joined by an electric Hannah Cruz as his estranged Russian wife Svetlana in Act II, leans into Michael Mayer’s direction with the highest stakes, navigating the political and personal with the kind of urgency that kept us glued to The Americans for six seasons. Choreographer Lorin Latarro proves a formidable collaborator, jolting the cerebral into thrilling gameplay, the ensemble functioning as a Greek chorus smartly dressed in monochromatic grey suits by costume designer Tom Broecker. Many theatergoers will be flocking to see Tveit and Michele in Chess. And while the King and Queen of this game may get the most attention, to win, every move counts. Broadway’s Chess may spotlight its stars, but this revival proves every piece matters in a Cold War musical that finally finds its winning strategy.",
  "isFullReview": true,
  "textWordCount": 353,
  "archivePath": "data/archives/reviews/chess/1-minute-critic-matthew-wexler--matthew-wexler_2026-02-01.html",
  "textFetchedAt": "2026-02-01T18:54:05.862Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright"
}