{
  "showId": "chess-2025",
  "outletId": "newyorktheater-me",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://newyorktheater.me/2025/11/23/chess-broadway-review/",
  "publishDate": null,
  "fullText": "“Chess” is not a serious musical. That’s the key to appreciating this show, which is supposed to be about an American and a Russian grandmaster battling over both the game of chess and a woman. Not knowing English might help even more, since too many of the lines and lyrics detract from what’s enjoyable about the show, which is the catchy rock score and the performances by the exciting Broadway pros Aaron Tveit, Lea Michele and Nicholas Christopher. The music, by ABBA’s Benny Andersson and Björn Ulvaeus, is the only obvious reason why, 37 years after it flopped on Broadway, “Chess” is being revived. Unlike ABBA’s other Broadway musical “Mamma Mia,” which is also getting its first Broadway revival, “Chess” has an entirely new book, written by Danny Strong, a screenwriter (Hunger Games: Mockingjay) and showrunner (Empire) making his Broadway debut. Strong’s weak book attempts to amp up the stakes of the chess matches to a ludicrous degree while simultaneously undercutting these efforts with a clunky, jokey narrative. “Welcome to the first, and depending on how this goes, last, Cold War musical,” announces the Arbiter (Bryce Pinkham), who in addition to the character’s role in previous productions as the referee at the chess matches has been turned into the narrator. The events begin in 1979, “…where danger was perceived in every move, even in a simple game of chess.” Tveit portrays Freddie Trumper (“And yes, I know his name is ‘Trumper,’ the Arbiter says, “but remember this show was originally written in 1984.”) a child chess prodigy who has grown up to be disruptive and mentally unstable (manifestly inspired by Bobby Fisher.) Michele plays Florence Vassy, his second, and ever-patient lover….until she’s not. We learn she already had a single dalliance “one night in Stockholm” with Freddie’s rival, Anatoly Sergievsky (Nicholas Christopher), who at least initially doesn’t seem much of an improvement over Freddie. “This morning I decided not to kill myself, so I thought I’d say hello,” Anatoly says to Florence. The complicated love triangle becomes an unwieldy rectangle when we meet Svetlana (Hannah Cruz), Anatoly’s abandoned wife, in Act II. The chess matches between Freddie and Anatoly are not just a symbol of international competition and a metaphor for political gamesmanship. In “Chess,” they could directly result in “total annihilation.” The Arbiter more or less explains how this is wrapped up in Soviet pride, and the convoluted and unlikely scenario plays out with machinations by the United States, in the person of Sean Allan Krill as CIA agent Walter de Courcey (whom the Arbiter introduces as “kind of a dick. And not just because he’s the only cast member who doesn’t have his own song”) and the Soviet Union (Bradley Dean as KGB agent Alexander Molokov.) This involves the SALT II treaty and some misunderstood NATA military exercises known as the Able Archer incident, and winds up with the two superpowers in cahoots against first one of the chess players then the other in order to avoid destroying the world “So the Americans and the Russians team up to defeat Freddie Trumper, an attempted partnership so unusual it wouldn’t be seen again for many decades until RFK Jr. attempted to team up with the worm in his brain,” the Arbiter says. (There is also a similar failed joke about Biden.) Even the chess matches themselves don’t seem to have much to do with chess. In the first of two such matches on stage, the two grandmasters stand on either side of the stage facing the audience: Freddie: “I don’t blame my father for leaving, but I still hate him for it. Pawn to D5.”Anatoly: “He doesn’t deserve Florence. She’s too good for him. Knight to C3” You might think that at least chess masters themselves would be thinking about chess while playing it. But even they are more interested in other moves. If the score doesn’t have as many memorable melodies as “Mamma Mia” (which is, after all, a jukebox musical of ABBA’s greatest hits), it does have one rock hit “One Night In Bangkok,” in which an impossibly sexy Tveit in sunglasses is feted and stroked by the half-clad men and women of the ensemble beneath a surfeit of neon (Bobby Fischer never had it so good); Lea Michele gets four or five solos to belt out, which will please her fans; she is at her best in the pop duet “I Know Him So Well” with Hannah Cruz as Anatoly’s estranged wife; Christopher closes Act I with a star-making “Anthem” – a full-throated, deeply emotional paean to Russia, which is confusing, since he’s just defected. (As I said, better if you don’t understand the words.) For a rock musical, the numbers are surprisingly eclectic: There are moments of recitative, hip-hop, disco, Broadway ballad, Gilbert and Sullivan. “Quartet (A Model of Decorum and Tranquillity)”resembles a minuet, “”Merano” morphs from operetta into synth pop. Many of the musical numbers are enhanced by the ensemble, usually wearing identical jazzy business suits, choreographed by Lorin Latarro. I have seen some entertaining movies and plays about chess: “The Queen’s Gambit,” “ Looking for Bobby Fischer,” and “The Machine,” a play by Matt Charman at the Park Avenue Armory that dramatized the 1997 chess match between world champion Garry Kasparov and IBM’s Deep Blue supercomputer. Among all these show, “Chess” has the singular distinction of being full of all sorts of dopey puns and incomprehensible, unexplained lingo about chess without my once seeing, or even being asked to visualize, a chess piece. ChessImperial Theater Running time: 2 hours and 45 minutes, including intermission.Tickets: $74 – $571Music and lyrics by Benny Andersson, Born Ulvaeus and Tim Rice, based on an idea by Tim RiceBook by Danny StrongDirected by Michael MayerChoreographed by Lorin LatarroOriginal orchestrations by Anders Eljas, orchestrations by Anders Eljas and Brian Usifer and music supervision by Brian Usifer.Scenic design by David Rockwell, costume design by Tom Broecker, lighting design by Kevin Adams, sound design by John Shivers, video design by Peter Nigrini, Hair, Wig and Makeup Design are by Luc Verschueren for Campbell Young Associates.Cast: Aaron Tveit as Freddie Trumper, Lea Michele as Florence Vassy, Nicholas Christopher as Anatoly Sergievsky, Hannah Cruz as Svetlana Sergievsky, Bryce Pinkham as the Arbiter, Bradley Dean as Alexander Molokov, Sean Allan Krill as Walter de Courcey, Kyla Bartholomeusz, Daniel Beeman, Shavey Brown, Emma Degerstedt, Casey Garvin, Adam Halpin, Sarah Michele Lindsey, Michael Milkanin, Aleksandr Ivan Pevec, Aliah James, Sydney Jones, Sean MacLaughlin, Sarah Meahl, Ramone Nelson, Fredric Rodriguez Odgaard, Michael Olaribigbe, Katerina Papacostas, Samantha Pollino, Regine Sophia and Katie Webber. Broadway Week 2-for-1 Tickets On Sale NowJanuary 13, 2026In \"New York Theater\" Mamma Mia Broadway ReviewAugust 14, 2025In \"Broadway\" Maybe Happy Ending? Stageworthy News of the WeekJune 2, 2025In \"New York Theater Weekly Summary\"",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 1129,
  "archivePath": "data/archives/reviews/chess-2025/newyorktheater-me--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:41:51.379Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}