{
  "showId": "chess-2025",
  "outletId": "pagesonstages-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://pagesonstages.com/2025/11/22/chess/",
  "publishDate": null,
  "fullText": "The music from Chess has been a large part of this theatre-lover’s life for a long time, and, since moving to New York, I have been openly hoping for a Broadway revival. The excitement that I felt hearing some of these beautifully written songs performed by high caliber actors was somewhat at odds with not liking many of the decisions of the production, particularly the book rewrites (Danny Strong) that made fun of the premise of the show. It felt like the performance was taking cheap shots at itself in ways that were totally unnecessary and, at times disheartening and disruptive. Chess is about a high stakes international chess competition in which the grand masters are pawns in a larger game being played by their respective countries for whom pride and glory are small potatoes compared to what’s at stake in the political context of the Cold War. It’s really not funny, and the attempts to make it funny, as well as attempts to infuse current American politics into the narration were in poor taste—particularly the one about Joe Biden. Chess is a dramatic, moving story about interpersonal relationships crossing the boundaries of geopolitical borders and the importance of playing the game as opposed to being played. This production sucked the meaning out of it in an attempt to make it more fun. The set (David Rockwell) was a disappointment—basically, we got a red floor and some stairs to accommodate the orchestra on platforms. Lighting designer Kevin Adams had to work really hard to make the space look beautiful, and he rose to the challenge. Costumes (Tom Broecker) met the bare minimum requirement to do this show—nothing more. Aesthetically, this production really let audiences down, in what I can only assume was an effort to let the score shine as the centerpiece of Chess. The score did shine, but I must confess to being deeply underwhelmed by Lea Michele’s performance. She sang all of the notes in a lyrical way and they rolled out of her with a pure sound, but she failed to make the words mean anything. There was no acting performance. She didn’t emphasize anything that advanced the plot or should have been emotional. In fact, she smiled at a lot of moments when her character was going through a serious journey. It seemed as though Lea Michele was so happy to be onstage singing that she forgot to embody her character (Florence) or give any semblance of an acting performance. Every word sounded the same and even highly meaningful songs like “Someone Else’s Story” were nothing but a pretty song with interesting musical intervals. In this rewrite, Florence is a more central character as her divided loyalty and ultimate abandonment of her lover take center stage. More should have been asked of her. Michele did not even seem conflicted. Peter Nigrini (video design) had a clever moment with the snow in “Where I Want to Be”, and a sloppy one later in “Endgame” with all of the former chess players. The snapshots he showed in “1956 Budapest is Rising” were very effective and visually showed the trauma of Florence’s past, which helped with the fact that Lea Michele remained a blank slate. Despite its many shortcomings and disappointments, I can’t say that Chess doesn’t still deliver some of the iconic moments in truly incredible ways. Aaron Tveit (Freddie) and Nicholas Christopher (Anatoly) both deliver magnificent vocal and acting performances. Tveit in particular made Freddie’s pain very real and tangible, and delivered a memorable “Pity the Child”. His emphatic choices were unique and deeply moving—he even managed to infuse some of Freddie’s pain into “One Night in Bangkok”, showing anguish in a moment where Freddie is trying to forget the only life he’s ever lived. I was very impressed by the orchestra itself, and by Hannah Cruz (Svetlana), who packed more emotion into the few lines she was allowed to sing than Lea Michele packed into the whole show. Cruz’s venom was tangible, and the stakes for her character felt very real. I was impressed by the way she carried herself with a mixture of dignity and revulsion as she upped the ante for everyone involved. Despite the many changes I would have liked to see to this production, it was wonderful to finally have a revival of Chess on Broadway. The music from the show is simply amazing, and some of the lyrics are truly haunting. Though this production is a mixed bag, there are moments that make it worth seeing—particularly those with Aaron Tveit, Nicholas Christopher, and Hannah Cruz, all of whom give truly delightful, insightful, meaningful performances. I’ll end this review with a quote from Chess that ultimately describes how I feel about the production: now I’m where I want to be and who I want to be and doing what I always said I would and yet I fear I haven’t won at all. I did not attend this performance on a press pass.",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 831,
  "archivePath": "data/archives/reviews/chess-2025/pagesonstages-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:42:45.550Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}