{
  "showId": "chess-2025",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Joey Sims",
  "url": "http://www.theatrely.com/post/this-chess-is-a-blast-review",
  "playbillVerdictUrl": "http://www.theatrely.com/post/this-chess-is-a-blast-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "contentTier": "stub",
  "contentTierReason": "No text content",
  "fullText": "The company of Chess | Photo: Matthew Murphy\n\nTo discover the musical Chess is to understand why people are obsessed with the musical Chess. Equal parts demented and exhilarating, this infamously troubled “Cold War Musical” is almost certainly unfixable. The show’s soaring highs are matched only by its plummeting lows. Yet this strange musical creature remains, above all else, just one hell of a good time.\n\nA thundering revival of this 1986 problem child, with music by ABBA’s Benny Andersson and Björn Ulvaeus and lyrics by Tim Rice, opens tonight at the Imperial Theatre in the show’s umpteenth revised version. The latest book, a patchwork of multiple past iterations (with a few fresh tweaks), is by Emmy Award-winning actor-turned-screenwriter Danny Strong.\n\nSo, I hear you ask: Did they fix Chess?\n\nThe answer: Absolutely not. And please, please, may they never stop trying.\n\nWhat delights we would be denied if they did! Chiefly the delights of Andersson and Ulvaeus’ enduring score, a heart-pounding assemblage of stirring ballads, synthy flourishes and explosive rock opera. As played here by a booming 18-piece orchestra under Ian Weinberger’s musical direction, Anders Eljas and Brian Usifer’s orchestrations are crisp and powerful.\n\nPerhaps a bit too powerful, as the score does occasionally drown out the voices of a hard-working ensemble. Those finely-suited dancers, looking stylish in elegant gray, make up for it with dazzling moves choreographed by the ever-reliable Lorin Latarro (The Who’s Tommy). So invigorating is the dancers’ muscular backing that it’s a real loss, if perhaps an inevitable one, when they recede into the background for much of act two.\n\nMichael Mayer’s slick, stylish staging is very much a concert, albeit as polished and elaborate a concert as you’re likely to see. (David Rockwell’s set keeps it simple, but is enhanced by richly colorful lighting from Kevin Adams and unobtrusive video by Peter Nigrini.) It’s hard to argue the approach. Chess is about the music, and Mayer knows it, notwithstanding the sincere efforts this team has made to clarify the storytelling.\n\nOn that front, the bag is decidedly mixed. Strong’s book leans heavily on a tacked-on narrator, The Arbiter (a wonderfully hammy Bryce Pinkham, working wonders). As with most adjustments to Chess over the years, that expanded character creates as many problems as he solves. The narrative is clearer, certainly, but now filled with interruptions that feel awkward. Strong does not help his cause by sprinkling cringeworthy ripped-from-the-headlines gags about Biden and RFK into The Arbiter’s dialogue.\n\nYet all that scarcely matters when the powerful voices of Aaron Tveit, Lea Michele and a truly revelatory Nicholas Christopher shake the roof of the Imperial. Tveit and Michele struggle occasionally on the acting side, and the pair’s chemistry is iffy. But Tveit delivers a masterful “Pity the Child” and a deliciously sexy “One Night in Bangkok,” while Michele belts “Nobody’s Side” with absurd vocal power.\n\nBut it is Christopher, the lesser known of the three, who steals the show. His “Where I Want To Be” is a powerhouse; “Anthem” is faultless. He also finds a weighty and heartbreaking core to the character’s inner turmoil, lending this Chess one surprising and essential element: a beating heart.\n\nChess is now in performance at the Imperial Theatre in New York City. For tickets and more information, visit here.\n\nJoey Sims has written at The Brooklyn Rail, TheaterMania, American Theatre Magazine, Culturebot, Exeunt NYC, New York Theatre Guide, No Proscenium, Broadway’s Best Shows, and Extended Play. He was previously Social Media Editor at Exeunt, and a freelance web producer at TodayTix Group. Joey is an alumnus of the Eugene O’Neill Theater Center’s National Critics Institute, and a script reader for The O’Neill and New Dramatists. He runs a theater substack called Transitions.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 662,
  "archivePath": "data/archives/reviews/chess-2025/theatrely--joey-sims_2026-02-02.html",
  "textFetchedAt": "2026-02-02T00:05:39.691Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251211121950",
  "archiveOrgUrl": "http://web.archive.org/web/20251211121950/https://www.theatrely.com/post/this-chess-is-a-blast-review"
}