{
  "showId": "chess-2025",
  "outletId": "theatrereviews-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://www.theatrereviews.com/broadway-review-chess-at-the-imperial-theatre-through-sunday-may-3-2026/",
  "publishDate": null,
  "fullText": "The recent revival of “Chess “on Broadway comes nearly forty years after its first opening on London’s West End in 1986, with a subsequent move to Broadway after major revisions, in 1988. The Broadway production directed by Trevor Nunn closed after two months recording good attendance, but unfavorable financial returns. This recent incarnation, deftly directed by Michael Mayer, confines the playing area into a more intimate space by placing the orchestra on stage, and using an elevated bridge from which the Arbiter (Brice Pinkham) eavesdrops on the festivities. The new book penned by Danny Strong has put more emphasis on the politics of the Cold War between the United States and Russia, leaving the romantic interests to be used as pawns in the negotiations and outcome. The storyline seems much more intriguing than the original production and easier to follow. It is evident and difficult to argue that the music and lyrics by Benny Andersson, Tim Rice, and Bjorn Ulvaeus, is the star of the show. That being said, it becomes even more evident when heard by a superb eighteen-piece orchestra and the brilliant vocals of a magnificent cast. The story begins with the chess match between the American world champion Freddie Trumper and his competitor Anatoly Sergievsky from Russia. KGB agent Alexander Molokov (Bradley Dean) tries to fix the match by placing several obstacles in the way of the American chess player. He finally negotiates with CIA agent Walter de Courcey (Sean Allan Krill), to have Trumper forfeit the match in a trade for Russia to sit back down at the table to avoid a nuclear disaster. Trumper forfeits, but Anatoly is not satisfied because in his eyes he did not beat his opponent, so it means nothing. Florence Vassy (Lea Michelle) is Trumpers number two, and romantic partner. After the forfeit, which she was against, they break up and Florence begins a relationship with Sergievsky, who was a romantic interest from the past, after he retires from competition. Four years later at another Championship match, Sergievsky is persuaded by the KGB and his wife to play once again for the title. The stakes are high, and he returns to the game only to win with the help of Trumper, who is now a commentator for chess matches. Everyone involved sacrifices something in order to get something in return. They are all just pawns in a political and romantic game of chess. The entire cast is superb, led by three magnificent leads with exceptional vocals. Mr. Tveit creates a manic and riveting portrayal of Freddie Trumper. His rich tenor with dark tones soars as he delivers a powerful rendition of “Pity the Child.” Soprano Lea Michele has a pure tonal quality, remarkable vocal control, and strong belting ability which manages the demands of the role perfectly. She creates a complex and ambitious Florence, who is fearless but vulnerable. Her interpretation of “Heaven Help My Heart” is heartfelt and endearing. Nicholas Christopher embodies a stoic Sergievsky as he battles to reveal conflicting emotions regarding love and politics, which could not be more evident in his compelling delivery of “Anthem”. His dramatic baritone serves his character well and easily navigates the score with a great amount of emotional depth. Mr. Pinkham exudes charm and dexterity as he humorously comments on the action taking place in each scene. He has the ability to break the fourth wall while still being part of story. Sometimes vanishing while still being present on stage. This production is clean and simple with very little distraction, putting more emphasis on the characters and plot. Lighting design by Kevin Adams is precise and reflects the mood and emotion of each scene. Mr. Mayer keeps a swift pace throughout and delivers a rendition of “Chess” that is clear, straightforward and intelligent. That, combined with this unbelievable cast may make this rendering of “Chess” the best to date. The characters in Conor McPherson’s “The Weir,” currently running at the Irish Repertory Theatre, tell ghost stories and stories of the supernatural to newcomer Valerie (Sarah Street) at the local bar in Northern Ireland owned by Brendan (Johnny Hopkins). Before Valerie’s arrival with Finbar, Jack (Dan Butler), Jim (John Keating),… Language and translation serve as powerful tropes for colonial ownership in Brian Friel’s “Translations” currently playing at Irish Repertory Company through Sunday. December 31, 2023. Headmaster Hugh (Sean McGinley) of the hedge-school in the townland of Baile Beag/Balleybeg the Irish-speaking community in County Donegal and his eldest son Manus (Owen… Irish Rep’s “The Plough and the Stars” (1926) closes after the Sunday June 22nd performance. Part of the Sean O’Casey Cycle (the Dublin Trilogy) at Irish Repertory Theatre, the groundbreaking play ran in repertory with O’Casey’s “The Shadow of a Gunman” (1923) and “Juno and the Paycock” (1924) and was…",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 798,
  "archivePath": "data/archives/reviews/chess-2025/theatrereviews-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:45:33.986Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "sourceMethod": "playwright"
}