{
  "showId": "chess-2025",
  "outletId": "THEHOLLYWO",
  "outlet": "The Hollywood Reporter",
  "criticName": "Richard Lawson",
  "url": "https://www.hollywoodreporter.com/lifestyle/arts/chess-theater-review-lea-michele-aaron-tveit-abba-musical-1236427952/",
  "publishDate": "November 16 2025",
  "fullText": "Lea Michele in Broadway's 'Chess.' Courtesy of Chess Share on Facebook Share on X Google Preferred Share to Flipboard Show additional share options Share on LinkedIn Share on Pinterest Share on Reddit Share on Tumblr Share on Whats App Send an Email Print the Article Post a Comment On the digital marquee of Broadway's Imperial Theater , the stars of the new reimagining of the 1984 musical Chess — about rival American and Soviet chess wizards and the woman caught between them — gaze out toward 8th Avenue with looks of serious intent. Aaron Tveit , Lea Michele (last on Broadway in 2023 in Funny Girl ) and Nicholas Christopher are in black and white, expressions stern and the faintest bit sultry. This, the marquee advertises, is going to be a mature, sophisticated rendering of a musical long relegated to the joke bin of Broadway nostalgia. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-article-mid-article-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[300,250],[2,2],[300,251],[620,350],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); But what's happening inside the theater complicates and contradicts that solemn marketing. Director Michael Mayer's version of things, which opened on November 16, sets a musical about the Cold War at garish, sometimes glorious, war with itself. Related Stories Business Broadway Box Office: &#039;Harry Potter&#039; Brings In $2.65 Million As Industry Heads Into Slow Winter Months Lifestyle Channing Tatum&#039;s &#039;Magic Mike Live&#039; Comes to New York Chess is notoriously amorphous. First conceived by famed lyricist Tim Rice ( Jesus Christ Superstar, Evita, The Lion King ) and given musical voice by ABBA's Benny Andersson and Bj&ouml;rn Ulvaeus, Chess has lived many lives. It began as a 1984 concept album, blossomed into a successful West End production in 1986, and then flopped out on Broadway in 1988. Its DNA has changed repeatedly over the years; major overhauls to the script have essentially rendered each iteration of the show an entirely separate entity. What remains at least semi-constant is the music, an alternately gliding and lurching melange of early 1980s soft-rock pop, and Lloyd Webber-ian operetta. It's a lumpy but often sweetly sonorous mess that many ardent fans love mostly for a handful of songs, a few of which became radio hits in the 1980s. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-dsk-tab-mid-article2-uid1' ) .setTargeting( 'pos', [\"mid\",\"mid-article2\",\"mid-articleX\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article2\") .addSize([[300,250],[300,251],[620,350],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); So what is a modernist like Mayer, who made such cool craft of ancient stuff 20 years ago with Spring Awakening, to do with something as hokey and booby-trapped as Chess ? Well, he's brought in the screenwriter Danny Strong ( Game Change , Dopesick ) to introduce what is essentially entirely new packaging. Geopolitics come heavily to bear on this Chess — espionage and nuclear anxiety widen the scope of the show to nothing smaller than the fate of the world. But these jittery apocalyptic concerns are mostly addressed from a contemporary remove; Mayer's Chess gazes back at what might have been during the paranoid final days of the Cold War without seeming terribly worried that any of it might actually affect the play's characters. An administrative role from past productions, The Arbiter, has been blown up and altered into an omniscient narrator, a sort of trickster-god/game-show-host/ Our Town stage manager figure played with limber wit and energy by Bryce Pinkham. (Full disclosure: Pinkham and I were college-theater classmates two decades ago.) He there's to contextualize things for the audiences of today: both what was genuinely at stake as America and the USSR circled one another at the dawn of the Reagan administration and where the musical Chess fits into all that (if anywhere). There is a lot of sardonic referencing of the show itself, a winking acknowledgment that, yes, some of this is pretty dated and corny. Which is often amusing, sometimes grating. Jokes that yoke the time of Chess to recent headlines — RFK Jr.'s brain worm, Biden's failed second-term bid — are awfully wheezy. (When the gags are really bad, one almost wonders if one is actually across the street watching Operation Mincemeat .) But some of the show's Brechtian self-awareness works quite well, giving Chess a giddy shiver of the prescient or the eternal. Mayer and Strong offer a broad pop-history lesson, gesturing toward the vexing tensions and turmoils that have cyclically churned throughout the decades; the only thing that&#8217;s changed are the aesthetics. Pinkham is an able and engaging docent on this musical museum tour, in which the 4...",
  "isFullReview": true,
  "showScoreExcerpt": "\"In the unending battle between sincerity and snark, Iâm afraid I have to call this particular showdown a draw.\"",
  "originalScore": null,
  "assignedScore": 62,
  "source": "reviews-json-stub",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T04:59:44.368Z"
}
