{
  "showId": "chess-2025",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Christian Lewis",
  "url": "https://variety.com/2025/legit/reviews/chess-review-musical-broadway-lea-michele-1236583104/",
  "publishDate": "November 16, 2025",
  "fullText": "Home Legit Reviews Nov 16, 2025 8:00pm PT &#8216;Chess&#8217; Review: Lea Michele Reigns as Queen of This Uneven Broadway Revival By Christian Lewis Plus Icon Christian Lewis Latest &#8216;Chess&#8217; Review: Lea Michele Reigns as Queen of This Uneven Broadway Revival 2 months ago &#8216;Just in Time&#8217; Review: Jonathan Groff Plays Bobby Darin in a Lackluster Bio-Jukebox on Broadway 9 months ago &#8216;Pirates! The Penzance Musical&#8217; Review: David Hyde Pierce and Jinkx Monsoon Lead a Rollicking, Riotous Reimagination of Gilbert and Sullivan on Broadway 9 months ago See All Matthew Murphy How do you solve a problem like \" Chess \"? With music and lyrics by Benny Andersson and Bj&ouml;rn Ulvaeus (of ABBA ) and Tim Rice, and now with a new version of Rice's book by Danny Strong, \"Chess\" tells of the Cold War chess rivalry between Freddie Trumper ( Aaron Tveit ) of the US and Anatoly Sergievsky (Nicholas Christopher) of the USSR, as well as the woman, Florence Vassy ( Lea Michele ), who gets caught in the middle. While beloved by some, \"Chess\" is a famously messy musical, particularly due to Rice's confused book, which has been reworked too many times to count. Songs have been moved, added, cut, or reassigned. Settings (both locations and years) have been altered. Characters have been expanded, removed, or significantly tweaked. The ending (particularly for Florence) has gone through numerous versions, each with completely different meanings and messages. Even seemingly core and essential details, like who wins the chess matches, have been changed across productions. blogherads.adq.push(function () { blogherads .defineSlot( 'medrec', 'gpt-variety-article-mid-article-uid0' ) .setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] ) .setTargeting( 'viewable', 'yes' ) .setSubAdUnitPath(\"ros\\/mid-article\") .addSize([[300,250],[2,2],[300,251],[2,4],[4,2],[320,480],[620,366]]) .setClsOptimization(\"minsize\") ; }); Related Stories &#039;Euphoria&#039; Season 3 Trailer: Zendaya, Sydney Sweeney and Jacob Elordi Return as Rue Battles Drug Dealers, Cassie Becomes a Cam Girl and More",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T04:59:51.138Z",
  "dtliThumb": "Meh"
}