{
  "showId": "chess-2025",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Sara Holdren",
  "url": "https://www.vulture.com/article/theater-review-chess-musical-broadway-tveit-michele.html",
  "publishDate": "November 16, 2025",
  "fullText": "“One Night In Bangkok” walked so Sam Rockwell’s White Lotus monologue could run. The song is such a ridiculous rush that it pretty much justifies the whole project. I think some plot still happens after that, but frankly, I left my heart—and my wallet and my keys and my sobriety—in this Bangkok, and I’m okay with that. Who knew chess could get you so high?",
  "isFullReview": false,
  "dtliExcerpt": "theater review The Winner Takes It All: Chess Returns to Broadway By Sara Holdren , a theater director and Pulitzer-finalist critic at New York Nov. 16, 2025 save d Save this article to read it later. Find this story in your account&#x2019;s &#x2018;Saved for Later&#x2019; section. Comment Photo: Matthew Murphy/Matthew Murphy Grab your sleeping bags and bug spray, people. It’s time for camp. Chess is back on Broadway after 37 years, as big and weird as ever, with as much late-’80s bombast as a Claude Montana runway show , as much cheese as a charcuterie board. Let’s get the Five Ws out of the way so we can get to all that delicious dairy: Who? Musical-theater prom court Lea Michele, Aaron Tveit, and Nicholas Chistopher as the cult hit’s absurdly brainy love triangle; Michael Mayer holding the bullhorn; and, of all people, Danny Strong behind the new book that’s attempting to give some kind of psychological/historical coherency to the stadium-size music by ABBA’s Benny Andersson and Björn Ulvaeus and the barrage of histrionic lyrics by Tim Rice. (Because who better to take yet another swing at Chess ’s notoriously wonky book than the guy who co-wrote The Hunger Games: Mockingjay ?) What and when? Well, chess! And love, I guess. And the Cold War, definitely. The show starts off in 1979, as we are immediately informed by its super-caffeinated narrator, the Arbiter (Bryce Pinkham, having such a damn good time it feels like all his serious faces are on the edge of cracking into giggles). Despite this Arbiter’s proclivity for lobbing soft 2025 political jokes into the audience, the story is still very much a “Cold War musical.” In case we ever forget — despite the Boris-and-Natasha accents and the model nuclear warheads tucked in among the oversize chess pieces that frame David Rockwell’s unabashedly presentational set — the Arbiter reminds us more than once. But where? Various glitzy locales playing host to matches in the World Chess Championships, like Merano and — immortally, unforgettably — Bangkok. And … Why? Honestly, who knows? Strong’s efforts to zest the lemon of relevancy over this crazy cocktail aren’t exactly profound. (“These negotiations brought about the end of the Cold War,” says the Arbiter near the finale, catching us up on the talks between Reagan and Gorbachev. Then he gives the facial-expression equivalent of a dun-dun-DUN : “The first one, that is.”) But just as honestly: Who cares? For all the talk of SALT II and the Able Archer exercises — all the protestations that a single checkmate could cause nuclear armageddon — Chess is not a serious musical. Fine. Good , even! When the show is at its best, it hits levels of unironic ludicrousness that are more fun than most things on Broadway. Back in 1988 Frank Rich ripped Chess ’s American premiere a new one: “The characters,” he wrote in the New York Times , “yell at one another to rock music.” Yes, they absolutely do. And I had a great time. At the risk of sounding like an old fart, they don’t make musicals like they used to. That’s just a fact, often an exciting one — but every so often, a revival will bring the geist of its Zeit blasting back with irresistible force. Especially when that time-ghost is much more prone than ours is to strutting and yearning and feeling all the feelings at eleven. The Mountain Goats’ John Darnielle has a theory that the average beats-per-minute of any era’s pop music corresponds to whatever the drug of the moment was. So if it feels like all of Chess is on coke, well, snort up, buttercup. Storywise, we’ve got three prodigies trapped inside a big fat metaphor: While the volatile American genius Freddie Trumper (Tveit, and yes that’s really the character’s name, and yes, of course there’s a joke about it) and his second -and-lover, the “brilliant and beautiful” genius Florence Vassy (Michele), face off against the brooding Russian genius Anatoly Sergievsky (Christopher), they and their games and love affairs are also being manipulated by power players from both the U.S. and the Soviet Union — because apparently, between 1979 and 1983, the world’s narrow escapes from mutually assured destruction came down to backroom intrigue over openings and endgames. Wielding the human pawns, there’s Sergievsky’s coach Alexander Molokov (Bradley Dean), “who may or may not be KGB” (hmm), and the sardonic CIA agent Walter de Courcey (Sean Allan Krill), whose shelf of ice-blonde hair looks solid enough to support a hood ornament. It doesn’t take long for Freddie — never a nice guy and, to be fair to him, also bipolar — to blow things up with both Florence and Anatoly. He’s the reigning world champion, but in 1979 he forfeits the championship game to Anatoly after the Russians successfully get into his head. To paraphrase the old joke, just because Freddie is paranoid doesn’t mean the Soviets don’t have his room bugged and Florence isn’t in love with Anatoly. She is, and soon the new lovers are off to the U.K.: Anatoly defects, Flore...",
  "originalScore": null,
  "assignedScore": null,
  "source": "dtli",
  "needsFullText": false,
  "fetchedAt": "2026-01-23T04:59:53.846Z",
  "dtliThumb": "Meh"
}