{
  "showId": "jesus-christ-superstar-2012",
  "outletId": "nytimes",
  "outlet": "The New York Times",
  "criticName": "Ben Brantley",
  "url": "https://www.nytimes.com/2012/03/23/theater/reviews/jesus-christ-superstar-at-the-neil-simon-theater.html",
  "publishDate": "March 22, 2012",
  "fullText": "Get unlimited access to NYTimes.com and NYTimes apps.\n\nAll print options include free, unlimited access to NYTimes.com and NYTimes apps.\n\nJesus Christ Superstar Paul Nolan stars in a new production of the musical on Broadway at the Neil Simon Theater. More Photos »\n\nSpoiler alert! Oh, just kidding. It will surely come as a surprise to no one that the title character in “Jesus Christ Superstar” does not come to a happy end, drifting blissfully into old age and obscurity on the sands of Judea. His gruesome death is depicted with unusually lavish flair in the director Des McAnuff’s flashy revival of the pop-rock musical by Tim Rice and Andrew Lloyd Webber that opened Thursday night at the Neil Simon Theater.\n\nFollow @NYTimestheater for theater news and reviews from Broadway and beyond.\n\nPaul Nolan, left, as Jesus, with Josh Young as Judas Iscariot in \"Jesus Christ Superstar.\" More Photos »\n\nAfter he has been dragged off by Roman thugs, hands bound and a look of sorrowful resignation on his face, Jesus (Paul Nolan) returns for a flogging, with each stroke of the lash counted down and represented by vivid red splashes streaking across the electronic back wall of the set. The metal staircase on which he is splayed is then turned to face the audience, the better to expose the bleeding welts criss-crossing his back.\n\nNext come the crown of thorns and Jesus’ agonized crawl across the stage, bearing the weight of his own crucifix. And at last, after making yet another entrance, Mr. Nolan strikes the pose immortalized in centuries of art, clad in a demure loincloth, arms held out to his sides, one leg artfully bent in front of the other, head hanging down in tortured exhaustion. Gently spotlighted, he rises from the stage as if by magic, while a giant cross, pulsing with hot gold lights, descends from above to meet him. Mr. Lloyd Webber’s churning guitar rock hits a climactic note, and the audience erupts in excited applause.\n\nIf this delirious reception for a glitzy depiction of the most influential execution in world history doesn’t strike you as remotely absurd, Mr. McAnuff’s “Jesus Christ Superstar” may just be the right musical for you. I have to confess to finding the show alternately hilarious and preposterous — if often infectiously melodic — during the two hours’ busy traffic of Mr. McAnuff’s brisk and lucid staging.\n\nFirst seen at the Stratford Shakespeare Festival in Canada, the production employs mostly modern dress and a metallic two-tiered set, suggestive of an arena-rock extravaganza, to depict the final days in the life of Jesus. (The set, by Robert Brill, is similar to the one he created for Mr. McAnuff’s ill-received revival of Gounod’s “Faust” at the Metropolitan Opera this season.)\n\nJesus’ apostles and other followers are clad in chic gray street wear and tumble and slide across the stage with impressive athleticism in the show’s opening minutes, presumably in flight from their black-leather-clad oppressors. The daily countdown to the Crucifixion is displayed on an electronic ticker of the kind that snakes around buildings in Times Square. This is a story for all times, the production asserts, if not for all tastes.\n\nIt arrives with much of its original Canadian cast intact. The standout performance comes from Josh Young as a vocally lustrous and charismatic Judas Iscariot, well known for betraying his onetime mentor with a fatal kiss. In Mr. McAnuff’s production that kiss is particularly fraught, since the show trains a subtle focus on the tense triangle among its three central characters — Jesus, Judas and Mary Magdalene (Chilina Kennedy).\n\nMr. Young’s Judas sings repeatedly of his disappointment at Jesus’ betrayal of his ideals. But the hungry looks Judas repeatedly casts suggest that sexual jealousy plays no small role in his decision to turn the object of his agonized affection over to the Roman rulers, to whom this “King of the Jews” is a prickly thorn in the side.\n\nMr. McAnuff’s staging is rich in portentous looks, actually. Mr. Nolan’s serenely suffering Jesus is often to be found at or near the lip of the stage, peering into the middle distance with his piercing blue eyes, as if stoically watching his destiny unfolding on an HDTV screen at the back of the theater. Ms. Kennedy sometimes joins him in this pastime, as do some members of the chorus. If a musical were to be judged by the amount of time its characters spent gazing meaningfully into the audience, this production would be trumps.\n\nGet 50% Off The New York Times & Free All Digital Access.\n\nBillions of dollars have poured into the continent to fight killer diseases. But the most basic killer, injury, is neglected.\n\nIn Room for Debate: Even for students who can afford a semester overseas, there may be better uses for that time and money.",
  "isFullReview": true,
  "dtliExcerpt": "This production works hardest when it stops trying so hard, when it lets the music do the heavy lifting and allows its performers to find their characters within the songs instead of around them.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": null,
  "bwwRoundupUrl": null,
  "showScoreExcerpt": "This production works hardest when it stops trying so hard, when it lets the music do the heavy lifting and allows its performers to find their characters within the songs instead of around them.",
  "contentTier": "complete",
  "contentTierReason": "Short text (34 words)",
  "rejectedAt": "2026-02-03T17:45:42.967Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "not_a_review",
  "rejectionReasoning": "claude: This appears to be a single sentence excerpt or quote, not a complete review with enough content to determine the critic's overall recommendation; openai: The text is too brief and lacks a clear evaluative verdict or comprehensive assessment of the show.",
  "promptVersion": "5.2.0",
  "sources": [
    "web-search"
  ],
  "previousUrl": "https://www.nytimes.com/2012/03/23/theater/reviews/jesus-christ-superstar-at-neil-simon-theater.html",
  "urlDiscoveredAt": "2026-02-07T07:39:51.178Z",
  "urlDiscoveryMethod": "google-serp",
  "textWordCount": 807,
  "archivePath": "data/archives/reviews/jesus-christ-superstar-2012/nytimes--ben-brantley_2026-02-07.html",
  "textFetchedAt": "2026-02-07T07:39:51.183Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20140128215959",
  "archiveOrgUrl": "http://web.archive.org/web/20140128215959/http://www.nytimes.com:80/2012/03/23/theater/reviews/jesus-christ-superstar-at-the-neil-simon-theater.html?",
  "wordCount": 807,
  "tierReason": "Full review text"
}