{
  "showId": "lackawanna-blues-2021",
  "outletId": "cititour",
  "outlet": "Cititour",
  "criticName": "Brian Scott Lipton",
  "url": "https://cititour.com/NYC_Broadway/Lackawanna-Blues/1048",
  "playbillVerdictUrl": "https://cititour.com/NYC_Broadway/Lackawanna-Blues/1048",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "NYC Events, Restaurants, Music, & Nightlife\n\nTwitter\nX\nPinterest\nThreads\nSnapchat\nWhatsApp\nMessage\nEmail\n\nTickets from $59\n Buy Tickets\n\nCititour.com Review\n Audience members of a certain age will remember the day when a friend or relative invited you over to look at their photo album or view their slide show, fondly describing, often in vivid detail, their memories of each shot. Sometimes, you really felt like you were there with them -- and sometimes, well, you felt like you really had to have been there to fully appreciate the experience.\n\nWhich camp you belonged to back then may explain your current reaction to Tony Award winner Ruben Santiago-Hudson’s autobiographical theatrical memoir, “Lackawanna Blues,” which has taken two decades to travel uptown from the Public Theater to Manhattan Theatre Club’s Broadway home, the Samuel J. Friedman Theatre.\n\nFor 90 minutes, Santiago-Hudson – doing triple duty here as solo actor, writer and director – presents an often-riveting series of snapshots from his childhood in upstate New York in which he introduces us to Rachel Crosby (Nanny), the unbelievably kind-hearted yet tough-skinned woman who raised him, along with the dozens of characters who lived in her boarding houses or crossed her path. \n\nDressed simply in a 1950s-style bowling shirt and pants on Michael Carnahan’s barely-there set, the astonishing Santiago-Hudson changes his voice and his physicality with both alacrity and authenticity, making it instantly clear when a new character has emerged. And, without question, the stories he relates of these mostly ordinary folk are told with extraordinary zest and detail. \n\nWhat’s even more impressive is Santiago-Hudson’s obvious affection for, or at least compassionate understanding of, everyone who was part of his past -- whether we’re being given a glimpse of former psychiatric patient named Lemuel Taylor, who meets a sad, solitary end; battered wife Norma, who runs to Nanny in the middle of the night after a vicious beating from her boorish lover Gerald (who also makes an unwelcome appearance); or even Nanny’s long-time and frequently faithless lover Bill, who doesn’t always treat the young Ruben (another major character in the piece) as kindly as he might have.\n\nYet, as engrossing as much of the show is -- and all of it is enhanced by the almost-constant background guitar-playing by Junior Mack of the music of the late, great Bill Sims Jr. -- I have to admit (somewhat sadly) that the piece didn’t fully satisfy me. While we leave realizing that Nanny’s kindness may be the biggest reason Santiago-Hudson has such a successful career, what seems less clear to me is how Hudson thinks his interactions with these other people shaped the incredible man he became. But maybe, just maybe, I had to have been there.\n\n By Brian Scott Lipton\n\nVisit the Sitehttps://www.manhattantheatreclub.comOpen/Close DatesOpening 10/7/2021Closing 11/12/2021\nTheatre Info\nSamuel J. Friedman Theatre261 West 47th Street New York, NY 10036 Map\n\nCititour.com is your guide to interesting places throughout New York City. Use our listings to locate restaurants, exciting clubs and nightlife, bars and pubs, shopping destinations, landmarks and parks; and shows, concerts, and other events too.",
  "isFullReview": true,
  "textWordCount": 512,
  "archivePath": "data/archives/reviews/lackawanna-blues-2021/cititour--brian-scott-lipton_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:09:04.322Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Insufficient text extracted: 0 chars"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 512,
  "tierReason": "Full review text"
}