{
  "showId": "lackawanna-blues-2021",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Maya Phillips",
  "url": "https://www.nytimes.com/2021/10/07/theater/lackawanna-blues-review.html",
  "playbillVerdictUrl": "https://www.nytimes.com/2021/10/07/theater/lackawanna-blues-review.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews",
    "bww-roundup"
  ],
  "fullText": "https://www.nytimes.com/2021/10/07/theater/lackawanna-blues-review.htmlShare full article16Advertisement\n\nIt takes a village, the saying goes. But if you’re one member of a motley crew of characters in 1950s Lackawanna, N.Y., well, then, you might say it takes a boardinghouse, and a generous woman, to keep everyone in line.\n\nThat woman is Nanny, the beating heart of Ruben Santiago-Hudson’s tender and vibrant autobiographical one-man show, “Lackawanna Blues,” which opened on Thursday night in a Manhattan Theater Club production at the Samuel J. Friedman Theater. It proves to be a winsome performer’s master class in storytelling, despite a few flat notes.\n\nHer party of misfits includes Numb Finger Pete, Sweet Tooth Sam, a pampered pet raccoon, and a man who was sentenced to 25 years in jail for a double homicide. In “Lackawanna Blues,” Santiago-Hudson introduces us to each of these figures, some with specific anecdotes; some in passing, as one would mention an acquaintance in a conversation; and some with little framing at all, just whatever monologue that person sees fit to deliver through him. Yet everything comes back to Nanny, easily and patiently tying everyone together.\n\nYou might think it would also take a village to animate these characters — at least 25 — for the stage, but Santiago-Hudson manages just fine on his own. Michael Carnahan’s intimate set design — a few stools and chairs and a brick backdrop meant to look like the outside of one of Nanny’s apartment buildings, all framed by a proscenium of faded wooden panels — brings the timeworn homeyness of Lackawanna to the Friedman Theater. When Santiago-Hudson first steps onto the stage, in front of the door of that Lackawanna boardinghouse, an overhead light cloaks his face in shadow; he’s just a silhouette, his rounded shoulders and slouch or straight-backed posture illustrating a rapid-fire series of transformations.\n\nThis isn’t Santiago-Hudson’s first rodeo. “Lackawanna Blues” premiered Off Broadway at the Public Theater in 2001, and, four years later, was adapted for a star-studded HBO film with S. Epatha Merkerson, Hill Harper, Terrence Howard, Rosie Perez and many others. Still, seeing Santiago-Hudson take command of the Broadway stage is delightful to watch — and listen to. He slips into a slow, self-consciously genteel purr for Small Paul, a piping soprano for Mr. Lucious, and a warble and growl for Freddie Cobbs.\n\nThe very first instrument we learn to use is the human voice. In “Lackawanna Blues,” Santiago-Hudson shows his expert prowess with his, which he uses to deliver music with his portrayal of the various personalities. He strings together a cadence, tone and rhythm into a piece of work that is equal parts narrative and song.\n\nWhich isn’t to disregard the actual music in the production, which not only bridges the anecdotes but also maintains the brisk tempo of the show. (A beat too brisk, at times, but at 90 minutes “Lackawanna Blues,” like most of Nanny’s tenants, knows not to overstay its welcome.)\n\nThe alternatively soulful and upbeat jazz music also serves as a kind of dialogue; sure, the guitarist Junior Mack expertly accompanies the text from his seat on the side of the stage, but he also converses with Santiago-Hudson — and his harmonica — without saying one word. So when Santiago-Hudson pauses to take a sip of water, Mack summons him back with a few low strums. And Santiago-Hudson returns that steady hum with the vigorous trills and whines of his harmonica, which he seems to summon out of thin air, each time creating jouncing rhythms that would make blues greats of the past shimmy in their graves.\n\nAnd after the dark times of the past year and a half, we’re overdue for some laughter. Santiago-Hudson, a merciless charmer, gamely supplies many funny moments: whether he’s recounting a prime-time-worthy brawl between Numb Finger Pete and Mr. Lemuel Taylor or speaking in the mangled vocabulary of Ol’ Po’ Carl, who praises the sights of New York, including “da Statue Delivery” and “the Entire State Building.”\n\nThough even in those moments when he emulates these Lackawanna folks — many of whom, he notes, are poor and uneducated — he doesn’t do so cruelly; he treats them with tenderness and empathy, even the brutal ones who did wrong.\n\nThere are also instances of sorrow, which Santiago-Hudson fails to attack as nimbly. He pushes too hard on the emotional notes, like a scene in which a woman comes to Nanny’s in the middle of the night with her kids and bloody wounds. And by the end, he awkwardly circles around an ending that must inevitably tackle dear Nanny’s death.\n\nIt always comes back to Nanny, with her stiff back and neatly folded arms; Santiago-Hudson’s rendering evokes a Cicely Tyson type, a strong Black matriarch not to be trifled with. His narrative performance is impressive for many reasons, but one of the most nuanced is the way Santiago-Hudson sees it all, as a child eavesdropping and peeking through doorways, with curious and affectionate eyes.\n\nHe grounds us in the details, which brings not just these characters, but also a whole town to life: the way a woman pops her hips, the way a man coughs, even the particular tint of the Lackawanna snow. After all, people may think the blues are about heartbreak, but to get to heartbreak, you first have to pass through love.\n\nThrough Nov. 12 at Manhattan Theater Club; 212-239-6200, manhattantheatreclub.com. Running time: 1 hour 30 minutes.\n\nMaya Phillips is a critic at large. She is the author of the poetry collection “Erou” and “NERD: Adventures in Fandom From This Universe to the Multiverse,” forthcoming from Atria Books. More about Maya Phillips\n\n16Share full article16Advertisement",
  "isFullReview": true,
  "textWordCount": 936,
  "archivePath": "data/archives/reviews/lackawanna-blues-2021/nytimes--maya-phillips_2026-02-05.html",
  "textFetchedAt": "2026-02-05T02:58:34.084Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20231003212528",
  "archiveOrgUrl": "http://web.archive.org/web/20231003212528/https://www.nytimes.com/2021/10/07/theater/lackawanna-blues-review.html",
  "contentTier": "complete",
  "wordCount": 936,
  "tierReason": "Full review text",
  "bwwExcerpt": "It always comes back to Nanny, with her stiff back and neatly folded arms; Santiago-Hudson's rendering evokes a Cicely Tyson type, a strong Black matriarch not to be trifled with. His narrative performance is impressive for many reasons, but one of the most nuanced is the way Santiago-Hudson sees it all, as a child eavesdropping and peeking through doorways, with curious and affectionate eyes. He grounds us in the details, which brings not just these characters, but also a whole town to life: the way a woman pops her hips, the way a man coughs, even the particular tint of the Lackawanna snow. After all, people may think the blues are about heartbreak, but to get to heartbreak, you first have to pass through love.",
  "bwwScore": 9,
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-LACKAWANNA-BLUES-Opens-on-Broadway-20211007"
}