{
  "showId": "lackawanna-blues-2021",
  "outletId": "theatrely",
  "outlet": "Theatrely",
  "criticName": "Unknown",
  "url": "https://www.theatrely.com/post/lackawanna-blues-hums-a-tender-portrait-of-a-doting-matriarch-review",
  "playbillVerdictUrl": "https://www.theatrely.com/post/lackawanna-blues-hums-a-tender-portrait-of-a-doting-matriarch-review",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-roundup"
  ],
  "bwwExcerpt": "\"His eyes throughout the show reflect more than a glimmer of the bright lights of Broadway-they spark with the joy of generations and cultures finally expressing themselves on the largest stage in the country. That spark is what makes Lackawanna probably the most honest show in New York right now: 90 minutes of earnest, unsentimental love for one's past. Under his own direction, Santiago-Hudson takes us on a tour of the people who hung around Miss Rachel's boarding house, restaurant, and nightcl",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-LACKAWANNA-BLUES-Opens-on-Broadway-20211007",
  "fullText": "Ruben Santiago-Hudson in Lackawanna Blues | Photo: Marc J. Franklin\n\nRuben Santiago-Hudson is intimately familiar with Lackawanna Blues, his play which opened Thursday night at the Samuel J. Friedman Theatre, and not just because he based it on his own upbringing. The one-man ode to the woman who raised him premiered at the Public in 2001, was adapted by HBO in 2005, and has been performed here and there since. And yet, his eyes throughout the show reflect more than a glimmer of the bright lights of Broadway—they spark with the joy of generations and cultures finally expressing themselves on the largest stage in the country.\n\nThat spark is what makes Lackawanna probably the most honest show in New York right now: 90 minutes of earnest, unsentimental love for one’s past. Under his own direction, Santiago-Hudson takes us on a tour of the people who hung around Miss Rachel’s boarding house, restaurant, and nightclub outside Buffalo circa 1956. Known as Nanny to friends and patrons, the tender-hearted matriarch was “like the government if it really worked,” taking in a colorful array of often-rowdy boarders, she gave food, respite, money, and second chances to those usually neglected such kindness. The playwright himself wound up under her care when Nanny found out his mother was planning to abandon him, and the two developed an intense bond that lasted past her lifetime, through to his.\n\nAn intense bond between a young child and caring adult is not novel, but rarely is it evoked as beautifully as through Santiago-Hudson’s impressionistic portrait, which takes an entire community to paint: ever the consummate performer, he plays over 20 different characters, all of whom were helped by Nanny in some way.\n\nAccompanied by guitarist Junior Mack—who, on a stool against a brick wall, under Jen Schriever’s lighting, is giving his best K.K. Slider—playing the late composer Bill Sims, Jr.’s score, Santiago-Hudson matches the warm music with his own rhythm. If this all seems very, “old head snapping his fingers about how good the old days were,” it is and it isn’t. Well, it is, but Santiago-Hudson’s love for Nanny is infectious and almost inspirational in how unbounded it is. Lacking any groundbreaking revelations or climatic sob stories about a summer that changed everything, the playwright-performer lays out a simple tale of the woman who changed his life, sometimes picking up (and slaying!) a harmonica to punctuate more emotional beats.\n\nFor all of the voices and mannerisms Santiago-Hudson adopts when switching in and out of characters, the play feels spectacularly without artifice. By the end of its breezy, autumnal runtime, which concludes with a childlike moment of gratitude, he has given Miss Rachel the most loving parting present imaginable. Twenty years after having first delivered it, the man—and the boy inside him—feel intensely grateful to be able to do it, once more, on Broadway, and one feels honored to have witnessed it.\n\nLackawanna Blues is now in performance at the Samuel J. Friedman Theatre on West 47th Street in New York City. For tickets and more information, visit here.\n\nJuan A. Ramirez writes arts and culture reviews, features, and interviews for publications in New York and Boston, and will continue to do so until every last person is annoyed. Thanks to his MA in Film and Media Studies from Columbia University, he has suddenly found himself the expert on Queer Melodrama in Venezuelan Cinema, and is figuring out ways to apply that.\n\nA fresh look at features, news, reviews, and interviews of theatre across the globe, from Broadway to London and everywhere in between. Your one-stop shop for the latest information in arts and culture by the next generation, for the next generation.",
  "isFullReview": true,
  "textWordCount": 615,
  "archivePath": "data/archives/reviews/lackawanna-blues-2021/theatrely--unknown_2026-02-05.html",
  "textFetchedAt": "2026-02-05T18:09:08.765Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20251211131355",
  "archiveOrgUrl": "http://web.archive.org/web/20251211131355/https://www.theatrely.com/post/lackawanna-blues-hums-a-tender-portrait-of-a-doting-matriarch-review",
  "contentTier": "complete",
  "wordCount": 615,
  "tierReason": "Full review text"
}
