{
  "showId": "lackawanna-blues-2021",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Helen Shaw",
  "url": "https://www.vulture.com/2021/10/theater-review-ruben-santiago-hudsons-lackawanna-blues.html",
  "playbillVerdictUrl": "https://www.vulture.com/2021/10/theater-review-ruben-santiago-hudsons-lackawanna-blues.html",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nRuben Santiago-Hudson.\n Photo: Lia Chang\n \n \n \n Whenever the voices flooding through him get to be too much, Ruben Santiago-Hudson pulls out his harmonica. In his superb solo show Lackawanna Blues, he acts as a conduit for dozens of ghosts: Nanny, the woman who raised him; the many denizens of Nanny’s boardinghouses; the bumptious heyday of the Western New York steel-mill town; his younger self. But channeling sometimes fails, and it’s then that the harmonica talks. At these moments, the room itself seems to be crying, filled past bursting with weeping, laughing, explosive life.\n\nThe stage is more a mood than a construction. Set designer Michael Carnahan has put in a window and a door and a lazy ceiling fan, and the guitarist Junior Mack perches on a stool, playing Bill Sims Jr.’s music in Jen Schriever’s smoky spotlight. But for the most part the Samuel J. Friedman Theatre drifts insubstantially behind Santiago-Hudson, with the only reality the one he describes. His description is thick, though. It’s solid and dense and lyrical: You could prop that door open with it.\n\nLackawanna, Santiago-Hudson tells us, was like Cleveland, Albany, Detroit — cities on the shores of the Great Lakes where there was work and opportunity, all of them end points of the Great Migration north. Lackawanna in the ’50s and ’60s was “jumping,” he says, with excitement and violence both. “Negroes getting shot or cut every week,” he says, but also — “everybody making money.” It was a place packed with good southern food, great dancing, bad gambling, hustling, effort, and strife.\n\nAt ease in his guayabera shirt, harmonica tucked into his palm, Santiago-Hudson seems to dance a little as he plays his parts. (The play’s opening night was postponed after he hurt his back, but you see nothing of that here — at one point, while discussing a Toronto skating rink, he frolics.) The text is musical, so even when he occasionally breaks into song, it barely registers as a change. His expression is endlessly plastic, able, for instance, to smile in a way that pours back and forth between mental illness and cogitating delight. Some of his characters seem broadly played, but in each one, nuance flickers like banked flames. Some of the figures are narrated through little Ruben’s eyes, others seem to be speaking to an adult Ruben who has returned to interview them. Running through it all is Santiago-Hudson’s own gratitude: Nanny took him in as a toddler after he was discovered alone in one of her boarding rooms, sleeping, with half a hamburger in his hand.\n\nNanny’s own founding story is also about nourishment. Working for a white family (her given name is Rachel Crosby; the children called her Nanny), she prepared cakes and pies so they would have something sweet on the days she wasn’t there. The white mother encouraged her to bake herself a second cake, then turned on her in a fury when she dared to — and Nanny realized she was done with that sort of labor. She shifts to what seems like an infinity of new enterprise: She takes in boarders. She turns her car into a taxi, which eventually becomes a cab stand. She opens another boardinghouse and a restaurant. And she provides shelter and food for what seems like all the city’s storm-tossed people — roughnecks, single mothers, gamblers, and those with the stamp of an uncaring country pressed deep into their bodies and minds. “Nanny was like the government if it really worked,” Santiago-Hudson laughs.\n\nSantiago-Hudson has had plenty of time to polish Lackawanna Blues on its way to Broadway. He first performed it in 2001 and has revived it since, including an engagement in Los Angeles in 2019. In 2005 he and George C. Wolfe made it into a television movie (in which S. Epatha Merkerson played Nanny), but I prefer this theatrical version, in which Santiago-Hudson handles nearly every duty: director, writer, sole actor. The story expands our notion of a single person’s capacity for care, so it’s important that the play itself also be capacious, that it show us one person keeping dozens “alive,” at least in memory. Santiago-Hudson has won two Tony awards: one for performance in August Wilson’s Seven Guitars, another for the revival of Wilson’s Jitney. (As a director he is a key interpreter of Wilson and, later this same season, Dominique Morisseau.) In watching the easy way so many characters fit beneath his skin, you start to understand why he is so good with other people’s plays.\n\nLackawanna Blues does ask a lot of us: It asks us to listen carefully, to lean forward to catch each anecdote about Numb Finger Pete (lesson learned: never try to walk home from Albany in the snow), or to hear Nanny’s little snore of pleasure when young Ruben greases her scalp. When I first heard it was going to Broadway, I worried that a big room might mess with that intricacy or with the production’s intensity and intimacy. And if you sit far away, I think the sheer speed of Santiago-Hudson’s changes from character to character might sometimes defeat your ability to keep up with the avalanche of detail. But the size of the theater does not ever make Santiago-Hudson seem small. You could add another few balconies and he’d still seem to be leaning on your shoulder, impersonating one more person he grew up around, shaking his head at your surprise. The show is a memorial, and he has been building it for 20 years. A Broadway stage is actually a little small for what he wants to do: Monuments are built big for a reason.\n\nLackawanna Blues is at the Samuel J. Friedman Theatre through November 7.\n\nShow \n \n \n Leave a Comment\n \n\n The Many Voices of a One-Man Show: Lackawanna Blues\n\n \n \n\n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 990,
  "archivePath": "data/archives/reviews/lackawanna-blues-2021/vulture--helen-shaw_2026-02-04.html",
  "textFetchedAt": "2026-02-04T16:05:48.453Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250722110839",
  "archiveOrgUrl": "http://web.archive.org/web/20250722110839/https://www.vulture.com/2021/10/theater-review-ruben-santiago-hudsons-lackawanna-blues.html",
  "contentTier": "complete",
  "wordCount": 990,
  "tierReason": "Full review text"
}