{
  "showId": "other-desert-cities-2011",
  "outletId": "variety",
  "outlet": "Variety",
  "criticName": "Marilyn Stasio",
  "url": "https://variety.com/2011/legit/reviews/other-desert-cities-1117946577/",
  "publishDate": "November 3, 2011",
  "fullText": null,
  "isFullReview": true,
  "dtliExcerpt": "Jon Robin Baitz has written a smart, sophisticated family drama that crackles with wit and bristles with political tension.",
  "originalScore": null,
  "assignedScore": null,
  "source": "web-search",
  "dtliThumb": null,
  "dtliUrl": null,
  "bwwExcerpt": "Helmer Joe Mantello did a savvy job of recasting 'Other Desert Cities' for its Broadway transfer. When the show preemed at Lincoln Center earlier this year, it wasn't clear that Jon Robin Baitz's tightly wrapped family drama about a patrician clan of Old Guard California Republicans even had a leading character. That ensemble vibe survives in this production, but with the magnetic Rachel Griffiths ('Six Feet Under') now taking the lead in the part of the renegade daughter from New York, it's easier to overlook the artifices of the plot and surrender to the drama.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-OTHER-DESERT-CITIES-Updating-Live-20111103",
  "showScoreExcerpt": "Jon Robin Baitz has written a smart, sophisticated family drama that crackles with wit and bristles with political tension.",
  "contentTier": "excerpt",
  "contentTierReason": "Short text (19 words)",
  "textQuality": "partial",
  "bwwScore": 8,
  "sources": [
    "web-search",
    "bww-reviews",
    "bww-roundup"
  ],
  "textWordCount": 518,
  "archivePath": "data/archives/reviews/other-desert-cities-2011/variety--marilyn-stasio_2026-02-05.html",
  "textFetchedAt": "2026-02-05T03:42:25.471Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "No archive snapshot available"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "No CDX snapshots found"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "showNotMentioned": true,
  "wrongFullText": "A father and son tussle over whether to sell the family's mastiff in \"Old Dog,\" a spare but stealthily powerful tale set in contempo Tibet from local up-and-comer Pema Tseden.\n\nA father and son tussle over whether to sell the family’s mastiff in “Old Dog,” a spare but stealthily powerful tale set in contempo Tibet from local up-and-comer Pema Tseden. Flecked with Chekhovian melancholy but also welcome moments of humor, this skillfully lensed digital pic is a bit more critical of Chinese culture, in an oblique way, than Tseden’s previous two features (“The Silent Holy Stones,” “The Search”), but not so much as to impede its access to the international festival scene, where it’s picked up a few awards already. Whether it will ever open at home remains to be seen.\n\nRelated Stories \n \n\n \n \n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Bruno Mars' 'I Just Might' Becomes His First Song to Debut at No. 1 on Singles Chart \n \n \n\n \n \n \n \n \n\n \n\n \n\n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n Bruno Mars Named Record Store Day Ambassador for 2026; Sets Exclusive RSD Compilation LP, Plus Advance Listening Parties for New Album\n\nIn the mountainous Chinese region of Qinghai, which covers part of what used to be Tibet, a young man named Gonpo (Drolma Kyab) rides his motorcycle from his sheep farm to what passes for a town in this rural region, followed by his Tibetan mastiff, a breed of dog that looks like a fluffed-up cross between a German shepherd and a St. Bernard. Gonpo has heard that the breed has become highly prized in urban China, so much so that Gonpo decides to pre-empt any potential dog-napping by selling the hound to a shady dealer.\n\nAfterwards, he gets drunk on the proceeds and sobers up at home, where his elderly father, Akku (Lochey), is furious that he sold the dog, whom Akku raised from puppyhood. Akku rides back to the town on his horse and manages, after considerable negotiation, to retrieve the dog, with some help from his relative, a local cop (Chokyong Gyal).\n\nUnfortunately for the poor mutt, this isn’t the last time he’ll suffer separation anxiety, as he duly gets stolen in the night, and Akku must go in search of him again. Meanwhile, at home it becomes clear there’s tension brewing between Gonpo and his wife, who after three years of marriage still hasn’t managed to conceive.\n\nLensing by Sonthar Gyal, who recently helmed “The Sun-Beaten Path,” deliberately refrains from offering any closeups, so almost all the action unfolds at a distance from the camera, which creates a slightly stiff, theatrical feeling. That said, what the lensing loses in intimacy it gains in sweep and scope, so that the spectacular mountain landscape and the filthy, cruddy-looking township virtually become characters in their own right. Despite flashes of gentle, naturalistic humor, a sense of foreboding is pervasive; even so, the bleak last scene still comes as a shock.\n\nThesping from a mix of pro and non-pro thesps is fine, and the pacing is fairly sprightly given that so much of the pic consists of watching people walking, driving or riding horses within static frames. Other tech credits are functional without being outstanding in any way.",
  "_showNotMentionedDiscoveryAttempted": true
}
