{
  "showId": "our-mothers-brief-affair-2016",
  "outletId": "vulture",
  "outlet": "Vulture",
  "criticName": "Jesse Green",
  "url": "http://www.vulture.com/2016/01/theater-review-our-mothers-brief-affair.html",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "If the playwright Richard Greenberg didn't write the role for Linda Lavin, he might as well have, so perfectly does it suit and flatter her. It may in fact suit and flatter her too well; sometimes one would like to see Lavin clawing her way out of a role instead of slipping so smoothly into it. Here, she wears Anna as fetchingly as Anna wears the perfectly cut Burberry trench coat she imbues with talismanic powers of mysterious romance. It is just such a romance that forms the central (and reall",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-OUR-MOTHERS-BRIEF-AFFAIR-Opens-on-Broadway-Updating-LIVE-20160120",
  "contentTier": "complete",
  "fullText": "Things you buy through our links may earn Vox Media a commission.\n\nPhoto: Joan Marcus\n \n \n \n Anna Cantor, the title character of Our Mother’s Brief Affair, is a suburban matron, a passive-aggressive parent, and, even in the throes of semi-dementia, a genius with a barb. (As long as he’s celibate anyway, she asks her gay son, “Would it kill you to not sleep with a woman?”) If the playwright Richard Greenberg didn’t write the role for Linda Lavin, he might as well have, so perfectly does it suit and flatter her. It may in fact suit and flatter her too well; sometimes one would like to see Lavin clawing her way out of a role instead of slipping so smoothly into it. Here, she wears Anna as fetchingly as Anna wears the perfectly cut Burberry trench coat she imbues with talismanic powers of mysterious romance. It is just such a romance that forms the central (and really the only) plot of this entertaining but threadbare play, staged for Manhattan Theatre Club by its longtime artistic director, Lynne Meadow. Really, the title tells you all you need to know: Anna, in the hospital for one of her many near-death theatricals, reveals to her adult twin children the story of, well —\n\nBut I can’t say. And neither, until just before the first-act curtain, can Greenberg.\n\nUntil then, what we get in Anna, and in Our Mother’s Brief Affair, is a kind of Long Island Scheherazade, throwing out beguiling hints and charming stories but keeping the big one in reserve so she may live another day. To fill the time, the kids — that gay son, Seth, and his gayish sister, Abby — set the scenes like maids in a flouncy French comedy, preparing the way for and accoutering the presentation of the great lady with baroque flourishes. (“If the photograph is the orgasm of the pose,” says Seth, “you were always ready but underserved.”) Unfortunately, aside from their unlikely speaking style, the kids are of absolutely no independent interest, despite stalwart attempts by the accomplished actors Greg Keller and Kate Arrington to fill in their contours; they’re like buckets with holes. Lavin swamps them (as, we are meant to understand, Anna swamped her children) the moment she opens her fascinating mouth.\n\nUnfair as that is, it is nevertheless a relief when she interrupts their constant narration and annotation to tell the story of the romance itself. It began, she explains (and then demonstrates by dropping 30 years and walking into her memory), with a chance meeting on a bench in a vest-pocket Manhattan park in October 1973, while Seth was enduring a viola lesson at Juilliard. (The viola, Anna vaguely recalls, is “like the violin only nobody cares about it.”) Greenberg gives Lavin plenty of chewy material to work with as Anna’s affair with a man named Phil Weintraub picks up steam: the hesitant dance of adultery, the surprisingly pleasurable memory of guilt and deception, the social history that made it all plausible and excusable. As well done as this is, you quickly begin to sense its insubstantiality; withholding the big news as long as possible, Greenberg provides more detour than road.\n\nIf the eventual revelation is a kind of defibrillating shock, it is not a boon. Not only does the play stop cold to absorb the information (and explain it for those whose cultural literacy does not reach back to the 1950s) but, when we return after intermission, we find that the change has basically undone all of Lavin’s earlier work establishing Anna’s character. (Either the affair is now incredible, or she is.) Watching the affair proceed in this new light becomes extremely uncomfortable, as if that flouncy French comedy turned out to be set in Hitler’s bunker; our innate drive toward romance, which would make us happy to see Anna find happiness with anyone, is tested by an outlier instance of who that anyone could be. Perhaps this discomfort is what Greenberg intended: a test of our willingness to humanize monsters. But despite John Procaccino’s suave performance as Phil, the test never really takes place; the character is yanked so far out of the play that he loses any place within it. You gradually realize that he was only there in the first place to give weight — negative weight — to Anna, who was otherwise a lovely sketch but lacking in drama. The play doesn’t humanize the monster but instead uses him to monstrify the human.\n\nFor me that raises a question of taste: Though playwrights must have carte blanche to introduce even the most unpleasant realities into their work, the more unpleasant the reality the more convincingly the work must earn it. In this case the moral balance fails, making Our Mother’s Brief Affair seem uncharacteristically cheap or desperate, a way of cribbing drama from an impeccable source — history — instead of growing it natively. Greenberg seems to sense this, or at least his characters do, because he and they spend the rest of the play scrambling to absorb the blow by making excuses where possible and, where not, trying to top it with a secondary secret. (That one fizzles.) If in Act One Seth and Abby were servants to exposition, now they get to clean up the dramaturgical mess. Perhaps, they even suggest, Anna’s lover was just a delusion after all. Well that’s not very satisfying! More than that, it’s glib: a denouement available within the world of the play but not, unfortunately, outside it.\n\nIf I had to guess, I’d say that Greenberg got trapped (much as Anna does) by what must have felt like a daring idea. That’s an occupational hazard for playwrights, especially very smart ones. Unfortunately, there’s almost no way to tell ahead of time when one of those daring ideas will pay off and when it will break the bank. Greenberg’s The Assembled Parties, which MTC produced (and Lynne Meadow directed) in 2013, was one of the best new Broadway plays of that year, as Take Me Out had been in 2003. Both told “hot” stories in cool ways. But in between came such disappointments for Greenberg as A Naked Girl on the Appian Way and his stage adaptation of Breakfast at Tiffany’s, both of which were more ordinary in conception. Even if you could discern a rule in such a track record, a classy production like this one — kudos especially to costume designer Tom Broecker for the trench coat — may bury the evidence. What’s a playwright to do?\n\nUltimately, productivity and loyalty are the best editors. (Our Mother’s Brief Affair is MTC’s eleventh production of a Greenberg play.) In the short run, though, if you’re going to misfire, you might as well let Lavin pull the trigger. She’ll hit something.\n\nOur Mother’s Brief Affair is at the Samuel J. Friedman Theatre through March 6.\n\nShow \n \n \n Comment\n \n\n Theater Review: Our Mother’s Brief Affair\n\n \n \n \n \n\n \n \n \n \n \n\n \n \n\n \n \n \n\n \n Your product is saved! You’ll receive emails when your saved products go on sale. Manage preferences.\n \n \n\n \n \n\n \n \n\n Things you buy through our links may earn Vox Media a commission.",
  "isFullReview": true,
  "textWordCount": 1182,
  "archivePath": "data/archives/reviews/our-mothers-brief-affair-2016/vulture--jesse-green_2026-02-06.html",
  "textFetchedAt": "2026-02-06T08:53:32.937Z",
  "fetchMethod": "brightdata",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": false,
      "error": "timeout of 60000ms exceeded"
    },
    {
      "tier": 0.5,
      "method": "archive",
      "success": false,
      "error": "timeout of 15000ms exceeded"
    },
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.waitForTimeout: Target page, context or browser has been closed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "Parse Error: Header overflow"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": true
    }
  ],
  "fetchTier": 3,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "brightdata",
  "wordCount": 1182,
  "tierReason": "Full review text"
}