{
  "showId": "august-osage-county-2007",
  "outletId": "fox-news",
  "outlet": "Fox News",
  "criticName": "Unknown",
  "url": "http://www.foxnews.com/entertainment/2013/12/24/august-osage-county-review-dark-drama-is-must-see/",
  "playbillVerdictUrl": "http://www.foxnews.com/entertainment/2013/12/24/august-osage-county-review-dark-drama-is-must-see/",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "This publicity image released by The Weinstein Company shows, from left, Julianne Nicholson, Meryl Streep and Margo Martindale in a scene from \"August: Osage County.\" (AP2012)\n\nMeryl Streep and Julia Roberts amaze alongside this year’s best ensemble cast in a scintillating familial cock fight. Tracy Letts’ adaptation of his Pulitzer Prize-winning play, “August: Osage County” is catnip for actors and raises dysfunction to a whole new level. Addicted to pills and booze and ruling with an iron fist, matriarch Violet Weston (Streep) has driven her entire family away except her timid daughter Ivy (Julianne Nicholson). But when the Weston patriarch (Sam Shepard) disappears, the family returns to roost, including distant daughter Barbara (Roberts) and her family (Ewan McGregor and Abigail Breslin), free-spirited Karen (Juliette Lewis) and her fiancé (Dermot Mulroney), as well as Violet’s vivacious sister Mattie Fae (Margo Martindale), her reasonable husband (Chris Cooper) and their despondent son (Benedict Cumberbatch). Equally stubborn and angry, Barbara and Violet go head to head slinging insults and blame, igniting their own self-destruction and setting off a chain reaction that brings every member of the extended family to their knees. Every character in Letts’ fictional dysfunctional family is smartly crafted, each with their own dilemma that in some way impact everyone else. Letts has created so much emotional flying debris in one house that keeping each character’s issues and relationships in order is a feat in itself. “August” is sharply written with jaw-dropping twists, incredible emotional resonance and brilliant dialogue charged with scathing insults. The brilliance of Letts’ story is that beneath all the cruelty, one can still sense the everlasting familial bond among the Weston family. They may hate each other. They may say and do the cruelest of things to each other, but in the end they are still family and the cast does an incredible job letting that permeate. It is often difficult to transform a stage play into a film and keep the integrity of the original while adapting to a more cinematic scope, but writer-director John Wells and editor Stephen Mirrione have done a fine job with the adaptation. Each scene ignites like gunpowder and naturally flows from one family crisis to the next. Wells gets the most from his performers, especially during a lengthy chaotic dinner scene which gives ample time for every actor to really shine. This scene in particular is sensational and the slow build to frenzy is astonishing -- a perfect marriage of acting and writing. Not only does “August” feature a spectacular ensemble cast, but it also has some of the strongest roles for women in an otherwise average year. Obviously Meryl Streep is sublime, but the more transformative she becomes with each role the less subtle she is. Like Johnny Depp, she can be a chameleon – an actor who can do just about anything, but like Depp runs the risk of caricature, which here Streep teeters on the edge. But there is rawness to Streep’s Violet Weston which the Oscar-winning actress has rarely exceeded. As Violet Weston, she’s both cruel and pathetic, a nuanced performance that just may very well be her greatest. Julia Roberts is at her best since her Oscar-winning “Erin Brockovich.” Barbara is at the end of her rope. She can’t take her mother’s drama any longer nor can she put up with the failed marriage to her “academic” husband Bill. Roberts is sensational as she tries to stay composed in a world crumbling around her. There’s grit and feistiness to Roberts as Barbara spirals down the crazy spectrum to meet Violet in the middle. It’s a powerful performance and perfectly suited to Julia Roberts. Julianne Nicholson, Juliette Lewis and Margo Martindale are outstanding. Martindale, especially, delivers one of the most surprising performances in the film, starting as one of the few sources of humor before side-stepping into a fantastic dramatic turn. Martindale has always been one of film and television’s great character actors and she is in good company with Streep and Roberts. The rest of the performances are just as notable. Chris Cooper is marvelous as he squares off against Martindale. The two performances feed each other and form a dynamic acting couple. Benedict Cumberbatch continues his 2013 highlight reel as a fragile and timid man longing for acceptance and happiness. This year has proven that he can pretty much do anything. Ewan McGregor and Dermot Mulroney are minor compared to the rest of the cast, but nicely round out the ensemble. Everyone rubbernecks at an accident hoping to get a quick peek at the wreckage, and that’s exactly what Tracy Letts’ “August: Osage County” preys on. This is dark, deliciously entertaining drama that will make you thankful you’re not a member of this Weston family. A must-see! The Weinstein Company. MPAA Rating: R. Running time: 2 hours and 10 minutes.\n\nWhat's wrong with Ashley Olsen?",
  "isFullReview": true,
  "textWordCount": 810,
  "archivePath": "data/archives/reviews/august-osage-county-2007/fox-news--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:11:29.413Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "404 - Page not found"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20150517004613",
  "archiveOrgUrl": "http://web.archive.org/web/20150517004613/http://www.foxnews.com:80/entertainment/2013/12/24/august-osage-county-review-dark-drama-is-must-see/?",
  "contentTier": "complete",
  "wordCount": 810,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "wrongProductionNote": "Auto-flagged: URL year 2013 outside valid range 2004–2010 for show opening 2007"
}