{
  "showId": "august-osage-county-2007",
  "outletId": "guardian",
  "outlet": "The Guardian",
  "criticName": "Unknown",
  "url": "http://www.theguardian.com/film/2013/sep/10/august-osage-county-review-toronto",
  "playbillVerdictUrl": "http://www.theguardian.com/film/2013/sep/10/august-osage-county-review-toronto",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "Three daughters and a funeral … Meryl Streep and Julia Roberts in August: Osage CountyThree daughters and a funeral … Meryl Streep and Julia Roberts in August: Osage County This article is more than 12 years oldReviewAugust: Osage County: Toronto 2013 - first look reviewThis article is more than 12 years oldMeryl Streep claws the walls well, but the trappings of theatre hobble this movie version of Tracy Letts' award-winning playThe auguries for August were good. Tracy Letts' play about a pill-popping, bile-spewing, scenery-guzzling matriarch, whose daughters try to pick up the pieces after her poet husband's suicide, won him a Pulitzer prize to stick with the Tony, plus prodigious other theatrical bling. The pedigree of this film version - backed by not just the Weinsteins but super-producers George Clooney and Grant Heslov - suggested he'd soon be adding some Oscars to the shelf.\n\nBut there's a big gap between pitch and victory, and John Wells's film comes a cropper on the prairie. We're in Oklahoma - flagged by sun-bleached landscapes static enough they might as well be painted on sheets and winched backstage by someone's mum. Violet (Meryl Streep), staggers into the study of her husband, Beverly (Sam Shepard), tripping on prescription drugs and the side effects of mouth cancer chemo, cackling with the unchained glee of the genuinely venomous. The question is not why Beverly killed himself but why it took so long.\n\nOnce he's gone, their trio of daughters flock round to try and force-feed cold turkey and humble pie. Barbara (Julia Roberts, pinched and grungy), comes with unhappy husband Bill (Ewan McGregor) and weed-puffing daughter Jean (Abigail Breslin), while Karen (Juliette Lewis) rocks up with her latest dodgy fiancé, Steve (Dermot Mulroney). Ivy (Julianne Nicholson) has the least far to travel, and the most justified resentment to unleash. Vi's sister Mattie Fae (Margo Martindale) is on hand, too, plus her husband Charles (Chris Cooper), and, after a time, their son, little Charles (Benedict Cumberbatch). The family stew boils over at a post-funeral lunch in which Violet goes full diva, ripping strips off the whole pack, sparing no prisoners beneath Al Pacino fright wig, choking the air with 65 years of unfiltered nihilism.\n\nIt's bracing, but it does feel closer to panto than melodrama, more exhausting than illuminating. Violet is a queen bitch with only the tiniest of chinks, a hybrid of Streep's imperious Thatcher, Kristin Scott Thomas in Only God Forgives and, in cuddlier moments, Ricky Tomlinson in The Royle Family. Yet for all the sparks, the character can't quite catch fire in these conditions. Such southern fried frankness might thrill those in the theatre but at the cinema we eat this sort of thing for breakfast.\n\nLetts' plays have been shot before: Bug and Killer Joe were slices of trailer trash ham, which succeeded because their mise en scene (a hotel room, a kitchen/diner) were pointfully claustrophobic. The Weston home is a hulking halfway house, and you can't help but wish you were just watching a filmed version of the original production.\n\nWells is respectful to a fault, retaining lines that feel redundant (lots about how hot it is), and doffing his cap to keynote dialogue. Where William Friedkin was enough of his own man to launch Letts' work with a smashed bottle and a bit of fanfare, Wells sacrifices flair to fidelity. Letts is one of the most formidable talents around today, but in handling his screenplay with such kid gloves, Wells puts a passenger in the driver's seat. The results are far from a car crash, but they do smack of the rubberneck, in which grande dames get down and dirty and we gawp politely from the stalls. Sometimes the theatre and the movie house seem very far apart.\n\nAt any point, you can opt out of the sale of all of your personal information by pressing",
  "isFullReview": true,
  "textWordCount": 644,
  "archivePath": "data/archives/reviews/august-osage-county-2007/guardian--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:11:43.758Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "contentTier": "complete",
  "wordCount": 644,
  "tierReason": "Full review text",
  "unflaggedNote": "Previously flagged: Auto-flagged: URL year 2013 outside valid range 2004–2010 for show opening 2007"
}