{
  "showId": "august-osage-county-2007",
  "outletId": "nydailynews",
  "outlet": "New York Daily News",
  "criticName": "Unknown",
  "url": "http://www.nydailynews.com/entertainment/tv-movies/august-osage-county-movie-review-article-1.1557873",
  "playbillVerdictUrl": "http://www.nydailynews.com/entertainment/tv-movies/august-osage-county-movie-review-article-1.1557873",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict"
  ],
  "fullText": "ExpandMeryl Streep and Julia Roberts get in each other's hair in ‘August: Osage County.’\n\nJohn Wells' over-the-top adaptation of Tracy Letts' Pulitzer-winning play is this season's cinematic fruitcake: a dense ode to excess.\n\nIf you embrace the overkill, you'll enjoy it. But if extravagance isn't your thing, move swiftly on to something lighter and more digestible.\n\nWells does little to expand the play's stagebound feel, but he does encourage his cast to reach for the rafters. Meryl Streep is given particularly free rein as Violet, the maddening matriarch of the Weston clan. Suffering from cancer and drug addiction, she calls her girls home to Oklahoma after their father (Sam Shepard) disappears.\n\nThe eldest, Barb (Julia Roberts), arrives with her estranged husband (Ewan McGregor) and moody teen daughter (Abigail Breslin), both of whom are equally unhappy about the trip.\n\nBenedict Cumberbatch and Julianne Nicholson in ‘August: Osage County’\n\nIvy (Julianne Nicholson) is the more placid middle daughter, though she resents the assumption that she'll always put family first and her own needs last. And Karen (Juliette Lewis), the youngest, is constantly trying to curry her fierce mother's hard-won favor.\n\nOver the next few days, Violet eviscerates each of her relatives in turn. Some, like Karen, accept the anger as their due. Others, particularly the aptly named Barb, embrace the opportunity to fight back.\n\nLetts adapted the film himself, and the knife-sharp screenplay, packed tightly with petty put-downs and witty retorts, is terrific. Wells has a fairly firm grasp on the action, but he's ceded far too much authority to his stars. The movie's pedigree might suggest arthouse prestige, but the histrionics are so loud it feels more like a 1950s melodrama.\n\nAn ‘Osage County’ sit-down, from left: Julianne Nicholson, Juliette Lewis, Dermot Mulroney, Benedict Cumberbatch, Chris Cooper, Ewan McGregor, Abigail Breslin, Julia Roberts and Margo Martindale\n\nBenedict Cumberbatch is painfully miscast as Violet's dim nephew, but Margo Martindale and Chris Cooper offset the soapiness with some welcome moderation as her practical sister and brother-in-law.\n\nAs for the leads, it seems all too evident that both Streep and Roberts were hoping to reap Oscar glory. And we see, in their unrestrained performances, the dangers of putting the rewards before the role.\n\nStill, with actors of this caliber, even overemoting can entertain. Having decided to go all-in, Streep is deliriously monstrous, and Roberts makes a suitably furious foil. Nicholson brings some crucial calm, and Lewis finds the bruises that cause her on-screen mom's nastiness.\n\nFrom left, Julianne Nicholson, Meryl Streep and Margo Martindale in ‘August: Osage County’\n\nIt's easy enough to relate to all three sisters for wanting to get the hell out of Vi's claustrophobic house. (Kudos to set decorator Nancy Haigh for the lived-in realism.) There's ample reward in watching so much talent chewing so much scenery.\n\nAnd to be sure, there won't be many other opportunities to see Roberts throwing plates around a dinner table while shouting, \"Eat the fish, bitch!\"\n\nSo if you have a taste for the decadent, sit back, settle in and appreciate the insanity of it all.",
  "isFullReview": true,
  "textWordCount": 511,
  "archivePath": "data/archives/reviews/august-osage-county-2007/nydailynews--unknown_2026-02-04.html",
  "textFetchedAt": "2026-02-04T02:11:47.061Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20220928132607",
  "archiveOrgUrl": "http://web.archive.org/web/20220928132607/https://www.nydailynews.com/entertainment/tv-movies/august-osage-county-movie-review-article-1.1557873",
  "contentTier": "complete",
  "wordCount": 511,
  "tierReason": "Full review text",
  "wrongShow": true,
  "rejectedAt": "2026-02-04T05:20:29.405Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_show",
  "rejectionReasoning": "claude: This is a film review of the movie adaptation of 'August: Osage County', not a Broadway theater review; openai: The text is a review of the film adaptation of 'August: Osage County,' not a Broadway production.; gemini: This is a review of the film 'August: Osage County', not a Broadway show.; kimi: This is a review of the 2013 film adaptation directed by John Wells, not the Broadway production. The text explicitly references cinematic elements ('cinematic fruitcake,' 'movie's pedigree,' 'Oscar glory'), the film's cast (Meryl Streep, Julia Roberts), and the screen adaptation process.",
  "promptVersion": "5.2.0"
}
