{
  "showId": "travesties-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "Jesse Oxfeld",
  "url": "https://nystagereview.com/2018/04/24/travesties-tom-stoppard-roundabout/",
  "publishDate": "2018-04-24T20:00:53",
  "fullText": "The great good news is that the Travesties that opened tonight at the American Airlines Theatre is in neither context a travesty. Or, at least, we are supposed to think it is one only in the latter sense — except that I’d argue there is nothing inappropriate about its gleefully goofy style.\n\nTravesties is an early Stoppard play, originally staged here in 1975, when it won the Tony Award for Best Play. It is my favorite kind of Stoppard: Erudite, allusive, and grappling deeply with history, but also fun, funny, and compulsively entertaining.\n\nIt springs from historical coincidence: V.I. Lenin, James Joyce, and Tristan Tzara, who helped found Dadaism, were all in Zurich at more or less the same time, waiting out the First World War in neutral Switzerland. So was Henry Wilfred Carr, a minor diplomat in the English consular service, who — and this is true — starred in a production of The Importance of Being Earnest that Joyce staged among the British expats in Zurich.\n\nCarr becomes the quasi-narrator of Stoppard’s appropriately ridiculous vaudeville, and as he spends long set pieces with each of these three men who seek to change the world — in politics, literature, and art — the playwright guides us through a debate about the role of the artist in war and revolution. Because it’s framed as an elderly Carr looking back, he is an unreliable narrator — “constant digression being the saving grace of senile reminiscence,” he says in a transfixing early monolgue — and his story is impressionist, twisting and turning and mixed and matched, arguable Dadaist.\n\nTom Hollander plays Carr, and he’s a virtuoso in a complicated part, shifting among styles and bouncing around the stage. There are songs and dances, long speeches, occasional rhyming couplets. The whole thing borrows from Earnest, including two love interests named Cecily and Gwendolyn. Stoppard’s genius, especially in his earlier work, is to mix high intellect with low comedy, and Travesties manages to be both deeply thoughtful and guffawingly funny. I don’t want to spoil the punchline, but you’ll be surprised at how much you laugh at a long-payoff dumb joke about a library only learning things in alphabetical order.\n\nDirector Patrick Marber keeps this joyful folly happily afloat, and the set by Tim Hatley (who also did the costumes) seems almost a perfect visual representation of Stoppardism: We’re in a library-cum-drawing room inside Carr’s head, an old-Europe repository of wood panelling and books everywhere. Hollander is the standout but the cast is uniformly fine, especially Patrick Kerr as Carr’s secretly Socialist manservant, Bennett.\n\n“To lose one revolution may be regarded as misfortune; to lose two looks like carelessness,” Stoppard has Lenin say, Wilde-ishly, as he leaves Zurich to return to Petersburg after the fall of the czar. Here, two playwrights is rather no misfortune at all.\n\nTravesties opened April 24, 2018, at the American Airlines Theatre and runs through June 17. Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "4/5 stars",
  "textQuality": "partial",
  "contentTier": "stub",
  "tierReason": "No text content",
  "wordCount": 0
}
