{
  "showId": "travesties-2018",
  "outletId": "nysr",
  "outlet": "New York Stage Review",
  "criticName": "David Finkle",
  "url": "https://nystagereview.com/2018/04/24/travesties-tom-stoppards-brilliant-comedy-brilliantly-revived/",
  "publishDate": "2018-04-24T20:00:41",
  "fullText": "If you’re looking for an example of theatrical brilliance made tangible, here’s what you do. You get yourself to the revival of Tom Stoppard’s Travesties, just imported—and not a moment too soon—from London’s Menier Chocolate Factory, where it was acclaimed and subsequently became a West End hit.\n\nSo get there fast, and when you do, be prepared to listen fast. That’s because Stoppard has long had a reputation for being verbally hilarious, and of his works the 1976 Tony-Award-winning Travesties may be the funniest. That’s as a certain kind of heady comedy. It may be not only the funniest but also the smartest anyone anywhere has ever quilled.\n\nWhich immediately requires a buyer-beware aviso: Getting the most out of Stoppard’s propulsive wordplay requires a good education or the accomplishments of a first-rate autodidact. We all know there’s such a thing as sophomore humor. Travesties isn’t that. It’s graduate school-Ph.D-level humor, delivered by a man for whom English is a second language he’s mastered as have before him Joseph Conrad and Vladimir Nabokov.\n\nIn getting ready for possibly the only perfect production now occupying a Broadway theater, potential theatergoers might want to ask themselves a few preparatory questions. Are they familiar with Oscar Wilde’s perfect comedy, The Importance of Being Earnest? Would they recognize a parody of the signature song delivered for many vaudeville years by Ed Gallagher and Al Shean? How do they feel about Dada not as a child’s first word but as a response to, and outgrowth of, the Cubist and Futurist art movements? Are they up on James Joyce’s Ulysses and the Irish author’s love of limericks. Where do they stand on their Francois de la Rochefoucauld aphorisms? Might they twig to the connection between the Marquis of Queensbury and Stoppard’s neologism “Gommorist”?\n\nGranted, it may be that quick-witted patrons will simply go along with Stoppard’s blizzard of allusions and references whether they get them or not. They may be able to have a high old time with the (more or less) plot he’s produced. It‘s ingenious, not to say genius.\n\nOne lucky day, it occurred to Stoppard that in 1917 James Joyce, Vladimir Ilyich Lenin, and Tristan Tzara of Dada fame were all in Zurich. Having realized that, the clever Stoppard imagined what it might have been like had they all known each other. Then he concocted Henry Carr (Tom Hollander), a Brit who’d been in the Great War trenches but, due to a wound, had been invalided out and taken up residence in Zurich as a consul. Or maybe not as a consul.\n\nStoppard imagines Henry as a stooped man 50 years on looking back at—and traveling back to—those days and remember/reliving the days when Joyce (Peter McDonald). Lenin (Dan Butler), and Tzara (Seth Numrich) dropped by to report on their self-important doings. Not only that but rambling on about the wages of war and, more pressingly, what constitutes genuine art—Art with a capital “A.”\n\nOften they’re in company with Carr’s opinionated butler Bennett (Patrick Kerr), Lenin’s wife Nadya (Opal Alladin), librarian Cecily (Sara Topham), and/or Gwendolen (Scarlett Strallen). By the way, anyone who recognizes Cecily and Gwendolen as being the same names as the ingenues in Wilde’s The Importance of Being Earnest is already showing signs of having the devil’s own time at Travesties.\n\nAs the famous figures burst in—sometimes not through real doors—it starts to look as if the rollicking proceedings might be in Carr’s 1967 head. Often robed and donning a worn-out boater, he gregariously reminisces about his colorful past. Just as often he’s standing up straight, in sporty 1917 outfits, including a now pristine boater.\n\nAt all of this, Hollander—only seen once before on a Manhattan stage (David Hare’s 1998 The Judas Kiss)—has the cocky, twinkling confidence of master storyteller. A shortish fellow with the energy of a long-distance runner, he’s the now bent, now erect backbone of the gadabout opus.\n\nOn Tim Hatley’s capacious dark wood set, in Hatley’s snappy period costume and wrapped in Neil Austin’s lighting, rapscallion Hollander is directed by Patrick Marber, who never lets up on the comic drive. As Tzara, Numrich inhabits the most flamboyant role, but all the others, each given at least one solid opportunity to shine, do so. This is an outstanding ensemble.\n\nGetting back to the seemingly innumerable script outbursts about what art is: Stoppard does something cute and gets away with it. While repeatedly defining what constitutes art this way and that, he’s spoofing pretentious people who need to carry on about it. At the same time he gets those definitions aired.\n\nWhat pertains here, however, is: No matter by what definition of art you swear, this Travesties—thanks to Stoppard, Hollander, Marber, and everyone connected to it—is that rare thing: Art with a capital “A.”\n\nTravesties opened April 24, 2018, at the American Airlines Theatre and runs through June 17.  Tickets and information: roundabouttheatre.org",
  "isFullReview": true,
  "source": "nysr-api",
  "sources": [
    "nysr-api"
  ],
  "originalScore": "5/5 stars"
}
