{
  "showId": "groundhog-day-2017",
  "outletId": "newsday",
  "outlet": "Newsday (Linda Winer)",
  "criticName": "Linda Winer",
  "url": "http://www.newsday.com/entertainment/theater/groundhog-day-review-andy-karl-s-injury-shadows-terrific-musical-1.13476956",
  "playbillVerdictUrl": "http://www.newsday.com/entertainment/theater/groundhog-day-review-andy-karl-s-injury-shadows-terrific-musical-1.13476956",
  "source": "playbill-verdict",
  "sources": [
    "playbill-verdict",
    "bww-reviews"
  ],
  "fullText": "It looks like there is no Newsday subscription account associated with this login information.\n\nIf you used an Optimum login, click the Connect Account button to use your Optimum login info to manage your Newsday subscription account.\n\nUpdated April 17, 2017 9:00 PM\n By Linda Winer linda.winer@newsday.com\n\nadvertisement | advertise on newsday\n\nWHERE August Wilson Theatre, 245 W. 52nd St.\n\nINFO $69.50-$159; 877-250-2929; groundhogdaymusical.com\n\nBOTTOM LINE Terrific musical endangered by star’s injury.\n\nI saw Andy Karl in “Groundhog Day” on Thursday, and he was terrific. So, in fact, was the show, an ingenious, witty, dark yet joyously offbeat musical about Phil Connors, a snotty big-city TV weatherman forced to relive the same day, over and over in boring small-town Punxsutawney, Pennsylvania, until, just maybe, he gets it right.\n\nAnd on Thursday, Karl got it very right. That included the easygoing command of demanding songs, not to mention the stopwatch physical comedy and boisterous dancing, all the while creating a complicated egomaniac who, miraculously, didn’t make me yearn for Bill Murray’s beloved deadpan portrayal in the 1993 movie.\n\nadvertisement | advertise on newsday\n\nAs you may have heard, however, Karl injured his knee during Friday’s performance in what he later described as a “poorly landed leapfrog.” His understudy, Andrew Call, went on Saturday night and, as of Monday afternoon, Karl was expected be onstage at Monday night’s opening in what was destined to be a star-making performance.\n\nBut on with the show, or at least the review. The musical, which just won Olivier Awards (London’s Tony) for best new musical and for best actor (Karl) in a musical, is no carbon copy of the film. With the screenwriter Danny Rubin guarding his unsentimental redemption story as book writer, however, Phil’s surreal journey goes believably from freak-out to incredulity, hedonistic jollity, murderous sadism, suicidal depression and god-complex grandiosity. The creative team that deftly balanced the nasty with the comic in “Matilda” finds at least as much special chemistry in this surreal challenge, a romantic comedy and life lesson that, in the words of one of the characters, “messes with the space-time continuum.” Tim Minchin’s music beguiles with odd phrase lengths and wildly unpredictable, amusing lyrics, while director Matthew Warchus and his first-rate cast take us through the day and its many conflations with a light touch that belies the head-spinning concept and scenic intricacy.\n\nDespite adorably absurd birds-eye car chases and high-tech mechanics (that got temporarily stuck Thursday), the sets and costumes by Rob Howell have the delicate feel of miniatures. The stage is lined with little houses with lights in the windows and more stuck akimbo on the roofs of buildings. The townsfolk include a man in a groundhog suit and various cheerful people we are expected, at first, to find obnoxiously bland.\n\nBarrett Doss, as Phil’s assistant producer, sparingly uses her impressive high wail and has a lovely lack of ingenue coyness. I was going to complain bitterly about a mood-smashing, irrelevant song for an actress who laments being cast for her beauty. Considering Karl’s accident and potential trouble ahead for the show, I’m going to let that pass.\n\nGet the latest on celebs, TV and more.\n\nNewsday.com now uses Facebook for our comment boards. Please read our guidelines and connect your Facebook account to comment.",
  "isFullReview": true,
  "textWordCount": 546,
  "archivePath": "data/archives/reviews/groundhog-day-2017/newsday--linda-winer_2026-02-04.html",
  "textFetchedAt": "2026-02-04T03:20:42.432Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Skipped (known-blocked site)"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Insufficient text: 183 chars"
    },
    {
      "tier": 3.5,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20170420193455",
  "archiveOrgUrl": "http://web.archive.org/web/20170420193455/http://www.newsday.com:80/entertainment/theater/groundhog-day-review-andy-karl-s-injury-shadows-terrific-musical-1.13476956",
  "contentTier": "complete",
  "wordCount": 546,
  "tierReason": "Full review text",
  "bwwExcerpt": "The creative team that deftly balanced the nasty with the comic in 'Matilda' finds at least as much special chemistry in this surreal challenge, a romantic comedy and life lesson that, in the words of one of the characters, 'messes with the space-time continuum.' Tim Minchin's music beguiles with odd phrase lengths and wildly unpredictable, amusing lyrics, while director Matthew Warchus and his first-rate cast take us through the day and its many conflations with a light touch that belies the head-spinning concept and scenic intricacy.",
  "bwwScore": 8
}
