{
  "showId": "how-to-dance-in-ohio-2023",
  "outletId": "deadline-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "https://deadline.com/2023/12/how-to-dance-in-ohio-review-broadway-1235658895/",
  "publishDate": null,
  "fullText": "Not since the perfect (what other word is there?) Kimberly Akimbo first made us laugh and bent our hearts two years ago has a stageful of youthful characters so inspired our best, heartfelt wishes as those learning how to dance in Ohio in the new musical of that very name. Based on the affecting, same-titled 2015 HBO documentary, the new Broadway musical How To Dance In Ohio, opening tonight at the Belasco Theatre, is chock-full of thoroughly endearing young people &#8211; the fictional ones and their portrayers &#8211; that have us rooting for them from start to finish.\n\nFrom the opening, pre-plot moment when the cast of seven young (mostly 20s) autistic persons takes the stage to directly introduce themselves and establish some background (&#8220;There&#8217;s a saying, &#8216;If you've met one autistic person&hellip; you've met one autistic person,\" says actor Conor Tague. &#8220;You are now meeting seven autistic people.&#8221;), their enthusiasm has our hearts. When they slip into their characters seconds later, their charming performances seal the deal: We want this show to soar.\n\nThat it doesn&#8217;t is a disappointment softened only by the experience of seeing a group of Broadway newcomers get so thrillingly close to something like flight, and suspecting that this won&#8217;t be the last time they&#8217;ll have the opportunity.\n\n\n\n\t\t\t\n\t\t\tWatch on Deadline\n\nInspired by Alexandra Shiva's Peabody Award-winning 2015 HBO documentary of the same name, How To Dance In Ohio employs stage musical convention &#8211; the book and lyrics are by Rebekah Greer Melocik, music by Jacob Yandura, choreography by Mayte Natalio and direction by Sammi Cannold, all making their Broadway debuts &#8211; to present a groundbreaking concept: A slate of characters with autism portrayed by a cast of actors with autism.\n\nBased on actual events, How To Dance In Ohio tells the story of a support group of and for autistic young adults in Columbus, Ohio (the city is never actually specified, but references to a college rivalry with Michigan gives it away). As in real life, the group is run by the kindly and supportive Dr. Amigo &#8211; sometimes the world hands dramatists little gifts &#8211; and the goal is to help the teens and twentysomethings take the next steps in their journeys toward independence and social engagement.\n\nWith some of what Amigo calls his clients making college plans, the doctor has an idea: Why not turn these next steps into dance steps? Sensing that the word &#8220;prom&#8221; comes too fully loaded with expectation, he simply proposes to the young people that the group should plan a spring formal to celebrate a year-end milestone.\n\nEven with the euphemistic name, the prospect of a dance engenders considerable anxiety for these young people who have never found the words to ask for a date, who have never coordinated their feet into anything resembling so much as a two-step, and who, as Tague&#8217;s Tommy says in a tone approaching panic, will require a shirt with a collar. Just the thought of a collared shirt causes Tommy stress, and he wonders if the dance is meant as a punishment. &#8220;Because it feels like a punishment,&#8221; he says accusingly.\n\nLater, Tommy sings, &#8220;Having flashbacks to the second grade/My meltdown at the Harvest Party/Screaming in the bouncy castle/Each time it bounced.&#8221;\n\nBut as the weeks and months progress, each, if not quite all, of the clients get into the spirit of the project, and do indeed make the sort of sociability adjustments that Dr. Amigo had in mind. They&#8217;re working together, enjoying one another&#8217;s company more, even developing crushes as they secretly pine over potential dates, even as they bristle at what one calls, and all agree, are the heteronormative remnants of Amigo&#8217;s quaint, outdated worldview.\n\nThat&#8217;s a telling moment, by the way. One of the things How To Dance In Ohio gets so splendidly right is the easy comfort with diversity these young people with autism are graced, as if they&#8217;ve long ago made peace with the very concept of outsiderdom. That&#8217;s something even the nice guy Dr. Amigo has to work to achieve.\n\nGiving voice to that diversity is one of the real treats of How To Dance. I don&#8217;t know whether the characters were fine-tuned to match the actors&#8217; personalities, but it wouldn&#8217;t surprise me given how thoroughly and compassionately these young Broadway newcomers inhabit their roles. I&#8217;ve already mentioned Tague, whose Tommy, the good-natured Buckeyes fan who dreams, like so many young men, of getting his drivers license; Mel (Imani Russell), who works at a pet store, reads self-help books, uses they/them pronounces and wants nothing more than self-sufficiency; Remy (Desmond Luis Edwards), whose building a gender-expansive costume collection (&#8220;Any pronouns,&#8221; Remy says by way of introduction. &#8220;Still figuring that out&#8221;); Caroline (Amelia Fei), whose excitement over her first (offstage &#8211; and jealous) boyfriend isn&#8217;t quite shared by her new friends (in one musical number, they wave red kerchiefs at his mere mention, an unexplained &#8220;red flag&#8221; joke that prompted a couple seconds of audience silence before an eruption of laughter); Jessica (Ashley Wool), a blunt-spoken 22-year-old who dreams of leaving home, craves reliable public transportation and has a barely disguised crush on Tommy; Marideth (Madison Kopec), the youngest and most socially withdrawn of the group who longs to join in but more often than not retreats into the safety of facts found in her beloved textbooks.\n\nAnd finally there&#8217;s Drew (Liam Pearce), the college-bound math and engineering whiz already feeling the pressure of an away-from-home academic life that he might not be ready for or even want. Upon his acceptance to the University of Michigan, he sings, &#8220;Trust what they say/Trust that they know/Just because I got in/Does that mean I have to go?&#8221;\n\nOver-spicing this cauldron of so many hopes and fears is Amigo (Come From Away&#8216;s Caesar Samayoa), whose well-meaning if a bit pushy intentions betray both a doctor&#8217;s savior fantasies and his narcissism. His meddling in Drew&#8217;s college plans, his grasping to old school (literally) notions like prom kings and queens and even the pressures of asking dates will seem ever so vaguely toxic to his young clients (and to the audience) long before the scales fall from his eyes.\n\nAmigo&#8217;s emotional short-sightedness is given a sub-plot in which his Juilliard student, ballet-dancing daughter Ashley (Cristina Sastre) returns home with a dance injury. The forced time-out from her studies has her reconsidering a professional path that was all but chosen for her when she was too young to object. She&#8217;s not too young anymore.\n\nIn the musical&#8217;s most unnecessary (and tedious) excursion into Dr. Amigo&#8217;s self-centeredness, he agrees to give interviews to a local blogger (Carlos L Encinias) and newspaper reporter (Melina Kalomas), knowing full well that the last thing his autistic clients need is the pressure of a public spotlight. He takes his selfishness, or, to put it more kindly, neediness, on display when he interprets the reporter&#8217;s professional inquiries for romantic interest, completely misreading the intentions of a woman whose fiance&#769; Julia waits for her at home.\n\nSamayoa is a fine actor with a terrific singing voice, but any storyline attention on his Dr. Amigo is storyline attention snatched from the younger cast, and their characters are where our interests and hopes lie. There are a couple musical numbers handed to the adults &#8211; the parents, the doctor &#8211; that work fine, including the mostly comic &#8220;The How-To&#8217;s&#8221; and, especially, the poignant duet ballad &#8220;Getting Ready For The Dance,&#8221; in which two mothers (Violet&#8216;s Haven Burton, Once on This Island&#8216;s Darlesia Cearcy) beautifully share the tangle of emotions felt by parents who lovingly accept their autistic children while being unable to completely abandon old hopes of sharing the simple pleasures &#8211; prom shopping, young love &#8211; they themselves once knew but fear their daughters will miss.\n\nBurton and Cearcy bring something else to the show, too: The full-throated vocal polish of experienced Broadway belters. The writers and director are wise to hand over a big musical number to these two singers: They provide a crucial balance to the occasional amateurism &#8211; as charming, enthusastic and endearing as it is &#8211; delivered by some of the newcomers.\n\nThe score lends the cast only occasional help. In addition to &#8220;Getting Ready For The Dance,&#8221; the two best numbers are the anthems &#8220;Waves and Wires&#8221; and &#8220;Building Momentum,&#8221; both performed by the terrific Pearce&#8217;s science wunderkind Drew. &#8220;Building Momentum,&#8221; especially, might well find its way into the audition repertoires of many young stage hopefuls, its ready-for-the-world lyrics perfectly suited to the melody&#8217;s driving intensity.\n\nLittle else in the rather earnest, standard-issue score matches those three songs (a few others come close), even as all are presented with the help of the show&#8217;s top-notch creative team. Robert Brill&#8217;s set design, making clever use of moveable ladder-shaped rigs that stand in for any number of furniture pieces, is as efficient as it is attractive, and the grid-like backdrop, suggesting both crossword puzzles and those old dance floor step patterns, works beautifully with Bradley King&#8217;s lighting design.\n\nAlso of note: Sarafina Bush&#8217;s costume design nails the workaday clothes of youth, delineates individual style and, perhaps best of all, celebrates, in the spring formal scene, the joyful, if not always strictly tasteful, interpretations of adulthood made by young people determined to express themselves. (Bush makes only one mistake, but it&#8217;s a fairly big one, and contributes to the sense of let-down near the end: Surely the fearlessly flashy, defiantly of-the-moment Remy deserves a better Big Reveal than the stale Broadway-kid Halloween costume handed him. Something from this century would be nice.)\n\nWith so much going for it, How To Dance In Ohio is all the more frustrating for its failure to hit the cathartic high notes of emotion promised throughout but never delivered. Mayte Natalio&#8217;s choreography might end up taking some of the blame &#8211; like the kid&#8217;s DIY mirrorball that hangs over the dance floor, the show&#8217;s actual dancing is determinedly in line with the limited experience of characters who have never so much as dreamed of making themselves vulnerable in a way as public as a dance spotlight. But Natalio&#8217;s instincts are right, and if audiences expecting a Dancing With The Stars finale are disappointed, well, deal with it.\n\nNo, the let down is really the fault of a book that relies on easily predictable personal triumphs &#8211; shells will be broken, invitations extended, bad boyfriends dumped, all not a moment before or after you&#8217;d expect. And as loving and sweet-natured as Cannold&#8217;s direction is, it, and the show, is destined to live in the inescapable shadow of that Tony-winning musical populated with othered teens also demanding independence and dignity in a world not of their making. Kimberly Akimbo, that perfect show just a block away, raised a bar that How To Dance In Ohio just can&#8217;t limbo past. It&#8217;s not fair, but its the type of challenge Dr. Amigo&#8217;s clients would accept.\n\nTitle: How To Dance In OhioVenue: Broadway's Belasco TheatreDirector: Sammi CannoldBook & Lyrics: Rebekah Greer Melocik, inspired by Alexandra Shiva's documentary Music: Jacob YanduraCast: Desmond Luis Edwards, Amelia Fei, Madison Kopec, Liam Pearce, Imani Russell, Conor Tague, Ashley Wool, Caesar Samayoa, Cristina Sastre, Haven Burton, Darlesia Cearcy, Carlos L Encinias, Nick Gaswirth, and Melina Kalomas.Running time: 2 hr 30 min (including intermission)\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nI actually really liked How To Dance in Ohio over Kimberly Akimbo.\n\nThank you for this review! As an autistic adult, I think I was just too old to appreciate this show. If I were still in high school, I think I would have loved it because “representation” was enough back then. Nowadays, I look for substance as well.\n\nI am a bit ashamed to admit that I loved Kimberly Akimbo more than H2DIO. I know that Seth from Kimberly Akimbo is not explicitly stated to be autistic, but I felt that he portrayed a neurodivergent character much better than the majority of actors in this show. (with the exception of Connor Tague).\n\nRemy&#8217;s costume is a tribute to the late, great Hal Prince. Hal was working on &#8220;How to Dance in Ohio &#8221; when he passed, and they wanted to make this subtle bow to his indelible mark on the show.\n\nAlso, as the parent of a patient of the real Dr. Amigo, I&#8217;d recommend you watch the documentary. You would see why Dr. Amigo has his patients ask others to the dance. It was not borne out of old-fashioned ideas or ego, but a teaching tool to show these young adults how to interact in a world that&#8217;s often times scary to them.  Our own child can relate to the pressures of going to a formal dance and the social challenges of being accepted in the quite modern culture of dances and prom kings and queens.\n\nPeople on the spectrum haven’t made peace with their outsiderdom and the fact that you suggest that or have this as one of your takeaways from the show frustrates me because it’s a narrative that neurotypical people like to put on people on the spectrum. The show is about finding connection, taking that next step in your life. Just because we are different doesn’t make us an outsider, neurotypical society classifies us as such. We build our own niches because the current world is not accepting of who we are.\n\nDeadline is a part of Penske Media Corporation. &copy; 2025 Deadline Hollywood, LLC. All Rights Reserved.",
  "isFullReview": true,
  "dtliExcerpt": "“One of the things ‘How To Dance In Ohio’ gets so splendidly right is the easy comfort with diversity these young people with autism are graced, as if they’ve long ago made peace with the very concept of outsiderdom.”\n\nRead more",
  "originalScore": null,
  "assignedScore": 85,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 2244,
  "archivePath": "data/archives/reviews/how-to-dance-in-ohio-2023/deadline-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:30:55.134Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "CAPTCHA detected (premium_proxy)"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "partial",
  "truncationSignals": [
    "has_footer_text"
  ],
  "textStatus": "partial",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250722180434",
  "archiveOrgUrl": "http://web.archive.org/web/20250722180434/https://deadline.com/2023/12/how-to-dance-in-ohio-review-broadway-1235658895/",
  "scoreSource": "extracted-strong-positive",
  "scoreConfidence": "medium",
  "extractedPhrase": "raves"
}