{
  "showId": "how-to-dance-in-ohio-2023",
  "outletId": "lightingandsoundamerica-com",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.lightingandsoundamerica.com/news/story.asp?ID=-AMLNAW",
  "publishDate": null,
  "fullText": "How to Dance in Ohio puts its best foot forward, bringing its young lead performers onstage for a quick pre-show talk and, instantly, you grasp the show's rationale: They're the most winning bunch of talents you're likely to see all year, and at least one of them looks to be a breakout star. The point is proven in the opening number, \"Today Is,\" which deftly introduces a septet of protagonists, each of them living with autism in an often-uncomprehending world. Composer Jacob Yandura and lyricist Rebekah Greer Melocik swiftly, mordantly detail the daily toll that comes from being different: Getting ready in the morning, one of them obsesses over soap that smells like fruit; another carefully inventories his list of winter wear (in the right order, of course); a third, getting on a bus, has to rustle up the nerve to ask for the front seat, the only spot where she feels comfortable. Each day is an obstacle course; just getting out of the house can be a struggle. As they succinctly note: \"Going places/I am going places/There are places I need to be/But most of the spaces/That I want to get to/Were not designed for me.\" It's the most promising start to any new musical I've seen all year. Making it even more interesting, this musical about young people on the spectrum is played by young actors on the spectrum, a concept that pays big dividends thanks to their bright personalities and abundant musical theatre skills. There's more good news: Not long into Act II, the clinical psychologist who works with them is quizzed by a pair of reporters who wonder if, in organizing a \"spring formal\" for his socially awkward clients, he isn't pushing them beyond their obvious boundaries. He responds with the heart-piercing \"Terminally Human,\" in which he makes the case that, like anyone else, they can't be forever protected from the everyday pains of living. (\"We're putting our hopes and hearts on the line/Hoping our hearts don't break/But sometimes hearts break.\") In the more-than-capable hands of Caesar Samayoa, we understand anew what these kids are facing; don't be surprised if your heart quietly breaks. Between these moments, however, How to Dance in Ohio struggles with a multiplicity of characters and plot lines, often seeming unsure of where to place its focus. It's the rare musical that gets better as it goes along -- the second act is vastly superior -- and you will look long and hard before you find a show as warm and openhearted. But for a considerable chunk of its running time, it cradles its fragile characters a little too assiduously, affirming them so insistently that drama is left to the supporting characters. It is, in many ways, a touching, even groundbreaking, piece of work, but it would have benefited from another round of workshops or an additional out-of-town tryout. In a way, the problem is an excess of generosity; Alexandra Shiva's documentary reportedly focuses on three characters while Melocik's book gives us no fewer than seven; it takes an entire act just to just to get them squared away. They all belong to a support group run by Dr. Emilio Amigo (Samayoa), and are, alternately, thrilled, challenged, and terrified at the idea of attending a prom-like event. Dates aren't necessary -- although at least one tentative romance is set in motion -- but intensive coaching is required in seemingly routine matters like selecting an outfit, learning to dance, and making small talk. It's impossible not to root for one and all as they progress -- one step forward and two steps backward -- toward the big night out. Perhaps because they're also the central figures in the film, the standout characters are the reclusive, fact-obsessed Marideth (Madison Kopec, hiding her anxiety behind a Wednesday Addams façade); Jessica, desperate to move out of her mother's house (Ashley Wool, delivering such conversational bits as \"I'm reading this new romance novel at night called Dragons of Desire. It's good for stress release\"); and Caroline (Amelia Fei, bubbly in her rainbow-hued ensembles), who can't stop obsessing over her new boyfriend. All three are delightful but others get lost in the shuffle, including Desmond Luis Edwards as winsome, plus-size, probably queer Remy, dreaming of being a costume designer; Imani Russell as nonbinary, animal-loving Mel, bucking for a promotion to head of reptiles at the pet store where they work; and Conor Tague as Tommy, bent on getting his driver's license in time for the dance. Not to be ignored under any circumstances is Liam Pearce as Drew, a genius when it comes to electrical engineering; a floppy-haired beanpole with a face that registers emotion like a seismograph and a voice that reaches the second balcony with ease, he makes what may be the Broadway debut of the season. He also benefits from the lovely \"Under Control\" in which Drew, a bit of an academic star, muses about the pressures he faces. It's typical of How to Dance in Ohio, however, that Drew's plot line, which involves whether he should attend school in Ohio or Michigan, centers on a relatively trivial decision, the stakes of which are never made clear. (What's wrong with Ohio State? Nobody ever says.) Drew's choice also triggers one, but not the only, example of Dr. Amigo's unprofessional meddling, which includes letting himself be duped by a reporter who grinds out a sob story that leaves everyone humiliated and dispirited. Indeed, Dr. Amigo's problems -- his lovelorn post-divorce state and conflicts with daughter Ashley (a charming Cristina Sastre), whom he is pushing into a career as a ballerina -- too often steal focus at the expense of Caroline, Drew, Merideth, and the others. Their situations are unique and captivating; his troubles feel clichéd and manufactured. The book also suffers from strange gaps: Caroline goes through a full emotional cycle regarding her boyfriend, begging the question of why he remains offstage. (I was convinced for a time that he was imaginary.) The actors playing worried parents barely get enough stage time to make any impression at all. The songs often capture the nervous, tentative way the characters struggle with the small upsets -- schedule changes, cars that don't arrive on time, too much sensory information -- that can radically undermine their feelings of security; the lyrics offer a window into their carefully guarded feelings, the results of so many accrued hurts. Melocik and Yandura are good at expressing everyone's concerns in highly individual terms. The melancholy \"Drift\" tracks what happens when Merideth's intensive studying -- she lives for fact-filled geography books -- is disrupted by unexpected feelings for Drew. Similarly, the first-act finale \"Waves and Wires\" voices Drew's anxiety about the upcoming dance, using the electrical terminology with which he is conversant. And \"Building Momentum,\" in which Drew races to rescue the dance after a false start, is a real rouser. Sammi Cannold's staging is as smooth as the book is bumpy, aided by Mayte Natalio's choreography, which feels utterly true to characters who don't have a lot of slick movement in them. Robert Brill's set, backed by a grid partly filled with electrified letters, makes good use of sliders and a turntable to keep the action moving at the fastest possible clip. Bradley King's relatively restrained lighting directs your eye with unfailing accuracy, and the sound design by the debuting Connor Wang is exceptionally crisp and clear -- aided, no doubt, by Bruce Coughlin's lively orchestrations. Costume designer Sarafina Bush has carefully crafted a specific look for each of the young people, especially Caroline, who loves rainbow patterns, and Remy, who creates a new fashion theme each day. How to Dance in Ohio, which proudly displays its heart on its sleeve, is loaded with charmers but it sometimes coasts on our affection for them. Even as the sluggish first act gives way to a second with some real emotional heft, it's hard not to notice how much the action mirrors that of the 2018 musical The Prom, which didn't quite make it despite a better-constructed book. (It also recalls the 2008 show 13, which had a great score but a book with major focus problems.) Easy to love, it will nevertheless need the goodwill of an audience willing to overlook its first-act muddle. Here's hoping. --David Barbour Lighting&Sound America, 372 Central Park West #19C, New York, NY 10025 USA Tel: 212-244-1505 www.lightingandsoundamerica.com LSA@lsamedia.com",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1399,
  "archivePath": "data/archives/reviews/how-to-dance-in-ohio-2023/lightingandsoundamerica-com--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:31:44.593Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}