{
  "showId": "how-to-dance-in-ohio-2023",
  "outletId": "theaterscene-net",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://www.theaterscene.net/musicals/broadway/how-to-dance-in-ohio/joseph-pisano/",
  "publishDate": null,
  "fullText": "Posted on December 12, 2023 by Joseph Pisano in Broadway, Musicals The cast of the new musical “How to Dance in Ohio” at the Belasco Theatre (Photo credit: Curtis Brown) Prior to the start of How to Dance in Ohio, the musical’s seven exuberant leads run out for a quick introduction, letting us see them before we see their characters. It’s a thoroughly delightful encounter that suggests an extraordinary self-assurance, especially considering that all of these young-adult actors are making their Broadway debuts. Like their characters, they are also autistic, and, if their initial collective poise surprises the audience in this regard, too, then it’s just the start of necessarily and profoundly upending expectations. Based on an identically titled 2015 HBO documentary by Alexandra Shiva, How to Dance in Ohio, in its musical form, works best whenever that magnificent seven is completely together onstage and falters mightily if none of them are present. Their characters’ bond comes courtesy of Dr. Emilio Amigo (Caesar Samayoa), a psychologist–in both real and theatrical life–who specializes in social therapy for autistic people. To assist them in the closing stage of their adolescent development, Dr. Amigo’s creative approach is to hold a spring formal, a traditional rite of passage that, of course, generally produces a lot of anxiety even if you’re not neurodivergent. Through the voice of Marideth (Madison Kopec), the newest and most studious member of the group, Rebekah Greer Melocik’s high-minded book makes sure to point out this hoary event’s gendered baggage, though simply as an annotation rather than as the basis for any intriguing character conflict. Caesar Samoyao as Dr. Emilio Amgio (center) and the cast of the new musical “How to Dance in Ohio” at the Belasco Theatre (Photo credit: Curtis Brown) That happens often in How to Dance in Ohio, with Melocik, who also wrote the show’s lyrics, consistently bypassing natural dramatic opportunities in favor of contrived ones. Most frustratingly, Melocik again leaves the engaging Kopec hanging, as key details about Marideth’s life–a dead mother and grieving, financially struggling father–have little storytelling payoff. Besides a discussion about maternal loss between Marideth and Dr. Amigo (her therapist!) never taking place, the not-so-competent doctor, in another egregiously thick-headed oversight, doesn’t express an iota of concern about the cost of attending a spring formal for those who might not be able to afford it, though, for Melocik, poverty apparently only means having to buy your gown at Dress Barn rather than at Macy’s (perhaps telling everyone to shop at the latter also helps a new musical get a number in the Thanksgiving Day parade). There is a not-poor Marideth in the documentary, whose mother is also indisputably alive and a strong, impassioned force in her daughter’s efforts to understand a world that usually won’t respond in kind. Whereas Shiva prominently features familial interactions, demonstrating how a loving home makes a huge difference in the life of an autistic person, Melocik deemphasizes parenting, with the most prominent nurturing spotlight falling on two moms, Johanna (Darlesia Cearcy) and Terry (Haven Burton), who sing (Jacob Yandura composed the infrequently catchy music) about being able to, at long last, experientially connect to their respective daughters Caroline (Amelia Fei) and Jessica (Ashley Wool) by preparing them for the spring formal (they should have a conversation with Marideth about the problematic history they’re perpetuating). Madison Kopec as Marideth (center) and the cast of the new musical “How to Dance in Ohio” at the Belasco Theatre (Photo credit: Curtis Brown) In fact, parenting even receives a bit of a drubbing in the musical through a couple plot threads: engineering genius Drew (Liam Pearce) is pressured by his folks, and eventually, Dr. Amigo–in what seems like therapeutic malpractice–to accept admission at his dad’s alma mater, while, in his own fraught family circle, Dr. Amigo can’t respect that his Julliard-matriculated, ballerina-offspring Ashley (Cristina Sastre) no longer wants to pursue her dancing dreams (who cares?). As for his autistic clients, the recently divorced Dr. Amigo causes potentially unforgivable harm by subjecting their planned spring formal to degrading journalistic coverage in order to score a date with an attractive reporter (Melina Kalomas). To say the least, Melocik’s Dr. Amigo is a troubled man possessing questionable professional ethics, which doesn’t square with the admirably benign Dr. Amigo from the documentary. Perhaps Melocik believed that a specific human antagonist was more compelling than an existential one, leading her to depict Dr. Amigo as a jerk. And perhaps there are times when artistic license is just unfair. That’s true in another sense, too, as Dr. Amigo’s pathetic dating habits and domestic turmoil sucks up time that should be devoted elsewhere in the production–like, you know, those immediately appealing actors we met at the beginning. Rather than getting Melocik’s full attention, they, unfortunately, have to make due with slim script pickings pulled out of the teen-comedy recycle bin: Marideth and Drew struggle to acknowledge their feelings for each other; Caroline’s controlling boyfriend threatens her friendship with Jessica; Remy (Desmond Luis Edwards) likes cosplay and the internet (um, where are Remy’s parents?); Mel (Imani Russell) works at a pet store for an insensitive boss (Carlos L. Encinias) who, for some reason, promotes her anyway; and Tommy (Conor Tague) wants to drive his brother’s truck. It’s not much for this talented bunch to portray, but they give it their all, doing a particularly captivating job of emotionally putting across Melocik and Yandura’s score with far greater depth than the lyrics deserve (eat your heart out, Patti LuPone!). The cast of the new musical “How to Dance in Ohio” at the Belasco Theatre (Photo credit: Curtis Brown) Director Sammi Cannold mostly guides the musical with pep-rally verve on Robert Brill’s conceptually messy set, an energy that is occasionally deflated by Mayte Natalio’s poetically somber choreography. But everyone is on the same page for the spring formal whose charm derives from looking like one, with a mélange of awkward dancing styles that suggest nothing but joy. It’s too bad, though, that Melocik didn’t give us the thoughtful and empathetic Dr. Amigo from the documentary, who reminds us that the goal of fully including autistic people in society also means welcoming them to new disappointments and pain. That sort of complexity will have to wait for a different musical. How to Dance in Ohio (through February 11, 2024) Belasco Theatre, 111 West 44th Street, in Manhattan For tickets, call 212-239-6200 or visit http://www.howtodanceinohiomusical.com Running time: two hours and 30 minutes with one intermission",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textWordCount": 1080,
  "archivePath": "data/archives/reviews/how-to-dance-in-ohio-2023/theaterscene-net--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T14:41:42.067Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "possible_mid_word_cutoff"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright"
}