{
  "showId": "the-lion-king-1997",
  "outletId": "daily-herald",
  "outlet": "Daily Herald",
  "criticName": "Marni Pyke",
  "url": "https://www.dailyherald.com/entlife/20221121/the-pride-of-broadway-returns-with-purrfect-the-lion-king",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "A strong Broadway in Chicago cast spins a sizzling Lion King from Ramsey's gravitas to the feistiness of Jaylen Lyndon Hunter, one of two actors playing young Simba. As the adult Simba, Darian Sanders grabs control of the narrative the minute he swings onto stage. He conveys the pain and self-doubt racking the character, but balances it with that sense of humor that makes Simba arguably Disney's best hero. Civic Center Of Greater Des Moines - Des Moines, IA DC Felton, BroadwayWorld: What makes \"",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LION-KING-Tour-Roars-Back-to-the-Stage-What-Are-The-Critics-Saying-20211026",
  "contentTier": "complete",
  "fullText": "Few musicals can twist your heart then make you laugh at fart jokes minutes later. But that's the tragicomic splendor of Disney's “The Lion King,” back in Chicago through Jan. 14 at the Cadillac Palace Theatre. It starts with that look of wonder on a jaded 12-year-old's face as a giraffe glides elegantly toward the presentation of Simba, followed by an elephant galumphing down the theater aisle. Then enchantment flips to unease as majestic King Mufasa (Gerald Ramsey) confronts his fratricidal brother Scar (Peter Hargrave). A strong Broadway in Chicago cast spins a sizzling Lion King from Ramsey's gravitas to the feistiness of Jaylen Lyndon Hunter, one of two actors playing young Simba. As the adult Simba, Darian Sanders grabs control of the narrative the minute he swings onto stage. He conveys the pain and self-doubt racking the character, but balances it with that sense of humor that makes Simba arguably Disney's best hero. Sanders is paired well with Khalifa White, a luminous and touching Nala, in a “Can You Feel the Love Tonight?” that still feels fresh. For many, no Scar can match Jeremy Irons' charmingly evil film original. But Hargrave ably slinks and snaps his way to death by hyena, deserving eight out of 10 on the Jeremy scale. A measure of success in any Lion King is the shock factor induced in younger audience members when Scar betrays Mufasa, who falls to his death at the hoofs of stampeding wildebeests. This production didn't disappoint, meaning parents should consider advance warnings to blunt any trauma until Pumbaa and Timon deflect the darkness with a little scatology. John E. Brady delivers the ditsy wisdom and sweetness of Pumbaa, while Nick Cordileone as Timon is a meerkat with panache. For much of the performance, our attention is riveted on the actors' faces, but this Lion King offers moments of magic where our eyes lock with the amazing animal masks, as in the powerful “He Lives in You” scene between Simba and Rafiki. And just as we're owning Simba's rage and grief over Mufasa's death, Rafiki, a charismatic Gugwana Diamini, whacks him on the head and it's back to comedy, in true Lion King style. Often, a musical's ensemble cast is a bit of a blur. For instance, as long as Gaston and LeFou from “Beauty and the Beast” have chemistry, who's watching the drunken villagers in the tavern? The Broadway in Chicago ensemble is wonderful, making the small moments - like a cheetah pouncing - count, or riveting the audience with the grace and power of the lioness pack led by Diamond Essence White as Sarabi. Location: Cadillac Palace Theatre, 151 W. Randolph St., Chicago, broadwayinchicago.com. Group sales for 10 or more are available at (312) 977-1710. Showtimes: 7:30 p.m. Tuesdays, Dec. 20, Dec. 27 and Jan. 10; 2 and 7:30 p.m. Wednesdays; 7:30 p.m. Thursdays (no performance on Thanksgiving); 7:30 p.m. most Fridays with some matinees; 2 and 7:30 p.m. most Saturdays; 1 and 6:30 p.m. most Sundays through Jan. 14 Running time: About 2 hours, 30 minutes, including intermission Parking: In adjacent lots, check broadwayinchicago.com for discounts and parking in advance Rating: Recommended for all ages 6 and older COVID-19 precautions: Masks are recommended",
  "isFullReview": true,
  "textWordCount": 536,
  "archivePath": "data/archives/reviews/the-lion-king-1997/daily-herald--marni-pyke_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:41:01.664Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "wordCount": 536,
  "tierReason": "Full review text"
}