{
  "showId": "the-lion-king-1997",
  "outletId": "flyingthenest-tv",
  "outlet": "Unknown",
  "criticName": "Unknown",
  "url": "http://flyingthenest.tv/the-lion-king-musical-review/",
  "publishDate": null,
  "fullText": "During our time in New York City we knew there was one experience we could not miss &#8211; and that was to see The Lion King musical on Broadway. Read our review of one of the most popular musicals of all time.\n\nIf you have been living under a (pride) rock for the last forever I am sure you know exactly what the Lion King is about. The Broadway show is adapted from the 1994 Disney film of the same name with dialogue and music pulled directly from the movie.\n\nThe show debuted on Broadway just three years later in 1997 and has since gone on to win 6 Tony Awards, a Grammy and over 70 major arts awards. In September 2014 the show reached 7000 performances on Broadway and in 2011 two big Disney fan&#8217;s sat down to watch their first every Broadway show (hint &#8211; it&#8217;s us).\n\nThe story follows very closely to, if not exactly the same, storyline that you have come to love from overplaying your VHS-and-then-DVD copy of the movie. It&#8217;s beautifully realised on stage and it&#8217;s hard not to get engrossed in the play with characters walking past you in the aisles and clever uses of costumes to present the flora and fauna before you.\n\nIf you enjoyed the story of Simba the first time you saw it, you will enjoy it on broadway. The only downside to this is that you know it all &#8211; including the beats, the pauses and the twists &#8211; there are no surprises.\n\nCertainly one of the more intriguing parts of the play were the set pieces. The one area we always discussed prior to going into the show was about how they would do specific scenes on a theatre stage. One of the more pleasant surprises was the wildebeest scene which was a highlight of the production as it used a clever scrolling background and most of the cast to make it a very epic scene.\n\nThe costumes were very interesting and ranged from puppetry extensions to provide extra length to certain animals as well as giving grandiose masks to Simba and Scar to make them stand out.\n\nA flood of memories of our childhood rushed over when the lights went down and the opening howl of the Circle of Life roared through the theatre. It was hard not to sing along with all the classic songs and made our night very enjoyable as we could recite just about every lyric.\n\nYou know the performances were great when you started to forget that the cast were humans playing animals. It&#8217;s always a hard task for an actor to take the shoes of some of the most iconic characters &#8211; but we can report great acting and especially great singing.\n\nThere were a few notable differences to the movie including the changes of Rafiki to a female which was done to introduce a strong female character into the mix. There is also a new scene where Zazu and Musafa talks as well as a scene of Timon falling down a waterfall as Simba helps him out.\n\nCertainly the one difference to the movie that stood out was a scene involving Scar trying to make Nala his mate. This happens right before  she leaves pride rock and you see the scene of her bumping into a grown Simba [cue: Can you feel the love tonight].\n\nThe Lion King musical is a great starter drug to the theatre world as the familiarity can give you a very enjoyable night out. If you are a Disney fan or theatre fan it is hard not to recommend going to see the show. If you don&#8217;t like theatre &#8211; why not give it a try.\n\nPrice: $US162 per person for Row Q in the orchestra section.\n\nWe booked with Applause Broadway\n\nWho played who when we saw &#8216;The Lion King&#8217; &#8211; Rafiki (Tshidi Manye), Mufasa (Alton Fitzgerland White), Scar (Gareth Saxe) and Simba (Clifton Oliver).\n\nHave you seen any shows on broadway?\n\nREAD NEXT: PHUKET FANTASEA REVIEW\n\n[related_posts taxonomy=&#8221;category&#8221; numberposts=&#8221;6&#8243; minimum=&#8221;3&#8243; itemsmin=&#8221;1&#8243; itemsmax=&#8221;3&#8243; image_size=&#8221;thumbnail&#8221; carousel=&#8221;true&#8221;]",
  "isFullReview": true,
  "dtliExcerpt": null,
  "originalScore": null,
  "assignedScore": null,
  "source": "show-score-playwright",
  "dtliThumb": null,
  "needsScoring": true,
  "textStatus": "complete",
  "textWordCount": 682,
  "archivePath": "data/archives/reviews/the-lion-king-1997/flyingthenest-tv--unknown_2026-01-27.html",
  "textFetchedAt": "2026-01-27T04:32:10.874Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "CAPTCHA or access blocked"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": false,
      "error": "ScrapingBee error (404): Request failed with status code 404"
    },
    {
      "tier": 3,
      "method": "brightdata",
      "success": false,
      "error": "Access blocked in Bright Data response"
    },
    {
      "tier": 4,
      "method": "archive",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20181112132037",
  "archiveOrgUrl": "http://web.archive.org/web/20181112132037/http://flyingthenest.tv:80/the-lion-king-musical-review/"
}