{
  "showId": "the-lion-king-1997",
  "outletId": "gephardt-daily",
  "outlet": "Gephardt Daily",
  "criticName": "Van Valkenburg",
  "url": "https://gephardtdaily.com/local/review-the-lion-king-tour-brings-amazing-visuals-vitality-to-eccles-stage/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "The musical is renowned not only for its music, but for its vividly colored and innovative costumes, masks, and clever puppetry. Julie Taymor is the talent behind the original production and served as the director, costume designer and, with Michael Curry, as mask and puppet designer.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LION-KING-Tour-Roars-Back-to-the-Stage-What-Are-The-Critics-Saying-20211026",
  "contentTier": "complete",
  "fullText": "SALT LAKE CITY, Utah, Oct. 5, 2022 (Gephardt Daily) — Simba’s pride is back at the Eccles Theater with the return of a Utah favorite, Disney’s “The Lion King.” The African savanna springs from the Eccles stage, as giraffes — really actors on stilts and long-neck headdresses — saunter across the space they share with lumbering actor-elephant hybrids and trios of “antelopes” leaping, carried by dancers’ legs. The show, with music and lyrics by Elton John and Tim Rice and book by Roger Allers and Irene Mecchi, premiered in 1997, three years after the animated Disney film with the same name. The musical is renowned not only for its music, but for its vividly colored and innovative costumes, masks, and clever puppetry. Julie Taymor is the talent behind the original production and served as the director, costume designer and, with Michael Curry, as mask and puppet designer. But in this Broadway touring production, the stunning visuals share the spotlight with live music and masterful performances from actors who know how to keep an audience riveted. Gerald Ramsey plays the noble Musafa, who shows profound love for son Simba, and makes the audience feel the urgency of preparing a playful cub for the position that is his destiny. Ramsey’s clean movements and strong, clear voice are worthy of the hero he plays. Spencer Plachy plays the scheming Scar, Simba’s uncle, who is ready to sacrifice everyone he should love for a shot at being the herd’s leader. Plachy seems to ooze contempt, and his movements and even vocalizations seem villainous. We can’t help wondering if his slinking movements and suspicious side eye, visible both in his face and his mask suspended in his headdress, give him neckaches. Both Ramsey and Plachy sing with strong, unfaltering voices that serve their characters well. Juvenile Simba is played by Jaylen Lyndon Hunter, who alternates in the youth role with Jordan Pendleton. Young adult Simba is singer/actor/dancer Darian Sanders. Hunter, who played young Simba on opening night, has professional level skills, an easy and natural manner, and spot-on timing. And Sanders offers a great depiction of youthful uncertainty and rebellion giving way to maturity and conviction. Adding comedy exactly when needed is Nick LaMedica as the uptight yet flighty Zazu, a red hornbill who advises and serves the royal family. As is the case with most of the actors, he plays the character while operating the puppet version. Meerkat Timon and warthog Pumbaa, well played by Tony Freeman and John E. Brady, offer comic relief and play straight to the kids in the audience with jokes about flatulence and the delectability of grubs. And hyenas Shenzi, Banzai, and Ed, played by Martina Sykes, Forest VanDyke and Robbie Swift, split the difference between comedy and tragedy, deftly creating moments of humor and threatening tension. And if there’s one character whose voice pretty much defines “The Lion King,” that would belong to show opener Gugwana Dlamini as Rafiki the mandrill. It’s Dlamini’s voice on the Broadway cast album. The ensemble offers strong support for the story, acting, as needed, as a variety of animals, lion community members, a stampeding herd of wildebeest, and even as windswept grasslands. Quite a job description. “The Lion King” may have been through Utah a few times now, but it remains fresh, emotional and visually stunning. It’s one of few touring productions that Utah audiences will support for a multi-week run. But if you do want to see it, don’t wait too long to book your seat for the theatrical wild ride. The show runs through Oct. 23 at the Eccles Theater. For theater and ticket information, click here.",
  "isFullReview": true,
  "textWordCount": 607,
  "archivePath": "data/archives/reviews/the-lion-king-1997/gephardt-daily--van-valkenburg_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:41:44.762Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 607,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-06T09:08:58.426Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This is a review of a touring production at the Eccles Theater in Salt Lake City in 2022, not a Broadway production; openai: The review is about a Broadway touring production of 'The Lion King' at the Eccles Theater in Salt Lake City, not the current Broadway run.; kimi: This review covers a touring production at the Eccles Theater in Salt Lake City, Utah, not the current Broadway run in New York City.",
  "promptVersion": "5.2.0"
}
