{
  "showId": "the-lion-king-1997",
  "outletId": "kera-news",
  "outlet": "KERA News",
  "criticName": "Manuel Mendoza",
  "url": "https://www.keranews.org/arts-culture/2025-06-11/broadway-dallas-lion-king-review",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "An elephant tromping toward the stage is not something you see every day. Slinking giraffes either. Never has a show contained so much verticality. This ever-morphing menagerie manipulated by actors who also voice the characters almost constantly fills the theater, top to bottom, side to side. Southern Alberta Jubilee Auditorium - Calgary",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LION-KING-Tour-Roars-Back-to-the-Stage-What-Are-The-Critics-Saying-20211026",
  "contentTier": "complete",
  "fullText": "After a couple of hours of eye-popping pageantry, with occasional forays into storytelling, the visual and narrative elements of The Lion King finally come together near the end of the spectacular musical. From the start, design dominated the tour production of the runaway Broadway hit currently on display at the Music Hall at Fair Park. Presented by Broadway Dallas, it began on opening night with a parade of characters swooping up the aisles, including a gaggle of oversized puppets. An elephant tromping toward the stage is not something you see every day. Slinking giraffes either. Never has a show contained so much verticality. This ever-morphing menagerie manipulated by actors who also voice the characters almost constantly fills the theater, top to bottom, side to side. Unlike the economical original film version of The Lion King, clocking in at under 90 minutes, the stage adaptation takes its time, adding almost an hour without really expanding the story. Between the well spaced-out plot developments, the show indulges in one beautiful set piece after another. After a while, the effect can be numbing. So can the music. The show’s songs, primarily written by Elton John and Tim Rice, aren’t particularly memorable. There are just a handful in the movie, and the few added for the stage version don’t create much interest. The score relies heavily on music borrowed from Hans Zimmer’s film soundtrack. For stretches, The Lion King plays like a show aimed at impressionable children as adults wait for the story to move forward. Action sequences, such as an important chase scene, work better in the movie. The puppets can only simulate running a long distance by jogging in place. It’s not as satisfying as the breathtaking animated version. For the Disney-free, the plot isn’t too complicated: In an idyllic African setting, a wide variety of animals get along in a kind of utopia while acknowledging the “Circle of Life” that includes death at dinnertime. The title character Mufasa is preparing his mischievous son, Simba, to inherit the kingdom when the evil Scar cons the boy lion into exploring a forbidden area ruled by menacing hyenas. In Hamlet-like fashion, the king’s brother is planning to overthrow him. When that happens, Simba runs away and meets the show’s most interesting characters, the meerkat Timon and warthog Pumbaa, who provide comic relief while eventually leading him back to the Pride Lands and his rightful place on the throne. That’s when The Lion King finally reveals its potential, bringing together its considerable visual imagination with a somewhat satisfying conclusion to the story. Through July 3 at 909 1st Ave. $48-$170. broadwaydallas.org. Arts Access is an arts journalism collaboration powered by The Dallas Morning News and KERA. This community-funded journalism initiative is funded by the Better Together Fund, Carol & Don Glendenning, City of Dallas OAC, Communities Foundation of Texas, The University of Texas at Dallas, The Dallas Foundation, Eugene McDermott Foundation, James & Gayle Halperin Foundation, Jennifer & Peter Altabef and The Meadows Foundation. The News and KERA retain full editorial control of Arts Access’ journalism.",
  "isFullReview": true,
  "textWordCount": 511,
  "archivePath": "data/archives/reviews/the-lion-king-1997/kera-news--manuel-mendoza_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:31:09.314Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 511,
  "tierReason": "Full review text"
}