{
  "showId": "the-lion-king-1997",
  "outletId": "nystage-review",
  "outlet": "New York Stage Review",
  "criticName": "Steven Suskin",
  "url": "https://nystagereview.com/2018/09/17/the-lion-king-disneys-pride-still-rules-the-savanna/",
  "publishDate": "September 17, 2018",
  "fullText": "The Lion King was altogether awe-inspiring when it first stormed the Broadway savanna in 1997. The second of nine Disney-produced musicals to reach town (thus far), it stunned initial audiences who went in expecting a mundane, play-it-safe movie adaptation along the lines of the then-reigning Beauty and the Beast.\n\nBut no! Disney went out on a limb and hired a team of visionary artists—none of whom had much in the way of Broadway experience—and let them run riot. The Lion King—which competed directly with Ragtime, across the street, along with a crop of lousy musicals that season (The Scarlet Pimpernel, anyone?)—was astonishing, in the jaw-dropping manner of speaking.\n\nAnd today, 21 years later, it still is.\n\nThe show famously begins with \"Circle of Life,\" a grand parade of a number which summons a zoo-full of animals—mostly actors in body-puppets—from all corners of the auditorium and culminates in a breathtaking stage picture against a full-stage, tissue-paper-like hot African sun. A production number unlike any other, before or since. A good deal of the magic of The Lion King comes from the ability of director Julie Taymor and her team to provide—over the course of the evening—another five or six moments of this caliber.\n\nTaymor, the avant-garde director to whom Disney entrusted the piece, outdid herself. She was well met by her colleagues: Set designer Richard Hudson, lighting designer Donald Holder and choreographer Garth Fagan. Taymor herself designed the costumes, and collaborated on the masks and puppets with Michael Curry. True, her subsequent Broadway adventures—The Green Bird, M. Butterfly and the decidedly non-magical Spider-Man: Turn Off the Dark—have been less than auspicious. But one Lion King is magic enough for anyone.\n\nEverything still looks wonderful, and looks practically brand new, too. One of the stunning elements for me, this time through, was the realization of how brilliantly this show moves. Scenery, lights, costumes, puppets and dancers are constantly in motion, and the stage pictures remain vibrant. The score is strong at places and functional at others; while Elton John and Tim Rice receive top billing, a scouring of the program will uncover ten credited songwriters, which explains why the score is not of one piece. The book by Roger Allers and Irene Mecchi remains functional; most of the audience—which nowadays includes a large foreign contingent—walk in knowing the film inside out, anyway.\n\nPresently playing the show is the umpteenth replacement cast. The principals are highly proficient, with Ramon Reed (Young Simba), Adrienne Walker (Nala), Tshidi Manye (Rafiki), and Fred Berman (Timon) standing out. The hard-working ensemble is well-drilled and exceptional.\n\nAstonishing in 1997, and—yes—just as astonishing today. The Lion King took six Tony Awards when it opened, for Best Musical, director, scenery, costumes, lighting and choreography. Let it be said that if it opened this season or in most any of the intervening 20 seasons, Taymor and company would likely be honored again and again.",
  "isFullReview": true,
  "showScoreExcerpt": "'The Lion King' was astonishing, in the jaw-dropping manner of speaking. And today, 21 years later, it still is...Taymor, the avant-garde director to whom Disney entrusted the piece, outdid herself...Everything still looks wonderful, and looks practically brand new, too. One of the stunning elements for me, this time through, was the realization of how brilliantly this show moves...The hard-working ensemble is well-drilled and exceptional.",
  "originalScore": "5 stars",
  "assignedScore": 88,
  "source": "playwright-scraped",
  "needsFullText": false,
  "textStatus": "complete"
}
