{
  "showId": "the-lion-king-1997",
  "outletId": "on-stage-colorado",
  "outlet": "On Stage Colorado",
  "criticName": "Alex Miller",
  "url": "https://www.onstagecolorado.com/lion-king-returns-to-denver/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "There's not much I can say about this show that most don't already know, but as a first-timer, I can confirm that this one lives up to the hype surrounding the No. 1 musical of all time (it surpassed $8 billion in revenue in 2017, per Wikipedia). Somehow, though, despite being a super high-end production and an earnings juggernaut, the production now in Denver still came across as warm, authentic and presented by a cast that truly enjoyed doing it (this despite some of the cast having done liter",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LION-KING-Tour-Roars-Back-to-the-Stage-What-Are-The-Critics-Saying-20211026",
  "contentTier": "complete",
  "fullText": "Facebook EmailStellar production marks first Broadway show in town since pandemic startedDespite the fact that I saw the 1994 Disney film approximately 7,000 times when my kids were growing up, until now I’d somehow not gotten a chance to see the stage version of The Lion King. That changed this past weekend when my wife and I took our two granddaughters to see the touring Broadway production of the show, which runs through Jan. 2 at the Denver Center’s Buell Theatre.\n\nThere’s not much I can say about this show that most don’t already know, but as a first-timer, I can confirm that this one lives up to the hype surrounding the No. 1 musical of all time (it surpassed $8 billion in revenue in 2017, per Wikipedia). Somehow, though, despite being a super high-end production and an earnings juggernaut, the production now in Denver still came across as warm, authentic and presented by a cast that truly enjoyed doing it (this despite some of the cast having done literally thousands of shows).\n\nAt 6 and 9, my granddaughters represent what may be the prime demographic for the show, and it was a lot of fun to see how transfixed they were by the action on stage. Asked afterwards which was their favorite part, they responded in unison: “All of it!”\n\nWith music by Elton John and book by Tim Rice, The Lion King is quite faithful to the film plot-wise, albeit with the addition of a great many strong, catchy songs and musical numbers that remain with you long after you’ve left the theatre. What really distinguishes is, though, is the extraordinary costumes, puppets, moving set pieces and bespoke contraptions that contribute to a transformative journey to the world of the story. There’s something to look at in every corner of the stage at all times — including the two percussionists positioned on either side of the proscenium.\n\nI was fascinated in particular by the masks worn by King Mufasa and his evil brother Scar. They stayed above the actors’ heads most of the time, but when they wanted to really show their game face, they could shift their head down, whereupon the mask flips down to cover their face.\n\nObserving how each of the different characters and animals are rendered for the show is half the fun. One actor depicts three running antelopes with one atop their head and the other two moving in their hands. Giraffes have the actor on stilts, of course, but with a remarkably realistic articulated neck and head. The elephants, rhinos, wildebeests, birds and other supporting characters all represent the pinnacle of a costume designer’s craft — with the added complexity of puppet mechanics and other innovative gadgetry that does a great job at projecting realism while at the same time not attempting to hide the effect.\n\nThat’s all icing atop an overall topnotch production featuring a live orchestra; an impressive and highly skilled cast; huge, well-choreographed dance numbers that include light fighting in places; and, of course, all those powerful songs driving a classic narrative of growing up, redemption and revenge.\n\nAlex Miller is editor and publisher of OnStage Colorado. He has a long background in journalism, including stints as the top editor at the Vail Daily, Summit Daily News, Summit County Journal, Vail Trail and others. He’s also been an actor, director, playwright, artistic director and theatre board member and has been covering theatre in Colorado since 1995.\n\nFacebook EmailColorado’s No. 1 website dedicated exclusively to live performance\n\n© All rights reserved. • OnStage Colorado LLC\n\nShare via\nEmailShare via\nEmailSend this to a friendSendCancel \n\nNotifications",
  "isFullReview": true,
  "textWordCount": 605,
  "archivePath": "data/archives/reviews/the-lion-king-1997/on-stage-colorado--alex-miller_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:42:57.194Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "page.content: Unable to retrieve content because the page is navigating and changing the content."
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation",
    "has_footer_junk"
  ],
  "textStatus": "truncated",
  "sourceMethod": "scrapingbee",
  "wordCount": 605,
  "tierReason": "Full review text"
}