{
  "showId": "the-lion-king-1997",
  "outletId": "socal-thrills",
  "outlet": "SoCal Thrills",
  "criticName": "Maverick Bohn",
  "url": "https://socalthrills.com/lion-king-returns/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "The Lion King was able to deliver something fresh, fun, and surprising, yet something also familiar and timeless, paving a path to that very first viewing and bringing me right back to that seat all those years ago. Twenty years felt like twenty seconds, and without a doubt left me in awe to the very end. Orpheum Theatre Minneapolis - Minneapolis, MN",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LION-KING-Tour-Roars-Back-to-the-Stage-What-Are-The-Critics-Saying-20211026",
  "contentTier": "complete",
  "fullText": "This post contains affiliate links and our team will be compensated if you make a purchase after clicking on the links. “The king has returned” to Segerstrom Center for the Arts and is ready to begin a new reign with the triumphant arrival of Disney’s The Lion King. The crown jewel of Disney Theatrical’s long list of legendary productions, among the likes of Frozen, The Little Mermaid, and Beauty and the Beast, this production stands in a class all its own and proves once again that The Lion King is the true ruler of Broadway. Celebrating over two decades of unforgettable performances, The Lion King has never ceased to wow and amaze audiences the world over with ease. This show is by no means an exception, transporting me right back to where it all began with the rising of the sun over the African savanna. Old Rafiki is there to show you the way, guiding you through a production that encapsulates nothing but exquisite beauty and wonders through every fluid body motion, every fiber of fabric layered into each costume piece, every beat of the bongo drum as it echoes across the halls and up into the upper balcony. You will feel every laugh, cry, and cheer right from the very first note. This particular performance of The Lion King was a very personal one for me and created an experience that I’m certain will be shared with many who will have the opportunity to see it for themselves. Mukelisiwe Goba’s powerful rendition of the classic, “Circle of Life”, sent shock waves, transporting me to 2004 and resurfacing the memories of a starry-eyed high school student visiting San Francisco with their fellow pre-college program students to see their first Broadway production. That very first show set the gold standard for all other performances I would experience, and created an emotional connection to the brightest parts of my soul, a connection that once again was felt in full force seeing The Lion King at Segerstrom, delivering something so rare and precious in a world filled with countless forms of entertainment and nostalgic callbacks. The Lion King was able to deliver something fresh, fun, and surprising, yet something also familiar and timeless, paving a path to that very first viewing and bringing me right back to that seat all those years ago. Twenty years felt like twenty seconds, and without a doubt left me in awe to the very end. A lot can be said for this particular production, whether it be Gerald Ramsey’s Mufasa, evoking familiar feelings of triumph, joy, and ultimately sorrow, or Peter Hargrave’s chilling and charming rendition of Scar that crafts a performance that is “to die for”. They are not alone, as the dual performances of both Mason Lawson and Jaxyn Damasco as Simba and Nala alongside their adult counterparts, Darien Sanders and Khalifa White, were nothing short of spectacular. Sanders especially, ruled the stage, pouncing on every opportunity to bring the audience to a roaring applause. These standout performances are only lifted that much higher by an ensemble of truly gifted background performers and puppeteers that breathe life into the stage with their seamless movements and elegant displays of acrobatics, bringing the wild beauty of The Pride Lands front and center for all to enjoy. As one would expect from a Disney stage production, The Lion King also brings the entire songbook of Elton John and Tim Rice out to play with the classic favorites like “Hakuna Matata” and “Can You Feel the Love Tonight”, in addition to the Broadway ballads “They Live In You” and “Shadowland”. The Lion King takes nothing for granted, giving you everything you love from the original animated classic and generously gifting us so much more with a culturally distinct love letter to the African roots that allowed The Lion King to spring and take its place in the Great Circle of Life. The Lion King will play Tuesdays through Fridays at 7:30 PM, Saturdays at 2:00 PM and 7:30 PM, and Sundays at 1:00 PM and 6:30 PM, including Premium Ticket Packages, which include a prime seat location, a souvenir program and a cinch bag. Segerstrom will also partnering with CHOC to collect donations of new toys, games, and craft kits during each performance of The Lion King. CHOC donation bins can be found at the Orchestra level lobby and will help serve kids of all ages. Don’t miss your chance to take part in the one-of-a-kind magic of The Lion King and celebrate the return of Broadway’s best! You can visit Segerstrom’s official site for more details! Segerstrom Center for the Arts The Lion King February 1 – February 25, 2024 Segerstrom Hall Special Matinee: Thursday, February 1 at 2:00 pm Tuesday, Wednesday, Thursday, and Friday at 7:30 pm Saturday at 2:00 pm and 7:30 pm Sunday at 1:00 pm and 6:30 pm Box Office In person Box Office 600 Town Center Drive Costa Mesa, CA 92626 Monday 10am to 2pm Tuesday through Friday 12pm to 5pm Saturday and Sunday: Closed Phone: Monday – Friday 10am to 5pm (714) 556-2787",
  "isFullReview": true,
  "textWordCount": 851,
  "archivePath": "data/archives/reviews/the-lion-king-1997/socal-thrills--maverick-bohn_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:30:52.286Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "partial",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "partial",
  "sourceMethod": "playwright",
  "wordCount": 851,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-06T09:09:29.478Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review is about a production at Segerstrom Center for the Arts, not the current Broadway run.; kimi: This review covers the national tour production at Segerstrom Center for the Arts in Costa Mesa, CA (and mentions Minneapolis in the excerpt), not the current Broadway run at the Minskoff Theatre in New York City.",
  "promptVersion": "5.2.0"
}
