{
  "showId": "the-lion-king-1997",
  "outletId": "the-chronicle",
  "outlet": "The Chronicle",
  "criticName": "Howard Gollop",
  "url": "https://chroniclet.com/news/277497/theater-review-lion-king-returns-renewed-at-reopened-playhouse-square/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "As the saying goes, absence makes the heart grow fonder, but there may be more to the enjoyability of this \"The Lion King\" than a slogan: The cast and crew of 2021's \"The Lion King\" seem to try harder - and the audience seems to clap harder as well.",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LION-KING-Tour-Roars-Back-to-the-Stage-What-Are-The-Critics-Saying-20211026",
  "contentTier": "complete",
  "fullText": "\"The Lion King\" production that opened this week on Playhouse Square — which returns to life after an 18-month COVID-19 shutdown — is pretty much the same touring production that played in August 2019, a few months before the Playhouse Square lockdown.\n\nBut like the relit animated marquees of Playhouse Square, so does this once-tired production come roaring back to life.\n\nAs the saying goes, absence makes the heart grow fonder, but there may be more to the enjoyability of this \"The Lion King\" than a slogan: The cast and crew of 2021's \"The Lion King\" seem to try harder — and the audience seems to clap harder as well.\n\nThis tour is of course rooted in the 1997 Broadway version of \"The Lion King,\" which was in turn a breathtaking adaptation of the original 1994 Disney animated hit of the same name. Continuing at the KeyBank State Theatre on Playhouse Square, the musical stage version of \"The Lion King\" marked a unique departure for Disney's venture into the Great White Way in the 1990s.\n\nHere is a serviceable, ostensibly original children's tale about a young, impressionable and wily lion prince who discovers himself and his potential after losing his father and his African animal kingdom to evil Uncle Scar and his laughing — and singing and dancing — hyena cohorts. (The moral of the story, as noted by other critics, seems to be that it's better to be eaten by lions than hyenas.) But rather than put actors in heavy makeup and furry costumes for a live stage adaptation a la \"Cats,\" Disney decided to hire nationally acclaimed puppeteer and designer (and Oberlin College grad) Julie Taymor to helm the production.\n\nThe result of her unparalleled mastery of puppetry and costume design elevated what could have been a disposable Disney foray into Broadway — and there have been several of those, such as \"Tarzan\" and \"The Little Mermaid\" — into a Tony-winning megahit that still reigns on stages across the globe. It's one of the first touted post-COVID-19 returns to Broadway as well as return to Playhouse Square this fall.\n\nMost Broadway-savvy audiences know \"The Lion King\" is one of those mega-shows of the '90s where the visual climax comes well before the dramatic one. It majestically opens with the spectacle of human-operated antelope, giraffes, birds, zebras, et al. (not to mention a full-blown elephant literally in the room) parading down the aisles of the theater to the stage.\n\nAs the menagerie chorus sings Tim Rice and Elton John's \"The Circle of Life,\" marking the dawn of a new day and a new royal generation, the lion king lifts his kicking infant son before the rising sun. It's a mesmerizing tableau to behold. Not even the photo-real computer-generated film version of the musical from two years ago could replace this sensation. It's the exclusive domain of the theater.\n\nBut like the kingdom under the rule of the evil lion uncle, the show itself seems to dry up and wither. There really is no other dramatic sustenance to draw upon other than the original Disney animated movie. Despite a handful of new songs and music by various artists and authentic African sources (plus a fleshed-out rendition of the 1961 pop classic \"The Lion Sleeps Tonight\"), the on-stage \"Lion King\" starts to wallow in a rather pallid script by Roger Allers and Irene Mecchi.\n\nBut this time, the touring production, buffed up splendidly for a new tour schedule, seems to mitigate the show's pitfalls with exceptional precision and energy. Gerald Ramsey as King Mufasa, Spencer Plachy as the evil Uncle Scar, Darian Sanders as adult Prince Simba and Jalen Lyndon Hunter (alternating with Charlie Kahler) as young Prince Simba effect the kind of dimension that matches Taymor's multidimensional costumes. (In the last \"Lion King\" tour from 2019, the jokes and sight gags were pushed so broadly, even the many children in the audience might have been rolling their eyes.)\n\nAs for other aspects of the show, there are enough theatrical diversions to further triumph over the book, not the least of which is the choreography by Garth Fagan. But for all this production's attributes, nothing tops that opening vista of the African animal kingdom. It's an atmospheric triumph of set design by Richard Hudson and lighting design by Donald Holder, and an homage to the real star of the show, Oberlin alumnus Julie Taymor.\n\nThis time, the now legendary grand opening lets the audience know \"The Lion King\" and Playhouse Square are roaring back to life.\n\nContact Howard Gollop at howieeg@hotmail.com.\n\nWHERE: KeyBank State Theater, Playhouse Square\n\nWHEN: through Oct. 15 (times vary)\n\nINFO: (800) 801-7407 or (216) 640-8600\n\nDollar GeneralWe couldn't load this item. Please try again.",
  "isFullReview": true,
  "textWordCount": 787,
  "archivePath": "data/archives/reviews/the-lion-king-1997/the-chronicle--howard-gollop_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:47:52.323Z",
  "fetchMethod": "scrapingbee",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": false,
      "error": "Paywall detected - login may have failed"
    },
    {
      "tier": 2,
      "method": "scrapingbee",
      "success": true
    }
  ],
  "fetchTier": 2,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "scrapingbee",
  "wordCount": 787,
  "tierReason": "Full review text"
}