{
  "showId": "the-lion-king-1997",
  "outletId": "the-cap-times",
  "outlet": "The Cap Times",
  "criticName": "Sydney Vasquez",
  "url": "https://captimes.com/entertainment/theater/disneys-the-lion-king-still-rules-at-madisons-overture-hall/article_17750c4d-eb75-55cc-a1f1-737068cd0880.html",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "The costume and set designs are just as important to the story as the plot itself. Each animal that roams the stage is constructed and depicted differently. The birds are vaulted into the air as high-tech kites. Those who play giraffes are almost unrecognizable as people, as they're cradled within their costumes and vaulted by stilts. Gazelles are placed on the spokes of a rigged bicycle to mimic their frolic. Kennedy Center - Washington, DC",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LION-KING-Tour-Roars-Back-to-the-Stage-What-Are-The-Critics-Saying-20211026",
  "contentTier": "complete",
  "fullText": "Lionesses dance in \"Disney's The Lion King,\" which brings its national tour to Madison through May 28. Amid a colorful array of sculpted silhouettes, fluttering figures and organic sets, a story of kinship, perseverance and community once again graced downtown Madison. “Disney’s The Lion King” made its triumphant return to Madison this week, marking the third time the 1997 musical has hit the town since 2010. Rescheduled from the 2020-21 season, this production will hold residency in Overture Hall until May 28. The story begins with a young Simba, son of King Mufasa (Gerald Ramsey), being born into succession at Pride Rock where his newfound presence is welcomed by the iconic song, \"The Circle of Life.\" His upbringing is filled with love and curiosity, as he awaits the day that he will be crowned king. Darian Sanders plays Simba in the national tour of \"Disney's The Lion King.\" When Mufasa is killed at the hands of his brother Scar (Peter Hargrave), Simba flees, fearfully assuming that he will be blamed for the death of his father. He meets Timon, played by Nick Cordileone, and Pumbaa, played by John E. Brady, who take him in as their own to raise as a fellow outcast. Throughout the first act a young Jackson Hayes played a young Simba (Mason Lawson appears in alternating performances) before being miraculously transformed into the full grown lion that is played by Darian Sanders. Though young, the voice of a young Simba filled every crevice of the hall in songs such as \"Hakuna Matata.\" The performances elicited many roars of laughter from the audience, particularly songs like \"Chow Down\" and silly quips from the hyenas and Rafiki (Gugwana Dlamini). But the humor fell short with Pumbaa’s character, who seemed reduced to fart jokes and clumsy gags. Although the jokes were probably popular with a young audience, the character almost felt cheated. Peter Hargrave plays the villainous Scar in the national tour of \"Disney's The Lion King.\" The costume and set designs are just as important to the story as the plot itself. Each animal that roams the stage is constructed and depicted differently. The birds are vaulted into the air as high-tech kites. Those who play giraffes are almost unrecognizable as people, as they’re cradled within their costumes and vaulted by stilts. Gazelles are placed on the spokes of a rigged bicycle to mimic their frolic. In the execution of the puppets, the actors had to take some dramatic liberty in creating some of the magic. It appeared as though Pumbaa had a very active tongue controlled by the actor that contributed to a decent amount of his gags. Only the depictions of Timon and Mufasa's bird sidekick Zazu fell short — while the versatility of the puppeteers was impressive, it was distracting to be able to see them working the puppets. The revolving set is fitting for a circular story that ends where it began, with Gugwana Dlamini’s smooth and salty voice serenading the audience with \"The Circle of Life.\" After over a quarter-century on stage, it's clear audiences will keep coming back to \"Disney's The Lion King\" as well. Overture Hall, Overture Center, 201 State St. overture.org/tickets-events/2022-23-season/disney-s-the-lion-king Running time is 2 hours and 30 minutes. Recommended for ages 6 and up. Become a Cap Times member today and enjoy great benefits.",
  "isFullReview": true,
  "textWordCount": 555,
  "archivePath": "data/archives/reviews/the-lion-king-1997/the-cap-times--sydney-vasquez_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:47:18.708Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "playwright",
  "wordCount": 555,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-05T20:47:11.597Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "claude: This review is of the national touring production at Overture Hall in Madison, not the current Broadway production.; openai: The review is about a national tour of 'Disney's The Lion King' in Madison, not the current Broadway production.; kimi: This review covers the national tour production in Madison, Wisconsin, not the current Broadway run in New York City.",
  "promptVersion": "5.2.0"
}
