{
  "showId": "the-lion-king-1997",
  "outletId": "the-austin-chronicle",
  "outlet": "The Austin Chronicle",
  "criticName": "Richard Whittaker",
  "url": "https://www.austinchronicle.com/daily/arts/2022-04-12/review-the-lion-king-roars-strong/",
  "source": "bww-roundup",
  "sources": [
    "bww-roundup"
  ],
  "bwwExcerpt": "First staged only three years after the release of the 1994 animated classic, The Lion King will always be seen as original director Julie Taymor's production. It's driven by her melding of the film's Broadway-friendly tunes and family-friendly plot with her fascination with the extreme potential of the stage, her experience with and research into differing global puppetry styles, and culturally respectful approach (since inception, The Lion King has always had a predominantly Black cast). Yet t",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-THE-LION-KING-Tour-Roars-Back-to-the-Stage-What-Are-The-Critics-Saying-20211026",
  "contentTier": "complete",
  "fullText": "The imminent release of Robert Eggers’ bloody Viking epic The Northman is a timely reminder that the story of Hamlet is over a millennium old. The Lion King or Disney’s Hamlet on the veldt, is not quite that venerable, but after 25 years of constant productions and tours its cultural impact is undeniable. The story of Simba, the young lion whose father is slain by his uncle, forcing him into exile until he can return to his throne, eschews the mournful ending that attracted Shakespeare in favor of a theme that surprised audiences at the end. In amongst the fabulous set pieces, memorable show tunes (ever tried getting “Can You Feel the Love Tonight?” out of your head?), goofball comedy and grand set pieces, the metaphor of the circle of life, of responsibility and self-forgiveness, of sunrises and sunsets, has given it a vibrant life of its own. Y’know, plus Timon (Nick Cordileone in the Rafiki touring production currently at the Bass Concert Hall) and Pumbaa (John E. Brady) are one of animation’s all-time great comedy duos. First staged only three years after the release of the 1994 animated classic, The Lion King will always be seen as original director Julie Taymor’s production. It’s driven by her melding of the film’s Broadway-friendly tunes and family-friendly plot with her fascination with the extreme potential of the stage, her experience with and research into differing global puppetry styles, and culturally respectful approach (since inception, The Lion King has always had a predominantly Black cast). Yet the book by the film’s director Roger Allers and cowriter Irene Mecchi also plays a significant role in why the musical can run almost double the animated originator’s length. The inherent themes are amplified, most especially Mustafa’s frustrations with young Simba, and Simba’s guilt at his father’s loss. Still, not everything works, even in a production that has seen some trimming since its Broadway debut in 1997. The loss of the entertaining fluff of “The Morning Report” is arguably neither here nor there, but “Shadowlands” still feels overly-heavy and obvious, even in the darkest moments for the Pridelands. But some moments still give the story even greater power, most especially the rousing return of “He Lives in You,” the metaphorical resurrection of Mustafa in the heart and lineage of the lion who would (finally) be king. If anything, the shadow of Mustafa hangs longer over the stageplay, and his presence illuminates it even more, and not just in the show-stopping reveal of the giant spirit puppet version in the second act. In this production. Gerald Ramsay’s Mustafa is a muscular, regal presence, with an aspect of brute force to his performance that makes his demise at the claws of the ambitious Scar seem all the more riddled with despair. As the ambitious younger sibling, Spencer Plachy brings a pantomime dame vivacity that adds a grandiosity to Jeremy Irons’ original snide version of the sniveling insurrectionist. It’s in extended sequences with both that one of Disney’s great comic relief characters is given extra depth, and in turn adds poignancy and comedy to the overall production. In the cartoon, Zazu the Hornbill was a primping posh courtier, but now he’s much more the conscience of the king. The sequences between Jürgen Hooper (who makes excellent use of the rod puppet bird and the fourth-wall-breaking opportunities it allows) and Ramsay are gentle and charming, two old friends ribbing each other while the world isn’t watching. It’s the mirror image of Zazu quietly mocking Scar as he sits on his throne of bones. That includes a Frozen joke at Disney’s own expense that’s a subtle reminder that “something for the adults” doesn’t mean “not suitable for children” and, yes, that means the old Out of Africa gag in the ebullient and colorful “I Just Can’t Wait to be King” still lands. It’s in that song that the younger member of the casts get to truly shine, with Jalen Lyndon Hunter capturing the boastful energy of the cub Simba, playground fighting with Scarlett London Diviney as young Nala. In turn, Darian Sanders captures that energy in a different manner as the boy-king in exile, brought back from his hakuna matata exile by Kayla Cyphers as the more nuanced stage version of Nala. But what was always important about Taymor, Allers, and Mecchi’s version of this story is that those performances are set against a spectacular background of motion and color, where characters can be basically human with makeup, a full-body costume, or an entire herd of antelope powered by a penny farthing-esque contraption. A quarter century on, there are still few productions that have so boldly embraced scale and experimentalism at the same time. This article appears in April 8 • 2022. A note to readers: Bold and uncensored, The Austin Chronicle has been Austin’s independent news source for over 40 years, expressing the community’s political and environmental concerns and supporting its active cultural scene. Now more than ever, we need your support to continue supplying Austin with independent, free press. If real news is important to you, please consider making a donation of $5, $10 or whatever you can afford, to help keep our journalism on stands. The Chronicle's first Culture Desk editor, Richard has reported on Austin's growing film production and appreciation scene for over a decade. A graduate of the universities of York, Stirling, and UT-Austin, a Rotten Tomatoes certified critic, and eight-time Best of Austin winner, he's currently at work on two books and a play. More by Richard Whittaker",
  "isFullReview": true,
  "textWordCount": 922,
  "archivePath": "data/archives/reviews/the-lion-king-1997/the-austin-chronicle--richard-whittaker_2026-02-05.html",
  "textFetchedAt": "2026-02-05T16:46:40.023Z",
  "fetchMethod": "playwright",
  "fetchAttempts": [
    {
      "tier": 1,
      "method": "playwright",
      "success": true
    }
  ],
  "fetchTier": 1,
  "textQuality": "truncated",
  "truncationSignals": [
    "no_ending_punctuation"
  ],
  "textStatus": "truncated",
  "sourceMethod": "playwright",
  "wordCount": 922,
  "tierReason": "Full review text",
  "wrongProduction": true,
  "rejectedAt": "2026-02-06T09:09:47.634Z",
  "rejectedBy": "ensemble-scoreability-check",
  "rejectionReason": "wrong_production",
  "rejectionReasoning": "openai: The review discusses a touring production at the Bass Concert Hall, not the current Broadway run.; kimi: This review explicitly covers the 'Rafiki touring production currently at the Bass Concert Hall' in Austin, not the current Broadway run.",
  "promptVersion": "5.2.0"
}
