{
  "showId": "tuck-everlasting-2016",
  "outletId": "nytimes",
  "outlet": "New York Times",
  "criticName": "Charles Isherwood",
  "url": "http://www.nytimes.com/2016/04/27/theater/review-tuck-everlasting-a-lyrical-meditation-on-life-death-and-immortality.html?_r=0",
  "source": "bww-reviews",
  "sources": [
    "bww-reviews",
    "show-score-playwright",
    "bww-roundup"
  ],
  "bwwExcerpt": "Family-friendly musicals on Broadway generally come in just one flavor: flashy. Enter 'Tuck Everlasting,' a warm-spirited and piercingly touching musical that has nothing flashy or splashy about it...Mr. Nicholaw does let loose in a couple of rousing numbers led by the show's mysterious villain, a carnival worker, with high-kicking dancers swirling and strutting across the stage...But he also evinces a natural feel for the tender emotional core of the material and even its layers of mildly dark philosophical inquiry...'Tuck Everlasting' rings a variation on the fountain of youth myth, ultimately asking what life would mean if it never ended, and whether a never-ending life would be worth living. It also provides an answer in the enthralling, wordless climax, a ballet that depicts, with moving clarity, what another, much-celebrated musical would call the circle of life.",
  "bwwScore": 8,
  "contentTier": "complete",
  "bwwRoundupUrl": "https://www.broadwayworld.com/article/Review-Roundup-TUCK-EVERLASTING-Opens-on-Broadway-Updating-LIVE-20160426",
  "showScoreExcerpt": "\"A warm-spirited and piercingly touching musical…Nicholaw evinces a natural feel for the tender emotional core of the material…The rather complicated story is cleanly shaped in Ms. Shear and Mr. Federle’s book…'Tuck Everlasting' can sometimes be a little ham-handed in addressing its central theme...Among the many refreshing surprises of 'Tuck Everlasting' is this reminder that a musical doesn’t necessarily have to sing or speak its truths to bring them home to us.\"\n\nRead more",
  "fullText": "https://www.nytimes.com/2016/04/27/theater/review-tuck-everlasting-a-lyrical-meditation-on-life-death-and-immortality.htmlShare full article2020Advertisement\n\nFamily-friendly musicals on Broadway generally come in just one flavor: flashy.\n\nEnter “Tuck Everlasting,” a warm-spirited and piercingly touching musical that has nothing flashy or splashy about it. The nearest this small-scale production comes to the kind of spectacle we associate with kiddie bait is a toad hopping across the stage.\n\nBased on the popular children’s book by Natalie Babbitt, the musical, which opened on Tuesday at the Broadhurst Theater, has been deftly adapted by Claudia Shear (“Dirty Blonde”) and Tim Federle and features a winning, varied score by Chris Miller (music) and Nathan Tysen (lyrics).\n\nA little surprisingly, the show is directed and choreographed by Casey Nicholaw, who specializes in the kind of musicals “Tuck Everlasting” very much is not: the razzle-dazzly “Aladdin”; the exuberantly vulgar “The Book of Mormon”; and last season’s anything-for-a-laugh Elizabethan spoof, “Something Rotten!” (Remarkably, he now has four musicals running on Broadway.)\n\nMr. Nicholaw does let loose in a couple of rousing numbers led by the show’s mysterious villain, a carnival worker, with high-kicking dancers swirling and strutting across the stage; you can almost feel his delight in getting to flex the muscles he’s most often used. But he also evinces a natural feel for the tender emotional core of the material and even its layers of mildly dark philosophical inquiry.\n\nYes, I did just use the phrase “philosophical inquiry” in reference to a Broadway musical aimed at the family crowd. “Tuck Everlasting” rings a variation on the fountain of youth myth, ultimately asking what life would mean if it never ended, and whether a never-ending life would be worth living.\n\nIt also provides an answer in the enthralling, wordless climax, a ballet that depicts, with moving clarity, what another, much-celebrated musical would call the circle of life. (The musical “Tuck Everlasting,” incidentally, hews more closely to the book than the 2002 Disney movie, and Disney is not involved in the production.)\n\nWe are having trouble retrieving the article content.\n\nPlease enable JavaScript in your browser settings.\n\nThank you for your patience while we verify access.",
  "isFullReview": true,
  "textWordCount": 345,
  "archivePath": "data/archives/reviews/tuck-everlasting-2016/nytimes--charles-isherwood_2026-02-06.html",
  "textFetchedAt": "2026-02-06T19:39:44.757Z",
  "fetchMethod": "archive",
  "fetchAttempts": [
    {
      "tier": 0,
      "method": "archive-first",
      "success": true
    }
  ],
  "fetchTier": 4,
  "textQuality": "full",
  "truncationSignals": [],
  "textStatus": "complete",
  "sourceMethod": "archive",
  "archiveOrgTimestamp": "20250426204001",
  "archiveOrgUrl": "http://web.archive.org/web/20250426204001/https://www.nytimes.com/2016/04/27/theater/review-tuck-everlasting-a-lyrical-meditation-on-life-death-and-immortality.html?_r=0",
  "wordCount": 345,
  "tierReason": "Full review text"
}